{"jobID": "2745264330", "jobLocation": "San_Francisco_CA", "jobTitle": "Sr. Data Analyst", "companyRating": "4.6", "companyInfo": {"Website": "www.checkr.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "125000", "jobDescription": " The Sr. Data Analyst plays an important role at Checkr as an analytical partner to business and product owners, by providing easy access to data, guiding strategic decision making, and enabling them to make data-informed decisions and product improvements. Reporting to our Director of Data Strategy, this team member will work with Product, Engineering, Data Operations, and Legal teams to define internal metrics and drive improvements in the performance and accuracy of Checkr’s data enabled solutions.  Team and provides an analytical partnership to business and product owners to make data-informed decisions, provide easy access to data, and guide strategic decision making. Responsibilities:Develop actionable reporting, analysis, and core metric dashboards to help business and technical teams discover insights and increase understanding of our products and servicesBuild & maintain data visualizations that empower decision making using tools such as Looker, Tableau, etc.Scope and manage ad hoc analytic projects driven by the needs of the business such as cost-modeling, quality analysis, and other ad hoc analytic projectsHelp train and educate co-workers on SQL, data visualization tools, and contribute to Checkr’s data informed cultureReconcile data between various systems, find opportunities to innovate, and drive improvementsWhat you bring:College degree in analytic field; or technical discipline3+ years of applied analytic experience in a fast-paced, business environment3+ years of experience with large complex data sets from various sourcesStrong knowledge of SQL and relational databasesExperience with BI tools like Looker or TableauExperience with scripting languages like Ruby or PythonProven track record of collaboration with a variety of decision makers to drive impactExcellent written and verbal communication skills, and organizational & project management skillsWhat you get:A fast-paced and collaborative environment where we leverage the latest technologyHands-on coaching and professional developmentCompetitive compensation and opportunity for advancement – a true meritocracy100% medical, dental and vision coverageUnlimited PTO policyGym membership, transportation reimbursementsCatered lunch, dinner, and snacks"}