{"jobID": "2705946036", "jobLocation": "Murray_Hill_NJ", "jobTitle": "Bell Labs Summer Intern in Data Science", "companyRating": null, "companyInfo": {"Website": "www.nokia.com", "Headquarters": "Nokia, Finland", "Size": "10000+ employees", "Founded": " 1865", "Type": " Company - Public (NOK) ", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " Ericsson-Worldwide, Huawei Technologies, Microsoft"}, "estimatedSalary": null, "jobDescription": "Help change the way people connect with the world…Bell Labs, the Nobel Prize winning research organization, is accepting applications for our competitive internship program. Multiple internship positions are available in our Data Science Research group in, Murray Hill, NJ. The selected candidates will be actively involved in the research aspects of developing and applying advanced machine learning and AI techniques and algorithms.Bell Labs defines Nokia’s technological and architectural vision for the ICT industry, identifies the key challenges in this vision and invents solutions that are an order of magnitude (10X) better than existing solutions. It advises the industry on the economics of the vision​ and underlying technologies, and how best to transform to most efficiently achieve the goals. Driving thought leadership among customers and the industry strengthens Nokia’s role as a market leader and creator. ​​​​​​Discovering the possibilities that shape the human experience are at the heart of everything we do. Our interns will have the opportunity to learn from and work with world experts, and the best and brightest minds, who solve the most formidable networking and communications challenges confronting our world through disruptive innovation and research. Our researchers are continually massively scaling the capabilities of networks from the data center to the end device, to change the way we live and work, by inventing breakthrough technologies to make networks and systems faster, smarter and greener. As well as providing hands-on educational and collaborative experiences for a pool of talented and highly motivated students, our internship program will expand your field of study by exposing you to an unparalleled diversity of people, expertise and perspectives. In classic Bell Labs style, you will leave changed forever by an experience that will redefine your future. Some of the focus areas for our open positions include, but not limited to:Deep LearningActive LearningText Mining Pattern DiscoveryGraphical ModelsInteractive Machine LearningAutoMLTransfer LearningStudent Criteria:Overall GPA of 3.0/4.0 or above.Must be enrolled as a full-time student towards a graduate degree.Work Authorization: U.S. Citizen or Permanent Resident preferred. Will accept students on F-1 Visa dependent upon program requirements. Education Requested: Must be pursuing a graduate degree in Computer Science, Electrical Engineering, Mathematics, Statistics, or a similar quantitative field from an accredited college/university.Principal US location: Murray Hill, New Jersey."}