{"jobID": "2802525447", "jobLocation": "Sunnyvale_CA", "jobTitle": "Front Desk / Service Specialist", "companyRating": "3.6", "companyInfo": {"Website": "www.elementsmassage.com", "Headquarters": "Englewood, CO", "Size": "1 to 50 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Massage Envy, Massage Heights, Massage Luxe"}, "estimatedSalary": "14", "jobDescription": " Elements Massage Sunnyvale is the top rated massage in Sunnyvale on Yelp because we have a great team and we provide great service! We are looking for a bright, outgoing, friendly individual to join our team in a Front Desk Receptionist / Service Specialist role.  This job entails: Answering the phone and calling clients professionally and politely.Greeting clients in the massage studio and giving a great customer experience.Scheduling appointments and checking clients out with our software system.Listening to clients and matching them with the right massage therapist.Maintaining a clean, inviting studio atmosphere.Supporting operations to keep the massage studio running smoothly.Working with other Service Specialists and Massage Therapists to maintain a fun workplace.Selling massages, upgrades, and promoting our monthly Wellness Program. What we provide: A warm professional environment, with a great team to work with!Competitive pay, depending on experience.Earn extra commissions for Wellness Program sales.Free monthly massage, and discounted massage for friends and family.Training and proven processes to support your success.Variety in your work that is fun, challenging and rewarding.Potential for career advancement. Qualified candidates will have at least one year of sales and customer service experience in a retail environment, be a team oriented thinker and possess the ability to learn new computer software. Must be available on weekends. Elements is a smoke free work environment.  Come join a great company in one of the fastest growing segments of the wellness industry, apply today!Apply"}