{"jobID": "2827636271", "jobLocation": "New_York_NY", "jobTitle": "Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.tcs.com", "Headquarters": "Mumbai, India", "Size": "10000+ employees", "Founded": " 1968", "Type": " Company - Public (TCSN) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Accenture, IBM, Infosys"}, "estimatedSalary": "104000", "jobDescription": " You will be part of a small team of experts responsible for the research and innovation of our current production and customer engagements. You will be instrumental in working closely with business and technical stakeholders, research colleagues, marketing and engineering groups in incorporating the essential tradeoffs within the models and take an active role in effectively communicating the recommendations to senior management. You are expected to be both a strong team player investing in the collective success of the whole team and be self-sufficient with an ability to thrive in an environment of autonomy amidst ambiguity.  Responsibilities: (1) Build analytics models to analyze and derive practical insights from large volumes of data that require the expertise of data analysis&generation; and feature engineering. (2) Design, develop and deploy state of the art, data-driven predictive models. (3) Develop optimization and simulation models to solve business problems using latest technologies in data mining, statistical modeling, pattern recognition, and optimization across the chosen industry and functional area. (4) Develop proofs-of-concepts and -technology to explore innovative analytics approaches. (5) Develop intellectual properties including patents and publications for analytics solutions / prototypes / products. (6) Advise clients&internal; teams on the right technology environment, analytic platforms and approaches to take in addressing complex, open-ended business problems. (7) Develop intellectual properties and publish papers in well-recognized conferences and journals.  Qualifications: (Please list all required qualifications) (1) PhD or MS or substantial experiences in highly quantitative fields. (2) Deep background in at least one of the following: Machine Learning, AI&Cognitive; Technology, NLP and Text Analytics, Numerical Optimization, Stochastic Simulation, and Behavioral Modeling and Simulation for BFS/Retail/Smart Cities. (3) The qualified candidate will have a proven history of driving critical research and development and developing in-depth analytical understanding of systems. (4) 13+ years applied experience devising, deploying and servicing statistical and machine learning models on massive datasets; extensive experience in wrangling data from its raw forms to a state suitable for application of advanced algorithms. (5) 3+ years hands-on experience in optimization modeling, simulation and analysis. (6) Fluent in using R, Python or equivalent statistical analysis software such as SAS, Matlab (7) Hands-on Experience with Apache Spark, NoSQL techniques and data acquisition tools.  At least 13 years of being a full time Data Scientist."}