{"jobID": "2829966379", "jobLocation": "New_York_NY", "jobTitle": "Digital Account Coordinator- NYC", "companyRating": "3.4", "companyInfo": {"Website": "www.berlinrosen.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2005", "Type": " Private Practice / Firm", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "47000", "jobDescription": " BerlinRosen, a leading strategic digital and communications firm, is seeking a Digital Account Coordinator to work on our digital advocacy team based in New York. This person will play a critical role in advancing numerous progressive causes and helping our clients win. You will primarily be focused on executing day-to-day coordination of projects including content creation, social media advertising, reporting, and managing internal and external communications to assure our team is anticipating our client’s needs and operating smoothly.  We’re looking for candidates who have previous experience on digital teams and understand the ever-changing industry and how digital platforms can help our clients advance social change.  This entry-level position requires past digital internships, campaign experience, journalism, or experience with social media management and content creation. Ideal candidates enjoy writing for online platforms and are up to date on best practices and trends in the space. The position is located in our New York City office. Excellent writing and organization skills are a must.  Job responsibilities will include: Day-to-day management and content creation of clients’ online channelsDevelopment of advertising campaigns and targeting for clientMetric reporting-back to clients on advertising, social media, and other digital campaignsTeam management of regular meetings, recurring tasks, and project deliverablesWorking across account teams to bring digital engagement best practices to a diverse array of clientsConducting audits and producing reports of our clients’ online work and analyzing results and metricsProactively proposing creative strategies for helping clients achieve their organizational goals—study a client’s goals and challenges and propose digital-based solutions Applicants should possess: A passion for online engagement and social mediaExperience with brand-management, electoral, issue-based or other fast-paced campaign environmentsA knack for identifying compelling contentExpertise with online and social media analytics—knowledge of which numbers matter most under different circumstancesFamiliarity and comfort with interdisciplinary work, where digital engagement is integrated with earned and traditional paid media; and the facility to work well with staff and clients that are less digitally-savvyAbility to handle multiple assignments at once, work quickly and meet deadlines in a fast-paced environmentAbility to work with a team to meet group objectivesFamiliarity with digital trends, current political, world, and economic news and events.A sense of humor! We are committed to building and maintaining a diverse staff, and recognize that its continued success depends on hiring and retaining high-quality creative professionals with a variety of backgrounds and experiences. Opportunities for advancement exist, and we are committed to helping all staff develop and grow. Women, people of color, and people with disabilities are strongly encouraged to apply.  JOB1004"}