{"jobID": "2700672784", "jobLocation": "Seattle_WA", "jobTitle": "Senior Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.kaplan.com", "Headquarters": "Fort Lauderdale, FL", "Size": "5001 to 10000 employees", "Founded": " 1938", "Type": " Subsidiary or Business Segment", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " University of Phoenix, Princeton Review, Capella Education"}, "estimatedSalary": "137000", "jobDescription": "Job TitleSenior Data Scientist-SeattleJob DescriptionJob DescriptionWe are looking for Senior Data Scientists to be part of the Metis Data Science Instructional Team. We seek individuals who love and excel at analyzing and visualizing data to solve important problems, are passionate about teaching others to be premier data scientists, and are fun to be around and work with. An ideal candidate should be quick to learn and adapt, care about design of simple, powerful, beautiful interfaces and visuals, love writing code, thrive in creative team efforts, and also have interests and passions beyond data science.  RESPONSIBILITIES  Metis Senior Data Scientists provide incredible and inspiring Data Science instruction; support the design and teaching of new products and courses and infuse their expertise into our business operations; and continually sharpen their skills through consulting and passion project explorations. Metis calls this approach our 2-1-1 Instructor Model. Teaching the Data Science Bootcamp (2 quarters of the year)  Metis Senior Data Scientists spend half the year co-teaching two 12-week bootcamps (20-24 students). On any given day, the amount of lecture time is 1-2 hours, and the remainder of the day is spent directly engaging with and coaching individually the students. Leading course discussionsProviding personalized support to studentsImproving the quality of our curriculumOffering career guidance and interview supportDeveloping & Teaching New Courses & Supporting Business Operations (1 quarter of the year)  Metis Senior Data Scientists spend about one-quarter of the year helping to create and teach new course offerings, as well as infusing our functional areas – admissions, marketing, careers, instructor recruitment – with their domain expertise. Creating new courses and/or enhancing existing coursesProviding data science training to corporationsInterviewing and providing feedback on applicantsSpeaking at events and conferencesWriting articles and blogsAssisting with instructor recruitmentSharpening Skills & Pursuing Data Science Passion Projects (1 quarter of the year)  Metis Senior Data Scientists spend about one-quarter of the year focused entirely on enhancing their skill set and building their data science knowledge in whatever way they choose. These three months are intended to be self-driven. Some ideas include: Consulting on pro bono data science projects (e.g., with DataKind)Providing in-house data science project expertise to specific companiesAuthoring a book related to data scienceEnrolling in data science classesWorking on open source passion projects IDEAL APPLICANT Has an exceptional background in at least two of the following three skill domains: Computer ScienceMath/StatisticsData Science/Machine LearningHas solid data science industry experiencePreferably has some teaching experienceHas excellent communication and listening skillsApproaches problems with a design perspectiveIs passionate about continuous learningDoes not take themselves too seriously PERKS OF THE ROLE Part of a team that is transforming educationThree paid months per year to sharpen skills and pursue passion projectsCompetitive compensation packageOpportunity to network and develop, both among Metis’ Data Science speaker community, as well as through Kaplan, the global educational company and parent company of MetisOpportunity to work in different geographic locations (currently NYC, Chicago and San Francisco)LocationSeattle, WA, USAAdditional LocationsEmployee TypeEmployeeJob Functional AreaInstructorsKaplan is an Equal Opportunity Employer"}