{"jobID": "2817007041", "jobLocation": "San_Jose_CA", "jobTitle": "Claims Adjuster", "companyRating": "3.1", "companyInfo": {"Website": "www.carlwarren.com", "Headquarters": "Tustin, CA", "Size": "51 to 200 employees", "Founded": " 1944", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "60000", "jobDescription": "About the CompanyCarl Warren is an employee-owned Third Party Administrator (TPA) with 165 employees and 20 locations across the country. We provide liability and property claims management and administration services to the private and public sectors, insurance companies and captives.At Carl Warren, we are committed to investing in our employees' development and providing a positive work environment where our employees feel valued. We are looking for a Claims Adjuster with 3+ years of experience handling auto property damage and bodily injury claims for public entities to join our team. This position can be located in either our San Jose or Concord office.AccountabilitiesDesk adjustment, to include communication with client’s employees, point of contact and file handling to the conclusion of assignments.Execute on client/Carl Warren strategies in order to achieve claims quality, customer service, and operational objectives.Work effectively with partners/subcontractors to achieve satisfactory results on both the expense and indemnity costs.Travel may be required.Could be called upon to perform additional duties, if needed.Requirements3+ years of experience handling auto property damage and bodily injury claims for public entities5+ years of litigation management experience with public entities is preferredField investigation experience preferredInsurance designation a plusBasic computer skills and knowledge of Microsoft applicationsHigh school degree or equivalent; college degree preferredWhy Work For Us?Competitive Compensation PackageComprehensive Benefits, to include Employee Stock Ownership Plan (ESOP), 401K, medical, dental, vision, life and disability, generous paid time off and holidaysEmployee Training ProgramsProfessional DevelopmentWork-Life BalanceFlexible HoursFamily-Like Work Environment"}