{"jobID": "1914734319", "jobLocation": "New_York_NY", "jobTitle": "Chief of Obstetrics and Gynecology", "companyRating": null, "companyInfo": {"Website": "www.pagny.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Overview Physician Affiliate Group of New York (PAGNY) is comprised of nearly 4,000 physicians and healthcare professionals who provide services to NYC Health + Hospitals, the largest public health system in the United States. Our practitioners are highly skilled professionals with outstanding credentials who deliver the highest level of quality healthcare to patients throughout New York City. NYC Health + Hospitals/Gotham Health, Sydenham is the hub of seven community based health centers conveniently located in central and west Harlem and northern Manhattan. These centers provide the full spectrum of care for children and adults. Our dedicated staff emphasizes primary and preventive care, working with you to help you achieve your health goals.  Our healthcare services include: Child Health Services; Mental Health Services; HIV/AIDS Testing; Treatment Pregnancy testing Well-child care; Dental services; Adolescent Health Services; Diabetes Care; Women's Health Services; Prenatal care; Cancer screening; Immunizations and more. Responsibilities The Chief of Obstetrics and Gynecology is responsible for assisting the Medical Director in planning, developing, directing, implementing and monitoring all Ob-GYN services and provides medical care to a panel of patients.  Provides daily on site supervision and management for Ob-Gyn service clinical and operations issues: Supervises and evaluates providers, residents and students.Provides oversight for scheduling coverage for all Ob-Gyn services and provides oversight for time and leave for Ob-Gyn providers. Responsible to maintain and monitor the network coverage and on call provider schedules.Develops and implements Ob-Gyn policies, procedures and forms to facilitate patient care needs. Coordinates CME and clinical training programs for Ob-Gyn providers.Assists the Medical Director in the selection of prospective employees.Develops clinical proposals to funding agencies and submits reports as determined by funders and management information systems reporting requirements.Develops and implements quality improvement projects and initiative for the RHCN Ob-Gyn service.Conducts chart reviews to facilitate, PI monitoring, Credentialing and peer review.Provides Ob-Gyn leadership representation on the Performance Improvement, Infection Control, PCMH, Pharmacy & Therapeutics, Patient Complaints and Grievances and Patient Safety Committees. Reports during these meetings on Ob-Gyn metrics and issues.Reviews data for the HHC QA Board reports and monitors the performance of Ob-Gyn providers.Monitors and provides feedback to providers regarding the Central Office Quality Assurance Committee indicators, FQHC indicator compliance, Patient Centered Medical Home requirements and QARR requirements.Completes Central Office reports.Monitors complaints and complements and provides feedback to the providers regarding their performance. Performs and investigation and initiates service recovery for any incidences related to Ob-Gyn services. Submits and implements corrective action plans regarding these issues. Represents the service on the Complaints and Grievances Committee.Participates as leadership in all surveys, audits (Article 28, DOH, FQHC), and QAC board reports. Develops, implements and ensures compliance with corrective action plans.Conducts timely annual performance evaluations of staff, including age specific competency standards.Serves as designee for the Medical Director on network and Central Office committees.Ensure that staff meet all compliance standards/requirements such as annual physical evaluation/assessment, five star training, Right-To-Know Training, Fire Drill Participation, Etc.Ensures Article 28, FQHC and PCMH compliance and readiness.Provides administrative support to the Medical Directors Office and performs other duties as assigned by the Medical Director.Reviews with the Medical Director the medical program needs in regards to education, consultation, outreach and advocacy.Promotes a positive and pleasant attitude conducive to the workplace, which enhances and furthers the Mission, vision and value statement.Responsible for enhancing your personal and professional development. Attendance at outside and NMN training sessions is expected.Responsible for wearing professional attire to the workplace as well as during off site work, when conducting business on behalf of the Northern Manhattan Network.Exhibits flexibility within the NMN, as it pertains to work assignment, work place, site designation and tour of duty.Adheres to the Vision/Mission/ and Value statement of the Organization in all endeavors and interactions.Ensures that policies and procedures are developed, implemented, reviewed and updated in order to ensure compliance with Article 28 standards, FQHC, Department of Health standards, and all other regulatory agencies.Ensures that the staff adheres to approved policies and procedures. Continuously assesses and improves performance of the Department and facility through Performance Improvement Activities by communicating to employees, gathering bench marking information, visiting other external facilities, attending conferences, conducting internal audits, etc.Provides direct care for a panel of patients for 8 sessions a week. The position would include an on call which would be 3 times per quarter. Generally, one weekend and two weeknights per quarter. Calls would be in-house at Harlem hospital. QualificationsPreferred Qualifications: 5 years Managerial/Administrative Experience, Quality Management and Population Health Experience a plus Required Qualifications: New York State License  NYS Registration  Appointed to the Medical Staff in OB-GYN  Board Certified in Obstetrics and gynecology EOE M/F/D/V"}