{"jobID": "2738865007", "jobLocation": "San_Francisco_CA", "jobTitle": "Software Engineer Intern - Consumer, Backend (Summer)", "companyRating": "4.5", "companyInfo": {"Website": "www.coinbase.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "113000", "jobDescription": " The Consumer team at Coinbase is focused on building the easiest and most secure way for people around the world to invest in cryptocurrencies. We take on hard engineering problems to build delightful user experiences and to keep our users investments safe.  Youll have the opportunity to build features that help users manage their portfolio, add new assets and help Coinbase expand to new countries to make cryptocurrencies more accessible. If youre excited by the problem spaces of designing and delivering engaging user experiences, and building trustworthy financial systems, we want to talk to you!  A little about our team: were a multi-disciplinary product team with experts in frontend, backend, product and design. We care deeply about our tools - weve built out a React based frontend, have continuous integration with multiple daily deploys, and are working on decomposing our rails API backend into smaller, encapsulated services. We value positive energy, continuous learning, and clear communication and are committed to building an inclusive environment for people from every background.  Responsibilities Adding new features to the frontend Coinbase.com product (i.e. support for viewing your portfolio gains & losses over time)Building new API features that are used in our mobile apps (i.e. algorithmic suggestions to help customers buy or sell digital assets at the best times)Decomposing our Rails monolith by building logically contained microservices (i.e. an exchange rate service thats used across many applications) Requirements Currently enrolled and pursuing a Bachelors, Masters, or PhD in Computer Science, Software Engineering, Computer Engineering, Electrical Engineering, Mathematics or a related fieldHave some programming experience (in a class, for fun, at a job) -- most of our systems are written in Ruby and JavaScript, but experience with either is not a strict requirement.Enjoy thinking about how people interact with products and building experiences that users loveSelf-motivated and committed to personal growthApproach problems with positive energyWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}