{"jobID": "2738000236", "jobLocation": "New_York_NY", "jobTitle": "Growth Marketing Intern", "companyRating": null, "companyInfo": {"Website": "www.artsy.net", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Artsy is looking for talented Growth Marketing interns to help support our ongoing marketing initiatives.  As a Growth Marketing intern, you will work directly with members of Growth team in order to develop and implement both organic and paid Growth marketing strategies to help Artsy achieve its vision. Centered around a critical piece of our organic growth strategy and providing critical support to paid marketing efforts, this internship is critical to enabling the Marketing team to reach wider audiences.  In addition to learning and executing organic and paid strategies, as Growth Marketing intern you will gain a broad understanding of marketing at a top technology company by interfacing with our CRM, data automation, communications, and social media teams. Finally youll develop both qualitative and technical marketing skills, including strategic research, data analysis and processing. Key Responsibilities:Execute and optimize organic growth strategies to support Marketing goalsCoordinate and provide support for paid ads across platforms, including Facebook, Instagram, Linkedin, Adwords, etc.Assist in reporting on organic and paid performance using tools such as Looker and Google Sheets/ExcelProvide critical support in maintaining the quality of our paid adsConduct research and provide support for the Marketing team at largeCandidate Qualifications:Technical/quantitative background or coursework, or, familiarity with or an interest in learning Google Sheets and ExcelExcellent written and verbal communication skillsExperience building things from the ground up and ability to work autonomouslyExcited to learn from, and contribute to, a top technology companyAll candidates must be currently based in New York City or be willing to relocate to NYC for this positionABOUT ARTSY"}