{"jobID": "2817025063", "jobLocation": "San_Diego_CA", "jobTitle": "Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.ameritconsulting.com", "Headquarters": "San Ramon, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "84000", "jobDescription": " In need of a Data Analyst who is able to create insights for clients and internal teams and managers on a variety of data sets. Our ideal applicant has a strong analytical nature with attention to detail and resourceful and pro-active problem solving. This position will enhance processes through building scalable data templates for efficient analysis. This is a 6 month contact position with benefits and potential to extend.  Job Duties:  - Manipulate large sets of data, format information into usable reports and presentations  - Consult with Client Account Managers to provide client data requests and make appropriate recommendations  - Works well under tight deadlines and be flexible to support follow up inquiries  - Interpret and articulate data results for end users  - Examine and evaluate content of existing reports to develop new or improve format function  - Data mining and analysis on projects and provide insights  - Use problem solving skills to resolve data discrepancies  - Other duties as assigned  Qualifications:  - 1-2 years experience with SQL, quantitative data analysis, and reporting  - Bachelors Degree or equivalent in Business, Mathematics, Analytics, or Computer Science  - Demonstrate experience in analyzing data, reporting or developing insights  - Knowledge of Data Visualization techniques (Excel Pivots/Reporting)  - Strong analytical, logical, and organization skills with attention to detail  - Experience working with large datasets and complex relational data models  - Willing and self motivated to learn new technology  - Ability to work under tight deadlines and manage projects independently  Qualified candidates with criminal histories, are considered in a manner that is consistent with local, state and federal laws."}