{"jobID": "2783106139", "jobLocation": "Redondo_Beach_CA", "jobTitle": "2018 Technical Intern- AS PMO", "companyRating": null, "companyInfo": {"Website": "www.northropgrumman.com", "Headquarters": "Falls Church, VA", "Size": "10000+ employees", "Founded": " 1939", "Type": " Company - Public (NOC) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "The Aerospace Systems (AS) Information Technology (IT) Solutions Program Management Office (PMO) is looking for a summer intern to support the PMO team. We support engineers within Aerospace Systems with the software they need to do their jobs. This includes the purchase and maintenance of over 1,000 software titles, the strategy around what software tools to deploy to our engineers, major software platform upgrades, and funding the IT engineers that support that large software portfolio on a day-to-day basis.  We are looking for an intern to join us for the summer to help in a few key areas: Roadmaps & Documentation Assist with internal business roadmaps and process documentation Strategy Research Research and planning regarding internal mobile technology strategy, web based dashboards and metrics, resource planning tools (servers, apps, licenses), and network zoning (virtual labs, app vault) Data Analysis and Data Calls Interpret and evaluate large subsets of data to draw conclusions and provide metrics General Support Provide general support to the PMO teamBasic Qualifications:A student who is enrolled full time pursing a Bachelor's, Master's or PhD degree from an accredited college/university in Cyber Security, Cyber Engineering, Computer Science, Software Engineering, Computer Engineering, or Electrical & Computer Engineering or other related discipline.Be available to work 10-12 weeks this summer for 40 hours a weekPreferred Qualifications:Minimum GPA of 3.25or higherAbility to understand technical requests and identify process improvementCommunicates well with technical and non-technical staff across technology tools and within the business construct. Northrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit www.northropgrumman.com/EEO. U.S. Citizenship is required for most positions."}