{"jobID": "2766514385", "jobLocation": "Santa_Clara_CA", "jobTitle": "SEC/Technical Accounting Manager", "companyRating": "3.7", "companyInfo": {"Website": "www.marvell.com", "Headquarters": "Santa Clara, CA", "Size": "1001 to 5000 employees", "Founded": " 1995", "Type": " Company - Public (MRVL) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "143000", "jobDescription": "Marvell is a multi-billion dollar publicly traded global semiconductor company based in Santa Clara, CA, with operations around the world.  The Company has been growing by leaps and bounds with over $2B in annual revenues, $1.6B of cash on hand, and no debt – a very healthy balance sheet! Marvell has been going through substantial organizational change over the past 18 months. The new leadership team and Board have heightened focus and emphasis on embracing and encouraging organizational change to further the accounting organization’s laser focused goal – timely and accurate financial reporting, with effective processes and controls to support this. Most large public companies do not embrace or support change because they’ve been around a long time and continue to plod along with the same old routine, even if the routines, processes, controls, and systems are not optimal, or even good for the accounting organization. Marvell is the opposite – we want to hire smart, creative, energetic people who can help bring accounting best practices to the business.  Are you ready to join an organization where you have the opportunity to have a meaningful financial role, and know that you will be able to directly see the value you bring and positive impact you can make on a day to day basis?  Main Purpose of the Role  As a key member of the Technical Accounting & Financial Reporting team, the Accounting Policy Manager will be working in a fast-paced, dynamic environment building relationships within the accounting team and with the larger organization (e.g. Treasury, FP&A;, GL Accounting, Corporate Development, Internal Audit, etc.). The Accounting Policy Manager will be responsible for leading many aspects of technical accounting and financial reporting, including ensuring complex accounting transactions are recorded accurately and timely in the general ledger in accordance with US GAAP, and preparing the company’s financial statements and SEC filing disclosures. The Accounting Policy Manager will have full exposure to the 360 degrees of both internal and external financial statement reporting, and will be exposed to technical accounting research and utilizing problem solving abilities to research the accounting implications for new and unique business transactions.  This is an exciting role with vast educational opportunities, and great exposure to working directly with the senior leadership team (CAO, CFO, CEO).  Main Areas of Responsibility  • Support the Accounting organization with helping evaluate business activities to research technical accounting guidance, determine appropriate GAAP treatment, and prepare memorandums and global accounting policies.  • Provide input and support to drive the annual and quarterly SEC reporting process as well as internal financial reporting to the CFO, CEO and BOD.  • Prepare SEC financial reporting disclosures including financial statements, footnote disclosures, and operating metrics for SEC filings and for other internal and external financial reporting requirements.  • Responsible for helping drive monthly financial close activities, including journal entries and account reconciliations.  • Responsible for SOX compliance activities, including executing internal controls.  • Prepare various financial analyses.  • Develop and maintain excellent positive working relationship with the external auditors.  • Coach and mentor the junior staff on the team.Requirements • Accounting degree.  • CPA preferred.  • 6-12 years of accounting experience, with a minimum 3-4 years Big 4 public accounting base.  • Proficiency with Microsoft Excel, Word, and PowerPoint.  • Semiconductor experience a plus.  • An effective leader and team player who has excellent oral and written communication skills. Written analyses and presentations are clear, concise, and reflect polish and precision.  • A go-getter with a positive can-do attitude, sense of humor, and a roll-up-my-sleeves mentality: no ivory tower candidates need apply.  • Possess energy and passion for your work and a genuine interest in accounting and SEC reporting.  • Your ultimate priority is to help ensure that the organization has accurate and timely accounting and financial reporting.  • Highly accurate, thorough, with strong attention to detail and a strong sense of ownership. Someone who consistently goes the extra mile.  • A problem solver who is collaborative, proactive, responsive, and reliable.  • Agility to change and think on your feet.  • Creative person with strong interpersonal skills and ability to contribute to our culture.  • Takes a customer service oriented approach.  • Strong organizational skills."}