{"jobID": "2805420698", "jobLocation": "New_York_NY", "jobTitle": "Desire Ambassador - Terminal", "companyRating": null, "companyInfo": {"Website": "www.anotgexperience.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Restaurants, Bars & Food Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "ROLE AND RESPONSIBILITIES  Position Summary:  OTG DESIRE is an initiative that provides our customers with the best contemporary lifestyle hospitality brand by delivering superior service and product quality. The initiative seeks to increase loyalty between Customer and OTG with an emphasis on capturing opportunities for Customer High Value Customers. OTG Desire combines personality and lifestyle living with an infusion of energy and non-traditional luxury serving. Ultimately, the OTG DESIRE experience allows total convenience and comfort that only a full-service Concierge can offer.  As another step in our evolution to establish the OTG Brand, this innovation will be both distinctive and compelling while delivering on our brand promises. OTG Desire offers perfectly designed experiences for our High Value Customers coexisting in an environment that is fast, fun, yet warm & welcoming- providing an ongoing conversation about what it means, looks, and feels like to be comfortably plugged-in. Through OTG's signature service, the OTG Desire Concierge will greet every guest interaction with an authentice desire to make wishes come true. We will provide access to the best of the best making every OTG Restuarant a destination within a destination.  The Desire Coordinator is responsible for assisting the Desire Manager in assessing the guest's needs, while adding personal recommendations and touches to achieve maximum customer satisfaction. The perfect candidate as an OTG Desire Coordinate needs to support our leadership management to foster loyalty, integrity, commitment, and creative thinking.  Responsibilities:  - Able to develop and deliver perfect customer relations resolutions  - Consistently meet deadlines, determine priorities, and shepherd and develop projects  - Display diplomacy, creativity and innovative thinking  - Handle all guest requests in a professional and polite manner  - Have a proactive approach- build a relationship with guests and cultivate it, create an opportunity to speak to a customer prior to his/her arrival, seize it, and offer our concierge services to the fullest extnet  - Always follow through and master expetations, management, and conflict resolution  - Provide timely follow-up to Customer requests as promised/requested  - Be enthusiastic, a positive thinker, and set an example  - Act as an information specialist, inspect what we expect  QUALIFICATIONS AND EDUCATION REQUIREMENTS  Education:  - A degree in hospitality is preferred  Qualifications:  - 1 to 2 years of concierge or VIP host experience  - Hands-on with strong business acumen and polished presentation  - Have strong communication skills  - Show an innate abilitiy to tap into creativity  - Enjoy managing relationships  - Strong ability to multi-task  - Excellent organizational skills  - Must be creative, genuine, efficient, honest, and fun  - Have passion to make a difference and create memorable experiences  - Must evidence professionalism and adaptability  - Attentive to detail and demonstrate a high degree of accuracy  - Excellent interpersonal skills, positive attitude, and customer service oriented  - Able to handle confidential information and matters with discretion  - Self-starter with the ability to work with minimal supervision and guidance  - Proficient Mac/PC skills, including Microsoft Suite and Keynote  - Knowledge of foreign languages is advantageousHourly$15.00$15.00John F Kennedy International Airport, Jamaica, New York, United States of America Apply Now  See all jobs"}