{"jobID": "2796378927", "jobLocation": "Boston_MA", "jobTitle": "PATIENT TRANSPORTATION MANAGER", "companyRating": "4.2", "companyInfo": {"Website": "www.crothall.com", "Headquarters": "Chesterbrook, PA", "Size": "10000+ employees", "Founded": " 2001", "Type": " Subsidiary or Business Segment", "Industry": " Restaurants, Bars & Food Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "53000", "jobDescription": "We have an opening for a Patient Flow Manager position.Location: Boston, MA Note: online applications accepted only.Schedule: 10:00pm - 8:00am, Rotating weekendsRequirement: If you have a positive attitude and a love for learning, you may be interested in joining our team.  Crothall Healthcare, a division of Compass Group North America, provides customer focused support services. As specialists, we perform services including healthcare housekeeping, management in laundry processing, patient transportation, business facilities management and clinical engineering. Crothall is a compilation of the most committed and talented individuals working in the industry today. Our dedication to quality, exceptional customer service, and unequivocal results allow us to provide the best outcomes to our clients. Full time associates at Crothall are offered many fantastic benefits such as:MedicalDentalVisionFlexible Spending Accounts (FSAs)Commuter BenefitsWellness ProgramEmployee Assistance ProgramLife Insurance for Associates and Eligible DependentsShort Term Disability (STD) and Long Term Disability (LTD)Accidental Death & Dismemberment (AD&D;) InsuranceDiscount Marketplace401(k)And other voluntary benefits Job Summary Job Summary:Working as the Patient Flow Manager,you will be responsible for the effective leadership of a team of Patient Flow Coordinators and Transporters within a hospital setting. Key Responsibilities:Exhibits the ability to understand and apply knowledge of basic patient transport concepts, infection control practices, and proper body mechanicsUnderstands and is able to determine, explain, and develop dispatcher logic and transporter activities; monitors and supervises dispatcher activityAssists in coordination of Patient Transportation activities and services with other departments; develops service agreements as appropriateEnsures compliance with all regulatory agencies including but not limited to Federal, State, JCAHO, OSHA, and CDCOrients, trains, and develops all levels of personnel such as; dispatchers, trainers, transporters, couriers, drivers, and elevator operatorsMaintains a teamwork environment of highly motivated associatesAssists unit director in achieving financial objectives; ensures department operates within budget; assists controlling departmental expensesPreferred Qualifications:Two-year college degree or equal-related experience preferred; high school diploma/GED requiredManagement experience in hospital environment and/or patient transportation highly desiredEffective organizational and time management skillsAnalytical ability to interpret statistical data and to distinguish trends and other factors that impact operational activityExcellent judgment skills for problem solving of performance of associates’, the coordination of hospital activities, and enforcement of policies in stressful situationsExcellent interpersonal skills necessary; ability to interact with a wide range of staff and hospital personnel in a professional manner; customer service skills must be strong, genuine and noticeableEffective verbal, listening and written communication skillsBasic computer skills utilizing a Windows-based Operating System: ability to troubleshoot system problems related to computer or software systems and initiate internal or external resolution to system issuesMust be open to working a varied/flexible schedule  About Compass Group: Achieving leadership in the foodservice industry    Compass Group is an equal opportunity employer. At Compass, we are committed to treating all Applicants and Associates fairly based on their abilities, achievements, and experience without regard to race, national origin, sex, age, disability, veteran status, sexual orientation, gender identity, or any other classification protected by law.     Qualified candidates must be able to perform the essential functions of this position satisfactorily with or without a reasonable accommodation. Disclaimer: this job post is not necessarily an exhaustive list of all essential responsibilities, skills, tasks, or requirements associated with this position. While this is intended to be an accurate reflection of the position posted, the Company reserves the right to modify or change the essential functions of the job based on business necessity. *Los Angeles applicants: Compass Group will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box ordinance).    Req ID: 183667   SALARIED EXEMPT "}