{"jobID": "2728371063", "jobLocation": "San_Jose_CA", "jobTitle": "AR/VR Applied Research Intern", "companyRating": null, "companyInfo": {"Website": "www.sonyjobs.com", "Headquarters": "San Diego, CA", "Size": "10000+ employees", "Founded": " 1946", "Type": " Subsidiary or Business Segment", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Samsung Electronics America, Apple, Panasonic"}, "estimatedSalary": null, "jobDescription": " We look for the risk-takers, the collaborators, the inspired and the inspirational. We want the people who are brave enough to work at the cutting edge and create solutions that will enrich and improve the lives of people across the globe. So, if you want to make the world say wow, let's talk.  The conversation starts here. If this role matches your ambitions and skillset, let's get started with your application. Take a look at our other open positions too. Our many opportunities can lead to infinite possibilities.  Sony Electronics - US Research Center in beautiful San Jose, Ca. is seeking the best and brightest minds to work with our world-class engineering team. We have an exciting VR/AR Video Processing Engineer internship opportunity available and if you’re up to the challenge, we’d love to see what you’ve got. You will have the opportunity to work with Sony’s cutting-edge research team in multidisciplinary efforts for the development of future VR/AR technologies. We’re inventing the technology and products that go on to touch customer’s lives all over the world, and soon we could be working to bring your ideas to life.  Required Qualifications: Ph.D. candidate or Post-doc in Computer Science, Electrical Engineering, or a related fieldResearch background in the area of computer vision, computer graphics, machine learning, or image/video processing.Experience in 3D capture/modeling, multi-view 3D reconstruction, active sensing or image based rendering.Good familiarity with Matlab, Python or C/C++ for rapid algorithm prototyping.Excellent analytical and mathematical skills Preferred qualifications: Familiarity with VR/AR development platforms.Familiarity with Unity, Unreal Engine, Maya, or related graphic platforms. Sony Electronics is an Equal Opportunity Employer that values employees with a broad cross-cultural perspective. We strive to create an inclusive environment, empower employees and embrace diversity. We encourage everyone to respond. All applicants will receive fair and impartial treatment without regard to race, color, religion, sex, national origin, ancestry, citizenship status, age, legally protected physical or mental disability, protected veteran status, status in the U.S. uniformed services, sexual orientation, gender identity or expression, marital status, genetic information or on any other basis which is protected under applicable federal, state or local law.  We sincerely appreciate and thank you for your interest in Sony Electronics Inc.  For a complete list of Sony Electronics Inc. Job Opportunities visit:  www.sonyjobs.com  To view Sony Electronics Privacy Policy visit:  https://products.sel.sony.com/SEL/legal/privacy.html  Job Engineering"}