{"jobID": "2766015329", "jobLocation": "Boston_MA", "jobTitle": "Sr. Salesforce Business Systems Analyst", "companyRating": "4.4", "companyInfo": {"Website": "www.incapsulate.com", "Headquarters": "Washington, DC", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Acumen Solutions, Slalom, Accenture"}, "estimatedSalary": "77000", "jobDescription": "Who we are: Incapsulate provides services from conception to delivery. We are a team of developers, designers, and analysts who are committed to helping businesses solve problems using state-of-the-art technology. We believe that the best results are achieved by people who are passionate about what they do and continually strive to be better - those are the people we hire. Who We Are Looking For: Incapsulate is searching for a Senior Business Analyst to join our team in Boston, MA. You would be joining a group of skilled and passionate individuals working on a variety of interesting and challenging projects. Job Duties and Responsibilities:Working with clients to understand their functional and technical requirements to engineer solutions.Work with Project Managers and other key stakeholders to develop and document requirements in clear, accurate, and meaningful, manner.Implementation of CRM projects and/or business applications based on Salesforce technologies.Perform analysis and research in support of requirements definition.Prepare documentation using tools such as Lucidchart, Word and Excel.Perform document groom and size User Stories in Agile Management platforms such as JIRA or Rally.Prepare documents such as: BRD, solution diagram, use case list, process flows, functional design, wireframe, user stories, object description, training materials, and guides.Aid in identifying and implementing process improvements.Perform various testing and QA functions as necessary.Assist or lead users acceptance testing, change management, and user training.Play key part in system deployment.Design data migration plan and prepare data mapping.Travel to client sites as necessary.Qualifications:Minimum 7 years as a Business System Analyst.Minimum 7 years creating User Stories, Use Cases, Data Models, ERDs, and other relevant artifacts.Minimum 3 years experience in Salesforce both configuring sales, service, community clouds and custom Salesforce apps.Certifications preferred.Experience in solution design, database modeling, and working hand to hand with technical architect.Excellent analytical skills, as well as accuracy and attention to details.Ability to work in a fast pace environment and to work on multiple projects at a time.Ability to adapt to ever changing environments and situations.Excellent interpersonal, listening, oral and written communication skills.Ability to interact and communicate with individuals from all backgrounds and business levels.Advanced skills in MS Office with a particularly strong skill set in MS Excel.Experience with data querying and data mapping workExperience with Salesforce based 311 solutions is a big plus.Education: Bachelor’s degree in Engineering, Computer Science, or similar  MBA preferred Why you should contact us:This is a great opportunity for an individual who is looking for a fast paced, challenging environment, where you will experience something new each day.We offer continued growth within the company and a collaborative environment where you can share your ideas with other like-minded and passionate people.We understand that this is a two-way relationship and as much as you must be a good fit for us; we also must be a good fit for you. Note: If this position is not the best fit, we would still love to connect with you! Join our new group on LinkedIn, \"Incapsulate: Careers & Networking\" for access to our team and visibility to other opportunities. Incapsulate is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender, identity, national origin, disability or veteran status."}