{"jobID": "2819958367", "jobLocation": "San_Jose_CA", "jobTitle": "QA Automation Architect / Lead QA Engineer", "companyRating": "3.8", "companyInfo": {"Website": "www.careers-continental.com", "Headquarters": "Hannover, Germany", "Size": "10000+ employees", "Founded": " 1871", "Type": " Company - Public (CTTAY) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Michelin, Bosch Security"}, "estimatedSalary": "112000", "jobDescription": "About Continental With sales of €40.5 billion in 2016, Continental is among the leading automotive suppliers worldwide and currently employs more than 220,000 employees in 56 countries. Information management in and beyond the vehicle is at the very heart of the Interior division. The product portfolio for different types of vehicles includes: instrument clusters, multifunctional and head-up displays, control units, access control and tire-information systems, radios, infotainment systems, input devices, control panels, climate control units, software, cockpits as well as services and solutions for telematics and Intelligent Transportation Systems. The Interior division employs more than 43,000 people worldwide and generated sales of approximately €8.3 billion in 2016. Auto req ID 78313BR Job Title QA Automation Architect / Lead QA Engineer Country United States Posting Location San Jose, CA Job Description We are looking for an experienced QA engineer who can lead our test automation efforts for all products. This candidate will help design, implement, and maintain various automation frameworks across multiple products. This is an opportunity to work on life­changing Connected Car solutions, and ensure they function properly. Responsibilities:Mentor other QA engineers in understanding QA processes and strategiesCreate custom automated test frameworks from scratchEnsure high test coverage for products being releasedWork with developers to ensure their code is bug free Job Requirements Minimum Qualifications:"}