{"jobID": "2619775273", "jobLocation": "San_Jose_CA", "jobTitle": "Fire Alarm Design CAD – Engineer", "companyRating": null, "companyInfo": {"Website": "www.rfi.com", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Summary: Responsibilities include, but are not limited to: Create engineered drawings using AutoCAD design software and other tasks as assigned by the management. Duties:Design Fire Alarm systems to ensure complete system compliance, performance, and completion.Design Fire Alarm Systems based on scope of work as outlined in the Sales Contract while ensuring the design meets all applicable codes and standards.Participate in pre bid reviews along with site surveys to develop a clear understanding of the scope and magnitude of the project.Responsible for working with the RFI team for completion of preliminary construction and final as-built drawings to include system design, calculations, submittals, O&M;’s and other related documents as required by the customer and AHJ.Responsible for working with local AHJ’s on the required permits process utilizing the proper transmittal forms.Prepare and review plans, preliminary layouts, detailed drawings from engineering files, field and engineering notes, sketches, and/or other mark-ups, ensuring all CAD standards and in-house standards are utilized.Converts approved design development drawings into construction drawings incorporating design change, fire and low-voltage devices on floor plans, riser diagrams, point-to-point wiring diagrams, panel and equipment elevation layouts, field device details, and other fire device details and/or layouts.Plot, batch plot or publish the drawing set in CAD layout and/or in PDF.Obtain plans from Electricals, General Contractors, Architects, End User, Consultants, and Clientele. Download and upload via Submittal Exchange, Dropbox, SharePoint, Bluebeam and other equivalent Cloud Services. Education, Work Experience and Requirements: Bachelor’s degree in Engineering or related field and project management preferred. Ideal candidates will have 2+ years of fire alarm design experience or fire alarm industry and be at least a NICET Level II. Minimum of two years’ experience in CAD Drafting with proficiency in the use of Autodesk’s AutoCAD 2013 or latest version. Knowledge of architectural, Mechanical-Electrical-Plumbing and construction drawings. Siemens Fire Alarm experience and knowledge of BIM modeling is a plus. This position requires a valid driver’s license, clean driving record and insurance."}