{"jobID": "2740432372", "jobLocation": "Boston_MA", "jobTitle": "Market Research Data Manager", "companyRating": "3.8", "companyInfo": {"Website": "www.cmbinfo.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Lieberman Research Worldwide, Ipsos, Millward Brown"}, "estimatedSalary": "61000", "jobDescription": " Market Research Data Manager Voices of CMBTHE CHADWICK MARTIN BAILEY BLOGCheck it outOur ClientsWe work with amazing clientsCheck them outOur WorkInterested in learning more about what we do?Take a lookThe Data Manager will work on project teams to support project administration and data-related tasks. This includes vendor management, oversight of data collection, data cleaning, running analyses, and assisting with client deliverables (e.g., building tables, populating PPT reports).  Additionally, the data manager plays a critical role in onboarding associate researchers that are new to market research through formal trainings and on-project mentoring. A successful data manager will have a strong understanding of data structure and management, coupled with a propensity to quickly solve data-related challenges and learn new applications and programming languages.Responsibilities and ExpectationsClient Services TeamAdhere to “The CMB Way” (defined approaches, processes, best practices, etc.)Contribute to marketing CMB by writing a blog annuallyTake advantage of training and development opportunitiesContributes to a team and/or committee for ongoing CMB initiativesEnsure end-to-end client/project delivery in alignment with Sales & Account Management leading to high client satisfaction with project deliverablesEssential DutiesDirectly participate in the production and proofing of client deliverables (e.g., reports, presentations, tables)Independently manage and troubleshoot data collection, cleaning, and processing on projects with moderate complexityInterprets and troubleshoots results from higher level analyticsMost frequently serves as the Secondary Associate on quantitative projects, offering guidance and on-project mentoring to Primary AssociatesEffectively drives and owns relationships with vendors, project managers, peers, senior staff, and other teamsOwns training in at least one specific area or application within Data ManagementServes as a designated mentor to one new associate at a time (as needed)Successfully troubleshoot and provide solutions to various project and process problemsIdentify data related problems and develop hypotheses on what’s wrongParticipate in peer reviews in a timely mannerQualificationsMinimum of 3 years of relevant professional experienceBA/BS in a related field (e.g., statistics, computer science, data science, marketing, market research, business management)Strong understanding of data structure and managementPropensity to quickly learn new applications and programming languagesUnderstanding of market research methodsExcellent attention to detailPositive “can- do” attitudeExcellent at managing multiple projects and prioritiesExcellent at establishing and managing relationships with clients, vendors and coworkersExcellent skills in Microsoft PowerPoint, Excel, Word, and OutlookProficient with SPSS strongly preferred and syntax experience a huge plusExperience with VB .NET, VBA or VBScript is a plusSense of humor and self-awareWe are looking for people to join our team that are collaborative, enthusiastic, and who can put their ego aside, roll up their sleeves and get the job done. If you are interested in any of these positions please forward a cover letter, a copy of your resume in MS Word, and your salary requirements to careers@cmbinfo.com. We are an equal opportunity employer. No agencies, please."}