{"jobID": "2733557811", "jobLocation": "Santa_Clara_CA", "jobTitle": "Sr. Employee Relations Advisor", "companyRating": null, "companyInfo": {"Website": "www.marvell.com", "Headquarters": "Santa Clara, CA", "Size": "1001 to 5000 employees", "Founded": " 1995", "Type": " Company - Public (MRVL) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job description  The Sr. Employee Relations Specialist provides employee relations and performance management expertise, case management and consultation, within a newly created centralized Employee Relations (ER) function for the US. Develops and applies common practices and processes to ensure fair and consistent treatment /approach. Handles complex, high-risk or sensitive employee relations cases. Reports to the VP, HR Business Partners  Key Responsibilities  • Provide expertise and case management of employee relations issues, including Performance Management, from initial intake to resolution.  • Provide expertise, consultation, guidance and coaching to managers, employees and HRBPs to address employee behavior and performance concerns; provide guidance and assist with the development and delivery of appropriate feedback or corrective/disciplinary actions, and which aligns with company approach, practices, and processes. Assists managers with developing performance improvement plans.  • Conduct HR investigations to include: gathering and analyzing facts, applying relevant policies and past practice to reach conclusions, and recommend management actions. Partners with internal employment attorneys, Internal Audit, and other internal investigative bodies, as necessary.  • Interpret and apply understanding of corporate policies and practices, employment law (in partnership with internal legal team), and other regulations to provide advice, guidance, or clarification for ER inquiries.  • May serve as facilitator and apply interventions to resolve low risk employee disagreements, conflicts, or misunderstandings if needed.  • Collaborate and partner with HRBPs, internal employment attorneys, HR BPs, and HR COEs to achieve high quality, seamless HR support, and represent as “One HR” to the business.  • Maintain required documentation, including intake and investigative notes, supporting documents and final reports.  • Track, report and analyze case trends  • Develop and implement best practice templates /forms to assist managers with documentation requirements  • May conduct manager training in conjunction with L&D; team  • Manage or participate on special projects/programs requiring ER stakeholder input, as needed (e.g., workforce reductions, M&A;)Requirements:  • Broad HR Generalist knowledge and experience, minimum 5-7+ years of experience, 2-3 years direct ER experience. .  • Ability to build, develop and implement new service delivery approaches.  • Demonstrated ability to navigate successfully within ambiguity, multiple priorities and a constantly changing environment.  • Ability to operate/advise in the \"gray\" areas. Adept understanding of client motivations and business pain points; leverages inputs to influence business decisions.  • Experience working in a high volume, fast-paced environment, preferably in a high growth technology company.  • Solid understanding of Federal and State laws and regulations  • Ability to make decisions guided by policies, practices, procedures and business plan; receives general oversight and direction.  • Ability to work collaboratively within and across HR and legal  • Possesses high degree of integrity and competence dealing with highly sensitive/confidential information in a discrete manner  • Work on problems of diverse scope where analysis of data requires evaluation of identifiable factors.  • Uses best practices and knowledge of internal or external business issues to improve delivery of services."}