{"jobID": "2794685575", "jobLocation": "Westwood_MA", "jobTitle": "Associate Data Analyst, Marketing, Energy Efficiency", "companyRating": "4.0", "companyInfo": {"Website": "www.eversource.com", "Headquarters": "Hartford, CT", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Public (ES) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " Unknown / Non-Applicable", "Competitors": " National Grid USA, The United Illuminating Company, Southern Connecticut Gas"}, "estimatedSalary": "64000", "jobDescription": "Job Description Summary: The data analyst will work as part of a team that is responsible for increasing residential customer engagement and awareness of Eversource’s energy efficiency offerings. S/he will be responsible for building data models and developing algorithms that will improve our understanding of customers and enable us to send highly-customized communications to targeted groups. Information provided by the analyst will allow the team to evaluate alternative scenarios and execute a communication strategy designed to maximize impact. In addition to technical knowledge, applicants should have a strong interest in connecting data models to business objectives. Builds and refines data models in digital platform using various sources of customer dataAssists with deployment of new data science platform to ensure that functionalities meet business objectives and enhance internal capabilitiesTranslates results of statistical analysis, predictive analytics, and data-mining into actionable insights for the businessValidates algorithms used within the platform and resulting outputs from data modelsIdentifies and helps to remediate root causes of data issues that may be encounteredUnderstands limitations of algorithms and how they can be modified to achieve similar results at a larger scaleUses models to forecast impacts of different scenarios, enabling team members to decide on the optimal course of actionPerforms power calculations and designs randomized control trails for marketing campaigns, which will allow team to gauge impacts of communications on different types of customersAssists with evaluation of marketing campaign results and utilizes results to refine data modelsTechnical Knowledge/Skill/Education/Licenses/Certifications:Experience working with digital platforms to build & refine data models; familiarity with various techniques and algorithms to help drive feature development and model outputStrong mathematics background (linear algebra, calculus, probability and statistics)Applied machine learning experience (regression analysis, time series, probabilistic modelling, unsupervised learning)Basic understanding of different data formats and integration/mapping techniquesExperience with programming languages such as SQL a plus Education: Bachelors degree in computer science, mathematics, or engineering (masters preferred)  Experience: 1-3 years of experience in applied machine learning and/or data science role  Please submit a resume with your application. Worker Type:RegularNumber of Openings:1SEO Category:Customer Service JobsEEO Statement Eversource Energy is an Equal Opportunity and Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to age, race, color, sex, sexual orientation, gender identity, national origin, religion, disability status, or protected veteran status.  VEVRRA Federal Contractor"}