{"jobID": "2828373165", "jobLocation": "Fremont_CA", "jobTitle": "Backend Engineer Role", "companyRating": "3.6", "companyInfo": {"Website": "www.sooryen.com", "Headquarters": "Oradell, NJ", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "102000", "jobDescription": "Job DescriptionSöoryen Technologies is looking for a Back End Engineer Role. We are looking for super-stars to work with cutting edge technologies and develop awesome user experiences. The ideal candidate will have 3+ years of enterprise Jave, Javascript and Shell Scripting experience.  Söoryen Technologies is a leading edge technology services company with competencies in FinTech, cloud development and e­Commerce. Our focus on engineering and customer centric agile development methodologies ensure that our clients are successful in enabling their businesses with winning solutions. If you’re really bright, passionate about world­ changing software, and want to do something amazing, join us!Freemont, CAFull TimeResponsibilties: Language & ScriptingEnterprise Java, Javascript, Shell Scripting3 years minimumWeb DevelopmentRESTful APIsJSON, JWTSecurity Protocols - OAuth, SAMLFrameworks - Spring.3 years minimumCloud ServiceAWS - S3, SQS, EC2, Lambda.GCP / Azure - (above equivalents, not mandatory)1 year minimumDatabaseSQL - MySQL, Postgres, Oracle. (either 1)NoSQL - MongoDB.3 years minimum.Code PracticeObject Oriented Programming, Design Patterns, Data Structure Management, File Handling, Error Handling and Fail Safe approach, Debugging.3 years minimum.ToolsIDE - IntelliJ, Eclipse.Code Collaboration - Github.DB Client - SQL Workbench, Oracle Client.SDLC - JIRA (or similar).3 years minimum.Benefits:Insurance, Health & WellnessHealth, Vision, and Dental InsuranceFinancial & Retirement401(K)Performance BonusesFamily & ParentingFlexible working hoursMaternity & Paternity LeaveVacation & Paid Time OffSick LeaveBereavement LeaveUnlimited VacationsMiscPeriodic Free Lunches / SnacksJob Training & TuitionAll your information will be kept confidential according to EEO guidelines."}