{"jobID": "2810922578", "jobLocation": "San_Jose_CA", "jobTitle": "Senior Project Manager, Engineering", "companyRating": "3.4", "companyInfo": {"Website": "www.skyworksinc.com", "Headquarters": "Woburn, MA", "Size": "5001 to 10000 employees", "Founded": " 1962", "Type": " Company - Public (SWKS) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "136000", "jobDescription": "   Skyworks Solutions, Inc. is empowering the wireless networking revolution. Our highly innovative analog semiconductors are connecting people, places and things spanning a number of new and previously unimagined applications. We possess broad technology capabilities and one of the most complete product portfolios in the industry. Our customers are global industry leaders who are driving innovative platforms that are changing the way we all live, work and play. Our global team collaborates daily to create the semiconductors the world relies on. If you're looking for a challenging and exciting career in a fast-paced environment, Skyworks offers a variety of roles in an environment that promotes prompt decision making, uninhibited sharing of best practices and individual ownership. Here, you'll find minimal layers of management, open communication and mutual trust and respect.  Requisition ID: 47743  Senior Project Manager, Engineering    High visibility position in a fast growing location. In this critical role, you will be responsible for Technical/Business Program Management of multiple power amplifier/front-end module/multi-mode development projects from initial proposal phase through production launch. Tasks/efforts include chairing weekly development team meetings, resolving technical issues, driving critical path schedule tasks, supporting customer interaction, ISO/Dev. Process compliance, presentations to senior management, etc. If you enjoy being in a critical path, driving role in which you make a significant impact in launching products to market, this is the right opportunity for you!    Position can be based in San Jose or Irvine, California.    Job Requirements:  Strong knowledge of Microsoft Project S/W (Scheduling Skills), MS Powerpoint (Presentations Skills), Knowledge of Oracle’s Agile PLM software is a plus, and Team Leadership experience. Knowledge of Project Management, Product Development Processes, and Technical Project Mgmt.  Candidates must be capable of managing priorities and schedules for multiple development teams (consisting of Design Engineering, Product & Test Engineering, QA, Reliability, Operations, Purchasing, etc.) to assure new product customer specification compliance, cost targets, critical milestones, prototype sample on-time deliveries, etc. Also must be capable of developing detailed MS Project Schedules and presenting project critical path status/issues/actions to Skyworks management. Must be very detail-oriented with strong organizational and communication skills.     Requirements: Bachelors Degree required, Masters degree preferred12 years’ program management experience required, 5+ years managing deliverables for engineering teams. Minimal travel required   Open Market Platforms (OMP) The Open Market Platforms team at Skyworks develops industry-leading, front-end solutions targeting mass market devices deployed by smartphone manufacturers worldwide. Our design engineers have diverse expertise and utilize a broad range of technologies (SOI, silicon CMOS, GaAs, IPD, TC-SAW, and pHEMT) to create differentiated products that meet the intersection of performance and cost requirements for LTE RF front ends. These solutions include high-efficiency power amplifiers, multi-gain LNAs, multi-throw switches, controllers, acoustic filters and integrated modules. Skyworks’ OMP team is an ideal place for motivated engineers who enjoy collaboration in a dynamic environment and designing for performance, cost and quality in the fastest growing segment in mobile.     #LI-DD1                 Skyworks is proud to be an equal opportunity employer supporting diversity in the workplace."}