{"jobID": "2830820954", "jobLocation": "Hawthorne_CA", "jobTitle": "Market Research Intern", "companyRating": "2.5", "companyInfo": {"Website": "www.sf-express.com", "Headquarters": "Shenzhenzhen, China", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Government", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "38000", "jobDescription": "S.F. Express , well established domestically, is continuing our drive as the premier leader in the express delivery industry. We place great value on people: employees, customers, service partners, and the community and we have a strong belief in Corporate Values which brings a strong working relationship. There are many opportunities for employees to nurture and secure their growth and development in the S.F. Express Group. If you believe that you have what it takes to succeed and grow with us then we want to talk with you. We are always looking for confident high-caliber individuals with passion and high adaptability in diversity. If you meet these criteria, then you can thrive with us.  We are currently seeking an energetic Market Research Intern to join our growing team at our Hawthorne location. The ideal candidate will be able to support the Sales and Marketing team to tell compelling stories with data, and juggle multiple projects simultaneously to enable successful client delivery. This is a paid internship ($15 per hour). Hours are flexible and anticipated to be up to 40 hours per week. Responsibilities of the Market Intern may include:Support US marketing team on a wide variety of research projectsCompile, synthesize and analyze research collectedAssist with report creation (for both qualitative and quantitative research projects), including analysis, data entry, and chart/table creation in Excel/PPTRun basic quantitative analyses and be very comfortable working with numbersCreate market reports and insightsBusiness analysis for US marketing and programmingAnalyze and assess research materials from competing organizationsBuild PPT reports based on client specifications and objectivesTo be successful in this role, key requirements for the Market Research Intern are:Detail-oriented – an eye for detail is critical to succeeding in this position  Communicates effectively in all modesProficient in Microsoft PowerPoint, use Word, Outlook, and Excel as requiredFamiliarity with social data (and toolsets), data science, statistics, and/or qualitative/quantitative analysis a plusStudents applying for this internship should be Business, Economics, Marketing majors with a strong understanding of data and statistical trendsStrong experience with Microsoft Office and Google Suite (Docs, Sheets, Slides, etc.)Experience with market analytics a significant plusExcellent oral and written communication skillsOrganized and detail-orientedAbility to multitask and take initiativeIntern must be a creative self-starter with strong critical thinking skills and ability to work independently."}