{"jobID": "2817726041", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Intern, Immuno-Oncology", "companyRating": null, "companyInfo": {"Website": "www.secondgenome.com", "Headquarters": "South San Francisco, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Hi, we’re Second Genome. We are a fast-paced and innovative venture-backed biotechnology company developing tomorrow’s breakthrough therapeutics at the interface of complex microbial communities and their host environments. We are leaders in microbial ecology, metagenomics, and computer science. We love fresh approaches, we value process validation, and we welcome peer review. And we’re looking for a Research Assistant, Immuno-Oncology. We’re on the search for a Research Assistant with a passion for tackling new challenges. We’d love to work with someone who is personally driven but comfortable not having all the answers; resourceful when working towards goals; accepting of the changing demands of the industry environment, and a natural multi-tasker. We deeply value team players who approach tasks with tenacity, curiosity, and enthusiasm. This is a three month internship. We welcome applicants from far and wide, but please note that we do not offer relocation assistance or housing allowances at this time. Responsibilities and DutiesDegree in Cellular Biology, Biochemistry or a related field is essentialExperience with mammalian cell culture is requiredMust be able to rapidly learn and apply techniquesMust participate in critical phases of laboratory operations including experimentation, data analysis and reportingQualifications and SkillsBachelor’s degree, preferably with at least 1 year of scientific laboratory experience in academia or the biopharmaceutical industryMust be able to function well within a collaborative teamMust possess integrity and attention to detailBonus QualificationsExperience with flow cytometry and immune-assays is a plusExpertise in standard molecular biology techniques such as QPCR is also desired, but not essentialWhat’s it like to intern at Second Genome? In addition to our ground-breaking technology, we believe in embodying an authentically joyful workplace. Our Core Values: We are InnovatorsWe are Driven to ActionWe are Great ColleaguesWe Work SmartWe Respect the Data We understand and appreciate the hard work and emotional investment on the part of all our team members - it takes a lot to be a contributor at a startup that’s leading its industry. We make it a priority to mindfully design our work environment and employee offerings with our unique and dedicated team in mind. Fully stocked kitchen with sandwich materials, organic snacks, coffee (Peet’s or Stumptown - take your pick!) and beverages.Our WellBiome health and wellness program: open standing desks, and weekly boot camp and yoga classes on-site.Apple computer + all its fancy accessoriesFriendly and open office environment with great colleagues and an intentional culture that drives innovation, passion, collaboration, and fun!A picture is worth a thousand words. Check out our Instagram @secondgenomelife for a glimpse into our unique team culture. Second Genome provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Second Genome complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training."}