{"jobID": "2726628134", "jobLocation": "Mountain_View_CA", "jobTitle": "Data Analyst, Hardware Customer Care Analytics", "companyRating": "4.4", "companyInfo": {"Website": "www.google.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (GOOG) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Apple, Facebook"}, "estimatedSalary": "106000", "jobDescription": "The Hardware Customer Care team engages with dedicated customers across the globe through our online resources and communities, social outreach, and 1:1 care. We represent the voice of the consumer and work closely with cross-functional partners across Google to make our products and policies better. We're looking for people with excellent analytical and communication skills who are passionate about the consumer and helping them get the most out of Google.  As a ground-floor member of data services team within business systems for the Hardware Support Operations team, you will gather, assess, and manage data about every part of Google’s support operations and transform it into strategic insights, analysis, and reporting. As a Data Analyst, you’ll be working hands-on with Product, Support, User Voice/Feedback and Operations data, shaping discussions on relevant metrics and data signals to define an excellent user support experience.  Google's mission is to organize the world's information and make it universally accessible and useful. Our Hardware team researches, designs, and develops new technologies and hardware to make our user's interaction with computing faster, more powerful, and seamless. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, our Hardware team is making people's lives better through technology. Responsibilities Work on data modeling, metric development, data prototyping, insights generation and recommendations using data mining and statistical techniques (going beyond traditional business intelligence) to drive User Support Experience.Work with operations, product, engineering and support teams and help shape business objectives and prioritization using a well thought, methodical, data-driven approach.Resolve ambiguous issues and find the insights that drive operational, support and product excellence.Focus on results, be a self-starter and demonstrate success in using analytics to drive the understanding, progression and excellence in product and operations. Qualifications Minimum qualifications:"}