{"jobID": "2781608808", "jobLocation": "San_Francisco_CA", "jobTitle": "Performance Reporting Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.firstrepublic.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 1985", "Type": " Company - Public (FRC) ", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Silicon Valley Bank, City National Bank (Texas)"}, "estimatedSalary": "77000", "jobDescription": " Overview First Republic is an ultra-high-touch bank that provides extraordinary client service. We believe that one-on-one interactions build lasting relationships. We move quickly to serve our clients’ needs so that their financial transactions are handled with ease and efficiency. Client trust and security are paramount in our line of business. Ultimately, our goal is unsurpassed client satisfaction which will lead to personal referrals – our number one source of new business. We recognize that our competitive advantage starts with our people and our culture. At First Republic, we work hard and move quickly as a very coordinated team. If you are looking for an opportunity to grow and contribute in a fun, fast-paced environment, First Republic is the place for you. We have exceptional people focused on providing extraordinary service. Responsibilities As part of Information Services, the Private Wealth Management (PWM) Technology Team drives the vision to create an industry leading, client-centric wealth technology experience. The team is looking for forward thinking, action oriented individuals to help drive the implementation of innovative, cutting-edge solutions.This position reports to the Director of Trading/Portfolio Management Technology and supports the development and implementation of Wealth Management’s technology roadmap. This role has a key responsibility within First Republic to ensure that our client experience within Wealth Management maintains the highest standards of the Bank.The Data Analyst works with subject matter experts from various project teams to determine data requirements to support performance reporting in Addepar (PWM’s performance reporting platform), develops these requirements into functional specifications and detailed data flow design documents, and participates in the full development process life-cycle from concept, through testing, to implementation. This includes identifying necessary data, reconciling between multiple applications, and the PWM data sources to ensure the accurate flow of data from source to reporting platform. This will also include communicating business term definitions, establishing data quality rules and checks, researching and analyzing data in support of business functions, process, and workflow knowledge, as well as user acceptance testing.Collaborate with project and product team members, business, and technology/vendor partners to jointly identify data needs required to deliver the next generation of wealth management technology and investment product solutions.Reconcile data sources with applications (e.g. Addepar, Advent APX) to ensure data is accurately flowing.Develop and verify data mapping as needed to support the various projects and initiatives. Provide detailed technical specifications to the Data Team with which to code ETL and APIs.Write and execute data quality checks to:Ensure that all and only the expected records appearIdentify and handle all exceptionsEnsure that calculated values are correctEnsure that abnormal/edge cases are handled as expectedEnsure that all values fall within expected rangeCheck null value handling, etc.Communicate standard calculation logic and business term definitionEstablish best practices and data quality rules benefiting all aspects of the business.Work closely with vendors to debug data issuesCommunicate results and insights with project teams and stakeholders (e.g., through live presentations and ongoing analysis/reports). Qualifications Experience & Education:BA in Finance, Computer Science, or Engineering required5+ years of relevant work experience with background in wealth management and performance reporting5+ years of relevant experience in data analysis and/or data managementTechnical Skills:Solid expertise writing SQL queriesExperienced in working with very large data setsExcellent attention to detail and experience debugging codeKnowledge of Private Wealth Management/Investment Management – with ability to interpret definitions and calculations from business language to developer logicProfessional Skills/Competency:Strong quantitative and analytical skills - ability to quickly analyze data to identify key insights and apply them to the businessClear, high-level understanding of complex data models and software integration/deliveryFocus on development/ improvement of data to support continuous evolution of a more competitive and profitable BankExcellent communication skills, including ability to present effectively to both business and technical audiences at all levels of the organizationStrong orientation to clients, including demonstrated ability to understand needs and apply this knowledge to drive data enhancementsUnderstanding of traditional and alternative asset class investment data, including but not limited to equity, fixed income, private equity, hedge funds, real estate, derivatives, mutual funds, ETFs, global assets, foreign exchange, etc.Personal Skills/Competency:Consistently demonstrates and follows high standards of integrity in business decision-makingLooks toward the broadest possible view of an issue/ challenge; can easily pose future scenarios; can think globally about all aspects of the Bank; can discuss multiple considerations of an issue and forecast them into the future; understands how the Bank works, competes, serves clients, and generates shareholder valueDemonstrates excellent communication and interpersonal skills; able to communicate clearly and concisely in a variety of settings and styles; is effective in a variety of formal presentation and meeting settingsGains support for change by providing context and responding with sensitivity to concerns; takes initiative to recommend and develop innovative approaches to getting things doneCan quickly find common ground and solve problems for the good of all; is a team player and encourages collaborationMental/Physical Requirements: The ability to learn and comprehend basic instructions; understand the meanings of words and respond effectively; and perform basic arithmetic accurately and quickly.Vision must be sufficient to read data reports, manuals and computer screens.Hearing must be sufficient to understand a conversation at a normal volume, including telephone calls and in person.Speech must be coherent to clearly convey or exchange information, including the giving and receiving of assignments and/or directions.Position involves sitting most of the time, but may involve walking or standing for brief periods of time.Must be able to travel in a limited capacity."}