{"jobID": "2630792757", "jobLocation": "New_York_NY", "jobTitle": "VP of Business Development", "companyRating": null, "companyInfo": {"Website": "www.timelesscapital.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "ABOUT KARMA Karma is the only original programming network crafting content for the next generation of leading investors and innovators. We don’t provide tickers or daily trading advice, but rather engage in long-format storytelling to both entertain and inform. Our editorial guiding star is to find moments of social impact converging with pure economics as we believe that is the new modality for economic decision-making. All our content is produced “primetime-style” across a range of 12 shows, including interactive and “live” content. Our shows are produced for both deep investment professionals and holders of wealth, as well as more casual viewers looking to become better agents of their economy. Please check out www.karmanetwork.com (pre- launch site, full range of programming launches October 16). We are based in New York with a staff of approximately 100 full-time and freelance operators. We’re fun, we’re energetic, and passionate about what we do. ABOUT YOU A senior sales executive with a significant book and experience in building 7-8-figure run sheets. We are looking for mad scientists willing to play in the sandbox of an emerging media brand, willing to get grit under their fingernails and, frankly, give it ALL they've got. What we’re not looking for are those that spin big fish tales, require being carried around in a sedan, or that have a disruptive know-it-all personality. We appreciate confidence matched with a considered approach and risk-taking measured against prudence. THE ROLE We are seeking a senior business development executive that can help us develop a variety of monetized partnerships. These partnerships will primarily be for direct sponsorship and advertising relationships across the range of our digital content and distribution. Working directly with the CEO and President of Karma, this senior executive role will require pre-sales research, in-person meeting, collateral development, relationship development, contract negotiations, and related. The Executive will have a meals and entertainment budget, and run a junior staff of 2-3 additional individuals, including a relationship/account manager, sales development representative and mid-senior business development representatives. RESPONSIBILITIES The Executive will be in charge of building Karma’s book of business through original effort, warm leads provided by senior management’s contacts and the Executive’s current list of contacts. The Executive will be responsible for developing direct relationships with brand-side decision-makers as well as media agencies and other senior operators. The Executive’s primary KPIs will rest on new business development targets, gross/net churn and other sales-related analytics (e.g. sales cycle length). The Executive will report directly into Karma’s President/COO and Founder/CEO. QUALIFICATIONS/REQUIREMENTS We are looking to build a team around this Executive. To apply, please have a(n) minimum of 7 years of digital ad sales, media buying or agency-side experience. Ability to demonstrate developing and enhancing sound long-term relationships with brands and agencies. Track record of meeting quarterly and annual revenue targets. Demonstrated record of managing other mid and junior-level business development team members and building camaraderie within that unit. Ability to think like a “marketer” and work closely with internal marketing team to align messaging and manage brand expectations. To apply, please send us your CV. If you are called for an interview, please be prepared to discuss your current roster of contacts, your specific strategy to business development and unique examples of your value-add to your current and previous employers."}