{"jobID": "2802120566", "jobLocation": "Los_Angeles_CA", "jobTitle": "Marketing Data Scientist with Entech Network Solutions, LLC", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The position listed below is not with LA Interviews but with Entech Network Solutions, LLC  LA Interviews is a private organization that works in collaboration with government agencies to promote emerging careers. Our goal is to connect you with supportive resources to supplement your skills in order to attain your dream career. Job Description The Data Scientist will be responsible for the creation and management of key client marketing and media predictive models, including data aggregation/ETL, transformations, database creation/administration, statistical analysis, model outputs and PMML.  Primary responsibilities include database administration (working with our I.T. team), predictive statistical modeling/analysis (MMM, econometrics, media optimization, simulation, attribution), data automation (ETL/API’s) and visualization/dashboarding (Tableau/R Shiny, etc.). Responsibilities Work with analytics, operations, and client teams to build or connect to existing API’s to ingest media performance data, client first-/second-party data and third-party data sources or DSP’s/DMP’s  Review and refine data process within organization to ensure the accuracy, efficacy, and serialization of data across internal and external stakeholders and partners  Utilize R, Python, TensorFlow (or similar), Alteryx, Jenkins (or similar) and PMML to build, automate, and push predictive models to internal/external systems  Lead the ingestion and processing of client first-/second-party data and third-party data for MMM, retail, and econometric modeling  Test/control design methodology for A/B, multi-variate, creative, or lift-based testing/studies  Day-to-day POC for third-party multi-touch fractional attribution partners  Participate in the development and administration of Alteryx process workflows and apps  Translation of complex statistical concepts and models into client-facing products and presentations that tell a clear and concise story for the layperson  Assist in the development of new and existing agency models/tools for existing and prospective clients, pitches  Education and Experience  Master’s degree in statistics, advanced analytics or engineering, 2-4 years of relevant experience. Will consider/accept fewer years of experience with PhD  Agency, marketing technology vendor, media vendor, DSP, DMP, or analytics company experience preferred  Advanced coding experience in R, SQL, Python, Json, XML, PMML, and similar languages/syntax – be prepared to answer questions about specific coding projects, languages, R/Python packages and statistical models  Company DescriptionEntech Networks is a boutique staffing agency focusing on the placement of professionals at all levels, nationwide.  Apply"}