{"jobID": "2827554104", "jobLocation": "Waltham_MA", "jobTitle": "Marketing Data Scientist Specialist", "companyRating": "3.1", "companyInfo": {"Website": "www.perkinelmer.com", "Headquarters": "Waltham, MA", "Size": "10000+ employees", "Founded": " 1937", "Type": " Company - Public (PKI) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "103000", "jobDescription": " The Marketing Data Scientist is responsible for leading PerkinElmers Global Digital Marketing Analytics Program that will use data mining, statistical analysis and predictive modeling to help us grow our business and improve our customers experience. Our focus will be to develop ROI and marketing attribution models as well as behavioral analysis and predictive models to support our development of marketing goals, marketing campaigns, customer segmentation, content campaigns strategies, and customer journey analytics so that we can develop engaging, value-added digital experiences. Responsibilities:Conduct data mining to identify and prioritize opportunity areas.Build end-to-end marketing attribution and predictive models.Construct and optimize attribution and predictive models in partnership with marketing leadership.Analyze campaign effectiveness by developing and utilizing statistical models. Provide recommendations for marketing programs and program refinements.Build models to measure customer engagement, lifetime value, and turnover.Discover the critical customer attributes and behaviors that will give us the most leverage to improve customer lifetime value.Partner with marketing and ecommerce leadership to develop affinity models to improve cross sell and upsell.Support multi-variant testing by providing insights to support program design as well as analytics to measure effectiveness.Partner with our IT colleagues to ensure accurate and timely data capture, data cleanliness and availability.Qualifications:Masters Degree in Mathematics, Statistics, Econometrics or related field required, PhD preferred.6 - 8 years of predictive modeling experience utilizing CRM or high level transaction information.Must have hands-on experience with programming languages such as SAS, SPSS, R, SQL, or PythonExperience with SQL and working with large databases.Strong understanding of digital marketing and sales processes in a complex B2B product environment.Familiarity with the marketing technology landscape in the areas of market data, data enhancement, analytics, attribution, predictive analytics desirable.Strong leadership and effective communications skills.Strong business acumen and proven ability to synthesize complex data analysis for presentation to Senior and Executive leadership.Strong planning, scheduling, organizing and consensus building skills.Proven ability to deliver work on time."}