{"jobID": "2705866812", "jobLocation": "Bellevue_WA", "jobTitle": "Senior Data Scientist or Data Scientist", "companyRating": "3.0", "companyInfo": {"Website": "www.pse.com", "Headquarters": "Bellevue, WA", "Size": "1001 to 5000 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "143000", "jobDescription": " Senior Data Scientist or Data Scientist #88345  JOB SUMMARY: Puget Sound Energys Strategic Customer Insights Group is looking for a Data Scientist to join our team. This role works in a team that is designed to attain the companys strategic goals via the extensive use of data and analysis to drive decisions and actions. The ideal candidate will be responsible for the continuous improvement of PSEs competitiveness as an energy partner in the northwest through an analytical focus on customer experience.  At the discretion of the hiring team, this position may be filled as a senior data scientist or data scientist depending on the qualifications of the selected candidate.  Families and businesses depend on PSE to provide the energy they need to pursue their dreams. Our steadfast commitment to serving Washington communities with safe, dependable and efficient energy started in 1886. Today were building the Northwests energy future through efforts like our award winning energy efficiency programs and our leadership in renewable energy.  At PSE all employees are valued, respected and provided with the opportunity to excel professionally. We offer an expansive pay package that includes competitive compensation, annual goals-based incentive bonuses, comprehensive cafeteria-style benefits, 401(K), a company paid retirement pension plan, and an employee assistance and wellness program. JOB REQUIREMENT: JOB RESPONSIBILTY: • Perform deep data analysis to identify opportunities to improve customer experience Acquire data and conduct research to evaluate and analyze evolving prioritiesEmploy advanced statistical methods to support management decision-makingPerform customer survey analytics/modeling and participate in survey designDevelop regression models, classification models, customer segmentation schemas, etc. to improve customer experience and increase customer engagementAnalyze data to create performance metrics that align with company goalsProvide leadership for cross-functional projectsEffectively communicate and collaborate across groups to provide customer intelligence to the organizationProactively research industry trends, opportunities, and risksAnalyze and report on web dataPerform other duties as assigned"}