{"jobID": "2800964524", "jobLocation": "San_Mateo_CA", "jobTitle": "Interior Designer", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " We're seeking a talented Interior Design Professional to join our award-winning, full-service, boutique architecture and interior design firm. Our creative and collaborative group of 18 works passionately to create stunning living environments for our clients throughout the Bay Area.  As Interior Designer, you will work alongside the Principal in designing whole-house and major remodel projects. You will be responsible for managing your own projects and overseeing associate and assistant designers on your team.  The ideal candidate will have excellent leadership skills, a Bachelor's degree or higher in Interior Design, Architecture, or related field; a minimum of five years of work experience with built-in finishes; and excellent project management and AutoCAD skills. We are looking for someone personable, intelligent, resourceful, articulate, and self-motivated--someone who is detail-oriented and can multitask while maintaining accuracy and organization. RESPONSIBILITIES INCLUDE:Develop design concepts and select finishes, from flooring, cabinetry, ceiling treatments and paneling to plumbing, countertops, tile, decorative lighting, and colorsManage whole-house projects from conception to move-in while efficiently directing assistant and associate designers.Create and oversee project timelines and budgetsPrepare and deliver client presentations, record and maintain accurate meeting notes; develop agendas for client meetingsDraft floor plans, elevations, and furniture layoutsMaintain professional and timely correspondence with clients, vendors, contractors and others on the teamRun job site meetings to review framing, rough plumbing, electrical, etc... to ensure design is built according to plan.MINIMUM REQUIREMENTS:Bachelor's degree in Interior Design or related field5 years of experienceProficiency in AutoCAD, Microsoft Office, and Adobe Creative SuiteExperience with Studio Webware and an asset; SketchUp a plusMust own a reliable car for use in this positionCOMPENSATION: Our compensation is very competitive and commensurate with experience.  We provide a generous benefits package including: holidays, paid time off, 100% coverage for health insurance, dental, and vision, and a matching 401K plan.  Qualified applicants please email resume and cover letter to admin@trgarch.com. No phone calls please."}