{"jobID": "2830775507", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Analyst - Looker", "companyRating": null, "companyInfo": {"Website": "www.enervee.com", "Headquarters": "Venice, CA", "Size": "1 to 50 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Enervee is looking for an experienced data analyst to translate web engagement, digital marketing, e-commerce, and energy efficiency data into actionable dashboards and insights for our internal and external customers. You will be responsible for connecting with key stakeholders across business and technical teams to deliver Enervee’s customer behavior and energy savings insights via setup of an automated, intuitive and scalable data analytics and business intelligence platform. Most importantly, you’ll see your work have an immediate and tangible impact every day in a dynamic, fast-paced and growing company. This position will report into our Director of Product.  What you'll do: Play a key role on optimizing Enervee’s data environment to work most effectively and efficiently with Looker and other data analytics toolsManage requirements gathering, use cases and custom data requests across key technical and business stakeholders or customersDevelop a data model around stated use cases to capture clients KPIs and data transformationsTranslating Enervee’s data into intuitive visualizations and dashboards for use by internal and external stakeholdersAct as primary liaison between the Customer Success, Sales, Business Development, Marketing, Product and the Technology teamsDocument and communicate product feedback in order to improve user experiencePromote value-driven delivery, innovation and continuous improvementRequirements5+ years of experience working in the SaaS and Data Analytics spaceBachelor's or Master's degree in Computer Science, Mathematics, Economics, Physics, Computer Science, or equivalentExperience working with Looker and other similar business intelligence software and big data analytics platformA passion for exploring data and extracting valuable insightsProven analytical, problem solving and troubleshooting expertiseAbility to learn and assimilate technical information quicklyProficiency in SQLMac SavvyDesire to work in an entrepreneurial environmentBenefitsThe chance to jump into the trenches with an exceptional team that cares deeply about our work, planet and virtually all of its inhabitantsVery fine coffee, nutritious and utterly delicious snacks, catered lunches, and an awesome work environment a brisk dog's walk away from the beachTruly competitive benefits and stock options in a fast growing start-up"}