{"jobID": "2825994902", "jobLocation": "New_York_NY", "jobTitle": "Corporate Treasury Intern (Graduate)", "companyRating": null, "companyInfo": {"Website": "www.colgatepalmolive.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1806", "Type": " Company - Public (CL) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Colgate-Palmolive is a leading global consumer products company, tightly focused on Oral Care, Personal Care, Home Care and Pet Nutrition. Colgate sells its products in over 200 countries and territories around the world under such internationally recognized brand names as Colgate, Palmolive, Speed Stick, Lady Speed Stick, Softsoap, Irish Spring, Protex, Sorriso, Kolynos, elmex, Tom’s of Maine, Sanex, Ajax, Axion, Fabuloso, Soupline and Suavitel, as well as Hill’s Science Diet, Hill’s Prescription Diet and Hill’s Ideal Balance.  For more information about Colgate’s global business, visit the Company’s web site at http://www.colgatepalmolive.com. To learn more about Colgate Bright Smiles, Bright Futures® oral health education program, please visit http://www.colgatebsbf.com. To learn more about Hill's and the Hill’s Food, Shelter & Love program please visit hillspet.com. To learn more about Tom’s of Maine please visit http://www.tomsofmaine.com.  Location: New York, New York, United States  No Relocation Assistance Offered  # 66382This internship offers an opportunity to work in the Corporate Treasury group at Colgate-Palmolive. It will enhance the candidate’s knowledge of core Treasury functions, particularly capital markets, capital structure and foreign exchange risk management. In addition, the candidate will gain experience in performing a wide range of duties relative to capital structure strategy while working cross functionally within the broader Colgate Global Finance organization.  Specific responsibilities include:Capital Structure Strategy & Analysis Development of reporting of Capital Structure metrics of Colgate and broader consumer products peer group, utilizing Bloomberg historical market data and financial disclosuresAnalysis of Colgate’s Share Repurchase Program which includes management of share repurchase brokers and support development of repurchase strategiesForeign Exchange Risk Management Monitor and provide insight on local market conditions for currencies in each of the Company’s key marketsCalculation, aggregation and reporting of currency exposures and positions by major currencyEnhancement of analytical tools to assist with hedging decision-makingSupport Regional Treasury Coordinators on FX related analysis and researchBank Relationship Management Compile and analyze “share of wallet” reporting and ensure bank counterparties and fee distribution are in line with Colgate’s requirementsConduct analysis and make recommendations on Colgate’s bank relationship management processSkills/Competencies Required:Basic understanding of financial markets and drivers – (foreign exchange, interest rates, equities and commodities), cash management, and bankingStrong quantitative and analytical skillsHigh degree of accuracy and attention to detailsStrong communication skills (oral and written)Focus on process improvement and implementation of best practicesProficiency in Word, Excel, Powerpoint and Google SuiteWorking knowledge of Bloomberg, SAP and SAP Treasury module a plusEducation/Experience Required:Bachelor’s Degree requiredCurrently enrolled as a first year MBA or Masters studentPrior experience in banking, treasury or finance functionsCandidate must have a distinguished academic achievement (must have a GPA of 3.0 or higher)Strong oral and written communications skillsStrong analytical abilityExcellent computer skills, particulary Microsoft Excel Are you interested in working for Colgate-Palmolive? You can apply to work with us using this online application. Attach all relevant documents such as a cover letter and resume or CV. Applications received by e-mail are not considered in the selection process.  Become part of our team. We look forward to your application.  Equal Opportunity Employer  Colgate is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender identity, sexual orientation, national origin, ethnicity, age, disability, veteran status, marital status, or any other characteristic protected by law."}