{"jobID": "2647026427", "jobLocation": "New_York_NY", "jobTitle": "Financial Planning Associate", "companyRating": null, "companyInfo": {"Website": "www.lenoxadvisors.com", "Headquarters": "New York, NY", "Size": "201 to 500 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Who we are: Lenox Advisors is a full-service, multi-faceted financial services firm. Our clients hire us for our commitment to help them achieve long-term financial success. We have an immediate opportunity in our New York office for a Financial Planning Associate.  The Financial Planning Associate is responsible for supporting Financial Planners with the day to day planning needs of a group of financial planning clients. The primary responsibility of this role is to support the Financial Planners in the timely execution of tasks related to the client’s current financial planning needs in order to provide our clients with a superior financial planning experience. What You'll Be Doing:Maintain client website making sure all information is correct and as up to date as possible. Discuss any potential opportunities for financial planning recommendations with the client’s financial planner.Maintain and follow up on client Action Items after client review meetings.Work with Financial Planners to create reports using eMoney and Microsoft Word and Excel for client meetings and be an active participant in those meetings.Work in conjunction with the Team Support Coordinator and clients’ key external advisors to gather critical documents to create their Financial Plan.Create custom client reports, as needed using Microsoft Word, Excel and PowerPoint.Meet with internal clients (Relationship Managers, Asset Management team, etc.) to review client agenda and action itemsWorking with Financial Planners to create and review agendas and present select financial planning topics at client meetingsAssist with training for Team Support CoordinatorsWork with clients directly providing reviews of their current financial reports, as approved by the Financial Planners.What We're Looking For: The successful candidate will hold a Bachelor’s Degree and will have one to three years of prior experience in financial services processing new accounts and providing a high level of client service. Previous experience working directly with high net wealth clients on financial matters a plus. The ideal candidate will be proficient in MS Office and will have basic familiarity with financial planning topics and strategies. Good interpersonal skills are crucial to success. You must be good at communicating clearly with clients both verbally and in writing. You will be a proactive self-starter with a personal interest in financial planning. CFP Class enrollment a plus."}