{"jobID": "2786483707", "jobLocation": "Fremont_CA", "jobTitle": "Sales Representative - Level 2", "companyRating": null, "companyInfo": {"Website": "www.uline.com", "Headquarters": "Pleasant Prairie, WI", "Size": "5001 to 10000 employees", "Founded": " 1980", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Fremont, California  Sales Representative - Level 2 Uline is looking for ambitious, customer-focused Level 2 Sales Representatives to join our team.  In this role, you will have hands-on, day-to-day interaction with customers. Utilizing our catalog with over 34,000 products, you will act as a consultant, helping your customers find new ways to grow their business through a partnership with Uline. Because of our positive reputation for quality service, customers look forward to seeing our Sales Representatives and actively seek product advice to improve their business operations.  You will be expected to have good sales acumen and the ability to communicate in an outgoing, poised and persuasive manner. The ideal candidate will be detail orientated and hardworking while continuously developing their skills and knowledge. ResponsibilitiesActively manage and grow accounts that include a large, pre-existing customer base.Use our 750+ page catalog with over 34,000 items to sell product solutions to large and small companies.Prospect and develop new, exciting business relationships.Understand each customer's needs to provide real, effective solutions.Deliver exceptional customer service.QualificationsBachelor’s degree.3+ years sales experience.A valid driver’s license.Ability to thrive in a dynamic, exciting work environment.Detail oriented and hardworkingExcellent interpersonal, communication, problem-solving and presentation skills are a must.Travel to our Ontario, California branch for 4 weeks of initial training is required.There’snolimittowhatyoucanaccomplish! We’re growing fast and looking for future leaders and problem-solvers that are ready to grow with us. If you have a passion for what you do then we’ll provide the tools you need for success. Plus, fantastic benefits and a variety of perks create an outstanding work environment for all our employees. BenefitsComplete insurance coverage that includes medical, dental, vision and life insurance, Flexible Spending Accounts and wellness programs.401(k) with 5% employer match.Paid holidays and generous paid time off.Base salary plus bonus programs including annual performance, sales goals and profit sharing.National and local sales contests and incentives.Car, phone and internet allowances.Company-paid professional development classes, in-house speaker sessions, workshops, industry seminars and conventions.Tuition Assistance Program that covers professional continuing education courses, books and other fees.Scholarship program for children of employees.Charitable donation matching program to support your favorite charity.About Uline Uline is the leading distributor of shipping, industrial and packaging materials to businesses throughout North America. We're a family-owned company known for incredible service and quality products. We offer same-day shipping on over 34,000 products in our 750-page catalog and on our state-of-the-art e-commerce website.  Our quality products, huge inventory and ongoing expansion fuel Uline's incredible growth. This is a great time to join Uline!  EEO/AA Employer/Vet/Disabled  Uline is a drug-free workplace. "}