{"jobID": "2753185544", "jobLocation": "Boston_MA", "jobTitle": "Entry-Level Outside Sales", "companyRating": null, "companyInfo": {"Website": "www.thehiretalent.com", "Headquarters": "Brea, CA", "Size": "1 to 50 employees", "Founded": " 1980", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Outside Sales RepresentativeAuto-Chlor SystemAtlanta, GASeeking an entrepreneurial, hardworking and fun individual to help the momentum of our culture continue to develop. In return, we provide an engaging workplace with continuous learning, growth opportunities and training for all team members.Compensation includes a base salary plus commission with first-year earnings ranging from $70-100k.As an Outside Sales Representative, you are given the opportunity to...Work outside of the office and meet new people dailyExpand our business-to-business sales and grow new revenue within a protected territoryConduct face-to-face meetings to identify and vet potential customersMake decisions and solve problems individually and as part of a teamBe recognized, rewarded and celebrated for your successesBe a part of a family that supports and pushes one another towards a common goal of growth and quality of lifeWe're looking for...Someone with a positive attitude and the ability to handle rejectionA great work ethicA self-motivated individual with an interest in growing within the companyAdditional perks include:A company car, gas allowance, and company cell phoneStability, standard working hours, no layoffs, a great company culture and promotion opportunitiesFull benefits, 401K, Paid Vacation, Profit Sharing Plan that equate to nearly $30k in additional compensationMaximizing your performance and earningsThere is an abundance of opportunity to grow and move up in this company. Business is booming across the nation because of our talented team members who are committed to high-quality service and growth."}