{"jobID": "2464256416", "jobLocation": "San_Francisco_CA", "jobTitle": "Executive Assistant to the CEO Intern", "companyRating": "4.5", "companyInfo": {"Website": "www.universalgiving.org", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2002", "Type": " Nonprofit Organization", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "60000", "jobDescription": " Executive Assistant to the CEO Intern Facebook  Twitter  LinkedIn  Email  AddthisUniversalGiving® is an award-winning website allowing people to donate and volunteer with top performing vetted projects all over the world. Unique to UniversalGiving, 100% goes directly to the cause. UniversalGiving Corporate provides Strategy, Operations, and NGO Vetting to scale companies’ CSR programs in more than 120 countries; our Corporate Services allow us to become self-sustaining. UniversalGiving has been featured on the homepage of BusinessWeek, Oprah.com, CBS, The Wall Street Journal, and The New York Times.  The Executive Assistant will support the CEO on a day-to-day tasks. These tasks include scheduling meetings, handling travel details and preparing materials for meetings. With proven track record, you may be asked to assist with donor mailing projects. This is a great opportunity to work with our inspiring leader.  As a UniversalGiving intern, you’ll have the opportunity to work with a diverse, passionate team representing over 25 cultures. Our work environment is fast-paced and entrepreneurial, yet collaborative and fun, including monthly potlucks and team events. Come work with us to achieve our vision “To Create A World Where Giving and Volunteering Are A Natural Part of Everyday Life®!  Responsibilities: Answer, prioritize and screen incoming phone calls and voicemail messagesManage the CEO’s calendar by planning and scheduling meetings, calls, and conferencesTravel scheduling and booking for the CEOPrepare material and taking notes for meetingsMaintain confidential relationships: enter and edit data in Salesforce, our Customer Relationship DatabaseWrite and post regularly on social media channelsCreate and edit new content for CEO’s blogMaintain office supplies inventory and order supplies as neededOther duties related to operations and administration With proven track record Research and outreach to new prospective partnersSpecial projects as needed on an on-going basis Qualifications: Excellent written and verbal communication skillsMeticulous attention to detailStrong critical thinking skillsStrong basic working knowledge of in-office technologies (printer, copier, fax, etc)Computer skills, Microsoft Word, Excel and PowerPointCommitment to using and updating Salesforce, our Relationship Database Benefits: Gain experience at a unique social entrepreneurship that has a global impactGain entry, exposure, and experience in the nonprofit industryIncrease your understanding of and alignment with global issuesCollaborate within a positive team atmosphereNetwork with other for-profit and nonprofit professionals in an open office environmentCareer mentoring with Pamela Hawley, Founder & CEO of UniversalGivingFor students, class credit can be arranged according to school requirements Duration: Minimum 15-20 hours per week required for the duration of the internship, at least a minimum of 3 to 4 months. Ideal candidates are available to work out of our San Francisco office 3-4 days/week (Monday through Friday).  Testimonial  \"I came into UniversalGiving as a shy recent graduate. I soon saw that this internship was like no other-- I worked on high-level projects, I was mentored by the CEO (unheard of!), and I bonded with the grooviest team I have ever come across. The nerves left, but the values and experiences will stay.\"  Germaine Lau, former Executive Assistant Intern  About UniversalGiving  UniversalGiving’s Mission: To connect people to quality giving and volunteer opportunities worldwide.  UniversalGiving’s Vision: “To Create A World Where Giving and Volunteering Are A Natural Part of Everyday Life”®  UniversalGiving® is an award-winning website allowing people to donate and volunteer with top performing projects all over the world. Our projects are vetted through a proprietary Quality Model™ to ensure the most effective, trustworthy philanthropy possible. Unique to UniversalGiving, we take no cut on donations. 100% of your donation goes directly to the cause.  UniversalGiving Corporate consults with Fortune 500 companies on the Strategy, Operations and NGO Vetting for their international giving and volunteering programs all over the world. Some clients include Cisco, Symantec, Fluor, Sabre, Gap, BHP Billiton, RSF Social Finance, and inovia.  Located in the heart of San Francisco, UniversalGiving has been profiled on CBS and in FOX Business Network, and has also been featured in BusinessWeek, Fast Company, CSRWire, WomenEntrepreneur, Oprah.com, NBC News, The Christian Science Monitor, The New York Times, The Financial Times, MarketWatch, CNNMoney.com, Change.org and See Change Magazine. UniversalGiving has been featured three times on Great Nonprofits’ annual Top Nonprofits lists and is a Webby Award Honoree.  CEO Pamela Hawley is a winner of the Jefferson Award (the Nobel Prize in Community Service) and was selected as one of 50 leaders to the White House's Next Generation Leadership and Social Innovation event. She is a Finalist for Ernst & Young’s Entrepreneur of the Year Award, and a Colburn S. Wilbur Leadership Fellow at the Global Ethics Institute. She is a Fast Company Expert Blogger on CSR.  To Apply:  Email your resume, cover letter, two writing samples (two pages max), and three professional references with contact information (phone and email) to volunteers@universalgiving.org with \"Executive Assistant Intern\" in the subject line. Applications are reviewed on a rolling basis. No phone calls please.  UniversalGiving® is committed to understanding and representing the diverse populations it serves worldwide. Members of all ages, genders, sexual orientations, races, ethnicities, nationalities, physical abilities or disabilities, religions or beliefs, and cultures are welcome as employees and volunteers in our organization. We believe that a diverse team will best serve our diverse populations. "}