{"jobID": "2816116084", "jobLocation": "New_York_NY", "jobTitle": "Senior Software Engineer", "companyRating": "4.1", "companyInfo": {"Website": "www.ambulnz.com", "Headquarters": "New York, NY", "Size": "201 to 500 employees", "Founded": " 2016", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " American Medical Response, SeniorCare, Hunter EMS"}, "estimatedSalary": "89000", "jobDescription": "Ambulnz is a fast growing health-tech company on a mission to transform the medical transportation industry. We're technology-driven, but our focus on care drives every part of our business. Our proven location-based system ensures accurate ETAs that facilities can rely on and enables caregivers to request and track transports in real time.  We're looking for a Senior Full Stack Engineer to join our team. You'd help scale our real-time communications and mobile routing system to continue support to our growing base of customers.  What you'll be doing Work in a collaborative team environment, designing, building, and maintaining multi-tiered real-time applications.Work directly with technology leads in implementing company initiativesDevelop scalable and robust core system and micro-servicesDrive enhancements, optimize performance, and troubleshoot defects for core business applications What we're looking for 5+ years full stack experienceExpert level experience with Node.js and MySQLDeep understanding of Node promises and event loopExpert level experience with Angular 2 and/or ReactTest Driven Development with expert knowledge of CI & CDDeep understanding of GITEnough DevOps experience to setup, configure, and maintain your dev/build environmentExcellent knowledge of software engineering best practices (e.g., software development, test driven development, unit testing, code reviews, design documentation)Experience with React Native, Ruby, or Swift a plusBachelors degree in Computer Science, Engineering, Mathematics or a related field What's in it for you An opportunity to work closely with proven executive team, board, and serial entrepreneursCompetitive compensation and benefits package (with company contribution)Company sponsored team building eventsFlexible schedulesOffice stocked with snacks and drinksUnlimited PTOEmployee perks and discountsDog friendly office!0Job Posted by ApplicantPro"}