{"jobID": "2781181509", "jobLocation": "San_Jose_CA", "jobTitle": "Resident Services Coordinator", "companyRating": "4.2", "companyInfo": {"Website": "www.ncphs.org", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "56000", "jobDescription": "SUMMARY: Provides outreach, case finding, assessments, and care planning to seniors, disabled adults and families within the scope of the Resident Services Program. Services attend to the psychosocial, health, financial, recreational, nutritional and legal needs of clients.ESSENTIAL FUNCTIONS:Establishes and maintains relationships with individual residents, their families and neighborhood groups.Identifies and documents residents in need of services and maintains awareness of health status.Serves as liaison or advocate with outside social and health agencies for the residents.Provides individual casework and case management for frail or at-risk residents to include assessment, development of individual care plan, coordination of services and monitoring.Provides information and referral, crisis intervention and counseling with individuals and groups as needed.Maintains accurate and up-to-date records and files on all clients receiving casework services.Identifies barriers to full and complete provision of service needed by participants and effectively problem-solves to resolve these issues.Facilitates and supports \"neighbor-to-neighbor\" family and volunteer care giving, including direct responsibility for designated volunteer programs at specific sites.Provides resident population with current information on services, benefit programs and other resources.Identifies and develops training opportunities for resident groups and site staff.Collaborates with Health Education Coordinator to meet the holistic needs of residents served. Collects data measuring impact of program in sites that have WellElder program.Works cooperatively with housing manager or agency director in an advisory or facilitative capacity to address needs of residents.Ensures completion of required documentation and statistics.QUALIFICATIONS:Minimum of Bachelor's degree in social work, sociology, gerontology or psychology (Master's degree preferred) and three years of recent experience in a social services capacity. Bilingual English/Mandarin preferred. California driver’s license, proof of insurance, clean driving record and the ability to travel to multiple locations on a daily basis."}