{"jobID": "2805855102", "jobLocation": "Los_Angeles_CA", "jobTitle": "Senior Health Care Analyst (SQL Data Analyst)", "companyRating": "3.9", "companyInfo": {"Website": "www.kaiserpermanente.org", "Headquarters": "Oakland, CA", "Size": "10000+ employees", "Founded": " 1945", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " HCA Healthcare, Dignity Health, Sutter Health"}, "estimatedSalary": "73000", "jobDescription": " Conducts and manages complex analytical projects in the area of continuous improvement, medical effectiveness and resource consumption. This involves managing all phases of the project including design, development, implementation and analysis. Functions as an internal consultant providing analytical problem solving and statistical and methodological consultation throughout the assigned area. Essential Functions: Applies statistical analysis, clinical research design methods and systems analysis to address issues related to clinical interventions, goal monitoring measurement, health status and other health related analysis and projections.  Guides/coaches and educates clients in the areas of quality improvement processes including establishing data sources and methods of collection, display and analysis.  Applies sophisticated analytical techniques such as linear programming, statistical sampling methods, database integration and the use of forecasting models to address clinical and service issues of strategic importance.  Extracts information from major systems/databases (FOCUS, SPSS) using techniques to validate, clean, complete and/or project values to address analytical questions when data systems are problematic.  Leads and facilitates multiple, large scope and complex projects developing work plans that include Kare paths, disease management systems, and improved patient management programs.  Provides assistance to departments in developing research technologies designed to measure and improve organizational performance.  Develops and implements systems, procedures and forms that increase the efficiency and effectiveness of data collection, management and display including statistical process control.  Serves as a technical resource to coworkers by assisting in problem resolution for data source analysis. Basic Qualifications: Experience  Minimum two (2) years of project management experience.  Minimum two (2) years of experience manipulating large, complicated data systems. Education Bachelor's degree OR four (4) years experience in a directly related field.  High School Diploma or General Education Development (GED) required.  License, Certification, Registration  N/A. Additional Requirements: Excellent statistical and data management skills.  Knowledge of CQI principles and techniques.  Significant knowledge of TJC, Title 22, NCQA, and TQM and tools for indicator development and display.  Knowledge of CMA standards and requirements preferred.  Proficient with databases and statistical software.  Must be able to work in a Labor/Management Partnership environment. Preferred Qualifications: N/A. Notes: SQL, Teradata, Crystal Reports. "}