{"jobID": "2684879993", "jobLocation": "Fremont_CA", "jobTitle": "Assembler", "companyRating": null, "companyInfo": {"Website": "www.shockwavemedical.com", "Headquarters": "Fremont, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Shockwave Medical is revolutionizing the interventional treatment of advanced cardiovascular disease, creating new opportunities for patients and physicians by effectively targeting calcified plaque. Together, we are working to reshape interventional therapy with Lithoplasty® Technology for the treatment of calcified plaque.  Position Overview  Assemblers are responsible for assembly, testing, and inspection of product according to documented Manufacturing Process Instructions (MPIs), including cleaning and setup of workstation with proper equipment and materials. An assembler records functions and activities performed on Lot History Records (LHRs) and other Quality Records, as appropriate, and complies with documented requirements company policies and procedures, including quality, safety, and environmental policies..  Essential Job Functions Setup of Production LinePerformance and Support of Production Assembly OperationsDocumentationExperimental Assembly/Pilot DevelopmentReviews LHR to ensure correct documentation is at workstation(s); obtains new documentation (i.e., latest MI revision) from supervisor or lead, if necessary.Setup equipment, obtains tools and materials required by LHR.Cleans workstations/equipment and performs line clearance per documented procedures.Signs/dates documentation to verify completion of setup procedures.Builds subassemblies and/or final assemblies per MIs.Performs in‑process inspections (i.e., qualitative [visual or tactile] and quantitative [dimensional]) of components/materials, subassemblies, and final assemblies to ensure that specifications are met and/or for data collection and analysis (e.g., statistical process control [SPC]).Monitors equipment parameters and results of in‑process inspection(s); as necessary, makes adjustments according to documented procedures to ensure product meets appropriate quality specifications.Prepares labeling, audits labeled product for product information per LHRs (e.g., part number, description, expiration date), and assembles final product packaging. Records and dispositions labeling materials used, destroyed, and leftover from packaging operations.Ensures that only products labeled correctly are released to finished goods according to documentation.Prepares packaging for shipment by boxing, adheres inventory control labeling, and verifies that quantity of boxed product matches quantity recorded on DHR. Assists lead assemblers in training new assemblers. Records details of work and completes required portions of LHR to ensure traceability of each finished product lot. Assists supervisor and/or lead with inventory control issues (e.g., scrap transactions, back flushing of finished products and subassemblies).Records process and product measurement data for quality control purposes, as required.Documents scrap resulting from out-of-specification equipment, materials, processes (i.e., non-conforming materials) according to documented procedures and notifies supervisor that disposition and/or corrective action may be required.Contributes to experimental builds using documented guidelines provided by engineers to assist in the product development process.Records results using data collection forms provided by engineers.Contributes to the development of improved manufacturing methods by sharing ideas with engineers and management through both verbal and written communication.Other duties as assigned. These job requirements are not intended to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnelRequirementsExperience in assembly of medical devices (varies by level of assembler).Requires moderate supervision for routine work and close supervision for special assignments.Assembly and testing of medical devices, including soldering, gluing, and assembly using microscopes and electrical test measurement equipment.Capable of filling out detailed LHRsAbility to work in a fast-paced environment while managing multiple prioritiesOperate as a team and/or independently while demonstrating flexibility to changing requirements.There may be continuous sitting for prolonged periods (more than 2 consecutive hours in an 8 hour day)Employee may be required to lift objects up to 25lbs or more. Employees will be required to work in an air conditioned office space and possibly perform some tasks in our non-temperature controlled warehouse space.Benefits Shockwave Medical offers competitive salary, equity and healthcare. If you have experience and initiative for this fast paced fun start-up, please apply."}