{"jobID": "2802451454", "jobLocation": "Burbank_CA", "jobTitle": "Salesforce Administrator and Data Analyst - CRM Systems", "companyRating": null, "companyInfo": {"Website": "www.mastechdigital.com", "Headquarters": "Moon Township, PA", "Size": "1001 to 5000 employees", "Founded": " 1986", "Type": " Company - Public (MHH) ", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Mastech Digital provides digital and mainstream technology staff as well as Digital Transformation Services for leading American Corporations. We are currently seeking a Salesforce Administrator and Data Analyst for our client in the Healthcare domain. We value our professionals, providing comprehensive benefits, exciting challenges, and the opportunity for growth. This is a Contract position and the client is looking for someone to start immediately. Duration: 6 Months Contract Location: Oakland, CA Compensation: Best Market Rates Role:Salesforce Administrator and Data Analyst- CRM SystemsPrimary Skill: MS ExcelRole Description: The Salesforce Administrator would need to have at least 3+ years of experience. In this role as the Salesforce Administrator and Data Analyst - CRM Systems, you will work closely with SalesConnect program staff, technical team members, project managers, business users, and the IT staff to deliver customer management projects ranging in size from minor enhancements to major multi-year initiatives.  As the Analyst, you will play a key role in supporting and administering SalesConnect, and assist in data loading, cleansing and transformation requests. Duties/Typical Activities: The Salesforce Administrator and Data Analyst - CRM Systems will perform a variety of project-related activities, including:  - Serving as a knowledge resource for Salesforce administration, reports, dashboards and data import/export tools.  - Support ad hoc requests from reports, dashboards, data load, data migration, data cleansing and data transformation  - Configuring working prototypes and performing business process reviews to validate and refine prototypes.  - Defining the Salesforce.com configuration required to support functional and non-functional requirements and business processes.  - Strong analytical skills and detail oriented  - Comfortable working in an Agile environment using Scrum framework  - Passion for quality and peer reviews  - Will work under the guidance of Lead Data Analyst and/or architect  - Pride of ownership  - Passion for self-development Required Experience and Qualifications: - Degree in Computer Science, Software Engineering, Business Administration or related field.  - 3 or more years of progressive experience as a Salesforce administrator with strong knowledge of Salesforce.com reports and dashboard.  - Experience using data import/export tools such data loader or workbench.  - Certification as Salesforce.com Administrator or equivalent experience.  - Experience working with Salesforce.com in a large organization.  - Experience using MS-Excel, MS-Access  - Experience with query languages such as SQL or T-SQL  - Effective personal communication and client-facing skills with technical and management staff.  - Familiarity with Scrum framework artifacts and ceremonies  - Experience in summarizing and presenting complex topics to non-technical audiences. Education: Bachelor’s degree in Computer Science, Electrical/Electronic Engineering, Information Technology or another related field Experience: Minimum 3+ years Relocation: No, this position will not cover relocation expenses Travel: N/A Local Preferred: Yes We are looking only for candidates willing to join us directly as W2 employeesRecruiter Name: Kumar SwetankRecruiter Phone: 877-884-8834 (Ext: 2163)Equal Employment Opportunity"}