{"jobID": "2635198666", "jobLocation": "Boston_MA", "jobTitle": "ETL Data Analyst- Spanish Speaking", "companyRating": null, "companyInfo": {"Website": "www.axiscorporate.com", "Headquarters": "Barcelona, Spain", "Size": "201 to 500 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Axis CorporateWe are an international management consulting firm dedicated to improving business results of our clients. We enhance enterprise performance, from strategy, through business model definition to operational impact.  We work on global and complex transformation projects, partnering with our clients, advising them and implementing sustainable improvements across the organization. We directly affect the growth levers and key performance metrics of our clients through improved profitability and efficiencies.  Axis Corporate was founded in 2005 and has grown to a team of 200 professionals worldwide, with offices in Barcelona, Madrid, London Frankfurt, New York, Boston and Sao Paulo.  Our clients range from local and international financial institutions who undertake complex transformation projects. Offer descriptionStart Date : Mid January Location : Boston, MA Languages : English AND Spanish Reports to: Boston Manager Minimum education: Bachelor’s degree RequirementsMUST HAVEVast Knowledge and experience in data ETL (Extract, Transform and Load) in order to manage the project not complete these tasks.Minimum of five end-to-end projects completed from System requirements,ETL design/development/configurationDatabase data modeling activitiesExperiences need to include:data mapping/ETL development/testing/database design (for operational systems, data warehouses and data marts)Fluent SpanishExperience in Project life cycle activities on development and maintenance projects.Should have very strong analytical skillsExcellent oral and written communications skills.Ability to engage in senior-level technology discussions.Ability to coach and mentor a broad constituency –Technical Leads, Engineers, Partners, & CustomersAbility to work in team in diverse/ multiple stakeholder environmentPLUS TO HAVEExperience with additional Business Intelligence and analytics tools (i.e.: SAS, Cognos, Business Objects, Tableau, etc.)3+ years of consulting experience (client-facing) related to data integration, ETL and data warehousing design and implementationExperience with implementations for Bank clientsAxis Corporate offers a Core benefits program which includes: medical, dental, short and long term disability, life insurance and a 401k with company match and an annual 10% bonus. To perform this job successfully, an individual must be able to perform each essential duty satisfactorily within the context of the representative work environment and physical demands described above. Likewise, qualifications listed are representative of the knowledge, skills, and abilities required to perform the position’s essential functions. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  AXIS CORPORATE is an Equal Opportunity Employer (EOE)"}