{"jobID": "2831028306", "jobLocation": "San_Diego_CA", "jobTitle": "Supplier Quality Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.ga.com", "Headquarters": "San Diego, CA", "Size": "5001 to 10000 employees", "Founded": " 1955", "Type": " Company - Private", "Industry": " Aerospace & Defense", "Revenue": " Unknown / Non-Applicable", "Competitors": " Northrop Grumman, Raytheon, Lockheed Martin"}, "estimatedSalary": "67000", "jobDescription": " General Atomics (GA), and its affiliated companies, is one of the world's leading resources for high-technology systems development ranging from the nuclear fuel cycle to remotely piloted aircraft, airborne sensors, and advanced electric, electronic, wireless and laser technologies.  General Atomics Electromagnetic Systems (GA-EMS) designs and manufactures first-of-a-kind electromagnetic and electric power generation systems. GA-EMS' expanding portfolio of specialized products and integrated system solutions support critical fleet, space systems and satellites, missile defense, power and energy, and process and monitoring applications for defense, industrial, and commercial customers worldwide.  We currently have an exciting opportunity for a Quality Assurance Department Specialist to support our Electromagnetic Systems Group located in Rancho Bernardo, CA. Under general direction, this position is responsible for analyzing supplier performance data and suggesting related areas of improvement. Ensures that quality performance and records conform to established Company and regulatory standards; may recommend actions, dispositions and modifications. Interfaces with manufacturing, engineering, customers, vendors and subcontractor representatives to ensure requirements are met. DUTIES AND RESPONSIBILITIES:Gathers supplier quality related data and conducts analysis across programs or business areas with the goal of improving supplier performance.Identifies underperforming suppliers and may suggest improvements or resolutions to problems.Develops supplier surveillance reports for the company's supplier management program and reviews results with management.Support Supplier Quality Engineering team to ensure suppliers improve on current performance issues.Analyzes documentation for compliance to ISO 9001/AS 9100 standards.May participate in training of personnel; participates in developing curriculums for training.May provide direction to less experienced staff.Responsible for observing all laws, regulations, and other applicable obligations wherever and whenever business is conducted on behalf of the Company. Expected to work in a safe manner in accordance with established operating procedures and practices.Performs other duties as assigned or required. We recognize and appreciate the value and contributions of individuals with diverse backgrounds and experiences and welcome all qualified individuals to apply. Typically requires a Bachelors degree in Manufacturing Technology, Engineering, Mathematics or related field and six or more years of experience working as a quality analyst and auditor in a manufacturing environment. May substitute additional experience as a quality analyst in lieu of education.Must have critical thinking and self-starting problem-solving skills.Requires a complete understanding of quality procedures and system requirements in a manufacturing environment as well as complete knowledge of quality concepts and principles including manufacturing and quality documentation and MIL standards.The ability to identify and interpret moderately complex data; the ability to develop and present detailed statistical reports and documents.Strong interpersonal, verbal and written communication skills to explain complex information effectively with all levels of employees.Strong organization skills to maintain flow of work within the unit; the ability to establish priorities and meet deadline and strong knowledge of computer operations and applications.Ability to work both independently and in a team environment is essential, as is the ability to work extended hours as required."}