{"jobID": "2826933870", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data scientist with knowledge of PythonR", "companyRating": "2.0", "companyInfo": {"Website": "www.apex-2000.com", "Headquarters": "Chantilly, VA", "Size": "1 to 50 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "107000", "jobDescription": " Job Title* Data scientist with knowledge of PythonR Requirement ID 29958 Location* Los Angeles, CA Duration* 12 months Job Description*Job Details:  Must Have Skills (Top 3 technical skills only) * 1. Data scientist with knowledge of PythonR 2. Knowledge of a variety of machine learning techniques algorithms(clustering, decision tree learning, artificial neural networks, etc.) and their real world advantages drawbacks. Experience creating and using advanced machine learning algorithms and statistics regression, simulation, scenario analysis, modeling, clustering, decision trees, neural networks, etc.  3. Knowledge of advanced statistical techniques and concepts (regression, properties of distributions  Detailed Job Description:  Data scientist with knowledge of PythonR. PythonR expertise with Data Science algorithms Experience using statistical computer languages R, Python. to manipulate data and draw insights from large data sets. Experience working with and creating data architectures.Knowledge of a variety of machine learning techniques algorithms clustering, decision tree learning, artificial neural networks, etc. and their realworld advantages drawbacks. Experience creating and using advanced machine learning algorithm  Minimum years of experience*:5+  Certifications Needed: No  Top 3 responsibilities you would expect the Subcon to shoulder and execute*:  1. Work with stakeholders to identify opportunities for leveraging company data to drive business solutions 2. Assess the effectiveness and accuracy of new data sources and data gathering techniques.  3. Use predictive modeling to increase and optimize customer experiences, revenue generation, ad targeting and other business outcomes.  Interview Process (Is face to face required?)NoBACK | APPLY NOW"}