{"jobID": "2804298137", "jobLocation": "New_York_NY", "jobTitle": "ISV, Partner Account Manager/Sr. Partner Account Manager - Salesforce.org", "companyRating": null, "companyInfo": {"Website": "www.salesforce.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1999", "Type": " Company - Public (CRM) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Oracle, SAP, Google"}, "estimatedSalary": null, "jobDescription": " Everyone who wants to change the world should have the tools and technology to do so. Technology is the most powerful equalizer of our time, providing access to data, knowledge, and--above all--connections. Salesforce.org gets our technology in the hands of nonprofits and educators so they can connect with others and do more good. As a social enterprise, the more missions our technology supports, the more we invest back into technology and communities, creating an endless circle of good. We’re here to help; visit us at Salesforce.org.Title: ISV Partner Account Manager/Sr. Partner Account Manager - Salesforce.orgLocation: San Francisco; Remote Everyone who wants to change the world should have the tools and technology to do so. Technology is the most powerful equalizer of our time, providing access to data, knowledge, and--above all--connections. Salesforce.org gets our technology in the hands of nonprofits and education institutions so they can connect with others and do more good. As a social enterprise, the more missions our technology supports, the more we invest back into technology and communities, creating an endless circle of good.Due to significant growth, we are seeking a seasoned sales professional for our ISV team. The ideal candidate will have at least 5-8 years experience selling enterprise software. The ISV Partner Account Manager is responsible for developing and fostering ISV partnerships and selling the Salesforce Platform as well as our full suite of products to partners focused on Higher Education, K-12, and Nonprofit industries.Responsibilities:Responsible for driving the strategic relationships within partner organizationsDesign and execute GTM business plans, managing cross-functional teams from both the partner and Salesforce.Manage partner relationship to maximize revenue and to ensure partner commitment Manage C-level relationships with partner executivesInitiate joint account planning and strategy sessions liaising with regional sales leads Actively manage opportunity pipeline against Sales objectives/metrics to exceed quarterly and annual targetsGenerating new revenue in existing ISVs Lead qualification for all leads and sales opportunitiesUp-selling and leveraging business from new and established partner relationshipsDriving new pipeline Ability to travel domestically up to 20%Experience/Skills Required:8+ years of Industry experience8+ years of solution sales experience selling OEM, ISV or direct software or SaaS solutions or similarProven consultative sales solution skills, including the ability to articulate a clear, concise return on investment value statement.Account planning and execution skillsAbility to sell C-Level and across Product Development and ITStrong technical aptitudeAbility to sell both bundling an application and deployment of a platformAbility to work in a startup environment A proven track record of driving and closing enterprise dealsStrong time management skillsBachelor's Degree preferredExperience/Skills Desired:Passion and commitment for partner successPassion for mission driven organizationsAbility to maintain a high level of productivity, manage multiple competing priorities, and work effectively under the pressure of time constraints in a fast-paced, complex, collaborative, and team-oriented environmentAbility to drive team success *LI-YPosting StatementSalesforce.com and Salesforce.org are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Headhunters and recruitment agencies may not submit resumes/CVs through this Web site or directly to managers. Salesforce.com and Salesforce.org do not accept unsolicited headhunter and agency resumes. Salesforce.com and Salesforce.org will not pay fees to any third-party agency or company that does not have a signed agreement with Salesforce.com or Salesforce.org.Pursuant to the San Francisco Fair Chance Ordinance and the Los Angeles Fair Chance Initiative for Hiring, Salesforce will consider for employment qualified applicants with arrest and conviction records."}