{"jobID": "2827452352", "jobLocation": "Boston_MA", "jobTitle": "GIS Data Analyst / Developer", "companyRating": "3.1", "companyInfo": {"Website": "www.critigen.com", "Headquarters": "Denver, CO", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "72000", "jobDescription": " Critigen is looking for a GIS Data Analyst/Developer to support high profile client projects. This role will focus on automating GIS data generation and cleansing for the GIS Data Remediation Team on an enterprise GIS transformation project. The ideal candidate will have at least 3-5 years of GIS experience and knowledge of geospatial databases, automation tools, basic computer programming, and a desire to work towards becoming a higher level developer.  This position requires excellent problem solving abilities, strong attention to detail, and the ability to work effectively in a collaborative team environment. The ability to communicate effectively across the organization and an eagerness to learn and grow your career as the company grows, is key to team member success at Critigen.  This position is located at the client site in Waltham MA and will report to the Critigen Workstream Manager. This is a great opportunity for someone looking to rapidly evolve their career in the geospatial field. Key Responsibilities:Utilizing Geographic Information Systems (GIS) and associated software to produce, display, and analyze geographic information.Automating geoprocessing workflows by writing code and using existing software applicationsDesigning and administrating databases using both geospatial and tabular data.Developing and maintaining databases, reports, and mapping related to utility data, and performing quality checks.Conducting vector data production responsibilities.Retrieving and organizing GIS data for reporting, analysis, and presentation purposes.Working with your team to optimize and create efficient solutions.Preferred Background and Experience:Bachelors degree in Geography, GIS, Computer Science, or related area of study.3-5 years of experience with GIS production environments.Experience working with ArcGIS and other GIS databases.Proficiency in ESRI products, Python, SQL, and FME or other ETL systemsPhysical Requirements:Position works in an office environment.Must be able to sit/stand at a desk and utilize a computer, for extended periods of time. Critigen is an Equal Opportunity Employer, Female/Minority/Veterans/Disabled/Sexual Orientation/Gender Identity"}