{"jobID": "2793027228", "jobLocation": "New_York_NY", "jobTitle": "Marketing Insights Intern", "companyRating": null, "companyInfo": {"Website": "www.ubimo.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "We are looking for an intern with passion for understanding consumer behaviors. The Marketing Insights Intern would be responsible for generating marketing insights using mobile location data and help with transforming them into content that demonstrates Ubimo’s superior location intelligence technology.The ideal candidate would have experience working with data, identifying relevant insights to tell a bigger story. Familiarity with marketing disciplines, consumer behavior and verticals such as Retail, QSR, CPG and Auto will be a plus.Deliverables will be celebrated and publicized via various forms, including: published research, infographics, quarterly industry reports /reviews, etc.The position is located in NY and reports to the Head of Product Marketing while working closely with the content and marketing team.ResponsibilitiesBrainstorm and support the ideation of new consumer research initiatives.Conduct the research using Ubimo’s Polaris platform.Present insights, collect feedback and iterate as needed.Develop storylines together with the content team and support the writing process with data as needed.Provide the sales team with ad-hoc research to support the sales process.Participate in the development of consistent research methodologies.Minimum QualificationsBA/BS student in quantitative discipline such Economics, Math, Data Science, etc. (Recent graduates and graduate students are welcome to apply). Minor in Marketing or equivalent work experience is a big plus. Experience in marketing research, digital marketing or analytics is a big plus.Ability to draw conclusions from data with marketing oriented perspectiveAbility to learn fast, follow direction and seek guidance as needed.Positive energy and can-do attitude. Strong team spirit. "}