{"jobID": "2828624603", "jobLocation": "Bronx_NY", "jobTitle": "Per Diem Anatomical Pathologist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "The James J. Peters VA Medical Center, an affiliate of the Icahn School of Medicine at Mount Sinai, the Hospital for Special Surgery, and the Columbia University College of Physicians and Surgeons is recruiting for a Per Diem Anatomical Pathologist to join our Pathology and Laboratory Team. A surgical pathologist with experience or subspecialty training in the areas of GU, heme, or cytology is preferred.Key Functions:Responsible for diagnostic interpretation of specimens.Provides residents and trainees information on specimen processing and evaluation.Reviews gross specimens.Processes and interprets intraoperative frozen sections.Interprets/signs-out surgical pathology specimens within CAP guidelines.Orders/interprets appropriate immunohistochemical and special stains.Implements tasks assigned by the Anatomic Pathology Section Chief.Reviews appropriate clinical history when responsible for autopsy and discuss with clinical team ensuring appropriate consent before proceeding with autopsy.Performs/supervises autopsy and issue preliminary findings within 24 hours and completed report with clinicopathologic correlation within 30 days.Participates in Quality Assurance measures including 10% retrospective review of cases and inter-laboratory comparison programs.Reviews hematology fluids and issue diagnostic interpretation.Participates in required continuing medical education (CME) in order to maintain licensure/privileges.Timely completes VA assigned educational modules.Responsible for diagnostic expertise and sign-out in any area for which sub-specialty training was completed.Basic Requirements:Must be proficient in written and spoken English.Citizenship of the United States.Degree of doctor of medicine or an equivalent degree resulting from a course of education in medicine or osteopathic medicine.Current, full and unrestricted license to practice medicine or surgery in a State, Territory, or Commonwealth of the United States, or in the District of Columbia.Interested applicants should submit a currentCV and the names of three references to Elizabeth Houser, Human Resources (05), James J. Peters VA Medical Center, 130 West Kingsbridge Road, Bronx NY 10468 or by fax to 718-741-4598 or email to elizabeth.houser@va.govThe VA is an EOE M/F/V/H."}