{"jobID": "2808468049", "jobLocation": "New_York_NY", "jobTitle": "Mobile Associate-Retail Sales, Bilingual -Spanish", "companyRating": null, "companyInfo": {"Website": "www.tmobile.careers", "Headquarters": "Bellevue, WA", "Size": "10000+ employees", "Founded": " 2001", "Type": " Company - Public (TMUS) ", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " Verizon Wireless, Sprint, AT&T"}, "estimatedSalary": null, "jobDescription": "Job Description: Mobile Associate (MA) work as part of a Retail Team of Experts to bring the T-Mobile brand to life. They live and breathe T-Mobile! Theyre brand ambassadors who create energy and excitement around our products and services. They are obsessed with the connected world and thrive in a fast-paced environment, where technology innovations, customer needs and the Retail experience are continuously evolving. They immerse themselves in meaningful connections with our customers, and their ability to build new and deepen existing relationships is unmatched across the wireless industry. They continuously work to build expertise in uncovering our customers needs and have a passion to educate, demonstrate and recommend device and service solutions. This role is a learning role, where new experts are working with their team and proactively building skills and competencies, in preparation for the next level up as a Mobile Expert. Responsibilities: Builds proficiency related to serving and selling to our customers, while providing a best in class customer experience and building loyalty by: Helping customers pick up right where they left off in their shopping journey, whether online, through Customer Care or in-store.Exploring individual needs and providing hands-on demonstrations of the latest and greatest technology in-store.Side-by-side selling to find personalized solutions beyond the bare-bones device and service plan that keep our customers connected to the people and lifestyle they love, including anything from unique accessories to up and coming Internet of Things (IOT) devices.Guide your customers through their purchasing experience thoughtful questions, informative answers and sharing your expertise.Approaching service and sales needs with patience, honesty and empathy. Becomes skilled with and consistently leverages digital tools in interactions and onboarding to actively demonstrate: • How our ever expanding-coverage stacks up in our customers neighborhood, providing them with a lightning fast LTE network! Why T-Mobile plans and services will let our customers live unlimited, feel the love, stay connected and go further.How were redefining how wireless is done, down to device and account inspection, review and troubleshooting. Completes training on T-Mobile in-store experience, new skills and processes, knowledge of systems and reference resources.  Makes the most of their time on shift, consistently seeking out information between customers, learning about innovations in wireless and technology.  Builds relationships with and partners with T-Mobile employees across channels, including business and customer service to: Collectively own the customer experience and resolve issues, creating a seamless, run-around-free environment.Successfully identify and handoff small business leads.Qualifications:Passionate customer advocate with the desire to be yourself when connecting and having fun with our customers.Desire to be a part of the game-changing T-Mobile store team.Competitive drive and confidence to succeed in a fast-paced sales environment.Willingness to work alongside peers and store leaders, learning and sharing best practices, while serving customers and providing resolutions to issues.Effective at balancing customer experience and performance goals.Minimum Qualifications:6 months of customer service and/or sales experience, Retail environment preferredAt least 18 years of ageLegally authorized to work in the United StatesHigh School Diploma or GEDWork varied shifts, seven days per week, which may include evenings, weekends, and holidaysWritten and verbal communication skillsTech savvyDemonstrated creative problem solvingBilingual: Fluent in English and SpanishCompany Profile: As Americas Un-carrier, T-Mobile US, Inc. (NASDAQ: TMUS) is redefining the way consumers and businesses buy wireless services through leading product and service innovation. The companys advanced nationwide 4G and 4G LTE network delivers outstanding wireless experiences for customers who are unwilling to compromise on quality and value. Based in Bellevue, Washington, T-Mobile US provides services through its subsidiaries and operates its flagship brands, T-Mobile and MetroPCS. For more information, please visit http://www.t-mobile.com EOE Statement: We Take Equal Opportunity Seriously - By Choice  T-Mobile USA, Inc. is an Equal Opportunity Employer. All decisions concerning the employment relationship will be made without regard to age, race, ethnicity, color, religion, creed, sex, sexual orientation, gender identity or expression, national origin, marital status, citizenship status, veteran status, the presence of any physical or mental disability, or any other status or characteristic protected by federal, state, or local law. Discrimination or harassment based upon any of these factors is wholly inconsistent with our Company values and will not be tolerated. Furthermore, such discrimination or harassment may violate federal, state, or local law. "}