{"jobID": "2807992419", "jobLocation": "Walnut_Creek_CA", "jobTitle": "Marketing Coordinator", "companyRating": "4.4", "companyInfo": {"Website": "www.elevatetosequoia.com", "Headquarters": "Walnut Creek, CA", "Size": "201 to 500 employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " Unknown / Non-Applicable", "Competitors": " Greystar, FPI Management"}, "estimatedSalary": "52000", "jobDescription": " You are an effective communicator who desires to learn more about property management marketing. You enjoy working in a fast-paced environment and handling administrative projects in event planning, branding, sales training, and advertising. You are flexible and effective at supporting marketing and sales teams in reaching their goals.  Must haves: Creative mindExcellent verbal and written communication skillsPositive attitudeA focus on detailsSpeedSense of humorSocial media savvyPresentation skillsBachelor's degree Great to haves: Prior residential property management experienceStrong interest in marketing, advertising, or related field What you'll do for us: Assist with event planning and projects related to marketing programs for more than 52 apartment communities throughout the West CoastOversee online reputation management programsManage vendors and other administrative responsibilities for the department What we’ll do for you: Provide a great place to work – you’ll want to show up and give your best self everyday, we promiseAllow you to crush it – by providing you the best training programs in the industryBoost your wardrobe – visa gift cards to shop for work clothes at a variety of well-known retailersMake sure you’re covered – superior health, dental, and vision insurance and a 401(k) program/match that keeps you on track for your futureGive you a break – paid time off for vacation, sick days, holidays, and your birthdayReward you – fun days, generous monthly perks, cash bonuses, and recognition for a job well doneLet you give back – through our purpose program Sequoia Equities is an Equal Employment Opportunity employer and promotes a drug free workplace."}