{"jobID": "2749377251", "jobLocation": "Cambridge_MA", "jobTitle": "Energy & Sustainability Intern", "companyRating": "3.8", "companyInfo": {"Website": "www.cambridgema.gov", "Headquarters": "Cambridge, MA", "Size": "1001 to 5000 employees", "Founded": " 1846", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "55000", "jobDescription": " Employment Opportunities in CambridgeNOTICE OF POSTINGPOSTING DATE: April 26, 2018 Open Until FIlled Cambridge residents are especially encouraged to apply.Department: Public Works Department (DPW)Job Title: Energy & Sustainability InternJob Code: A543Civil Service Position: Non Civil Service positionUnion Affiliation: NoneHours Per Week: 19.5 hours per week; temporary 6 month positionESSENTIAL DUTIES AND RESPONSIBILITIES: The City of Cambridge Department of Public Works plays a critical role in ensuring that City operations meet energy efficiency, greenhouse gas reduction and sustainability goals. The Department is seeking a motivated, well-rounded individual with an eye for detail to provide analytic and program support for energy efficiency and sustainability projects in City facilities. Specific duties include but are not limited to the following: Collecting data and maintaining accuracy of various energy consumption databases, including MassEnergyInsight (MEI), Portfolio Manager and others.Analyzing data and developing reports on energy, greenhouse gas consumption and sustainability projects for facility managers and others.Performing research, analytic support and providing other assistance in support of energy efficiency and other sustainability projects at City facilities.Coordinating with City staff and external partners on intra- and interdepartmental projects.Other duties as assigned.MINIMUM REQUIREMENTS:College or higher-level coursework in building sciences, environmental sciences, public policy or equivalent work experience.Strong interest in and understanding of environmental sustainability and energy management principles and practices.Proficiency in Microsoft Excel and Word, and proficient at learning various software applications for data entry, manipulation and report preparation.Detail-oriented.Ability to work independently and prioritize work assignments to meet schedules and timelinesExperience gathering and organizing data for preparing comprehensive, accurate reports and presentationsExperience working effectively with diverse populations, including City staff, building occupants and students desiredExperience and understanding of building mechanical systems preferred.PHYSICAL DEMANDS: Ability to access, input, and retrieve information at a computer several hours per day. Attend site visits, which may involve walking, bending, squatting, reaching, pulling, pushing, and climbing. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. WORK ENVIRONMENT: General office settings with air conditioning and fluorescent lighting. Work may involve site visits to other building spaces, including conditioned or unconditioned basements, attics, crawlspaces, mechanical rooms and penthouses, as well as outdoor locations in various weather and temperature conditions. RATE: $15.64 – 16.63/hourAPPLICATION PROCEDURE: Internal applicants submit a job bidding form and 2 copies of both your resume and letter of interest; external applicants submit both your resume and letter of interest via email to: employment@cambridgema.gov or to Personnel Dept, Room 309, City Hall, 795 Massachusetts Avenue, Cambridge MA 02139. Fax 617-349-4312. Review of resumes will begin immediately. Position will remain open until filled. The City of Cambridge is an affirmative action/equal opportunity employer. Women, minorities, veterans, members of the LGBTQ+ community, and persons with disabilities are encouraged to apply. CITY OF CAMBRIDGE RESIDENTS ESPECIALLY ARE ENCOURAGED TO APPLY."}