{"jobID": "2795713703", "jobLocation": "Sunnyvale_CA", "jobTitle": "Senior Optical Engineer", "companyRating": "3.4", "companyInfo": {"Website": "www.infinera.com", "Headquarters": "Sunnyvale, CA", "Size": "1001 to 5000 employees", "Founded": " 2001", "Type": " Company - Public (INFN) ", "Industry": " Telecommunications", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Ciena"}, "estimatedSalary": "144000", "jobDescription": " Member of Infinera's Optical Architecture team. Responsible for experimental testing and methodologies to drive the design verification of distributed optical controls and optical performance of Infinera's transmission systems. A unique opportunity to contribute to the design and architecture of highly-advanced optical transport systems based on disruptive photonic integration technology. Essential Functions / Key Responsibilities:Design verification of Infinera transmission systems. This includes test plan creation and execution in alignment with system requirements, development of test infrastructure and processes, troubleshooting and documentation. Cross-functional collaboration with SW, FW and HW teams aimed at delivering high-quality products with aggressive timelines.Validation of optical performance of new hardware including ROADMs based on wavelength selective and multi-cast switches, superchannel coherent transponders, optical performance monitors and hybrid Raman-EDFA line cards.Investigation of potential integration possibilities of Infinera's line system with 3rd party optical equipment as well as cross-platform feasibility studies across Infinera's product suite.Knowledge / Skills / AbilitiesHands-on testing experience with ROADM, WSS, EDFA, Raman amplifiers and coherent transponders desired. Familiarity with optical communication systems, linear and nonlinear impairments such as cross-talk, gain flatness, OSNR, CD, PMD, transients.Hands-on experience with high-speed optical and electrical test equipment and data acquisition.Highly detail-oriented, excellent analytical and troubleshooting skills.Highly motivated team player adept at cross-functional interaction.Excellent verbal and written communication skills.Excellent programming skills. Experience with VB.Net or C++ or Visual Studio.Education / Experience M.S. in Optics/Electrical Engineering or Applied Physics + 3 years of experience Infinera is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, age, status as a protected veteran, or status as a qualified individual with disability. EEO Employer/Vet/Disabled."}