{"jobID": "2795736560", "jobLocation": "San_Francisco_CA", "jobTitle": "Contingent: Quality Analyst Engineer", "companyRating": null, "companyInfo": {"Website": "www.firstrepublic.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 1985", "Type": " Company - Public (FRC) ", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Silicon Valley Bank, City National Bank (Texas)"}, "estimatedSalary": null, "jobDescription": " OverviewFirst Republic is an ultra-high-touch bank that provides extraordinary client service. We believe that one-on-one interactions build lasting relationships. We move quickly to serve our clients’ needs so that their financial transactions are handled with ease and efficiency. Client trust and security are paramount in our line of business. Ultimately, our goal is unsurpassed client satisfaction which will lead to personal referrals – our number one source of new business. We recognize that our competitive advantage starts with our people and our culture. At First Republic, we work hard and move quickly as a very coordinated team. If you are looking for an opportunity to grow and contribute in a fun, fast-paced environment, First Republic is the place for you. We have exceptional people focused on providing extraordinary service.ResponsibilitiesAs part of the Information Services team, the Wealth Management Technology Team drives the vision to create an industry leading, client-centric wealth technology experience. The team is looking for forward thinking, action oriented individuals to help drive the implementation of innovative, cutting-edge solutions.  This position reports to a senior technical resource in Wealth Management Technology and supports the development and implementation of Wealth Management’s technology roadmap. This role has a key responsibility within First Republic to ensure that our client experience within Wealth Management maintains the highest standards of the Bank.  The Software Quality Assurance Engineer supports an agile team in analyzing, designing, building and testing high quality applications that exceeds our customer expectations. The SQA Engineer will review functional requirements and user stories from business partners; design test plans, write test cases, oversee test strategies and perform testing for assigned applications. Design, develop and maintain a modular, extensible and reusable test automation harness and scriptsDevelop, automate and execute test cases to ensure feature enhancements are high quality and provide an intuitive customer experienceIdentify and document bugs in usability and functionality; help engineers troubleshoot issues as they are uncoveredConduct functional, regression and performance testingContinuously improvising on tests, Identify test gaps and come-up with ways to bridge those gapsParticipate in CI/CD discussions and implementationInteract with various stake-holders to execute on product goalsLead test planning and execution activities. Participate in various design, backlog discussions QualificationsExperience & Education: Minimum 5+ years of enterprise software testing experience Technical Skills: Experience with development practices like Unit Testing, Test-Driven DevelopmentExperience with web automation SeleniumExperience with one or more scripting and/or programming languages and/or tools such as: Python, Perl, Shell Professional Skills/Competency: Experience with Agile methodologiesUse methodical and repeatable processes to verify releases meet quality standards before launchApply Quality Engineering principles throughout the agile product life cycle to identify defect and design flawsCollaborate with the development team to improve the quality of the deliverables and ensure the business needs are metProfile manual acceptance criteria and test cases and evaluate automation opportunitiesCreate and maintain reusable components, functions and libraries to reduce maintenance costs, increase efficiency and scalabilityStrong quantitative and analytical skills - ability to quickly analyze data to identify key insights and apply them to the businessExcellent communication skills, including ability to present effectively to both business and technical audiences at all levels of the organizationStrong orientation to clients, including demonstrated ability to understand needs and apply this knowledge to drive data enhancements Personal Skills/Competency: Consistently demonstrates and follows high standards of integrity in business decision-makingLooks toward the broadest possible view of an issue/ challenge; can easily pose future scenarios; can think globally about all aspects of the Bank; can discuss multiple considerations of an issue and forecast them into the future; understands how the Bank works, competes, serves clients, and generates shareholder valueDemonstrates excellent communication and interpersonal skills; able to communicate clearly and concisely in a variety of settings and styles; is effective in a variety of formal presentation and meeting settingsGains support for change by providing context and responding with sensitivity to concerns; takes initiative to recommend/ develop innovative approaches to getting things doneCan quickly find common ground and solve problems for the good of all; is a team player and encourages collaboration Technical Knowledge: SQL – RequiredSeleniun - RequiredWealth Management/Investment Management data experience prefferedTFS/JIRA or other issue tracking application required Mental/Physical Requirements: The ability to learn and comprehend basic instructions; understand the meanings of words and respond effectively; and perform basic arithmetic accurately and quickly.Vision must be sufficient to read data reports, manuals and computer screens.Hearing must be sufficient to understand a conversation at a normal volume, including telephone calls and in person.Speech must be coherent to clearly convey or exchange information, including the giving and receiving of assignments and/or directions.Position involves sitting most of the time, but may involve walking or standing for brief periods of time.Must be able to travel in a limited capacity."}