{"jobID": "2801625572", "jobLocation": "Quincy_MA", "jobTitle": "CL Operations Associate", "companyRating": "3.6", "companyInfo": {"Website": "www.arbella.com", "Headquarters": "Quincy, MA", "Size": "1001 to 5000 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "36000", "jobDescription": "CL Operations AssociateAre you looking for a new challenge with a Best Place to Work Company? Arbella is seeking to grow our Commercial Lines business and strengthen our competiveness in the marketplace. In this role, you will proficiently process our commercial lines policies and partner closely with our underwriters to drive growth, improve profitability, retain accounts and service our agents. As a CL Operations Associate you will be responsible for providing Underwriters with critical information and analysis necessary to make prudent underwriting decisions and to support the underwriting lifecycle. You will learn the fundamentals of the commercial lines business which can lead to future career growth in Operations, Underwriting or Claim.  This opportunity is perfect for a high potential college grad or candidate with some business or service experience. This role includes extensive training, a mentor and a comprehensive onboarding program to put you on the road to success! Apply today! Job DescriptionAccess third party vendor websites to provide supporting documentation for all transactions.Assist the Team Manager in developing documents and procedures.Screen policy transaction requests for missing information and obtains additional data from agent, Underwriting or applicable system.Review reports, trends and interpret policy data.Process policy transactions within established guidelines.Consistently meets Quality and Production Goals, and provides exceptional customer service to our internal and external customers according to standards.Maintain a record of work completed and submit work reports as required.Maintain and keep up to date procedural changes received by e-mail or any other form of communication.Identifies individual training needs and initiates training.Keep Team Manager informed verbally and in writing of activities, and problems including but not limited to the assigned area of responsibility; refers matters beyond limits of authority and expertise to team manager for direction.Makes constructive suggestions to team manager on ways to improve service through processes and workflows to internal and external customers. Performs other related work as required or requested by the Team Manager Required Skills:Bachelor’s degree or equivalent work experience in a business or service environment, some insurance experience a plusAnalytical thinking and aptitude for evaluating and interpreting detailed information and data needed.Ability to independently multi task and respond to changing business prioritiesDemonstrated customer service experience and ability to interact with a wide variety of people.Must be detailed oriented, inquisitive and able to prioritize.Ability to manage multiple information systems and proficient in word, excel and outlook needed."}