{"jobID": "2767713734", "jobLocation": "San_Jose_CA", "jobTitle": "Residential Counselor - TAY", "companyRating": "4.1", "companyInfo": {"Website": "www.unitycare.org", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 1993", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "20", "jobDescription": " Job Title  Residential Counselor - TAY  Position  ID 27037499 Duration  Location  San Jose,  95126 Other Location  DescriptionAbout Unity Care Our mission is to provide quality youth and family programs for the purpose of creating healthier communities through lifelong partnerships. Headquartered in San Jose, with incredible weather, culture and sports, and the SF Bay and ocean just minutes away. Unity Care offers a wide range of services benefiting at-risk and foster youth and their families throughout Northern California. Its signature program, established in 1993, focuses on serving the housing needs of youth in foster care and beyond. The organization provides more than two dozen community-based, education and behavioral health programs, transforming the lives of over 6,000 youth and families annually. We are proud to have one of the most ethnically and culturally diverse workforce in the Bay Area. We have a friendly, servant-leader culture with significant growth opportunities. OVERVIEW: The Residential Counselor assists the Case Manager with the daily oversight of operations of Unity Care Group’s residential treatment program and staff. This role is responsible for assisting the Case Manager with policy and procedure implementation, internal and external communications with staff and county partners, daily coordination and monitoring of services, tracking and/or completion of all mandatory reports, and partnering with the Compliance Department to assist with the evaluation of the residential program for continuous quality improvement. The scope of work is broad and comprehensive, and requires working in partnership and collaboration with a team of professionals as well as work independently to collect, analyze, interpret and report program results. Thursday -Sunday (12am-9am)DIRECT REPORTS:NoneQUALIFICATIONS:RequiredBachelor's DegreeAbility to thoroughly document, and in a timely manner, into Electronic Health Records for program-required documentsMust be a confident and responsible role model with excellent judgmentMust able to work well independently in high stress environmentsMust display a proven dedication to youth through leadership and/or mentoring experiencePreferred60 completed college units from an accredited institutionMinimum of 2 years’ experience working with at-risk youth or adolescent children in a residential setting preferred but not requiredRESPONSIBILITIES INCLUDE (but not limited to):Overall responsibility of the residents’ health and safety, knowing where each resident is and with whom at all times. Counselors can be held liable for negligence.Teach residents to acquire socially acceptable habits of behavior and appearance and to develop improved interpersonal relationships.Uses appropriate authority and discipline as necessary to set limits for behavior and help each resident to develop their own capacity for self-control.Participates as a team member in the development and implementation of treatment plans directed towards the return of the resident to their own home or place of placement.Help each resident to relate to the group and to handle individual problems by utilizing the counseling skills of listening and empathy. Counselors are primarily responsible for dealing with the resident’s’ behavior and feelings as they are related to current reality situations for daily living.Has knowledge of and is able to implement emergency procedures in the event of crisis situations.Maintains daily logs on each resident and keeps additional records such as school, medical visits and incident reports. Keeps record and receipts for expenditure and operates home within daily budget.Follows daily living schedules for residents. Is responsible for the smooth and efficient operation of the structured program and ensures that proper food and rest are provided.Coordinates and supervises educational and recreational programs.Attend regular staff meeting.Manages and maintains home in accordance with administrative policy.Responsible for ongoing, daily management of the group home to keep in ordinance with Community Care Licensing requirements: meal planning and preparation, keeping the house, yard and van clean and orderly, supervising chores that are the responsibility of the resident, and transportation of the resident.Other duties as assigned.Compensation We maintain a collaborative learning environment where people are challenged, grow, and have fun. We offer highly competitive compensation and an excellent benefits package, including generous time off, health and dental benefits, and 403b contribution. Unity Care is an Equal Employee Opportunity employer.  Please send a resume and cover letter to: vhamberry@unitycare.org"}