{"jobID": "2531204724", "jobLocation": "New_York_NY", "jobTitle": "Solutions Strategy Director", "companyRating": "3.7", "companyInfo": {"Website": "www.themindgym.com", "Headquarters": "London, United Kingdom", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "115000", "jobDescription": "The Solutions Strategy Team sit at the heart of Mind Gym, working with clients to solve their business problems by using the latest thinking in psychology and behavioral science. We collaborate with the Client Team (sales) and the Solutions Team (the psychologists who create our products) to make a lasting difference to human performance within companies.Our role is varied - we spend time with clients, using research to learn whats really going on in their business, to help them frame challenges in a way that is solvable through people. We use our passion and knowledge of psychology to craft and propose exciting solutions that will make a real difference. We set the strategic direction for our programs at the outset, and ensure our Solutions Team are set up for success by thoroughly scoping any programme before it is designed.No two weeks are the same, no clients are off limits and no ideas are too creative. Youll get to work on a huge range of topics, from Diversity and Inclusion to Change Leadership, from Innovation to Customer Service, from Management Development to Onboarding. Whatever the topic, youll be empowered and encouraged to put your creative stamp on everything you do. What you'll be doing Meet with clients to discover their people and business challengesBring to life the psychology at the heart of Mind Gyms offerThink creatively to design and propose high-level solutions to solve our clients issuesAttend high-profile meetings with senior business stakeholders to deliver our point of view and solutions to their business issuesHelp to manage the dynamic and growing Solutions Strategy teamBe part of growing Mind Gym year-on-year by supporting the business development team About you A psychologist, preferably (though not essentially) with some experience of working with a team in a related environment such as researching, designing training, and behaviour change interventions Someone who can pass on their passion and curiosity to clients, who is comfortable in a client-facing role, and happy leading high profile meetings with senior stakeholdersAn articulate and influential relationship builder who understands the corporate environment, ideally from a performance management or L&D; lensA strong persuasive communicator, able to talk and write with passion, fluency and brevity Someone with experience of planning and running new business pitches Someone who has experience of managing a small team, of coaching and guiding others to excellence"}