{"jobID": "2806014221", "jobLocation": "Milpitas_CA", "jobTitle": "Software Engineering Co-Op/Intern Xcipio", "companyRating": "3.6", "companyInfo": {"Website": "www.ss8.com", "Headquarters": "Milpitas, CA", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Cylance Inc., Fidelis Cybersecurity, Vectra Networks"}, "estimatedSalary": "55000", "jobDescription": "Software Engineering Co-Op/Intern – XcipioCo-Op/Internship Duration: July 2018 to December 2018  If you are interested to learn how iPhone Wifi calling and Twitter work, what allows your Facebook page show up on your smartphone while you are riding the T, and where the “smartness” of your phone comes from, this is a job for you. This position would expose a candidate to fast-paced Agile software development environment and the inner world of modern telecommunication networks. We are looking for a build engineer intern to improve the build infrastructure of our network mediation product. This is a large product with many components and dependencies in a C++/Make/Linux environment. The responsibilities may include, but are not limited to: Learning how voice over IP works and how it enables various phone featuresResearching new tools and libraries for development, cloud deployment, and automated testingEnhancing automated test software, framework and tools.Creating general-purpose classes and libraries for telecommunication software under supervision of senior engineersCreating test environment reproducing productionWriting Wikis and user instruction documentsSkills and Experience Requirements:Completed coursework in networking, algorithms and data structures is highly desiredSome knowledge of Unix operating environment (Solaris, Linux)Ability to program in multiple static/dynamic/scripting programming languages (C/C++, Java, Groovy, Erlang, Scala, Python, Bash, Tcl, Ruby, etc.)Basic understanding of computer architecture and hardwareHands-on knowledge of virtualization tools, such as VMware or VirtualBox is a plus, though not requiredPrior working experience, such as another co-op in software development or IT is a plusAbility to listen, clarify the requirements, research a problem, and come up with creative solutions (quality of any good student)Inventiveness and curiosity, desire to learnEducation Requirements:Junior or Senior in Bachelor’s program or working on Master’s degree in Computer Science/Electrical Engineering (Math, Natural Sciences, and Engineering are welcome to apply as well)"}