{"jobID": "2789926525", "jobLocation": "New_York_NY", "jobTitle": "Regional Manager - New York Proton Center", "companyRating": "2.9", "companyInfo": {"Website": "www.prohealthcare.com", "Headquarters": "Lake Success, NY", "Size": "1001 to 5000 employees", "Founded": " 1997", "Type": " Subsidiary or Business Segment", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Northwell Health, Stony Brook University Medical, Catholic Health Services of Long Island"}, "estimatedSalary": "76000", "jobDescription": " Located in Manhattan, The New York Proton Center (NYPC) is one of the most unique and respected clinical partnerships in the world of proton therapy. The collaboration between Memorial Sloan Kettering Cancer Center, Montefiore Medical Center and Mount Sinai Health System brings state of the art proton therapy treatment to the patients of New York and the surrounding areas. The Consortium is managed by ProHEALTH Medical Management, LLC.  At ProHEALTH, our goal is to provide quality health care to ensure that our patients get the right care at the right time. We are seeking professional and dedicated individuals to be part of our team, where integrity, compassion, relationships, innovation and performance are among our core principles.  We offer our employees competitive compensation and benefits, flexibility and opportunity for growth and advancement.  The Regional Manager is responsible for managing New York Proton Operations. This role encompasses a broad range of operational disciplines including: support staff management; front-desk operations; clinical operations; supply services; patient relations, oversight of practice budgets; P&L; responsibility; strong analytical skills; regulatory compliance. This position reports to ProHEALTH’s Vice President of Operations.  The Regional Manager will demonstrate a track record of accomplishment in healthcare operations and personnel supervision within a group practice environment and is responsible for operational and financial performance for assigned practices. The Regional Manager is responsible for the recruitment, selection, training, performance evaluation of his/her office staff and works to directly support physicians and other providers in the office setting.  Above all, this position serves to exceed the expectations of patients and all other customers we serve. Essential Functions:Create an environment which is consistent with the company’s values and objectives.Responsible for establishing and achieving financial, customer service goals for the assigned region.Responsible for full revenue cycle processes including posting, collections, monitoring, analysis, trending and training.Responsible for overseeing local management and supporting daily functions. Monitor, track and address KPI trends.Responsible for supporting the Clinical Services strategic mission.Provide leadership and serve as a mentor and a coach to Practice Managers and staff.Assess, monitor and develop office manager’s skill levels to ensure they meet quality standards.Assist the Director of Operations in providing training to achieve positive patient outcomes, employee satisfaction, customer service and clinical excellence.Performs other duties or special projects as assigned.Required Skills & Abilities:Strong interpersonal, oral and written communication skills.Ability to evaluate and monitor clinical capabilities and skill levels.Ability to develop and execute business plans and achieve strategic marketing and operating goals.Ability to manage, develop and motivate employees.Ability to prepare, interpret and analyze financial statements.Required to be proficient in Windows Based office technologies (ex. Word, Excel, PowerPoint).Qualifications:Bachelor’s Degree required, Master’s degree preferred3-5 years related work experience required5+ years supervisory/management experience requiredExperience with healthcare operations leadershipAdvanced skills with Microsoft applications which may include Outlook, Word, Excel, PowerPoint or Access and other web-based applications. May produce complex documents, perform analysis and maintain databases. ProHEALTH strives to maintain a workplace that accepts and appreciates the differences among our employees. The company will not discriminate against any applicant or employee based on age, race, gender, color, religion, national origin, ancestry, disability, marital status, covered veteran status, sexual orientation, gender identity and/or expression, genetic information, status with respect to public assistance or any other characteristic protected by state, federal, or local law."}