{"jobID": "2802707512", "jobLocation": "Los_Angeles_CA", "jobTitle": "2019 - Summer - RAS Systems & Process Assurance Intern", "companyRating": null, "companyInfo": {"Website": "www.rsmus.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1926", "Type": " Private Practice / Firm", "Industry": " Accounting & Legal", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Our clients depend upon effective risk management, internal audit, and governance of enterprise information technology in order to achieve their business objectives. RSM’s Risk Advisory Services Systems and Process Assurance (SPA) serves global middle market leaders aspiring to help transform their IT risk management and assurance capabilities to be aligned to the key risks and strategies of their organization.  SPA professionals provide services related to business process and information technology controls for the various service offerings, including: Consulting with client management on the design and optimization of controls utilizing a general knowledge of business processes, accounting, and information technologies. Create internal control documentation for the engagement including narratives, process and data flowsConsulting with engagement leadership and clients on strategic plans and other business matters, and help to anticipate emerging risks for our clientsExternal financial statement and SOX compliance engagements for application and information technology general computer controlsSystem and Controls (SOC) reporting and other controls opinion servicesTechnical IT controls reviews As an SPA intern, you will jump start your career through a comprehensive training and development program where you will be exposed to all of RSM’s Consulting Solution Practices. This training will include: IT Controls audit, testing and assessment methodologies and techniquesIndustry leading frameworks and methodologies for Sarbanes-Oxley, COBIT, NIST and ITILIT security, ERP risk and control, and IT advisory tools and methodsConsulting process, tools and methodsClient engagement economics As an SPA intern you will be immersed in our culture. Our interns begin their career by being assigned mentors who will assist them through their early days and throughout their careers at RSM. Our staff will have the opportunity to work as a team member on diverse client engagements across a wide variety of clients in the manufacturing, real estate, construction, financial institution, not-for-profit, healthcare, and private equity industries. Position ResponsibilitiesDemonstrate an understanding of business processes, internal control risk management, IT controls, and related regulatory and compliance standardsPerform IT internal audit assurance activities (internal audits over ERP systems, IT security, and other IT systems), perform external audit assurance activities, and perform service organization control services activities related to SSAE18 SOC 1 and SOC 2 reporting servicesUse problem solving and critical thinking skills to quickly identify internal control deficiencies, evaluate their risk implications, and draw the appropriate conclusions to best advise our clientsSupport client engagements by helping plan the audit approach and scope, preparing the audit program, determining auditing procedures, seeing the audit process through completion, and applying internal audit standards in accordance with the Institute of Internal AuditorsExercise professional skepticism, judgment and adhere to the code of ethics while on engagementsAttending appropriate professional meetings and conferences and reading publications to maintain and expand professional knowledgeQualifications: Required: Pursuing a B.A. / B.S. degree or equivalent from accredited universityMajor in Accounting, Management Information Systems, Computer Science, and/or related degreesMinimum 3.0 GPA preferredAbility to travel daily or overnight potentially up to 40% of the timeTravel to assigned client locations is required. Must have access to and ability to arrange for use of reliable modes of transportation to those locations  Preferred:Strong verbal and written communication skillsStrong multi-tasking and project management skillsAbility to work as an effective member of a teamMust possess a high degree of integrity and professionalismCertification or working towards certification as a CPA, CISA, CIA, and/or PMP preferred You want your next step to be the right one. You've worked hard to get where you are today. And now you're ready to use your unique skills, talents and personality to achieve great things. RSM is a place where you are valued as an individual, mentored as a future leader, and recognized for your accomplishments and potential. Working directly with clients, key decision makers and business owners across various industries and geographies, you'll move quickly along the learning curve and our clients will benefit from your fresh perspective.  Experience RSM US. Experience the power of being understood.  RSM is an equal opportunity/affirmative action employer. Minorities/Females/Disabled/Veterans.Job ID req3337Line of Business: Consulting ServicesSubFunction: RAS Technology Risk ConsultingJob Type: Part TimeReq #: req3337Location:  515 South Flower Street, , Los Angeles, CARegion: West RegionJob Category: Business Consulting/TechnologyEmployment Type: Campus InternDegree Required: NoneTravel: Yes"}