{"jobID": "2591175379", "jobLocation": "Boston_MA", "jobTitle": "Business/Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.statestreet.com", "Headquarters": "Boston, MA", "Size": "10000+ employees", "Founded": " 1792", "Type": " Company - Public (STT) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " J.P. Morgan, BNY Mellon, Northern Trust"}, "estimatedSalary": "60000", "jobDescription": " This role will be a part of the Data Repository team within the FRIBS structure (Finance Risk Infrastructure and Business Solutions.) Successful candidate will primarily be responsible for strategic projects that focus on source system knowledge/analysis, complex business requirements, design and delivery, and ETL specifications. This role is expected to form a deep relationship and partnership with the IT development team. Job Description/Qualifications:Minimum 4-5 of related experience in corporate system environments working with large and complex enterprise data warehouse systems.Must have hands on experience in database development and SQL performance tuning.Reviews current data models to understand the as is environment.Creates logical and physical data models for as is and proposed or to be system.Creates entity-relationship diagrams for relational systems and dimensional diagrams for the Data Warehouse, Data Marts and data cubes.Experience/understanding of business process reengineering and business modeling concepts, business systems development and analysis.Strong proven ability to work successfully with business stakeholders and IT Team and manage multiple competing priorities.Knowledge and experience with Data Governance processes, policies and standards.Experience working in an agile development environment.Experience with business processes, data management, data flows, data relationships, data quality standards and processes, and proficiency with data analytics tools.Strong analytical and interpersonal skills.Possession of excellent oral and written communication skills.Experience in financial services industry is a plus."}