{"jobID": "2626648601", "jobLocation": "San_Francisco_CA", "jobTitle": "Tutors", "companyRating": "3.0", "companyInfo": {"Website": "www.lindamoodbell.com", "Headquarters": "San Luis Obispo, CA", "Size": "501 to 1000 employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Education", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Grade Potential, Sylvan Learning Centers, Huntington Learning Centers"}, "estimatedSalary": "18", "jobDescription": " Tracking Code  1032-008  Job DescriptionAbout the Instructor (Tutor) Position:  We are looking for energetic, positive individuals to work as Instructors (Tutors) in a Lindamood-Bell® Learning Center. We teach students of all ages to read and comprehend to their potential, including those with a previous diagnosis such as dyslexia or an autism spectrum disorder.  These positions are seasonal. Paid training in the programs used by Lindamood-Bell is provided. Required hours during the training are generally 8 hours a day, Monday through Friday, for two weeks. Following the training, as a seasonal employee your hours will vary week-to-week according to the instructional needs of the Center.  Our research-validated instruction is comprised of our programs, individualized instruction, and program implementation by our Instructional Quality (IQ) Team. As part of the IQ Team, the Instructor works one-to-one with students, delivering the steps of our programs as prescribed in each student’s lesson plan. About Lindamood-Bell Instructors:Our Instructors benefit from being a part of the IQ Team: accepting and adjusting to feedback in a positive manner, for the benefit of instructional quality.Our Instructors employ a Socratic questioning method to help students develop their language and literacy skills.Our Instructors implement positive-reinforcement strategies that maximize learning--in a cheerful and authentic manner.Many of our Instructors have a background in education. However, successful candidates may instead have a background in childcare, coaching, youth leadership, camp counseling, mentoring, or the performing arts.Our Instructors have excellent reading, spelling, and comprehension skills.Our Instructors have a passion for helping others reach their potential.Responsibilities:Provide one-to-one instruction based upon each client’s learning needsWork with Center Director, Associate Center Director, and Consultant to implement client plansInteract positively and professionally with clients and staff to provide a safe and positive learning environmentBenefits: We believe in the importance of investing in our employees so every member of our Star Cast can succeed to his or her potential. We provide our eligible Star Cast members traditional benefit packages, discounts, and additional perks. Eligibility varies with employment level, location, and may be subject to additional terms and conditions.  If you become part of our Star Cast, here are possible benefits for which you will be eligible: Employees in some states may be eligible for sick pay.Employees who meet specific criteria may also be eligible for a 401(k).Company-wide discounts on many services and products including, Apple products, cell phones, and auto rental deals.About Us:  Lindamood-Bell is an internationally recognized leader in the research and remediation of learning difficulties. Our Learning Centers are located across the United States, as well as in Australia, Canada, Singapore, and the United Kingdom. We provide professional development to educators around the world. Over the years we have partnered with institutions including MIT, Wake Forest University, and Georgetown University, to allow for independent analysis of our instruction. Our work has been recognized by the U.S. Department of Education, and has been reviewed in scientific journals such as Neuron and NeuroImage. Reporting on our success has appeared in: Newsweek, US News and World Report,CNN, BBC and PBS, among others.  For more information, we invite you to visit our website at LindamoodBell.com.  Lindamood-Bell is an Equal Opportunity Employer.  Lindamood-Bell Learning Processes follows applicable requirements regarding applicants and criminal histories.Required SkillsPlease see above.Required ExperiencePlease see above. Instructor, Educator, Teach, Teacher, Tutor, Tutoring, Education, Training, Learning, ClinicianJob Location  San Francisco, California, United States  Position Type  Temporary  Salary 00 - 18.00 USD"}