{"jobID": "2759244369", "jobLocation": "New_York_NY", "jobTitle": "Group Strategy Director - Pharma Brand Insights", "companyRating": "2.9", "companyInfo": {"Website": "www.hallandpartners.com", "Headquarters": "London, United Kingdom", "Size": "201 to 500 employees", "Founded": " 1991", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Kelton, Ipsos, Millward Brown"}, "estimatedSalary": "180000", "jobDescription": "Who we are We help our clients build brand relationships that matter, that are commercially and emotionally rewarding. We do this by understanding people and closing the relationship gap between businesses and people. Our positioning is as a strategic brand consultancy, powered by data and insight. We work with some of the world’s biggest companies shaping their brand relationships for them.  We do this through disciplined strategic thinking. This then acts as a driving force to extract hidden insights from further research investigation and data analytics. Role As a Group Strategy Director, you’ll play a key leadership role in our business. You lead a team and take ownership for several key accounts, reporting into a Partner. You are commercially focused, growing revenue from existing clients and building new revenue streams through new services and products.  You recognize the changes in the competitive landscape and the need to digitally transform our business. You drive adoption of the new thinking, new tools and methodologies to stay ahead. You use clear strategic thinking to build strong personal relationships and influence clients’ strategic decision-making. You run a profitable and efficient business.  You revel in the role of coach and lead your team to think holistically about client problems. You encourage them to experiment and innovate in their work. You provide clear direction to your team, ensuring they are empowered to deliver and have opportunities to learn, stretch and grow in their roles. Core responsibilities Lead client relationships. You work as a consultant with clients to provide them with clear, strategic advice.  Drive organizational transformation within a team. Embrace new thinking, innovation, technologies and methodologies and ensure that they are integrated into client work.  Well-networked, identifying and winning new business opportunities. Leading pitches and looking for opportunities to develop existing clients.  Identify and win new business opportunities with existing and new clients. Accountable for revenue generation and financial management across specific clients and resource management of direct team.  Lead a team, allocating projects and managing resource across clients and projects. Help the team acquire the skills needed to deliver our strategy through coaching, training and on the job learning.  Adopt new ways of working, technologies and methodologies across client accounts  Live and breathes our strategy internally and externally. Brings the strategy and business tools to life for all the team in their roles.  Lead the pitch process on specific clients, overseeing delivery and ensuring only the highest quality work is presented.  Understand the evolving media landscape, the role of digital and the H&P; products. Integrates digital into client strategies.  Innovate, creating new products or offers and champion them with the business.  Collaborate with other H&P; divisions/specialisms as needed to deliver outstanding and unexpected business solutions on both new pitches and continued client relationships.  Actively network and stay up to date with developments in our industry and beyond, identifying and actioning new ways of doing things. Key attributes We are looking for a proactive, positive strategic leader who can inspire and lead teams to deliver our business vision with 8+ years of experience in quantitative pharma research experience. Courageous. Proactive, gets involved and takes decisions when needed. Can challenge clients and is open to debate. Creative. Demonstrates a love of people and brands, steps outside the ordinary to surprise and delight clients. A problem solver, thinking pragmatically to make the complex simple. Curious. Shows a hunger to learn, innovating and experimenting at work. Embraces new ideas and ways of working. Collaborative. Great at working within team environments and getting stuff done together. Takes a leadership role in company initiatives.  Experienced with various kinds of research methods. Commercially-focused and able to create and sell broad thinking and innovative solutions.  Future-focused and digitally savvy, knowledgeable about how to investigate multiple data sources to find answers.  Strong project and stakeholder management skills. Able to lead and prioritize to deliver outstanding quality on time and coach team members to do so.  Outstanding presentation and storytelling skills.  Highly motivated and driven, with a hunger to win and grow our business.  Able to travel extensively as the job requires. What we offer you We believe we have a unique culture. It’s a difficult thing to put into words but it’s all about being challenging yet treating each other with respect. We are naturally curious and we love to learn and discover new things.  We nurture opinions and really respect people who have a point of view and aren’t afraid to share their thinking. We work as teams and responsibilities sit with everyone in that team, whatever their job title. A can-do attitude goes a long way in our business and we don't tolerate egos!  We are passionate about helping our people to learn, stretch and grow. We want this to be a place where people feel challenged, as well as guided and supported. They learn a lot from the people around them and taking on new challenges or stretch projects.  We have a Learn calendar packed with opportunities to attend interactive training sessions. From OutsideIn sessions with industry experts to 15 minutes of Fame sessions with colleagues to share the great work we do- there are lots of ways to build your skills for the future.  This is key as we pride ourselves on offering strategic thinking and advice to clients that is creative and insightful. Benefits We want our people to feel rewarded for the great work they do. Here are some of the benefits we offer.  Comprehensive benefits program (including medical, dental and vision coverage)  401k program  Group life insurance  Generous vacation policy  Discretionary summer Friday bonus days  Employee Discount programs  To find out more about Hall & Partners click here to check us out online. Hall & Partners is an equal opportunity employer and are strongly committed to promoting equal opportunity. We maintain an Equal Opportunities, Diversity and Anti-Harassment Policy to inform, guide and encourage equal opportunities practices within the Company. We are also part of the Omnicom group and together we promote and embrace equality and diversity through anumber of initiatives such as Omniwomen, ADCOLOR and Open Pride. You can read more about our commitment to do equalityand diversity here: http://www.omnicomgroup.com/culture/diversity/"}