{"jobID": "2722484405", "jobLocation": "New_York_NY", "jobTitle": "Student Intern", "companyRating": null, "companyInfo": {"Website": "jobs.nyulangone.org", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1841", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " NewYork-Presbyterian Hospital, Northwell Health"}, "estimatedSalary": null, "jobDescription": "NYU Langone Health is a world-class, patient-centered, integrated academic medical center, known for its excellence in clinical care, research, and education. It comprises more than 200 locations throughout the New York area, including five inpatient locations, a children’s hospital, three emergency rooms and a level 1 trauma center. Also part of NYU Langone Health is the Laura and Isaac Perlmutter Cancer Center, a National Cancer Institute¿designated cancer center, and NYU School of Medicine, which since 1841 has trained thousands of physicians and scientists who have helped to shape the course of medical history. For more information, go to nyulangone.org, and interact with us on Facebook, Twitter, YouTube and Instagram. Position Summary: We have an exciting opportunity to join our team as a Student Intern.  In this role, the successful candidate The Performance Management Office analyst will integrate real time data through the use of business intelligence tools into useful information and metrics that will drive leadership strategic decision-making and allow department managers to immediately act on adverse trends . The analyst will provide transparency of data and targets through various performance tools such as dashboards and scorecards which seek to increase throughput, improve productivity, and gain operational efficiencies. This position requires a keen analytical ability to synthesize the data and correlation of metrics that will support achievement of organizational goals in clinical, operational and financial performance at NYU Hospitals Center. Job Responsibilities:Analyze data for performance trends, significant results (variances) and opportunities for improvement based on sound scientific methodology. Utilize analytical reporting / BI tools in designing reports, scorecards and dashboards to provide the appropriate detail information to diagnose reasons for unfavorable performance. Review quality, financial and operational metrics and correlate metrics using statistical methods that will provide insight into causal effect of performance outcomes. Keep abreast of new developments, techniques and methods regarding technical solutions in supporting performance management systems.Provide analytical support to projects in the development of organizational metrics and KPIs utilizing sound definitions and data sources in collaboration with management and department business owners. Work with IT in maintaining the enterprise data warehouse to include the necessary data fields used for accurate technical specifications and methodology of metrics. Participate in the governance of metric definitions and maintenance of a Web-based Business Glossary that will ensure consistent reporting. Perform necessary research including literary searches in the development and tracking of performance metrics and for benchmarking data.Responsible for the timely dashboard posting of Performance Management tools including the Hospital Balanced Scorecard as well as other tools that seek increased throughput, productivity and operational efficiencies. Ensure a data integrity process by performing quality assurance checks on all inputs and outputs on performance metric reports and establish a routine data collection process with business owners in validation of data. Collaborate and facilitate meetings with other departments including IT and Finance in developing and addressing issues with performance management systems. Assist in facilitating standing interdisciplinary meetings to review data quality or system design and functionality issues. Act as a resource to dashboard users and provide training to hospital department managers in the utilization of performance management tools.Prepare and distribute standing and ad hoc reports. Ensure reports meet quality standards that are appropriate for presentation to Senior Leadership, Hospital Administration, and Department Managers at various committee meetings.Minimum Qualifications: To qualify you must have a Bachelors degree in business administration, computer science, health care administration, or related field.  Minimum of two years experience in an analytical role with demonstrated knowledge of financial concepts, statistical analysis and software applications. Experience in Healthcare with EPIC is a plus  Good business sense with strong analytical and problem solving skills.  Advanced knowledge of Excel required with experience in other data analysis and Business Intelligence tools (Business Objects and Tableau preferred). Proficiency with Microsoft Office Suite  Excellent written and oral communication skills. Qualified candidates must be able to effectively communicate with all levels of the organization. NYU Langone Health provides its staff with far more than just a place to work. Rather, we are an institution you can be proud of, an institution where you’ll feel good about devoting your time and your talents.  NYU Langone Health is an equal opportunity and affirmative action employer committed to diversity and inclusion in all aspects of recruiting and employment. All qualified individuals are encouraged to apply and will receive consideration without regard to race, color, gender, gender identity or expression, sex, sexual orientation, transgender status, gender dysphoria, national origin, age, religion, disability, military and veteran status, marital or parental status, citizenship status, genetic information or any other factor which cannot lawfully be used as a basis for an employment decision. We require applications to be completed online.  If you wish to view NYU Langone Health’s EEO policies, please click here. Please click here to view the Federal “EEO is the law” poster or visit https://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm for more information. To view the Pay Transparency Notice, please click here."}