{"jobID": "2817743189", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Scientist / Business Analytics and Optimization Consultant", "companyRating": "3.6", "companyInfo": {"Website": "www.ibm.com", "Headquarters": "Armonk, NY", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Public (IBM) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Accenture, Microsoft"}, "estimatedSalary": "121000", "jobDescription": "Job Description The IBM Digital Business Group (DBG) was formed to expand IBMs reach beyond its conventional client base. It aspires to unleash IBM to empower the world and is responsible for unlocking the $390 Billion of business not addressed by IBM today. You will be a member of the global Data Science and Optimization team in the Digital Business Group. We are an innovation lab that accelerates growth and efficiencies for IBMs digital business in the cognitive era. Our mission is to improve business outcomes by enabling better decisions and better experiences across the organization and for our clients with forward-looking insights and prescriptive evidence-based recommendations. You will drive growth and efficiencies, by developing and deploying new analytical capabilities to help (1) match client needs with solutions and increase the value IBM delivers, (2) reach more clients, (3) optimize the allocation of resource for efficiency and an improved client experience. Key responsibilities:Work with the Chief Digital Officers, Digital Sales, Sales Acceleration, and the Chief Data Scientist to develop a portfolio of projects that will drive competitive advantage for DBG.Manage your portfolio of projects and relationships with key stakeholders.Develop data and analysis requirements, collect data, prepare data for analysis, conduct analysis, quality-assure findings, interpret findings in their business context, assess business implications, develop recommendations, promote their adoption, guide execution/transformation, and assess business impact.Employ appropriate types of analysis techniques, including statistical analysis and optimization, to describe behaviors, explain relationships, make predictions, measure performance, control outcomes, optimize actions.Harness domain knowledge of sales and marketing techniques along with IBMs suite of products and services to maximize impact on strategic objectives.Deliver new actionable insights for smarter selling based on solid evidence in data, along with clear articulation of the benefits and the implementation strategy.Engage with IT leadership to drive data availability and to embed analytics into systems and processes. Required Technical and Professional Expertise M.S. or Ph.D. degree in a quantitative discipline, such as Statistics, Operations Research, Computer Science.At least 4 years of experience extracting, integrating, transforming, analyzing, and modeling real-world structured and unstructured data, programming tools such as R, Spark MLlib, SPSS, Python, SAS, and SQL.At least 4 years of experience in devising mathematical methodologies for drawing inductive inferences from data, such as developing and evaluating statistical regression and classification models, hypothesis testing, design of experiments, and pattern discovery.Readiness to travel 5% annually Preferred Tech and Prof Experience At least 1 year of experience as an analytics consultant in a client-facing business setting, delivering insights and recommendations to improve business results, preferably supporting marketing or sales in a B2B context.Experience with development on R Shiny, Bluemix, web crawling and scraping, natural language processing, Watson APIs, Docker containers, Kubernetes, microservices, Spark, Scala.Experience in mathematical optimization, CPLEX.Preferred work location in Armonk, RTP, Dallas, Atlanta, Dublin, Zurich, Bogota, Cairo. EO Statement  IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status. "}