{"jobID": "2828390775", "jobLocation": "Cambridge_MA", "jobTitle": "Data Scientist-Delivery and Device Innovation", "companyRating": "3.8", "companyInfo": {"Website": "www.lilly.com", "Headquarters": "Indianapolis, IN", "Size": "10000+ employees", "Founded": " 1876", "Type": " Company - Public (LLY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "123000", "jobDescription": " Responsibilities  The Lilly Innovation Center in Cambridge, Massachusetts allows Lilly to explore how next generation therapeutic ecosystems, connected solutions, and data analytics can improve patient health while reducing the clinical, psychosocial and economic burden that is systemic throughout healthcare today. Our team in Cambridge shares a passion for challenging conventional wisdom and creating an environment that embraces prioritizing high-risk, breakthrough concepts. The center provides a start-up environment with large company support. We are located in the core of Massachusetts exploding science and technology cluster, walking distance to some of the best academic and industry innovators in the world. The center has been designed to cultivate collaborative drug, device and technology research across all of Lilly’s therapeutic areas.  We are seeking an entrepreneurially-minded Data Scientist to help drive creative new therapeutic solutions by analyzing large, complex sets of streaming and metadata, applying machine learning and predictive models to develop novel algorithms, acting as a key liaison with strategic IOT partners, supporting clinical trial planning, data collection, and analysis, and providing consultation and analysis for patient- and outcomes-centered product feature development. You will be at the forefront of Lilly’s digital health initiatives, and will interact and collaborate with a diverse pool of talent both in Cambridge and at Lilly’s headquarters in Indianapolis, IN.  .  Responsibilities of this role include:  Contribute to the development of next generation clinical treatment and decision systems through analysis and integration of large datasets from system apps (sensors, wearables), digital biomarkers, open/closed loops, patient outcomes, data registries, claims databases etc., thereby increasing compliance and adherence through patient-centric treatment and decision tools  Use creativity and resourceful application of computational statistics, data mining, and big data capabilities to address the challenges of using statistics in a business setting, such as incomplete data, biased data, large data sets, low signal-to-noise ratios, high variance and multiple objective functions.  Work closely with a diverse team of scientists, engineers, clinicians, statisticians, and IT professionals to identify, evaluate, design, and implement statistical analyses and data exploration/visualization of internal and external, structured, and unstructured data.  Build and share trusted reports and dashboards that transform complicated problems into simple, tractable ones.  Manage multiple projects and exercise good triage and judgement skills.  Seek and identify new opportunities for portfolio expansion, including, for example, identifying appropriate wearables for portfolio support in the diabetes, neurodegenerative and pain, oncology, autoimmune therapeutic areas.  Establish and leverage strategic relationships with academia and start-ups to accelerate and access emerging innovation.  40254BR  Basic Qualifications  Ph.D Computer Science, Data Science, Statistics, or Engineering preferred with 3+ years of relevant professional experience  Strong working knowledge of Python, R, and/or MATLAB  Experience with programming languages such as Java, C, or C++  Experience working with Tableau or similar reporting/data visualization tool  Experience in using machine learning and predictive modeling techniques in an industrial or commercial setting  Additional Skills/Preferences  Familiarity with analytical techniques such as distribution fitting, multivariate statistics, stochastic modeling, time-series modeling, design of experiments, Monte Carlo methods, robust statistics, sampling, segmentation, clustering, hypothesis testing, regression, and forecasting  Strong interpersonal skills and the ability to work productively in an interdisciplinary team environment.  Effective technical writing skills as well as good verbal communication / presentation skills  Experience with big data technologies like Hadoop, HDFS, Spark, Pig, HBase, etc.  Experience working with Amazon’s AWS big data services like EMR, Redshift, S3, or EC2  Familiarity with longitudinal clinical data, electronic medical records, or other healthcare data  Previous medical device / pharmaceutical design / development experiencep"}