{"jobID": "2815497534", "jobLocation": "Boston_MA", "jobTitle": "Business Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The Business Analyst (BA) of the Research Information Systems (RIS) group works closely with and reports to the Manager and will primarily be responsible for analyzing, developing and performing business processes in support of Research Operations. The BA will manage critical business tasks and processes for the efficient and compliant administration of research in support of all units within Research Operations. The BA will provide support to the larger Research community on the research administration systems managed by RIS (InfoEd, VelosCT, ClinCard, SAM).He/She will also assist with identifying process based and technological solutions to other research related administrative issues, along with assisting in the configuration of those systems, onboarding of users, and developing the related communications. Utilize various software tools for data extraction and analysis for project support as well as ad hoc reports for Research Operations senior management.Work on complex problems where analysis of situations or data requires an evaluation of multiple dependent and co-dependent factors.Conduct interviews to gather business requirements, understand and map the full life cycle of business processes to ensure compliance with internal and external policies.Act as liaison between internal and external stakeholders to define, document and review business and system requirements.Participate in process design or improvement initiatives.Assist with and/or create project documentation including functional, technical and conceptual design specifications, requirements/due diligence, use-cases, testing scenarios, process flow charts etc.Document and update documentation for all internal system application and integration projects including user and internal documentation.Comfortable working with and joining multiple large datasets together in Microsoft Excel and Access beyond the intermediate skill level.Database Management and Query/Table/e-Form buildingWork with user groups (internal and external) to provide training, resolve questions, assess user needs and recommend changes to the automated systems.Ability to execute internal and external process audits, and provide quality assurance reviews.Provide standard operating reports for administrative activities in Research Operations.Analyze metric reports to identify & interpret trends, variances and business performance. Communicate findings in a clear and concise format.Participate in and support other Research Operations initiatives/projects by serving as an internal resource.Work with other departments to coordinate activities and project work in order to ensure that BMC meets customer expectations.Managing issues, risks and customer requirements to ensure customers receive prompt, efficient service in accordance with company policies while also gaining formal approval through governance processes.Works with IT on major conversions, upgrades and enhancements.Maintain Departments Internal/External website providing content and design updates via web editing.Assist in overall Software/Systems implementations and integrations.Supervise Interns specific projects or tasks.Provides support for all Research Operations groups fundamental user and research account setup/updates, including specific transactional support for Research Finance (BU Payroll, Account Rolls, FedEx, Signature Authorizations).Participate in identifying, creating, and monitoring current process metrics, process mapping, and if/then analysis on proposed process changes essential to research account managementWorks with users and programmers to optimize system performance.Performs other related duties as required.Utilizes hospitals values as the basis for decision-making and to facilitate the divisions hospital mission. Conforms to hospital standards of performance and conduct, including those pertaining to patient rights, so that the best possible customer service and patient care may be provided. Follows established hospital infection control and safety procedures.  A four-year college degree with a focus on Operations Management.  A minimum of three years of healthcare industry experience with a focus on Research Administration preferred. A five year background in relational databases and systems implementations strongly desired.  Critical thinking skills; ability to handle a variety of tasks simultaneously; quality/process improvement experience; attention to detail; and familiarity with the Microsoft Office suite, including Excel, Access, and PowerPoint; Dreamweaver, and Red-Dot a plus."}