{"jobID": "2707752083", "jobLocation": "New_York_NY", "jobTitle": "Territory Manager - Garment District NY", "companyRating": null, "companyInfo": {"Website": "www.reynoldsamerican.com", "Headquarters": "Winston Salem, NC", "Size": "5001 to 10000 employees", "Founded": " 2004", "Type": " Company - Public (RAI) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Territory Manager - Garment District NY  Apply now » Apply now  Start apply with LinkedIn Start apply with Facebook Apply Now StartPlease wait...Date: Jun 24, 2018 Location: Garment District, NY, US#job-location.job-location-inline {  display: inline;  }Company: RAIReynolds American Incorporated is positively transforming the tobacco industry. We’re a family of companies that strives for success in everything we do. The future inspires us because our people are igniting the breakthroughs that are redefining the ways adult tobacco consumers enjoy tobacco in the 21st century.  When other companies talk about growth, they only talk about size. At RAI, we focus on the growth of our people. We take pride in each other’s growth and well-being throughout our careers. We invest in your career and total well-being because we know our companies succeed when our people thrive.  At the RAI companies you’ll have the opportunity to work on iconic brands and revolutionary products by collaborating with visionary, principled and passionate people every day.  This position is with RAI Trade Marketing Services Company. TRADE MARKETING Trade Marketing is leading the way for our operating companies’ iconic brands and revolutionary products to be successful in market through driving brand development strategies within regional territories.  Working in Trade Marketing is ideal for strong brand ambassadors who are skilled at growing brands within their territories and who thrive while working with talented people in an ever-changing environment. The Trade Marketing team is comprised of diverse thinkers and vibrant personalities with a shared passion for engaging adult tobacco consumers in discussion about the game-changing products manufactured by our operating companies and offering value-added programs and solutions to support customers.  RAI believes that ongoing development opportunities are important to help our people and our companies achieve their goals. Trade Marketing offers extensive training on our operating companies’ products and how to effectively manage territory assignments. In Trade Marketing, you can achieve your career aspirations based on work performance, as well as your desire and ability to lead others. There is a strong commitment to ensure that your professional development is thoughtfully planned, because we want you grow as a leader.  If you consider yourself a self-starter who gets things done and enjoys growing brands through building relationships, then Trade Marketing is a great place to build your exciting career.Break out of the box…. We’re looking for employees who are hungry for responsibility, accountability and a chance to really make an impact! Our salespeople do this by educating and connecting with our adult tobacco consumers in a \"1 to 1\" manner with the purpose of gaining trial and conversion to RJRT/ASC/RJRV brands. We want to establish relationships with our Retail Partners that provide them with valuable insights about the tobacco category, consumer profiles/trends and consistently exceed their expectations in our knowledge and our attentiveness to their overall business needs and the growth of their Total Tobacco Category. We are looking for individuals who thrive in a high performance environment and have the talent to deliver these challenging business objectives. If you have those qualities, we want to give you an opportunity to maximize your potential and begin an exciting career with RAI Trade Marketing Services Company. Here, you’re limited only by your aspirations.Territory Managers / Trade Marketing Representatives are assigned to a geographic territory where they are responsible for: Calling on established traditional and nontraditional retail outletsSelling and executing national/local brand building marketing programs and initiatives within these accountsAchieving assigned quantitative and qualitative sales goals and brand building measuresBuilding outstanding relationships with store managers/owners by providing expert tobacco/consumer insights and advice through the development of individual business plansParticipating in relationship marketing by conducting effective \"1 to 1\" Consumer Engagements through a thorough understanding of Consumer Marketing Brand StrategiesActively promoting the marketing mix through direct discussions with retailers using analytical proficiency and influencing skills to promote a beneficial business plan for RJRT and our retailers.Consistently demonstrating the application of company values in all business interactions. It is expected that Territory Managers / Trade Marketing Representative will become not only a passionate tobacco expert, but a valuable business consultant whose analysis, judgment and knowledge of the consumer and industry dynamics makes for a valuable partner to our retail customers.  Territory Managers will be given in depth training to focus on product sales and distribution, as well as Consumer Marketing Brand Strategies, effective consumer engagement, and tobacco product awareness.RAI Trade Marketing Services Company looks for principled, creative, dynamic and passionate people who display or possess: College degree preferredStrong communication and time management skillsto actively engage and educate Adult Tobacco UsersA willingness to relocate. The location that you apply through may not be the location where you are assigned in the field. You will need to be open to relocation outside of your current location in order to be considered for this position.A valid driver’s licensePassion for tobaccoPersonal motivation for successAn aptitude and understanding of basic computer skillsAbility to analyze problems and offer solutionsADDITIONAL DESIRED QUALIFICATIONS:A passion for winningLeadership, and a willingness to take responsibility and accountabilityProblem-solving and decision-making abilityCreativity and innovationStrong oral- and written-communication skillsBroad, cross-functional business knowledgeTechnical and organizational abilityHonesty, integrity, trustworthiness and dependabilitySelf-motivation and an orientation to actionFlexibility and ability to embrace changeCOMPENSATION/TARGETED BONUSCompetitive annual salaryTargeted Annual BonusRelocation assistance available for those who qualifyBENEFIT SUMMARY RAI Trade Marketing Services Company offers very competitive compensation and benefit plans, including: Generous annual bonus program for all employeesCompany Vehicle ProvidedCell Phone AllowanceDaily-valued 401(k) plan that offers opportunity to save on pre- and post-tax basis up to 50 percent of eligible compensation. Company matches 100 percent of employee pre-tax/Roth (401k) contributions up to six percentComprehensive health and welfare benefits packageEleven paid company holidays annually, plus a generous paid vacation plan based on length of serviceCompany-paid sick and personal days, funeral leave and jury duty leaveEducation initiative plansExtensive training and opportunities for professional and career development --------------------------------------------------------------------------------------------------------------------------------------------- Only applicants requiring reasonable accommodation for any part of the application and hiring process should contact us directly.  Telephone: 262-439-1893  Email: TalentAcquisition@RJRT.comApply now » Apply now  Start apply with LinkedIn Start apply with Facebook Apply Now StartPlease wait..."}