{"jobID": "2827565330", "jobLocation": "San_Francisco_CA", "jobTitle": "Real Estate Transaction Coordinator - East Bay/San Ramon", "companyRating": null, "companyInfo": {"Website": "www.redfin.com", "Headquarters": "Seattle, WA", "Size": "1001 to 5000 employees", "Founded": " 2004", "Type": " Company - Public (RDFN ) ", "Industry": " Real Estate", "Revenue": " Unknown / Non-Applicable", "Competitors": " Zillow, Trulia, Coldwell Banker"}, "estimatedSalary": null, "jobDescription": "Redfin is redefining real estate in the consumer's favor. We combine our own technology and real estate agents to make buying or selling a home faster, easier, and more efficient. At Redfin, you'll have the tools and support you need to thrive in a dynamic, tech-savvy environment where you can grow your career. And unlike other brokerages, we offer all full-time employees the same top-tier benefits. If you're passionate about delighting customers and transforming the real estate industry, join us.As a Redfin Transaction Coordinator, you'll take a lead role in coordinating real estate deals, ensuring that all the details come together seamlessly from contract to close.The RoleAct as a liaison between clients, lenders, attorneys, appraisers, and other partiesAnswer clients' questions and guide them through the closing processCoordinate and schedule post-mutual appointments and eventsBenefit from online tools that allow you to track customer progress and share information across teamsCandidates must be available to work Monday-Friday 9:00am-6:00pmSkills & ExperienceReal estate license requiredExperience in real estate or related field, including processing transactionsExcellent attention to detail; nothing gets past youStrong sense of accountability for the customer experienceCool and calm demeanor when resolving issues and communicating with agents and clientsExperience using email, phone, and customer relationship management tools to communicate with clients and other parties in real estate transactionsWhat We OfferCompetitive hourly wageThree weeks of paid vacation, paid maternity/paternity leave, sick leave, and flex daysMedical, dental, and vision insurance and 401(k)Coverage for MLS dues and state feesInspiring culture with casual dress code, happy hours, and moreRedfin is an equal opportunity employer committed to hiring a diverse workforce.Redfin"}