{"jobID": "2694014259", "jobLocation": "Seattle_WA", "jobTitle": "Remote/Virtual - Social Media Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.justdrivemedia.com", "Headquarters": "Orange Beach, AL", "Size": "1 to 50 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Just Drive Media is looking for a talented VirtualSocial Media Data Analyst to join our team. In this role, you’ll gain valuable experience across a range of global brands, cutting edge tools and emerging techniques, working in close collaboration with other expert Social Media Analysts and Strategists. Through a strong understanding of social platforms, our analysts take an active role in all aspects of data analysis of a social project—identifying a brand’s issues, running competitive benchmarks, forming recommendations, advising on the architecture of programs, and defining the drivers of performance and the KPI or measurement framework. \u2028 While previous social media experience is important, this role is more about Data Analysis than managing, creating content or posting to social channels.This role will not involve taking the lead on these tasks right away, but the hope is that over time, the candidate will develop these skills and be able to take on more of this responsibility. Who we are:Just Drive Media (JDM), an award-winning digital PR & Marketing firm that consistently delivers exceptional results for our clients, which include some of the world’s leading technology/digital brands. We are a diverse group of analysts, social media and content creation experts who provide analytics, social listening, strategy and execution support to clients and other teams across the agency. Our analysts also play an important role testing new tools and technologies, developing new processes, and introducing these to both teams and clients. We work in a fast-paced industry and keeping ahead is what sets us apart. We expect all of our team members to help JDM stay on top of the latest in social media and technology, and continuously improve upon our thinking, our approaches, our recommended programs and tactics. \u2028 We’re also a fully virtual company, which means our team is geographically diverse and enjoys the flexibility of this arrangement. As communications pros, remote collaboration comes naturally to us and works well; it also helps support our core value of a life-work balance. PLEASE NOTE: We are looking for someone who is based either in the USA or Canada and can operate on US time zones.Responsibilities:Owned channel analytics – analyzing and reporting on clients’ social media content and channel performance; identifying what works, what doesn’t, trends, summarizing and making recommendations on how clients can improve performance Social listening - sifting through mountains of social media mentions, refining data sets to narrow to most relevant conversations, and manually assigning sentiment and topic tags for each mention, using third party listening tools and JDM’s proprietary algorithms in Excel. Analysts use this data to spot trends, summarize and report findings back to clients The above processes involve:- Data processing and manipulation Data visualisation and analysis - problem solving and insight developmentReport preparation & delivery - including write-up and development of charts, visuals, etc., primarily in Microsoft PowerPointStaying on top of latest trends and best practices across social channels to help us think through our approaches, our recommendations to clients and new channels and techniques to trySupporting our social engagement team with engagement strategy and tactics, helping us follow through with content development, research, and communicationsActing as an account coordinator - helping account teams stay on track with deadlines, meeting goals and client expectations. And, where appropriate, handling day-to-day interaction with clients Evaluating new tools and technologies, and making recommendations back to team members Essential skills:A creative thinker. Ability to come up with fun, creative ways of approaching marketing campaigns and solutions for problems/challenges that may ariseSocial media savvy with a genuine passion for tech/web, digital innovation and data-driven insightIntermediate/advanced Excel and PPT abilityUnderstanding of business KPIs and how best to measure themProven data analysis, visualization & research skillsExcellent written and verbal communication, strong presentation skills a plusGrowth mindset. An eagerness to learn new things and a willingness to do things that may not fit the job description, as it is likely to evolve over timeSuperior organizational and time management skills. Ability to manage multiple projects and meet deadlines - no excusesSelf-starter. Ability to work remotely with minimal oversight, flagging team members when help or input is needed, and collaborating with others via Skype, email and other communication tools.Sense of humor :) Much of engaging on social media involves having a fun personality and a sense of humor - an ability to be conversational and make jokes where appropriate while maintaining professionalismPLEASE NOTE: We are looking for someone who is based either in the USA or Canada and can operate on US time zones."}