{"jobID": "2639014074", "jobLocation": "Seattle_WA", "jobTitle": "Senior Data Scientist - Search", "companyRating": "3.3", "companyInfo": {"Website": "www.redfin.com", "Headquarters": "Seattle, WA", "Size": "1001 to 5000 employees", "Founded": " 2004", "Type": " Company - Public (RDFN ) ", "Industry": " Real Estate", "Revenue": " Unknown / Non-Applicable", "Competitors": " Zillow, Trulia, Coldwell Banker"}, "estimatedSalary": "147000", "jobDescription": "Redfin is redefining real estate in the consumer's favor by combining our own technology and agents to create a service that's better, faster, and costs less. As a Redfinnian, you'll make a difference in one of life's most important events: buying or selling a home. Our hiring standards are high, yet our culture is humble. No matter what role you have, you'll be both challenged and inspired every day. We've got all the perks, but if what you value most is doing great work in a creative, collaborative, and disciplined environment, join us. In the Senior Data Scientist, Search role you will help Redfin understand and improve the experience of our site users. You'll work with terabytes of clickstream data, acquisition data, and some of the most robust real estate data sets in the world to answer the question, \\\"What does Redfin need to do to keep growing traffic faster than any other major real estate site?\\\" Working with Product Management and Engineering, you'll guide A/B test design, design complex models to drive an understand of traffic and our site users, analyze results, automate manual processes, promote self-service analytics through Tableau, uncover insights, and inform key decisions that directly impact our growth.Who You AreSuccessful: We're looking for someone with at least 5 years of on-the-job experience driving high impact business value through deriving insights from data as well as a demonstrated ability to play an active role in putting your analytical findings into practice.Sharp: You have exceptional analytical and quantitative skills. A B.S. in mathematics, statistics, economics, computer science, engineering or one of the hard sciences is required. An advanced degree is strongly preferred.Creative: You are able to build and automate sophisticated mathematical models. You love to play with massive data sets from various sources to uncover surprising truths and opportunities. Your analyses and models will be used to make major decisions about the direction of our core technology.Practical: Translate ideas and theory into data informed solutions the business can use to grow - we are looking for someone with a practical approach to digging in and doing what needs to be done to get the job done.Curious: Redfin is looking for an analytical juggernaut that doesn't stop at answering the \\\"what\\\" questions. We want someone who hungers for the \\\"why\\\" and \\\"what if\\\" questionsConcise: Communicating your ideas clearly to folks who don't share your passion for analytics is the mark of mastery.Flexible: You are comfortable with a fast past, quick turnaround work environment.Desired Skills & ExperienceTechnical chops: R, Python, SQL, Tableau, Statistical and mathematical modeling are required. Google Analytics, AWS (Redshift, S3, Spark) preferred.Education: A B.S. in mathematics, statistics, economics, computer science, engineering or one of the hard sciences is required. An advanced degree is strongly preferred.What We OfferCompetitive compensation packages with a salary, bonuses, and stock grantsGenerous benefits, including three weeks of paid vacation, medical, dental, and vision insurance, and fully paid family leaveStrong startup culture with catered lunches, casual dress code, happy hours, and moreAmazingly smart and fun teammates, and a management team invested in your growth and successTo make sure we hire the most qualified people, we've designed a multi-step selection process which may include interviews, a homework assignment, and a reference check. We're excited to get to know you and hope you're ready to give this opportunity everything you've got!Redfin is an equal opportunity employer.Redfin"}