{"jobID": "2797734069", "jobLocation": "San_Francisco_CA", "jobTitle": "Acoustics Intern", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Join the leader in entertainment innovation and help us design the future. At Dolby, science meets art, and high tech means more than computer code. As a member of the Dolby team, you'll see and hear the results of your work everywhere, from movie theaters to smartphones. We continue to revolutionize how people create, deliver, and enjoy entertainment worldwide. To do that, we need the absolute best talent. We're big enough to give you all the resources you need, and small enough so you can make a real difference and earn recognition for your work. We offer a collegial culture, challenging projects, and excellent compensation and benefits.  As an acoustical engineer in our SF office, you will collect and characterize acoustic and sound system data from commercial cinemas. Responsibilities will depend on the capabilities of the candidate and will include some or all of the following: making site surveys, characterizing existing sound system designs, taking acoustic and noise measurements, and analysis of acquired data. Education:Currently enrolled in an undergraduate or graduate program in acoustics, architecture, architectural engineering, physics, mechanical engineering or an acoustics-related engineering field.Requirements:Experience with acoustic acquisition/measurement tools, techniques, and procedures.Experience or ability to readily learn applications such as DIRAC, EASE, CATT, Matlab.Demonstrated excellent written and verbal communication skills, with the ability to professionally interact with external facility managers.Willing and able to travel within the SF Bay area and beyond (western US).Desired experience and background:Have an excellent academic record (90th percentile or higher in major)Have completed at least two upper-level courses in their majorExperience or interest in acoustic data analysis.Experience or interest statistical data analysis. Dolby will consider qualified applicants with criminal histories in a manner consistent with the requirements of San Francisco Police Code, Article 49, and Administrative Code, Article 12 Equal Employment Opportunity: Dolby is proud to be an equal opportunity employer. Our success depends on the combined skills and talents of all our employees. We are committed to making employment decisions without regard to race, religious creed, color, age, sex, sexual orientation, gender identity, national origin, religion, marital status, family status, medical condition, disability, military service, pregnancy, childbirth and related medical conditions or any other classification protected by federal, state, and local laws and ordinances.  #LI-AS1SDL2017"}