{"jobID": "2488280257", "jobLocation": "Seattle_WA", "jobTitle": "(CONTRACT) Data Analyst - Information Technology", "companyRating": null, "companyInfo": {"Website": "www.verticalmove.com", "Headquarters": "Kirkland, WA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Apply Now »  (CONTRACT) Data Analyst - Information Technology  « Back to results  Apply Now  * First Name  * Last Name  * Email  * Mobile Phone Number  --None--Dice Indeed LinkedIn ZipRecruiter Glassdoor Monster Simply Hired Craigslist FlexJobs Facebook Twitter Other * How did you find out about this job?  Cover Letter  Upload Cover letter Here  Paste Cover Letter Here  Resume  *Upload Resume Here  Paste Resume Here  My Careers | My Posts | About Me Matthew Allen Principal Recruiter Phone WorkPhone Fax http://www.linkedin.com/in/vmoveEmail:  mallen@verticalmove.com Nice to meet you! I'm often regarded as one of the geekiest Recruiters in the industry and I couldn't be more proud to be honest. I've loved computers since my Texas Instruments TI-99/4A in 1981, followed by a Laser 128, which was an Apple II clone manufactured by Vtech. I introduced Apple Logo (think similar to Lisp) to my Elementary School and helped teach after school classes on the Apple II. Fast forward three-decades later, I'm still playing with code, deploying systems on AWS EC2/S3 and for the past 16+ years have built some of the most prestigious enterprise and consumer software companies in the world. You can expect that I will never spam your resume anywhere. I'm incredibly technical and have a deep understanding the technology and trends that make our industry go around. I'm a wealth of opportunities that you wouldn't likely find elsewhere as the best roles are rarely advertised.Recent Postshttp://www.verticalmove.com Job Info Category Information Technology Employment Type Contract or Full-Time Compensation $0.00 - $0.00 Location United States, WA - 98034 Client Introduction Verticalmove, Inc. is the leading technology talent firm for Information Technology, Software Engineering and Executive professionals. We build the most admired companies throughout the world by identifying and attracting highly qualified and often hard to find professional talent. Our portfolio of clients include start-ups financed by the most exclusive venture capital firms, and established billion-dollar brands such as Salesforce.com, Uber, Cisco, SAP, American Express and CenturyLink. Being part of our Information Technology and Engineering consultancy means you’ll have industry leading benefits too, including Health (medical, dental, vision and life insurance), Paid Time Off (sick and vacation) and Retirement (401k with a 4% match). Please follow us for valuable content, interview advice, compensation data and job opportunities: https://twitter.com/vmove https://www.linkedin.com/company/verticalmove-inc. Job Description This position will be responsible for identifying and analyzing data from several different sources including the commerce platform, payment providers, and financial reporting data along with publishing and presenting cost of payments and platform performance. Job Responsibilities ** Comprehend complex payment and billing workflows in an ecommerce transaction system. ** Collect and present advice to key decision makers on how to achieve ultimate platform performance, revenue, and profitability goals. ** Coordinate and interact with individuals across several different business units. ** Give regular reports on key findings. ** Ensure all goals are met including costs and performance metrics. Experience Required Experience ** Minimum three years prior similar work experience. ** Familiar and comfortable with researching and analyzing payments data and presenting findings/recommendations to appropriate departments. ** Experience working in ecommerce payments industry. ** Superb communication skills – both written and verbal. ** Ability to stay motivated and inspire others around you. ** A strong self-starter who needs minimal management supervision. ** Great organization skills. ** Ability to multitask and meet all required deadlines ** Ability to work well both in a team environment and alone. ** Proficient and extensive experience working in Word, excel, PowerPoint and SharePoint. ** Confident and able to lead others. Required Education ** BS/MS Preferred, Some College Is Acceptable.  h2{margin-top: 30px; border-bottom: 1px dotted #ccc;padding-bottom: 10px;margin-bottom: 10px;} "}