{"jobID": "2816476742", "jobLocation": "Boston_MA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.neurable.com", "Headquarters": "Cambridge, MA", "Size": "1 to 50 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We are looking for a Data Scientist to join our team. Someone who wants to embed themselves into the fabric of the company, tackling not only interesting but also meaningful challenges. You’re not going to be putting together reports, for someone to review, to then discuss, to maybe never incorporate. This isn’t another fintech, “big data,” company. This is a chance to see your efforts directly translate into product and also impact the course of technological development. We are building towards the final frontier of technology, the brain. Principal Duties and ResponsibilitiesEnd to end hands-on ownership of machine learning systems – including real-world data sets, data pipelines, model generation, training, and real-time predictionsFiltration of time series dataCloud-based systems (Amazon Web Services)Breadth of experience across Supervised/Unsupervised/Semi-supervised/Reinforcement learningDevelop statistical methods and models for dimensionality reduction in high dimensional problems with noiseQuick Proof of Concept (POC) projects for noisy time series dataPOCs should serve as learning experiences for the organization, so that they can be applied across projects in parallel effortBonus:Experience with biological time series data (e.g., EEG ideal)Experience with human subjects experimental design or data collectionQualificationsBS with 5+ years experience/MS with 3+ years /PhD with 1+ yrs in Computer Science/EE/Applied Mathematics/Computational Neuroscience or other relevant STEM field. Or just convince us why you’re the person for the job.Fluency in various machine and deep learning applications/design, especially regarding neural networks (Algorithm design, AI development, PCAs, ICAs, and ensemble methods)Confidence in implementing algorithms in C/C++ or PythonExperience with scientific libraries (NumPy, SciKit-learn, SciPy, IPython, Sympy, Pandas, etc…)Mathematical, statistical, and probability inclinations with a deep understanding of AI conceptsA track record in signal processing that includes developing, implementing, and validating signal processing algorithms (e.g., FFT, DFFT, Wavelet) for solving real-world problemsResearch centered techniques for scalable and accurate inferences in graphical models, statistical modeling of data, large-scale combinatorial optimization, and robust decision making under uncertaintyCharacterYou know and can admit when something is not great. You can recognize that something you did needs improvement - no one is perfectComfortable in a small, intense, and high-growth environmentYou are comfortable disagreeing with others and can respectfully work with them to reach a better solutionDesire to create a positive change in the worldAbility to rapidly prototype real features in a startup environmentA hacker, if something you need doesn’t exist you don’t wait around - you make itRapidly learn and adapt to new opportunities and ideasGrow with the company to increase the overall whole, both from a professional and personal perspectiveYou reach past your grasp because you know you have a team that will catch you when you fall, which is not only ok - it is encouraged"}