{"jobID": "2819759610", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Marketing Manager, Lifecycle Marketing", "companyRating": "3.8", "companyInfo": {"Website": "www.carezone.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "81000", "jobDescription": " At CareZone, we make life simpler for millions of people with personal and family health challenges by helping them organize important information and access vital health services.  Were seeking a creative, data-driven, and compassionate lifecycle communications leader to join our team. In this role youll be responsible for multi-channel communication campaigns that increase app engagement, subscription/ecommerce conversion, and customer retention. WHAT YOULL DOPlan and implement multi-channel (email, push, SMS, in-app) communication journeys to onboard, engage, and retain app users.Manage multiple types of campaigns, including new user onboarding, product launches, customer retention, and winbacks.Use insights from continual testing, customer data, and industry best practices to inform marketing and business direction.Craft high-conversion emails, pushes, and other marketing messages.Own the communications roadmap, including channel strategy, content scheduling, and defining marketing automation software priorities.WHO WERE LOOKING FOR7+ years experience developing and executing lifecycle campaigns or customer communication programs for an ecommerce or subscription business model.Ability to develop compelling customer lifecycle campaigns from messaging and channel strategy to design and engineering requirements.You can manage multiple projects in a fast-paced environment while simultaneously creating process.Excellent interpersonal and communication skills that enable you to easily interact with various functional teams.Proficient with CRM/marketing automation tools and email marketing.Analytical, organized, and detail-oriented.Bachelors Degree in Marketing, Communications or related field preferred.THE PERKS * Competitive pay with bonus opportunities  * Equity at hire and ongoing opportunities to build ownership  * Excellent health, vision, and dental benefits  * 401(k), with company match  * Unlimited paid time off and sick benefits  * Friendly, collaborative, mission-driven colleagues"}