{"jobID": "2795527634", "jobLocation": "Long_Beach_CA", "jobTitle": "College Intern - Transit Service Delivery", "companyRating": null, "companyInfo": {"Website": "www.lbtransit.com", "Headquarters": "Long Beach, CA", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OverviewGENERAL SUMMARY: Long Beach Transit's (LBT) Student Intern Program offers career-minded students the opportunity to gain hands-on experience while being compensated. Intern will gain real-world work experience on meaningful projects under the guidance of professionals, and will have the opportunity to use problem-solving, communication and decision-making skills. The Intern will also work with a professional(s) as a Mentor for assistance to enhance a career path.  The Intern will be exposed to LBT's career opportunities in the transportation industry. The Intern will gain deeper awareness of many facets of Transportation through LBT's orientation, cross-divisional projects and internal networking.  Under the direction of the Transit Analyst, the intern role is a developmental position that provides technical support and administrative assistance for the Transit Service Delivery Department. Responsibilities include monitoring, reviewing and reporting the performance and effectiveness of fixed route bus service and related transit support programs. NORMAL HIRING RANGE: $15.00 to $17.00/hour depending on education level. Part-time internship available to full-time college students, approximately 20 hours per week not to exceed up to 1,000 hours within a fiscal year. This position does not offer benefits. Participation in the Internship is not an offer of regular full time or part-time employment with LBT and it does not guarantee future employment with LBT.OPEN UNTIL FILLEDResponsibilities Summarizes, analyzes, and interprets data received from transit service delivery including operator absenteeism, scheduled and unscheduled overtime for operators and staff personnel, accidents/incidents and other transit related issuesAbility to develop graphs, charts and technical drawings which demonstrates operational trends to include key performance indicators (KPI’s) and other reports as neededAudits, identifies and documents transportation problems and needsApplies statistical methods to monitor the overall performance of Transit Service DeliveryProvides analytical support as required and perform other related departmental workOther duties as assigned QualificationsSuccessful candidate must be a full-time college student maintaining a 2.7 GPA or above for undergraduate students and a 3.0 GPA for graduate students currently enrolled in a Bachelor’s or Master’s degree program majoring in Urban Planning, Transportation Engineering, Statistics or a related field. Candidate must be detail oriented and experienced in quantitative data analysis, possess good communications and organizational skills and proficient in the following MS Office applications: Excel, Word, and Access Application Apply on-line at www.lbtransit.com/jobs. On-line applications must include past work history and be fully completed to be considered. Resumes will not be accepted in lieu of a complete on-line application.  Candidate must be eligible to work in the United States. Long Beach Transit does not sponsor H1B or other related work visas. An Equal Opportunity EmployerSuccessful candidate must pass company physical, drug and alcohol test. Long Beach Transit 1963 E. Anaheim Street, Long Beach, California 90813"}