{"jobID": "2805883639", "jobLocation": "Boston_MA", "jobTitle": "Senior Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.jll.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1997", "Type": " Company - Public (JLL) ", "Industry": " Real Estate", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " CBRE, Cushman & Wakefield"}, "estimatedSalary": "67000", "jobDescription": " Sr. Data Analyst  About JLL  Were JLL. Were a professional services and investment management firm specializing in real estate. We help organizations around the world achieve their ambitions by owning, occupying and investing in real estate.  Were a Fortune 500 company. We work across 80 countries, in 280 different offices, with a team of over 77,000 individuals. And we look after a property portfolio of over 4bn square feet, all on behalf of our clients.  If youre looking to step up your career, JLL is the perfect professional home. At JLL, youll have a chance to innovate with the worlds leading businesses, put that expertise into action on landmark projects, and work on game-changing real estate initiatives. Youll also make long-lasting professional connections through sharing different perspectives, and youll be inspired by the best. Were focused on opportunity and want to help you make the most of yours. Achieve your ambitions join us at JLL!  Responsibilities  Leadership skills (training, presentations, & teambuilding) and project management.  Organizational skills coupled with the leadership and interpersonal skills to be able to manage multiple maintenance activities simultaneously.  Good oral and written communication skills including the ability to communicate with all levels of management and interface with a diverse customer base including technical and non-technical personnel in order to effectively support a multi-discipline team environment  Ability or understanding of how to create ad hoc reports and complex data reports. Ability to write advanced queries and dashboards is a plus, in SQL and Excel.  Experience with a CMMS system is a plus  Provide Data Management support for Facilities Management department, including analysis of data in Excel, writing and running basic SQL queries, and running reports.  Assist with assignment and scheduling of service personnel, or route work to requisite vendors. Order necessary materials from suppliers. Keep customers / requestors informed of the status of work, schedules, completion and closeout, including soliciting feedback from the end user to support continuous improvement  Inform and keep customers appraised of schedule estimates, and any change  Receive and respond to customer concerns and issues in a timely manner  Knowledge, Skills & Abilities  Bachelors Degree in an engineering or management or 10 years of facility maintenance management experience, preferably in a Higher Education setting.  Understanding of Facilities Management trades, common repairs, parts and services  Strong Microsoft Excel skills and ability to write SQL queries  Computerized maintenance management experience preferred  Read, understand, and follow SOP and WI instructions  Organization and efficiency, ability to deal with difficult people and remain professional in a problem-oriented environment, flexibility, adaptability, team player, resolution-driven, good communicator.  What you can expect from us  Youll join an entrepreneurial, inclusive culture. One where we succeed together across the desk and around the globe. Where like-minded people work naturally together to achieve great things.  Our Total Rewards program reflects our commitment to helping you achieve your ambitions in career, recognition, wellbeing, benefits and pay. Well offer you a competitive salary and benefits package.  Join us to develop your strengths and enjoy a fulfilling career full of varied experiences. Keep those ambitions in sights and imagine where JLL can take you...  Apply today!  #LI JLL Is an Equal Opportunity Employer JLL is committed to developing and maintaining a diverse workforce. JLL strongly believes in equal opportunity extended to all individuals in all aspects of the employment relationship, including recruitment, hiring, training, promotion, transfer, discipline, layoff, recall and termination without regard to race, color, religion, belief, creed, age, sex, pregnancy or maternity (including childbirth and related conditions), family responsibility (e.g. child care, elder care), nationality, ethnic or national origin or ancestry, citizenship, marital status, civil partner status, sexual orientation, gender identity or expression, transgender status, veterans status, genetic information, trade union membership, social position, political view or status as a qualified individual with a disability, protected leave status or any other protected characteristic in accordance with applicable law. The company also endeavors to make reasonable accommodations for known physical or mental limitations of otherwise qualified employees and applicants with disabilities unless the accommodations would impose an undue hardship on the operation of our business and ensures that employment decisions are based only on valid job requirements.  For employees in the United States, please see a fully copy of our Equal Employment Opportunity and Affirmative Action policy at https://jll2.sharepoint.com/CorporatePolicies/HR%20Policies/Equal%20Employment%20Opportunity%20and%20Affirmative%20Action.pdf.  If you have questions about careers at JLL or are disabled and require further assistance in applying for a position, please contact us at [Click Here to Email Your Resumé]"}