{"jobID": "2813103938", "jobLocation": "San_Diego_CA", "jobTitle": "Optics Research Intern", "companyRating": null, "companyInfo": {"Website": "www.cubic.com", "Headquarters": "San Diego, CA", "Size": "5001 to 10000 employees", "Founded": " 1951", "Type": " Company - Public (CUB) ", "Industry": " Aerospace & Defense", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Accenture, Northrop Grumman, Xerox"}, "estimatedSalary": null, "jobDescription": "Business Unit:Cubic Mission SolutionsCompany Details: Cubic offers an opportunity to provide innovative technology for government and commercial customers around the globe, helping to solve their future problems today. We're the leading integrator of payment and information technology and services for intelligent travel solutions worldwide, and the leading provider of realistic combat training systems, secure communications and networking and highly specialized support services for military and security forces of the U.S. and allied nations. If you have an entrepreneurial spirit and thrive in an innovative environment, we want to talk to you about your next role at Cubic! We are seeking employees inspired by technology, and motivated by the rewards of hard work, commitment, teamwork, quality, integrity, and respect. We invite you to explore opportunities with Cubic.Job Details:  Job Summary: While seeking a degree in engineering, supports the analysis, design, modification and testing of systems for designated products and/or customer applications. This position typically works under close supervision and direction. Essential Job Duties and Responsibilities:Performs engineering duties including design, testing, documentation, and support analysis.Assists in technical support.Assists in preparation of system design.Prepares engineering design documentation and test plans.Performs problem analysis with guidance from other engineers.Performs unit testing and integration testingPerforms environmental testing of components and/or systemsShows commitment to company values, ethics, safety, security, labor charging and quality.Supports, as required, total quality management/continuous process improvement teams.Minimum Job Requirements: Enrolled in at least the second year of a Bachelor of Science degree program in engineering. Familiarity with Optics engineering preferred.  The description provided above is not intended to be an exhaustive list of all job duties, responsibilities and requirements. Duties, responsibilities and requirements may change over time and according to business need. Worker Type: Employee"}