{"jobID": "2756284890", "jobLocation": "San_Jose_CA", "jobTitle": "Treatment Manager – STRTP", "companyRating": null, "companyInfo": {"Website": "www.unitycare.org", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 1993", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job Title  Treatment Manager – STRTP  Position  ID 27058130 Duration  Location  San Jose,  CA 95126 Other Location  DescriptionAbout Unity Care Our mission is to provide quality youth and family programs for the purpose of creating healthier communities through lifelong partnerships. Headquartered in San Jose, with incredible weather, culture and sports, and the SF Bay and ocean just minutes away. Unity Care offers a wide range of services benefiting at-risk and foster youth and their families throughout Northern California. Its signature program, established in 1993, focuses on serving the housing needs of youth in foster care and beyond. The organization provides more than two dozen community-based, education and behavioral health programs, transforming the lives of over 6,000 youth and families annually. We are proud to have one of the most ethnically and culturally diverse workforce in the Bay Area. We have a friendly, servant-leader culture with significant growth opportunities. OVERVIEW: Under the direction of the Assistant Director, provides supervision to staff and support to the therapeutic environment/setting and treatment of all residents to ensure compliance with program goals and maintain optimal care of clients in the programs. As part of the treatment team, job performance contributes to the short and long term goals for residents in the Residential Program. Performance of the typical responsibilities and duties requires the ability to perform the job duties, supervision of residential staff and residents (24/7 operation), and communication with others involving job-related matters generally of moderate complexity. This position serves as the STRTP Administrator. DIRECT REPORTS:Residential Counselor – STRTPQUALIFICATIONS:RequiredHave completed at least two years at an accredited college or university, plus at least five years administrative experience or supervisory experience over social work, direct care and/or support staff providing direct services to children in an agency or in a community care facility with a licensed capacity of six or moreBasic skills in crisis interventions, suicidal assessment, conflict resolution and interpersonal communicationBasic knowledge of childcare practice with SED children (i.e. Special Education, STRTP, or Probation/Juvenile Hall) in either day treatment or residential careAbility to maintain a positive perspective in the treatment and care of emotionally disturbed youthDemonstrated ability to lead and direct staff and foster team buildingAbility to produce well-written documentationAbility to work independently in high stress environmentDemonstrated dedication to youth through leadership and/or mentoring experiencesPreferredHave a bachelor's degree from an accredited college or university, plus at least three years administrative experience or supervisory experience over social work, direct care and/or support staff providing direct services to children in an agency or in a community care facility with a licensed capacity of six or more.Be a qualified and certified STRTP administrator prior to January 1, 2017.RESPONSIBILITIES INCLUDE (but not limited to):Supervises and develops overall Childcare staff; provides coaching and mentoring in weak or problem areas with individual residential counselors or teams as necessary. Meets weekly with each counselor to review and observe job performance and provide support (including overnight and weekend staff), coordinates 24 hours of onsite one-on-one training using the counselor Training ManualParticipate in monthly team meetings with Social Worker, Clinician, Program Manager, Probation Officer, SA Counselor and other staff/providers to review treatment progress and identify areas for improvement and interventions.Observing and interacting with staff, children, and other individuals, as necessary, to ensure the quality of care for children and program services.Responsible for administrative functions; weekly supervision of time cards (controlling overtime hours by cutting back or adding on to individual shifts), develops monthly residential childcare activity/program calendar, weekly facility and van checklist, incident reports, records of nutrition program, oversees dispensing of medication and reviews medication logs, keeps records and submits purchase request w/receipts for expenditures and operates STRTP within daily budget.Establish and maintains residents binder and personal files for house documentation.Supervises all aspects of licensing requirements, records keeping, supplies, and auto and house maintenance.Manages and ensures transportation to residents’ doctors and all other appointments.Facilitates school entrance, monitors attendance and performance and elevates issues to treatment teams for resolution.Oversee childcare home visits and family visits to facility.Interacts with HR in the hiring and evaluation process of staff; conducting interviews, evaluates staff and coordinates training and development of staff.Acts as a liaison between administrative and counseling staff.Responsible for supporting agency Policies and Procedures regarding assessment, treatment planning, and treatment modalitiesCarries out directions, decision, philosophy, and administrative methods as established by Executive Direction.Other duties as assigned. Openings  3"}