{"jobID": "2805489954", "jobLocation": "Hollywood_CA", "jobTitle": "Data Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.ticketmaster.com", "Headquarters": "Los Angeles, CA", "Size": "1001 to 5000 employees", "Founded": " 1976", "Type": " Subsidiary or Business Segment", "Industry": " Arts, Entertainment & Recreation", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "86000", "jobDescription": " Job Summary: Who we are. Were fans who help fans everywhere get in to the live events they love. A proud division of Live Nation Entertainment, Ticketmaster has changed the way the world connects with their favorite artists, teams, and shows, and we continue to shape innovation every day. Were not just selling tickets (though we do that better than anyone else), were enriching lives one amazing experience at a time. And we think thats pretty amazing. If youre passionate about the magic of live entertainment like we are, and you want to work at a company dedicated to helping millions of fans experience it, we want to hear from you. Why you should work with us. Our biggest investment is in our people. We offer comprehensive health benefits and 401k matching, student loan assistance, plus career-boosting opportunities like tuition reimbursement and targeted development sessions to help all eligible employees thrive. At Ticketmaster, expect the fast-paced excitement of a startup with the rock-solid support from an industry leader with plenty of ticket perks on the side. See what its like working at Ticketmaster.Responsibilities: Be part of a dynamic, highly-focused team that is responsible for providing machine-learning insights and SW products that engage TicketMaster's 170+MM usersBe collecting and analyzing very large data setsCarry out tasks encompassing data cleansing and data normalizationResponsible out multivariate statistical tests and hypothesis testsDesigning and implementing machine learning algorithms ranging from feature engineering, feature selection, clustering, predictive scoring and classificationDeveloping SW to prototype new algorithms for user segmentation, user interest discovery, performance optimization and user response prediction as part of a massively parallel and distributed near-real time collaborative filtering system/marketing platformParticipate in peer code reviews, write unit tests and provide feedback to other members of the teamCarry out rigorous model validation and model tuning/optimization as part of the natural model life-cycleQualifications: 2+ years of SW development with a high-level programming language like: Java, C/C++, Python.5+ years of industry experience, or equivalent and pertinent course work.Strong statistical and machine learning background both on supervised and unsupervised algorithms.Experience with machine learning techniques like linear and logistic regression, decision trees, SVM and Bayesian classifiers.Education: MS In CS, Statistics/Math or Physics with an emphasis on data analytics.Demonstrated ability to rapidly learn and contribute to the team successEffective communication skills and enjoying work as part of a team.Equal Employment Opportunity Ticketmaster strongly supports equal employment opportunity for all applicants regardless of age (40 and over), ancestry, color, religious creed (including religious dress and grooming practices), family and medical care leave or the denial of family and medical care leave, mental or physical disability (including HIV and AIDS), marital status, domestic partner status, medical condition (including cancer and genetic characteristics), genetic information, military and veteran status, political affiliation, national origin (including language use restrictions), citizenship, race, sex (including pregnancy, childbirth, breastfeeding and medical conditions related to pregnancy, childbirth or breastfeeding), gender, gender identity, and gender expression, sexual orientation, or any other basis protected by applicable federal, state or local law, rule, ordinance or regulation.  We will consider qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Ordinance, for applicants in Los Angeles, California, and consistent with applicable laws in other areas. Hiring Practices The preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.  Ticketmaster recruitment policies are designed to place the most highly qualified persons available in a timely and efficient manner. Ticketmaster may pursue all avenues available, including promotion from within, employee referrals, outside advertising, employment agencies, internet recruiting, job fairs, college recruiting and search firms."}