{"jobID": "2778672291", "jobLocation": "Boston_MA", "jobTitle": "Data Analyst, Machine Learning", "companyRating": "3.2", "companyInfo": {"Website": "www.rifiniti.com", "Headquarters": "Boston, MA", "Size": "1 to 50 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "57000", "jobDescription": "Rifiniti is a growth-stage SaaS solutions provider for commercial real-estate end-users. We integrate client data into our proprietary cloud-based data-warehouse, process it, and provide our clients with actionable workplace analytics.  We have a dynamic team, consisting of data scientists, software developers, QA experts, systems administrators, and sales and support personnel. Our team is located in Boston, US, and Sofia, Bulgaria. We have a large and growing number of customers, all of whom are global companies with significant leased and owned office space portfolios for their operations.  Our data analysts work closely with data scientists and software engineers as well as a growing ecosystem of business partners and customers to build leading edge technologies in big data, machine learning, real time intelligence that scale the business. ResponsibilitiesDevelop, deploy and maintain data analysis processes for our enterprise clientsCollaborate with QA engineers to provide quality assurance of our analytical dashboardWork with the project manager and data engineer to integrate new clients’ data sources into our data analysis pipelinesGenerate custom reports and visualizations to help clients solve critical business issuesRequirementsAn (optional) bachelor’s or master’s degree in STEM fields with proven experience in data wrangling and visualizationGood understanding of linear algebra and statisticsStrong proficiency in statistical programming languages, e.g. Python and RExperience with SQLExperience with Linux command line environment and AWS is a plus but not required.Excellent spoken and written communication skills in English.Strong teamwork and interpersonal skills.Compensation We offer comprehensive, competitive benefits: Salary based on experienceHealth insurance planHealth Savings Account401(k) planFlexible Spending AccountRegular vacationPaid sick leaveEmployee stock optionsLocation Working from dynamic office in Boston, US. We are flexible about one day a week work from home, travel, and work hours."}