{"jobID": "2799570820", "jobLocation": "Seattle_WA", "jobTitle": "Data Analyst Sr-Patient Access", "companyRating": "3.7", "companyInfo": {"Website": "www.seattlechildrens.org", "Headquarters": "Seattle, WA", "Size": "5001 to 10000 employees", "Founded": " 1907", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "90000", "jobDescription": " We are using data and analytics to transform care and cures for kids!  For more than 100 years, Seattle Children's has been leading the discovery of new cures and delivering the latest treatments available - all part of our mission to prevent, treat, and eliminate pediatric disease. We are now taking it to the next level and experiencing unprecedented growth in data and analytics across the enterprise. We're looking for talented data/analytic experts with a passion for helping kids and their families lead better, healthier lives.  The Patient Access Senior Data Analyst is responsible for the following: Supports the Hospital and Enterprise Analytic's vision, mission, and strategic initiatives by using technical expertise to design, create and develop analytical solutions and by providing internal consultation and project management.Provides leadership in the facilitating and gathering business requirements, and provides knowledge in business/clinical processes, analytical expertise, technical programming skills, and strong leadership skills in working with key stakeholders, end users and project team members.Identifies and resolves issues through the development of analytical solutions, and is accountable for identifying opportunities for continuous improvement in the implementation of these solutions.Designs, creates and deploys analytical solutions for Executive Leadership and other key stakeholders within the department and the organization.Takes a formal or an informal lead on project tasks, and leads efforts to design and implement analytic solutions, including reports, dashboards, and views from a wide range of existing data sources, and provides leadership in evaluating and optimizing these solutions.Assures integrity of the data for current and future use in strategic initiatives, continuous quality improvement efforts and hospital goals, and for insuring the sustainability and adaptability of all developed solutions. Required Education/Experience: Bachelor's Degree in Health Science, Computer Science, Math, Business or related field, or equivalent combination of education and experience/technical training that demonstrates analytical and technical competencyMinimum five (5) years experience performing progressively more responsible work as a clinical or business data analyst, developer or equivalent in a clinical or financial settingMinimum five (5) years of related work in a healthcare environmentExperience with Cerner, Epic or similar software product.Required Credentials:N/APreferred:At least six (6) years progressively more complex systems and analysis responsibilitiesAt least three (3) years managing medium to large projects using standard project management skills, tools and methodologiesExperience with clinical, hospital and/or financial applications and/or systemsExperience working with clinicians on pathways, ordersets or similar toolsExperience working with the development life cycle."}