{"jobID": "2632186777", "jobLocation": "New_York_NY", "jobTitle": "Senior Estimator - Bridges/Structures", "companyRating": "2.3", "companyInfo": {"Website": "www.dragados-canada.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "98000", "jobDescription": "SUMMARY The Bridge/Structures Sr. Estimator works with preconstruction/business development staff in the review of project plans, requirements and specifications. The Bridge/Structures Sr. Estimator is responsible for the accurate and timely preparation of estimates for jobs to be bid, specifically for the structures part, including complex bridges, walls and other structural elements. The Bridge/Structures Sr. Estimator has extensive knowledge of construction means and methods, costs and engineering and industry principles, focused on the construction of structures. PRIMARY RESPONSIBILITIES • Review project plans, requirements, and specifications.  • Prepare and/or review accurate quantity takeoffs, breakdowns and materials pricing.  • Determine labor and equipment costs.  • Discuss and propose the most proper means and methods for structures.  • Review and understand all bid documents and assess project risks.  • Understand project logistics and project schedule.  • Prepare bid packages. Compare and analyze competitive subcontractor and supplier bids.  • Prepare estimates at different levels of completion (conceptual, Schematic, DD, CD, etc.)  • Perform certain post-bid buyouts.  • Perform pre-construction duties and meetings with Clients, Owners, Engineers, Subs and Suppliers, and JV Partners.  • Performs other related duties as required and assigned. REQUIREMENTS • Bachelor's degree in Civil Engineering, Construction Management, Mechanical Engineering or Architecture  • A minimum of 8 years of experience as an Estimator  • A minimum of 4 years of experience in a senior level estimating role for major bridges and structures.  • A minimum of 15 years of construction experience would be a plus  • Public works sector experience required (Private is a plus).  • Familiarity of all aspects of horizontal and infrastructure projects  • Recent experience with a large civil/highway/bridge contractor  • Strong experience with Bridge estimating required  • Recent experience with JV bid settings is a plus.  • Advanced computer skills with estimating software (knowledge of HCSS Heavybid is a plus)  • Advanced computers skills with MS Office, Primavera P6  • Knowledge AutoCAD and/or MicroStation is a plus  • Extensive knowledge of construction costs and engineering principles  • Well organized, flexible, detail oriented and multi-tasked.  • Prioritize work load and consistently meet deadlines while constantly changing tasks and demands  • Effective presentation skills.  • Ability to work with other engineers and estimators and be part of a team Dragados USA is an Equal Opportunity Employer"}