{"jobID": "2827137453", "jobLocation": "San_Francisco_CA", "jobTitle": "Financial Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.group.bnpparibas", "Headquarters": "Paris, France", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Public (BNP) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": " What sets Bank of the West apart from other banks is our team membersthey embody the optimistic spirit of the West. There is a spirit here that drives us to do more. Our team of more than 10,000 employees is vital to the success of our Bank. They reflect our modern western valuesstraightforward, entrepreneurial and optimistic. We seek to create a corporate culture that fosters and rewards excellence, encourages creative thinking and respects diversity an environment where team members are engaged, supportive of one another and enthusiastic about serving our customers. Bank of the West offers the stability of a company that has a 135 year history and is part of BNP Paribas, a European leader in global banking and financial services and one of the 6 strongest banks in the world. We offer opportunities across our diverse business lines Retail Banking, Commercial Banking, National Finance, and Wealth Management.  Job Description Summary  Responsible for supporting the corporate financial planning and analysis team with operations and analytics. Performs a variety of complex duties including the collection and analysis of financial data from reports and various sources; performs statistical analyses.  Essential Job Functions Independently completes assigned financial requests.Provide secondary review of all projected financials with a particular focus on centrally planned items and Holding Company expenses.Coordinates with Planning systems team to ensure all planning requirements are delivered before deadlines.Performs monthly reviews and evaluates actual financial performance of the Bank's business units and conducts variance analysis relative to plan and prior month. Functions as key finance liaison for at least one major profit group within the Bank.Analyzes and interprets financial data to compile statistical reports on current financial developments, financial policies and plans, and significant organizational developments.May lead projects as assigned by head of FP&A.;Will assist in researching relevant business developments in the organization and/or industry.Acts as primary liaison between corporate finance and business units within the Bank. In the role as liaison the position focuses on communication and providing superior customer service to the business units. Examples of the types of communication that the position is responsible for are communicating significant changes to processes, communicating items identified in the review or analysis of monthly financial results and communicating ideas regarding how to use corporate tools (Hyperion, etc.) to efficiently analyze results, etc. Other Job Duties Will offer coverage across team and provide surge support to primary FP&A; functions. Provide training and guidance to less-experienced staff.Performs other duties as assigned.Required ExperienceRequires advanced knowledge of job area typically obtained through advanced education combined with experience.May have practical knowledge of project management.Requires 5 years minimum prior relevant experience.EducationBachelor's Degree Finance/EconomicsSkillsAdditional Job Qualifications: Familiarity with financial modeling Working knowledge of GAAP accounting issues as they relate to the banking industry.Familiarity with GAAP and IAS/IFRS accounting rules as they apply to Bank investment portfolios.Familiarity with Bank regulatory guidelines.Complete knowledge of financial analysis and principles of economics of financial and cost accounting.Complete knowledge of financial institution balance sheet, profit and loss and analysis techniques Commercial banking experience is a plus, familiarity with commercial banking products and processes is a plus Knowledge of stress testing and regulatory requirement for banking industry is a plus Knowledge of Hyperion&Essbase; is a plus Ability to understand large volumes of multi-dimensional data, and manipulate it with SQL and VBA Ability to quickly process and internalize large volumes of information, such as regulatory guidance documents and model documentation Ability to document requirements and processes Expert level Excel skills, including: Expert knowledge of advanced Excel features, such as array formulas and multi-dimensional lookups Ability to write robust, readable and re-usable VBA code Experience tracing data lineage over multiple Excel worksheets and files.Expert in Excel charting Excellent Power Point presentation ability Demonstrated ability to develop solutions to highly complex and diverse analytical problems which requires an in-depth evaluation of variable factor Exercises judgment in selecting methods, techniques and evaluation criteria for obtaining results and analysis Ability to work well with others in a dynamic, team-oriented environment Appreciation of a tight control process, ability and willingness to clearly document tools, results and other products of work Open mind and ability to quickly assimilate and understand unfamiliar information; and willingness to help and take assignments outside of the immediate area of responsibility Ability to create innovative solutions Ability to deal with changes, ambiguity, and uncertainty Organized and attentive to detail Self-starter and highly motivated.Able to manage multiple products, and effectively prioritize workload when dealing with multiple deadlines Time Management and organizational leadership skills Ability to work effectively with diverse teams Strong professional communication and presentation skills Financial Analyst- CCAR Primarily responsible for supporting PPNR forecasting necessary for CCAR and DFAST regulatory work streams.Additionally, responsible for writing requirements, managing development, testing, operations and documentation of the STAR Hyperion Cube, as well as writing documentation of the statistical and qualitative models and tools, and documentation of CCAR processes.Performs allocation of the Balance Sheet and Income Statement forecasts results between different account hierarchies.Assists and performs CCAR and DFAST production runs to forecast balance and non-interest income and expense.Writes and maintains operating procedures of various systems used in CCAR forecasting, including the Hyperion Cube.Develops a process by which ad-hoc changes are captured in the process and operating procedure documentation.Interfaces with the technology teams, and tracks development process.Performs Hyperion UAT testing, and coordinates the UAT process with the other team members.Assists and performs CCAR and DFAST production runs to forecast balance and non-interest income and expense, including remediation of FDIC and FRB findings.Creates and polishes to perfection presentation materials that are used for decision making in the Financial Forecasting Group.Automates generation of materials where appropriate.Works with LOB partners and modelers on modeling approach, assumption; becomes SME on data and business characteristics for subject portfolios.Understands Bank's balance sheet and income statement structure and data, and writes detailed technical requirements necessary for development of new functionality of the Hyperion cube used for CCAR.Financial Analyst- Budget&Forecasting; Team Responsible for the critical assessment of Bank's Budget and Forecast Reporting Process.Responsible for coordinating across the bank's divisions to ensure that forecasted results are produced within requisite deadlines, and perform individual analysis to evaluate and challenge projected data.Takes a lead role in preparation of Bank's projected financial statements for budget, forecast and strategic plan Performs detailed line item trend analysis on forecast and budget Coordinates tracking of any one-off or top-side adjustments Provides regular updates on forecasted data movements within planning system Documents processes and procedures to become subject matter expert on given support systems and/or business flows.Functions as key finance liaison for at least one major profit group within the Bank in this role.May lead or assist in the development and coordination of enterprise-wide planning calendar build-out in support of forward-looking projections.Analyzes and interprets financial data and compiles statistical reports on current financial developments, financial policies and plans, and significant organizational developments.Assists with the integration of initiatives and new entities into budgeting processes.May lead or assist in the development and implementation of internal Corporate FP&A; and/or Line of Business process improvement and enhancement projects.Provides training and guidance to less-experienced staff and internal customers."}