{"jobID": "2818772554", "jobLocation": "Wilmington_MA", "jobTitle": "Internal Audit Intern - UniFirst", "companyRating": "3.8", "companyInfo": {"Website": "www.unifirst.com", "Headquarters": "Wilmington, MA", "Size": "10000+ employees", "Founded": " 1936", "Type": " Company - Public (UNF) ", "Industry": " Consumer Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Cintas, Aramark"}, "estimatedSalary": "50000", "jobDescription": "Internal Audit Intern: The Corporate Internal Audit group is looking for an intern to join the group this summer. The position is a three month 32-40 hours per week with the possibility of extension. The position is responsible for supporting the SOX compliance and various internal audits. Job Description:Test and evaluate the effectiveness of key controls identified in UniFirst's Sarbanes Oxley 404 compliance programPrepare and organize work papersParticipate in other Internal Audit assignments not related to Sarbanes Oxley, as neededPerform other duties as assignedQualificationsCurrently pursuing an accounting or finance degreeExcellent verbal and written communication skillsProficient with MS Office SuiteExcellent analytical and problem solving skillsDetail oriented and organized UniFirst offers a Fleet of Benefits, 50+ to be exact! 401K with Company MatchProfit SharingHealth InsuranceEmployee Assistance ProgramLife InsuranceSupplemental Life InsuranceLong Term DisabilityVacationSick TimePaid HolidaysDirect Payroll DepositTuition Reimbursement30% Employee DiscountEmployee Referral Program Where will a UniFirst Career take you?  As an industry leader in the rental, lease and sale of uniforms and facility services products, UniFirst Corporation has grown to become one of the largest companies in the garment services industry.  UniFirst is recognized on the Forbes \"Platinum 400 - Best Big Companies\" List. With over 14,000 employee Team Partners and more than 250 facilities throughout the United States, Canada, Mexico and Europe, you are never just a number when you work for UniFirst. What sets us apart from all other companies is that we still function as a family run business. When you work for UniFirst, you're family!  UniFirst Corporation has a strong history of promoting from within. In fact, most of UniFirst's Senior Managers have come from within the Company. Opportunities are endless for those individuals who possess a strong work ethic, a commitment to quality, and above all else, a passion for delivering quality customer service, both internally and externally.  Our culture is what makes UniFirst an organization that stands out from the rest. Are you interested in loving your job? Find out just how far a career with UniFirst can take you.  UniFirst is an equal opportunity employer. We do not discriminate in hiring or employment against any individual on the basis of race, color, gender, national origin, ancestry, religion, physical or mental disability, age, veteran status, sexual orientation, gender identity or expression, marital status, pregnancy, citizenship, or any other factor protected by anti-discrimination lawsSDL2017"}