{"jobID": "2807721468", "jobLocation": "San_Jose_CA", "jobTitle": "Application developer Intern", "companyRating": "3.8", "companyInfo": {"Website": "www.intel.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1968", "Type": " Company - Public (INTC) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "83000", "jobDescription": "Job DescriptionThis is an internship position.  In this position you'll be working closely with Intel's Programmable Solutions Group PSG engineering team as well as the infrastructure teams in San Jose, California.  You'll participate in supporting the transition of the applications from PSG authentication to Intel authentication.  Scope of work includes but not limited to: testing activities, unit testing, and QA code design and development perform bugs investigation and follow-up.  This position will need strong communication skills and problem solving skills in addition to strong technical skills. The Internship should take up to 3 months. QualificationsYou must possess the below minimum qualifications to be initially considered for this position. Experience listed below would be obtained through a combination of your school work/classes/research and/or relevant previous job and/or internship experiences. Minimum Requirements: - Must be pursuing a Bachelors degree in Computer Science or Information Systems.  - At least 6 month experience with Linux, scripting languages: python, bash or shell  - This U.S. position is open to U.S. Workers Only. A U.S. Worker is someone who is either a U.S. Citizen, U.S. National, U.S. Lawful Permanent Resident, or a person granted Refugee or Asylum status by the U.S. Government. Intel will not sponsor a foreign national for this position. Inside this Business GroupIntel's Information Technology Group (IT) designs, deploys and supports the information technology architecture and hardware/software applications for Intel. This includes the LAN, WAN, telephony, data centers, client PCs, backup and restore, and enterprise applications. IT is also responsible for e-Commerce development, data hosting and delivery of Web content and services.Posting Statement. Intel prohibits discrimination based on race, color, religion, gender, national origin, age, disability, veteran status, marital status, pregnancy, gender expression or identity, sexual orientation or any other legally protected status."}