{"jobID": "2829541857", "jobLocation": "San_Francisco_CA", "jobTitle": "Premier Banker Unlicensed 1", "companyRating": null, "companyInfo": {"Website": "www.wellsfargo.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1852", "Type": " Company - Public (WFC) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job DescriptionAt Wells Fargo, we want to satisfy our customers financial needs and help them succeed financially. Were looking for talented people who will put our customers at the center of everything we do. Join our diverse and inclusive team where youll feel valued and inspired to contribute your unique skills and experience.  Help us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you.  Community Banking operates one of the most extensive banking franchises in the country, serving customers through approximately 6,000 branches and 13,000 ATMs in 39 states and the District of Columbia. Our group includes Business Strategy and Administration; Customer and Branch Experience; Customer Remediation Office; Distribution Strategy Group; Regional Banking; Regional Services; and Customer Segments, and serves mass market, affluent, and small business customers. Our focus is on delivering an exceptional experience for our customers and providing the products and services that will help them realize their financial hopes and dreams.  Provides full-balance sheet banking to affluent and affluent-away customers and manages a portfolio of complex account relationships. Consults with customers regarding their financial needs and recommends appropriate financial services to meet those financial needs. Personally fulfills product and service needs in the Regional Bank and makes appropriate introductions to partners for products in other lines of business.  For the portfolio of relationships managed, resolves inquiries and service requests, opens and services accounts within authorized limits and creates Customer Management Program (CMP) activity plans and follows up on scheduled contacts. Continually builds a network of internal partners and external sources and resources to further enhance the customer experience and meet customer's financial needs. Models appropriate segmentation strategy for the branch team and supports the branch managers Customer Connection Plan (CCP) so that affluent and affluent away customers are provided the opportunity to interact with the most appropriate banker.  This SAFE position has customer contact and job duties which may include the offering/negotiating of terms and/or taking an application for a dwelling secured transaction. As such, this position requires compliance with the S.A.F.E. Mortgage Licensing Act of 2008 and all related regulations. Ongoing employment is contingent upon meeting all such requirements, including acceptable background investigation results. Individuals in a SAFE position also must meet the Loan Originator requirements under Regulation Z (LO) outlined in the job expectations below.Required Qualifications2+ years of financial services industry experience, through work or military, in one or a combination of the following: corporate banking, corporate lending, consumer banking, consumer lending, business banking, small business, mortgage lending, investments, brokerage, or private banking; or 1+ year experience in a licensed financial services positionDesired QualificationsExperience assessing customer needs and recommending products/services to fulfill those needsExperience solving customer problemsGood communication skills including speaking clearly, succinctly, and accurately while using a pleasant tone and common conversational courtesiesHigh motivation with ability to successfully meet team objectives while maintaining individual performanceExperience identifying additional opportunities to recommend products and services to customersExperience mentoring and educating other branch team membersRelevant military experience including working with military protocol and instructions, enlisted evaluations, officer/leadership reportingRelevant military experience including working in personnel benefits management, processing military personnel orders or transitions, wartime readiness operations, human resources or military recruitingJob ExpectationsRegistration for FINRA Series 7 and 63 or 7 and 66 must be completed within a specified period of time determined by number of licenses to be obtained as well as job start date and will be communicated to the candidate upon offer acceptance. FINRA recognized equivalents will be accepted.State Life Insurance license requirements must be completed within a specified period of time communicated to the candidate upon offer acceptance. Compliance with state law requirements is required.Registration for FINRA Series 65 must be completed when required by the state in which the position is located. FINRA recognized equivalents will be accepted.Obtaining and/or maintaining appropriate Financial Industry Regulatory Authority (FINRA) license(s) is required for ongoing employment in this position. In addition state registration, specific product licenses or SAFE licensing may apply. Additional requirements include meeting enhanced financial fitness and criminal background standards. Wells Fargo will initiate the FINRA review process at the time of offer acceptance.This position requires SAFE registration at the time of employment. Wells Fargo will initiate the SAFE registration process immediately after your employment start date. The Nationwide Mortgage Licensing System (NMLS) web site (http://fedregistry.nationwidelicensingsystem.org ) provides the MU4R questions and registration required for employment in this position.Individuals in Loan Originator (LO) positions must meet the Consumer Financial Protection Bureau qualification requirements and comply with related Wells Fargo policies. The LO qualification requirements include meeting applicable financial responsibility, character, general financial fitness and criminal background standards. A current credit report will be used to assess your financial responsibility and credit fitness, however, a credit score is not included as part of the evaluation. Successful candidates must also meet ongoing regulatory requirements including additional screening, if necessary.Street AddressCA-SF-Civic Center: 1560 Van Ness Ave - San Francisco, CADisclaimerAll offers for employment with Wells Fargo are contingent upon the candidate having successfully completed a criminal background check. Wells Fargo will consider qualified candidates with criminal histories in a manner consistent with the requirements of applicable local, state and Federal law, including Section 19 of the Federal Deposit Insurance Act.  Relevant military experience is considered for veterans and transitioning service men and women.  Wells Fargo is an Affirmative Action and Equal Opportunity Employer, Minority/Female/Disabled/Veteran/Gender Identity/Sexual Orientation."}