{"jobID": "2720086122", "jobLocation": "Boston_MA", "jobTitle": "Field Sales Representative/TTI Emerging Account Member", "companyRating": "3.5", "companyInfo": {"Website": "www.ttiinc.com", "Headquarters": "Fort Worth, TX", "Size": "1001 to 5000 employees", "Founded": " 1971", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Avnet, Arrow Electronics"}, "estimatedSalary": "60000", "jobDescription": "The TTI Emerging Accounts Member sells company products and services via telephone, e-mail and in person to assigned customers and prospects in territory. Penetrates and develops accounts that have been inactive, underpenetrated and/or new to TTI to mine those accounts and generate new business. Success is measured by securing new business, meeting defined sales objectives, and performing all duties with a high ethical standard and exceeding all customer requirements.ACCOUNTABILITIESConducts sales calls (via telephone or in-person) on accounts that have been identified with large DSAM potential, however, they are accounts that have never done business with TTI, or have small amounts of activity, or have been inactive, by contacting the customer, informing the customer of TTI’s products and value added services, and partnering with suppliers and reps to win new business for TTI.Increases sales book of business by compiling list of prospective customer leads from various sources and makes cold calls, developing leads into ordering customers increasing overall performance incentive plan.Expands product knowledge by utilizing all resources including product literature, factory representatives, product managers, sales managers and other sales representatives to be able to discuss product service options with customers and promote TTI value proposition. Participates in the TTI Total Quality Program by supporting the importance of quality; ensuring that defined processes are being followed, proofing orders and company documents for errors, and identifying the areas of process improvement in every day transactions.Provides management with information regarding sales, marketing techniques, new products and market strategy by preparing forecast and activity reports on account territory.Other duties may be assigned.COMPETENCIESDelivering ResultsMaintaining a high level of commitment to personally getting things done.Customer ServiceRecognizing and understanding customers' needs and delivering in a manner that exceeds customers' expectations.Relationship ManagementDeveloping and maintaining positive relationships with individuals outside their work group.Persuading to BuyConvincing others to buy a product or service.NegotiationIdentifying the needs and motives of both parties involved and working toward mutually beneficial agreements.Quality FocusPromoting and maintaining high standards of quality at work.Teamwork and CollaborationEffectively working and collaborating with others toward a common goal.Planning and OrganizingEffectively organizing and planning work according to organizational needs by defining objectives and anticipating needs and priorities.Interpersonal CommunicationCommunicating clearly and effectively with people inside and outside of the organization.ResilienceEffectively dealing with work related problems, pressure, and stress in a professional and positive manner.Functional AcumenHaving the skills, knowledge and abilities necessary to be effective in the specific functional content of a job.IntegrityUpholding a high standard of fairness and ethics in everyday words and actions.EDUCATION & EXPERIENCETechnical Degree from a four-year college or university preferred, with a minimum of five (5) years experience of focused outside sales and/or business development, Engineering and/or Component sales experience highly desired; or equivalent combination of education and experience.SKILLS & CERTIFICATIONSPossesses excellent verbal and written communication skills, including excellent presentation skills.Strong desire to develop relationships and sell over a long or short sales cycle.Ability to ask for the sale, read customer cues, have a consultative sales approach.Exhibits strong analytical, problem solving and negotiation skills.Must be organized and able to prioritize and manage multiple tasks.Ability to calculate discounts, commissions, proportions and percentages.Ability to write reports and correspondence proficiently and professionally.Reads, analyzes and interprets business periodicals, professional journals, technical procedures and government regulations.Able to work with minimum supervision and make responsible decisions.Possesses working knowledge of company policies, procedures and computer systems.Must possess a valid Driver’s License, safe driving record and be insurable by the Companies’ liability carrier.Requires some travel, amount varies depending on territory assigned.Ability to type 40 words per minute.Knowledge of Microsoft Office applications (Excel and Word) at a basic level required.This position requires use of information or access to hardware which is subject to the International Traffic in Arms Regulations (ITAR). To perform the position, you must be a U.S. Person as defined by ITAR. ITAR defines a U.S. person as a U.S. Citizen, U.S. Permanent Resident (i.e. ‘Green Card Holder’), Political Asylee, or Refugee.This is a summary of the primary accountabilities and requirements for this position. The company reserves the right to modify or amend accountabilities and requirements at anytime at its sole discretion based on business needs. Any part of this job description is subject to possible modification to reasonably accommodate individuals with disabilities. TTI, Inc. is an Equal Opportunity Employer committed to providing equal opportunities to all employees and applicants for employment without regard to race, color, sex (including pregnancy), sexual orientation, gender identity, age, national origin, religion, physical or mental disability, veterans’ status, genetic information, or any other characteristic protected by law."}