{"jobID": "2830851491", "jobLocation": "San_Francisco_CA", "jobTitle": "Index Sales Specialist", "companyRating": "3.5", "companyInfo": {"Website": "www.msci.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1969", "Type": " Company - Public (MSCI) ", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " FTSE Group, S&P Global Ratings, Algorithmics"}, "estimatedSalary": "39", "jobDescription": "Position Overview:MSCI Index Sales Specialists are responsible for maintaining existing client relationships as well as new business development for MSCI products. Each person travels within their respective sales territory to meet with clients regarding new products as well as enhancements to existing products.  The role entails educating, positioning and licensing MSCIs global equity index data to current clients as well as prospective clientele. Sales Specialists use their knowledge of the investment management process, modern portfolio theory, and data distribution platforms (Bloomberg, Factset, Thompson, etc.) to identify solutions using MSCI tools for their clients.  This role is a highly visible one, with involvement in all aspects of account management, including senior level relationship management, in-depth discussions regarding MSCIs index methodology, commercial terms and contract negotiation, closing sales, and product setup and delivery. Education of the enhancements and evolution of how our indices are used by the investment community is ongoing. In this role, individuals will work very closely with MSCI Product Management, Global Client Service, Client Consultants, Marketing, Global Sales Colleagues, Legal Counsel and Finance Operations.Scope of Responsibility:Total Relationship Management involving:High level management contactStrategic planning within territory and key accountsNew product placementIdentification of opportunities across other business segmentsAbility to answer detailed client inquiries about MSCI products and methodologiesStrive to achieve or exceed targeted revenue goalsProactively keep all clients up to date about MSCI products, announcements, projects, etcWork with other teams and departments to ensure that all client requests and inquiries are managed appropriatelyMaintain accurate records regarding account visits, client conversations, finalized contracts, etc.Proactively solicit client feedback regarding new initiatives and future product developmentProvide feedback from clients to the Product Management Unit, Marketing, Sales Colleagues and ResearchDesired Experience:Bachelors Degree Required or equivalent experience; MBA, Masters Degree and/or CFA charter holder strongly desiredProven years of experience in the financial service industryMinimum of 4 years direct sales experience with a proven record of achievement and accomplishmentSuperior communication and time management skills with the ability to handle multiple detail-oriented projectsStrong sales closing skillsStrong analytical and quantitative skillsUnderstanding of/experience dealing with major financial institutions including Asset Managers, Hedge Funds, Broker Dealers, Pension Plans, and/or ConsultantsStrong understanding of the global equity and fixed income marketsA self-starter and highly motivated; ability to work individually and within a teamThorough understanding of the investment management processSomeone who enjoys intellectual and analytical challengesABOUT MSCI For more than 40 years, MSCIs research-based indexes and analytics have helped the worlds leading investors build and manage better portfolios. Clients rely on our offerings for deeper insights into the drivers of performance and risk in their portfolios, broad asset class coverage and innovative research.  Our line of products and services includes indexes, analytical models, data, real estate benchmarks and ESG research.  MSCI serves 98 of the top 100 largest money managers, according to the most recent P&I; ranking. For further information on MSCI, please visit our web site atwww.msci.comDue to the great number of applications we receive for each of our open vacancies, we are unable to respond on an individual basis. To all recruitment agencies: MSCI does not accept unsolicited CVs/Resumes. Please do not forward CVs/Resumes to any MSCI employee, location or website. MSCI is not responsible for any fees related to unsolicited CVs/Resumes. MSCI Inc. is an equal opportunity employer committed to diversifying its workforce. It is the policy of the Firm to ensure equal employment opportunity without discrimination or harassment on the basis of race, color, religion, creed, age, sex, gender, gender identity, sexual orientation, national origin, citizenship, disability, marital and civil partnership/union status, pregnancy (including unlawful discrimination on the basis of a legally protected pregnancy/maternity leave), veteran status, or any other characteristic protected by law."}