{"jobID": "2828480855", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst- Data Viz", "companyRating": "4.3", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "98000", "jobDescription": " About Uber Were changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now were a part of the logistical fabric of more than 600 cities around the world. Whether its a ride, a sandwich, or a package, we use technology to give people what they want, when they want it. For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer. And thats just what were doing today. Were thinking about the future, too. With teams working on autonomous trucking and self-driving cars, were in for the long haul. Were reimagining how people and things move from one place to the next. What Youll Do Scale the core data warehouse modelBuild data models and pipelines What You'll Need:Experience with Hadoop, Hive, Vertica, Spark, Presto is highly desiredStrong experience developing and launching efficient and reliable ETL pipelines to move dataStrong experience creating and evolving dimensional data models & schema designs to improve accessibility of data and provide intuitive analyticsExperience handling structured and unstructured data from internal and third party sourcesDemonstrated ability to think strategically about business, product, and technical challengesExperience developing scripts and tools to enable faster data consumptionExperience partnering with multiple teams in high visibility roles and owning end-to-end data solutionsExperience with ETL and business intelligence toolsFamiliarity with Kimballs data warehouse lifecycleExperience with SQL and Hive is a mustScripting experience with Python is highly desiredPassion and ownership over everything you ship; you'd never call code \"released\" until youre confident its correct, monitored, documented, and testedTeam player. You rely on others' candid feedback for continuous improvementBe sure to check out the Uber Engineering Blog to learn more about the team. #datavisualization About the Team At Uber, we have many opportunities to work with large data sets and to build essential pipelines that transform the data into insightful information. We are looking for a Data Engineer to design and build data models and pipelines to move that information across systems, and to build the next generation of tools to enable us to take full advantage of this knowledge. The engineers on this team are a critical part of making Uber's data platform successful. You will help scale the core data warehouse model at Uber that provides various Uber teams like Operations, Finance, Marketing, Eats, Fraud, Risk, Rider, Driver, Maps and Marketplace with accurate decision-making insights."}