{"jobID": "2808280671", "jobLocation": "San_Francisco_CA", "jobTitle": "Staff Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.vida.at", "Headquarters": "Vienna, Austria", "Size": "Unknown", "Founded": " Unknown", "Type": " Unknown", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " At Vida Health, we are passionate about transforming lives through better health. We live our vision everyday by creating solutions for preventing and reversing chronic conditions resulting in lower health care costs and better lifestyles for our customers.  We are a passionate team that loves building solutions to enable great outcomes for our members. The team is small enough that you can make an immediate impact on our products but also big enough for you to find your niche and focus on a particular area or technology to transform and further your career aspirations.  If you are an applied research engineer/scientist with a passion for working on massive semi-structured text, metrics, conversation, and graph datasets, then Vida Health is the place for you. The ideal candidate will have domain experience (data mining, information retrieval, data science, natural language processing, advanced statistics, and/or machine learning), a strong systems orientation, and experience in building data mining products. The work you put forth will directly impact and fuel Vida's ambitious goals and building recommendation systems, predictions systems and search systems ResponsibilitiesWork with BIG data, crunching millions of samples for modeling, data mining, recommendation, predictions or search relevance solutions.Provide technical leadership, driving and performing best engineering practices to initiate, plan, and execute large-scale, cross-functional, and company-wide critical programs.Identify, leverage, and successfully evangelize opportunities to improve engineering productivity.Process semi structured text and conversations and design conversational interfaces using NLP, sentiment analysis and other relevant toolsMentor other junior engineers and data scientists and help them growSpread data best practices, knowledge and use of data across the company.Basic QualificationsBA/BS Degree in Computer Science or Machine Learning or related technical discipline, or 7+ years of related practical experience.4+ years experience in software design, development, and algorithm related solutions.4+ years experience programming experience in Python, Java, or C/C++.Experience with Google BigQuery, SQL, RPreferred QualificationsBS and 8+ years of relevant work experience, MS and 5+ years of relevant work experience, or PhD and 4+ years of relevant work experienceExperience in designing and building infrastructure and web services at large scale.Expertise in one or more of the following: machine learning, data mining, text mining, security data science, advanced statistics, information retrieval, or natural language processing.Experience with iterative, test-driven development.Knowledge of Elasticsearch, Lucene/SOLR or other information retrieval systems.Knowledge of A/B Experimentation platformsPublished work in academic conferences or industry circles.Benefits & PerksCompetitive compensation including stock optionsA health-oriented office culture including walking 1:1s, healthy food & snacks, fitness challenges, and weekly team runs and Yoga classesHealth, Vision, Dental BenefitsFlexible vacation timeABOUT VIDA HEALTH: Vida is a next generation continuous care platform for both consumers and businesses, combining a consumer mobile app, an enterprise care platform offering on demand 24/7 solutions for chronic conditions. Vida platform runs in the cloud, captures real-time data from 100+ devices and apps, and integrates back to the employer, payer, and provider. 133 million people in the U.S. live with a chronic condition, 70% of the $3T healthcare spend in the U.S. goes to preventable chronic conditions."}