{"jobID": "2783438355", "jobLocation": "San_Francisco_CA", "jobTitle": "Marketing Technologist & Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.lendingclub.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2006", "Type": " Company - Public (LC) ", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Prosper.com, Funding Circle, OnDeck"}, "estimatedSalary": "85000", "jobDescription": "Lending Club (NYSE: LC) opened in 2007 with one simple mission: build a more efficient, clear and customer-friendly alternative to the traditional banking system that offers creditworthy borrowers lower interest rates and investors better returns. Today, we’re the world’s largest online credit marketplace, and we’re radically changing the way lending operates. We’re proud of the recognition we’ve received, including being named a World Economic Forum Technology Pioneer, a CNBC Disruptor 50, and one of The World’s 10 Most Innovative Companies in Finance by Fast Company. We’re conveniently located in downtown San Francisco, California. JOB PURPOSE Playing a critical role in partnering with marketing to developing and translate LendingClub’s Marketing Technology & Data objectives into a compelling roadmap you will be accountable for the execution, enablement and deployment of new marketing data and technology capabilities across the customer journey. You will play a pivotal role in helping transform the technology, capabilities, platform and processes to enable the success of Lending Club’s Marketing Strategy.  The candidate will report to the Marketing Technology and Customer Experience Lead who will outline the strategy and look to the candidate to own the creation of the marketing data and technology roadmap from design through to deployment, while partnering with key stakeholders to create it. You will also be required to partner with many entities/stakeholder groups including Marketing, Product, and Technology teams to prioritize and align activities against business objectives and drive the roadmap for implementation.  You will support the development of roadmap creation and execution from design through to deployment, partnering with key stakeholders to create. As part of the role you will need to ensure the organization change management activities are effectively managed and ensure uptake of the product is delivering to the business objectives. JOB ACCOUNTABILITIESWork with business stakeholders to collect requirements and Delivery Lead to translate it into an executional roadmap acting as the guardian of the roadmapManage the capture and translation of business requirements into user stories outlining the why and the whatWork with the Technical Delivery Lead to refine the what and understand the how (which is owned by the Technical Delivery Lead)Ensure all stakeholders understand, support and are aligned on the roadmapManage roadmap updates into sprint planning and deliveryPrioritize feature development through strong product backlog managementConduct competitor and market research leveraging customer insights to drive the product roadmapBe involved in all agile ceremonies including estimation sessions, planning meetings, daily stand ups, demos and retrospectivesBe available to answer questions about requirements and make product decisions as requiredAbility to use data to outline to not only prioritize but also come up with baseline measurements to to showcase business value of work being deliveredEvaluate gaps in capabilities, data or partners required to deliver Marketing strategies, and provide recommendations to deliver against themLead process re-engineering efforts to utilize the new marketing capabilities and engage with business partners from various streams to roadmap the re-engineered process and influence its applicationCOMMUNICATION & WORKING RELATIONSHIPSInternalMarketing Technology & Customer Experience lead, in the development of product strategy and roadmap communicating relevant technical details in simple business termsMarketing impacted stakeholders (Analytics, Marketing Operations and Partnership Marketing) on the feature releases and subsequent change impactsMarketing stakeholders to gather customer feedback to validate that the product works against stated metrics. Prioritize and deliver necessary enhancementsTechnical Data Delivery lead for the execution of the features, roadmap planning and storiesTechnical Engineering for collaboration on crossover areasExternalTechnology partners for executionConsultants for implementations/strategy assistanceQUALIFICATION & EDUCATION, EXPERIENCE, TRAINING & KNOWLEDGE You will have a passion and understanding of marketing technology with a focus on having fun while delivering incredible business results Blend of strategic and tactical thinking, creative and analytic reasoning, a deep knowledge of human-centered design, a love of data, and an interest in the industryExperience with data analytics, data warehousing and marketing operationsDemonstrate curiosity and an eagerness to learnA bias to action and a proven track record of delivering minimum viable products to market at rapid speedStrong proven planning skills and strategic thought processExcellent stakeholder management and communication skillsAgile specific knowledge/certifications and delivery experience is desired but not essentialSQL skills to define success metrics, trouble shoot and validate work deliveredQualification & Education:University degreeMarketing analytics, operations or technology background Lending Club is an equal opportunity employer committed to diversity in the workplace. Lending Club promotes a drug-free workplace. You will receive consideration for employment without regard to sex, race, color, religion, national origin, protected veteran status, or disability status.  #LI-KG1"}