{"jobID": "2745242542", "jobLocation": "Los_Angeles_CA", "jobTitle": "Licensing Associate - Engineering/Physical Sciences - USC Stevens Center for Innovation", "companyRating": "4.3", "companyInfo": {"Website": "www.usc.edu", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " 1880", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "96000", "jobDescription": " The USC Stevens Center for Innovation seeks outstanding candidates for the position of Licensing Associate in engineering and physical sciences.  The USC Stevens Center is a university-wide resource in the office of the Provost whose mission is to help USC innovators make maximum impact with their ideas. As part of this role, the USC Stevens Center manages the university's intellectual property portfolio stemming from USC's approximately $700 million in annual research expenditures, and manages related patenting, technology marketing, licensing, and new venture development activity aimed at transitioning university innovations into commercial applications for the benefit of society. Licensing Associates play a key role in supporting these efforts.  The best candidates will have an advanced degree in either computer science or engineering, a passion for emerging technologies, very strong organization and communication skills, and a desire to learn and grow. Prior licensing and/or technology assessment experience is preferred but not required. This position provides an opportunity for an entrepreneurial-minded computer science or engineering graduate to play an active and critical role as new technologies go from idea to market. This opportunity will allow you to contribute to new approaches in innovation management and licensing within an already bold and forward-thinking academic institution! Job Accountabilities:In this role you will manage a portfolio of University-owned engineering and computer sciences inventions and support intellectual property development, protection, marketing and licensing. You will interact with faculty and researchers and learn about exciting new technologies in the areas of electronics, telecommunications technologies, computing and big data analytics, energy, nanotechnology and advanced materials. Specifically, you will have the following responsibilities:Assisting with the assessment of inventions and identification of commercial applications through research and analysis of markets, competitive technologies, prior art, and patent landscape,Manage a portfolio of university software and inventions.Identify potential commercial applications and business partners for university inventions. Market university inventions through multiple channels to prospects capable of bringing the inventions to market.Negotiate and complete non-complex licenses and related agreements, including development of business terms and overseeing internal diligence procedures prior to agreement signingAssist in the management of complex intellectual property portfolios;Coordinate efforts on a wide range of activities with other USC Stevens staff members, university researchers, business partners, law firms, and others; tracking activities in databases and ensuring that information is up to dateTrain and supervise internsContribute to ongoing process improvement to enable the USC Stevens Center to deliver high quality, professional service to a growing base of inventors and business partners.Preferred Qualifications:EducationMaster's Degree in either the Physical or Computer Sciences fields. Experience 3 years of experience in a corporate or university technology transfer and business development setting.Experience with startups and new product developmentAbility to gather information and perform research utilizing databases and other online sources.Experience directly relevant to evaluating the market potential of early-stage software and inventions in engineering/physical sciences industries, and identifying commercial potential.Understanding of the patent prosecution process.An understanding of software application development and related business processes.Highly self-motivated with outstanding organization and time management skills.Ability to juggle multiple tasks and complete projects on a timely basis, working both independently and as part of a team.Eager to take ownership of projects.Requires a high level of attention to detail.Outstanding communication skills and ability to convey technical concepts.Demonstrated ability to develop relationships with collaborators.Customer service oriented.Demonstrated perseverance and problem solving skills.Field of Expertise:Knowledge of patent and contract lawBusiness Development experience.Minimum Education:Bachelor's degreeMinimum Experience:2 yearsMinimum Field of Expertise:Bachelor's Degree in Science or Engineering.Two years sales, marketing, contract, patent, or licensing experience.Requires an understanding of the research and technology development process. USC is an equal opportunity, affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other characteristic protected by law or USC policy. USC will consider for employment all qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring ordinance. We provide reasonable accommodations to applicants and employees with disabilities. Applicants with questions about access or requiring a reasonable accommodation for any part of the application or hiring process should contact USC Human Resources by phone at (213) 821-8100, or by email at uschr@usc.edu. Inquiries will be treated as confidential to the extent permitted by law.  Read USC's Clery Act Annual Security Report  Required Legal Notices  Certain positions are subject to background screening  If you are a current USC employee, please apply to this USC job posting in Workday by copying and pasting this link into your browser:  https://wd5.myworkday.com/usc/d/inst/1$9925/9925$17679.htmldSDL2017"}