{"jobID": "2513581054", "jobLocation": "San_Francisco_CA", "jobTitle": "Director of Development, Asia Society Northern California", "companyRating": null, "companyInfo": {"Website": "www.asiasociety.org", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 1956", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Asia Society, a prestigious, global non-profit with an exciting portfolio of programs in the areas of public policy, arts and culture, and education, is seeking a Director of Development for their Northern California Center.  The Director of Development works directly with the Executive Director, Assistant Executive Director, Associate Director, and Advisory Board to establish and execute the strategic direction and overall management of fundraising initiatives, both corporate and individual. These include planning annual and long-range strategic plans.  The Director of Development plays a key leadership role within ASNC. Responsibilities include: implementation of development, membership, marketing, development budget, monitoring, managing development interns and volunteers and coordinating special events Working in this capacity requires experience in strategic planning, donor cultivation and stewardship, public relations, audience development, and event planning. Successful candidates must be at ease in cross-cultural settings, comfortable working with board members and senior level executive officers, able to communicate effectively with a wide range of people, and able to implement events that strengthen relationships between the peoples of Asia and the US. The DOD also represents the organization at philanthropic-related events and meetings. RESPONSIBILITIES:Conceptualize and execute development strategies, special events, and corporate programs. These include: membership drives, the Annual Dinner benefit, President Circle and board appreciation events, and other activities aimed at cultivating donors and sponsors.Program-related duties include: working with the Associate Director to draft content and oversee the creation and design of all solicitation collateral materials with specific reference to individual and corporate giving, interacting with co-sponsors, securing event venues, publicizing, brand development, implementing marketing strategies, and overseeing catering for private program events.Develop and manage calendar for fundraising activities.In cooperation with the Executive Director and Assistant Executive Director, establish development goals, plan development strategy, and implement creative and comprehensive identification, qualification, cultivation, solicitation and stewardship strategies for a portfolio of corporate and foundation prospects.Draft membership and development reports, including: New York annual membership report, newsletter membership reports, Advisory Board development reports, and special event budgets.Work with Executive Director, Assistant Executive Director, and Associate Director to identify funding sources, program sponsors, foundations and potential donors.Manage stewardship; oversee support staff working on fundraising activities including donor research, tracking and acknowledgement for appropriate public recognition, and annual appeals.In cooperation with the Executive Director, Assistant Executive Director, and Associate Director, research grants and draft funding proposals, letters, and reports.Manage and collaborate with grant writers for foundation support.Supervise the development, maintenance and ongoing design of Raiser’s Edge to monitor and track all contributions and generate reports and analysis as required.Identify, cultivate, solicit and build, close and steward corporate and community partnerships and alliances.Implement and supervise internship program for Development Interns. Recruit, oversee, and engage volunteers and staff for special events.Oversee media contact for special events.Work with the Executive Director, Assistant Executive Director, Associate Director, program staff, and accounting personnel to coordinate allocations of funding to program and development areas in annual budgeting processes.Other duties as assigned by the Executive Director and Assistant Executive Director.QUALIFICATIONS:Advanced degree desirable; B.A. requiredFamiliarity with Bay Area philanthropic community particularly with Asian and Asian American Communities, business community and policy communityDemonstrated experience in fundraising, event planning, public relations, membership, marketing and development with 7-9 years of experienceAttention to detailStrong administrative ability and prior supervisory experienceExcellent oral, writing, and proofreading skillsFamiliarity with fundraising software Knowledge of Asian languages a plusKnowledge of Asia through travel or living experience desirableFamiliarity with Asian arts, culture, business, and policyCOMPETENCIES:Leadership:Persuades others; builds consensus through give and take; gains cooperation from others to obtain information and accomplish goalsDevelops networks and builds alliances; collaborates across boundaries to build strategic relationships and achieve common goals.Professional and Results-Oriented:Seeks to consistently produce results that achieve goals and objectivesConscientious and efficient in meeting commitments and observing deadlines Able to work independently with minimum supervisionGood judgment, tact and discretionAbility to translate ideas into actionCollaboration and Teamwork:Excellent skills in communicating with people from different cultures, backgrounds, and across time zonesWorks with others towards common purposes to achieve shared goals by developing and maintaining responsive, cooperative and mutually beneficial internal and external relationshipsActs as a global facilitator to have conversations, exchange ideas and build understandingInnovation:Identifies new and creative ways of doing something or solving a problem that improves, changes and results in value to the organization and constituencies (could be through technology or introducing new ways of thinking)Uses technology for impact, reach and efficiency, such as through social media, databases, etc.Technical Expertise:Professional competencies in the related field of workRecognizes trends in theory and practice of one’s own technical area and effectively prepares for anticipated changesHow To Apply: Please email your cover letter, resume, and salary requirements to  to: sanfrancisco@asiasociety.org or fax to (415) 421-2465.  Indicate job title and reference code in the subject line. No phone calls, please.  Asia Society is an equal opportunity employer."}