{"jobID": "2607532302", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.castleglobal.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About Castle GlobalCastle Global is a full-stack deep learning company solving visual intelligence problems. Our flagship platform, Hive, consists of Hive Data—100k distributed workers performing data labeling tasks—and Hive Enterprise, where we build vertical-changing applications leveraging computer vision and deep learning. We're working with some of the world's largest technology and content businesses to change the way they analyze unstructured image and video data through machine learning.We are funded by leading investors like Peter Thiel (Founders Fund), General Catalyst, and Formation 8. We have ~100 people globally, based in our San Francisco and Delhi offices.Data Science TeamIn order to execute our vision, we are looking to expand our team of data scientists. We generate an enormous amount of valuable proprietary data in a number of verticals, and we are building a team dedicated to deriving insights from this data. This team will bridge the gap between the \"tagged\" data that our machine learning team builds and the product team in delivering business insights. Our ideal candidate has experience working with massive data sets (think 10B+ rows of data) and is comfortable with both statistics and engineering.Responsibilities Everything involved in analyzing a production data set, including:Writing code to transform massive raw data output into a structured, usable formLeveraging more traditional machine learning techniques to uncover hidden relationships in our data setsConducting statistical analysis of results to prove / disprove hypotheses, andWrite up reports that our other team members can use to deliver in a productInterface closely with the Product, Business Development, and Sales teams to answer questions about our data sets that our customers and partners are seeking solutions forRequirements You have an undergraduate or graduate degree in computer science or similar technical field, with significant coursework in mathematics or statisticsYou have 1-2 years of industry data science experienceYou have successfully worked with complex data sets and are familiar with Hadoop / SparkYou know the ins and outs of Python, especially as it applies to the above data processing frameworksYou are capable of quickly coding and prototyping data pipelines involving any combination of Python, Node, bash, and linux command-line tools, especially when applied to large data sets consisting of millions of filesYou have a working knowledge of the following technologies, or are not afraid of picking them up on the fly: C++, Scala / Spark, R, Matlab, SQL, Cassandra, DockerYou are comfortable with running and interpreting common statistical tests, and also with common data science techniques including dimensionality reduction and supervised and unsupervised learningYou have great communication skills and ability to work with othersYou are a strong team player, with a do-whatever-it-takes attitudeWhat We Offer YouCastle Global offers a network of companies with extensive resources and exceptional people. We are a group of individuals who are young and hungry to make a mark on the world and build a long-term investment holding company. You will be based in San Francisco and we offer all the standard benefits available to top startup companies. At Castle, you will have a significant career development opportunity and an opportunity to learn directly from our founder / CEO.Thank you for your interest in joining Castle."}