{"jobID": "2821617099", "jobLocation": "Brooklyn_NY", "jobTitle": "Founding 5th Grade Math Teacher", "companyRating": "3.9", "companyInfo": {"Website": "www.achievementfirst.org", "Headquarters": "Brooklyn, NY", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " School / School District", "Industry": " Education", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": "Start Date: July 2018Teaching at Achievement First: Achievement First invites passionate educators to apply for the position of MathTeacher for the 2018-19 school year. Teaching at Achievement First is an ideal position for an educator with deep passion for instruction who is eager to gain rigorous development to help perfect his/her craft. In addition to participating in weekly professional development and team planning meetings, teachers receive consistent high-impact coaching and feedback from a school administrator or teacher-leader. Furthermore, Achievement First has recently launched Teacher Career Pathway, a systematic, coordinated approach to recognizing and developing great teachers as they progress through five career stages. These stages were developed to celebrate excellent teachers and are accompanied by increased compensation, recognition and professional development opportunities. Achievement First is committed to recruiting, developing and retaining excellent teachers. Responsibilities of the Achievement First school teachers will include but are not limited to:Outstanding academic achievement and student character developmentCreate a positive, achievement-oriented and structured learning environment that excites and invests students.Motivate students to realize high academic and behavioral standards.Build classroom community by investing families in children’s academic success and development of REACH values (REACH stands for Respect, Enthusiasm, Achievement, Citizenship and Hard work).Utilize data from Achievement First’s interim assessments to drive instruction and intervention.Design and implement unit and lesson plans in collaboration with grade or subject team.Hold all students accountable during transitions, meals, trips and school events.Exemplify AF’s core values in all interactions with students, families and colleagues.Professional learning, development, and growthCollaborate with coach, grade-level chair and school team to improve instructional, culture-building and leadership skills.Attend all professional development, team planning and data analysis meetings.Participate enthusiastically in structured and informal learning and development opportunities.Skills and CharacteristicsStrong instructional and classroom management skills.High level of personal organization and planning.Team player: maturity, humility, strong work ethic, follow-through, sense of humor, willingness to respond positively to feedback and a “roll-up-my-sleeves” attitude.Strong belief in the Achievement First mission and educational model.Mastery of and enthusiasm for subject matter.Educational Background and Work ExperienceTwo years of teaching experience preferred with a proven record of high student achievement.Bachelor’s degree with a GPA of at least 3.0 from a competitive college or university; Master’s degree preferred.New York, Connecticut or Rhode Island certified or in process of obtaining a certification. If you are not yet certified, you may learn more about the process at http://eservices.nysed.gov/teach/certhelp/CertRequirementHelp.do (for NY),http://www.sde.ct.gov/sde/cwp/view.asp?a=2613&q;=321230 (for CT), orhttp://www.ride.ri.gov/TeachersAdministrators/EducatorCertification/CertificationRequirements.aspx (for RI)Compensation Salary for this position is very competitive and commensurate with experience. Additionally, Achievement First offers a comprehensive benefits package. Teachers receive funds for supplies and materials as well as a laptop computer.  Achievement First is an equal opportunity employer and an organization that values diversity. People from all diverse backgrounds are strongly encouraged to apply. Spanish language proficiency is a plus. You can learn more about diversity at Achievement First here: http://achievementfirst.org/about-us/diversity/"}