{"jobID": "2656125394", "jobLocation": "San_Francisco_CA", "jobTitle": "Software Development Intern (Full-Stack)", "companyRating": "4.0", "companyInfo": {"Website": "www.castlighthealth.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2008", "Type": " Company - Public (CSLT) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "71000", "jobDescription": " Castlight Health is seeking a Software Engineering Intern to join our Web Applications team based in San Francisco, CA.  Castlight wants to help users navigate the world of healthcare and sickcare. That is to say, we want to motivate healthy habits - and reward people - in $$ for living healthfully. And we want to help users when they are sick - finding the right medical provider, service or company program that is best for them. For example, I am now earning reward points (that convert to cash) for tracking my daily workout, my sleep, and what I eat. And, on the other side of the equation, if you need an wrist X-ray for that carpal tunnel from either too much coding, or more likely too much texting – and then choose the best doctor for you. Whether that choice is based on quality, price, distance or all three – Castlight has you covered. Quick tip – go to an imaging center, not a hospital – our research shows you will save money and they all use the same equipment. Sure, Castlight provides much more like personalized recommendations, understandable summaries of your company’s benefit programs, a history of all your claims, and current HSA/HRA balances – and how much to go before your care is free for the rest of the year.  Our summer interns are an integral part of our team. You will work on real projects on our production system as part of our standard scrum teams. Thus, the specific work will vary by scrum team, but all interns will have the opportunity to write and test software in a web application framework, while partnering with a group of experienced software engineers who help and challenge them as they work on projects that matter to our customers. Collaborating with other developers and designers, the Web Applications team delivers innovative, engaging products that empower users to make the best choices for their health. Pursuing a Bachelor's in Computer Science or a related fieldProficiency in Java and AngularExperience with Ruby on RailsExperience with CSS/HTML and/or MySQL (yup, we are full stack people here)Computer Science fundamentals in any of the following: object-oriented design, data structure, algorithm design, problem solving, and complexity analysisDemonstrated ability to work well as a member of a software teamPassion for learning"}