{"jobID": "2572829426", "jobLocation": "San_Francisco_CA", "jobTitle": "Lead Data Engineer", "companyRating": "4.1", "companyInfo": {"Website": "www.microsoft.com", "Headquarters": "Redmond, WA", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (MSFT) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Amazon, Apple"}, "estimatedSalary": "162000", "jobDescription": " Lead Big Data Engineer Why we feel this is a unique opportunity: Over 2 million users trust MileIQ, the top grossing finance app in both app stores, to automatically log their mileage for their largest deductions and reimbursements ever.  At MileIQ, we work in small, independent, cross-functional Scrum teams to craft innovative software solutions for our customer's needs.  Our Services team is fast-paced and agile with weekly production pushes. We are a community of talented engineers who are passionate about building highly scalable, data intensive, solutions on an open source software stack  We make architecture decisions collaboratively and iterate quickly. We keep alive an inherently startup-like, risk-taking culture but we also take the responsibility seriously to carry one of the world's most recognizable software brand names - Microsoft.  Join us in reinventing the future of productivity! What you will have ownership for delivering: Architect our next generation analytics and machine learning platform  · Implement and operate data pipeline for collecting millions of metrics per day from client applications and users  · Write code to develop new software products and/or features, manage individual project priorities, deadlines and deliverables  · Work with data scientists and analysts to put machine learning models into production  · Build tools, frameworks and dashboards to support running experiments and analyses  · Lead data governance and review all data and database schema changes. Skills needed to be successful: · Experience setting up and managing multi-TB data warehouses and HDFS clusters. (experience with Azure Data Warehouse or Redshift, preferred)  · Experience with ETL processes to transform data from a variety of data sources to a normalized form  · Experience building data pipelines leveraging open source technologies like Kafka, Hadoop, Hive, Pig, and Spark · Experience working with RDMS databases (e.g. PostgreSQL or SQL Server), managing connection-pools, performance tuning and optimizations  Experience with database design and SQL/NoSQL data-stores · 3+ years programming in SQL and Python  · Large-scale systems software design and development experience, with experience in Unix/Linux.  BS Degree in Computer Science or related technical discipline or equivalent work experience Preferred Skills: · Background building data pipelines leveraging Azure/Microsoft technologies (e.g. Azure Data Lake, HDInsights), a plus  . · Experience with machine learning libraries such as Mllib, scikit-learn, TensorFlow, and/or Keras, a plus  · Modern visualization tools such as Grafana or Kibana, Jupyter notebooks  · Experience with data governance and managing large data schemas, a plus  · Python and Spark in a production environment.  Send resume directly to v-anbrya@microsoft.com  ABSOLUTELY NO THIRD PARTY SOLICITATION!"}