{"jobID": "2750993863", "jobLocation": "San_Mateo_CA", "jobTitle": "Data Scientist", "companyRating": "1.9", "companyInfo": {"Website": "global.rakuten.com/corp", "Headquarters": "Tokyo, Japan", "Size": "10000+ employees", "Founded": " 1997", "Type": " Company - Public (4755) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " eBay, Amazon, Yahoo"}, "estimatedSalary": "125000", "jobDescription": "We're always looking for  talented and creative people to join our team. Ebates offers a casual but fast  paced environment where creativity and effective teamwork and collaboration are  rewarded. We are passionate about changing the way people shop online and  providing the best possible customer experience - not to mention cash back on  every purchase, with no strings attached. In 2016, members spent over $6  billion on Ebates' websites and since the inception of the company, have earned  nearly $1 billion in cash back. During the peak days of 2016, over 5% of U.S.  online shopping went through Ebates!  Ebates is a profitable, high  growth e-commerce company based in the San Francisco Bay Area. We are part of  the Rakuten family of companies. Rakuten is a very progressive company  providing Ebates with substantial capital, access to great technology, and  access to international markets. We're always interested in meeting talented  individuals interested in helping us change the way the world shops, so if  you're passionate about helping save people money and improving the shopping  experience apply now!  We're seeking an exceptional Data Scientist with deep expertise in  statistics, machine learning and optimization to help drive growth on a core  part of our product offering. You should be a team player, with the ability to  work with wide range of stakeholders and functional teams, and be comfortable  on the front lines of the business making a real difference. You will be  responsible for creating and enhancing data science products, through  innovative thought processes, all the way from conception to deployment and  testing. This role is perfect for someone looking to make a real difference by  deploying their data science skill set at a successful and growing company.  Please note this position may  be in our San Mateo office but we may have flexibility for another Ebates  offices as appropriate. Responsibilities:Design and develop scalable  algorithms, using large amounts of data, to drive ever smarter productsUse data mining skills to  design and develop tools that can optimize recommendations and user  experience for our website customersUse internal data to  better understand customer behavior within the business funnel, from  acquisition, through retention to monetizationDeliver  impact on variety of areas like content personalization, customer  communication, payments, product development and merchant relationshipsPractice  and recommend latest technology trends and statistical / mathematical  methodologiesWork  closely with a variety of teams to deploy tests, drive deployment and adoption  of data science productsQualifications:MS in  Computer Science, Statistics, Applied Mathematics, or a related field4+  years experience working as a data scientist at an e-commerce websiteStrong  R or Python skillsStrong  SQL skillsStrong  applied machine learning skills of multiple techniques and algorithms,  such as decision trees, regression, k-NN, unsupervised pattern detection  etc.Experience working with  reporting tools (Tableau preferred)Experience with Scala a  plusExperience working as a  data scientist for an e-commerce websiteExperience developing  optimization and recommendation algorithmsExperience using  statistics and a variety of models to understand the workings of an  ecommerce businessExperience communicating  analyses and fielding questions from executive team membersExperience with  successfully moving data science products from prototypes to production  releaseExperience working in a  fast-paced, entrepreneurial environmentExperience working on  multiple projects at the same time, with short deadlines Any unsolicited  resumes/candidate profiles submitted through our website or to personal email  accounts of employees of Ebates are considered property of Ebates and are not  subject to payment of agency fees."}