{"jobID": "2828032763", "jobLocation": "New_York_NY", "jobTitle": "Sept 2018 Underwriting Professional Development Program", "companyRating": null, "companyInfo": {"Website": "www.travelers.com", "Headquarters": "Hartford, CT", "Size": "10000+ employees", "Founded": " 1853", "Type": " Company - Public (TRV) ", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Company Information Solid reputation, passionate people and endless opportunities. That's Travelers. Our superior financial strength and consistent record of strong operating returns mean security for our customers - and opportunities for our employees. You will find Travelers to be full of energy and a workplace in which you truly can make a difference. Job Summary Under close supervision and as a participant in a structured training program, actively learns about underwriting philosophy, business unit products and strategies, negotiation, and relationship building. As a trainee, handles renewal business under direct supervision and moves to developing new business as skills advance. As knowledge increases and, under direct supervision, takes on less complex underwriting of individual accounts and eventually a territory. Seeks out opportunities to observe CURE discussions with other AEs and MDs. Takes initiative for their own development. The incumbent in this job does not manage others. Primary Job Duties & Responsibilities Underwriting and Pricing: Under direct supervision, underwrites and assesses risk and makes recommendations for less complex accounts in a market segment. Distribution and Agency Management: Establishes effective relationships with customers, agents and brokers. Sales: Develops consultative sales and marketing skills through their interaction with agents/brokers and via coaching from their manager. Negotiation: Develops negotiation skills through their interaction with agents/brokers and via coaching from their manager. Executes Strategy and Drives Results: Develops planning and organization skills necessary to effectively manage desk and assume a territory. Business Planning and Collaboration: Effectively collaborates with others on all aspects of job. Understands the need to seek enterprise-wide solutions to business problems. Leading Self: Takes initiative for personal development and seeks to learn through underwriting, marketing, and other related opportunities. Other duties as assigned. Minimum Qualifications Bachelor degree or one year of applicable business experience required. Education, Work Experience & Knowledge Entry level position. Educational background/ coursework in Business Administration/ Management, Finance/Accounting, Economics, Mathematics/Science, Sales/Marketing/Communications preferred. Industry/Business Knowledge: Demonstrates an ability, desire, and intellectual curiosity to learn the business. Job Specific & Technical Skills & Competencies Business Perspective: Uses knowledge of internal and external factors impacting the property & casualty industry to make decisions. Analytical Thinking/Financial Acumen: Identifies current or future problems or opportunities, analyzes, synthesizes and compares information to understand issues, identifies cause/effect relationships and explores alternative solutions to support sound decision making. Understands and uses financial information, tools and expense management principles to accomplish day-to-day work and maximize profitability. Relationship Management: Seeks out, builds, fosters and maintains productive relationships, networks or alliances to meet goals and achieve results. Environmental/Work Schedules/Other Travel 10-25% of time. Physical Requirements Operates standard office equipment (Continuously) Sitting (can stand at will) (Frequently) Use of Keyboards, Sporadic 10-Key (Frequently) Driving (Occasionally) Licensing or Certificates Valid drivers license or alternate means of personal transportation. Equal Employment Opportunity Statement Travelers is an equal opportunity employer."}