{"jobID": "2831220142", "jobLocation": "Oakland_CA", "jobTitle": "Data Analyst, Digital Team Intern", "companyRating": "3.9", "companyInfo": {"Website": "www.tweglobal.com", "Headquarters": "Southbank, Australia", "Size": "1001 to 5000 employees", "Founded": " 1843", "Type": " Company - Public (TWE) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "65000", "jobDescription": "About the Position: At Treasury Wine Estates (TWE), we take data very seriously and appreciate its value. This role requires someone who is data literate, has an analytical mind and can translate data into actionable insights. This position would be primarily focused on the data from the augmented reality app, Living Wine Labels while also helping to comb through other consumer-focused data and databases. You’ll have the opportunity to work with the most digitally progressive wine company, learn more about the wine business and progressive digital efforts, and work with a fast-paced team. Key Responsibilities/ Accountabilities:Living Wine Labels:Partner with Digital Team to unlock the power of the data coming from the Living Wine Labels appDevelop a clear understanding and map of available data & relevant sourcesProduce regular, standardized reporting suite (dashboard) fulfilling the needs of key global stakeholdersInterrogate LWL related data to ascertain & communicate actionable insights leading to consumer experience optimisation, journey map understanding & resource re-allocationExplore cross pollination opportunities between TWE data and key retailer data to uncover retail specific insights and opportunities for LWL integrationFurther develop Living Wine Labels database to optimize statistical efficiency and qualityIdentify, analyze, and interpret trends or patterns in complex data setsDevelop a methodology to create synergies between Living Wine Label user data and wine salesOverall Brand / Consumer Data:Partner with the Knowledge and Insights Team to receive and fulfil data requestsRegularly evaluate brand performance, including but not limited to consumer insights analysis and IRI trendsEffectively consolidate data into key learnings and provide recommendation actions when necessaryAnalyze data to find key trends that can translate into actionable business and brand insightsQualifications and Experience:BA degree preferred – Plus if in Mathematics, Economics, Statistics, etc.Experience in Data Analytics, Digital Marketing or Brand MarketingExperience with Google Analytics or other digital reporting tools / platformsExperience with IRI or AC Nielson reporting analysisWorking knowledge of Microsoft Excel, Word, PowerPoint and OutlookA passion for wineAccomplished project manager who can multi-task and effectively prioritize and manage a significant workloadProven working experience as a data analyst or business data analystKnowledge of statistics and experience using statistical packages for analyzing datasetsStrong analytical skills with ability to collect, organize, analyze and disseminate significant amounts of information with attention to detail and accuracyStrong interpersonal skills to work and communicate with cross functional teamsExcellent written and verbal presentation skillsMust be at least 21 years of ageApply Today! Treasury Wine Estates is an Affirmative Action/Equal Opportunity Employer"}