{"jobID": "2808712492", "jobLocation": "New_York_NY", "jobTitle": "2018 Human Resources Fall Intern", "companyRating": null, "companyInfo": {"Website": "www.nrdc.org", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " 1970", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Natural Resources Defense Council (NRDC) is the nation's most effective environmental action organization. We use law, science and the support of 3.1 million members and online activists to protect the planet's wildlife and wild places and to ensure a safe and healthy environment for all living things. NRDC was founded in 1970 and our staff helped write some of America's bedrock environmental laws, including the Clean Water Act, and many of the implementing regulations; our water enforcement cases played a major role shaping current water policy throughout the country. Today, our staff of more than 500 lawyers, scientists, economists, policy and communications experts, and others, work out of offices in New York, Washington, Chicago, Los Angeles, San Francisco, Bozeman, Montana and Beijing. Position Summary: NRDC is seeking a creative, detail-oriented, motivated individual to intern in our Human Resources Department. This is an excellent opportunity to gain practical experience in the HR field while working with an active, upbeat not-for-profit organization.  This internship is designed to be both educational and practical. In this position, the intern will learn how to take skills she or he may have acquired in school, and apply them in a professional setting. He or she will gain a better understanding of the role that Human Resources can play in a non-for-profit setting, and be better prepared to work in the arena of human resources.  This is a paid Internship, requires a minimum work schedule of three (3) days a week and offers flexible hours.  The Human Resources Intern will directly assist the Human Resources team with a wide range of projects related to HR compliance, HR data analysis, recruiting, onboarding-orientation, employee benefits, and intern programs.  Current enrollment in a undergraduate degree program with a graduation date of December 2018 or May 2019. You must have an interest and aptitude to work in Human Resources, or not-for-profit management/administrative fields. Must have strong grades (3.0 or better), statistical, analytical, writing, research skills as well as the confidence and maturity to assume serious responsibility.Must at least be entering Senior year of Undergraduate.Statistics major or minor is a plus.Ability to prioritize tasks and handle numerous assignments simultaneously.Proficient in Microsoft Office and internet applications, advanced skills in Excel.Must be able to start the week of September 6th, 2018 and can work through December 28th, 2018. NRDC is committed to workplace diversity and inclusion. We are equal opportunity employers and do not discriminate in hiring or employment on the basis of race, color, religion, national origin, gender identity and expression, marital status, sexual orientation, age, disability, veteran status, or any other characteristic protected by federal, state, or local law. We offer competitive salaries, excellent benefits, and a pleasant working environment.  Pursuant to the San Francisco Fair Chance Ordinance, for positions based in San Francisco, CA we will consider for employment qualified applicants with arrest and conviction records.  To apply, please visit www.nrdc.org/jobs and upload your resume and cover letter through our online portal. We would like you to upload any additional papers or project work that you think would showcase your abilities. Please no phone calls, emails, faxes or in-person resume drop-offs. Please reference where you saw this posting. NRDC is an Equal Opportunity Employer.  If you are having technical difficulty while applying, please reach out to Customer Care by dialing1-800-889-4422.  For further information about NRDC, please visit www.nrdc.org"}