{"jobID": "2678464417", "jobLocation": "Bronx_NY", "jobTitle": "Delivery Driver", "companyRating": "3.9", "companyInfo": {"Website": "www.cesco.com", "Headquarters": "East Dubuque, IL", "Size": "1001 to 5000 employees", "Founded": " 1919", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "15", "jobDescription": "Delivery Driver in Bronx, New York*Check out our video to learn about a day in the life.Position Overview:Responsible for the timely and accurate delivery and/or pick up of goods to specified locations. Responsibilities include but not limited to safe operation of vehicle and loading and unloading trucks in an efficient manner.Primary Duties:Drive company trucks making prompt, on schedule deliveries and pick-ups while notifying management of any delays in the delivery schedule.Become familiar with delivery routes and customers' preferences.Perform warehouse duties when called upon which includes materials handling, shipping and receiving, picking and packing orders.Load and unload trucks in an accurate and efficient manner.Responsible for inspecting vehicles daily and reporting any issues.Maintain vehicle properly and furnish vehicle operation report.Report and observe customer problems and opportunities.Report and record damage to vehicles and/or product, equipment, and vehicles.Identify deficiencies and/or areas of improvement in the delivery process and communicate to management.Qualifications:A valid driver's license.Must meet Crescent Electric Supply Company's requirements to drive company vehicles.Drivers of vehicles are required to meet Federal Motor Carrier Safety Regulations.Current medical certification card or ability to obtain a card.Forklift certification or ability to acquire a forklift license.Must possess interpersonal skills, organizational skills, be a self starter and have the ability to communicate (verbal and written).Previous product delivery experience and knowledge of the delivery area preferred.Forklift experience a plus.Ability to lift up to 100 lbs. occasionally.High school diploma or general education degree (GED); six months related experience and/or training; or equivalent combination of education and experience.Competitive Benefit Package:We offer a competitive benefits package including 401(k), medical, dental, life, and disability insurance.CESCO is an Equal Opportunity Employer:Candidates are subject to reference checks, credit, criminal background and DMV checks, assessments, and a post-offer drug screen.EOE/M/F/Vets/DisabilityClick on the following link: http://bit.ly/2cVXeXn to be directed to our Youtube playlist. Learn more about Crescent Electric Supply Company and what our employees have to say about working for this great organization."}