{"jobID": "2794878767", "jobLocation": "Anaheim_CA", "jobTitle": "Technology Analyst Intern - Anaheim, Fall", "companyRating": "3.8", "companyInfo": {"Website": "www.disney.com", "Headquarters": "Burbank, CA", "Size": "10000+ employees", "Founded": " 1923", "Type": " Company - Public (DIS) ", "Industry": " Media", "Revenue": " $10+ billion (USD) per year", "Competitors": " News Corp, WarnerMedia, NBCUniversal"}, "estimatedSalary": "73000", "jobDescription": "Job Posting Title Technology Analyst Intern - Anaheim, Fall 2018  29-May-2018 Job Description At Disney, we are storytellers. We make the impossible, possible. We do this through utilizing and developing cutting-edge technology and pushing the envelope to bring stories to life through our movies, products, interactive games, parks and resorts, and media networks. Now is your chance to join our talented team that delivers unparalleled creative content to audiences around the world.  The Walt Disney Attractions Technology team combines custom technology solutions with creativity to produce robust applications that enhance all aspects of the guest experience. From one of the most sophisticated hotel reservation systems in the world to Disney Cruise Line shipboard systems, Disney Vacation Club member services, FastPass ticketing, PhotoPass, and even inventory applications to ensure we have the right number of cast costumes. WDP&R; Technology seeks forward-thinking team members who are passionate about delivering a quality product and enjoy working closely with business partners on both strategic and tactical challenges. Auto req ID493669BRPrimary Location-City Anaheim Employment Type Temporary/Seasonal Country / RegionUSPrimary Location-State/RegionCAJob Posting - Business Disney Parks & Resorts Internship Program Subtype Professional Internship Additional InformationInternship Eligibility: · Must be enrolled in an accredited college/university taking at least one class in the semester/quarter (spring/fall) prior to participation in the internship program OR must have graduated from a college/university within 6 months OR currently participating in a Disney College Program or Disney Professional Internship  · Must be at least 18 years of age  · Must not have completed one year of continual employment on a Disney internship or program.  · Must possess unrestricted work authorization  · Must provide full work availability  · Must provide own transportation to/from work  · Current Active Disney cast members must meet Professional Internship transfer guidelines (for Walt Disney World cast members this is no more than four points and one reprimand in the last six months; for Disneyland cast members this is six months of consecutive service and a performance record clear of any disciplinary issues (warnings, suspensions, etc.) for at least six months) Program Length: The approximate dates of this internship are August-December 2018  Location: This position sits in Anaheim, CAHousing: Interns must be able to provide their own housing for the duration of the internship. Interns must be fully available for the duration of the internship.  Recommendation – Print or Save This Role Description: Strong candidates may be invited to complete a phone interview. We strongly encourage applicants to print a copy of this role description so they can refer to it in the event they are selected for a phone interview.  This position is a legal entity of Walt Disney Parks & Resorts, an equal opportunity employer. Primary Job Posting Category Technology Basic QualificationsStrength in analytical and critical thinkingExperience and understanding requirements gatheringSpecific experience Windows applications and networkingExposure to AGILE methodology or comparable software development methodologiesStrong writing and verbal skillsJob Posting - Primary Brand Disney Parks & Resorts Required Education Junior, Senior, Graduate Level student or recent graduate (within 6 months of graduating) pursuing a Bachelor's or Master's Degree in Computer Science, Computer Engineering, Management Information Systems or related field. Primary Location-Postal Code32830Responsibilities With Walt Disney Attractions Technology, this intern will be expected to perform analysis and support activities for technology projects within Disneyland Ticketing technology team.  Coordinate between business team members, software developers, application support members, and other partners to complete assigned tasks. Under the guidance of a project manager and other senior team members, create project artifacts such as requirements, designs, test plans and deployment plans. Use available tools, such as Service Now, VersionOne, SharePoint and Confluence to manage and execute assignments.  Be a part of a transformative team and culture participating and working in a dynamic application support environment  The Technology team seeks forward-thinking team members who are passionate about delivering a quality product and enjoy working closely with business partners on both strategic and tactical challenges. Candidate should have good verbal and written communication skills, and be able to work independently as a self-starter, utilize good time management skills, and function well within a diverse team. "}