{"jobID": "2827291444", "jobLocation": "Los_Gatos_CA", "jobTitle": "Occupational Therapist - PRN - El Camino Hospital Los Gatos - Los Gatos", "companyRating": "2.6", "companyInfo": {"Website": "www.rehabcare.com", "Headquarters": "Louisville, KY", "Size": "1001 to 5000 employees", "Founded": " 1982", "Type": " Subsidiary or Business Segment", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "45", "jobDescription": " Description:Kindred RehabilitationServicesis the largest diversified provider of rehabilitation therapy in the country. Through RehabCare and Kindred Hospital Rehabilitation Services, we provide leading therapy to more than 2,000 sites of service across different settings in the care continuum and have been managing rehab for more than 30 years. We provide rehabilitation services, including physical, occupational and speech-language therapies to virtually every care setting including inpatient, outpatient, skilled nursing, home health, long-term acute care and assisted living. With locations across 47 states, we are certain to have a rehab job for you.Your career growth begins when you join an interdisciplinary team, where doctors, nurses, therapists and other experts work together to form individualized care plans for our patients and residents. Opportunities through our development programs, training seminars and university partnerships, not only allow for continual career growth but emphasize our commitment to investing in our employees and developing future healthcare leaders.The goal of our team is to focus on each patient as an individual to ensure that we are meeting their clinical needs and creating a fun and dynamic healing environment. Each employeeâs dedication is essential to meet and exceed the needs of each patient, resident and family we serve. Ranked as one of Fortune magazineâs âMost Admired Healthcare Companyâ for 8 years, Kindred welcomes you to join our team and build a career that touches lives.As an Occupational Therapist / OT you will\\:After evaluating your patient's condition, you'll develop a specialized treatment plan to help him/her achieve as much as possible in regaining his/her well-being through exercise and/or use of prosthetic and orthotic devices. You and your staff will play an important role in his/her recovery.Communicate patient progress or problems to supervisor and other team members; instruct patient's family or nursing staff in follow-through programs.Document patient care in accordance with Peoplefirst Rehabilitation, regulatory, licensing, payer and accrediting requirements.Maintain equipment and work area in a safe and clean condition.Make presentations to support marketing efforts, at team conferences and in-services.Handle job responsibilities in accordance with the standards of the Company's Code of Business Conduct, the Corporate Compliance Agreement, appropriate professional standards and applicable state/federal laws. occupational therapist, Acute care, ADL, ADLs, ALF, BLS, case management, case manager, clinical, clinic, clinical rotation, geriatric, geriatrics, Healthcare, health care, hand therapy, Homecare, home care, home health, homehealth, hospital, inpatient, inpatient OT, inpatient O.T., inpatient occupational therapist, inpatient therapist, licensed therapist, licensed OT, licensed O.T., licensed occupational therapist, modalities, OT, O.T., OTR, O.T.R., OTL, O.T.L., occupational therapist, occupational therapy, medical, medical care, therapist, therapy Care Manager, therapy case manager, therapy case management, therapy Job, therapy Jobs, OT job, OT jobs, O.T. job, O.T. jobs, occupational therapy job, occupational therapy jobs, occupational therapist job, occupational therapist jobs, Oasis, outpatient, outpatient clinic, out patient, outpatient rehab, outpatient OT, outpatient O.T., outpatient therapist, outpatient occupational therapy, outpatient occupational therapist, PRN, PDM, rehab, rehab OT, rehab O.T., rehab occupational therapist, rehab setting, rehabilitative, therapeutic, skilled visit, SNF, subacute, sub acute, post acute, therapy, travel OT, travel O.T., travel therapist, travel occupational therapist, traveling OT, traveling O.T., traveling occupational therapist, rehabilitation services, rehabcare, hospital rehabilitation services, inpatient rehabilitation services, skilled rehabilitation services, IRF, HRS, SRS, RHC, RHB  #MON-HRS  Qualification:  As an Occupational Therapist / OT you will have\\: Degree from an accredited Occupational Therapy program.Minimum of six months occupational therapy experience preferred.Current and unrestricted Occupational Therapy license in the state where services are rendered.Current CPR certification.Strong organizational and communication skills.Ability to work flexible hours and weekends. If you are a current Kindred/RehabCare employee Click Here."}