{"jobID": "2638127852", "jobLocation": "Boston_MA", "jobTitle": "Senior Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.quantumblack.com", "Headquarters": "London, United Kingdom", "Size": "201 to 500 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " QuantumBlack helps companies use data to drive decisions. We combine business experience, expertise in large-scale data analysis and visualization, and advanced software engineering know-how to deliver results. From aerospace to finance to Formula One, we help companies prototype, develop, and deploy bespoke data science and data visualisation solutions to make better decisions. Your Experience You will bring an exceptional academic background in a technical field combined with experience in developing and applying data science methods in an commercial context. You share our curiosity for new methods and technologies, and our enthusiasm for data science challenges. You are able to communicate complex analytics concepts in a clear and concise manner to business leaders. What You'll DoHelp to drive the analytical scope and method for projects, including formulating and shaping the modelsUse Maths, Stats and Machine learning to derive key insights across various industry sectors including formula 1, pharma, automotive and high-tech.Write highly optimised code to advance our internal Data Science toolboxDevelop world-class data science products for clients as well as for our data science teamWork on complex data sets from some of the world’s largest organisationsWork in a multi-disciplinary environment mixing highly skilled people in data science, data engineering and designPerhaps most importantly, you will work in one of the largest and most talented data science teams in LondonBuild strong links with the academic world and constantly share ideas and stay ahead of the curve on the latest methodsRequirementsExperience in statistical modelling and machine learningExperience in applying data science methods to business problemsProgramming experience in at least 2 of the following language: R, Python, Scala, SQLEducated to an MSc or PhD level in the field of Computer Science, Machine Learning, Applied Statistics, MathematicsStrong presentation and communication skills, with a knack for explaining complex analytical concepts to people from other fieldsTeam leadership, mentoring and project management skillsKnowledge of distributed computing or NoSQL technologies is a bonusProven application of advanced analytical and statistical methods in the commercial world"}