{"jobID": "2805059593", "jobLocation": "New_Yor_State", "jobTitle": "Research Intern", "companyRating": null, "companyInfo": {"Website": "www.crigroup.com", "Headquarters": "London, United Kingdom", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Kroll, BSI Group, Control Risks"}, "estimatedSalary": null, "jobDescription": "Research InternPosted: Apr 26, 2018Education: Bachelor’s or Master’s Degree  Discipline: Social Work, Program evaluation, urban studies, public administration, sociology, mass communication or related studies and certification preferred.  Experience: Ideal Candidate must have a knowledge of investigations, research, data evaluation, report writing and production, data analysis. Fresh graduates are encouraged to apply.  Location: UAE  Required Skills: Proficiency in MS Office AutomationExcellent Critical thinking and problem solving skillsStrong written and verbal communication skillsAbility to work with a wide variety of stakeholders and manage multiple deadlines and projectsWillingness to work out of and travel among adjacent locations/cities to meet with potential and current clients and staffs as well as be available to support investigative needs in all jurisdictions as needed Job Description:  Corporate Research and Investigations Limited and its subsidiaries, branches and sister concerns hereinafter called \"CRI Group\" is seeking professionals from diversified background and experience specifically having investigative skills to research and investigates public record and human resources to perform following tasks: Assist in conducting detailed research and provided in-depth analysis of results to serve the interests of each specific client.Effectively managed a workload of 15 to 20 individual cases at a time across Asia and Middle East Jurisdictions.Assist in conducting Physical and site visits to ascertain address verifications as required on case by case basis.Undertake character reputational checks and source inquiries to establish integrity of the subjects in question.Undertake verifications and interviews with previous employments, projects and working relationships subjects in question indicated and/or claimed.Provides a wide-range of data entry services; collects, researches, and interprets information as it relates to fraud investigation cases, integrity due diligence and relevant tasks/assignments; makes available any written instructions or reference materials and provides advice and interpretation.Creates and maintains spreadsheets, databases, and contact lists used by the CRI Group to store and retrieve information used on a regular basis; analyzes criminal investigations.Created in-depth analysis and compiled findings into a comprehensive report that meets client needs.Reviews data and other information to detect patterns which indicate criminal activity; monitors the CRI Group's cases under research and investigations to identify connections, patterns, or links to relevant business crime and civil wrong doings.Assist in Conducting due diligence investigations and in-depth research analysis of corporations and individuals worldwide utilizing various online databases and international contacts. In addition, conducted research for numerous compliance investigations for the diverse industry sectors to include the vetting of key qualifiers, employees, suppliers and vendors."}