{"jobID": "2826703876", "jobLocation": "Boston_MA", "jobTitle": "Sr. Data Scientist", "companyRating": "4.2", "companyInfo": {"Website": "www.pluralsight.com", "Headquarters": "Farmington, UT", "Size": "501 to 1000 employees", "Founded": " 2004", "Type": " Company - Public (PS) ", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " lynda.com, Skillsoft"}, "estimatedSalary": "166000", "jobDescription": " Company DescriptionAbout Pluralsight Founded in 2004 and trusted by Fortune 500 companies, Pluralsight is the technology learning platform organizations and individuals in 150+ countries count on to innovate faster and create progress for the world. Working at Pluralsight At Pluralsight, we believe everyone should have the opportunity to create progress through technology. That everyone should have access to the skills of tomorrow. That technology can make the world a better place. Through the work we do everyday, we empower the people who power our world.  And we dont let fear, egos or drama distract us from our mission. Were adults, and we treat each other that way. We have the autonomy to do our jobs, transparency to eliminate office politics and trust each other to do the right thing. We thrive in an environment with creativity around every corner, challenges that keep us on our toes, and peers who inspire us to be the best we can be. We bring different viewpoints, backgrounds and experiences, and united by our mission, we are one. Job DescriptionThe Opportunity Pluralsight Iris is the learning intelligence platform built within Pluralsight. It helps technologists worldwide discover the learning they need to achieve their personal and career goals in technology.  As a data scientist on our core team, you will help us you will help us solve novel statistical, machine learning, and data science problems by building and improving on the intelligence of Iris. We are looking for an experienced data scientist who loves tackling ambiguous problems, finding creative and practical solutions, and producing concrete prototypes that will become a key part of Pluralsights user experience. Youll work closely with an established team of top-notch, collaborative data scientists and you will collaborate with a cross-functional product team that is responsible for one of Pluralsights key differentiators. Who you are: · You are intellectually curious, collaborative, and highly driven with an entrepreneurial mindset. You have excellent critical thinking, problem solving, and analytical skills.  · You can guide complex projects from ideation and planning to model design to deployment and independently make decisions about the technical approach You have a strong foundation in Machine Learning, Computer Science, and Statistics.You have mastery of either Python or R. Regardless of your favorite scientific computing environment, you can flex between the two languages.You know your way around SQL-like databases (e.g. PostGres, Impala, Hive) and even better if have experience with Spark and other big data platforms.You are able to perform rapid prototyping of experimental solutions, writing readable, scalable, and reproducible code.You have a solid data science toolkit that you can leverage, with knowledge of and understanding of how and when to apply different algorithms and technical approaches.You can describe and speak in an approachable way about complex analyses and concepts within a cross-functional team. You are a great analytic translator.What youll do:You will collaborate with the Iris product teams to research, envision, and create quality reliable data science solutions needed to drive our user experience outcomes.You will create, iterate, and innovate on Iris algorithms and partner to implement them on the Pluralsight platform.Champion the introduction of new technology by developing proof-of-concepts and prototypes and effectively communicating highly complex information to Experience team partnersYou will propose and design experiments to test new product features and analyze their results.You will also serve as a data science expert and consultant to Pluralsights product teams, leveraging your statistical and analytical skills to answer ad hoc questions.QualificationsExperience youll need:M.S. or Ph.D in Computer Science, Statistics, Mathematics, Data Science, or related quantitative disciplineMinimum 5 years in a non-academic data science role, conducting analysis, developing algorithms and building prototypesExperience working with product development teams and/or with developers Additional InformationBe yourself. Pluralsight is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status."}