{"jobID": "2805939893", "jobLocation": "San_Jose_CA", "jobTitle": "Business Data Analyst / Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.experis.com", "Headquarters": "Milwaukee, WI", "Size": "5001 to 10000 employees", "Founded": " 1953", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Robert Half, Adecco, Robert Walters"}, "estimatedSalary": null, "jobDescription": " Experis has an immediate need for a LONG TERM CONTRACT Business Data Analyst / Data Scientist for our IT client in San Jose, CA with the following skills: Description: The Analyst on the Data Analytics team is responsible for analysis, insights, observations and decision support for our business leaders in Finance, Marketing, & Network. As a data analyst/scientist, you'll create reports, visualization charts, and statistical models to identify trends which will improve revenue, profitability and customer experience.  The tools used to perform these advanced analytics functions will vary depending on the nature of the request, but will likely include various statistical packages such as SAS, R, and Python. Data resides across many systems and therefore experience in SQL (Teradata and/or Oracle) is required and Hadoop experience is preferred. Emerging data visualization technologies and experience in Tableau is also beneficial. Responsibilities:Independently manage analytic projects of intermediate to advanced sophistication from design to resolution with minimal oversightLeverage emerging technologies (Big Data/Blockchain) and advanced analytic techniques to create the statistical models required to identify conditions that have the potential to affect customer experienceDesign, develop and implement sophisticated data analytic solutions to ensure the ongoing integrity of our revenue stream and customer experienceDesign and develop standard and ad hoc reporting based on business requirement needsDirect and coordinate the process to extract, normalize, analyze, review and report with respect to data mining efforts related finance operationsIdentify opportunities for revenue recovery and assist in implementationUtilizing business knowledge, financial analysis skills and risk management techniques, champion efforts to effect changes within the business to ensure subscribers are billed correctly.Extract, normalize, analyze, review and report on billing centric data to identify trends and/or anomaliesPartner with cross-functional groups across the enterprise in Finance, Marketing, IT, Network and Supply Chain to assess impact and drive critical issue resolutionExercises sound judgment in developing methods and techniques that requires data analysis and interpretationDirect the identification and use of appropriate analytical technologiesEnsure analytics are captured using dashboard using statistical means, Teradata, and ETL and critical issues are identified and resolved in a timely mannerMUST HAVE SKILLS:6+ years of work experience in a technical position3+ years of experience working with data mining tools (Teradata, SQL, BigData, Data Visualization)3+ years of statistical analysis programming in tools like R, SAS, Python, SPSS required3+ years of relevant wireless industry experience is highly desiredExcellent communication skillsAbility to work independentlyUndergraduate degree is requiredDESIRED SKILLS:Operational experience with data warehouse, billing systems, and wireless networksDemonstrated analytical, quantitative, and proactive thinking; organizational abilitiesDemonstrated wireless and telecommunications billing knowledgeCreativity and flexibility in managing multiple projects and issues simultaneouslyAble to understand, process and effectively plan and execute in a nebulas environmentExperience and success with change management; able to quickly change as requiredDemonstrated ability to effectively work in a large organization in consisting of diverse individuals with varying degrees of talent and technical expertise Candidates must be available to interview and work on-site in the SAN JOSE, CA location.  Please submit your resume in response to this JOB TITLE for IMMEDIATE consideration.  Experis is an Equal Opportunity Employer (EOE/AA)"}