{"jobID": "2731623601", "jobLocation": "Oakland_CA", "jobTitle": "Clinical Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.excitehealthpartners.com", "Headquarters": "Towson, MD", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job ID: 412185  Job Location: Oakland, CA Apply Now! Share  |Clinical Data AnalystOakland, CAWe are Excite Health Partners. We believe in being the best we can be and having fun while doing it. We provide our consultants, across the United States, with the absolute best HIT opportunities and in return our clients exceptional services.  We are an EMR focused company- we strive to help healthcare organization provide the best experience for users and patients alike. We do this by hiring the best HIT professionals to build, analyze, test, train users on and secure technologies that allow providers to store, share and examine health information. Our HIT professionals are a part of something bigger than themselves; they are a driving force allowing hospitals and health systems to meet their goals for security, meaningful use, interoperability, value-based care and more. Qualifications At Excite, we want you to succeed. We want to help you reach your goals and find a satisfying and challenging work environment. For the Clinical Data Analyst position, you should meet the following criteria: Experience with statistical analysis, including application of statistical methodsKnowledge of standard business intelligence tools and ability to construct and interpret SQL statementsExperience with statistical analysis, including application of statistical methodsExperience with enterprise data warehouse structure and source systemsSoarian experience (Clinicals, Financials, and Web Publishing)Experience with Midas Care ManagerStrong verbal and organization communication skillsBachelor’s Degree or related field experienceJoining the Team We are committed to you. To your success, to your career and to you being part of an enthusiastic team. We are proud to offer: Competitive compensationHealth, Vision, Dental plan401k plan with designated company matchWeekly payDirect depositEasy travel and reimbursement"}