{"jobID": "2823638059", "jobLocation": "Kirkland_WA", "jobTitle": "Market Research Intern", "companyRating": "2.9", "companyInfo": {"Website": "www.metia.com", "Headquarters": "Kirkland, WA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "41000", "jobDescription": " Company DescriptionAt Metia we create amazing experiences, ignite conversation, activate communities, inform customers and influence decision makers. We achieve these goals for our clients through a unique mix of marketing consulting, design, and development expertise. Our marketing services include web design and development, content strategy, mobile application development, social media programs, analyst and public relations, and email marketing, throughout our offices in London, Singapore, Austin and Seattle.  Our team has a singular focus: to design and deliver the best marketing solutions in the world. In order to do that, we want to hire the best people in the business.  If you would like to be part of a dynamic, creative, and rewarding environment, Metia is the place for you!Job DescriptionMetia is looking for a Market Research Intern to join the team to ensure the work we deliver is data-driven. We work with leaders in the tech industry on a wide variety of digital projects which span from email to customer evidence programs to web design and development.  The ideal candidate will be able to support the Insights team to tell compelling stories with data, and juggle multiple projects simultaneously to enable successful client delivery.  This is a paid internship ($15 per hour). Hours are flexible and anticipated to be up to 40 hours per week.  Your responsibilities may include: Oversee data collection in the research process (both traditional and social)Data entry and analysisBuild PPT reports based on client specifications and objectivesVendor managementQuality control in client deliveryCommunicate with and support project team membersPrioritization and problem-solvingProject management to ensure deadlines are met as scoped QualificationsTo be successful in this role, key requirements are: Soft skillsDetail-oriented an eye for detail is critical to succeeding in this positionProblem solverAbility to juggle competing priorities and quickly problem solvePassionate about data and the stories it can tellPromotes team work and collaborationHungry to learn and curious about innovationTechnical skillsCommunicates effectively in all modesProficient in Microsoft PowerPoint, use Word, Outlook, and Excel as requiredFamiliarity with social data (and toolsets), data science, statistics, and/or qualitative/quantitative analysis a plus Additional InformationLife at Metia Metia has a down-to-earth and professional approach to marketing and technology that is aligned to a results-oriented work ethic. Our objective is to create and maintain a working atmosphere that is challenging and rewarding.  Initiative is encouraged and rewarded, and there are no constraints to personal achievement. We remain committed to developing and extending our service offerings, and training our staff in anticipation of future industry developments. If you relish change, enjoy new challenges and seek to excel at your profession, this is the environment for you."}