{"jobID": "2830909936", "jobLocation": "Painted_Post_NY", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.nescoresource.com", "Headquarters": "Cleveland, OH", "Size": "1001 to 5000 employees", "Founded": " 1956", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job DescriptionScope of Position: Performs a variety of functions to support the plant operations. Responsible for the data collection, analysis, coordination of key plant programs and daily reporting of key manufacturing metrics. Works with and supports the Plant Operations Manager.Communicates and coordinates completion of key plant initiatives such as 5's, audits, CAPA completion, MOC, and continuous improvement activities. o 5S Schedule creation, results tracking, weekly emails, red tag area, safety audit schedule, linkage with division team for alignment with division 5s program.  o Layered process audits schedule creation, question management, tracking results and reporting.  o MOC (management of change) system facilitator  o Kaizen System facilitator, blitz support Accesses necessary data to monitor performance responsibilities within departments provides support when requiredUses plant systems, such as SharePoint, SPC and plant metricsSupport of plant initiatives to such as Process Control/ Process Discipline to improve operational excellence.Collect and provide basic analysis of data.Keep coordinators, supervisors, and operators informed of any changes or issuesHours:Typical first shift production hours, M-F, 40+ hr.Will require occasional off shift support of productionQualifications / Requirements: 2-year technical degree - preferred  Excellent organizational skills.  Understand technical details and impacts of the process and requirements for successful performance, quality, and delivery  Strong written and oral communication skills  Follow-up and documentation skills a must.  Good problem-solving skills  Microsoft Office: Outlook (email), Excel, Word proficiency  Team player, ability to work with all payrolls"}