{"jobID": "2807670650", "jobLocation": "New_York_NY", "jobTitle": "Associate Director - Digital Media Planning - NYC", "companyRating": "3.3", "companyInfo": {"Website": "www.tmp.com", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Jibe, Phenom People, SmashFly Technologies"}, "estimatedSalary": "84000", "jobDescription": " The Associate Director Digital Media works directly and autonomously with account management and clients to provide the strategic direction of client media campaigns. This role will be responsible for developing successful media strategies from intake to analysis. Partnering with digital analysts to ensure continuous insightsand optimizations to meet campaign goals. The ideal candidate will be able to present to account teams and clients, analyze and simplify complex data for insights, contribute to the career growth of team members and identify and negotiate with media vendors. Additionally, there needs to be a constant curiosity to stay ahead of a changing and complex marketplace, and an understanding of how these changes will impact client objectives. What does a great Associate Director, Digital Media do?Work directly with clients and account teams to understand overall objectives and how they relate to a clients media/web/social/mobile presenceUse this client knowledge to build integrated media plans that achieve client goalsAnalyze the results and make optimization recommendations while the media is live and use empirical data to improve results for the next buying cycleWrite customized analysis including online media, search engine campaigns, social metrics, mobile metrics, and web analytics that highlight campaign strengths and weaknesses and provide actionable insights on campaign performanceTell the full media story of the campaign lifecycle from inception through optimization to results, and do so in a client-facing, consultative mannerLead support team members to drive clients media/web/social/mobile objectivesEvaluate new advertising opportunitiesWork closely with media to negotiate packages to offer the best value to clientsManage multiple projects and clients at any given timePresent complex concepts and metrics in a user-friendly wayRequirements for Consideration5-7 years (combined) experience with online media planning and web/media analytics and reportingExperience using comScore and 3rd party ad serving technology (i.e., DoubleClick)Google Analytics certification or equivalent experienceKnowledge programmatic media and social metrics (i.e., Facebook & YouTube insights)Critical thinker who can present complex concepts, media recommendations and data results in a clear and effective mannerAbility to work with MS Office product suite including exceptional PowerPoint and Excel skills, Access a plusThe ability to manage multiple priorities in an ever-changing environment and meet tight deadlinesBe a self-starter who can work independently as well as part of a teamStrong written and verbal communication, organization, negotiation and troubleshooting skillsAvailability to travel up to 10% of the time Join the global leader in talent acquisition technologies thats committed to finding new ways to leverage software, strategy and creative to enhance our clients employer brands across every connection point. Were looking for unconventional thinkers. Relentless collaborators. And ferocious innovators. Talented individuals who are ready to work towards solutions that transform the way employers and job seekers connect. We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.#GDMetrics"}