{"jobID": "2722590748", "jobLocation": "Hayward_CA", "jobTitle": "Teller - PT", "companyRating": null, "companyInfo": {"Website": "www.providentcu.org", "Headquarters": "Redwood City, CA", "Size": "201 to 500 employees", "Founded": " 1950", "Type": " Nonprofit Organization", "Industry": " Finance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Patelco Credit Union, Golden 1 Credit Union, San Mateo Credit Union"}, "estimatedSalary": null, "jobDescription": "If you are a people person who loves to help others and has an eye on a career that pivots around making a difference in the lives of others, then check out our Member Service Representative/ Teller position in our Hayward branch. More about the Position: Here at Provident our Tellers are called Member Service Representatives (MSR's). Our MSRs handle cash, interact with members and seize every opportunity they can to sell Provident and the great products and services we offer to help our membership manage their finances successfully. You’ll also be working towards your professional goals while helping members reach their financial goals. This position opens the door to a variety of future career possibilities with Provident. It is also an ideal way to get into an entry level retail sales position. Provident could be the perfect fit for you! Desired Hours: Monday - 12:00pm - 5:30pm  Tuesday and Thursday - 11:30am – 5:30pm  Friday - 12:30pm – 6:30pm  Saturday – 9:00am – 4:30pm Here’s a breakdown of the day-to-day functions:Assist members with their transactions.Recognize member needs and make referrals that may be of benefit to them.Give your best every day to provide top-notch service. (Sure, this is a given – but we like saying it anyway.)The benefits of this position:The chance to be immersed in a family-type environment that thrives on helping our members – and each other – succeed.What you’ll bring to the position:Great energy and the ability to execute to our procedures.The desire and ability to learn new things.Good computer skills – partcularly a plus if you’re familiar with Microsoft Word and Excel. Get to know our members and our culture while discovering new challenges in a rewarding atmosphere that helps you grow professionally. Provident is an Equal Opportunity Employer We are a winner of the Bay Area News Group Top Workplace in 2017. Check us out on Glassdoor"}