{"jobID": "2815748880", "jobLocation": "Stanford_CA", "jobTitle": "Senior Data Analyst", "companyRating": "4.2", "companyInfo": {"Website": "www.stanford.edu", "Headquarters": "Stanford, CA", "Size": "10000+ employees", "Founded": " 1891", "Type": " College / University", "Industry": " Education", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "93000", "jobDescription": "79398The College Transition Collaborative (CTC), based out of the Department of Psychology at Stanford University, aims to create higher education learning environments that foster equitable student outcomes by bridging research and practice. CTC partners with colleges and universities to develop scientifically proven approaches that place the student experience at the center of institutional programs and practices. Our work helps institutions better understand how their students experience moments of transition or difficulty, and how psychologically-informed practices can convey to all students they are valued, respected, and can excel. CTC’s work has helped support greater engagement, retention, and completion for students at diverse colleges and universities across the United States, particularly for traditionally marginalized groups such as students of color, first-generation students, and low-income students. To learn more, please visit our website at http://collegetransitioncollaborative.org.  We are seeking a Senior Data Analyst to lead data processing and analysis for multiple ongoing large-scale randomized controlled experiments. The Analyst will oversee all stages of the data pipeline, from standardizing disparate raw data sources (e.g., survey data, institution provided data, etc.) containing millions of records to conducting complex analyses for both scientific and practitioner audiences. This individual will be an essential project member who will be expected to learn and work independently, yet collaborate effectively with team members and project partners. Previous experience processing data and conducting analyses for empirical research projects, particularly projects with a focus on social psychology or education, in an academic environment is a plus. The work will take place in a dynamic environment where specifications often change rapidly in response to demands from both researchers and practitioners, so the analyst must be able to be flexible in their approach and implementations.  Additional details about the responsibilities:  1. Processing and managing data Implement processes to collect, process, and manage raw data from diverse sources (e.g., complex surveys, institutional records from multiple sources and timepoints), producing clean and user-friendly datasets for both internal analysis needs and sharing with affiliates and collaborators.Create clear, standard data requests in collaboration with researchers and fellow CTC staff to share with school partners based on project research questions; work closely with fellow CTC staff and data teams at partner institutions to validate accuracy and usability of data shared, including training CTC staff to understand data request specifications and to perform relevant checks.Advise on and implement data storage and security practices. 2. Analyzing data Collaborate with researchers and fellow CTC staff to determine analytic approach for projects in light of key research questions, modifying approach as necessary given nuances of data that are available (e.g., limitations in institution-provided data, etc.), and to pre-register analysis plans when appropriate.Use both qualitative and quantitative techniques to lead data analysis for all stages of CTC’s research projects, including both earlier stage research and development such as surveys, focus groups, and smaller scale experiments, and later stage large-scale field tests such as randomized controlled trials. Analytic techniques may include but are not limited to: multilevel models, OLS models, structural equation models, clustering techniques, and specification curves/permutation tests.Serve as a resource for non-routine analysis inquiries. 3. Reporting results Work under consultative or self-initiated direction to report analysis findings for researchers, school partners, and external audiences.Develop processes and write/modify reproducible scripts to automate custom report generation.Write concise, focused prose interpretation of analysis findings for diverse internal and external audiences, varying the language used and level of detail depending on audience background and interests.Distribute and disseminate reports to applicable agencies, researchers, management and other internal end-users. CTC is an early-stage organization, and we are excited to build out our data processes and team over the coming years. This role includes the opportunity to drive decision-making around our data policies and infrastructure in addition to conducting data processing and analyses for discrete large-scale projects.  To be considered for this position, you must fill out this form: https://goo.gl/forms/qiowL5fh1G6CJUsG3 Core Duties:Work under consultative or self-initiated direction to assess and produce relevant, standard, or custom information (reports, charts, graphs and tables) from structured data sources by querying data repositories and generating the associated information. Distribute and disseminate reports to applicable agencies, researchers, management and other internal end-users.Devise methods for identifying data patterns, trends in available information sources using a variety of qualitative and quantitative techniques. Determine and recommend additional data collection and reporting requirements.Create non-routine databases and their related information summary; develop algorithms and statistical model; and perform statistical analyses appropriate to complex data and reporting requirements. * - Other duties may also be assignedMINIMUM REQUIREMENTS: Education & Experience:  Bachelor's degree and three years of relevant experience or combination of education and relevant experience. Experience in a quantitative discipline such as economics, finance, statistics or engineering.  Knowledge, Skills and Abilities: In-depth knowledge and experience using and applying analytical software, database management system software, database reporting software, database user interface and query software, and data mining software.Expert ability to collect data using a variety of methods, such as data mining and hardcopy or electronic documentation study, to improve or expand databases.Basic statistical ability.Strong listening, verbal and written communication skills.Ability to manage multiple activities in a deadline-oriented environment; highly organized, flexible and rigorous attention to detail.Ability to use logic to calculate data; efficiently construct a database or scrutinize the form of a question.Ability to work with data of varying levels of quality and validity.Demonstrated ability to produce data in a clear and understandable manner meeting user requirements.Ability to work effectively with multiple internal and external customers.Ability to take a leadership role on projects and with users/clients. Preferred Knowledge, Skills, and Abilities: Substantial experience in at least one statistical programming language allowing for reproducible, automated analysis and reporting; e.g., R, Stata, Python.Substantial experience with advanced statistical methods used in social science research to assess the impact of multi-site experiments controlling for relevant covariates, including conducting exploratory analyses to determine optimal modeling approaches; conducting complex analyses such as multilevel modeling; understanding and addressing problems such as model fit issues and/or problematic statistics that may indicate errors in the underlying data; and advising team members on best practices around data collection, management, analysis, and reporting.Experience and comfort managing complex raw data from disparate sources.Comfort with early-stage and academic work environments.Strong analytical skills.Ability to prioritize workload across multiple projects, create realistic timelines for analytic workstreams, and communicate regular updates to team. Certificates and Licenses Required:  None  Physical Requirements: Constantly perform desk-based computer tasks.Frequently sit, sort, file paperwork or parts, grasp lightly, and use fine manipulation, lift, carry, push and pull objects that weigh 10 pounds or less.Occasionally write by hand, twist, bend, stoop and squat.Rarely stand, walk, reach or work above shoulders and use a telephone. * - Consistent with its obligations under the law, the University will provide reasonable accommodation to any employee with a disability who requires accommodation to perform the essential functions of the job.  Working Conditions:  May work extended hours during peak business cycles.  Work Standards: Interpersonal Skills: Demonstrates the ability to work well with Stanford colleagues and clients and with external organizations.Promote Culture of Safety: Demonstrates commitment to personal responsibility and value for safety; communicates safety concerns; uses and promotes safe behaviors based on training and lessons learned.Subject to and expected to comply with all applicable University policies and procedures, including but not limited to the personnel policies and other policies found in the University’s Administrative Guide, http://adminguide.stanford.edu."}