{"jobID": "2830590200", "jobLocation": "Waltham_MA", "jobTitle": "Sales Representative", "companyRating": null, "companyInfo": {"Website": "www.conwayoffice.com", "Headquarters": "Nashua, NH", "Size": "201 to 500 employees", "Founded": " 1976", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " SymQuest, Ricoh"}, "estimatedSalary": null, "jobDescription": " Position: Sales Representative  Location: Waltham, MA  Conway Office Solutions, a XEROX company, has been a leader in providing document workflow and related office technology to companies throughout New England for more than 40 years. Our partnership with XEROX combines our strength and experience in local markets with the support of a multi-national organization and world leader in document workflow solutions.  Conway's company culture is one of a team-oriented environment that fosters individual growth, development, and career advancement.  We do not fill empty seats...we hire and develop Future Leaders!  Due to continual growth, we have need for a Sales Representative to work out of our Waltham location. You will be responsible for business to business sales of Xerox hardware and software solutions in an assigned local territory. The selected individual will be responsible for prospecting, cold calling, and developing new accounts as well as working with current customers.  Benefits: Competitive Base PayUnlimited Commission PotentialMedical/Dental/Vision Insurance75% Company Matched 401KTuition Assistance9 Paid HolidaysPaid Time OffMuch More Training: Every new Sales Representative will complete a structured, all-expense paid, 12-week training program that is geared toward sales skills, database management; customer focused selling, software and product application skills and certifications.Programs are taught by our local Corporate Sales Trainer as well as certified employees and industry experts.You also have access to the extensive training resources of Xerox and our sister companies located throughout the U.S. Atmosphere:  Conway offers an outstanding team oriented culture of supporting all staff members to grow professionally and reach their career goals.  Growth Potential Most of Conway's managerial and executive positions are held by individuals who joined the company at the entry level. With over 500 sister offices nationwide, the potential for individual growth is unlimited.  Requirements:  One to four years sales experience or a college degree or equivalent working/education experience is preferred. However, we encourage recent college grads seeking an entry level sales position to apply.  Conway is proud to be an Equal Opportunity Employer M/F/Disabled/Veteran  Applicants must be authorized to work in the United States and must pass a background/motor vehicle check and a drug screen.  Sales Representative0"}