{"jobID": "2811524901", "jobLocation": "San_Mateo_CA", "jobTitle": "Customer Success Director", "companyRating": "4.1", "companyInfo": {"Website": "www.everstring.com", "Headquarters": "San Mateo, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "185000", "jobDescription": "The Role EverString is looking for strategic, action-oriented, and results-driven Customer Success Director. The Customer Success Director is ultimately responsible for ensuring the post-sales optimization of EverString customers experience & results. As a Customer Success Director, you will be responsible for driving customer adoption and success for high-value enterprise customers. Your focus will be to make every customer in your portfolio a qualified promoter, resulting in long-term loyalty to EverString.  This is a terrific opportunity to help shape the programs that drive success for customers in a rapidly growing, aggressive series B company. Along with early-stage stock options, we offer a competitive compensation and a comprehensive benefits package. Also included are daily perks (like a fully stocked kitchen) above & beyond your typical SaaS company. Drive Customer Success and Retention Responsible for finding solutions to customer inquiries and delivering customer valueManage post-sales activities for Enterprise customers through building relationships, product knowledge, requirements gathering and project execution.Educate customers on the unique value props generated from the EverString Audience Platform, customized to their specific business needs & pain pointsEstablish a framework for managing projects and delivering solutions through the EverString Audience Platform for Enterprise customersDefine deployment and success strategies for your portfolio of customers, based on knowledge of their business objectives/goalsStrategically consult with customers on relevant use cases, to maximize adoption and value of the solutionWork collaboratively and cross-functionally with internal team members to deliver on customer requirementsEnsure any account issues are resolved quickly, leveraging resources from across the company as neededGather customer product feedback and communicate with product management to shape product roadmap developmentIdentify and qualify cross-sell & up-sell opportunities, leveraging sales resources to grow account relationshipsEnsure customers solution remains optimized for maximum value throughout their life-cycle, in order to make renewals a foregone conclusionRequirements:5+ years of customer success/account management/professional services experience with Enterprise businesses, preferably in SaaS business environmentStrong customer relationship and collaboration experience, capable of engaging at multiple layers within an organizationHighly dependable, self-starter, high energy, positive attitude with good organization and time management skillsTeam player who will innovate to continue improving the way EverString serves its customerDemonstrated ability to grow the relationships and expand the platform footprint within the customer organizationExcellent written and verbal communication skillsBachelors degree or equivalent experience"}