{"jobID": "2831052925", "jobLocation": "Wakefield_MA", "jobTitle": "Fall 2018 Finance Intern", "companyRating": null, "companyInfo": {"Website": "www.virtualmgmt.com", "Headquarters": "Wakefield, MA", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Finance Intern Are you a college student that's studying accounting and finance and looking to get some real-world experience? Are you looking to fill your resume, and learn how your studies are actually practiced in a real-life company? Are you looking to meet people who have your future job and get paid for it? This exciting opportunity is for a college student looking to get a jumpstart on their career within a growing corporation. At Virtual, our Internship Program is unique in that we encourage all of our interns to have a voice in the company and to learn and grow during your time with us through shadowing oppurtunities and taking part in cross-functional projects. You'll also get a chance to sit down with senior executives, learn about their background and dig a little deeper into how they got where they are today while they share advice on things that helped them along the way.  As our Finance Intern, you will be joining and working for a team of people in your field. This will give you opportunities to network, learn, and explore the world of Finance and Accounting to find your business niche.  You will also be joining a whole group of college interns just like you. A DAY IN THE LIFE OF A VIRTUALITE:Assisting the Financial Analysts with financial reporting and analysisAd-hoc reportingData entry and analysisBank ReconciliationsFinancial Audit supportOffice FilingBe the face of the company while assisting the office manager with front desk coverage and be a line of contact for incoming callsShow off your rockstar multi-tasking abilities by taking on different projects and tasks as neededDO YOU HAVE WHAT IT TAKES?Finance or Accounting major entering sophomore or junior year;GPA 3.5 or higher;Excellent Excel and Word skills;QuickBooks and PowerPoint experience a plus;This position requires a significant amount of data entry (primarily using Quickbooks); speed and accuracy are absolutely necessary.Must be a team player, dedicated, able to multi-task and prioritize with minimal supervision, self-motivated; and,Must exercise attention to detail.Must be currently enrolled in college throughout entire internship period.PERKS:Serves as a great resume builder that can set you apart in such a competitive field where degrees are not enoughThe fun culture and business casual attitude of the company allows for an easy transition from classroom to office and is a great fit for young people being introduced to the business worldGreat for networking with like-minded people working in your field and doing the things you hope to do in the future, and allows you to shadow other departments you may be interested in to help you find your business nicheAllows the chance to rub elbows with hugely successful global companiesBelieve it or not, you can even get paid for fun outings, such as the tenant summer barbeque in the parking lot, full day summer outing, hump day celebrations, mini-golf, laser tag, complimentary in-office massages, and MUCH MORE all curtesy of the Fun Committee (who knew such a thing even existed)!And of course we cannot forget FREE coffee, candy, and snacks during every work day!ABOUT VIRTUAL INC. Have you ever wondered how your credit cards remain secure in this ever-changing world of hackers and fraud? Have you ever thought about how the technology behind games like Pokemon-GO came to be? How about the technology that makes it possible to use your fingerprint instead of a password? Or the initiatives behind the group of pioneers responsible for taking the internet to the most remote areas of the world? These are only a few examples of the innovative accomplishments we've helped our clients achieve. Pretty cool stuff, huh?  We understand that no global movement starts with just one person and that's why our employees are really Virtual's most valuable asset and at the heart of our success. It takes an entire team to fulfill our mission of attaining long-term success by ensuring that every client that we serve achieves or exceeds its strategic objectives.  Virtual Inc. is an Equal Opportunity Employer. If this sounds like the job for you, we'd love to hear it and make it happen."}