{"jobID": "2735255573", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.rallyhealth.com", "Headquarters": "Washington, DC", "Size": "201 to 500 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "168000", "jobDescription": " Data Scientist  Rally Health is seeking a Data Scientist to work closely with our product teams to improve our products and grow our business through analytics and development of data strategies.  Rally products inform users about their healthcare options and help engage them in their own healthcare. In this role, the Data Scientist will work with product teams to investigate user behavior and develop data strategies (e.g., personalized recommendations) to improve product performance and ultimately health outcomes. This involves leveraging data to measure and improve our offerings through metric development and instrumentation, data investigations, designing and interpreting experiments, exploratory research, and impact evaluation.  We are able to bring together a rich set of relevant data to do this work including lifestyle and health status information from responses to our health assessment survey; engagement and activity data from our Wellness product; intent data from search activity on our provider search product; and direct health information including biometrics and medical and pharmaceutical claims. The Data Scientist will work in close coordination with the product team, applying this data to generate insights and develop data strategies that help our products evolve to better serve our customers and users. Skills:Ability to proactively identifying opportunities and solving challenging business problems with a variety of data tools in a fast-paced, collaborative environment.Ability to use predictive analytics and classical modeling techniques for statistical inference and creation of data insights.Ability to work in a variety of data environments, e.g., Hadoop HDFS, SQL, Mongo, etc.Strong proficiency in SQL and some scripting language (Python, R, etc.)Strong focus on quality, using/developing process that ensures the integrity of our analytic outputExperience:Graduate of Data Science program or several years technical analytical experience using data science toolsHistory of successfully driving analytic projects and investigations to produce measurable results.Familiarity with data-driven product development (A/B testing, time series analysis, propensity modeling, etc.); you tailor your approach to the problem rather than trying to apply the same techniques everywhere.Experience solving business challenges with data using scripting languages (such as Python or R) and SQLNice to Have:Healthcare or wellness specific business knowledge and/or experience with behavioral and claims dataExperience using ML to solve business problemsExperience in a big data environments, like Hadoop or SparkAdvanced (post-baccalaureate) degree in a quantitative fieldAbout Rally Health: Our benefits package is highly competitive with others in tech, offering great options that attend to your physical, emotional, financial and career health. We have low deductible, modest employee contribution health care options through UnitedHealth, and an option for a higher deductible plan accompanied by an HSA that Rally pays for. We have vision and dental care, disability income protection, FSA, and life insurance benefits that extend to you and your dependents. We serve catered lunch each day and stock the kitchen with snacks for those of us who need to be reminded to eat. And, of course, we grant to our employees access to the Rally Engage app that offers challenges and incentives to keep us well. On the emotional well-being side of things, we know that people who work as hard as Rallyers need to catch their breath. So, we offer PTO-with-trust; meaning, you take it when you need it and we don't add up how much you've used. For those that need a little extra care, we are partnering with Ginger.io to make employee support accessible via text. Financially, we offer competitive cash compensation and equity, 401k matching, and surprise bonuses to those who surprise us with their contributions. And, perhaps most importantly, we offer a company with a purpose, jobs that demand your very best work, and opportunities to learn, grow, and build your career.  Rally Health is committed to ensuring that its workforce reflects America’s diverse population. Rally Health knows that such diversity will enrich us with the talent, energy, perspective and inspiration it needs to achieve its mission. Rally Health believes in a policy of equal employment and opportunity for all people based on merit and commitment to the principles of diversity. It is our policy to recruit, hire, train, and promote individuals in all job titles, and administer all programs, without regard to race, color, religion, national origin or ancestry, citizenship, sex, age, marital status, pregnancy, childbirth or related medical conditions, personal appearance, sexual orientation, gender identity or expression, family responsibilities, genetic information, disability, matriculation, political affiliation, veteran status, union affiliation, or any other category protected by applicable federal, state or local laws.  Individuals with disabilities and veterans are encouraged to apply. Applicants who require an accommodation related to the application and/or review process should notify our recruiting team (recruiting@rallyhealth.com).  Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records."}