{"jobID": "2645521597", "jobLocation": "San_Jose_CA", "jobTitle": "Nuclear Operations", "companyRating": null, "companyInfo": {"Website": "www.navy.com", "Headquarters": "San Diego, CA", "Size": "1001 to 5000 employees", "Founded": " 1775", "Type": " Government", "Industry": " Government", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " \"Submarines and aircraft carriers the most imposing vessels in Americas Navy rely on nuclear reactors as well as nuclear technicians, power plant operators and subsystems specialists to keep them running. These highly trained, hands-on professionals perform the complex technical functions that are at the core of sub and carrier capabilities.This involves everything from operating nuclear propulsion plant machinery to controlling auxiliary equipment that supports Naval reactors to maintaining various electronic, propulsion and weapons systems.Responsibilities in the Navy Nuclear operations area depend upon the job rating or specialty you are in.________________________________________Machinist Mate (MM)MMs operate and maintain steam turbines and reduction gears used for ship propulsion and auxiliary machinery such as turbogenerators, pumps and oil purifiers. They also maintain auxiliary machinery outside of main machinery spaces, such as electrohydraulic steering engines and elevators, refrigeration plants, air conditioning systems and desalinization plants. They may also operate and maintain compressed gas producing plants. Nuclear-trained MMs perform duties in nuclear propulsion plants operating reactor control, propulsion and power generation systems.Electricians Mate (EM)EMs are responsible for the operation of a ship's electrical power generation systems, lighting systems, electrical equipment and electrical appliances. The duties include installation, operation, adjustment, routine maintenance, inspection, test and repair of electrical equipment. EM's also perform maintenance and repair of related electronic equipment. Nuclear-trained EMs perform duties in nuclear propulsion plants operating reactor control, propulsion and power generation systems.Electronics Technicians (ET)ETs are responsible for electronic equipment used to send and receive messages, computer information systems, long range radar, and calibration of test equipment. They maintain, repair, calibrate, tune, and adjust electronic equipment used for communications, detection and tracking, recognition and identification and navigation. Nuclear-trained ETs perform duties in nuclear propulsion plants operating reactor control, propulsion and power generation systems.\""}