{"jobID": "2739647080", "jobLocation": "Marin_City_CA", "jobTitle": "Grief Counselor, Community, per diem", "companyRating": null, "companyInfo": {"Website": "www.hospicebythebay.org", "Headquarters": "Larkspur, CA", "Size": "201 to 500 employees", "Founded": " 1975", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Pathways Home Health and Hospice, Sutter Care at Home, VITAS Healthcare"}, "estimatedSalary": null, "jobDescription": "Hospice by the Bay is currently seeking a per diem Community Grief Counselor in Marin and Sonoma Counties. This person will provide individual counseling services and facilitate groups for community counseling youth and adult clients coping with issues of grief and loss in compliance with organization policies and procedures and applicable laws and regulations. Essential Duties & Responsibilities Include(but are not limited to):Provide grief counseling services to community members including outreach, assessment, treatment planning, intervention, education and referral.Facilitate grief support groups.Set appropriate fee for services; collect and process payment for services in compliance with organization policies and procedures.Screen potential group members for appropriateness for a support group. Make appropriate referrals for those not ready for a group.Evaluate and assess grief needs and risk assessments associated with grief and develop bereavement plan of care including treatment goal and frequency of services.Promptly inform Bereavement Services Manager of unusual or potentially problematic patient/family issues.Education/Experience:Masters degree in the area of mental health from an accredited university, Must be licensed as an MFT and have experience in Grief CounselingClinical licensure with the CA Board of Behavioral ScienceDemonstrated ability to effectively work with community clients coping with life-threatening illness and grief-related issuesCurrent California Driver’s License and automobile insurance that meets State of California requirements, if driving a car."}