{"jobID": "2830382734", "jobLocation": "Seattle_WA", "jobTitle": "Data Analyst", "companyRating": "4.4", "companyInfo": {"Website": "www.teleionconsulting.com", "Headquarters": "Seattle, WA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "62000", "jobDescription": " This position will be responsible for delivering and supporting solutions for Lease Accounting via IBM Tririga. As a Corporate Reporting Systems Analyst, you will identify, design, and deploy technology and process solutions for the implementation and global rollout of our lease accounting platform. Additional responsibilities include supporting strategic objectives for lease accounting, driving functional optimization of the application in support of our monthly close process and ensuring application controls are designed and operating effectively to support our internal controls over financial reporting.  This role requires proficiency in the analysis of system requirements, solution design, system configuration, end user support and ongoing maintenance. In addition to delivering new technology and enhancing/supporting existing systems, an effective Systems Analyst will be expected to contribute relevant technical, functional, and process expertise, negotiate and drive alignment for related financial systems projects and initiatives which impact lease accounting.  We are currently looking for individual contributor candidates who have held similar positions in large public companies or who have held functional analyst/consultant level positions with a consulting firm for 2 or more years. Successful candidates for this position will have the equivalent of 3+ years of general professional experience (including broad financial reporting systems and process implementation experience). Demonstrated experience in providing leadership to accomplish unusually complex challenges will be expected as this is an ongoing requirement for this position.BASIC QUALIFICATIONS"}