{"jobID": "2811702524", "jobLocation": "Cambridge_MA", "jobTitle": "Data Scientist II – Bioinformatics Developer", "companyRating": "3.8", "companyInfo": {"Website": "www.abbvie.com", "Headquarters": "North Chicago, IL", "Size": "10000+ employees", "Founded": " 2013", "Type": " Company - Public (ABBV) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amgen, Baxter, Bristol-Myers Squibb"}, "estimatedSalary": "114000", "jobDescription": "The Scientific Informatics group at the AbbVie Cambridge Research Center supports R&D; activities focusing on neuroscience and immunology. Our team is tasked with shaping and executing scientific data/knowledge acquisition, management and analysis in the support of discovery and development programs. We are looking for a skilled and dedicated individual to partner with the community of computational biologists and research scientists to further these goals. The candidate will collaborate with scientists and developers to identify, design, build and maintain tools and analytical workflows to streamline and strengthen the therapeutic discovery pipeline. With a special focus on operationalizing bioinformatics pipelines, multi-omics data management and visualization, we are looking for a candidate with bioinformatics / computational biology experience as well as a passion for software development. A successful candidate will be someone who enjoys applying new and emerging analytical methods and visualization technologies on real world data for the purposes of building solutions that serve both technical and scientific audiences. Key ResponsibilitiesCollaborate with local informatics and research scientists to identify and understand their analytical and informatics needs and translate these into solutions.Independently design and develop business technology solutions to answer scientific or business questions through the integration, visualization, and analysis of data. Demonstrate proficiency across a range of technologies related to the storage, transfer, integration, visualization, and analysis of large and complex data sets.Understand the broad objectives of the project as well as his/her role in achieving those objectives, and modify approach when required.Learn, understand and master new methods and technologies, and act as a resource or mentor for others.Demonstrate knowledge of the pharmaceutical and healthcare business, and utilize this knowledge in the rapid advancement of agile, impactful, and cost-effective solutionsEffectively organize and present project objectives and progress. Contribute to technical publications and presentations.Understand and adhere to corporate standards regarding applicable Corporate and Divisional Policies, including code of conduct, safety, GxP compliance, and data security.Communicate and collaborate effectively with colleagues in varied scientific and technical roles.Be equally comfortable working independently and within a team depending on project needs.Present projects and systems in front of both scientific and technical audiences.Bachelor’s Degree or equivalent education and typically 7 years of experience, Master’s Degree or equivalent education and typically 5 years of experience. Background in life sciences or work experience in the pharmaceutical industry preferred.Experience and/or education in bioinformatics / computational biology as well as software engineering.Proficiency in R and Python for both data analysis and software engineering, especially for the development of web applications (Shiny, Flask/Django, etc).Experience with relational (SQL) and document (NoSQL) database design, data modelling and data warehousing would be preferred.Ability to multitask and work within timelines.Demonstrated ability to learn, understand and master new technologies.Strong written and oral English communication skills.Equal Opportunity Employer Minorities/Women/Veterans/Disabled"}