{"jobID": "2582214294", "jobLocation": "New_York_NY", "jobTitle": "Dir. of Inpatient Service", "companyRating": null, "companyInfo": {"Website": "www.pagny.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OverviewIn partnership with NYC Health + Hospitals, NYC Health + Hospitals/Metropolitan provides care for over 313,000 outpatient visits, nearly 70,000 emergency room visits and more than 13,000 inpatient admissions annually. The hospital maintains an academic affiliation with New York Medical College.ResponsibilitiesUnder the direction of the Chief of the department, direct, oversee, manage and evaluate all aspects of clinical services and medical education provided by members of the Division to deliver accredited medical services that meet all medical standards required by law. Full range of administrative/operational responsibilities to ensure the efficient achievement of departmental goals. Responsibilities:Foster the academic development of the Division membersParticipate with the Hospital in the development and implementation of mechanisms and measures to optimize the appropriate utilization of medical services, quality assurance and patient satisfaction at the HospitalParticipate in other related responsibilities as assigned by the Employer, the Executive Director and/or the Medical Director of the HospitalPlans joint programs and procedures with other departments for coordinating services with other patient care servicesWith the Chairman, establishes services capital equipment needs and capital equipment purchasing planEvaluates equipment proposals for the Chairman of the departmentParticipates in the Department's Quality Assessment and Improvement CommitteeActs as direct supervisor and consultant for all staff assigned to ServicesKnowledge of Patient Safety requirementsParticipates in medical educational meetings to improve and provide continuous quality care to our patientsDetermines the qualifications and competence of department personnel who perform medical/surgical ServicesEstablishes mechanisms for orientating and providing in-service training and continuing education for all persons in DivisionRecommends space and other resources needed by the Division in order to maintain a satisfactory level of careEssential Responsibilities:Prepare division staff schedulesReview, approve/deny and sign off on leave of absence requests, including CMEReview, Approve/deny and sign off on time sheers and session sheetsPrepare monitor and follow up on division performance indicatorsPrepare strategic planning for the DivisionPrepare monthly schedules for teaching of students and residentsQualificationsABMS BC/BE in PsychiatryNYS license in good standingBoard Certified EOE M/F/D/V"}