{"jobID": "2817198413", "jobLocation": "San_Jose_CA", "jobTitle": "Outside Sales Account Executive", "companyRating": null, "companyInfo": {"Website": "www.primepay.com", "Headquarters": "West Chester, PA", "Size": "501 to 1000 employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Do you have a passion for building relationships and an entrepreneurial spirit that drives you to succeed? Then we want you!  At PrimePay, we believe in the power of small business. We take care of back office tasks like payroll so they can concentrate more on their business.  We are searching for our next outside sales executive who will be responsible for developing new relationships with those small business owners, as well as health benefits brokers and CPAs.  New to payroll and HR services? Our award-winning training program has your back! We’ll teach you the things you need to know and coach you to lead meetings with clients to successfully identify their needs.  If time management, organization, and a goal-oriented mindset are skills that describe you, we encourage you to keep reading to learn more about this opportunity. Here are some things you can expect from working at PrimePay:A competitive base salary, un-capped commission, performance-based bonuses and a car allowanceOpportunities for advancement within the organizationAccess to state-of-the-art personal and group training programsLeadership development through individualized support and career mentoringA typical day for our sales executives include:Networking in-person and over the phone with key decision makers in a designated territoryDeveloping and executing a sales call strategyUtilization of social media for finding new and developing existing relationshipsMaintaining existing and prospective client relationshipsRepresenting products to prospective clients in an easy-to-understand mannerHave these qualities? You’ll fit right in.Commitment to excellent service and customer satisfactionSelf-motivationHigh energySuperior levels of honesty and integrityThese qualifications are a big plus, but not required:2 or more years of experience selling business services and supporting clients through the sales processB2B sales leadership backgroundExperience working leads in a territoryA proven track record of attaining challenging sales goals and managing accounts with a designated territoryBA/BS degreeSalesforce knowledgeNow that we know about you, here is a little about us: PrimePay is an employee management solutions provider offering a full range of payroll and HR support services. We take care of the tasks that come with having employees so small business owners can get back to what they love – their business.  PrimePay is a privately-owned national company, serving all 50 states from over 30 office locations. We offer medical, dental and vision insurance, 401(k) with matching, paid time off, paid holidays, life insurance and STD/LTD."}