{"jobID": "2745377400", "jobLocation": "Los_Angeles_CA", "jobTitle": "Middle School Math/Science Teacher", "companyRating": "3.7", "companyInfo": {"Website": "www.aspirepublicschools.org", "Headquarters": "Oakland, CA", "Size": "1001 to 5000 employees", "Founded": " 1998", "Type": " School / School District", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " KIPP Foundation, Rocketship Public Schools"}, "estimatedSalary": "58000", "jobDescription": "About Aspire:Aspire Public Schools operates 40 high-performing, college-preparatory public charter schools serving 16,000 students in underserved communities across California and in Memphis, Tennessee. Founded in 1998, Aspire is one of the nation’s largest open-enrollment public charter school systems serving predominantly low-income students, and delivering a rigorous College for Certain education to students in grades K-12.Our promise at Aspire Public Schools is that every child receives a high-quality education to prepare them for success in college, career and life. Every day, our community of students, parents, teachers and staff come together to learn and grow so that every child’s aspirations are within reach.The Opportunity:Behind every successful student is a team of passionate and dedicated educators. As an instructor at Aspire, you will deliver high-quality instruction within a small school environment where every student is known and valued as an individual. In addition, you will empower students to take control of their own learning and contribute to the continuous improvement of our nationally recognized model. Your professional learning community will provide a supportive and collaborative environment to fuel your growth and development. Together, we will change the odds for underserved students, ensuring that every student is prepared to earn a college degree.What You Will Do:Establish a culture of high expectations that includes the shared belief that every student will attend collegeDevelop and implement lesson plans and classroom activities aligned with California State Standards and Aspire Instructional GuidelinesAssess students regularly and refine and differentiate classroom instruction based on assessment data and student needsCommunicate regularly with students and families and involve families as partners in their child’s educationIdentify unique student needs and collaborate with team members to effectively address those needs and improve instructional practices throughout the schoolActively participate in professional development activities, and work closely with lead teachers, principal, and instructional coachesWhat You Will Bring:Bachelor’s degreeValid Multiple Subject Teaching Credential required1+ year working with students as a teacher, teacher intern, or teaching assistant preferredKnowledge of subject matter, including State Standards and subject-specific frameworksKnowledge of child cognitive development and various learning stylesAbility to analyze qualitative and quantitative student dataAbility and willingness to reflect and improve instructional practicesCompensation:Aspire offers its employees a competitive salary and benefits, including paid time off, 100% core health benefits coverage, life insurance/long-term disability, participation in a CA or TN state retirement plan, tuition reimbursement plan, and adoption assistance program.Aspire Public Schools is an equal opportunity employer and does not discriminate on the basis of race, color, gender, religion, age, sexual orientation, national or ethnic origin, disability, marital status, veteran status, or any other occupationally irrelevant criteria. Aspire promotes affirmative action for minorities, women, disabled persons, and veterans."}