{"jobID": "2830901780", "jobLocation": "Seattle_WA", "jobTitle": "Senior Data Scientist, Instant Offers", "companyRating": "4.2", "companyInfo": {"Website": "www.zillow.com", "Headquarters": "Seattle, WA", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Public (Z) ", "Industry": " Real Estate", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Realtor.com, RentPath, Redfin"}, "estimatedSalary": "160000", "jobDescription": " Coordinate with other data scientists, big data and machine learning engineers, product developers, and marketers to develop a common language and approach to analyzing and communicating information and insights.  Work with leaders in marketing, product, and analytics to compile robust data sets describing Zillow’s user acquisition efforts to assess the effectiveness of our initiatives.  Identify and size opportunities for new initiatives.  Dive into Zillow’s internal data (think Hive, Presto, SQL Server, Python, Mode Analytics, Tableau, R) to develop critical metric monitoring tools, conduct segmentation and pathing analyses, design and analyze AB test results, and create forecasts for user acquisition and engagement.  Evaluate and summarize the performance of user acquisition efforts in weekly, monthly, and quarterly meetings to keep existing efforts on track, measure progress toward goals, and identify areas for improvement.  Work with partners to fine-tune and adopt our approach to multi-channel modeling to Instant Offers, and to interpret model outputs into tangible marketing strategies, goals, and targets.  Explore Zillow’s clickstream data and streams of marketing-related data to compile AB test results, craft stories describing the effectiveness of implementation and strategy changes, and pursue the development of a multi-touch attribution system.  Who you are  We’re looking for a top-tier data scientist and manager that has:  The technical skills to absorb and disentangle billions of rows of data  The communication skills to work with a diverse set of partners to develop and implement multiple concurrent and complex project road maps, and (3) the tenacity to embrace and complete a challenging work stream.  You have an Undergraduate or Master’s degree in a quantitative field (e.g. science, engineering, economics, statistics).  You have 4-6 years of work experience involving quantitative data analysis and complex problem solving focused on paid marketing.  You have foundational analytical skills (e.g., total command of Excel and SQL, experience using R and/or Python) and are a Tableau pro.  You are comfortable talking about methods used in media mix modeling, and can turn model outputs into actionable marketing strategies.  You have worked with gigantic data sets and are comfortable accessing those data (even if they’re in JSON) with Hive and Presto.  You have interacted with clickstream data (e.g., command of Google Analytics) and raw data ingested from paid marketing channels (e.g., Adwords, Facebook) and have derived insights from those data sources to positively-influence the business.  You understand concepts, terminology, and measurement issues related to web/app analytics and online marketing in terms of user engagement and traffic acquisition/retention.  You have strong written and verbal communication skills, and work well on teams of all sizes with representatives from a diverse set of technical backgrounds.  You have experience successfully coordinating and leading large, long-term, multi-team, multi-disciplinary projects.  You have a passion for what you do."}