{"jobID": "2826016762", "jobLocation": "Bellevue_WA", "jobTitle": "Data Scientist", "companyRating": "4.4", "companyInfo": {"Website": "www.sap.com", "Headquarters": "Walldorf, Germany", "Size": "10000+ employees", "Founded": " 1972", "Type": " Company - Public (SAP) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Salesforce, Oracle, Microsoft"}, "estimatedSalary": "112000", "jobDescription": "Requisition ID: 186055 Work Area: Software-Research Expected Travel: 0 - 10% Career Status: Professional Employment Type: Regular Full Time Original Posting Date: 5/24/2018COMPANY DESCRIPTION SAP started in 1972 as a team of five colleagues with a desire to do something new. Together, they changed enterprise software and reinvented how business was done. Today, as a market leader in enterprise application software, we remain true to our roots. That’s why we engineer solutions to fuel innovation, foster equality and spread opportunity for our employees and customers across borders and cultures.  SAP values the entrepreneurial spirit, fostering creativity and building lasting relationships with our employees. We know that a diverse and inclusive workforce keeps us competitive and provides opportunities for all. We believe that together we can transform industries, grow economics, lift up societies and sustain our environment. Because it’s the best-run businesses that make the world run better and improve people’s lives. Location: Bellevue, WA       Purpose and Objective:      Concur Technologies, Inc. seeks a Data Scientist at our Bellevue, WA location to identify business use case and data features supporting the creation of machine learning models.    Expectations and Tasks:    Conduct in depth data analysis and utilize programming skills to reshape data for consumption. Provide expertise in machine learning training and performance evaluation. Responsible for building learning system for mapping user generated text into taxonomies used in analytic scenarios. Use combination of information retrieval and ML work to build scalable data scoring systems. Build scalable systems in conjunction with Engineering team. Evaluate new contributions to machine learning and information retrieval domains and provide suggestions on application of new techniques to maximize accuracy and scale. 10% travel required. Education and Qualifications/Skills and Competencies:    Master's degree in Data Science, Mathematics, Statistics or a related field.    Work Experience:    Experience or course work must involve utilizing supervised machine learning in the construction of ensemble classification systems; building models in Python using NumPy, SkiKitLearn, and NLTK; development in Java, Scala, and Python in big data/Spark modeling context; text analytics and natural language processing (NLP); search and information retrieval, including utilizing Lucene, Solr, or Elasticsearch; large data programming; developing scalable machine learning/data classification systems; Platform as a Service technologies including Amazon Web Services, Azure, or Google Compute Platform; utilizing Linux to provision and deploy prototype code and samples to PaaS environments; and Hadoop, Spark, and MapReduce programming frameworks. 10% travel required.    Travel: 10% travel required.       WHAT YOU GET FROM US Success is what you make it. At SAP, we help you make it your own.  A career at SAP can open many doors for you. If you’re searching for a company that’s dedicated to your ideas and individual growth, recognizes you for your unique contributions, fills you with a strong sense of purpose, and provides a fun, flexible and inclusive work environment – apply now. SAP'S DIVERSITY COMMITMENT To harness the power of innovation, SAP invests in the development of its diverse employees. We aspire to leverage the qualities and appreciate the unique competencies that each person brings to the company.  SAP is committed to the principles of Equal Employment Opportunity and to providing reasonable accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team. (Americas:Careers.NorthAmerica@sap.com or Careers.LatinAmerica@sap.com, APJ: Careers.APJ@sap.com, EMEA: Careers@sap.com). Requests for reasonable accommodation will be considered on a case-by-case basis. Successful candidates might be required to undergo a background verification with an external vendor. EOE AA M/F/Vet/Disability: Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, gender, sexual orientation, gender identity, protected veteran status or disability.  Successful candidates might be required to undergo a background verification with an external vendor. Additional Locations:"}