{"jobID": "2700081704", "jobLocation": "Mountain_View_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.raybeam.com", "Headquarters": "Newburyport, MA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "What are we looking for? We are looking for a technically savvy database-oriented Analyst or Data-Engineer with good people skills and the ability to pick up new business concepts and technologies. The ideal candidate will possess:A strong to very strong working knowledge of SQL.An ability to write and troubleshoot complex SQL procedures.The desire to understand business events through data.• An understanding of Data Warehousing and ETL techniques.High level understanding in at least one scripting language such as Ruby, Shell, Python.An interest in learning large data set processing with MapReduce/Hadoop/Pig/etc.Linux skills are a plus.Good client relations skills strongly preferred.Who are we? Raybeam, Inc. is a software engineering and consulting company focused on strategic consulting, business intelligence, and online/database marketing for the past fifteen years. We have offices near Boston and San Francisco and support a strong list of clients including Google, Facebook, Microsoft, eBay, Disney, One Kings Land, Beachbody and Hilton Worldwide. What do we do? We provide technology solutions by architecting and developing enterprise systems using a variety of programming languages, tools and platforms. This can range from building data warehouses, to web applications to implementing reporting platforms. We work in small teams, own the projects that we work on, and have direct input into the business decisions of our clients. What do you get from working for Raybeam?A fun, supportive work environment that promotes camaraderie and growth.The chance to travel and network with important figures in the industry.The chance to have input into business decisions of our clients.The opportunity to learn technologies that you've always wanted but never had the chance.If you are interested in applying for the position please click on the link below to take a 10 minute quiz. http://careerseval.raybeam.com/sign_in  Please note that Raybeam, Inc. is not E verified and is unable to provide sponsorship. We will only consider local candidates. Recent grads are encouraged to apply, and an MBA is desirable. This is a full time contract role. Thank You "}