{"jobID": "2810905004", "jobLocation": "San_Jose_CA", "jobTitle": "Registered Nurse (All Shifts)", "companyRating": null, "companyInfo": {"Website": "www.sanjosebh.com", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Hospital", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Position Summary: Conducts patient assessments and provides nursing interventions to patients as assigned. Maintains a safe and efficient working and treatment environment per facility policies and procedures. Communicates effectively with the treatment team to ensure safe, quality care is provided to all patients. Provides supervision to Licensed Practical Nurses and Mental Health Technicians. Assumes role of Charge Nurse when assigned. Essential Duties:PATIENT ASSESSMENT: Complete admission nursing assessment per policy and as assigned. Complete nursing reassessments per policy, as assigned, and any time a change in status is observed or reported by team members. Identify the need for additional assessments and/or specialized treatment, including but not limited to: dietary, rehabilitation services, and/or infectious disease through the initial and ongoing assessment process. Communicate the identified need to the attending practitioner or the consultant, per policy. Assess patients for risk of danger to self or others at time of admission and ongoing through hospitalization. Document assessments and communicate concerns to the attending practitioner and team members through verbal and written methods. DIRECTPATIENT CARE: Conduct patient rounds on assigned patients at the beginning of the shift to ensure all patients are present and to identify if there are any immediate needs that need addressed. Oversee all aspects of patient care and complete assignments as assigned by the Charge Nurse. Perform ongoing observation of the patients and milieu to ensure active treatment is provided and patients are participating. Respond appropriately and timely to patient requests. Intervene appropriately with patients experiencing a behavioral crisis situation, i.e., suicidal, threatening behavior, elopement and/or other situations. Exhibit leadership by providing clear direction to the team and communication of the patient’s status to the practitioner. Initiate emergency medical care when indicated. Provide support and direct assistance to patients who are unable to attend to their activities of daily living by assisting them with meals, daily grooming, ambulation and toileting as needed. Participate with the treatment team in implementation of the individualized plan of care. Report factors that may impede successful accomplishment of the treatment plan to the Charge Nurse. Provide patient educational information for identified learning needs. Facilitate educational/activity groups as assigned or when indicated using approved materials. Recommend alternative activities based on patient functioning level and treatment plan. Attend and actively participate in treatment team meetings as assigned. Ensure compliance with infection control protocols and/or policies by patients, visitors, and staff. SHIFT ADMINISTRATION: Review assignment sheet, facility designated communication tools each shift, i.e. communication log, bulletin boards, etc. Review practitioner orders, MAR, laboratory and test results, and treatment team documentation daily to ensure the treatment plan is current and fully implemented. Review all laboratory and test reports and transfer records from hospitals and other providers. Establish and maintain therapeutic and safe environment through role modeling, supervision and feedback. Remain on-duty until nursing coverage for subsequent shift arrives on unit, receives verbal report and conducts rounds on assigned patients. Ensure all patient valuables retained at the hospital during inpatient stay are recorded and stored per policy. Ensure patients are discharged with all personal belongings, medication, prescriptions, discharge and referral information. Comply with all National Patient Safety Goals and provide immediate feedback if non-compliance is identified. Complete Charge Nurse duties when assigned including assignment sheet, verification that staff assignments are completed and providing ongoing supervision as needed to the assigned nursing staff. MEDICATION ADMINISTRATION: Obtain clarification on medication orders that are unclear, do not include all the required elements or include DNU abbreviations. Read Back and receive confirmation on all telephone orders. Provide medication education on all new medications and respond to additional questions or concerns the patient may have regarding medications. Document medication variances and/or adverse drug reactions on the appropriate form and notify the patient, practitioner and facility leadership as directed per policy. Control access to the medication rooms and/or medication dispensing machines in accordance with facility policy. Ensure medication room and equipment is clean, including no personal belongings in the medication room. CUSTOMER INTERACTION: Interact with patients, family members, external entities and internal staff professionally and respectfully. Work collaboratively with all treatment team members to create a treatment environment that supports the facility’s mission to provide exemplary patient care and customer service. Act to preserve patient and family dignity and safety. DOCUMENTATION: Documentation for medical records and reports is timely, legible, thorough, and in required format. Document as required including assessments, treatment plan, nursing notes, medication administration, education, discharge planning, incident reports and medication variances. Update and revise treatment plan as assigned and per policy. Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities  The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information.Qualifications"}