{"jobID": "2794806987", "jobLocation": "Seattle_WA", "jobTitle": "Agronomic Data Analyst - Data Quality", "companyRating": "3.3", "companyInfo": {"Website": "www.climate.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2006", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "76000", "jobDescription": "Position Overview: The Climate Corporation is looking for an data analyst to work in a collaborative effort to solve challenging quality problems in agronomic data sets that drive the development and advancement of our research and products. A successful candidate should have the ability to work effectively across functions to identify key data quality issues, develop and implement methods to improve data quality, and then track improvements against predefined metrics.  This position will be under the Data Quality team within our Science organization but will have significant exposure to various backend engineering, science and product teams as well. If you want to work on real world problems and exciting challenges around Digital Agriculture that will have a significant impact in agriculture, The Climate Corporation would love to talk to you! What You Will Do:Discover and communicate various constraints and quality issues of agronomic data and their impact on the integrity of scientific modelsWork across teams and expertises to identify key data sets and quality problemsMaintain and validate data quality standards and metricsHelp maintain a data quality dashboards for broad consumption, organization widePerform root cause analysis of data quality issuesPropose and implement targeted data quality fixes that drive value creationLearn how data science can improve data qualityBasic Qualifications:BA/BS in Applied Math, Statistics, Biostatistics, Computer Science, Physics, Agronomy, Engineering or a related quantitative discipline with at least a year of data analytics or data science experience.Familiarity with statistical software (R/Python) or ScalaExperience with collecting and/or handling non-digital-platform (also non-Titanic) data through a course or projectExposure to working on data from multiple sources/formats.Experience in crop farming or agronomic operations.Preferred Qualifications:Experience with exploratory Big Data discovery through the use of technologies such as Tableau, Hadoop, MapReduce, or SparkExperience with complex data formats and data of varying qualityExperience with implementing and validating unsupervised methodsStrong communication skills to solicit information from domain experts and present results back to different audiences.Ability to inform the limits and trade-offs to stakeholders as well as peersCuriosity and an open-mind towards unfamiliar data sources and unfamiliar quantitative domainsExposure to working on data from multiple sources/formats.Previous experience in agronomic operations is a plus.What We Offer: Our teams are composed of industry experts, top scientists, and talented engineers. The environment is extremely engaging and fast-paced, with dozens of specialties coming together to provide the best possible products and experiences for our customers.  We provide competitive salaries and some of the best perks in the industry, including: Superb medical, dental, vision, life, disability benefits, and a 401k matching programA stocked kitchen with a large assortment of snacks & drinks to get you through the dayEncouragement to get out of the office and into the field with agents and farmers to see first-hand how our products are being usedWe take part and offer various workshops, conferences, meet-up groups, tech-talks, and hackathons to encourage participation and growth in both community involvement and career development We also hinge our cultural DNA on these five values: Inspire one anotherInnovate in all we doLeave a mark on the worldFind the possible in the impossibleBe direct and transparent Learn more about our team and our mission:  The Climate Corporation - The Technology Behind Making A Difference  https://youtu.be/c5TgbpE9UBI or visit https://climate.com/careers#LI-TD1"}