{"jobID": "2553553508", "jobLocation": "Boston_MA", "jobTitle": "Data Analyst - Global Wealth Management Co, $90K", "companyRating": null, "companyInfo": {"Website": "www.psgstaffing.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Beacon Hill Staffing Group, Hollister Staffing, KNF&T"}, "estimatedSalary": null, "jobDescription": " Job Description Data Analyst - Global Wealth Management Co, $90KWe have a full time permanent position available with one of our elite clients in financial services. Conveniently located in the heart of the financial district, this reputable Boston based company offers free parking and easy access to public transportation. The ideal candidate must have a genuine desire to excel, achieve and evolve as a member of our company. As a data analyst, the candidate will be leading the team in working with internal clients, market data vendors and brokers. If you are a goal-oriented and results driven professional please submit a copy of your resume for consideration.Responsibilities: -Timely, accurate, and thorough support of complex and routine inquiries -Identification, ownership and resolution of business and systems issues through interaction with Systems, vendors, brokers, and internal clients -Lead efforts to identify and implement process improvements -Execute daily validation and initiation procedures, ensuring the integrity and consistency of data across multiple platforms - Working with SQL and other data sources -Tying up the data into a neat package to present to managementQualifications: -Bachelor's degree -At least two years analyst experience -Knowledge of security master file, data integrity, and pricing processes -Proven success in initiating and maintaining strong interpersonal relationsIf you'd like to join our team or apply, please submit your resumeFor questions, please call 617-250-1000. There are no costs for candidates utilizing our services as our clients pay for all related hiring fees. All PSG job postings are either actual positions we had available at the time of posting and/or are representative of positions we typically fill or expect to fill. If you see a job that interests you, respond to the ad or give us a call so that we can help you find a job you'll love. As one of the area's largest staffing firms, we help 2,500 people find jobs a year so chances are good that we can help you too. Professional Staffing Group is an equal opportunity employer and considers qualified applicants for employment regardless of race, gender, gender identity, gender expression, age, color, religion, disability, veteran's status, sexual orientation, or any other protected factor."}