{"jobID": "2823350047", "jobLocation": "San_Francisco_CA", "jobTitle": "Security Solutions Architect - Dallas, Denver, Phoenix, Bay Area, Seattle", "companyRating": "3.6", "companyInfo": {"Website": "www.radware.com", "Headquarters": "Tel Aviv-Jaffa, Israel", "Size": "501 to 1000 employees", "Founded": " 1996", "Type": " Company - Public (RDWR) ", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "154000", "jobDescription": "CareersSecurity Solutions Architect Dallas, Denver, Phoenix, Bay Area, Seattle  / TechnicalSecurity Solutions Architect  Position SummaryRadware is looking for a Security Solutions Architect to support its security business opportunities throughout North America. Successful candidates for SSA position must be comfortable doing both pre-sales presentations and post-sales hands-on support of evaluations/proof of concept installations. Representing the company in emerging technology opportunities suggests a set of well-rounded experience ranging from Carrier Grade Networking to Web Application Security. Remote position in Texas or on the West coast. The position is responsible for North America security business. The position does require up to 50% travel.ResponsibilitiesSecurity Solution Architect will be responsible for supporting the security business line in North America. The role will require working closely with Sales, Sales Engineering, Product Teams, Emergency Response and Technical Support within the Americas and headquarters (Tel Aviv, Israel). SSA will work with customers and sales team to define goals, monitor progress and comply with internal Radware standards for concurrent execution of multiple projects. The SSA will translate security concepts into language that is meaningful to both business executives and technical audiences.  This person will have the following primary responsibilities: Provide technical sales support for key opportunities including technical presentations, competitive positioning, and proposal developmentProvide on-site and remote support for product demonstrations, evaluations and proof of conceptsProvide intermediary between product and sales teamsSupport new products and product design initiatives with prospective customersPrepare and deliver white papers, configuration guides for internal and external consumptionPublic Speaking at industry events and trade showsRequirementsThe candidate should have expertise in areas of focus including Network and Application Security. Strong technical knowledge and expertise in the following areas:Web Application Security Experience with WAF, Pen Testing or Secure Coding PracticesStrong understanding of encryption (SSL, hmacs) and the various HTTP RFCs Network Security (Firewall, IPS, DDOS, etc.)Sound knowledge of commercial and open source DDOS and penetration testing toolsSystems integration experience involving the interfacing of complex systems components with one another - - ability to write and integrate APIs a plus!Experience working directly with Customers: Ability to interact with customers at all levelsGood presentation and public speaking skillsDemonstrate ability to influence decision makers at all levels Advantages  Product specific expertise with F5 ASM, Imperva WAF, Arbor Peakflow/TMS Professional Penetration Testing Experience, Offensive Security Penetration Tester Industry Certification a Plus, ie. CCIE – Security, CISSP M.S., PhD Engineering, Computer Science or related technical field"}