{"jobID": "2642493170", "jobLocation": "San_Francisco_CA", "jobTitle": "Analyst, Issue Analytics", "companyRating": null, "companyInfo": {"Website": "www.ssaandco.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 1994", "Type": " Private Practice / Firm", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " High Lantern Group (HLG) is a strategic positioning and reputation management consultancy working for some of the world's most notable businesses and organizations.  We are hiring an analyst to support our growing Issue Analytics practice, which provides clients with strategic insights about their external landscape. Through this service offering, we help clients forecast and analyze reputational threats, CSR trends, stakeholder expectations, and external leadership opportunities. For more information about Issue Analytics, please consult hlganalytics.com.  This is an exciting opportunity to join an expanding team that is pioneering a new approach to data-driven issues management. We're looking for a hybrid individual who can help bridge the gap between our analytic offering and our traditional consulting expertise someone comfortable translating ambiguous problems into robust, meaningful metrics and insights that clients can use. The right candidate for this role will have an analyst's mindset and comfort with data, as well as a natural curiosity about business strategy, corporate reputation, and public policy.  Key Responsibilities Produce regular analytic reports for internal and external audiences detailing key corporate reputation trends.Mine large, unstructured datasets to surface novel insights that will be meaningful to our clients.Contribute to development of visualizations and metrics that strengthen our ability to surface insights and provide guidance to our clients.Work with natural language processing tools to develop and manage client monitoring projects.Track the performance of our methodology, helping to document it, and propose ways to increase scalability of the tool, and actionability of the insights.Work with data scientists and other team members to increase accuracy of our natural language processing tools.Support product scalability by standardizing analytic and strategy-creation processes.Manage & train interns/summer associates.Required SkillsIdeal candidates should have:1+ years' professional experience analyzing social issues, public policy, or business strategyProven ability to translate data into meaningful insights.Ability to wrangle and visualize large datasets in R.Affinity for problem-solving; demonstrated resiliency in the face of challenges and set-backs.Passion for excellence and driving customer success.Excellent writing, research, and communication skills.Exemplary attention to detail.Exceptional candidates will have experience with Shiny apps, familiarity with SQL, and/or leveraging machine learning algorithms.Bachelor's required. Candidates will likely have additional academic credentials such as an MA, MS, or completed certificate coursework. How to Apply  Please apply online at www.highlanterngroup.com/careers.  You are required to submit a cover letter and resume. Incomplete applications will not be reviewed.  In your cover letter, candidates should detail their creativity in problem-solving with particular regard to data wrangling / visualization and analysis of social, reputation, public policy, or business issues.  About High Lantern Group  In 2009, we imagined a new kind of consulting firm, one that delivers on the promise of new ideas and fresh perspectives; that feels like a natural extension of the client; that can complete your thoughts and push them further. We imagined a firm with the kind of consultants we always wanted to work with: smart, resourceful and driven to excellence. We built High Lantern Group from the ground up to deliver that from our care in hiring, to our attention to development, to the services and processes we use to meet the challenges of our clients.  Today, High Lantern Group is a leading public affairs consulting firm, specializing in positioning clients in the marketplace of ideas, with growing offices in Los Angeles, New York City, Washington, Philadelphia and Geneva, Switzerland. For more information on our people and capabilities, please visit us at www.highlanterngroup.com.SDL2017"}