{"jobID": "2807669704", "jobLocation": "San_Francisco_CA", "jobTitle": "International Tax Manager", "companyRating": "3.9", "companyInfo": {"Website": "www.crowe.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1942", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "113000", "jobDescription": "Job SummaryThe successful candidate will be responsible for the following: consulting with the federal tax group on all international tax matters; researching international tax issues and opportunities; managing and coordinating the tax services of Crowe Global member firms when consulted; managing, supervising, and reviewing the preparation of all forms and disclosures in connection with the international compliance practice; and developing a team with expertise in international taxation.  KEY RESPONSIBILITIES: Develop and present tax planning strategies for multinational corporations to client executives in manufacturing, distribution, retail and service industries.Facilitate the implementation of International Tax projects including identifying, understanding, communicating and managing projects from inception to completion.Provide technical expertise and knowledge of processes to expand the line of business and develop professional staff.Develop team of professionals with expertise in international taxation.QualificationsBachelor's degree in Accounting. Masters in Taxation or LLM preferred.CPA required.5 - 12 years of full time tax experience.Strong federal tax background including; consolidated C corporation, partnership, S corporation, FAS 109, FIN 48, and a basic understanding of mergers, acquisitions, and restructuring.Solid international tax skills including experience with inbound and outbound foreign investment including, but not limited to, IC-DISC's, transfer pricing, foreign tax credit calculations, subpart F issues and calculations, and all international reporting and compliance matters.Proven engagement and staff management skills.Public accounting experience required at the Manager level.Strong organizational and management skills.Excellent oral and written communication skills.Strong interpersonal and teamwork skills with the ability to interact with all levels of client management, referral sources and other professionals.About the Team: The Tax team at Crowe develops lasting relationships with clients by providing value, knowledge and strategy focus. As part of the Tax group, you will be part of a collaborative team with deep specialization. We use proactive approaches and innovative tax technology to provide high quality tax services to our clients. If you are committed to client excellence, want to be part of a growing organization and are looking to expand professionally, then is the place for you! Learn more about our Tax team Our Benefits: At Crowe, we know that great people is what makes a great firm. We value our people and offer employees a comprehensive benefits package. Learn more about what working at Crowe can mean for you. How You Can Grow: We will nurture your talent in an inclusive culture that values diversity. You will have the chance to meet on a consistent basis with your Career Coach that will guide you in your career goals and aspirations. Learn more about where talent can prosper!  Visit Crowe Careers to find out how you can grow your career and make an impact every single day! More about Crowe: Crowe (www.crowe.com) is one of the largest public accounting, consulting and technology firms in the United States. Crowe uses its deep industry expertise to provide audit services to public and private entities while also helping clients reach their goals with tax, advisory, risk and performance services. Crowe is recognized by many organizations as one of the country's best places to work. Crowe serves clients worldwide as an independent member of Crowe Global, one of the largest global accounting networks in the world. The network consists of more than 200 independent accounting and advisory services firms in more than 130 countries around the world.  EOE  M/F/D/VCompany OverviewYour Journey at Crowe Starts Here: At Crowe, you have the opportunity to deliver innovative solutions to today’s complex business issues. Crowe’s accounting, consulting, and technology personnel are widely recognized for their in-depth expertise and understanding of sophisticated process frameworks and enabling technologies, along with their commitment to delivering measurable results that help clients build business value. Our focus on emerging technology solutions along with our commitment to internal career growth and exceptional client value has resulted in a firm that is routinely recognized as a “Best Place to Work.” We are 75 years strong and still growing. Come grow with us!"}