{"jobID": "2823556002", "jobLocation": "Milpitas_CA", "jobTitle": "Data Science and Machine Control Software Intern", "companyRating": null, "companyInfo": {"Website": "www.kla-tencor.com", "Headquarters": "Milpitas, CA", "Size": "5001 to 10000 employees", "Founded": " 1976", "Type": " Company - Public (KLAC) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Applied Materials, Nanometrics"}, "estimatedSalary": null, "jobDescription": "Company Overview Calling the adventurers ready to join a company that's pushing the limits of nanotechnology to keep the digital revolution rolling. At KLA-Tencor, we're making technology advancements that are bigger—and tinier—than the world has ever seen.  Who are we? We research, develop, and manufacture the world's most advanced inspection and measurement equipment for the semiconductor and nanoelectronics industries. We enable the digital age by pushing the boundaries of technology, creating tools capable of finding defects smaller than a wavelength of visible light. We create smarter processes so that technology leaders can manufacture high-performance chips—the kind in that phone in your pocket, the tablet on your desk and nearly every electronic device you own—faster and better. We're passionate about creating solutions that drive progress and help people do what wouldn't be possible without us. The future is calling. Will you answer? Group/Division We manufacture world’s most advanced wafer inspection, review and measurement equipment for the chipmakers based on Electron Beam Technology.  Our suite of SEM (Scanning Electron Microscope) wafer defect inspectors, defect review and classification tools form a complete solution for inspecting, identify and tracking yield-critical defects.  The high-resolution images of wafer defects help the chipmakers resolve production issues and aid in producing maximum numbers of chips from wafers in high-speed and high-volume manufacturing processes Responsibilities We're looking for interns who are curious, who want to be entrusted with real responsibility and embrace the opportunity to write code that will ship.  Our software drives ultra-high-speed wafer inspection and review systems that includes user interface, machine control, clustered image computer, machine learning and complex image processing algos.  You'll be a member of the engineering team and learn from our incredible engineers while making a measurable impact. Preferred Qualifications Software development experience either in Java, C++, C# or Python (One or all. We understand that the languages keep evolving and proliferate. We are not looking for language syntax. We are looking at your basic problem-solving skills in software computing and past exposure to these languages)  The candidate must be eager to explore new frontiers, invest and learn new open source technologies including machine learning, open source big data technologies and solving data science problems using modern software applications.  And most importantly, having attitude of “willing to fail, fight and not-give-up” kind of young professionals and solution driven thinking in either computer science, electrical, electronics, or relevant field as a student. Minimum Qualifications Currently pursuing a BS, MS, or PhD in Computer Science or a related field Equal Employment Opportunity KLA-Tencor is an Equal Opportunity Employer. Applicants will be considered for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other characteristics protected by applicable law."}