{"jobID": "2816810082", "jobLocation": "Brooklyn_NY", "jobTitle": "Outside Sales Representative", "companyRating": null, "companyInfo": {"Website": "www.mgrc.com", "Headquarters": "Livermore, CA", "Size": "1001 to 5000 employees", "Founded": " 1979", "Type": " Company - Public (MGRC) ", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Founded in 1979, McGrath RentCorp is a diversified business to business rental company that rents and sells relocatable modular buildings, storage containers, electronic test equipment, and liquid and solid containment tanks and boxes. We operate through five divisions: Mobile Modular, Mobile Modular Portable Storage, TRS-RenTelco, Adler Tanks, and Enviroplex.  McGrath RentCorp is headquartered in Livermore, CA with branch offices located throughout North America. We are traded on the NASDAQ Global Select Market under the symbol \"MGRC.\" OUTSIDE SALES REPRESENTATIVE Adler Tank Rentals, a division of McGrath RentCorp (NASDAQ: MGRC) is a national leader in the rental of temporary liquid and solid containment tanks and boxes. Our products serve a wide variety of industries including industrial plant and refineries, construction, environmental remediation, and oil and gas exploration & production. Develop new business—cold calling and prospecting.Fast pace due to short sales cycles—the nature of the rental sector.Manage assigned territory, providing outstanding customer service.Operate as the solution to customers’ needs.CRM experience/working with sales reporting.Qualifications:A Bachelor’s degree or equivalent years of sales experience.Industrial B2B sales experience preferred.Confident, assertive and quick-thinking.Excellent oral and written communication skills.Demonstrated skills at building enduring customer relationships, strategic selling, attention to detail and organization.All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity,national origin,protected veteran status, or on the basis of disability."}