{"jobID": "2763181390", "jobLocation": "San_Francisco_CA", "jobTitle": "Principal Data Scientist", "companyRating": null, "companyInfo": {"Headquarters": "Jersey City, NJ", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Unknown", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Assessing the impact and viability of grid edge technologies and distributed energy resources  Forecasting market potential, and adoption of demand side management technologies, programs, and services  Optimizing non-wires alternative resource portfolio, location, and performance  Analyzing customer demographic, program participation and SmartMeter interval data to build program targeting propensity models  Supervised and unsupervised machine learning models using Python and Spark, executed on AWS  A selection of past presentations, awards, and papers are online. Additional examples available upon request Position Summary We are looking for a Principal Data Scientist to work on one or more of the areas mentioned above. The Strategic Data Science team is looking to expand on its data science capabilities -- you will have a unique opportunity to be at the forefront of utility industry analytics. In this role you will work as part of cross functional teams, including other data scientists, technology experts, and subject matter experts to develop data driven solutions. It is the perfect role for someone who would like to continue to build upon their professional experience and gain a comprehensive view of the nation’s most advance smart grid. QualificationsMinimum Qualifications: Excellent oral and written communication skills  Degree in computer science, engineering, applied sciences, mathematics, statistics, econometrics or similar quantitatively focused subject areas or job-related experience  Minimum of 10 years of relevant experience in data science or advanced analytics (through graduate education or work experience)  Demonstrated collaboration or paired development work history  Demonstrated proficiency and experience working with relational databases, preferably in SQL  Demonstrated proficiency writing clear and well documented code, preferably in Python  Demonstrated proficiency with data science best practices, such as version control via Git or similar  Demonstrated proficiency data visualization tools such as Tableau, D3, Plotly, etc.  Demonstrated proficiency with model development for decision analysis, forecasting, or other complex quantitative modeling  Demonstrated experience working with large datasets and knowledgeable about parallelization  Strong understanding of statistics and experience developing supervised & unsupervised learning models  History mentoring and teaching others as well as desire to continue to do so Desired Qualifications: Enjoy working on complex multi-stage projects with a diverse team  Involvement or strong interest in the energy/clean tech industry  History mentoring and teaching others  Familiarity with transmission and/or distribution power flow models  Past experience with advanced metering interval data  Experience in data engineering tools like Kafka  GIS experience Responsibilities Analytics and Modeling  Gather, prepare, and analyze data from disparate sources to produce user-friendly models and actionable insights  Work closely with domain experts. Develop a working knowledge of rate structures and elements, load shapes, distributed energy resource technologies and policy options  Develop expertise with grid data, customer demographic information and other structured data sets  Understand and apply statistical and analytical modeling methods such as classification, regression, clustering, anomaly detection, neural networks, etc. to identify opportunities for operational improvements and develop strategic insights  Communication, Summary Presentation and Visualization  Appropriately document data sources, methodology, and model evaluation metrics  Develop and present summary presentations for senior management  Create streamlined visual tools for end-users  Work with business partners to advance business processes, based on analytical findings  Work with team leadership to continually improve analytics at PG&E; via demonstrations, mentoring, disseminating best practices, etc."}