{"jobID": "2707719777", "jobLocation": "Jersey_City_NJ", "jobTitle": "Relationship Manager - Business Banking", "companyRating": null, "companyInfo": {"Website": "www.provident.bank", "Headquarters": "Iselin, NJ", "Size": "501 to 1000 employees", "Founded": " 1839", "Type": " Subsidiary or Business Segment", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Investors Bank, Valley National Bancorp, M&T Bank"}, "estimatedSalary": null, "jobDescription": " Provident Bank, a multi-billion dollar NJ bank, is seeking an experienced Business Banking Commercial Lender with strong business development and credit skills to be based in Princeton, NJ. POSITION SUMMARY Under general direction, this position is responsible for origination, evaluation and structuring of complex loan requests and transactions. Additional responsibilities will include portfolio management and cross-selling other Bank products and increasing the bank’s visibility in the marketplace. The position is considered the more experienced job in the job family. MAJOR JOB RESPONSIBILITIESSolicits credit-worthy potential and existing customers in an effort to develop new business and increase or retain existing business within the framework of the policy and procedures of the Bank. Promotes profitable growth of the loan portfolio and maximum customer responsiveness. 30%Oversee the preparation of loan presentation including detailed financial analysis and assessment of borrower's financial capacity and creditworthiness. 20%Assesses lending risks, identifies offsetting mitigants and makes recommendations on loan structure displaying sound credit judgment. 20%Establishes and promotes customer and community relationships; cross sell other Bank products and services; maintains continued awareness of market conditions and  competition; continues education in financing products and techniques. 15%Manages all aspects of assigned loan portfolio with emphasis on covenant and bank policy compliance, credit quality and delinquency control. 10%Facilitates closing of the loan transactions with strict compliance with approved terms and conditions. 5%SUPERVISORY RESPONSIBILITIES None SKILLS AND TRAINING Comprehensive loan analysis experience.  Comprehensive financial analysis experience.  Comprehensive knowledge of underwriting techniques.  Proven new business track record.  Strong oral, written and communication and management skills.  Proficient with software programs (Microsoft Word, Excel and Argus). EDUCATION Bachelor’s degree in Accounting, Finance or Business Administration WORK EXPERIENCE 5 to 10 years commercial lending experience in a banking environment, specializing in Business Banking. LICENSES AND/OR CERTIFICATESLicenses and CertificationsExpiration Date Valid Driver's License WORKING CONDITIONS Work is performed in a normal office environment. Noise levels are usually moderate. May also involve travel to customers and property locations. HAZARDS The hazards are mainly those present in a normal office setting and those present in commuting by car.  Occasionally may be exposed to those conditions present in public forums and meeting places. This job description may not be all-inclusive. Employees are expected to perform other duties as assigned and directed by management. Job descriptions and duties may be modified when deemed appropriate by management.We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law. *LI-POST"}