{"jobID": "2770568542", "jobLocation": "Redwood_City_CA", "jobTitle": "Staff Software Engineer", "companyRating": null, "companyInfo": {"Website": "www.aurishealth.com", "Headquarters": "Redwood City, CA", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Summary  Auris is looking for a Staff Software Engineer to join a team of talented roboticists and software engineers who are solving some of the hardest problems in medicine today. The staff software engineer will play a key role in the development of the Monarch robotic platform for medical applications. In addition to design, implement and test software solutions, she/he will be involved in specifications and requirements definitions based on clinical and user inputs. The position requires strong knowledge of Linux, Linux drivers and rock solid C++ development skills. The staff software engineer is expected to work closely with the other software engineers as well as engineers from other groups. We are looking for a candidate that can work independently and also function well within a team, that has the desire to bring the latest software technologies into the medical world, is self-motivated, curious and willing to revolutionize the world of surgical robotics.  Responsibilities Work with software engineers and other engineering groups to design, develop and integrate software solutions for our robotic platform.Develop and configure Linux kernel drivers.Design and implement C++ applications in an FDA regulated environment.Participate in design discussions and code reviews.Integrate, test and debug software solutions on the hardware platform.  QualificationsMS in Computer science, Computer Engineering, Electrical Engineering or equivalent.6+ years designing and developing complex software, preferably for medical applications.Strong knowledge in Linux kernel, Linux driver and application development.Experience configuring and building Linux kernels.Strong background in object oriented programming and code reuse.Proficiency with C/C++ programming and multi-threaded applications.Strong understanding of state-machine based design and event driven architectures.Experience with Unit testing and software Verification and Validation processes.Excellent communication and documentation skills. Desired Experience Knowledge of CMake/Make.Experience with developing software in a regulated environment.Experience with scripting language such as Python.Experience in TCP/IP based network programming.Experience with GUI development under QT."}