{"jobID": "2796124506", "jobLocation": "San_Jose_CA", "jobTitle": "Investment Counselor (Financial Advisor/Stock Broker Alternative)", "companyRating": null, "companyInfo": {"Website": "www.fishercareers.com", "Headquarters": "Camas, WA", "Size": "1001 to 5000 employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OverviewCalling all financial advisers and stock brokers: You can stop prospecting now. You can stop book building, marketing, swimming through paperwork, scrapping for commissions, and feeling conflict over selling products versus providing service.  Why? Because whether your background is in finance or investments, this is the next step in your career that you’ve been waiting for. It’s your window to move out of sales and into bettering peoples’ lives. With no products to push or quotas to hit, you’re free to focus on the core of our business: relationship management. The Job: As an Investment Counselor, you will be the face and voice of Fisher Investments. You will spend your time on an assigned roster of high-net-worth clients, educating them on our top-down investment philosophy, explaining why we’ve made certain decisions for their particular portfolio, and helping them understand events in the market. Your sole mission is to help your clients stay on track with their long-term financial goals. The Details: When you come to work for us as an Investment Counselor, we provide you with an arsenal of support, including: An advanced finance and capital markets education through our training and mentoring program, allowing you to learn how our firm is different from our competitors and why that gives us a competitive advantage.Internal portfolio decision-makers and auxiliary research teams who handle the portfolio itself, meaning you can focus on providing unparalleled customer service. You’re free to take off your “many hats” and become an expert in client relationship management and education.Ongoing career development, empowering you to discover your own career path.Opportunities for advancement driven by performance and attitude.Competitive compensation that aligns your interest with the client’s, instead of working against each other.The Bottom Line: You’re meant for this role if you have finance experience and a thorough understanding of the investment industry. You will succeed if you have a desire to develop longstanding relationships as opposed to selling products or trading accounts. You will thrive if you have a tremendous desire to explore new opportunities and challenges—and along the way, seek to help us in our quest to better the investment universe. Finally, you will excel if you continuously strive to put your clients first.  Don’t miss it, though, these are coveted positions within the firm and tend to fill fast. Take your career to the next level and apply today!  FISHER INVESTMENTS IS AN EQUAL OPPORTUNITY EMPLOYER  #LI-FI1  #PDN"}