{"jobID": "2796543425", "jobLocation": "Jersey_City_NJ", "jobTitle": "Procurement Administrator", "companyRating": null, "companyInfo": {"Website": "www.fidessa.com", "Headquarters": "London, United Kingdom", "Size": "1001 to 5000 employees", "Founded": " 1981", "Type": " Company - Public (FDSA) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " IHS Markit, Charles River Development, Trading Technologies"}, "estimatedSalary": null, "jobDescription": "Procurement Administrator About FidessaExceptional trading, investment and information solutions for the world's financial community. Fidessa's unrivalled set of mission-critical products serve both buy-side and sell-side global institutions and investment banks to boutique brokers and niche hedge funds with multi-asset trading and investment infrastructure, their market data and analysis, and their decision making and workflow technology. We are freethinking and do not believe in rigid structure or tight controls where these limit our ability to be innovative and adaptable. We recognize that a business is only as good as its people. To provide and build on our high-quality platform and services, we seek to employ only the best! Department Overview The Procurement Administrator role is based within the Central Business Function of the company and will be based in Jersey City, New Jersey. The candidate will be responsible for the cost efficient procurement of goods and services across several spend categories for the U.S. and Latin American locations. The Procurement team is an enthusiastic mix of people with strong technical, functional and customer service skills. Role Description The Procurement Administrator works with internal clients on the procurement of goods and services across several spend categories including technology, telecom, marketing, human resources, facilities, and office and kitchen supplies using SAP. Please note that this position is a temporary position with potential for permanent conversion. ResponsibilitiesProactively engages with business partners/internal clients to develop and coordinate requests for proposals and requests for informationWorking with legal department and Management to negotiate terms for contracts and service agreementsMaintaining vendor relationships to ensure responsive service and timely resolution of all issuesMaintaining calendars of service, contract, maintenance, warranty, lease, and license renewalsWork with business and internal IT and data center infrastructure groups to determine requirements for new and changing voice and data needs.Provide detailed spend reports to Management and Finance using Excel and SAP reporting toolsWork with telecom providers to provision telecommunication services for internal and customer projectsWork with infrastructure and IT departments to ensure timely installation and turn up of new voice and data lines and verify billing start time.Create spend forecasts and then monitor these against actual spendInteract with Procurement Administrators in other regions to develop procedures globallyRaising and settling invoice queries with suppliersProcessing of internal requisitions while adhering to Service Levels AgreementsAnalysis of quotes for goods and servicesBuild strong working relationships both internally and with suppliersTracking and reporting on voice and data lines, orders & assetsQualifications2-5 years of similar experience in procurementRequires strong Excel and SAP Materials Management module skillsDemonstrated experience in negotiating telecom agreements and good working relationship with telecommunications providers.Must be able to build and maintain relationships within business organization and with suppliers, remaining customer focused at all times.Must have demonstrated planning and organizational skillsRequires the ability to manage multiple projects and thrive in an on-demand\u009d environment.Contracting, sourcing, and facilitation of proper due diligence for the procurement of hardware, software, peripherals, telecom and general office suppliesBroad and comprehensive knowledge of contract terms and conditionsMinimum 1 year of accounting and invoice processing within procurement/purchasing environmentDirect experience providing procurement guidance to the business; experience analyzing the project requirements and working with the clients to draft a solutionThe ability to identify potential issues and suggest areas for process improvementUnderstanding of basic accounting including expense allocation, capitalization, amortization, and depreciationExcellent time management, organizational skills, analytical ability and keen attention to detail Fidessa is an Equal Opportunity Employer, M/F/D/V"}