{"jobID": "2831099850", "jobLocation": "Boston_MA", "jobTitle": "Energy Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.mass.gov", "Headquarters": "Chelsea, MA", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Government", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Working under the supervision of the Manager of Policy Initiatives, the Energy Data Analyst will perform high level data and policy analysis of both electric and natural gas markets, and federal and state regulatory proceedings.  Provide analysis to support the Department of Energy Resources (DOER) in interventions in state and federal proceedings on pertinent energy issues to provide strong analytical support to DOER's legal team; including in the Department of Public Utilities (DPU) electric and natural gas rate cases and in other policy making venues. This will include identifying important and relevant data, data input, and creating statistical and visual presentations of results to be used by policy and legal team members.  With assistance from Division Directors, ensure effectiveness of energy policy, programs and implementation strategies through assessments and evaluation of DOER's programs. The analyst will develop quantitative analytical tools and models to in support of energy policy assessment and development.  Review and analyze activities in retail energy markets, including both electricity and other fuels, as they relate to DOER's policies and programs (including energy efficiency, renewable energy, emerging technologies, and peak demand reduction). Maintain data sets and reports to be accessible for other team members.  Track activities in state and regional retail energy markets and advise Commissioner and Division Directors on impact of wholesale market activity on DOER and the Administration's energy policy goals, in particular as they relate to achieving fuel diversity, renewable energy and efficiency in the Commonwealth and the region.  A strong candidate should have a working knowledge and interest in energy markets and government functions and be inquisitive, conscientious, and an effective problem solver and communicator. A strong candidate will also have a working knowledge and interest in financial structures, especially as it relates to utility rates, and an interest in utility functions, especially as relates to system planning and performance metrics.  First consideration will be given to those applicants that apply within the first 14 days.  MINIMUM ENTRANCE REQUIREMENTS: Applicants must have at least (A) three years of full time, or equivalent part-time, professional, administrative or managerial experience in business administration, business management or public administration the major duties of which involved program management, program administration, program coordination, program planning and/or program analysis, or (B) any equivalent combination of the required experience and the substitutions below. Substitutions: I. A Bachelor's degree with a major in business administration, business management or public administration may be substituted for a maximum of two years of the-required experience.*  II. A Graduate degree with a major in business administration, business management or public administration may be substituted for the required experience.*  III. A Bachelor's or higher degree with a major other than in business administration, business management or public administration may be substituted for a maximum of one year of the required experience.* Education toward such a degree will be prorated on the basis of the proportion of the requirements actually completed. An Equal Opportunity / Affirmative Action Employer. Females, minorities, veterans, and persons with disabilities are strongly encouraged to apply.SDL2017"}