{"jobID": "2705855551", "jobLocation": "Cambridge_MA", "jobTitle": "RWE Sr. Data Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.sanofi.com", "Headquarters": "Paris, France", "Size": "10000+ employees", "Founded": " 1973", "Type": " Company - Public (SNY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Pfizer, GlaxoSmithKline"}, "estimatedSalary": "64000", "jobDescription": "About Sanofi Sanofi, a global healthcare leader, discovers, develops and distributes therapeutic solutions focused on patients' needs. Sanofi is organized into five global business units: Diabetes and Cardiovascular, General Medicines and Emerging Markets, Sanofi Genzyme, Sanofi Pasteur and Consumer Healthcare. Sanofi USAt Sanofi US, we are committed to the growth of our people, connected in purpose by career, life and health.Headquartered in Bridgewater, NJ, Sanofi US is part of a leading global healthcare company dedicated to discovering, developing and distributing therapeutic solutions focused on patients needs.Sanofi has core strengths in diabetes solutions, human vaccines, innovative drugs, consumer healthcare, emerging markets and Sanofi Genzyme.Sanofi US employs approximately 15,000 people across the country all dedicated to protecting health, enhancing life and responding to the hopes and potential healthcare needs of seven billion people around the world.Commitment is our Strength. Ready to grow together?Sanofi US endeavors to make our career center accessible to any and all users. If you are experiencing difficulty and need assistance applying online, please call 1-800-207-8049 Option 7, then Option 3. Sanofi US Services, Inc. and its U.S. affiliates are Equal Opportunity and Affirmative Action employers committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race; color; creed; religion; national origin; age; ancestry; nationality; marital, domestic partnership or civil union status; sex, gender, gender identity or expression; affectional or sexual orientation; disability; veteran or military status or liability for military status; domestic violence victim status; atypical cellular or blood trait; genetic information (including the refusal to submit to genetic testing) or any other characteristic protected by law. JOB SUMMARY: The Real World Data and Analytics position integrates data management and analytics skills with computational background to significantly impact the delivery of the RWE&CO; projects. The incumbent will support the development and maintenance of applications used for design, analysis, and reporting purposes and he/she will secure the maintenance of observational data obtained via primary data collection or license of secondary data sources, as well as de-identified clinical trial data. JOB DUTIES AND RESPONSIBILITIES: A RWE Data Analyst will collaborate with RWE Investigators and Analytics on the analysis and interpretation of specific epidemiological/outcomes research studies where the RWE DA will have responsibilities across data management, statistical input, and execution of analysis for specific epidemiological/outcomes research studies. He/She will need to be able to work independently on these efforts and work with other Analytics team members to provide rapid, thorough and creative data and analytics solutions.  This role requires taking on a range of activities: Develop and maintain a strong working relationship with statisticians, modelers, pharmacometricians, translational scientists, RWE investigators, Advance Analytics and IT partners bringing a deep understanding of the available data and core statistical approaches and visualization tools.Maintain a keen awareness of developments in data technologies, analytics, methods and systems.Be a go-to person for data processing, traditional statistical and analytics platform support.Hands on implementation of analytical solutions, data access, and management technologies.Present internally and externally on a regular basis on data solutions and applications, and publish work output.Take on initiatives that progress strategic data management and analytics capabilities for the RWE&CO; department.Provide technical and analytical expertise, coupled with a knowledge of disease or human biology.Develop data integration, management and analysis strategies aligned to RWE strategies in the area of responsibility. REQUIRED EXPERIENCE Bachelors + 5 yrs experience or Masters + 3 yrs or PhD + 2 yrs, or similar mix of aptitude for learning and scientific research)Experience using basic and advanced epidemiologic statistics, some direct experience with claims and electronic health records is also required.Experience with SAS and other programming languages e.g. S-Plus, R, python and an ability to learn new programming languages desired.Familiar with cloud and high-performance computing environments (AWS, GCP)Some Data Science or Engineering Skills & Tools experience (e.g. data munging, data visualization, exploratory data analysis, Tableau, Plotly, JavaScript, Python, Spark, Hive, Pig, Data streaming, NoSQL, SQL).Experience explaining technical and analytical methodology to a wide variety of audiences or stakeholders. Sanofi is dedicated to supporting people through their health challenges. We are a global biopharmaceutical company focused on human health. We prevent illness with vaccines, provide innovative treatments to fight pain and ease suffering. We stand by the few who suffer from rare diseases and the millions with long-term chronic conditions.  With more than 100,000 people in 100 countries, Sanofi is transforming scientific innovation into healthcare solutions around the globe.  Sanofi, Empowering Life"}