{"jobID": "2628685937", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist, Shopper", "companyRating": "3.4", "companyInfo": {"Website": "www.instacart.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Consumer Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "151000", "jobDescription": " Instacart is building the best way for people anywhere in the world to shop for groceries. Since Instacart started in 2012, weve launched same-day delivery in 200 US markets. We are laser focused on delivering groceries from your favorite stores right to your door. We now cover over 60% of US households and aim to have 80% coverage by the end 2018that's 90 million households! From a technology point of view, the platform is complex, rapidly scaling and processing millions of transactions in real-time all of the time. Our technology coupled with operational expertise enables Instacart to deliver fresh groceries in as little as an hour. This is a difficult problem to master and we are making it happen. Every day, we solve incredibly hard problems to create an experience for our customers that is absolutely magical.  As an data scientist on our rapidly growing data team, you will have the opportunity to make a large impact on the business. You will be responsible for identifying key metrics, conducting deep and rigorous tests and analysis and delivering insights to the wider organization.  You will be embedded in the shopping logistics team and tackle ambitious projects with a team of experienced product managers and engineers. The teams goal is to continuously improve Instacarts marketplace and shopping efficiencies. Some projects include: Using statistical modeling and inference to understand shopper behavior and quantify opportunities for improvementDesigning and analyzing A/B experiments to improve the shopper experienceCollaborating with product managers, engineers, and designers to inform and drive your teams product roadmapEmpowering data-driven decision making with interactive dashboards and tools The ideal candidate has the following qualifications: 2+ years of experience or equivalent in conducting quantitative research, preferably at a start-upExpertise in wrangling large datasets (SQL, Hive, or Spark)Effective data visualization skills (Tableau, Looker, or D3.js)Solid programming skills for statistical analysis (Python or R)A passion for leveraging data for business impactA high sense of urgency and ownershipGrowth mindset; the ability to thrive in a dynamic and collaborative environmentNice to havePrior experience in logistics and marketplace systemsETL and data pipeline development experienceAdvanced degree in statistics or other quantitative fieldBenefitsTalented and collaborative coworkers who will both push and support youMarket competitive salary, equityMedical, dental, vision benefits and 401(k) retirement planTake what you need vacation (and we really mean it)16 weeks maternity leave / 8 weeks paternity leave so you can truly bond with your childComplimentary Instacart Express membership"}