{"jobID": "2827889187", "jobLocation": "San_Francisco_CA", "jobTitle": "Marketing Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.gtsrecruit.com", "Headquarters": "Karachi, Pakistan", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job CategorySales  Job Details  Marketing Analytics team at Salesforce provides actionable, timely intelligence to support marketing and sales efforts at Salesforce. The Senior Data Analyst role reports to Marketing Data Scientist, and works closely with other Data Science and Data Analytics teams. Responsibilities:Build data analysis products using Salesforce internal and external datasets.Visualize data for dashboards and reports.Collect data from various source systems using FTP, SQL and other relevant technologies.Perform basic statistical analysis using descriptive measures such as central tendency, dispersion and skewness.Communicate analytics findings to the stakeholders in written and spoken format.Perform data formatting as required to join data from different sources.Prepare data for analysis by duplicate/missing data detection. Classify and store datasets for future use.Become expert in the tools and data sources supporting Marketing Analytics and Reporting.Be willing to take on analysis tasks with progressively increasing complexity.Experience:Motivated self-starter able to work independently and with ability to keep up in a fast-paced environment.Bachelor's degree in Business Administration or Data Analytics / Statistics, Master's degree a plus.Understanding of data visualization principles, basic statistics and iterative data analysis.Comfortable with different computer operating systems.Some experience with, and willing to learn more about relational databases such as Oracle, MySQL or SQL Server.Data manipulation, reporting and visualization tools, such as Business Objects, MS Excel, Google Sheets.Experience with Salesforce products a plus. Posting Statement  Salesforce.com and Salesforce.org are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Headhunters and recruitment agencies may not submit resumes/CVs through this Web site or directly to managers. Salesforce.com and Salesforce.org do not accept unsolicited headhunter and agency resumes. Salesforce.com and Salesforce.org will not pay fees to any third-party agency or company that does not have a signed agreement with Salesforce.com or Salesforce.org.  Pursuant to the San Francisco Fair Chance Ordinance and the Los Angeles Fair Chance Initiative for Hiring, Salesforce will consider for employment qualified applicants with arrest and conviction records."}