{"jobID": "2719964099", "jobLocation": "Woburn_MA", "jobTitle": "Preschool Teacher", "companyRating": null, "companyInfo": {"Website": "www.artisanchildcare.com", "Headquarters": "Woburn, MA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " This is a PART TIME position (15-20hrs / week). Available shifts are approximately 8am-11am daily, or approximately 3pm-6pm daily. Teachers at Artisan are the life-blood of our program and our most valuable asset. All candidates in this field know that choosing a career in Early Childhood Education is both highly challenging and also highly rewarding! We reward that dedication with a very competitive salary and benefits package as well as an understanding of the work/life balance that all employees face. Teachers are responsible for all aspects of their students' classroom experience, as well as partnerships with parents. Curriculum development, classroom management, parent relations and record keeping are all part of this job. At Artisan, teachers are supported in these duties by both an administrator as well as a dedicated director.JOB RESPONSIBILITIES-Create a nurturing, respectful, and safe classroom environment that responds to the needs of each student.-Ensure that students are meeting developmental expectations and collaborate with parents to help increase student achievement.-Model lifelong learning and meet professional development requirements.-Assist in the efficient and effective management of the classroom.QUALIFICATIONS FOR PART TIME:  -High School Diploma/GED required -DEEC Certification preferred -6+ months experience working with children in some capacityCOMPANY INFORMATION Artisan Childcare Center provides high quality early childhood education with a strong emphasis on the arts, primarily music. We serve children ages 6 weeks through 6 years of age. Each child at Artisan receives a daily music lesson. We offer a rewarding and supportive environment within a unique workplace. Artisan offers great benefits and career development opportunities at our growing company. Join a childcare center that values creativity, diversity, respect of children and professionalism. "}