{"jobID": "2767292843", "jobLocation": "Redmond_WA", "jobTitle": "Intern opportunities for students: User experience", "companyRating": null, "companyInfo": {"Website": "www.microsoft.com", "Headquarters": "Redmond, WA", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (MSFT) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Amazon, Apple"}, "estimatedSalary": null, "jobDescription": " Microsoft’s mission is to empower every person and every organization on the planet to achieve more. Our culture is centered on embracing a growth mindset, a theme of inspiring excellence and encouraging teams and leaders to bring their best each day. We believe we should each find meaning in our work and we ensure employees have the freedom and the reach to help make a difference in the world. We are looking for candidates who are:Team Players: driving digital transformation with our customers is a team sport. We need teammates who can stay maniacally focused on our customers' satisfaction while operating in a highly-collaborative, matrixed global organization.Growth Mindset: your life is truly about learning-it-all. You approach every new piece of information, knowledge, and competency with insatiable curiosity. Ultimately, you're open to the ideas of others, where the success of others does not diminish your own.Relentlessly Resourceful: you have the drive to overcome any obstacle in your work.Customer Obsessed: you learn about your customers and their businesses with a beginner's mind and then bring solutions that meet their needs.Pure Challenge: demonstrated desire and ability to readily take on complex challenges and work towards solutions to seemingly unsolvable problems.Passion for Technology: you're deeply motivated by the incredible opportunity of how technology can inspire and ignite change and renewal. Applications to these opportunities are considered for all available User Experience intern roles including the ones described below, depending on education level and/or location. To be considered for an internship or college student position, you need to be enrolled full-time as a student majoring in an applicable field. User experience designer Innovate and improve some of the most popular software products in the world. Our mission is to think end-to-end about the user experience, both broadly and deeply. Giving end users an experience without problems isn’t good enough; we want the experience to be immersive and pleasing for each and every customer. We need to know our users and understand their perceptions, desires, needs, frustrations, environments and problems related to Microsoft devices and services User experience researcher Our mission is to think end-to-end about the user experience, both broadly and deeply. Giving end users an experience without problems isn’t good enough; we want the experience to be immersive and pleasing for each and every customer. We need to know our users and understand their perceptions, desires, needs, frustrations, environments and problems related to Microsoft devices and services. We need people who are passionate about finding creative ways to evangelize the rich research data we have to both internal and external audiences, and who want to drive the results of those communications to the final experience.Responsibilities"}