{"jobID": "2782580582", "jobLocation": "Burlingame_CA", "jobTitle": "SQL Data Analyst", "companyRating": "4.2", "companyInfo": {"Website": "www.g2llc.com", "Headquarters": "Bellevue, WA", "Size": "51 to 200 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "43000", "jobDescription": "About LCI: LCI is an industry leader at analytical and technological services to the financial industry. Founded over 25 years ago, we handle over 1.3 billion accounts a year for the world's leading lenders, servicers, and debt buyers. We specialize in solutions for bankruptcy, at-risk consumer behavior, and the financial account life cycle. Our unique high-tech approach allows us to build software and services that are more cost-effective, and provide higher returns, than others in our industry. Lifestyle at LCI: LCI has an innovative, entrepreneurial structure, with great opportunities as a rapidly growing company. About the job: You will be leading and executing high impact project. You will be working with the largest bankruptcy database nationwide and present findings to senior management.  You will join the Data Quality Assurance team and ensure the success of the Company by assisting in the delivery of our products and services to our clients, through the operational processing of various systems.  You may be working closely with project leaders, clients, and other business stakeholders. You may manage/participate in multiple projects requiring coordination with other teams. What we're looking for:0-2 years of data analysis experience, preferably leveraging MS SQL ServerEntry-level knowledge of MS SQL Server (SSMS, SSIS, and SSRS), SQL/Transact-SQL, and data analysisAdvanced Excel and PowerPoint: VBA would be a plusExperience in manipulating data, extracting desired information and experience in presenting data to senior managementSelf-motivated and able to manage multiple projects simultaneouslyStrong organization skills, attention to details and ability to multi-taskStrong analytical and problem solving skillsStrong written and verbal communicationCreative and out of the box thinkingKnowledge of legal Documents would be a plus"}