{"jobID": "2804006885", "jobLocation": "Seattle_WA", "jobTitle": "PHARMACY INTERN - OUTPATIENT (TEMPORARY / HOURLY)", "companyRating": null, "companyInfo": {"Website": "www.washington.edu", "Headquarters": "Seattle, WA", "Size": "10000+ employees", "Founded": " 1861", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " University of Washington  Location Seattle, Washington, United States  Salary Not specified  Job type Employee  Category Administrative / Office,Health Care  Job status N/A  Posted on Jun 04, 2018  Job code ******  Print  PHARMACY INTERN - OUTPATIENT (TEMPORARY / HOURLY) Req #: ****** Department: UW MEDICAL CENTER PHARMACY Job Location: UW Medical Center Posting Date: 05/09/2018 Closing Info: Open Until Filled Salary: $18.69 to $28.35 per hour Union Position: Yes This classification is governed by a negotiated labor contract and is subject to union shop provisions. For more information about union shop provisions, visit Union Information Shift: First Shift Join our award-winning team at University of Washington Medical Center (UWMC). Among the top medical centers in the United States, and ranked as the number 1 hospital in Washington State, as rated by U.S. News & World Report 2016-2017 'America's Best Hospitals', UWMC prides itself on compassionate patient care as well as its pioneering medical advances. UWMC is operated by the University of Washington (UW) and serves as a training site for UW's School of Medicine.  UW Medical Center Pharmacy is looking for an outstanding TEMPORARY/HOURLY PART-TIME PHARMACY INTERN (PHARMACY TECHNICIAN 1) to join our Outpatient Pharmacy team! This individual will assist the Pharmacist in professional activities and perform assigned tasks. Additionally, the person in this role may engage in preparation and packaging of medications and other pharmacy-related functions.  Outpatient Pharmacy Intern duties include, but are not limited to, the following:  Perform certified order entry of medication orders into the ambulatory pharmacy computer system.  Fill prescriptions.  Utilize ScriptPro Central for filling, labeling, and batching.  Assist with online processing of prescription orders.  Assist patients with new prescriptions and refills.  Determine payment method.  Assist patients with alternate sources of payment.  Perform charging and billing functions.  Assist in preparation of compound pharmaceuticals under the direct supervision of a Pharmacist.  Direct clinical inquiries requiring a Pharmacist's professional judgment.  Perform other duties as assigned.  Competitive candidates will be able to effectively triage and communicate with patients, have the ability to perform computer entry of prescriptions and charge/credit data, and perform bulk compounding of pharmaceuticals from a formula, under the supervision of a Pharmacist. Inherent to success in this position are organizational skills and use of professional judgment.  This position provides opportunities to work in an area that promotes a place where healing, science, and learning come together, the opportunity to network with other practitioners in different specialties, and to continuously learn about new cutting-edge therapies. REQUIREMENTS:  Six months of experience as a Pharmacy Assistant or equivalent education/experience.  Legal requirement: State of Washington Pharmacy Technician certification. ADDITIONAL DEPARTMENTAL REQUIREMENT: Currently enrolled in University of Washington School of Pharmacy. DESIRED: Ability to fill medication orders accurately.  Ability to assist customers in filling prescriptions and assisting with online orders.  Ability to accurately maintain inventory of pharmaceuticals and supplies. CONDITION OF EMPLOYMENT: UW Medicine is committed to being a drug-free workplace. We require a pre-employment drug screen. The use of marijuana for medical purposes accompanied by a prescription, even if permitted by state law, will not be considered acceptable for purposes of explaining a positive lab test result for marijuana.  The University of Washington is a leader in environmental stewardship & sustainability, and committed to becoming climate neutral.  The University of Washington is an equal opportunity, affirmative action employer. To request disability accommodation in the application process, contact the Disability Services Office at ************ / ************ (tty) or **********. Apply for this job  Print"}