{"jobID": "2829400160", "jobLocation": "Renton_WA", "jobTitle": "Logistics Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.paccar.com", "Headquarters": "Bellevue, WA", "Size": "10000+ employees", "Founded": " 1905", "Type": " Company - Public (PCAR) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "56000", "jobDescription": " Company Information  PACCAR is a Fortune 500 company established in 1905. PACCAR Inc is recognized as a global leader in the commercial vehicle, financial, and customer service fields with internationally recognized brands such as Kenworth, Peterbilt, and DAF trucks. PACCAR is a global technology leader in the design, manufacture and customer support of high-quality light-, medium- and heavy-duty trucks under the Kenworth, Peterbilt and DAF nameplates. PACCAR designs and manufactures advanced diesel engines and also provides customized financial services, information technology and truck parts related to its principal business.  Whether you want to design the transportation technology of tomorrow, support the staff functions of a dynamic, international leader, or build our excellent products and services - you can develop the career you desire with PACCAR. Get started!  Division Information  PACCAR Parts  PACCAR Parts is the global provider of aftermarket parts and services to support Kenworth, Peterbilt, DAF and TRP dealers around the world. This includes 18 distribution centers globally that support 2,200 dealerships and over 1,000,000 customers. Aftermarket support includes world class customer centers that deliver industry leading uptime in conjunction with our outstanding supply chain that delivers record levels of inventory availability for dealers and customers.  Requisition Summary  The Sr Logistics Data Analyst is responsible for evaluating and executing a logistics plan in a vendor managed environment for product lines and parts related to the PACCAR Parts Direct Ship Program (DSP), supports PDCs with carrier management, and supports freight claim management. Grade and salary will be dependent upon experience with data analysis, leadership and project management.  Job Functions / Responsibilities Supports dealers in freight loss and damage recovery with freight carriers.Supports PDC's with specialized carrier movement and carrier-related issues affecting their areas, including freight claims, when requested.Responds to new business requirements with cost-effective processProvides analysis on transportation requirements.Collaborate with key personnel in Marketing, Sales, MDI and dealerships to drive DSP program performance achieving Division growth and performance targets.Optimize carrier selection and freight schemes for all DSP product offerings across multiple suppliers and customers.Evaluate and optimize freight asociated with all programs through ongoing analysis to ensure success.Support Demand Planning Group and MDI Group to improve Direct Ship product on-shelf retail availabilityCoordinate Volume Sales, suppliers, and dealerships to ensure orders are delivered in a timely manner.Lead and support Six Sigma process improvements to enhance productivity, transit time, and freight cost for DSP product.Develop and maintain metrics, processes, and documentation to achieve division on time delivery performance goals.Communicate issues, progress and results for the Direct Ship Program with other departments and management. Support corrective actions to achieve department goals.QualificationsBachelors Degree in Business or related field is requiredLogistics experience preferredMinimum 2 years professional work experience, preferably in analytical and supplier/carrier management functions. 1-2 years of analytical reporting preferred.Intermediate Excel and Access skills are requiredKnowledge of truck parts and componentsDatabase ExperienceStrong mathematical skills a huge plusSix Sigma TrainingExcellent interpersonal and issue resolution skillsProject Management Skills Additional Job Board Information  This position does not provide visa sponsorship.  PACCAR is an Equal Opportunity Employer/Protected Veteran/Disability.  Nearest Major Market: Seattle  Nearest Secondary Market: Bellevue  Job Segment: Database, Logistics, Claims, Retail Sales, Data Analyst, Technology, Operations, Insurance, Retail, Data"}