{"jobID": "1655674840", "jobLocation": "Redmond_WA", "jobTitle": "Finance Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.poshconsulting.net", "Headquarters": "Redmond, WA", "Size": "501 to 1000 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "60000", "jobDescription": "Title-Finance Data AnalystLocation-Redmond, WADuration-3-6 MonthsResponsible for interpreting customer signed documents (paper contracts, statements of work, work orders) and ensuring that the data entered into our billing tools aligns. The tools to be used are Changepoint and Compass which are internal Microsoft tools that automate core business processes for Microsoft Consulting Services (MCS), including managing customer contracts, engagements and projects. Analyzes variances, trends and provides decision support for internal customer.The role is heavily focused on auditing large volumes of data, manually reviewing the documents and comparing them to what is in the tools. The role also deals with the field when there are discrepancies between what is in the contract and what is in Changepoint. There are times when the field may be unresponsive, so having a strong background in customer service is critical. The data this role deals with primarily impacts the scorecard and so there are times when it’s challenging to gain momentum. Ideal Candidate:Microsoft experience is necessary for this role, with Changepoint/Compass experience desirableVery comfortable with Excel and working with numbers – Create and manipulate pivots, creating reports by connecting to external data sources, comfortable explaining reports (how to use them).Organized/detail-oriented with solid follow-up skillsStrong communication skills – the individual would be working with the resources in the field to identify and correct issues in the Changepoint tool.Comfortable with ambiguity as it pertains to auditing data against business requirements."}