{"jobID": "2812811951", "jobLocation": "Cambridge_MA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.roseit.com", "Headquarters": "Chesterfield, MO", "Size": "1001 to 5000 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Position Title: Data AnalystPosition Number: 288039Location: Cambridge, MADesired Skill Set:Data Analysis, SQL, Safety, PharmaceuticalPosition Description: **C2C and STEM-OPT are not available** *Only U.S. Citizens and those authorized to work in the U.S. can be considered as W2 candidates.** Principal Analyst  Contract Start: ASAP  End Date: 05/19/2019  Location: Cambridge, MA 02141  JOB TITLE: Principal Analyst, Global Drug Safety (GDS) Information Management  This position is an experienced analyst on the Global Drug Safety (GDS) Information Management team. The Principal Analyst provides direct technical /data management support to ensure information entered and retrieved from the Global Drug Safety systems is consistent, accurate and complete. The GDS Principal Analyst is a technical expert in GDS for data management, reports and queries. Requirements:Ensure GDS data outputs are complete and accurate.Drive the standardization of GDS information management (including implementation of self-service tools) to ensure consistency across solutionsFoster collaboration with stakeholders to ensure accurate interpretation of the business need.Support Information Management tasks/projects requiring technical expertise with respect to Global Drug Safety.Support cross-functional information management initiatives.Skills Required:Experience with Argus SafetySQL programming/queryingCustom report design/development preferably using a structured tool (e.g. Cognos, Business Objects).Excellent analytical, decision-making, organizational, managerial, interpersonal and communication skills.In-depth knowledge of key aspects of Global Drug Safety processes.Ability to interpret and apply regulatory requirements.Technical understanding of Pharmacovigilance systems and software development methodologies.Knowledge of systems integration and data interchange standards.Proficient in the use of one or more of the leading Information Management Systems or programming environments.Experience with analysis and support of continuous process improvement initiatives.Current with industry developments, trends and opportunities.Education and Experience Requirements:BA/BS and 5 years’ experience or equivalent.3+ years Systems and/or Information Management experience in the Pharmaceutical, Device or Biotech industries or equivalent (Sponsor, CRO or combination).1+ years of project leadership and global and/or cross-functional collaboration experience."}