{"jobID": "2826773116", "jobLocation": "Milpitas_CA", "jobTitle": "Senior IT Operations Engineer", "companyRating": "3.4", "companyInfo": {"Website": "www.sonicwall.com", "Headquarters": "Milpitas, CA", "Size": "1001 to 5000 employees", "Founded": " 1991", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " WatchGuard Technologies, Fortinet, Check Point Software Technologies"}, "estimatedSalary": "111000", "jobDescription": "Senior IT Operations Engineer SonicWall is commencing a new chapter in history with an exciting lineup of network security products, and we want the best people to be part of our team. We are in a dynamic phase operating as an independent private company after Francisco Partners, a leading global private equity firm, acquired SonicWall from Dell. The senior ITOPS position provides challenging opportunities with a cohesive world-class team in our fast-paced, dynamic and fulfilling work environment! The position is located in Milipitas, CA.  Primary Responsibilities Recruit, mentor, train a cross-functional and high performance ITOps Engineering team.Work collaboratively and cross functionally to build and support cloud and DevOps adoption.Work closely with development teams to understand new project architectures and system components. Plan, execute, and document tests to verify and validate system integration, reliability, and performance.Persistent attention to detail while thinking strategically and executing tactically with high level of comfort working in a dynamic ambitious environment.Work cross-functionally to develop solutions to support the daily needs of a rapidly growing business.Identify, prioritize and resolve issues with a creative and cooperative spirit.  Minimum RequirementsMin 7+ years experience in mission critical data center operations with the ability to work independently and as part of a team.Experience with best practice datacenter operation processes, methodologies, and tools.Strong engineering experience in Linux and Windows administration.Strong experience in networking: firewalls, routers, switches, load balancers.In depth knowledge in virtualization technologies with VMWareExperience with public cloud technologies such as AWS and AzureStrong experience in programming languages such as bash, python/perlExperience working with devops tools like Jenkins, ansible.To be successful, you will need to be able to multi-task in a high/low volume environment and manage competing priorities.Strong written and verbal communication, team oriented while being able to work independently, self-starter and motivated.  SonicWall is an Equal Opportunity Employer committed to the principle of equal employment opportunity for all employees. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally protected characteristics."}