{"jobID": "2365824134", "jobLocation": "San_Jose_CA", "jobTitle": "OTR Class A CDL Refrigerated Truck Driver", "companyRating": null, "companyInfo": {"Website": "www.driveforprime.com/?r=glassdoor", "Headquarters": "Springfield, MO", "Size": "1001 to 5000 employees", "Founded": " 1970", "Type": " Company - Private", "Industry": " Transportation & Logistics", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Refrigerated drivers at Prime are responsible for safely operating a tractor trailer and delivering freight on-time to our customers across the United States and Canada. As a driver in the Refrigerated Division, you will need to be prepared to haul a variety of products including beef, pork, beer, produce, frozen foods, floral goods, and more. Over-the-road truck drivers will get home every 3 to 4 weeks. You earn 1 day of home time for every week that you are out on the road as a company driver. Whether you want to be a company driver or an independent contractor, Prime has options and profitable opportunities for you. With 24/7 support and late-model equipment, we will provide you the tools to succeed. We offer Freightliner, Peterbilt, and International models available with APUs and 1500-watt inverters. All company and lease trucks also come with an Omnitracs Qualcomm unit for electronic logs, messaging, and navigation. The Prime Mobile App is an additional tool available to help our drivers be more effective with their time by allowing you to not be tied to your truck and Omnitracs Qualcomm unit inside your truck. Eligible Applicants:  Experienced Class A CDL Drivers Recent CDL School Graduates Non-CDL Holders interested in Prime Student Driver ProgramCompany Driver Pay & Benefits Solo Pay = .41 cpm plus additional 5 cents per mile for a lightweight tractor Team Pay=.47 cpm split plus additional 20 cents per mile for all miles above 3,000 per week Health, life, dental, and vision insurance options 401(K) Plan with company match Paid Vacation Fuel Mileage Bonus - Earn up to 8.2 additional cents per mile for exceeding 7.75 mpg Tuition Reimbursement - Up to $1500 for CDL School graduates, if qualified Driver Referral Program - Earn money for referring new drivers to Prime Ability to become a CDL Instructor or Trainer & earn more moneyIndependent Contractor Benefits Earn 72% of revenue as a Refrigerated Contractor Volume discounts on fuel, tires, parts, & service Quarterly Mileage Incentives Longevity Incentives Rider Policy Passenger Policy (no cost) Pet Policy (no cost) Home Policy allows you to go home whenever you chooseQualifications Must be at least 21 years old with a valid license from your state of permanent residence including a tanker endorsement  Be able to obtain United States Passport, TWIC Card, and Hazmat Endorsement Have a verifiable work history and references Have an acceptable motor vehicle record Must be able to pass a physical compliant to the Federal Motor Carrier Safety Standards If any failed or refused drug or alcohol related test, must provide proof of completed Substance Abuse Counseling to consider Must present one or more of the following: US Passport, State Certified Copy of Birth Certificate, or INS paperwork that shows US Citizenship or that permanent residence has been established and is current An affirmative answer to the questions regarding criminal record will not automatically result in the denial of employment. An applicants criminal record will be evaluated based on the job for which the applicant has applied."}