{"jobID": "2819292227", "jobLocation": "Berkeley_CA", "jobTitle": "Identity Data Analyst (7198U", "companyRating": "4.1", "companyInfo": {"Website": "www.universityofcalifornia.edu", "Headquarters": "Oakland, CA", "Size": "10000+ employees", "Founded": " 1868", "Type": " College / University", "Industry": " Education", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "66000", "jobDescription": " The University of California, Berkeley, is one of the world's most iconic teaching and research institutions. Since 1868, Berkeley has fueled a perpetual renaissance, generating unparalleled intellectual, economic and social value in California, the United States and the world. Berkeley's culture of openness, freedom and acceptanceacademic and artistic, political and culturalmake it a very special place for students, faculty and staff.  Berkeley is committed to hiring and developing staff who want to work in a high performing culture that supports the outstanding work of our faculty and students. In deciding whether to apply for a staff position at Berkeley, candidates are strongly encouraged to consider the alignment of the Berkeley Workplace Culture with their potential for success at http://jobs.berkeley.edu/why-berkeley.html.  Application Review Date  The First Review Date for this job is: 6/22/2018  Departmental Overview  Information Security and Policy (ISP) provides policy and security oversight for institutional information and campus IT resources, providing a structured approach to information risk management for the campus. The CalNet / Identify and Access Management is one of the teams within ISP.  The Identity Data Analyst plans, designs, develops, implements and administers databases to acquire, store and retrieve identity data. The analyst ensures accuracy and completeness of identity data from systems of record. They establish and maintain data security; migrate data to new systems; optimize data system performance; develop database dictionaries, specifications, tables and data elements. The analyst also investigates and remedies errors in upstream data. ResponsibilitiesApplies professional identity data management concepts and defined IT and identity management policies and procedures in completing assignments.Researches, gathers and analyzes information requirements and documents them using formal data definition techniques and naming standards for all identity and access management projects.May interview subject matter experts and technical personnel; researches relevant identity and access management literature and information standardsParticipates in the preparation of logical data models, dimensional data models and information schemas for the identity management integration component of a project.Under general supervision, designs and implements capture of metadata from identity and access management processes such as software design and database management.Assists with implementation of identity and access data flow business processes. Required Qualifications Requires knowledge of identity data management systems, practices and standards.Must have knowledge relating to logical data design, identity data design, identity data integration or the management of web content or other unstructured data.Must be able to prepare simple data models under guidance of more senior professionals.Must be familiar with important types of data models, such as logical/relational models, dimensional models and document models.Strong analytical and design skills, including the ability to abstract information requirements from real-world processes to understand information flows in computer systems.Must understand the unique nature of identity data flows.Critical thinking skills and attention to detail.Good interviewing and listening skills.Written and oral communication skills.Bachelors degree in related area and/or equivalent experience/training Salary&Benefits;  For information on the comprehensive benefits package offered by the University visit:  http://ucnet.universityofcalifornia.edu/compensation-and-benefits/index.html  How to Apply  Please submit your cover letter and resume as a single attachment when applying.  Conviction History Background  This is a designated position requiring fingerprinting and a background check due to the nature of the job responsibilities. Berkeley does hire people with conviction histories and reviews information received in the context of the job responsibilities. The University reserves the right to make employment contingent upon successful completion of the background check.  Equal Employment Opportunity  The University of California is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status. For more information about your rights as an applicant see: http://www.eeoc.gov/employers/upload/poster_screen_reader_optimized.pdf  For the complete University of California nondiscrimination and affirmative action policy see:  http://policy.ucop.edu/doc/4000376/NondiscrimAffirmAct"}