{"jobID": "2517281772", "jobLocation": "Boston_MA", "jobTitle": "Site Reliability Engineer", "companyRating": "4.6", "companyInfo": {"Website": "www.ginkgobioworks.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "91000", "jobDescription": " Ginkgo Bioworks is YCombinator's first biotech company and has raised over $150M:https://techcrunch.com/2016/06/08/ginkgo-bioworks-grabs-100-million-in-financing-to-buy-a-whole-lot-of-synthetic-dna/  Our mission is to make biology easier to engineer. We engineer organisms to address fundamental challenges the world is facing today. Ginkgo bioengineers make use of an in-house organism foundry to engineer new organisms for making natural products, pharmaceuticals, biofuels, and more. We're making the code base, compiler and debugger for life. We're looking for programmers interested in developing the organism design toolchain - the CAD, CAM and CAT tools that will define how bioengineers design organisms at scale.  Ginkgo's programming languages of choice are Ruby, Python, Javascript/HTML and DNA, but you must be someone who loves writing elegant code in any language. Most importantly, you should be passionate about making biology the next engineering discipline. The 20th century was all about bits and the awesome technology of computers. The 21st century is all about atoms and the awesome technology of biology. Ginkgo is at the forefront of this revolution.ResponsibilitiesAs a Site Reliability Engineer at Ginkgo you will help us robustly scale our infrastructure.Some of your responsibilities include:Assisting developers and IT in devops operations, helping to scale and deploy our systems both locally and in the cloud.Assisting developers apply best practices to ensure fully working test, training and production environments using Gitlab-CI, Docker, Ansible.Designing, building and maintaining monitoring and testing infrastructure for our systems.Work closely with IT and Software Engineers to resolve outages and implement changes to avoid future issues.Evaluate and leverage AWS, Azure and Google cloud and deployment technologies.Automate tasks to ensure repeatability.RequirementsBS degree in software engineering or related field.Proven devops track recordConsistent track record for troubleshooting and resolving challenging problems in a timely manner and proactively implementing strategies to avoid them.Strong architectural level of understanding of software.Strong Linux, Docker, MySQL, Postgres and networking experience.Familiarity with infrastructure automation tools such as Ansible and Puppet.Impeccable organizational and communication skills.Experience with cloud technologies such as EC2 and S3 a plus.Excited to work with the best scientists and engineers to develop the foundry - the code base, compiler and debugger for life To learn more about Ginkgo, check out some recent press:  http://www.cnbc.com/2017/05/15/ginkgo-bioworks-2017-disruptor-50.html  http://www.wired.com/2015/11/move-over-jony-ivebiologists-are-the-next-rock-star-designers/  http://fortune.com/2015/07/23/ginkgo-bioworks/  https://medium.com/the-os-fund/a-new-era-of-industrial-engineering-using-biology-dd4571aa6d27  We also feel it’s important to point out the obvious here – there’s a serious lack of diversity in our industry and it needs to change. Our goal is to help drive that change. We hope to continue to build a company whose culture promotes inclusion and embraces how rewarding it is to work with engineers from all walks of life. Making biology easier to engineer is a tough nut to crack - we can’t afford to leave any talent untapped.  It is the policy of Ginkgo Bioworks to provide equal employment opportunities to all employees and employment applicants."}