{"jobID": "2747943606", "jobLocation": "Austin_TX", "jobTitle": "AI/DL Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.apninc.com", "Headquarters": "Newark, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " AI/DL Data Scientist (DTJP00006059) Duration: 0-9 months Location: Austin, TX 78753Job Description: The AI/DL Data Scientist will help design and implement AI/DL systems for a wide variety of use cases and applications. This position will be responsible for tracking and projecting the evolving needs of the AI community as well as understanding AI systems architectures, hardware technologies evolution, emerging technology opportunities, and the maturing AI applications software landscape and horizon.Primary responsibilities:Assist customers in POCs by developing and optimizing Deep Learning models for GPU environments. Help design and deploy solutions for the leading customersDevelop optimized model repository for common use cases and verticals (finance, life sciences, etc) on Dell + NVIDIA technology to provide a starting point for customersFamiliarity with the Frameworks such as Tensorflow, py torch, mxnet, caffe 2 etc.Develop best practices for GPU training at scale ( Example: Optimal usage of tensorcores and FP16 training, Using TensorRT for model optimization before deployment)Demonstrate Dells thought leadership in the AI space by publishing in peer-reviewed forums and blogs, collaborating with university partners and other companies to expand the companys knowledge of emerging techniques in data analysisMaintain constant awareness of the emerging AI techniques and will participate in research activities to maintain technical vision and perspective.Python programming experienceProvides technical and consultative support on solutions opportunities.Participates as needed in pre-sales qualifications and delivery of technical architectural design, strategies and plans for engagements; works on single workstream within broader project; support and instruct less experienced co-workers through formal training or on-the-job mentoring; trains customer personnel."}