{"jobID": "2695173522", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist", "companyRating": "4.8", "companyInfo": {"Website": "www.coffeemeetsbagel.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "140000", "jobDescription": "At the core of Coffee Meets Bagel is our matching algorithm. Our users love how CMB curates perfect matches for them every day. We are looking for someone with experience building data models from large datasets in order to take our matching algorithm to the next level as we continue to grow our userbase!As the very first Data Scientist at CMB, you will be responsible for improving our algorithm and building models to solve other business critical needs (e.g. predictive model for customer satisfaction, automated detection of inappropriate or low quality images). This will involve refining existing models and proposing new ones. You will work closely with our CEO, CTO and the data team to implement your ideas and deploy them to production.For anyone who is driven by challenging data problems, this position offers a unique opportunity. There is still a lot of room for innovation in this domain, and we welcome bold new ideas for how we can match people more effectively.This position is a full-time position based at the CMB HQ in downtown SF right by Union Square!You should have:Masters, PhD, or equivalent industry experience in a scientific field3+ years of industry experience implementing machine learning algorithms with large datasetsExpertise in at least one statistical or data analysis tool such as Python / Pandas, R, MATLAB, etc.Experience writing production code OR working with other engineers to implement algorithms in a production environmentPassion for building and delivering high quality products, a deep sense of ownershipA passion for startupsRemote folks are most certainly welcome!Bonus:Expertise / experience with PythonExperience with recommendation systemsExperience with Redis / ElasticCache or ElasticSearchExperience with distributed computing systems (e.g. Spark)Engineering experience, particularly at large scalePassion for helping people fall in love :)Check out our tech engineering blog to get a closer look at what we've got going on under the hood :)"}