{"jobID": "2814253784", "jobLocation": "New_York_NY", "jobTitle": "Financial Services Consultant - Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.sia-partners.com", "Headquarters": "Paris, France", "Size": "501 to 1000 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "70000", "jobDescription": " Company DescriptionSia Partners is a unique management consulting firm and a pioneer of Consulting 4.0  Through unparalleled industry expertise, we deliver superior value and tangible results for our clients. Our innovative approach has led us to welcome the disruption of AI, invest in our Data Science field, and develop consulting bots. Additionally, we provide our clients with a broad range of traditional management consulting services. Sia Partners is run by an international management team and organized as a partnership.  Sia Partners is a unique global management consulting firm with 1050 passionate consultants delivering superior value and tangible results to our clients across 21 industry sectors and service teams.Job Description Participating in client projects with leading financial institutions and banks, for their operational strategy management, data quality, data migration, regulatory & compliance advisory, change and transformation projects. Be an active team member and provide support to Senior Consultants and Managers for the successful execution of client projects.Performing industry research to identify opportunities for growth within existing businesses or expansion into new areas.Research, identify and develop new opportunities/initiatives for growth within working groups and actively contribute to business development initiatives within existing business or expansion into new areas.Work closely with our international offices and leverage our global and diverse network to take part in cross-selling initiatives Share consulting best practices with the team and conduct/receive business trainings.QualificationsBachelors degree or equivalent in Economics, Business, Engineering or Science from a top University.0 4 years of experience or internship experience in Financial Services sectors.Expert level knowledge of Microsoft Excel and PowerPoint.Outstanding written and oral communication skills.Ability to work independently and take full ownership and responsibility.Ability to thrive in a fast-paced, high-pressure environment.Limited travel - Clients based in NYC, JC, CT. Additional InformationEEO GUIDELINES: All your information will be kept confidential according to EEO guidelines.  Sia Partners is an equal opportunity employer. At Sia Partners, we are committed to treating all Applicants and Associates fairly based on their abilities, achievements, and experience without regard to race, national origin, sex, age, disability, veteran status, sexual orientation, gender identity, or any other classification protected by law."}