{"jobID": "2802820976", "jobLocation": "Seattle_WA", "jobTitle": "Data Analyst", "companyRating": "4.5", "companyInfo": {"Website": "www.nytec.com", "Headquarters": "Kirkland, WA", "Size": "201 to 500 employees", "Founded": " 1975", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "71000", "jobDescription": "Embrace your independence and make a difference. As a contractor, you can choose your clients and the projects you work on, but you also need to constantly cultivate your next project. At Nytec, we’ve created an ecosystem where you can increase your value as a consultant, while working on a variety of projects at top technology companies. Our talented people have solved tough problems and created innovative products at the smallest to the largest and most cutting-edge companies in the world. With Nytec, you’ll create a variety of industry- and life-changing products for our clients, using the latest technologies, across an array of industries and applications. Fun projects and meaningful work – you need to work with Nytec! About Nytec Nytec is an award-winning, integrated consulting firm with over 40 years of success turning ideas into first-of-a-kind, lifestyle technology products for tier-one global and Fortune 100 companies. Our world-class designers, engineers, and manufacturing experts translate complex problems into compelling, simple solutions that deliver the ultimate user experience. Nytec’s industry-leading Client Services provide customizable talent solutions to satisfy staffing requirements, either onsite, offsite, or project-based.  Title: Data Analyst Location: Seattle, WA  Duration: Long-Term Contract ResponsibilitiesInterface with other technology teams to extract, transform, and load data from a wide variety of data sources using SQL and RedshiftInterface with business customers to gather requirements.Model data and metadata to support ad-hoc and pre-built reporting.Own the design, development, and maintenance of ongoing metrics, reports, analyses, dashboards, etc. to drive key business decisions.ecognize and adopt best practices in reporting and analysis: data integrity, test design, analysis, validation, and documentation.Tune application and query performance using Unix profiling tools and SQL.Analyze and solve problems at their root, stepping back to understand the broader context.Use data mining, model building, and other analytical techniques to develop and maintain customer segmentation and predictive models to drive the business.Respond to high priority requests from senior business leaders.Learn and understand a broad range of client data resources and know when, how, and which to use and which not to use.Continually improve ongoing reporting and analysis processes, automating or simplifying self-service support for secondary datasetsHelp answer challenging business questions for implementation through technology ultimately delivered to business and operations partners.Enable effective decision making by retrieving and aggregating data from multiple sources and compiling it into a digestible and actionable formatPartnering with other analysts and engineers to build analytical solutions to deliver on business goalsPropose and implement business metrics for senior management reviews and work with business intelligence and data engineers to design and develop data infrastructure to support business growthEnable effective decision making by retrieving and aggregating data from multiple sources and compiling it into a digestible and actionable formatPerform deep-dives to find the root causes behind variances of key parameters over a given time-periodLead forecast accuracy analysis while accounting for thousands of data points from separate data sourcesImplementing a wide range of data technologies (e.g. Oracle, Redshift, EMR, SQL, Quicksight and Tableau etc.)Work closely with various stakeholders to define the information needed and how best to present itSupport program leadership with timely recurring and ad-hoc analysisPartner with diverse global teams including Software Engineering teams, and infrastructure Capacity Planners and Logistics.Drive continuous process improvement and automationDemonstrate good judgment in solving problems and recognizing risks before they become problemsDiving Deep to solve complex problems and assist Business Partners in developing a “path to green”.RequirementBachelor’s degree in Computer Science, Mathematics, Statistics, or other technical field.Strong Proficiency with SQL, data warehouse and statistical analysis tools.Experience building tables and ETLs.Coding proficiency in at least one modern programming/scripting language (e.g. Python, Ruby, etc.)Experience with business intelligence reporting and data visualization tools (e.g. Tableau, Quicksight, Datanet, SQL, etc.)Experience with Redshift or similar OLTP database architecture.Experience building on the AWS Cloud, including EC2, S3, and EMRAbility to work effectively with both technical resources and non-technical business owners; gather and translate end user requirementsProven ability to operate successfully and independently in a fast-paced, highly ambiguous environmentProven problem solving skills, attention to detail, and exceptional organizational skillsMaster’s degree in BI, Finance, HRIT, Engineering, Statistics, Computer Science, Mathematics, Finance or related field required Demonstrated ability to frame complex analytical problems and extract insights that led to tangible business resultsExperience developing, implementing, and supporting software solutionsHigh-level knowledge of various machine learning techniques and key parameters that affect their performanceUnderstanding of data warehousing, data modeling concept and building new DW tablesDirect experience using business intelligence reporting tools (OBIEE, Business Objects, Cognos, Tableau, Quicksight, Cubes, etc.)Working knowledge with RedshiftAdvanced understanding of best practice analysis, programming and visualization techniques.Experience and ability to effectively gather operational performance data, information from multiple data sources and systems then present that data and information in a logical and pragmatic wayKnowledge of data warehousing conceptsSQL and Data WarehousingBI reporting and data visualizationProblem solving/attention to detailBenefitsNytec offers a full benefits package (at most major partners) including sponsored health (medical/dental/vision) plans.Referral Bonuses - Receive $500 for referring a candidate that is hired, $500 for referring a job that is filled by Nytec, or $1000 for referring the job and the candidate.To Apply Visit nytec.com/careersor email your resume and the job title tocareers@nytec.comQuestions? Call us at (425) 947-2676 "}