{"jobID": "2814252024", "jobLocation": "New_York_NY", "jobTitle": "Product Strategist", "companyRating": null, "companyInfo": {"Website": "www.two-bulls.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " At Two Bulls we look at the landscape of emerging technology and create innovative products that become tomorrow’s solutions. We are a band of roughly 80 people with offices in Melbourne, New York, and Berlin. We ship early and we ship often, believing that experiences are better off in the hands of real people than on a whiteboard. We make important things with a playful mindset and attract brands who share our ambitions.  Products we’re working on include: a global telco’s smart cities infrastructure initiative, a multi-country industrial IoT system that connects and monitors remote sensors over a low power, wide-area LAN (LPWAN), a European high-end kitchen provider’s smart appliance ecosystem. In addition, we’re rethinking & building new technology to improve the school food ecosystem for a company that covers over half of all the children in America. For each of these platforms, we connect intelligent edge devices to each other, to the cloud, and to front-end interfaces on mobile, web, and custom hardware.  We develop strategy, design, and systems in house as fully-integrated teams. We push our clients to embrace the latest technologies and embrace an Agile methodology so that we can deliver client value iteratively. The Role: A Product Strategist at Two Bulls provides our clients Product Owners with formal product management support. They guide a development engagement towards a successful client outcome, while reflecting commercial and product priorities back to the development team. The role is part agile product manager, part innovation consultant, and part client outcomes manager. The Product Strategist is more concerned with business outcomes of the software delivery, rather than the delivery itself. Lead product discovery and innovation workshops either as part of the Inception client-onboarding process or ad hoc as required by a delivery engagement.Define clear and feasible success metrics that can guide the client and the development team alike, and allow Two Bulls to demonstrate clear value.Steer the client organization to a clear Product Owner relationship with the development team, and support that Product Owner throughout the engagement with formal product management skills and consulting advice.Work with the Delivery Manager/Lead and the multi-disciplinary Development Team to maintain client priorities and manage towards client success.Maintain a clear expectation with the client as to their outcomes and codify this in an agreed and current Release Plan at all times during the engagement.Work with the Accounts team to ensure that the Two Bulls account direction and client product strategy are aligned at all times.Monitor Two Bulls expenses and staffing costs related to the delivery of the engagement.Requirements3+ years experience in working with clients in product development & consulting, with an understanding of what makes a digital product which is second to none3+ years in managing or ideating large scale, technically complex, and designerly productsExperience as a client-facing engagement or project manager in an agile delivery team context, in either consulting or product development contextsAdditional experience in delivery team coaching, business analysis, user research or experience design is well regardedBenefits Based in our DUMBO studio, we are excited by beautiful solutions, solving difficult problems, creating great user experiences and being at the forefront of everything that we do.  Two Bulls will provide you with a small company work culture, big company clients, and the ability to work on cutting-edge projects. You will be working within a team of highly talented engineers and designers to build amazing products.  Your work can range from helping large corporate clients look to deliver their customers innovative product experiences, through to working in conjunction with innovative start-ups to realize their new product ambitions."}