{"jobID": "2687345633", "jobLocation": "New_York_NY", "jobTitle": "Tax Senior Manager/Experienced Manager -- Transaction Services Practice", "companyRating": "3.5", "companyInfo": {"Website": "www.mazars.com", "Headquarters": "Paris, France", "Size": "501 to 1000 employees", "Founded": " 1921", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "141000", "jobDescription": "Job Description: Mazars USA LLP is a full service accounting, tax and consulting firm with headquarters in New York City and offices in New Jersey, Long Island, Chicago, Pennsylvania, and Los Angeles. The firm is organized by market segments and service lines, and is actively looking to grow its presence in strategic markets, including geographical presence, service expertise (advisory), and industry specific expertise (including infrastructure, renewable energy and utilities). As part of our Tax Financial Advisory Services and Energy and Utilities practices’ growth strategies, we have an excellent opportunity for a Tax Senior Manager/ Experienced Manager in our New York City office. These practices deal with the lifecycle of a transaction as investors, developers, and operators need timely advice and insight to help maximize value, mitigate risk, and make informed investment decisions.  Mazars USA LLP is the independent U.S. member firm of Mazars Group, one of the top Global Accounting and Advisory firms. Through the Mazars Group, the firm services very sophisticated clients with international reach, providing unique opportunities and exposure for our U.S. staff to be involved with client matters both inbound and outbound. JOB RESPONSIBILITIES: As part of our dedicated team, the candidate will complement the existing skills and experience required to assist our clients at all stages of their transactions. Clients that are serviced by our dedicated team are located throughout the country and the world. Qualified candidates must be able to provide an exemplary level of technical tax experience in structuring of transactions from a tax perspective. The detailed day-to-day responsibilities are: Be an integral part of the firm’s Financial Advisory and Infrastructure, Energy, and Utilities Practices, working in conjunction with the Tax Partners and Senior managers in our New York City officeProvide fluid due diligence from a tax perspective on project, and merger and acquisition transactionsProvide timely communication focusing on key risksBe able to create tailored solutions and deliver industry expertise to our clientsAct as a technical resource on all tax issuesRespond to inquiries from other offices, both nationally and internationallyBe responsible for developing and maintaining superior client relationshipsShare responsibility for all business aspects of client relationships including billing, collecting and maintaining profitabilityParticipate in strategic marketing and branding initiatives to increase revenuesConduct and present in technical sessions, focusing on recent developments to professionals throughout the firm, and to clients and prospectsActively market the firm and its activities, development, and services on social media sites to professional networkSupport marketing initiatives of the firm to increase the firm’s Financial Advisory Practice activitiesDevelop outside relationships with the goal of fostering business development opportunities through involvement in leadership roles in professional groups, community service, and personal relationships with other professional advisors such as attorneys, investment advisors, insurance advisors, and private bankersDevelop, educate and train staff and assist in the growth and development of the Firm’s professional team membersJOB REQUIREMENTS:Bachelor’s Degree in Accounting, CPA certification, Advanced tax degree or JD is desirable8+ years of relevant tax experience at a public accounting firmBroad exposure to federal and state income taxationExcellent skills in one or more of the following areas:Project Finance related services, including:P3 project tax due diligence and advisoryRenewable energy transaction tax and tax incentive due diligence and adviceReviewing tax equity partnership agreements within renewable energyBuy side and sell side Tax Due Diligence for Mergers and acquisitions - Federal, State and InternationalTax Structure AnalysisCommunication skills, knowledge and experience to optimize a client tax position to achieve tax efficiencies on transactions - --Tax Structuring for various Merger and Acquisitions or Project Finance transactionsBe able to work at the fast pace of deals, providing timely communication on key risks and potential issues"}