{"jobID": "2729437645", "jobLocation": "Cambridge_MA", "jobTitle": "Manager/Associate Director, Pharmacovigilance Scientist", "companyRating": "5.0", "companyInfo": {"Website": "www.sagerx.com", "Headquarters": "Cambridge, MA", "Size": "201 to 500 employees", "Founded": " 2010", "Type": " Company - Public (SAGE) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": "General Scope and Summary SAGE Therapeutics is searching for a creative, resourceful, integrative thinker for an important role that is responsible for providing pharmacovigilance and signal detection expertise through contributions to clinical and post market pharmacovigilance deliverables and activities. The Manager, PV Scientist will provide scientific/clinical expertise, strategic input, and support for deliverables and activities associated with signal management activities, safety and benefit-risk evaluations for assigned products, management of potential safety issues for assigned products, evaluation of databases for safety signals, and drafting of responses to regulatory inquiries on product safety issues including oversight of aggregate reporting for all products within the product group. Demonstrated ability to assimilate clinical data, and through its analyses/review be able to make crisp assessments and be able to communicate this effectively both verbally and in writing plays a critical capability in this job. Roles and ResponsibilitiesProduct Oversight:Overseeing aggregate reports production, clinical trial activities, signal management, literature review, and ad hoc regulatory responses for assigned product group.Lead product safety surveillance activities for assigned product(s)during all phases of the product life-cycle (includes both investigational and marketed products).Serve as key analytic and safety support lead in close collaboration with the product safety physician/medical monitor.Investigational Product (s) in development:Participate in protocol design, safety CRF development, safety monitoring plan, support of DSMB activities, coding review as well as SAE reconciliation activities.Review study protocols, statistical analysis plans and other clinical study-related documentsReview standard design of tables, figures, and listings for safety data from clinical studies.Key safety representation in Integrated Safety Summary reviews, which may include narrative generation, review and approval for filing related activitiesManage updates to Investigator Brochure, Company Core Safety Information and other Reference Safety Information.Production of Aggregate Reports and Risk Management Plans:Demonstrate effective leadership skills with cross functional partners to ensure that safety data analyses/authorship for ad hoc queries and aggregate reports are of high quality and are completed and submitted according to required timelines.Lead PSUR/PADER/DSUR strategy and timelines with key stakeholders and vendor.Support RMP updates and REMS reports as appropriate for the assigned product (s).Signal Detection and Management:Implement signal detection strategy approved by VP of Drug Safety and Pharmacovigilance (DSPV) and Safety Review Committee (SRC).Review adverse event data, literature, and other safety-relevant data for the purpose of signal detectionPrepare review of potential safety signals for VP of DSPV.Responsible for signaling review and the coordination and documentation of all signal review activities with the product safety physician and product complaint staff. This includes performing signal investigations and drafting signal investigation reports.Coordinate ad hoc safety query or health hazard evaluation response plan for analysis in conjunction with the product safety physician, biostatistics and others as needed, including performing analysis and drafting of query responses for review and finalization.Support in preparing Safety Committee slides and documenting of meeting minutes.Departmental procedures and Compliance:Ensure PV activities remain compliant with evolving regulations, that respective SOPs and work instructions regarding signaling, ad hoc and aggregate safety and risk management plans are adequate.Assisting in the successful implementation, execution and maintenance of safety processes and systems that conform to the company’s business strategy, industry standards and compliance with global regulations.Keeping updated on relevant regulations associated with the above activities. Contributes to initiatives for process improvement and cross-product process consistency.Facilitate inspection readiness activities, if applicable.Experience, Education and Specialized Knowledge and Skills Must thrive working in a fast-paced, innovative environment while remaining flexible, proactive, resourceful and efficient. Excellent interpersonal skills, ability to develop important relationships with key stakeholders, good conflict management and negotiation skills, ability to analyze complex issues to develop relevant and realistic plans, programs and recommendations. Demonstrated ability to translate strategy into action; excellent analytical skills and an ability to communicate complex issues in a simple way and to orchestrate plans to resolve issues and mitigate risks. Advanced degree (RN, PharmD, NP, PhD, MD, MPH, NP, DVM with specialty board certification)3 -5 years of experience in drug safety serving in a PV Scientist or similar role.Demonstrated experience in analysis and interpretation of medical and scientific data and excellent verbal and written skills.Demonstrated ability to work effectively either independently or collaboratively in a team environment (including Safety, Clinical Development, Medical Affairs, Clinical Operations, and Regulatory), as well as with external colleaguesStrong organizational, project management and leadership skills: Leads and conducts, independently and/or collaboratively, all aspects of substantive projects such as signaling, authoring of aggregate data reports, and responses to regulatory agency requests. Oversees and mentors less experienced PV Scientist staff.Applies clinical judgment to interpret case information.Familiarity with pharmacovigilance and drug development, including knowledge of applicable clinical trial safety regulations and post-marketing safety regulations. Includes familiarity with case processing, expedited reporting rules, and safety database concepts.Experience working with all levels of management and consulting with key business stakeholders. An ability to influence for greater outcomes.Strong team player that has a customer service approach and is solution oriented.Attention to detail and the ability to work individually, within a multi-disciplinary team, as well as with external partners and vendors.Possesses strong written and verbal communication skills.Embrace our core values: Put People First, Do Big, Be Accountable, Grow through Learning and Change, and Work Fun.Excitement about the vision and mission of Sage"}