{"jobID": "2808064789", "jobLocation": "Bothell_WA", "jobTitle": "Summer Intern", "companyRating": null, "companyInfo": {"Website": "www.eurofins.com", "Headquarters": "Hasselt, Belgium", "Size": "5001 to 10000 employees", "Founded": " 2000", "Type": " Company - Public (ERF) ", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Eurofins Frontier Global Sciences is an advanced analytical laboratory specializing in mercury, trace metals and metals speciation analysis. Since 1991, our expertise in measuring trace metals in air, soil, water, sediments and tissues has produced innovative and reliable analytical methods that are utilized around the world. It is our mission to provide our clients the highest quality, scientifically sound/defensible and cost-effective trace metals and metals speciation analytical data. Frontier is proud to support private industry, government agencies and the regulatory community with metals analysis methods that we served to both help develop and validate, many of which are now EPA methods serving clients across the United States.  Eurofins Frontier Global Sciences is searching for a Summer Intern in Bothell, WA.  The Summer Intern will work in the Laboratory assisting the Analysts, Quality Assurance, Shipping and Receiving and the Research Groups with calibrations, sample transport, data scanning and general laboratory maintenance. Summer Intern responsibilities include, but are not limited to, the following:Maintains and calibrates analytical balances Receives and unpacks client samples daily, verifies accuracy of receipt against chain of custody (COC), matches it to the corresponding project and notes discrepancies. Maintains and calibrates pipettes, including cleaning, oiling and ensuring that pipettes are in good working order. Assists with inventory tracking and maintenance. Labels client samples to correspond with lot number and places them in the proper storage area to maintain sample integrity daily. Assists in locating samples or delivers samples to appropriate lab daily to improve productivity and ensure that sample hold times will not be exceeded. Ensures that the lab is maintained and kept clean. Assists with sample disposal. Demonstrates proactive commitment and adherence to industry and company safety regulations and QA procedures. Scan data and reports to the servers. Other duties as assigned by group leader. The ideal candidate would possess:Excellent verbal, written and interpersonal communication skills helpful Strong computer, scientific, and organizational skills Excellent attention to detail Typing and ten key helpful Ability to work independently and as part of a team, self-motivation, adaptability, and a positive attitude Ability to learn new techniques, perform multiple tasks simultaneously, keep accurate records, follow instructions, and comply with company policies Basic Minimum Qualifications:High school graduate Some college courses Ability to work flexible hour schedule Authorization to work in the United States indefinitely without restriction or sponsorship  Position is seasonal working 8 hours a day (exact times/days TBD) Candidates currently living within a commutable distance of Bothell, Washington are encouraged to apply. To learn more about Eurofins, please explore our website www.eurofinsus.com.Eurofins is a M/F, Disabled, and Veteran Equal Employment Opportunity and Affirmative Action employer."}