{"jobID": "2607466906", "jobLocation": "New_York_NY", "jobTitle": "Ambulatory Academic Primary Care Physician", "companyRating": null, "companyInfo": {"Website": "www.pagny.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OverviewPhysician Affiliate Group of New York (PAGNY) is comprised of nearly 4,000 physicians and healthcare professionals who provide services to NYC Health + Hospitals, the largest public health system in the United States. Our doctors are highly skilled professionals with outstanding credentials who deliver the highest level of quality healthcare to patients throughout New York City.  In partnership with NYC Health + Hospitals/Jacobi our teams accommodate more than 325,000 outpatient visits, more than 100,000 emergency room visits and more than 20,000 inpatient admissions annually. NYC Health + Hospitals/Jacobi is renowned for The Trauma Center, staffed to treat any traumatic injury or illness, the fully accredited Breast Health Center, and The Burn Center, with more than 40 years of work in burn care. The hospital also serves patients of many other needs. The hospital maintains an academic affiliation with Albert Einstein Medical College of Yeshiva University.ResponsibilitiesJob summary: The Jacobi Medical Center Academic Ambulatory Internist of the Adult Primary Care Service provides the full scope of adult ambulatory services which fall under his/her field of training including but not limited to diagnosis, treatment, coordination of care, preventive care and health maintenance to adult and limited groups of adolescent patients. In addition, the Academic Ambulatory Internist, trains and supervises medical trainees and students and mid-level providers in the scope of adult ambulatory services. The scope of services includes, but is not limited to, primary care, geriatrics, medical consultation, med psych, palliative care, and selected inpatient care to support the overall missions of the Medical Center and Department of Medicine to address the needs of the population served in individualized, collaborative or population frameworks. The Academic Ambulatory Internist may be directed by the Chairman of Medicine or designee or the Ambulatory Medical Director of Operations to perform other duties in accordance with facility, corporate, funding and regulatory requirements. Essential characteristics:Embracing a culture of patient centered care, safety and accountability,Adherence to the highest standards of medical practice, ethics and professionalism,Collaborative interdisciplinary teamwork.Transformative continuous quality improvement to meet changing healthcare needs.Duties and responsibilities include but are not limited to:Clinical Responsibilities:Flexible 40 hours/week including evenings and/or weekends,Off-hours coverage on a rotational basis,Medical evaluation of patients including history, physical examination, diagnostic testing, treatment plan, counseling, and referrals based on standards of care and EBM, for effective longitudinal, continuity and episodic care across the lifespan.Complete, reflective and timely documentation in the EMR.Prescription of medication and DME in accordance with New York State statutes.Review and sign off laboratory/study results with timely follow-up.Teaching/Program Development:Develop and implement Palliative care program in the outpatient setting.Create curriculum around end of life discussion (advanced directives/healthcare proxy) for the residency program.Educate and supervise trainees at all levels and collaborate with mid-level providers through recruitment, didactic activities, precepting, and mentoring."}