{"jobID": "2643846981", "jobLocation": "Austin_TX", "jobTitle": "Software Engineer Intern", "companyRating": "3.9", "companyInfo": {"Website": "www.vauto.com", "Headquarters": "Oakbrook Terrace, IL", "Size": "501 to 1000 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": "DescriptionThis is an internship position with  vAuto, a business unit of Cox Automotive, located in Austin, TX.  We are seeking college level  software developers to work with a team to design and develop new products and  to develop enhancements and extensions to existing systems using C# and  ASP.Net.  vAuto, Inc. is an industry leading  innovator and provider of automotive software solutions. Since the company was  founded in 2005, vAuto has launched several first in industry innovations,  including its current suite of solutions that deliver a better way to price,  appraise and stock pre-owned vehicles. We are a fast-moving technology company  specializing in web & mobile application solutions for the Automotive  Industry.QualificationsPursuing a BS in Computer  Science or related degree12 months experience in object  oriented programming (Java, C++, C#, or similar), in a job or through  school work.Understanding of programming  and database conceptsFamiliarity with web  technologies (JavaScript, HTML, Ajax)Demonstrated experience  developing applications.Ability to work well in a  team-oriented environmentHigh energy, confident,  ambitious and self-motivated individual.Must be an effective  communicator.Experience with C#, ASP.NET,  nHibernate, SQL, PL-SQL, Oracle, Visual Studio, IIS a plus, but not  required.About Cox Automotive Cox Automotive is transforming the way the world buys, sells and owns cars with industry-leading digital marketing, retail, financial and wholesale solutions for consumers, dealers, manufacturers and the overall automotive ecosystem worldwide. The Cox Automotive family includes Autotrader®, Dealer.com®, Dealertrack®, Kelley Blue Book®, Manheim®, NextGear Capital®, vAuto®, VinSolutions®, Xtime®, incadea®, and a host of other brands. With a complete and connected view of the automotive ecosystem, Cox Automotive is a global company connecting people, cars and capabilities with services that link the automotive value chain. Cox Automotive is a subsidiary of Cox Enterprises. For more information about Cox Automotive, visit www.coxautoinc.com.  Cox is an Equal Employment Opportunity employer - All qualified applicants/employees will receive consideration for employment without regard to that individuals age, race, color, religion or creed, national origin or ancestry, sex (including pregnancy), sexual orientation, gender, gender identity, physical or mental disability, veteran status, genetic information, ethnicity, citizenship, or any other characteristic protected by law.Organization: Cox Automotive Primary Location: US-TX-Austin-10415 Morado Cir Employee Status: Regular Job Level: Intern/Co-op Shift: Day Job Travel: No Schedule: Full-time Unposting Date: Ongoing"}