{"jobID": "2646861981", "jobLocation": "Redwood_City_CA", "jobTitle": "Executive Director", "companyRating": null, "companyInfo": {"Website": "www.peninsulacollegefund.org", "Headquarters": "Redwood City, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Education", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Peninsula College Fund (PCF) is seeking an experienced executive to lead the organization through its next phase of development. PCF has built a solid foundation over the past few years and is looking for a strong, skillful leader who will preserve the core mission and programming while guiding the organization through its next phase of organizational infrastructure, program innovation and impact, and resource development in support of sustainability and growth efforts. PCF, founded in 2005, makes college graduation a reality for low-income, first-generation college students from the mid-Peninsula and east San Jose. Our comprehensive, wrap-around program includes four-year college scholarships, one-to-one mentoring, college and career success workshops, and assistance in securing career ladder summer internships. RESPONSIBILITIES: Reporting to the Board of Directors, the Executive Director will provide strategic leadership and direction of PCF and will ensure effective partnerships with key allies and stakeholders, support a diversified fundraising strategy that includes individual, corporate, and foundation support, and serve as a strong connector who can align staff, Board, and volunteers and supporters around PCF’s mission, vision, and values.The Executive Director will: · Be responsible for ensuring that the organization raises sufficient revenue to sustain annual operations and programs. Relevant tasks include creation and oversight of a long-term sustainability strategy, identifying and responding to grant opportunities, donor cultivation and stewardship, developing and leading creative campaigns and events. · Oversee day-to-day operations, including budget preparation, fiscal accountability, staff supervision and development, marketing and communications.  · Work collaboratively with the Board to meet the goals and objectives of the organization and support the Board as it evolves from hands-on management to a governance and oversight role. · Serve as the primary staff spokesperson for PCF, clearly articulating its mission, vision, goals and impact. Develop and maintain relationships with mission-aligned organizations and institutions. · Establish and oversee internal systems that support the work of program staff.  · Work with the Board to define organizational strategy, committing to measurable goals and practical and realistic implementation plans. Desired Professional Attributes:  A person of character, integrity, cultural competency, and a commitment to the principles and values of PCF, the ED will: · Provide inclusive, respectful leadership as PCF continues to define its commitment to help young people achieve their education and career goals. · Actively employ a proven track record in fundraising, including prospecting and cultivating individual donors, and creating and implementing a broad scope of income development opportunities in support of an annual budget of $1,000,000+.  · Be a confident professional who brings creativity, vision and energy to the position.  · Have experience in building strategic relationships with educational institutions and similar organizations, encouraging collaboration and consensus building. · Be able to prioritize tasks and objectives in a resource-constrained environment, be a flexible problem solver, and understand the need to effectively strike a balance between sustainability and growth, deliberation and action, independence and collaboration.  · Demonstrate a can-do, entrepreneurial mindset and be able to inspire others toward achieving goals. · Ability to model the highest degree of professionalism and transformational leadership style.  · Possess strong personal communication skills; be an active listener and work closely with people from diverse backgrounds. Career path leading to this position:  Ideally, the candidate will have proven knowledge and leadership experience working in the nonprofit sector. S/he will have at least 5 years of relevant senior leadership and managerial experience, preferably as a nonprofit executive director, with a proven track record of achieving results efficiently, and working both independently and collaboratively. Demonstrated success and comfort with fundraising is essential, and experience with all aspects of grant applications is helpful. Candidates should be familiar with evaluation frameworks and be committed to measurable outcomes. The successful candidate will have a passion for advancing opportunities for under-served young people, and experience with social justice issues, training programs, or social enterprise initiatives would be beneficial. The ideal candidate will be a dynamic, results oriented individual with strong relationship development skills who has shown success in leading organizations to their next level of growth. Education:  A Bachelor’s degree is required. An advanced degree in a related field, such as education or management, and/or relevant professional experience related to enhancing opportunities for youth is desirable. Compensation:  Salary and benefits commensurate with qualifications and experience. HOW TO APPLY:  Please send your resume and a cover letter, with salary requirements, indicating how your experience relates to the position to jobs@peninsulacollegefund.org and include “ED Search – “last name”” in the subject line. We will reach out to you if you are selected for the next step of the interview process. No phone calls please.  PCF is located at the Sobrato Center for Nonprofits – Redwood Shores. More information on PCF is available at www.peninsulacollegefund.org The Peninsula College Fund is an equal opportunity employer and makes employment decisions on the basis of qualifications. Policy prohibits unlawful discrimination in any employment decision based on pregnancy, childbirth or related medical conditions, race, religious creed, color, national origin or ancestry, physical or mental disability, medical condition, marital status, age, sexual orientation or any other basis protected by federal, state or local law or ordinance or regulation. "}