{"jobID": "2724389784", "jobLocation": "Seattle_WA", "jobTitle": "Research Scientist Intern - Deep Learning", "companyRating": null, "companyInfo": {"Website": "www.curacloud.net", "Headquarters": "Seattle, WA (US), WA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Career Summary: CuraCloud is developing a new generation of AI-enabled diagnostic services for health systems and cancer researchers, with a focus on medical image analysis and cancer genomics testing. We are looking for talented deep learning & computer vision students to help build our cloud-based data analysis platform. This is a paid position. Responsibilities: As part of our core research and development team, you will: Design and develop cutting-edge deep learning algorithms applicable to one or more of the following: medical image data analysis, computer vision, NLPDirectly participate throughout the entire design processDesign and perform experiments to continually refine and enhance our deep learning technology solutionsWork closely with Research Scientist team members to write papers and patentsQualifications:Ph.D /MS student in Computer Science, Electrical Engineering, Statistics or related disciplineRelated research or internship experience in Computer Vision, Machine Learning and Image UnderstandingFamiliarity with Deep Learning Libraries (e.g. TensorFLow, Pytorch)Strong verbal and written communication skillsStrong presentation skillsAbility to quickly learn new skills and knowledge in a fast-paced work environmentDesired:Experience in C++ is a plusAbout CuraCloud: CuraCloud is a fast-growing AI healthcare services company with an R&D; center in Seattle and offices in Beijing and Shenzhen. We are working with healthcare delivery organizations, university-based researchers, innovative radiology practices and IT services providers around the world to make a positive impact on healthcare. You will work with organizations and individuals who see the future of AI in the medical industry, and want to create new solutions for their patients.  CuraCloud Corporation is an equal opportunity employer and all qualified applicants will receive consideration for employment. We will provide competitive salaries and benefits.  This is a paid internship."}