{"jobID": "2824638295", "jobLocation": "San_Bruno_CA", "jobTitle": "Staff Data Scientist, Supply Chain Strategy & Analytics", "companyRating": "3.2", "companyInfo": {"Website": "www.walmart.com", "Headquarters": "Bentonville, AR", "Size": "10000+ employees", "Founded": " 1962", "Type": " Company - Public (WMT) ", "Industry": " Retail", "Revenue": " $10+ billion (USD) per year", "Competitors": " Target, Costco Wholesale, Amazon"}, "estimatedSalary": "178000", "jobDescription": "Position DescriptionA Staff Data Scientist is responsible for analyzing large data sets, developing custom models and authoring deployable algorithms. Staff Data Scientists typically work within project teams to provide technical and analytical leadership. Staff Data Scientists are often responsible for building large data sets from multiple sources. Staff Data Scientists are also responsible for researching new trends in the industry and utilizing up-to-date technology and analytical methods in their assigned projects.Minimum QualificationsBachelor's in Engineering, Mathematics, Computer Science, Supply Chain, Transportation or related field AND 3 years experience in engineering, logistics, mathematics, computer science, supply chain, transportation or related field OR 5 years experience in engineering, logistics, mathematics, computer science, supply chain, transportation or related field OR Master's degree in Engineering, Mathematics, Computer Science, Supply Chain, Transportation or related field and 1 year experience in engineering, logistics, mathematics, computer science, supply chain, transportation or related field. Additional Preferred Qualifications1 year experience leading project teams to solve problems.1 year of leading teams or supervisory experience.2 year experience working on international projects.2 years Wal-Mart experience leading project teams in engineering, information systems, distribution, logistics, replenishment, store operations, supply chain, transportation, strategy innovations, or international.2 years experience in retail.2 years experience managing multiple projects.2 years experience using Wal-Mart systems (for example, Clarity, REMEDY).2 years leading projects in engineering, strategy or innovations fields.Business proficiency in a second language (for example, Chinese, Japanese, Portuguese, Spanish). Company SummaryThe Walmart eCommerce team is rapidly innovating to evolve and define the future state of shopping. As the worlds largest retailer, we are on a mission to help people save money and live better. With the help of some of the brightest minds in technology, merchandising, marketing, supply chain, talent and more, we are reimagining the intersection of digital and physical shopping to help achieve that mission.Position SummaryThe Staff Data Scientist, Supply Chain Strategy & Analytics, will lead various projects that deliver future operational strategies across Walmarts e-Commerce Supply Chain. The Staff Data Scientist will be primarily responsible for leading advanced analytical modeling, simulation and optimization projects sponsored by the senior executive team. He/she will support our strategic plans, both creating and implementing strategic operational improvements to enable expansion of our businesss scope and scale. This role is part of the Walmart eCommerce Supply Chain Strategy & Analytics team a future-focused, action-biased, data-driven department chartered with improving all aspects of the supply chain from network design to inbound/outbound transportation and multi-channel initiatives by leveraging big data. This is a high-impact and high-visibility role within the organization with expectations to deliver immediate results. Responsibilities include:Manage and execute entire projects from start to finish including cross-functional project management, data gathering and manipulation, analysis and modeling, and communication of insights and recommendations.Demonstrate a high degree of originality and creativity when developing solutions to improve existing business processes within supply chain utilizing methods such as statistical analysis, regression modeling and optimization.Work independently to manage multiple projects at once while ensuring deadlines are met and data output is accurate and appropriate for the business. Must also be able to deal with ambiguity and make independent decisions about what data and approach is best for the task at hand.Build scalable and complex supply chain models and processes to optimize supply chain strategies with goals to deliver excellent customer experience while balancing operating cost and asset efficiency.Identify areas of opportunity and drive results partnering with cross functional partnersDevelop relationships with Wal-Mart functional areas in San Bruno, CA, as well as in Bentonville, AR, to identify best practices, solicit input/data, coordinate inter-disciplinary initiatives and to gather support for recommendationsPotential projects can include:Create models to analyze the supply chain network need to support future sales growth with scenario modeling capabilities to understand the sensitivity to multiple variables; provide insight to Logistics executives on opening, closing, or repurposing DCs; analyze impact to multiple networks simultaneously; and create scenario analyses extending beyond the five-year modeling horizonDevelop optimization logic and tool to determine truckload lane strategy for outbound transportation balancing cost and SLA requirementsDevelop logic and tool to determine optimal share of volume to process in various customer buying channels in the company balancing inventory availability, capacity, cost, and service level requirements"}