{"jobID": "2809395336", "jobLocation": "Ipswich_MA", "jobTitle": "Senior Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.ebscoind.com", "Headquarters": "Birmingham, AL", "Size": "201 to 500 employees", "Founded": " 1944", "Type": " Company - Private", "Industry": " Media", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "66000", "jobDescription": " EBSCO Information Services (EIS) provides a complete and optimized research solution comprised of e-journals, e-books, and research databases — all combined with the most powerful discovery service to support the information needs and maximize the research experience of our end-users. Headquartered in Ipswich, MA, EIS employs more than 3,300 people worldwide. We are the leader in our field due to our cutting-edge technology, forward-thinking philosophy, and top-notch workforce. EIS, a division of EBSCO Industries Inc., based in Birmingham, AL, is ranked in the top 200 of the nation’s largest, privately held corporations according to Forbes magazine. EBSCO is a company that will motivate you, inspire you, and allow you to grow. We are looking for the best. If you are too, we encourage you to explore our unique opportunities. Mission: EBSCO’s Content Management team is looking for a bright, motivated individual who has a passion for data, innovation, problem-solving, and continuous improvement. We are all about finding ways to acquire, process, create and build content for EBSCO’s products that surpasses expectations for both our internal and external customers. The ideal candidate has a curious nature and is not content with the status quo, always seeking ways to innovate and automate day-to-day operations that allows us to deliver quality content faster. The Senior Data Analyst is a natural problem-solver with excellent analytical skills, who is comfortable navigating large data sets from multiple sources and clearly connects technology solutions with measurable business value. We are a team of thinkers and doers with a passion for transforming data into actionable business results. The position is a great fit for a motivated self-starter who loves driving sustainable solutions for real business problems.    Primary Responsibilities:Develop intimate knowledge of the Content Management business strategy, business model, and processes to identify improvement opportunities and value-added capabilitiesLead and participate in process design and improvement initiatives: evaluate business user requirements, manage project scope, determine priorities, ensure efficient and on-time delivery of initiative tasks and milestones, monitor progress and outcomes, manage customer expectations on resultsProvide and support the implementation of business solutions that meet long-term business strategies by building relationships and partnerships with key business groups and stakeholdersIdentify, create and facilitate process design changes by conducting business and systems process analysisIdentify opportunities to automate manual processes, integrating new systems, technology and processes with existing onesSolve complex problems where analysis of situations or data requires an evaluation of multiple dependent and co-dependent factorsUtilize various software tools for data extraction, analysis, reporting and monitoring, ensuring data sources and metrics are reliable, repeatable and validTell the story of business trends, patterns, and outliers through rich visualizationsSupport leadership and business teams with timely, recurring and ad-hoc reporting and analysis   Role Based Competencies:Analytical skills: Able to structure and process qualitative or quantitative data and draw insightful conclusions from it. Exhibits probing mind and achieves penetrating insights.Requirements Analysis: Gathers, organizes and evaluates any information or data needed as input from stakeholders to determine requirements and specifications.Technical Proficiency: Effectively applies technical knowledge to solve a range of problems. Works with others to develop technical solutions to new or highly complex problems that cannot be solved using existing methods or approaches.Continuous Improvement: Continually focuses on improving the responsiveness and quality of the solutions delivered. Seeks feedback to improve personal effectiveness.Strategic Thinking: Thinks broadly about process and generates innovative ideas as well as drives the implementation of new workflows. Determines opportunities and threats through comprehensive analysis of current and future trends.Problem Solving: Applies critical thinking and structured problem solving to address root causes. Proactively identifies and mitigates issues before they arise.Accountability: Holds self and other accountable for measurable, high-quality, timely and cost-effective results. Expects personal and team performance to be the best. Learns from mistakes.Self Managing: Exhibits strong organization and time management skills. Able to manage multiple projects.Relationship Building: Big picture, big team minded. Breaks down silos and successfully develops, maintains and strengthens partnerships with team members, customers and stakeholders.Facilitation: Creates a group environment that allows the group to effectively meet their objectives with clear thinking, good participation and buy-in from the participants.   Required Qualifications:Bachelor’s degree or equivalent years of experience5+ years’ experience in a business analyst role2+ years’ experience with Data Analysis – Must have proficiency with relational databases, SQL, Microsoft Excel2+ years’ experience working in an agile environment2+ years’ experience extracting and analyzing large data sets   Preferred Qualifications:1 year+ experience with Tableau or other data visualization software1 year + publishing industry work experience1 year + experience with process automation EBSCO Industries, Inc.is an equal opportunity employer and complies with all applicable federal, state, and local fair employment practices laws. EBSCO strictly prohibits and does not tolerate discrimination against employees, applicants, or any other covered persons because of race, color, sex (including pregnancy), age, national origin or ancestry, ethnicity, religion, creed, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class. This policy applies to all terms and conditions of employment, including, but not limited to, hiring, training, promotion, discipline, compensation, benefits, and termination of employment.  EBSCO complies with the Americans with Disabilities Act (ADA), as amended by the ADA Amendments Act, and all applicable state or local law."}