{"jobID": "2807992434", "jobLocation": "Brooklyn_NY", "jobTitle": "Business Office Associate", "companyRating": null, "companyInfo": {"Website": "www.isbrooklyn.org", "Headquarters": "Brooklyn, NY", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " School / School District", "Industry": " Education", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " International School of Brooklyn (ISB) is an independent, non-profit school that is known for its innovative and robust Nursery–8th Grade French and Spanish language immersion program and International Baccalaureate curriculum. The ISB learning experience is driven by six core values: inquiry-based learning, diversity, global curriculum, language immersion, community, and international mindedness. Dedication to these values enables ISB to develop each student’s creativity, critical thinking, global citizenship, and intercultural understanding. ISB seeks a Business Office Associate The Business Associate reports to the Director of Operations and Advancement and to the Controller and works with all constituents – students, parents, and teachers - in the International School of Brooklyn community in support of the school’s mission. The role of the Business Office Associate is to assist in coordinating School Operations logistics and some Business and Human Resources administration. Specifically, the Business Office Associate is responsible for:  Operations – rental relationships, oversee space reservations, manage emergency procedures logs  Business/Human Resources – maintenance of personnel files and HRIS systems, administration of benefits, staff on/off boarding, management of staff time-tracking  Reports to: Director of Operations and Advancement (for operations tasks) and to the Controller (for business tasks) Qualification requirements: Candidates should have 2 years experience working in a business or administrative office and understand the business and operations needs of a school. Candidates should also be able to maintain staff records and a knowledge of the school’s policies and benefits. This position requires the ability to manage HRIS databases and staff on/off boarding process. Strong communication and organizational skills are a must in this role. In order to be successful in this position, candidates must be able to work independently as well as on a team, manage multiple tasks and provide support to the business office and operations teams. Candidates should enjoy a collaborative work setting, value diversity and have experience working in a school setting. Fluency in French or Spanish is a plus. Duties include:OperationsManage relationships with rental vendors, including initial negotiations, contracts, insurance requirements, and space usage logisticsMaintain calendar of space usage and reservations, help coordinate event logistics (set up, break down, etc.) Maintain the emergency procedures log; ensure that protocols are followed (e.g. – fire drills, safety drills, etc.) Business Manage the administration related to employees (new hires, terminations, etc.) and maintain personnel files  Manage Visa tracking, maintenance of staff records and background checks  Maintain all necessary administration involved in hiring, change of status, terminations, etc.  Manage time and attendance modules of ADP/WorkForceNow  Administration of benefits  Maintain a thorough knowledge of the School’s benefits and policies  Coordinate the benefit enrollment process with help of insurance brokers (open enrollment and mid-year changes)  Provide an overview of all employee benefits and policies to employees and serve as point person for related questions  Oversee short term disability and PFL claims Manage staff onboarding process  Assist with the preparation and distribution of job offer letters  Post available positions on various platforms and assist in screening of applications and applicants when appropriate  Work with the Head of School and department heads to maintain job descriptions for all positions Other Maintain professional and technical knowledge by attending educational workshops and reviewing professional publications  Other duties as assigned by the Head of School  Support the school, its mission, and leadership Applying to this position: Interested candidates should email letters of interest and resumes to Natalie Judelson and Alan Sze at jobs@isbrooklyn.org."}