{"jobID": "2831302335", "jobLocation": "Carson_CA", "jobTitle": "Sales Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.lakeshorelearning.com", "Headquarters": "Carson, CA", "Size": "1001 to 5000 employees", "Founded": " 1954", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "62000", "jobDescription": "Sales Data Analyst Lakeshore Learning Materials is one of the premier manufacturers of educational materials for elementary programs, early childhood organizations and parents around the country. A multichannel organization with a strong sales division, thriving web business, catalogs and 60 store locations nationwide, Lakeshore has experienced continuous growth since its inception in 1954. We attribute our long-term success to the daily contributions of the remarkable individuals who make up our team.  We are currently searching for an experienced Sales Data Analyst to provide data management, reporting and analytical support for our Sales Analytics team. Under the direction of the Sales Analytics Manager, you will be responsible for helping Lakeshore meet its objectives in order to drive the growth and profitability of our business. Successful candidates will have previous experience with interpreting and analyzing data, advanced Microsoft Excel skills, a high focus on accuracy and data integrity, and outstanding problem-solving and communication skills. They will also enjoy a workplace that can swiftly change focus—and will possess the skills to quickly adapt to evolving priorities. This position is based at our corporate office located in Carson, CA. Responsibilities & RequirementsWork with technical data to extract, manipulate and analyze marketing campaignsReview data sets and reports for accuracy, validity and data integrityProvide detailed and accurate reporting (daily, weekly, monthly, quarterly and annually)Create, complete and manage ad hoc reporting requests in a timely mannerOrganize, analyze and interpret complex dataProvide actionable analysis that will improve the performance of our sales effortsAssist with the execution of campaigns, segmentation and targetingAssist with list execution as it relates to deduplication, merge/purge and maintenanceCommunicate effectively across all levels of management throughout Retail, Marketing, E-Commerce and other departmentsWork independently and as part of a team in a fast-paced environment while handling multiple projects and deadlines with superb accuracyWork flexible hours as neededPerform other duties and responsibilities as assignedQualifications3–5 years of experience in data, analytics, reporting or marketing preferredBA/BS in computer science, math, business information systems, database management or marketing is a plusKnowledge of relational database technology (SQL Server, Oracle, MS Access), database marketing/data mining analytical applications, math, statistics and MS Office applications. Will work in SQL database to develop list generation requirementsExperience with web analytics and business intelligence tools (Adobe, Google, QlikView)Strong understanding of Microsoft Office (Word, Excel, Publisher, PowerPoint and Outlook)Advanced knowledge of ExcelOutstanding problem-solving skills, high receptivity to feedback and a teamwork mentalityAbility to think critically and make important decisions independentlyAbility to suggest ways to improve processes while keeping focus on long-term goalsHighly organized, detail-oriented mind-setStrong written and verbal communication skillsProven ability to multitask, manage overlapping deadlines, and adapt to new situations and shifting priorities When you join Lakeshore, you’re joining hundreds of talented and dedicated individuals who believe that the materials we create really can make a difference. For over 60 years, we’ve been developing some of the best learning materials in the world—products that spark young imaginations, instill a sense of wonder and foster a lifelong love of learning. Products that make it possible for every child to enter school ready to succeed. Products that help children with disabilities make amazing educational strides and join their peers in the classroom. And we know that we couldn’t do the incredible things we’re doing without the people who are on our team. We’re continually making sure we have the right people in place to take us to the next level, and we’re always on the lookout for smart and enthusiastic people to join us. If you are a down-to-earth professional who shares our passion and our drive, we’d love to hear from you.  Compensation depends on skills and experience. Family-owned and family-friendly, Lakeshore offers excellent medical/dental and vision coverage, 401(k), flexible benefits, plus a generous profit bonus plan, on-site preschool, employee discount and casual dress.  To apply, please complete an online application at https://chm.tbe.taleo.net/chm02/ats/careers/requisition.jsp?org=LAKESHORE&cws;=1&rid;=2703. To learn more about Lakeshore, visit https://www.lakeshorelearning.com/about/careers.  Equal Opportunity/Affirmative Action Employer"}