{"jobID": "2810922832", "jobLocation": "San_Jose_CA", "jobTitle": "Director, RF Engineering", "companyRating": "3.4", "companyInfo": {"Website": "www.skyworksinc.com", "Headquarters": "Woburn, MA", "Size": "5001 to 10000 employees", "Founded": " 1962", "Type": " Company - Public (SWKS) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "253000", "jobDescription": "    If you are looking for a challenging and exciting career in the world of technology, then look no further. Skyworks is an innovator of high performance analog semiconductors whose solutions are powering the wireless networking revolution. At Skyworks, you will find a fast-paced environment with a strong focus on global collaboration, minimal layers of management and the freedom to make meaningful contributions in a setting that encourages creativity and out-of-the-box thinking. Our work culture values diversity, social responsibility, open communication, mutual trust and respect. We are excited about the opportunity to work with you and glad you want to be part of a team of talented individuals who together can change the way the world communicates.  Requisition ID: 48242   Demonstrate an excellent understanding of high efficiency, low cost power amplifiers for the cellular mobile communications market (WCDMA/LTE/CDMA2000/GSM/EDGE modulation), possess cross-functional leadership and customer interface skills, demonstrate excellent communication skills and a passion for technical team leadership and development.  Our Design Engineers are responsible for developing high performance, low cost, highly integrated and differentiated solutions which enable rapid time to market for very high volume mobile data communication systems. This role requires the ability to architect, optimize and promote innovative new solutions, working closely with Product Marketing and customers to align product features and performance. Strong technical leadership skills are critical to ensure the design team executes that vision through on-time design and development programs that meet critical aspects of cost, performance and schedule. Product ownership from concept, to design, production ramp, high volume production and long term sustaining engineering promotes cradle to grave ownership of our designs, ensuring customer expectations are met at all times.  As a Skyworks OMP Technical Leader you have the chance to have a uniquely large impact on the success of the company. Detailed Description: Our PA Design Engineering Director’s core focus will be to drive our open market PA and Front End Module developments. The key to success lies in the ability to quickly define architectures, drive rapid feasibility studies, and drive out cost, all while meeting aggressive customer development schedules to ensure we are first to sample, first to production, first in performance and best in cost. This combination of goals requires exceptional technical, business, interpersonal, developmental and inspirational leadership skills, combined with a natural desire to win through innovation, teamwork and best practice product development execution at all phases.  This position requires strong cross-functional team building skills, including Marketing, System Engineering, Program Management, Product Engineering, Test Engineering, Wafer Fabrication Engineering, Design Enablement, Component Engineering, Reliability Engineering, Operations, Finance and Human Resources.  The work will include but not be limited to the following: Overall leadership of the site OMP design engineering teamArchitecture, floor planning, cost estimation, schedule estimation, specification negotiation, resource estimation and risk assessment for identified new product development programs  3. Resource allocation and tracking to help identify when additional projects can be initiated as well as the capabilities and limitations of available resources to execute any given program  4. Drive design methodology improvements, best practice adherence and overall compliance to Skyworks OMP Product Realization Process  5. Ensure new team members are properly trained and mentored, and all team members are developing to their full potential  6. Work closely with new product development team leaders to ensure they have the necessary resources to meet critical goals, and set appropriate priority when resource conflicts occur  7. Participate in the recruiting, interview, hiring and on-boarding activities of top notch talent  8. Participate in the Annual Operating Plan preparation, including establishing Key Performance Initiatives (KPI’s) that align with the overall OMP KPI plan, capital expenditure planning, etc.  9. Provide periodic updates to Senior Management on progress toward meeting our goals     RequirementsB.S.E.E. or M.S.E.E.15+ years of experience in RF Design and leadership of highly talented and diverse cross functional development teams.Detailed knowledge of high efficiency linear RF power amplifiers is critical to this role.Understanding of all Cellular modulations & standards and how they impact our designs is highly desired to ensure proper trade-off of critical performance parameters. Thorough understanding of radio architectures and how they impact power amplifier development is also highly desired.Excellent communications and leadership skills, a passion to win and the ability to work and thrive in a team environment is crucial to our success.   Open Market Platforms (OMP) The Open Market Platforms team at Skyworks develops industry-leading, front-end solutions targeting mass market devices deployed by smartphone manufacturers worldwide. Our design engineers have diverse expertise and utilize a broad range of technologies (SOI, silicon CMOS, GaAs, IPD, TC-SAW, and pHEMT) to create differentiated products that meet the intersection of performance and cost requirements for LTE RF front ends. These solutions include high-efficiency power amplifiers, multi-gain LNAs, multi-throw switches, controllers, acoustic filters and integrated modules. Skyworks’ OMP team is an ideal place for motivated engineers who enjoy collaboration in a dynamic environment and designing for performance, cost and quality in the fastest growing segment in mobile.     #LI-DD1        Skyworks is proud to be an equal opportunity employer supporting diversity in the workplace."}