{"jobID": "2582275093", "jobLocation": "New_York_NY", "jobTitle": "Trading Analyst Intern", "companyRating": null, "companyInfo": {"Website": "www.group1.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Group One Trading, LP, a dynamic options trading firm, is actively seeking motivated individuals, who work well in high-pressure environments, to support our operations on the Chicago Board Options Exchange. Although knowledge of the options industry is an obvious asset, we are seeking college students from a wide range of backgrounds, specifically in the areas of mathematics, economics, physics, engineering or computer science. Candidates should be comfortable working in a trading environment, and possess excellent communication, analytical, computer, problem-solving, and time management skills. Successful Interns will have an opportunity to be accepted into our full-time Trading Analyst class, where they will learn the intricacies of options trading and the skills needed to make a successful career in market making.  Our training program teaches analysts the essentials of stock options trading and the skills that make for a successful career on the trading floor. Trading Analysts will be employed as option floor associates and receive a guaranteed salary during their time in the program, with the expectation that 'graduates' will go on to become Junior Traders then onto highly compensated Group One Traders. EXPECTATIONS Keen awareness of critical situations, ability to shift from fast market to slow market conditions quickly and efficiently.  Anticipate the needs of traders throughout the day, quick comprehension and delivery of tasks.  Balance/resolve position discrepancies before opening bell; notify trading staff of unexpected position changes intra-day.  Ability to filter information to trading staff by necessity; reporting pertinent information to management in a timely fashion.  Interns are required to articulately voice needs of the trading staff to IT, vendors, clearing firm, brokers/other market makers, and the exchange if necessary.  To be well versed with all methods of communication provided by Group One these may include but are not limited to IM, telephone, and email.  Excellent computer skills including some programming skills. They should become fluent with both the usage and rules of all applications that provide market research, theoretical/analytical data, order entry applications, and stock/option execution.  Retention of knowledge and ability to apply past experience to current situations is critical.  Excellent math, probability, game theory skills.0 Job Posted by ApplicantPro"}