{"jobID": "2698817326", "jobLocation": "Menlo_Park_CA", "jobTitle": "Financial Systems & Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.slac.stanford.edu", "Headquarters": "Menlo Park, CA", "Size": "1001 to 5000 employees", "Founded": " 1962", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "98000", "jobDescription": " Back to Search ResultsSLAC National Accelerator Laboratory is one of 17 Department of Energy (DOE) National Laboratories, and operated by Stanford University on behalf of the DOE. SLAC develops and operates some of the world’s premier science facilities, including the first hard X-ray free-electron laser. Research at SLAC explores the structure and function of matter and the properties of energy, space and time, at the smallest and largest scales, all with the goal of solving problems facing society and advancing human knowledge. Financial Systems & Data Analyst Job Requisition #: 3106 Classification Title: IT Business Analyst 2 Grade: I Location: Menlo Park, CA (HQ) # of openings: 1 DescriptionPOSITION OVERVIEW: SLAC National Accelerator Laboratory Controller’s Office seeks a highly motivated Financial Systems & Data Analyst to support our PeopleSoft Financial, SAP Concur travel and expense management, and Timekeeping systems. Reporting to the Finance Systems Business Analyst Team Lead, this position is also expected to collaborate with business process owners and IT development teams to resolve system issues, participate/contribute to project planning, system testing, and enhancements and liaise with external vendors or partners in support of business systems.  In addition to core duties, specific responsibilities include the following: Provide expertise in PeopleSoft Financial systems including various core modules, data tables, and reporting tools.Perform complex query and data analysis for supporting key deliverables in the Controller’s Office.Create and execute test plans and test scripts.Prevent data integrity issues and provide report assistance to users. Assist the Controller’s Office with other reporting requirements, as needed.Develop, maintain and present key performance indicators and other metrics by extracting relevant data pulls, summarizations, comparisons, and analysis to ensure business processes are efficient and streamlined.Conduct in-depth qualitative and quantitative analysis to solve problems, make recommendations to discover new approaches or applications.JOB PURPOSE: Specify requirements and/or design solutions for business information systems and incorporate new technical systems to improve work-flow, production, efficiency and effectiveness. May serve as project lead. CORE DUTIES*:Translate business processes into system requirements and/or development of systems solutions.Analyze new business requirements; assist with feasibility of enhancement requests, system functionality, current system use and user needs.Specify functional analysis and design and work with developers and analysts to recommend solutions and resolve system issues.Review, research and evaluate software to determine its usefulness and appropriateness as related to existing or proposed business systems; assist or develop preliminary and detailed system design documentation.Perform testing of new systems, upgrades and patching of existing systems; plan, conduct and document results of testing.Develop instructional materials, training and job aids.Advise users requiring assistance in solving complex problems or issues regarding management and business systems.Analyze data and provide data sets to users for analysis. May include development of operational and analytical reports for end users.Liaise with external vendors or partners in support of business systems, which may include system development, implementation and/or operations.Coordinate the implementation of new or modified business systems.* - Other duties may also be assignedMINIMUM REQUIREMENTS:Education & Experience: Bachelor's degree in Business Administration, Finance, Accounting, Information Systems, and minimum five years relevant experience including: PeopleSoft 9.2 (Proficiency in AP, AR, AM, Contracts, Billing, Project Costing & GL)Data analysis to include development of KPIs and metrics.Knowledge, Skills and Abilities:Knowledge of, computer system capabilities, business processes, and workflow.Experience with enterprise applications and understanding of database driven applications.Strong understanding of the software development life cycle.Knowledge of principles and techniques used in conducting management studies and in systems analysis.Current knowledge of rapidly changing computer technology.Skill in conducting interviews and facilitating group meetings.Skill in developing and conducting training programs.Excellent communication skills, both written and verbal, including the ability to bridge functional and technical resources by communicating effectively with individuals of varying systems expertise and business needs.Strong listening, negotiation and conflict resolution skills.Ability to design and document complex business systems.Proven problem solving and analytical thinking and ability to approach problems logically and systematically.Certifications and Licenses: None SLAC Employee Competencies:Effective Decisions: Uses job knowledge and solid judgment to make quality decisions in a timely manner.Self-Development: Pursues a variety of venues and opportunities to continue learning and developing.Dependability: Can be counted on to deliver results with a sense of personal responsibility for expected outcomes.Initiative: Pursues work and interactions proactively with optimism, positive energy, and motivation to move things forward.Adaptability: Flexes as needed when change occurs, maintains an open outlook while adjusting and accommodating changes.Communication: Ensures effective information flow to various audiences and creates and delivers clear, appropriate written, spoken, presented messages.Relationships: Builds relationships to foster trust, collaboration, and a positive climate to achieve common goals.Job-Specific Competencies:Resilient: Ability to work calmly and effectively in pressure situations, self-directed and tenacious in resolving issues and questions without prompting.Tech Savvy: Comfortable learning and adopting new technologies.Optimizes Work Processes: Strong organizational skills and detail oriented, understanding that capturing and reporting data accurately can impact others.PHYSICAL REQUIREMENTS*:Constantly perform desk-based computer tasks.Frequently sit, grasp lightly/fine manipulation.Occasionally stand/walk, use a telephone.Rarely writing by hand, lift/carry/push/pull objects that weigh up to 10 pounds.* - Consistent with its obligations under the law, the University will provide reasonable accommodation to any employee with a disability who requires accommodation to perform the essential functions of the job.WORKING CONDITIONS:Work extended hours.WORK STANDARDS:Interpersonal Skills: Demonstrates the ability to work well with Stanford colleagues and clients and with external organizations.Promote Culture of Safety: Demonstrates commitment to personal responsibility and value for environment, safety and security; communicates related concerns; uses and promotes safe behaviors based on training and lessons learned. Meets the applicable roles and responsibilities as described in the ESH Manual, Chapter 1—General Policy and Responsibilities: http://www-group.slac.stanford.edu/esh/eshmanual/pdfs/ESHch01.pdfSubject to and expected to comply with all applicable University policies and procedures, including but not limited to the personnel policies and other policies found in the University's Administrative Guide, http://adminguide.stanford.edu.SLAC National Accelerator Laboratory is an Affirmative Action / Equal Opportunity Employer and supports diversity in the workplace. All employment decisions are made without regard to race, color, religion, sex, national origin, age, disability, veteran status, marital or family status, sexual orientation, gender identity, or genetic information. All staff at SLAC National Accelerator Laboratory must be able to demonstrate the legal right to work in the United States. SLAC is an E-Verify employer. Final candidates are subject to background checks prior to commencement of employment at the SLAC National Accelerator Laboratory.Internal candidates, who are selected for hire, may require degree verification and/or credit checks based on requirements of the new position.For Clery Act Information click here: http://www.stanford.edu/group/SUDPS/safety-report/security-authorities.shtml Are you a returning applicant?Previous Applicants:Email:Password: If you do not remember your password click here. New Search"}