{"jobID": "2816864724", "jobLocation": "New_York_NY", "jobTitle": "Sr Manager, Strategic Support", "companyRating": "4.0", "companyInfo": {"Website": "www.jnj.com", "Headquarters": "New Brunswick, NJ", "Size": "10000+ employees", "Founded": " 1887", "Type": " Company - Public (JNJ) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Abbott Labs, Novartis, Covidien"}, "estimatedSalary": "145000", "jobDescription": "Johnson & Johnson is recruiting for Senior Manager, Strategic Support for the office of the Chief Design Officer. The position will be located in the Design Studio headquarters in the Chelsea neighborhood of New York City with frequent travel to New Brunswick, NJ.Caring for the world, one person at a time inspires and unites the people of Johnson & Johnson. We embrace research and science bringing innovative ideas, products and services to advance the health and well-being of people.Employees of the Johnson & Johnson Family of Companies work with partners in healthcare to touch the lives of over a billion people every day, throughout the world. We have more than 275 operating companies in more than 60 countries, with more than 128,700 employees.Our focus on care-centered design enables us to deliver on Johnson & Johnsons commitment to signicantly improve the trajectory of the health of humanity. Committed to inclusion, our diverse company culture celebrates the uniqueness of our employees, and we are proud to be an equal opportunity employer. J&J; Design is the internal design team responsible for creating desirable, feasible and viable holistic end-user solutions across all of Johnson & Johnsons business sectors: Consumer, Pharma, Medical Device and Corporate. In collaboration with business partners across the global organization, we apply design thinking to drive transformational innovation for the health and well-being of all who use our products and services. Our focus on care-centered design enables us to deliver on Johnson & Johnsons commitment to care for the world, one person at a time.The RoleThis developmental assignment of 24 months will report directly to the Chief Design Officer (CDO).As Chief of Staff, you will work closely with the J&J; Design Leadership Team and will be considered an extended member of that team. The Chief of Staff supports and advances J&J; Designs strategic priorities by translating initiatives into executable plans, tracking progress and inspiring results. You will work in collaboration with the Design Operations team to focus on key aspects of the overall strategy and operations planning each year.One primary responsibility of the role is to partner closely with the Chief Operating Officer and other key studio personnel to plan, create and ensure that the annual Master Calendar of meetings, travel and associated events is optimally organized to maximize impact. You will be responsible for ensuring that the preparation for these events is thorough and that deadlines are met.You are the ideal candidate because you are incredibly detail-oriented, proactive, high-energy, organized, able to support cross-functional coordination in a fast-paced environment and possess excellent judgment and a positive attitude.Primary responsibilities include, but are not limited to:You will provide oversight to and management for related projects relative to key priorities for the CDO. By taking ownership in support of the strategic priorities to drive critical business result and outcomes, you will bring together broad groups of stakeholders across J&J; Design to contribute to and execute on these projects.Act as the primary communications support for the CDO and proactively bring together relevent people and resources to assist in the decision-making process.Support in the preparation of presentations to Senior Leaders and Strategic Partners across the organization, as necessary, and other critical stakeholders to synthesize required information and formulate it into recommended strategies for both short- and long-term relationships.You will facilitate the flow of communications with Senior Leaders and Strategic Partners by tracking, monitoring and following-up on open action items.Serve as design ambassador, for both internal studio members and external business partners, as well as develop a positive and visible role and presence within the design community as a whole; become an active participant in design organizations, educational or professional organizations and the local design community.Facilitate the coordinated effort of leading the Design Studio through transition and evolution of 4 key areas:Lead. Create opportunities to inspire the internal team so they become motivated to begin to inspire one another.Connect. Make connecting and communicating within the Studio a priority every week, as well as connecting them to opportunities you have gained visibility to.Shape. Establish new ways to recognize the incredible work going on every day.Deliver. Continually push for consistency, efficiency and excellence throughout design programs and processes, driving excellence in execution.QualificationsA minimum of Bachelors degree is required. Design Thinking background, MBA, or advanced degree is preferred.The ideal candidate is a talent with proven leadership, along with demonstrated business acumen skills, preferably gained through 7+ years of multi-sector business experiences.A demonstrated skill set for visual communications and storytelling, including data visualization, organizing information to reflect audience perspectives and ongoing evolution of narratives.Proven ability to draw conclusions and form opinions based on complex information is required.Naturally collaborative and skillful at building strong relationships.Ability to understand and navigate the complexities of operating in a matrixed global framework is preferred, along with the capability to execute flawlessly in a high-stress and fast-paced environment.Exceptional communications skills, both verbal and written, through different types of technology and media are required.Proven track record of effectively interacting with Senior Management.Impactful, versatile and action-oriented, with impeccable time management, organizational and multi-tasking skills.Detail-oriented and data-driven, with proven ability to analyze, compile and present effective reports.Proven problem solver that makes clear-headed decisions while under pressure.Primary Location United States-New York-New York Organization J & J Consumer Inc. (6101) Job Function Creative Design Requisition ID3642180611"}