{"jobID": "2802839579", "jobLocation": "New_York_NY", "jobTitle": "Sales Analyst Intern", "companyRating": "4.5", "companyInfo": {"Website": "www.artsy.net", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "32000", "jobDescription": " Artsy seeks a Sales Analyst Intern to drive growth and key decisions across the GFI (Gallery, Fairs, and Institutions) team through mastery of their data, tools and operations.  As a Sales Analyst Intern, you will work with major stakeholders across the Marketing, Sales, Account Management, and Finance teams on various projects to monitor and streamline one of Artsy’s core revenue driving businesses. Whether that be introducing improved data practices, tracking monthly performance, or building new infrastructure to achieve end to end reporting — your work will directly contribute to Arty’s mission of making all the worlds art accessible.  From SQL to Salesforce, Sales to Retention, due to the varied nature of our team, you will have the opportunity to learn many different skills. A steward of best practices and data cleanliness, you should have a keen attention to detail, willingness to get into the weeds, and natural affinity for object oriented data structures.Key Responsibilities Manage large data aggregation projectsLearn necessary skills for efficient data wrangling and cleaningGain deep knowledge of the Salesforce platformWork hand in hand with the Global Sales Team and Marketing to surface the most qualified leads with the cleanest possible dataTest, measure, and improve our Prospect Lifecycle Model Candidate Qualifications The ideal candidate is a highly effective, analytical, and critical thinkerExcitement and willingness to learn the Salesforce platformExcel or Google Sheets ExperienceSQL, Python knowledge a plusYou have a passion for data TO APPLYThis is a paid six month internship and starts immediately in our Manhattan offices. To apply, please submit your resumé and a cover letter here.  When you apply, you will be directed to a third party site.ABOUT ARTSYArtsy is a global platform for collecting and discovering art.  We think of Artsy less as a business with employees, and more as a community of people who have chosen to work together towards a common goal, and who share a common set of values.  Artsy empowers a global audience to learn about, discover, and collect art. We partner with leading museums, international galleries, auction houses, and art fairs to create the world’s largest marketplace for art, enabling the growth of the entire art market by effectively connecting supply and demand at a global scale.WHY ARTSYAt Artsy there are no specific work hours or policies, no pointless bureaucracy. We only care that you achieve inspiring results and are a joy to work with. This means you must be highly energetic, enthusiastic, and resourceful—no problem is too big or too small for you to tackle. You will enjoy both responsibility and autonomy in your work.WORKING AT ARTSYArtsy has five core values that will inform your experience at Artsy. Art x Science: We believe in uniting empathy with logic, emotion with data, and intuition with research in everything we do. Whether in business strategy or design, culture or code, we seek the magic that happens when the often separate worlds of art and science come together. People are Paramount: We spend extraordinary energy finding the best person for a job—and once found, we give them the trust and autonomy to be CEO of their role. We avoid pointless bureaucracy and prefer to empower people with information rather than limit them with process. Quality Worthy of Art: We aim to create an experience worthy of all the world’s art and so hold ourselves to the highest standards in all our work. We believe that the best long term quality comes from rapid shipping, iterating, and learning as we go. Positive Energy: We know positivity and optimism benefit our work, and we harness positive energy as a vehicle towards greater awareness, growth, and collaboration. We believe in cultivating a positive relationship to art as opposed to one based on exclusivity or scarcity. Openness: We believe in being open with each other and the world—whether in open-sourcing our code, sharing feedback, or building a diverse and inclusive work culture. We believe in bringing our full selves to work and manifesting an open world where everyone has access to art. Artsy is an equal opportunity employer. We value a diverse workforce and an inclusive culture. We encourage applications from all qualified individuals without regard to race, color, religion, gender, sexual orientation, gender identity or expression, age, national origin, marital status, disability, and veteran status."}