{"jobID": "2675427453", "jobLocation": "New_York_NY", "jobTitle": "Collector Relations Intern", "companyRating": null, "companyInfo": {"Website": "www.artsy.net", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Collector Relations aims to make Artsy the best place to buy art by bridging the gap between collectors and art galleries. The department’s areas of focus include growing gallery private sales, providing outstanding collector support, and expanding the Artsy collector base.  As the Collector Relations Intern, you will have the opportunity to explore all areas of Artsy’s business through collaborative problem-solving and projects in a fast-paced, dynamic environment. You will act as a key touchpoint for collectors and gain invaluable insights into the Artsy collector base. Over the course of this internship, you will independently work on operations around artwork inquiries and sales between collectors and galleries. You are somebody who is excited to learn more about the many facets of the art world in the digital age.Responsibilities include: Sales reporting, one of Artsy’s key measures of health and growthAssisting collectors with questions or concerns empathetically and effectivelyOptimizing communication between collectors and galleries to ensure a seamless collector experiencePresenting collector feedback, insights, and ideas to the rest of the Collector Relations team to inform business and product decisions Key Qualifications:Our ideal candidate enjoy exploring new challenges and working with new people. You are passionate about Artsy’s mission and business, and curious about the art market. You proactively seek out learning opportunities, both big and small. BA/BS degree0-2 years of experience in the art industry (preferably in the for-profit sector)Outstanding writing and communication skillsMeticulous attention to detailExperience working with the public in person or via email TO APPLYTo apply, please submit your resumé and a cover letter here. This is a paid, full-time, 6-month internship with a flexible start date between April 1 and June 15, 2018. It is based at our offices in downtown Manhattan.ABOUT ARTSYWe think of Artsy less as a business with employees, and more as a community of people who have chosen to work together towards a common goal, and who share a common set of values.  Artsy’s mission is to make all the world’s art accessible to anyone with an Internet connection. Our vision is a world where art is as popular as music. We are a resource for art collecting and education.  Artsy features the world’s leading galleries, museum collections, foundations, artist estates, art fairs, and benefit auctions, all in one place. Our growing database of 400,000 images of art, architecture, and design by 50,000 artists spans historical, modern, and contemporary works, and includes the largest online database of contemporary art. Artsy is used by art lovers, museum-goers, patrons, collectors, students, and educators to discover, learn about, and collect art.WHY ARTSYAt Artsy there are no specific work hours or policies, no pointless bureaucracy. We only care that you achieve inspiring results and are a joy to work with. This means you must be highly energetic, enthusiastic, and resourceful—no problem is too big or too small for you to tackle. You will enjoy both responsibility and autonomy in your work.WORKING AT ARTSYIn addition to our vision of a world where art is as popular as music, Artsy has five core values that will inform your experience at Artsy. Art x Science: We believe in uniting empathy with logic, emotion with data, and intuition with research in everything we do. Whether in business strategy or design, culture or code, we seek the magic that happens when the often separate worlds of art and science come together. People are Paramount: We spend extraordinary energy finding the best person for a job—and once found, we give them the trust and autonomy to be CEO of their role. We avoid pointless bureaucracy and prefer to empower people with information rather than limit them with process. Quality Worthy of Art: We aim to create an experience worthy of all the world’s art and so hold ourselves to the highest standards in all our work. We believe that the best long term quality comes from rapid shipping, iterating, and learning as we go. Positive Energy: We know positivity and optimism benefit our work, and we harness positive energy as a vehicle towards greater awareness, growth, and collaboration. We believe in cultivating a positive relationship to art as opposed to one based on exclusivity or scarcity. Openness: We believe in being open with each other and the world—whether in open-sourcing our code, sharing feedback, or building a diverse and inclusive work culture. We believe in bringing our full selves to work and manifesting an open world where everyone has access to art. Artsy is an equal opportunity employer. We value a diverse workforce and an inclusive culture. We encourage applications from all qualified individuals without regard to race, color, religion, gender, sexual orientation, gender identity or expression, age, national origin, marital status, disability, and veteran status."}