{"jobID": "2745898325", "jobLocation": "Valley_Stream_NY", "jobTitle": "Core Field Technician-Hudson", "companyRating": null, "companyInfo": {"Website": "www.firstlight.net", "Headquarters": "Albany, NY", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " FirstLight is seeking a Core Field Technician to join our fast-growing team!  General duties include but are not limited to: install, maintain, and repair all aspects of primary backbone electronic network; use Industry standard practices to construct and maintain core electronic networks and supporting central office and point of presence locations supporting the FirstLight network; and to understand outside plant fiber network components and when required/requested assist outside plant engineering and construction in restoration efforts. Primary area of responsibility extends throughout Hudson Valley, including NYC. Additional responsibilities will include network coverage in West and North as needed. ESSENTIAL DUTIES AND RESPONSIBILITIES:Responsible for maintenance and installation activities on major backbone network components.Works with Core Network Engineering to facilitate clean design packages, Understands power and grounding fundamentals.In depth understanding of test equipment (i.e. Ethernet, TDM, Optical, Fiber Characterization Kits and all other required testing equipment to conduct and troubleshoot the FirstLight network).Core Field technician must understand access procedures for all relevant sites under their area of operation. Be responsible for notifying management when renewals are within 30 days.Core Field has responsibility for all mobility related (tower) installation maintenance and repair.Preventative maintenance / reporting for infrastructure components (i.e. HVAC, Emergency Generators, transfer switching, remote gen set operation, maintenance, and interface connections).Core Field Technician will be responsible for end to end installation, test, turn-up, and maintenance of all carrier related circuits.Participate in On-Call Rotation.Be available as Essential Personnel in emergency scenarios.When necessary, assist Field Services on installation and repair.Completes special projects and other duties as assigned.QUALIFICATIONS, KNOWLEDGE, and SKILLS: To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed are representative of the qualifications, knowledge, skill and/or ability required. Reasonable accommodations may be made to enable qualified individuals with disabilities to perform the essential functions.  Service order work flow systemsReading and understanding CLR’sInventory control protocols, (i.e. use of PIC list)SharePoint access / use of departmental, engineering and NOC related pagesTroubleshooting process (i.e. point to point analysis)AC / DC power fundamentalsField Test equipment operation (i.e. OTDR, Ethernet testing, Optical Power Measurement)Basic fiber splicingIndustry standard installation practices:Planning for network installations by studying customer orders, plans, manuals, and technical specifications.ordering and gathering equipment, supplies, materials, and tools, assessing installation site; preparing an installation diagram.Verifies service by testing circuits, equipment, and alarms; identifying, correcting, or escalating problems.Documents network by labeling and routing equipment and cables; recording configuration diagrams and specifications on appropriate company owned systems."}