{"jobID": "2811525078", "jobLocation": "San_Jose_CA", "jobTitle": "Entry-Level Behavior Therapist ($250 Sign-On Bonus for RBTs!)", "companyRating": "3.7", "companyInfo": {"Website": "www.acesaba.com", "Headquarters": "San Diego, CA", "Size": "1001 to 5000 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "35000", "jobDescription": "Does your biggest thrill come from helping people learn new skills? Do you enjoy putting a smile on a child's face? Have you ever dreamed of being a teacher or camp counselor? Do you want to know that your work is making a life-changing impact on others?If any of the above describes you, you'll fit right in with our Behavior Therapists at ACES. Our goal is to help those with special needs and we feel lucky to be able to enhance the quality of life for our clients and their families every day.Position Title: Behavioral Interventionist Location: San Jose, Sunnyvale, Milpitas and surrounding areas Hours: Part-Time (ranging from 15-25 hours per week, depending on your availability) Pay Rate: $17.50-$25 per hour, dependent upon experience and educational background. Now offering a $250 sign-on bonus for RBTs! What You'll Do: Work one-on-one with children with autism spectrum disorder, helping them develop the life skills necessary to succeed in their homes, schools, and communities. What We're Looking For:Energy, patience, sensitivity, and a love for helping othersAbility to remain organized while working creatively with kidsAvailability to work at least 3 weekdays from 3-7PM or 2 weekdays 3-7PM & Saturday 9AM-1PMAbility to drive to and between client session locations (most Behavior Therapists are matched with clients located within a 10-15 mile range of their home)Earned a high school diploma (or equivalent/higher)What You'll Love:Becoming a nationally Registered Behavior Technician (RBT®), with all credentialing paid for by ACES (RBT Applicants must be at least 18 years of age)Paid drive time and mileage reimbursement when traveling between clientsWorking with clients using industry-leading software on your own company iPadBeing mentored by top professionals in the ABA (Applied Behavior Analysis) IndustryAdditional InformationACES is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender, gender identity, sexual orientation, marital status, national origin, disability, age or covered veteran status.(autism, ABA, Applied Behavioral Analysis, disabilities, special education, psychology, sociology, social work, child development, therapy, therapist, healthcare, kids, children, Education, RBT, MFT, behavioral intervention, behavioral modification, assistant, caregiver, medical staffing, social work, disability, technician, pediatrics, youth, medical assistant, patient, developmental interventionist)Apply Now"}