{"jobID": "2506795687", "jobLocation": "Burlingame_CA", "jobTitle": "Job: Econometric Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.lyrahealth.com", "Headquarters": "Burlingame, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Active since 10-08-2017 Job category Engineering - Engineering Location Burlingame Level - Educational level Bachelor / Graduate Employment type - Hours 0 Salary - We’re building data sets to accurately represent knowledge about patients, providers, and treatments. More importantly, we’re using that data to connect patients to the right providers and to measure effectiveness of care.Here are some examples of what we’re working on:Claims diagnostic analytics to identify the behavioral health care improvement opportunities for our clients.Predictive analytics to identify high risk patients for poor outcomes, high costs and adverse events.Developing statistical models for identifying factors that improve patient outcomes, and cost and resource utilization.Deriving insights from exploratory analysis that drive a data-informed process for experimenting with new products to improve patient outcomes.What we don’t care about: Fancy degrees and titles. We’ve got some of those, and it’s ok if you do too. But we care about what you can actually do, not the letters after your name. What we do care about:Your experience. We’re a small team, so we need people who can ramp up quickly and be productive in our environment, even as you learn new things along the way. Coding experience required, with a strong preference for people with at least some industry experience working with Python and SQL.How you develop ideas and insights with data – that’s what we do! We need analytical minds and quantitative thinkers.That you’re a self-starter and a quick study. We’re a startup, so everyone contributes to data cleaning, analysis, and modeling.Your high standards and judgment on what matters. We appreciate people who want to excel at everything, but who know how to prioritize must-haves over nice-to-haves.Your desire to make a difference in people’s health and well-being. We care deeply about making a difference in people’s lives, and we hope you do too! The role is located in Burlingame, CA, near San Francisco Airport. No part-time or remote candidates will be considered, and local candidates are strongly preferenced.We are an Equal Opportunity Employer. We do not discriminate on the basis of race, religion, color, sex, age, national origin or disability More information This listing is a full-time job Job category Engineering - Engineering Industry / Industries Medical / Health Region United States Keywords"}