{"jobID": "2709689324", "jobLocation": "San_Jose_CA", "jobTitle": "Nurse Case Manager", "companyRating": "3.7", "companyInfo": {"Website": "www.keenan.com", "Headquarters": "Torrance, CA", "Size": "501 to 1000 employees", "Founded": " 1972", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": " Keenan & Associates is a successful insurance brokerage and consulting firm meeting the insurance needs of hospitals, public entities and California school districts. Keenan specializes in providing consulting services in the areas of: employee benefits, workers' compensation, loss control, financial, and property & liability. We have seen continuous growth and success, and are positioned to lead the industry into the 21st century.  We currently have an exciting career opportunity for a Nurse Case Manager in our Northern or Southern California Offices which includes Torrance, Riverside, San Clemente, San Jose, Oakland and Rancho Cordova. The Nurse Case Manager provides early intervention Workers’ Compensation nurse case management to injured workers.  ESSENTIAL DUTIES AND RESPONSIBILITIES include the following: • Applies established protocols, criteria, guidelines, references and resources to determine medical appropriateness of services provided to injured workers in a cost effective manner. • Assesses medical needs via evaluation and assessment of subjective, objective symptoms and complaints, evaluation of the injured worker’s functional abilities in order to formulate and deliver a plan with specific goals and objectives. • Delivery of appropriate and timely medical services. • Specific expertise is required in assessing rehabilitative needs and service coordination. • Appropriate recovery is measured via referencing and documentation of the REED Group Disability Guidelines (MDA), ACOEM, MTUS, and Anthem Workers’ Compensation Supplemental Care Protocols. Assessment of rehabilitative progress is monitored by frequent conference with the providers of care. Coordination of Home Care Services, Durable Medical Equipment, Pharmaceutical Services, and other auxiliary rehab/medical services is monitored for continued efficacy. • Communicates with medical providers and the employer to return injured employee to work, either modified or full duty. • Refers medical services which are not in alignment with nationally recognized guidelines to the Anthem Workers’ Compensation Physician Advisors for review and decision-making. • Oversight of appropriate correspondence in relation to the case management and utilization review process. • Documents decisions, rationale, and resources regarding cases. • Must have the ability to review data as it relates to treatment and the costs of care and must identify trends to the appropriate parties.  MINIMUM SUGGESTED QUALIFICATIONS: Registered Nurse with a current, active, and unrestricted California license. Prior Case Management and/or Workers Compensation experience an asset. CCM preferred. Self-starter, detail oriented, excellent verbal and written skills. High level of initiative and works well in team environment.  SOFTWARE APPLICATIONS: Working knowledge at an intermediate level of all Microsoft Office products: Word, Excel, PowerPoint, and Outlook.  Keenan provides a competitive compensation and benefits package. We encourage teamwork and employee initiative - people working together is what makes Keenan a success. We invite you to share in the commitment of preserving our warm tradition, reputation and dedication to our clients. After all…What you do makes a difference!  Please apply online at www.keenan.com/careers. For more information, visit our website at www.keenan.com. Keenan provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, creed, sex, sexual orientation, gender identity, national origin, age, disability, veteran, marital, or domestic partner status. Keenan is committed to a diverse workforce and is an affirmative action employer."}