{"jobID": "2296162134", "jobLocation": "Bellevue_WA", "jobTitle": "Data Scientist - Risk", "companyRating": "2.9", "companyInfo": {"Website": "www.postmates.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "107000", "jobDescription": "Postmates runs one of the largest marketplaces in the country, connecting consumers, merchants, and Postmates in real-time. Building high powered intelligence atop our large-scale dataset is a serious challenge and we are looking for candidates who are ready to dig in. Postmates isn’t just another ad platform or mobile app for delivering static user generated content: We have real customers paying real money for a real service, all under an hour.As a Risk Data Scientist, you will help pioneer the future of on-demand fraud prevention and play a key part in Postmates’ risk reduction strategy. You will use your full toolkit -- statistical modeling, machine learning, data mining, software engineering -- to understand the behavior and properties of successful customers and deliveries while detecting and measuring the outliers. You’ll help safeguard the platform from financial fraud, evaluating risk as it happens and working with operations to head it off at the pass. You’ll be resilient and flexible as new fraud schemes challenge your limits. REQUIREMENTS 2-7 years of applied experience applying theoretical ideas in machine learning, graph theory and statistics to solve designing, delivering, and scaling production fraud detection at scale models.Extensive experience with data tools -- Python (Pandas, scipy, numpy, scikitlearn etc), R, SQL, Octave.Ability to own your modeling work from model development all the way to production deployment and after.Ability to approach questions with a scientific rigor, but can execute pragmatically -- the simplest solution may be the best at times.A strong communicator. Explaining complex technical concepts to product managers, support, and other engineers shouldn’t be a problem for you.You are scrappy. You understand the challenges, nuances, and details of working with messy data and if the data doesn’t exist, you go build it.You love it when things work, you understand that things break, and when things do fail, you dive in to understand the root causes of failure and fix whatever needs work.BONUS POINTS 2+ years experience building predictive fraud models in the on-demand or digital payments spaceA Masters degree (or higher) in a technical field (Statistics, Operations Research, Math, Physics, Engineering …)Background in Python and previous software engineering experienceA solid math and statistics backgroundExperience in small start-up environmentBENEFITSCompetitive salaryGenerous stock option planMedical, dental and vision insuranceSnack filled kitchenAwesome work environment at a company with a huge visionKiller office locations in SF and Seattle"}