{"jobID": "2762391414", "jobLocation": "Larkspur_CA", "jobTitle": "Board Certified Behavior Analyst ( BCBA )", "companyRating": null, "companyInfo": {"Website": "www.juvobh.com", "Headquarters": "Oakland, CA", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " STE CONSULTANTS, Trumpet Behavioral Health, Autism Spectrum Therapies"}, "estimatedSalary": null, "jobDescription": " Juvo Autism and Behavioral Health Services is looking for passionate, creative and dedicated people that want an opportunity to make a difference in their communities.  Founded in 2006, Juvos mission is to utilize educational and behavioral best practices to support and educate our clients, staff and community in order to create and sustain access to a better quality of life in the least restrictive environment. We do this by providing clinical services that are grounded in applied behavior analysis (ABA), a discipline devoted to the understanding and improvement of human behavior of social significance. The implementation of best practices in applied behavior analysis results in individuals who are equipped to achieve to their fullest potential to lead lives of self-sufficiency and independence. We strive to provide behavior analytic services in a caring manner that stimulates, engages, and motivates our clients to embrace learning by using the least intrusive methods to address their individual needs. What we offer youProfessional DevelopmentPhenomenal Team of Administrative and Clinical PersonnelHealth Insurance OptionsPromotional OpportunitiesProfessional Development Stipend for CEUs and future education.What you will be doingConduct behavioral assessments, functional assessments, and functional analysesDevelop behavior support and intervention plansProvide school-based training, behavior consultationConduct group parent trainingWe are looking for people whoHave a genuine desire to learn, teach, collaborate, and above all have a good time!Want to be a part of a team with a common goal to make a differenceAre flexible to the pace and demands of a growing businessAre excited to be in a position that provides direct feedback and strives for the highest quality of servicesValue and nurture an environment that exudes professionalism and a team attitudeHave knowledge of Natural Environment and Discrete Trial teaching, direct observation data collection methodology.Be an excellent communicator/listener, available to work evenings, have reliable transportation, willing to drive to locations within the Bay Area, willing to work as a team, and be highly organized.What our team has to say \"I love working at Juvo because they offer three unique things that I happen to value as well. One is their commitment to staff and making sure that all staff are well cared for and have a work/life balance so that we can all do our jobs with renewed energy. Secondly, they are truly open to feedback and will respond to it in a timely manner. Lastly, I thoroughly enjoy the group of people we have here and value my relationships with my coworkers. It feels more like a family than just a place to work!\"  - Kristin Ojala  Senior Clinical Director Additional Information Candidates MUST have a Master's Degree (in a relevant field) and posses their BCBA.  We have full time salaried positions all throughout the Bay Area  Questions? Call us!  Dr. Mel Dauster, Director of Recruiting (M) 510-219-6207 (Email) jobs@juvobh.com  www.juvobh.com/careers"}