{"jobID": "2807992551", "jobLocation": "Alameda_CA", "jobTitle": "Community Manager", "companyRating": "4.4", "companyInfo": {"Website": "www.elevatetosequoia.com", "Headquarters": "Walnut Creek, CA", "Size": "201 to 500 employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " Unknown / Non-Applicable", "Competitors": " Greystar, FPI Management"}, "estimatedSalary": "69000", "jobDescription": "Community Managers at Sequoia inspire team members to be their best self every day.  You thrive on challenge and appreciate your significant role in operating a multi-million dollar asset. A skilled team-builder, you know the people who work for you and what makes them tick. You teach, train, and show others how to succeed.  You are a leader who is in it to win it.  We’re not just any property management company. Join us as we elevate the industry.  This position is for Ballena Village Apartments in Alameda, CA.  Must haves: Desire to leadPositive attitudeOrganizationSpeedSense of humorPeople skillsResiliencePrior management and budgeting experience in real estate, hospitality, retail, or related fieldHigh school diploma or GED Great to haves: Understanding of industry software such as Yardi, Onesite, YieldStarAssociates or Bachelor’s degree What we’ll do for you: Provide a great place to work – you’ll want to show up and give your best self everyday, we promiseAllow you to crush it – by providing you the best training programs in the industryBoost your wardrobe – visa gift cards to shop for work clothes at a variety of well-known retailersMake sure you’re covered – superior health, dental, and vision insurance and a 401(k) program/match that keeps you on track for your futureGive you a break – paid time off for vacation, sick days, holidays, and your birthdayReward you – apartment rent discounts, fun days, generous monthly perks, cash bonuses, and recognition for a job well doneLet you give back – through our purpose program Sequoia Equities is an Equal Employment Opportunity employer and promotes a drug free workplace."}