{"jobID": "2802156436", "jobLocation": "Boston_MA", "jobTitle": "Data Scientist (Python, ML, Spark)", "companyRating": null, "companyInfo": {"Website": "www.strategicemployment.com", "Headquarters": "Los Angeles, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " An exciting customer loyalty SaaS company located in Bostons seaport is looking for a Data Scientist for their growing data science/AI team. Our client is a growing company with over 100 employees in Boston with over $50 million in funding. They partner with large Fortune 500 clients. The ideal candidate has experience or is interested in implementing machine-learning algorithms in Python and R, as well as using Spark and Hive/Hadoop for large data storage. If you are passionate about machine-learning, being a part of a collaborative team, and working with cutting-edge technoloiges then this position could be for you! Please feel free to read through the responsibilities, requirements, and benefits below.  Salary: $100k-$135k ResponsibilitiesDesign and implement large-scale machine-learning algorithms using Python, R, SQL, Spark/PySparkSupport and assist with 3rd party ETL integration using data sources and exportsPerform complex data analysis and presenting results to non-technical audiencesResearch new methodologies, different analytical tools, and contributing to new product developmentPresent findings to customers and data science team membersRequirements3+ years of relevant work experience as a Data Scientist or Data EngineerProfessional experience writing algorithms and data processing in Python, R, Scala or other functional programming languagesExperience or familiarity with Spark, Hive, MySQL, and/or AWSBachelor's, Masters Degree, or Ph.D. in Computer Science, Statistics, Machine-Learning, Math, etc.An understanding of data modeling and familiarity writing complex SQL queries and stored proceduresDesired SkillsFamiliarity or experience with SparkProfessional experience with AWS Redshift, AWS S3, Redis, OR Cassandra (NOT REQUIRED)Comfortable with SciKit Learn, SciPy, OR PandasBenefitsMedical, Vision, and Dental Insurance401 (k) with open enrollmentEquity within companyUp to 10 holidays per yearGenerous vacation policyCommuter reimbursement Apply"}