{"jobID": "2735279141", "jobLocation": "Cambridge_MA", "jobTitle": "Senior Data Scientist/Statistician", "companyRating": "4.3", "companyInfo": {"Website": "www.cargurus.com", "Headquarters": "Cambridge, MA", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Public (CARG) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "156000", "jobDescription": " Meet CarGurus—the #1 visited online car shopping website in the US. At CarGurus, we’re building the world’s most trusted and transparent automotive marketplace where it’s easy to find great deals from top-rated dealers.  Founded in 2006 by Langley Steinert (co-founder of TripAdvisor), CarGurus is a technology company with a passion for data and its power to simplify every aspect of the car shopping experience. Using proprietary technology, search algorithms and innovative data analytics, we provide unbiased validation on pricing, dealer reputation and vehicle history.  CarGurus is looking for a Senior Data Scientist/Statistician to join our algorithmic traffic acquisition team. We are looking for entrepreneurial Data Scientists who can help continue to capture and retain unique visitors to our site from online search and social media platforms. Our goal is to extract insights from voluminous amounts of data and set the strategic course for online bidding. What You’ll Do:Design and analyze controlled experiments and quasi-experiments relating to our online bidding systemMeasure the impact of television and radio advertising on online advertisingDesign and implement predictive modelsCommunicate your analysis to both a technical and a lay audience. E.g., what is it, how does it solve the problem, why is it reasonable, what could go wrongWho You Are:Advanced academic degree in:StatisticsBiostatisticsComputer ScienceEconometricsAny quantitative field which makes use of advanced statistical techniques and analyses."}