{"jobID": "2796107909", "jobLocation": "New_York_NY", "jobTitle": "Corporate Counsel", "companyRating": null, "companyInfo": {"Website": "www.brighthousefinancial.com", "Headquarters": "Charlotte, NC", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Location : New York City, NY or Charlotte, NC  Brighthouse Financial is a new company established by MetLife. We’re on a mission to help people achieve financial security. Built on a foundation of industry knowledge and experience, we specialize in offering essential annuity and life insurance products designed to help customers protect what they’ve earned and ensure it lasts more predictably. In an industry that often has a reputation for complexity, confusion, and cost, Brighthouse Financial is different. Our approach includes simplicity, transparency, and more value so customers can face the future with confidence.  Brighthouse Financial is seeking passionate, high-performing team members to help us carry out our mission and be part of an exciting journey toward improving the financial futures of our millions of customers. Sound like you? Read on. Role Value Proposition: This position represents the unique opportunity to work for a start-up, but one with long-standing experience in the financial services industry. The candidate must be able to provide excellent legal advice and representation, have demonstrated a high degree of discretion and judgment, have the intellectual curiosity to keep abreast of the changing legal climate on issues relevant to a national provider of income and protection products and services, and to have a strong commitment to personal growth, demonstrating leadership and developing talent.  The attorney will join a team of lawyers responsible for providing insurance-related legal advice to the Insurance Products Group in the Product and Funds Unit in connection with the issuance and maintenance of Brighthouse Financial life and annuity products. This team performs the insurance-related legal work in connection with the development of life and annuity products offered in a variety of tax-qualified and non-qualified markets, including filings with state insurance departments. The team also provides day-to-day legal advice to our business partners in connection with the administration, marketing, and distribution of life and annuity products. Key Responsibilities:Handle complex legal matters, analyze legal (and business, where applicable) issues, draft legal documents, and negotiate matters and solve intricate problems using sound legal judgment and expertise, with minimal supervision.Build and maintain client relationships with diplomacy and by providing insightful, timely, pragmatic, and proactive counsel without supervision.Prepare, initiate, advocate and effectively present legal points and recommendations to influence clients and to represent clients as legal counsel.Educate self and business partners on legal developments affecting business and provides innovative strategies to address those developments.Regularly interface with other in-house subject matter legal, government relations and compliance counsel for complex issues.Work on or lead project or cross-functional teams.Guide junior attorneys, paraprofessionals or administrative staff. The attorney will have the responsibility to: Advise business areas on all aspects of product design and modification.Advise business areas on new and existing state regulatory requirements.Advise business area on operations issues impacting the life and annuity business.Essential Business Experience and Technical Skills:J.D. and excellent academic credentialsAdmitted to practice in at least one state7+ years’ relevant practice post bar admissionCandidates MUST have an in-depth knowledge of state insurance laws and experience relating to insurance regulatory examinations and a working knowledge of life insurance, fixed and variable annuities, investment products and contracts lawDemonstrated commitment to leadership and developing talentDemonstrated record of attention to detail, sense of urgency, ability to handle substantial workload effectively (i.e., establish priorities, adhere to deadlines)Willingness to partner with colleagues and business partners to contribute to success of the companyAbility to thrive as a team member and individual contributor in a high-performance cultureProvide creative input in culture of continuous improvement with respect to policies and procedures of the Business Law Group and our business partnersCandidate will be able to work under the limited supervision of a senior attorneyCandidates must have excellent oral and written communication skills and the ability to handle multiple projects and assignments effectively, and must be able to deal comfortably with business partners and others at all levels within the companyTravel: None"}