{"jobID": "2724366022", "jobLocation": "San_Francisco_CA", "jobTitle": "Associate Director, Content Operations", "companyRating": "3.5", "companyInfo": {"Website": "www.agoda.com", "Headquarters": "Singapore, Singapore", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "120000", "jobDescription": " Come join the leadership team building content for one of the worlds largest e-commerce and travel sites!  We are looking for an experienced manager ready to take the next step; someone energetic and analytical, with a proven track record of driving business results with superior content delivered by operational excellence. Someone ready and able to help build content teams for Agoda, one of the worlds most successful online travel companies.  As Associate Director, Content Operations, you will analyze customer and product data to determine content value and priority; set content strategy and KPIs that drive value; build and manage content teams; work with product owners and IT on A/B experiments and reporting; and coordinate with accommodation supply and connectivity teams. Via rigorous data analysis and A/B experiments, you will identify content opportunities that drive customer value, bookings and conversion, build business cases around the opportunity and get buy-in from partners, senior management and 3rd party suppliers, and lead teams in execution in a fast-paced, dynamic work environment. This is a full-time position based in Bangkok, Thailand, reporting to the Director of Content Operations. Align strategic priorities with internal partners and senior management: Establish effective data and analysis flowsUnderstand customer imperatives and set content and data priorities to customer valueEstablish and own KPIs to measure business value and operational throughputEnsure appropriate data/tools/dashboards to measure execution and enable deeper analysisTrack execution and report up in regular updates Create roadmaps and project plans for executing against key performance indicators: Establish new and supplemental content opportunitiesAssess resourcing and tools in content supply chainBuild teams to execute business goals for contentEngage third party vendors/suppliers/outsourcers as needed to drive content goalsWork with product/IT to experiment and measure against project theories/targets Identify and source new vendors to drive product success: Stay abreast of content developments in the travel, ecommerce, and media spacesUnderstand state of play with startups, online travel competition, and big internet/tech playersShare feedback with Product Owners and accommodation supply partnersSeek vendors for content plays that can drive bookings/conversionsNegotiate contracts/SOWs with potential partners, working with in-house legal teamTrack partner performance via appropriate metrics/reporting/dashboards Ensure operational excellence via team and tool development, progress reporting, data analysis: Assess throughput metrics and operational workflows, with strong input from teams, to improve operational efficiencyUnderstand Agoda data universe and tools for accessing, establishing the right visibility for managementWork with product, data/BI team and IT to create/supplement data resources and build appropriate reportingMonitor and upgrade/replace content supply back-office systems: Translations, Photos, CMS, Geo dataCommunicate regularly up to senior management at biweekly, quarterly and ad hoc meetings Grow and develop Content Teams to support business priorities: Identify critical skillsets and profiles for success on Content TeamsHire and develop starsContinuously assess resourcing and adjust team levels to prioritiesProven experience with setting content or operational strategy to drive ecommerce conversion and product innovationProven analytical skills and data-driven decision-making; SQL expertise a plusProven experience in optimizing operational workflows and resourcing, both automated and manual, to achieve business goalsExperience managing digital content and content teams in ecommerce or other internet spaceMinimum 2 years of direct management of teams of 5 or moreFluent in English, both spoken and writtenStrong communication skills: face to face, presentations, writtenUndergraduate degree from accredited university; MBA or other relevant advanced degree a plusExperience in technology space a plusWe welcome both local and international applications for this role. Full visa sponsorship and relocation assistance available for eligible candidates.Apply!"}