{"jobID": "2805782468", "jobLocation": "Los_Angeles_CA", "jobTitle": "Dynamics NAV Data Analyst - San Diego", "companyRating": null, "companyInfo": {"Website": "www.nigelfrank.com", "Headquarters": "Newcastle upon Tyne, United Kingdom", "Size": "501 to 1000 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Dynamics NAV Data Analyst - San Diego, CA - $75k - $100kDynamics NAV Data Analyst - San Diego, CA - $75k - $100k A company in the food distribution industry is looking for a Data Analyst with NAV and SQL experience to join their team. The IT team consists of five full time employees. The Data Analyst will have responsibilities including Dynamics NAV (including an upcoming upgrade), SQL, integration work, and some BI tasks.  A Dynamics NAV upgrade to NAV 2018 is currently in planning stages. The NAV Data Analyst is going to have a big role on this project, providing them with a chance to have a hands-on role in the process of an ERP upgrade. A background in project management is highly preferred. The NAV system has 150 users over three locations. The Data Analyst will be expected to take part in the upgrade at these three locations, in addition to working on the project for two additional locations that have yet to implement NAV. In addition, you'll be working with various third-party software integrations.  Another key part of this role will be based on SQL. A strong understanding of SQL is expected, as the person in this role will require the ability to write SQL queries and procedures.  As Data Analyst, you'll be involved in various projects that will allow your skill set to expand to various systems and business processes. In addition, the company is looking to open multiple locations throughout the country over the next few years, leading to opportunity to grow within as they expand.  The candidate should be experienced with: MS Dynamics NAVSQL serverLight project managementEDI (preferred)Problem solving If you're interested in pursuing this position and furthering your career, call Sheridan at 818-356-8566 or email at [Click Here to Email Your Resumé]  Nigel Frank International is the global leader for Microsoft Dynamics recruitment, advertising more Navision/ Dynamics NAV jobs than any other agency. We deal with both Microsoft Partners & End Users throughout North America and Europe. By specializing solely in placing candidates in the Microsoft Dynamics market I have built relationships with most of the key employers in North America and have an unrivaled understanding of where the best opportunities and Navision jobs are.  I understand the need for discretion and would welcome the opportunity to speak to any Microsoft Dynamics NAV / Navision candidates that are considering a new career or job either now or in the future. Confidentiality is of course guaranteed. For information on the Microsoft Dynamics market and some of the opportunities and Dynamics NAV / Navision jobs that are available I can be contacted on 818-356-8566. Please see www.nigelfrank.com for more fantastic Microsoft Dynamics opportunities!"}