{"jobID": "2816189213", "jobLocation": "Bellevue_WA", "jobTitle": "DATA ANALYST/ WEB ANALYST", "companyRating": null, "companyInfo": {"Website": "www.avacend.com", "Headquarters": "Atlanta, GA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job Title: Operations Analyst II  Available Positions:1  End date- 12/30/2018  Work Address:BELLEVUE, WA 98007  JD  Operations Analyst II is project and/or operations focused and includes analyzing complex data and providing recommendations for operational and financial improvements. The candidate is required to conduct detailed analysis of operational data, processes, and policies that impact a function/departments ability to meet business requirements. The candidate provides day-to-day support of operational systems that a function/department supports or owns, and may lead change or improvement initiatives. This includes identifying issues associated with daily operations and providing feedback to management on possible courses of action. Bachelors Degree or equivalent. 3+ years related work experience.  Service Performance/Operations:  Subject matter expertise will be required to have full stack development skills.  -Solid foundation in computer science and applications, modeling, statistics, analytics and math.  -Ability to create interactive web dashboards from the ground up including but not limited to concept, navigation, layout and programming involved & maintain it to provide optimized user experience.  -Ability to setup and maintain both the front and back ends.  -Strong expertise in javascript, HTML/CSS, PHP.  -Strong expertise with using MySQL, MS Access, MS Office with special emphasis on Excel and VBA.  -Experience communicating effectively at both detailed engineering and executive levels.Required Skills Required Experience Job Location BELLEVUE, US-WA"}