{"jobID": "2821265404", "jobLocation": "San_Francisco_CA", "jobTitle": "Architect/Principal Engineer", "companyRating": null, "companyInfo": {"Website": "www.tibco.com", "Headquarters": "Palo Alto, CA", "Size": "1001 to 5000 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " IBM, Oracle, Microsoft"}, "estimatedSalary": null, "jobDescription": "As an Engineering Architect for Spotfire Data Science you will enhance and extent the capabilities of a leading commercial data science platform used in the fields of and in exciting areas such as text mining, signal processing, and deep learning. You will leverage the power of analytic data bases and technologies such as Spark and Hadoop. You will aim to develop powerful functions that are still easy to use. You will develop features end-to-end for real customers. You will contribute to open-source projects such as MLlib.You will have the opportunity to develop the systems that will create a new wave of citizen Data scientists. You'll have the coding wheel on this vehicle that will take the work out of Data science, making it easy for anyone with limited analytics background to become proficient in Data science and mine real life, real time insights using our machine learning software.Spotfire Data Science performs complex algorithms in parallel, and scales to many billions of rows and thousands of variables. Candidates must have strong programming skills, experience with big data analytic technologies and a strong desire to work with the latest distributed computing technologies. Lead the development of a massively-scalable analytic and machine learning platform built on Hadoop and SparkWork on the full stack of application development, using agile practices, from concept phase through testing and launchEvolve our analytics plug-in framework to create a marketplace of scalable analytic toolsContribute to open-source projects for data mining and machine learning"}