{"jobID": "2817639628", "jobLocation": "Santa_Clara_CA", "jobTitle": "Process Engineer", "companyRating": "3.9", "companyInfo": {"Website": "www.agilent.com/go/careers", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1999", "Type": " Company - Public (A) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Thermo Fisher Scientific, Illumina, Danaher"}, "estimatedSalary": "123000", "jobDescription": " Agilent inspires and supports discoveries that advance the quality of life. We provide life science, diagnostic and applied market laboratories worldwide with instruments, services, consumables, applications and expertise. Agilent enables customers to gain the answers and insights they seek ---- so they can do what they do best: improve the world around us. Information about Agilent is available at www.agilent.com.  Improves processes, equipment, and components to meet agreed-upon objectives for quality yields, throughput, and machine uptime. Supports the introduction of new products, and qualification of new materials. Achieve department specific objectives for equipment and material yields, availability, and capacity. Supports Manufacturing processes and equipment to ensure quality product is produced to meet on-time shipment volumesMay redesign processes, equipment, or components to meet cost objectivesParticipates actively in new product introduction, including influencing the design of the product to ensure manufacturability and conformance with the global supply chain, enabling prototyping, testing the reliability of prototypes and managing the transition into productionSupports and implements the transition of products and manufacturing processes from prototype to full production and through the entire life cycle of the productMay direct the work of third party vendors and/or partners to meet contract specified deliverables, performance, or business objectivesMay work with suppliers to ensure achievement of goals for cost, quality, and delivery of parts and materialsSupports training and certification of Manufacturing personnelEstablishes and supports procedures and protocols to meet compliance and Quality requirementsJob Specific Responsiblities: Safety Strictly adhere to established safety protocols during equipment repair and maintenance activities.Institute protocols to ensure a safe work environmentIdentify and correct any safety issues working with Agilent Environmental Health and Safety (EHS)Identify and correct ergonomic issuesResponsible for notifying EHS of design reviews for new or changes to equipment or chemistry Quality/QSR Strictly adhere to OF/Genomics procedures.Develops and executes QSR compliant validations as required for process, material, equipment, and software changes.Ensures that required records are maintained for equipment maintenance and repair.Adheres to established guidelines for workplace cleanliness, document control, and identification of engineering tools and materials. Process Stability Monitor Fab processes in area of responsibility for consistency in yield performance and machine uptimeEstablish clear guidelines for operating limits for equipment and when to shutdownImplement in-line process controls with clear limits on critical parameters Process Improvement Optimize processes for improved control, quality, or production outputIdentify changes of equipment or process for process improvements Training and Documentation Create documentation for all processesSupport training and certification of production personnelKeep current on all position specific training as identified in training matrix Customer Support on-time shipments of quality product to meet customer ordersRespond to customer complaints and returns following the established Customer Return protocolsRecommend improvements for resolution of customer issues Manufacturing Technology Work with R&D; to design, develop and release new tools or process technology needed for business goalsSupport input to risk assessments and design for Manufacturability Continuous Improvement Actively supports manufacturing continuous improvement program, contributes ideas and implements improvementsRequired:Bachelors or Master's Degree or equivalent in engineering, science. Engineering degree preferred.5+ years hands-on engineering experience in a manufacturing environment is preferred, new Engineering graduates will be considered.Technical experience with automated equipment, mechanical and process troubleshooting, robotics, parts replacement selection, PLCs, and machine software control.Must have hands on experience with wet chemistry and experience with safety related items within a manufacturing environment.Understanding of how to work quickly in a regulated environment establishing processes for integration of revision control, validation, and implementation of changes.Experience in ISO9001 or ISO 13485 Quality environment.Weekend work is required (Saturday and Sunday).Preferred:Semiconductor process and equipment manufacturing experience.Experience in ISO13485 or Quality environment supporting clinical markets.Demonstrated proficiency in developing and executing process validationsProficiency in statistical data analysisExperience with print head technologies. Agilent Technologies, Inc. is an Equal Employment Opportunity and Affirmative Action employer. We value diversity at all levels. All individuals, regardless of personal characteristics, are encouraged to apply. All qualified applicants will receive consideration for employment without regard to sex, pregnancy, race, religion or religious creed, color, gender, gender identity, gender expression, national origin, ancestry, physical or mental disability, medical condition, genetic information, marital status, registered domestic partner status, age, sexual orientation, military or veteran status, protected veteran status, or any other basis protected by federal, state, local law, ordinance, or regulation and will not be discriminated against on these bases.  For more information about equal employment opportunity protections, please view the 'EEO is the Law' poster available here https://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf  https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf  Agilent Technologies, Inc., is committed to diversity in the workplace and strives to support candidates with disabilities. If you have a disability and need assistance with any part of the application or interview process or have questions about workplace accessibility, please contact +1-262-754-5030 (US and Canada only) or email job_posting@agilent.com. EOE AA M/F/Vet/Disability  Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}