{"jobID": "2634738165", "jobLocation": "San_Diego_CA", "jobTitle": "Data Analyst (Must be a US Citizen)", "companyRating": "3.4", "companyInfo": {"Website": "www.hjf.org", "Headquarters": "Bethesda, MD", "Size": "1001 to 5000 employees", "Founded": " 1983", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "57000", "jobDescription": "Updated: TodayJob ID: 211776Status: Full-TimeRegular/Temporary: RegularLocation: San Diego, CA, United StatesCome Work at HJF! HJF is seeking a Data Analyst to provide research support for the Recruit Assessment Program, a large epidemiologic research project located at the Naval Health Research Center (NHRC) in San Diego, CA.  Provides routine and non-routine statistical/analytical support for the department/division to enhance operating efficiency; exercises independent judgment in the resolution of analytical problems. Responsibilities: Designs and manages numerous research projects simultaneously. Designs requirements for research databases as well as conduct analyses. Maintains a data warehouse for the DoD Center. Performs data manipulations and statistical analyses using SAS. Writes reports and scientific manuscripts for peer-reviewed professional journals. Develops budget recommendations for statistical DoD Center support. Reviews and remains current with technical and scientific literature in biostatistics. Performs analytical and statistical work to include multivariable logistic regressions using survey data and Cox proportional hazard modeling. May direct work assignments. Prepares and presents informal and formal briefings at various international, national, and military activities. Reviews and assesses the work of other professionals in own field. Contributes to the team effort by accomplishing related duties as neededRequired Knowledge, Skills, and Abilities: Advanced knowledge of epidemiology. Knowledge of basic disease etiologies and preventive strategies. Advanced knowledge of survey methods and statistical methods used to collect and interpret survey data. Skill in use of word processing, spreadsheet, graphic, email, and database software. Skill in writing memorandums, correspondence, abstracts, articles, and proposals. Ability to plan and prioritize work. May require the ability to supervise and direct work assignments. Ability to make presentation to groups. Ability to be a self-starter and work both independently and in teams. Ability to interface with investigators, vendors, research staff, and study participants. Sample survey analysis experience, creating weights, using PROC SURVEYSELECT, PROC SURVEYLOGISTICMinimum Education/Training Requirements: This position requires a Master’s degree in Public Health or related field plus 4-6 years related experience. Physical Capabilities: Walking, standing, must be able to read reports, labels and use computer, must be able to hear well enough to communicate with coworkers, must be able to write, type, and use phone system Clearance: If a security clearance is not active upon hire, the candidate must be able to obtain a security clearance of secret for this position. Candidates will access DoD databases that have classified information. Work Environment: Normal office working conditions  Any qualifications to be considered as equivalents, in lieu of stated minimums, require the prior approval of the Director of Human Resources HJF is an equal opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status."}