{"jobID": "2685184437", "jobLocation": "New_York_NY", "jobTitle": "Sr. Claims Adjuster/Associate Bordereau", "companyRating": "3.3", "companyInfo": {"Website": "www.libertymutualgroup.com", "Headquarters": "Boston, MA", "Size": "10000+ employees", "Founded": " 1912", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Travelers, Allstate, State Farm"}, "estimatedSalary": "59000", "jobDescription": "Advance your Claims career at Liberty Mutual , Ironshore!Reporting to the Global Vice President Head of Claims Operations, the candidate will work as part of a claims team to process, manage, service and support specialty lines claims. Given the nature of this business, the candidate must be willing to work regular and consistent hours in office and be in a position to undertake other ad-hoc duties and special projects on an as needed basis.IronServe is the services business unit of Ironshore Insurance and provides global operations and support services for the company globally. This role is responsible for activities associated with the Bordereau/Reinsurance claims handling for all products and various claims systems.Candidate must be able to work from either our NYC or Simsbury, CT office: Full Time/ Five Days Week.Responsibilities:Liaising and building excellent working relationships with all levels of employees across the practice areasManaging and training a team of offshore techniciansCreating the workflow for seamless flow across all processesMonitor and maintain accounts that have high volumeVerify the information and update claim file for:Policy datesEmployment dates for the medical professionalsPolicy limitsUnderstanding of important dates particularly when claim is in litigationHandling custom account paymentsCredentialing a medical professional on board at a hospitalAssist in the document collection and review required for litigated claimsDevelop and organize computerized forms and letters for written reports and correspondence to claimants, internal contacts, and non-parties regarding the status of claims and pending litigationForm detailed reports to attach to claim files based on findings in loss runsFacilitate and implement several claims software systems within the department and update as needed for the processing and reportingMaintain data in numerous custom reports with the most current claim file information to provide back to actuaries, finance and Head of claims Operation, work with DMR Team in automationPreparing Financial monthly reports as part of Management Information System (MIS)Utilize Claims Department policies & procedures, workflows and manuals to meet Departmental production and quality metricsActively participate and collaborate with entire department to continuously improve workflows and performanceIdentify other claims work streams that can be brought into this department for handlingQualifications:Bachelors degree or equivalent trainingFive years of relevant Insurance experience preferredAppropriate state adjuster licenses requiredSolid working experience with Microsoft Office packages especially Excel, Word, Access, Viso, PowerPointSolid working knowledge of claims management techniquesExcellent organizational and prioritization skillsExcellent communication, interpersonal , positive work ethic and leadership skillsSupervisory/Management experience preferredExcellent customer service skills and personable demeanorCapable of performing work independently and efficientlyAbility to analyze, define and solve problems; the use of good judgment and decision makingAbility to focus in a busy office settingBenefits:We value your hard work, integrity and commitment to positive change. In return for your service, its our privilege to offer you benefits and rewards that support your life and well-being. To learn more about our benefit offerings please visit: https://LMI.co/BenefitsOverview:At Liberty Mutual, we give motivated, accomplished professionals the opportunity to help us redefine what insurance means; to work for a global leader with a deep sense of humanity and a focus on improving and protecting everyday lives. We create an inspired, collaborative environment, where people can take ownership of their work; push breakthrough ideas; and feel confident that their contributions will be valued and their growth championed.  Were dedicated to doing the right thing for our employees, because we know that their fulfillment and success leads us to great places. Life. Happiness. Innovation. Impact. Advancement. Whatever their pursuit, talented people find their path at Liberty Mutual."}