{"jobID": "2812122587", "jobLocation": "New_York_NY", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.forcebrands.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About The Position Glossier is looking for a Data Scientist to help take our data practice to the next level. You will work closely with business stakeholders to unlock a new understanding of our ever-expanding base of customers and help drive the smart use of data at the organization. You will use your insights to identify impactful questions, scope projects, propose approaches, and help to drive them to completion. If you enjoy the end-to-end process (extracting, cleaning, and modeling data) of providing insight into customer behavior, digital products, and innovative marketing strategies, then we want to hear from you! ResponsibilitiesChampion a data-driven culture by (1) empowering others to proactively use data to make responsible decisions and ask smart questions and (2) sharing and reviewing code to be a responsible contributorDefine, model, analyze, and measure key performance indicators to socialize facts (and corresponding caveats) to business stakeholdersWork closely with business partners to design and evolve dashboards for key business performance indicators and metricsCommunicate complicated topics across the organization in a way that is friendly and accessible to a diverse audienceProactively identify key strategic questions and problems; offer productive solutions focused on long-term and scalable benefitsAppreciate the importance of code review and actively solicit feedback from colleaguesQualificationsBachelors Degree in a technical discipline with strong experience in data & business analysis2+ years as a Data Scientist or related position with significant quantitative and analytical experienceAbility to manipulate and transform data to set up foundational data pipelinesExpert level knowledge of SQL and proficiency in:Python (preferred) or RRelational or NoSQL DatabasesLooker (preferred), Tableau, or similarStrong data visualization skills (e.g. D3.js, ggplot2, matplotlib, Looker, Tableau)Preferred QualificationsFamiliarity with site analytics and experiment design (e.g. A/B testing)Ability to generate complex analyses scalably, reproducibly, and to present subsequent insights across teams and to managementExperience with digital and/or e-commerce dataExperience with AWS or similar platformsExperience translating business analysis into consumer products strategyStrong project management skills, the ability to manage multiple projects simultaneously and the desire to bring structure to undefined processesStrong communication and interpersonal skills; must be personable yet persistentEnthusiastic, creative, entrepreneurial, self-starter attitudeHigh level of intellectual curiosity and comfort with ambiguityStrong communication skills (peers and leadership)"}