{"jobID": "2588528989", "jobLocation": "San_Mateo_CA", "jobTitle": "Data Analyst, CRM & Paid Media", "companyRating": "3.5", "companyInfo": {"Website": "www.playstation.com/en-us", "Headquarters": "San Mateo, CA", "Size": "5001 to 10000 employees", "Founded": " 1994", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Riot Games, Activision Blizzard"}, "estimatedSalary": "107000", "jobDescription": " PlayStation isnt just the Best Place to Play its also the Best Place to Work. Weve thrilled gamers since 1994, when we launched the original PlayStation. Today, were recognized as a global leader in interactive and digital entertainment. The PlayStation brand falls under Sony Interactive Entertainment, a wholly-owned subsidiary of Sony Corporation. Job Title: Data Analyst, Paid Media & CRM Description Whether you are working on innovative new hardware like PlayStation VR, AAA software like God of War, or disruptive network service products like PlayStation Vue, you will take part in the complete marketing experience, as you are involved in every facet of ideating, executing, analyzing, and optimizing our digital campaigns. From determining target audiences, designing test strategies, and communicating with internal or external partners, you will help shape the way that we communicate with gamers to grow our loyal PlayStation customer base. This means you work with a cross-functional team across marketing, BI, product, engineering, media agencies, marketing technology vendors and more. In this role, you will be involved with our targeted marketing strategy from beginning to end.  Be part of building the Paid Media and CRM Analytics team at Sony Interactive Entertainment (SIE) - a new team built behind dedicated leadership and deep investment in people and technologies. This role sits within the Marketing organization that oversees marketing for SIEs entire portfolio of products and services.  You will be generating actionable insights from complex customer data to drive growth in product engagement and customer lifetime value across all stages of the customer lifecycle. You will lead the way in helping the team develop a deep understanding of its current and potential customers. Your primary goal will be to ensure that we design and execute data-driven lifecycle marketing strategies that drive measurable growth in usage, cross-sell and customer retention/loyalty for all target segments. To achieve this goal, you will be responsible for identifying and communicating key customer insights and trends across multiple products within our portfolio.  You will be making an impact on marketing decision-making but also shape the customer experience. You will be a key stakeholder providing strategic guidance to the management and maintenance of our marketing tech stack, and bring data-driven thought leadership to our marketing efforts by conducting analysis and developing testing strategies that provide insight into the key drivers of digital marketing performance.  Marketing at SIE starts and ends with the gamer. Our job is to demonstrate how PlayStation truly is the Best Place to Play. ResponsibilitiesTake on a leadership role in the design, development and maintenance of how our organization approaches paid media analyticsWork closely with key stakeholders in product, BI and engineering to define data and technology requirementsEnsure the enforcement of legal and privacy standards for managing dataContribute to the management of vendor/agency relationships and deliverables.Define and implement customer segmentation and profiling strategiesTranslate business challenges into testable hypotheses, own/manage execution, tracking and results in ways that change the way we do businessManage, mine and analyze a broad array of quantitative and qualitative data assetsLead the application of insights to influence marketing strategies that drive measurable growth in customer acquisition and ongoing retention/satisfaction.Play a key role in managing campaign performance and ROI analysisProvide thought leadership and product management of reporting dashboards that track customer behavior and campaign performance against target benchmarks over timeIdentify and respond to key trends and opportunitiesDrive continuous improvements to our lifecycle marketing efforts through analysis, measurement, reporting and iterative testing and optimization planningCompile analyses for reports and conduct presentations to a broad audience, including marketing leadership, to shape strategic and operational decisionsResponsibilitiesWork collaboratively with campaign managers as the subject matter expert on our ecosystem of data to create custom segments and support campaign executionsPerform and report post campaign analysis that provide actionable insights on how to better communicate to our user baseCompile reports and conduct presentations to a wide variety of product and marketing teams to shape strategic and operational decisionsAdvise a variety of marketing and product managers on campaigns, including but not limited to lifecycle triggers and large scale testing strategies, using data-based insights with the goal of optimally achieving KPIs and creating new marketing opportunitiesTranslate business challenges into testable hypotheses, own/manage execution, tracking and results in ways that change the way we do businessMine and analyze a broad array of quantitative and qualitative data assetsWork across numerous internal and external marketing automation platforms (Sales Force Marketing Cloud, DMPs, Publisher and Social Partners, etc)Create and manage innovating reporting dashboards that track customer behavior and campaign performance against target benchmarks over timeUse exploratory data analysis to identify new marketing and optimization opportunitiesDefine and implement customer segmentation and profiling strategiesRun ad-hoc and scheduled customer lists to power PlayStations digital marketing channels Minimum Qualifications:SQL programming experience requiredMinimum 3-5 years experience working with relational databasesMinimum 5-7 years analytics experience, preferably within marketingAbility to collaborate and communicate effectively with a diverse group of partners including marketing, technical teams, and agenciesDemonstrable track record of data project management, thought leadership, and self-directionA passion for and the belief in the power of making data-driven decisionsA demonstrated interest in digital entertainment and gamingBA/BS degree requiredPreferred qualifications:Well versed in spreadsheet modeling and presentation-making skills that effectively present data in a compelling way, both verbal and written, to influence marketing decisionsDemonstrated analytical and quantitative skillsskilled at analyzing and deriving meaningful insights out of complex data and translating that into actionable strategiesPassionate about gaming and video game cultureSkilled in various programs such as Adobe Analytics and Google AnalyticsExperienced with BI visualization tools such as Tableau or MicrostrategyExecuted analysis projects related to lifecycle marketing, targeting segmentation strategies, cohort analysis and tracking, churn prevention, A/B and multivariate tests, and reporting dashboard design and development"}