{"jobID": "2792143902", "jobLocation": "Seattle_WA", "jobTitle": "Intern - Information Technology", "companyRating": "3.8", "companyInfo": {"Website": "www.pacificsciencecenter.org", "Headquarters": "Seattle, WA", "Size": "201 to 500 employees", "Founded": " 1962", "Type": " Nonprofit Organization", "Industry": " Arts, Entertainment & Recreation", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "38000", "jobDescription": " Information Technology Internship (18+, unpaid)  Pacific Science Center brings science to life. Our award-winning, interactive programs reach more than 1.3 million people around the state each year in their communities, classrooms and on our campus. We offer a wide variety of exhibits and programs, including standards-based formal and informal science education programs and an award-winning environmental education center.  The Information Technology team at Pacific Science Center seeks to help the organization run a smart and responsible business. The Information Technology Intern will support the efforts of the Technology and Risk Management teams by helping to develop and implement improvements to our PCI (Payment Card Industry) compliance program.  The Information Technology intern will receive support and direction from the Information Technology Manager.  Reports To: Information Technology Manager  Position Start Date: June/July 2018  Position End Date: September 2018  Job Duties Research requirements of PCI compliance and data security standardsWork with IT Manager, Risk Manager and other PSC staff in gathering, formatting and creating documents related to PSC PCI complianceDevelop a plan to continuously keep documentation updated in the futureWork collaboratively with the IT team and other Science Center staff to perform other duties as assigned Learning Opportunities Hands on experience with Microsoft Active Directory administration and the opportunity to apply IT knowledge in a workplace environmentIncrease knowledge of information security and gain a working knowledge of PCI compliance requirementsStrengthen communication skills through diverse interactions with a variety of Science Center staffGain insight into the inner-workings of a successful IT team with a demanding workloadIt may be possible to address additional learning objectives during the course of the internship. Should an interview be extended to a candidate, we welcome a discussion of personal educational goals. Position Requirements General knowledge of IT and business processes addresses by PCI complianceNetworking principles, TCP-IP, Active Directory, firewalls, workflows and IT security and data security principlesMust be actively enrolled in an undergraduate program at an accredited local university, with a major related to information technology or risk management and a cumulative GPA of 3.0 or aboveStrong technical and organizational skills in addition to excellent written and verbal communication skillsEnthusiasm for learning about Pacific Science Center's mission, programs and the workings of a not-for-profit organizationAbility to work both cooperatively with other people and also independently, taking ownership over processes and proceduresMust be able to provide three references (at least 1 professional) and pass a national background checkBenefitsApply IT skills and knowledge learned in courses in the workplaceDevelop skills in project management, networking, Active Directory, IT security and risk managementBuild resume and explore career optionsFlexible scheduling to allow for finals and changes in class scheduleReceive PSC Membership during your internshipBus or parking passes on the days you volunteerExpand your network of contacts and raise your visibilityUpon successful completion of internship, you will be provided with letter of recommendationPACIFIC SCIENCE CENTER We are an independent, not-for-profit educational institution that ignites curiosity in every child and fuels a passion for discovery, experimentation, and critical thinking in all of us.  Pacific Science Center is an equal-opportunity employer. We value diversity and it is expressed in all aspects, from the people and communities we serve to our organizational culture and our employees. Pacific Science Center does not discriminate on the basis of any trait protected by law such as age, race, gender, veteran status, or disability in admission or access to, or employment in, its programs or other activities.SDL2017"}