{"jobID": "2823638028", "jobLocation": "San_Diego_CA", "jobTitle": "Business Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.sionline.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "59000", "jobDescription": " Company DescriptionStrategic Insight delivers full service solutions to the asset management sector worldwide, including investment flow data, advisor sales analysis, in-depth research, analytics, editorial content and events for investment managers, asset owners and custodians, plus Transaction Cost Measurement of over 500 million trades per month. Our clients include over 1000 of the most prominent names in the asset management industry, including 83 of the worlds 100 largest fund managers.Strategic Insight delivers its products and services through four distinct divisions: SI Data, SI Research, SI Intelligence and SI Interactive.Our clients work with the Market Metrics/Strategic Insight team because we provide both high-quality data on their business and a proven ability to help them analyze, internalize and discuss the real, strategic implications of that data. This unique combination has resulted in a business built on helping clients make informed decisions year after year that will improve their performance.Job DescriptionStrategic Insight is seeking a Business Data Analyst to review, analyze and evaluate business process and user needs on our Financial Consortium Software. This individual will document requirements, define scope and objectives and formulate improvement plans to allow for internal automation of existing processes. The Analyst will interact with the existing Data Analyst team, Software Engineers, Scrum Master, and Product Management in building out business/data requirements.  Core responsibilities of the Analyst include, but are not limited to: Determine operational objectives by studying business functions; gathering requirements; evaluating output requirements and formatsConstruct workflow charts and diagrams; study system capabilities; write specificationsImprove systems by studying current practices; suggest and design business operation modificationsRecommend controls by identifying problems; writing improved proceduresDefine project requirements by identifying project milestones, phases and elements; work as a team to solve challengesSuggest changes to senior management using analytics to support recommendations; Actively participate in the implementation of approved changes QualificationsThe ideal candidate will demonstrate the following characteristics and attributes: Bachelors degree in Finance, Economics, Computer Science, Engineering, Analytics, Computer Information Systems or a related field2-3 years analyst experience, idealBackground in financial services, a plusFamiliar with database architecture/structureAgile service delivery life cycle (SDLC) methodology experienceAbility to impact operations and effect change without being confrontationalDetail oriented, analytical and inquisitiveAbility to work independently and with othersProactively applies critical thinking to problems and seeks solutionsExtremely organized with strong time-management skillsExcellent communication skills, both written and verbalProficiency with JIRA or other agile development softwareProficiency with Python, R, SQL or other data analysis and wrangling languageProficiency with MS Office software (Excel, PowerPoint, Word, Outlook, Access, Visio) Additional InformationThis is an excellent opportunity to join a very talented team in our San Diego office. Competitive salaryBenefits packages (Medical, Dental, Vision, 401k match, Flexible Spending accounts, Life Insurance, and more)Paid time offHealthy Snacks Strategic Insight is an Equal Opportunity Employer."}