{"jobID": "2830663393", "jobLocation": "Marlborough_MA", "jobTitle": "Programmer, Sr Statistical (Health Data Analyst)", "companyRating": "4.0", "companyInfo": {"Website": "www.bostonscientific.com", "Headquarters": "Marlborough, MA", "Size": "10000+ employees", "Founded": " 1979", "Type": " Company - Public (BSX) ", "Industry": " Manufacturing", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Medtronic, Abbott Labs, Edwards Lifesciences"}, "estimatedSalary": "101000", "jobDescription": "Primary Location: [[filter2]] Additional Locations: (n/a); US-MA-Marlborough Requisition ID: 429867       About the role: The Sr Analyst will leverage, and promote large retrospective databases (health insurance claims, national surveys, hospital discharge data and other data) to support internal requests for data and analyses related to all BSC products and disease areas.The Senior Analyst will act as a consultant to their cross-functional partners in HEMA, Marketing, Corporate Sales, Healthcare Solutions and Clinical.    Your responsibilities include: · Establish project priorities that align with business objectives.  · Maintain and foster a collaborative relationship with internal [Health Economics & Market Access (HEMA)] and external customers (marketing, clinical, new business development, corporate sales).  · Work with business units to generate awareness of data and how data can be used to support business needs.  · Develop plans for creating new tools, data cubes and reports to support business objectives.  · Develop analytic plans and provide consulting advice on reimbursement and external customer projects.  · Coordinate and communicate with HEMA colleagues to support health economics and outcomes research studies.  · Analyze data and provide insights to support to BSC business needs  · Manage database infrastructure, processes/procedures, and documentation.  · Maintain high standards for data quality, reporting, and timely project execution.  · Serve as a technical resource for SAS programmers and verify/review their programming as needed.    What we're looking for: Basic Qualifications: Minimum 3-5 years of experience with statistical programming and analysis.Bachelor or Master’s Degree (preferred). Coursework or degree in health economics, public health, health services research, epidemiology, biostatistics, health care administration or related discipline highly desirable.Knowledge of statistical methods and SAS programming.Experience analyzing and solving complex technical problems including issues with health care claims data analysis. Preferred Qualifications Experience developing tools, reports, and other products using claims dataKnowledge of data visualization tools such as tableau, cognos or other applications Self-starter, team-playerExcellent oral and written communications skills and problem-solving ability.Detail-oriented. Boston Scientific is an Equal Opportunity Employer."}