{"jobID": "2827876057", "jobLocation": "Mountain_View_CA", "jobTitle": "(USA-CA-Mountain View) Data Analyst, Hardware Customer Care Analytics", "companyRating": "4.4", "companyInfo": {"Website": "www.google.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (GOOG) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Apple, Facebook"}, "estimatedSalary": "106000", "jobDescription": " The Hardware Customer Care team engages with dedicated customers across the globe through our online resources and communities, social outreach, and 1:1 care. We represent the voice of the consumer and work closely with cross-functional partners across Google to make our products and policies better. We're looking for people with excellent analytical and communication skills who are passionate about the consumer and helping them get the most out of Google.  As a member of the Data Services team within business systems for the Hardware Support Operations, you'll gather, assess, and manage data about every part of Googles support operations and transform it into strategic insights, analysis, and reporting. As a Data Analyst, youll be working hands-on with Product, Support, User Voice/Feedback and Operations data, shaping discussions on relevant metrics and data signals to define an excellent user support experience.  Google's mission is to organize the world's information and make it universally accessible and useful. Our Hardware team researches, designs, and develops new technologies and hardware to make our user's interaction with computing faster, more powerful, and seamless. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, our Hardware team is making people's lives better through technology.  ## Responsibilities Define and action analysis on operational data sets to provide strategic recommendations to multiple levels of leadership; package analysis for reports and presentations to shape strategic and operational decisions.Draw insights from analyzing data to improve Consumer support experience and efficiency.Contribute to strategic planning around product launches.Build and maintain the Consumer Hardware Support Operations Analytics infrastructure.Customize and maintain tools to provide insights and visibility into key strategic and operational performance of the organization. ## Qualifications Minimum qualifications:BA/BS degree in Computer Science, Engineering, Economics, Business or a related degree, or equivalent practical experience.4 years of experience in an analytical role such as data analytics, business intelligence, statistical modeling or consulting.4 years of experience in SQL or data visualization tools (eg Google dashboards, Data Studio, Tableau).Preferred qualifications:Experience in designing and executing structured analysis, deriving business insights, and evaluating the impact of business decisions.Experience working with and developing for non-technical users (defining requirements, explaining technical concepts to non-technical business users, etc.).Experience in other scripting languages and business intelligence tools.Demonstrated ability to analyze complex data-sets in a fast-paced environment, with the ability to work strategically and objectively.Ability to deal with and prioritize multiple priorities while driving towards pragmatic decisions.Excellent oral and written communication skills, with the ability to communicate findings in a structured and clear manner to a non-technical audience.* * At Google, we dont just accept difference - we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you have a disability or special need that requires accommodation, please let us know.  To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees or any other company location. Google is not responsible for any fees related to unsolicited resumes."}