{"jobID": "2796124484", "jobLocation": "San_Jose_CA", "jobTitle": "Account Executive (Inside Sales)", "companyRating": null, "companyInfo": {"Website": "www.fishercareers.com", "Headquarters": "Camas, WA", "Size": "1001 to 5000 employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OverviewImagine walking into a sales environment surrounded by driven, intelligent, and passionate individuals determined to impact the financial industry. As an Account Executive, you pick up the phone and engage with high-net-worth individuals who expressed interest in Fisher Investments’ materials. Using sales techniques, you’ll determine the individual’s investment goals and educate them on our strategy. You are the liaison between a prospective client and the firm - impacting both the prospect’s financial future and the firm’s overall growth. The Challenge: Through hands-on experience, training, and mentorship, your personal development in the role is exponential. Surrounded by competitive professionals, you will grow your sales skills, build relationships within the firm, and earn an opportunity to create your own career path. The Account Executive position is both a rewarding and challenging role. Setting an appointment between a high-net-worth investor and a member of our Outside Sales Force is a victory.  Watch your name move up the rankings as you help provide the firm with another opportunity to impact a prospective client’s future. Based on a salary plus uncapped-commission pay structure, you have the comfort of some guaranteed income with the possibility that accompanies uncapped, performance based commission.  Simply put: The harder you work, the more you earn.The Benefits: Being a part of a fast growing wealth management firm is demanding but we expect you to enjoy your time off, too. Work-life balance is a central focus of Fisher Investments’ culture. As an Account Executive, you will work 8-hour days. Everything stays at the office. You never have to worry about work following you home. With generous paid time off and a beautiful surrounding area, your options are endless. Concerned about your financial future? So are we. Fisher Investments offers a 50% 401K match and fully paid premiums for medical, dental and vision insurance.  We look at the financial industry in a unique way. When you see things others can’t, you can do things others never considered possible. Apply now to see if you have what it takes.  FISHER INVESTMENTS IS AN EQUAL OPPORTUNITY EMPLOYER.  #LI-FI1  #PDN"}