{"jobID": "2610648208", "jobLocation": "Boston_MA", "jobTitle": "Behavior Technician (ABA Therapist)", "companyRating": null, "companyInfo": {"Website": "www.ne-aba.com", "Headquarters": "Wakefield, MA", "Size": "51 to 200 employees", "Founded": " 2015", "Type": " Unknown", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "***Bi lingual (Spanish/Portuguese) candidates are encouraged to apply! Looking to make an impact in the lives of children, adolescents and their families living with Autism?  New England ABA, a leading provider of ABA therapy in the Greater Boston area, is currently seeking part-time Behavior Technicians to work directly with our clients. What we offer at New England ABA!Highly competitive hourly rate of $18-26 . New England ABA will never lose an amazing candidate over pay rate and will match or exceed any competitive offers.Paid training that meets BACB RBT requirements with RBT certification eligibility offered to interested applicants.Paid drive time and mileage between client visitsUnique company culture focused on changing lives through our therapyCompany volunteer opportunities to give back to the communities we serveReferral Bonus Program for all employees!Overview of Job Behavior Technicians at New England ABA work directly with our clients in home, community and school based settings. Utilizing training provided both at time of hire and on an ongoing basis, our Behavior Technicians apply individualized treatment plans with our clients under the supervision of a Board Certified Behavior Analyst (BCBA). Sessions typically last two hours in duration and take place between 3-8PM in the client's home. The position typically offers between 15-20 hours per week. What we are looking forPositive, solution focused attitude.Passion for working with children and adolescents.Interested in professional growth through the use of a growth oriented mindset.Proven track record of growth and success in prior employment.Qualifications Applicant experience must meet one of the following:  1. a high school diploma or a general education development (GED), and have 12 months experience working with persons with developmental disabilities, children, adolescents, transition age youth, or families.  2. An associate's degree or higher in a related field (e.g. psychology, human services, education, behavior management, etc.) from an accredited community college or educational institution with a minimum six months prior experience working with persons with developmental disabilities. Other RequirementsMust be able to provide current driver's license and proof of car insurance.Must be available to work weekday shifts between 3-8PM. Weekend appointments will be available to interested applicants.Employment is subject to a criminal background check.Must be 18 years or older. New England ABA provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics."}