{"jobID": "2776358605", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Data Scientist 1: Translational Programs", "companyRating": null, "companyInfo": {"Website": "www.calicolabs.com", "Headquarters": "South San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Who we are: Calico is a research and development company whose mission is to harness advanced technologies to increase our understanding of the biology that controls lifespan and healthspan, and to devise interventions that enable people to lead longer and healthier lives. Executing on this mission will require an unprecedented level of interdisciplinary effort and a long-term focus for which funding is already in place. Position description: Calico is seeking a biostatistician with experience in epidemiology, time series/longitudinal analysis, and/or genomics, in order to support the translation of scientific discoveries made at Calico to novel therapies.  As a member of the Data Science team you will work closely with other data scientists and software engineers as well as clinicians and scientists to generate and pursue hypothesis. Position responsibilities:Perform analyses of different levels of sophistication in human cohorts to identify clinically meaningful associations between genotype, environment, phenotype, and health outcomesPerform meta-analyses on multiple large cohortsCommunicate results to multiple stakeholders (both internal and external to Calico)Design and analyze experiments in collaboration with scientistsDevelop re-usable software to support common analysis pipelinesPosition requirements:A Master’s degree or a Bachelor's degree with 2+ years of work experience in statistics, biostatistics, or epidemiology, medical informaticsExcellent coding skills in Python and/or R.Experience presenting results to a broad group of stakeholders, e.g. through scientific publication or participation in conferencesNice to have:Experience with at least one of: genomics, clinical health records, translational research, clinical drug development"}