{"jobID": "2821678587", "jobLocation": "San_Francisco_CA", "jobTitle": "Accounting Manager", "companyRating": "4.2", "companyInfo": {"Website": "www.ncphs.org", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "106000", "jobDescription": "SUMMARY:Oversees various aspects of accounting management and financial reporting. Ensures compliance with NCPHS policies and procedures, GAAP, the U.S. Department of Housing and Urban Development (HUD), LIHTC (Low Income Housing Tax Credits), labor regulations and all other applicable regulations and guidelines. Manages Senior Accountants assigned to billing, grants and general ledger functions. Assists the Controller with the development, implementation, and maintenance of sound accounting policies, procedures, and systems of internal control which safeguard the assets of NCPHS.ESSENTIAL FUNCTIONS:Manages the Affordable Housing, Community Services and the Woods accounting functions including, but not limited to, billing, accounts receivable (AR), accounts payable (AP), payroll and fixed assets. Provides technical skills and oversight to account for complex transactions in accordance with generally accepted accounting principles.Interviews, hires, supervises, trains, motivates, and provides performance management of Home Office Accounting staff as assigned.Reviews journal entries and approve payable batches. Prepares journal entries and account reconciliations for more complex areas of accounting, such as equity, intercompany, seller carry back loans, leases and debt.Manages the month, quarter, and year-end close procedures, including review of journal entries, account reconciliations, analysis of results, close calendar and close reporting package, which includes but not limited to, accounts receivable, fixed assets, and accounts payable. Coordinates and ensures accuracy and timeliness of internal and external financial reporting and billing of grants. Perform monthly flux analysis on P&L; and Balance Sheet accountsCreates, implements and maintains NCPHS accounting systems, policies, and procedures. Performs internal audits to review and analyze adequacy of accounting procedures and internal controls in selected areas. Presents conclusions and recommendations toCollaborates with IT and Finance staff on the enhancements to the financial systems as needed including, but not limited to, AR/AP/ GL/ Payroll and FinancialEnsures that HUD and site managers are trained in the new processes and that system integrity is maintained. Review and analyze monthly billing to ensure that it reconciles to occupancy and grant billing thus ensuring data integrity, consistency andCoordinates and ensures accuracy and timeliness of internal and external financial reporting for HUD and other regulatory Prepares monthly/ quarterly investor financials and analysis for Tax Credit properties. Reviews and approves all monthly grant billing.Coordinates and conducts internal audits relating to HUD as well as Community service sites.Prepares audited financial reports for 3 corporate entities and 3 corporate tax returns and preparation of HUD A-133 audits as needed. Works directly with financial auditors and tax accountants and coordinates the gathering and analysis of relevant information, prepares Client (PBC) schedules and addresses auditor requests. Ensures deadlines are met.Assists in preparing HUDs/ Senior Housing/ Community Service and Senior center budgets and forecasts; participating in business planning and analyses for NCPHS and itsAssists in managing NCPHS Senior Ventures properties including providing financial guidance and expertise to staff and Board. Prepares audited financial statements and tax returns.Facilitates the Accounting team’s commitment to timely and accurate processing of accounting transactions in accordance with GAAP and internal controls. Leads, mentors and provides support to the Home Office Accounting team asProactively identifies issues and areas for improvement within the close process and implements process improvements with documented policies and procedures.Ensures that Injury and Illness Prevention Program (IIPP) requirements are being met and in compliance with NCPHS policies and procedures and the California Code of Regulations, Title 8.Provides back up coverage to the Controller, Accounting Manager - CCRC, Senior Accountants and other accounting staff as needed.Performs other work asQUALIFICATIONS:Bachelor's degree in accounting, finance, business administration or equivalent required. CPA preferred. Minimum of six (6) years of accounting experience as Senior Accountant or higher position in a non-profit, Tax Credit and property management industry required. Audit experience highly desirable.SUPERVISORY RESPONSIBILITY: Manages up to 2 Senior Accountants in Home Office Accounting Department."}