{"jobID": "2818557137", "jobLocation": "Andover_MA", "jobTitle": "Automation Engineering Intern", "companyRating": "3.4", "companyInfo": {"Website": "www.enel.com", "Headquarters": "Roma, Italy", "Size": "10000+ employees", "Founded": " 1963", "Type": " Company - Private", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $10+ billion (USD) per year", "Competitors": " E.ON, EDF, Iberdrola"}, "estimatedSalary": "44000", "jobDescription": " Enel Green Power North America is a leading owner and operator of renewable energy plants in North America with projects operating and under development across the US and Canada. At Enel, we have a fast paced work environment and talented employees who crave learning new skills and aren't afraid to tackle big projects. As an intern, you will get the opportunity to work with a variety of our staff while contributing to real projects that will help grow and foster our core values of proactivity, trust, responsibility and innovation. EGPNA SCADA Performance improvement initiatives The intern will be immersed in a diverse group ranging from Automation/SCADA Engineers to operations experts to work on EGPNA Central control and data acquisition system (EGPNA SCADA) managed all power plants across North America. The area of focus for the intern will be to develop identified EGPNA SCADA improvement initiatives, improve system performance and propose new initiatives based on investigation findings. The areas of focus are: 1) optimization of data storage strategies based on power plant real-time operation needs and overall business and regulation requirements. 2) Rationalize list of data point collection and real-time alarming.  The intern will be guided through the project by the Senior Automation/SCADA Engineers to study and implement improvement identified. The project will allow the intern to apply automation engineering knowledge on practical industry case and measure tangible results of the work.  The intern should have an Engineering Educational background related to Automation, Computer Science or Electrical specialties.  Any knowledge or exposure to the following specific subject will be highly regarded: SCADA system, Power Generation/Transmission/Distribution, Real-time Database and Data Acquisition, Oracle database, SQL language."}