{"jobID": "2783941193", "jobLocation": "San_Jose_CA", "jobTitle": "Manufacturing Technician", "companyRating": "2.8", "companyInfo": {"Website": "www.labcyte.com", "Headquarters": "San Jose, CA", "Size": "201 to 500 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " TECAN U.S., Hamilton, EDC Biosystems"}, "estimatedSalary": "20", "jobDescription": " JOB #294Manufacturing Technician – Contract  Location: San Jose, CAThe Contract Manufacturing Technician will be responsible for manufacturing, testing, and troubleshooting Labcyte’s line of liquid-handling instruments and automated platforms.  The ideal candidate has been involved from the ground up with instrument manufacturing in a production environment with high consistency and quality. They will be expected to participate at a relatively high level to make our manufacturing process as efficient as possibleJob Responsibilities Manufacture, align, test and troubleshoot subassemblies and final assemblies that meet product specificationsUtilize test methodologies and requisite equipment to ensure in-process and outgoing quality metricsImplement improvements in product cost, production efficiency, and product qualityOther manufacturing and shipping tasks as required Education, Skills, Experience, and Requirements Experience with linear motion and drive systems, precision mechanisms, fluid control, chassis and cable routing requiredMinimum of five years of relevant experience in manufacturing capital equipment requiredSkilled in building and troubleshooting computer-controlled electro-mechanical assemblies and systems (preferably laboratory equipment) requiredSkilled with basic hand and power tools (e.g. soldering iron, drill and taps, DVM, static straps, torque drivers, crimpers, pin extractors)Associates degree in a technical disciplineMust be comfortable working around RF and lasersEffective and analytical problem solving skillsSkilled with interpretation of drawings, procedures, specifications, etc.Excellent communication, planning, organizational & interpersonal skillsExperience using all MS Office productsExperience manipulating computer configuration and database filesMust be able to work for extended periods on their feet, and lift and transport up to 50 poundsMust be capable of lifting and locating components and devices up to 50 pounds from a crate on the floor to a table up to 6 feet away at waist height and from waist height to shoulder height.Must be capable of assembling and disassembling small to medium assemblies and cables while standing on an elevated surface 3’ above the ground.Familiarity with liquid handling a plus LOCATION: San Jose, CA  Candidates only, no recruiters or agencies.About LabcyteLabcyte, a global biotechnology tools company headquartered in San Jose, California, is revolutionizing liquid handling. Echo liquid handling systems use sound to precisely transfer liquids. Labcyte instruments are used worldwide by all twenty of the top twenty pharmaceutical companies, as well as by small to mid-size pharmaceutical companies, biotechnology firms, contract research organizations and academic institutions. Labcyte’s customers work across a wide spectrum of biology including drug discovery, genomics, proteomics, diagnostics, imaging mass spectrometry."}