{"jobID": "2806680591", "jobLocation": "New_York_NY", "jobTitle": "Patient Access Manager", "companyRating": null, "companyInfo": {"Website": "www.horizonpharma.com", "Headquarters": "Lake Forest, IL", "Size": "501 to 1000 employees", "Founded": " 2008", "Type": " Company - Public (HZNP) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Abbott Labs, Pfizer, POZEN"}, "estimatedSalary": null, "jobDescription": " Working at Horizon Pharma is more than a job – it’s personal. We define success by a different set of numbers: the number of lives touched, the number of lives changed, the number of lives saved. We’re a team of agile, out-of-the-box thinkers who are inspired to do more because we know we’re a part of something bigger. We strive to build meaningful careers at a company whose values we share because when we live up to our potential, we help patients live up to theirs. Responsibilities:Support and educate about Horizon Pharma products and services, including product support and information, dosing and administration, reimbursement services, and other education as needed.Provide reimbursement education and support to physician’s offices with specific emphasis on TranscendRare/HorizonCares reimbursement support services.Secure written opt-in and HIPAA waivers to the patient support program for patients in the region.Maintain contact with patients who have opted-in and ensure excellent customer service.Connect patients with insurance services when necessary to ensure continuity of care for the patient.Help patients and families to resolve logistical challenges with insurance and pharmacies when necessary.Address patient and patient family questions and concerns; resolve patient/caregiver issues.Educate patients on external advocacy programs that may be available in the region, as needed.Partner with Safety and PV. Report AE’s and product complaints through medical information.Adhere to professional standards, compliance guidance, policies and procedures, federal, state, and local requirements.Represent Horizon Pharma at external meetings.Coordinate with reimbursement managers and home office commercial team.Required Qualifications, Skills and Education:Bachelor’s Degree required5+ years of field-based experience in patient services or reimbursementScientific background and ability to learn product and disease informationFamiliarity with HIPAA guidelines and FDA requirementsFamiliarity with and Adherence to internal and OIG Compliance guidelines a mustAbility to handle difficult patient cases and resolve hurdlesAbility to work in team environment and manage communication with reimbursement and sales representativesAbility to respond immediately when necessary (within 24 hours) to prevent lapses in treatmentStrong analytical skills and ability to report on meaningful activity in the regionProficient in Microsoft Office.Professional, proactive demeanor.Strong interpersonal skills.Excellent written and verbal communication skills.Preferred Qualifications, Skills and Education:Prior experience as a case managerNursing, or other clinical backgroundTravel Requirements:Up to 75% travel required, including quarterly national travel to company meetingsEssential Core Competencies: Action OrientedProblem SolvingOrganizationFunctional/Technical SkillsPriority SettingDrive for ResultsStrategic AgilityIntellectual HorsepowerDealing with Ambiguity Horizon Pharma plc does not discriminate on the basis of race, color, religion, gender, sexual orientation, national origin, age, disability, veteran status, or any other characteristic protected by law. It is our intention that all qualified applications are given equal opportunity and that selection decisions be based on job-related factors. Any individual, who, because of a disability, needs accommodation or assistance in completing this application or at any time during the application process, should contact the Human Resources Department."}