{"jobID": "2614371266", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.instacart.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Consumer Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "151000", "jobDescription": " Instacart is building the best way for people anywhere in the world to shop for groceries. Since Instacart started in 2012, weve launched same-day delivery in 200 US markets. We are laser focused on delivering groceries from your favorite stores right to your door. We now cover over 60% of US households and aim to have 80% coverage by the end 2018that's 90 million households! From a technology point of view, the platform is complex, rapidly scaling and processing millions of transactions in real-time all of the time. Our technology coupled with operational expertise enables Instacart to deliver fresh groceries in as little as an hour. This is a difficult problem to master and we are making it happen. Every day, we solve incredibly hard problems to create an experience for our customers that is absolutely magical.  You will be joining our growing data science team and you will have a chance to make a large impact at Instacart. You will be embedded within our data driven product team to identify key metrics, conduct deep and rigorous analysis, and deliver insights to the team to drive product improvement. You will be a trusted partner in the team tackling the toughest and most impactful analytical problems while making the data accessible to your teammates. More details on what youll be doing: ResponsibilitiesConduct quantitative research and analysis of Instacarts data requiring complex data retrieval that results in actionable insights and recommendationsIdentify key questions, problems, and KPIs to increase the depth of our catalog and improve the experience of our customers using your sharp business acumen and judgmentHelp develop effective and scalable data models in our production environment and develop, build, and maintain a user friendly version our production data in our data warehouseWork daily with product managers and engineers to discover and guide the most impactful product investmentsDesign and analyze rigorous A/B experimentsProvide access to data through dashboards and other analytical tools to empower your team through self service. Look for opportunity to automate insights through alerting and anomaly detectionRequirementsPassion for, and a track record of leveraging data for business impact, preferably in a consumer facing digital environmentAbility to write complex and performant queries in your dialect of SQL to extract data from our Redshift clusterExperience building tools and automated processes to extract, clean, and distill data in a procedural language of your choice such as Python, Julia or RUnderstanding of A/B testing and other forms of statistical analysis using statistical packages similar to R, SAS, or PandasExperience with analytical visualization tools such as Tableau, Looker, D3.js or similar toolsExcellent communication skills with the ability to distill complex problems into meaningful and digestible insightsDesirableData modeling, ETL and data pipeline development experiencePrevious experience with cleaning, integrating, and maintaining diverse data sources into a cohesive product catalogUnderstanding of advanced analytical techniques to identify trends and groupings in our vast catalog dataAdvanced degree in statistics or other quantitative fieldIn your application, please describe the most impactful research project you have been a part of. Describe the problem, outcome/impact and your role in the project. BenefitsTalented and collaborative coworkers who will both push and support youPersonal growth plans that let you stretch yourself or grow in new directionsMarket competitive salary, equityMedical, dental, vision benefits and 401(k) retirement planGreat office in downtown SFTake what you need vacation ( and we really mean it )16 weeks maternity leave / 8 weeks paternity leave so you can truly bond with your childResourcesTeam Culture"}