{"jobID": "2827940798", "jobLocation": "Redmond_WA", "jobTitle": "Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.microsoft.com", "Headquarters": "Redmond, WA", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (MSFT) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Amazon, Apple"}, "estimatedSalary": "95000", "jobDescription": " The Customer Data and Analytics (CDnA) team provides strategic, data, operational, reporting and analytics services for the Devices marketing teams at Microsoft. Come join us to support the core operational reporting infrastructure as a Data Analyst.  This role is critical to the success of delivering regularly scheduled reports, tools, and analysis to marketers within Xbox, Surface, and other Microsoft devices. This role will partner closely with team peers on the development, validation, deployment and on-going operations of new reports and toolsets that provide vital key performance indicators on measuring the impact of our marketing efforts. This role will be hands-on, querying internal data sources to analyze behavior data and provide insights on customer engagement, preferences, and monetization. A passion for gaming and curiosity for the overall gaming and PC industryUnique balance of technical, development, project and program management skillsSolid project management (Agile Scrum, PMP/PMI) skillsCompetency in database and development programming frameworks - e.g. experience with technologies such as SQL (Server/SSIS/SSAS), C#, Azure Data Lake, Hadoop or similarHands-on experience with Microsoft BI toolsets, in particular building PowerBIs visualizations and supporting data modelsIntermediate to advanced experience with unstructured datasets (Cosmos and/or Hadoop)Knowledge of internal data sources, databases, information systems and platforms is a plusProficiency in advanced Excel functions (e.g., creating formulas, pivot tables)Self-starter with the ability to handle ambiguity and bring clarity and vision to such situationsStrong ability to articulate vision, requirements&benefits;, providing a solid rationale to multiple business and technical partnersStrong communication skills, excellent collaboration and negotiation skills and the ability to work effectively across teams and organizations in a global work environmentAbility to thrive in a fast-paced, dynamic business environment among a diversity of disciplinesAbility to lead by example through personally delivering high-impact work resultsAbility to influence diverse audiences5+ years of experience in business planning or project management is required3+ years of experience writing SQL and C# scripts is requiredA minimum of a Bachelor's degree in technology, business, marketing or a related field is requiredMaster's degree in technology, business, marketing, or similar field preferred Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.  Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work. MLDFY18Create&maintain; operational processes of existing and new reportsOversee onshore&offshore; resources assisting with report development and operational processesTroubleshoot&unblock; processing issues as they occur during routine report refreshesDrive the report development enhancements needed for existing reports and processesProvide input into business requirement documentation, technical and functional specs for the new report developmentInterface with business users and engineering teams to bridge the gap in terms of data needs and business term/logic understandingCoordinate with team members across multiple BI teams for data&analysis; needsLeverage industry best practices in establishing repeatable BI practices, principles&processes;Refine, improve and centralize team capabilities as well as share to the broader business and analytics community"}