{"jobID": "2711397488", "jobLocation": "Boston_MA", "jobTitle": "Data Scientist, Algorithms", "companyRating": "3.5", "companyInfo": {"Website": "www.wayfair.com", "Headquarters": "Boston, MA", "Size": "5001 to 10000 employees", "Founded": " 2002", "Type": " Company - Public (W) ", "Industry": " Retail", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Amazon, One Kings Lane, Crate and Barrel"}, "estimatedSalary": "105000", "jobDescription": " We're seeking a talented data scientist interested in developing and deploying models with high business impact.  You have very strong coding skills (though not necessarily software engineering experience), and you want to improve and leverage them on data science projects. You're passionate about using advanced statistical methods to tackle tough problems as a data scientist and also about wrapping your solutions in clean code to make data products that are \"built to last.\" About Algorithms Unit: Algorithms Unit is a close-knit group of data scientists within the Pricing & Profitability team that is responsible for dynamically adjusting prices on millions of products worldwide.  As the largest and fastest growing e-commerce technology company in the home space, Wayfair interacts with a large volume of product data, user data and order data. This makes predictive analytics solutions critical to managing prices and providing core business solutions. Algorithms Unit develops solutions that affect billions of dollars in revenue and has end-to-end responsibilities for projects. These include data exploration, model selection, optimizing fit, running machine learning algorithms at scale and iterating with experiments for long-term improvement.  Candidates should be data-savvy, have strong coding skills, and be driven to complete projects that make a business impact at scale. In this role you will work with a talented and diverse group of PhDs, data scientists, economists, business analysts as well as software engineering teams, so excellent communication skills and keen business sense are crucial. Responsibilities:Develop algorithms that impact billions of dollars in revenue relating to pricing, costs, and other business problemsEvaluate performance of current models and iterate on optimization (feature engineering, model selection, parameter tuning)Scout areas of opportunity, create and lead projects from start to finishWrite production code and make valuable contributions to the Algorithms Unit toolkit (reusable code)Maintain machine learning models, data processing stages, and scheduled jobsQualifications:BA/BS/MA/MS plus 2-4 years' experience working with data, or PhDDegree in any quantitative field where data and statistics are important, or mathematicsStrong statistical background; machine learning experience highly valuedStrong programming skills relevant to data science:Preferred stack: Python + IPython Notebook, NumPy, pandas, machine learning packagesR, Matlab and other data/statistical language experience also valuedExcellent communication skills, including summarizing/describing your projectsProjects demonstrating data prowess and/or coding prowessBonus:Programming experience on non-data related projects in any languagesExperience working with data in a business contextExperience with SQL or other databasesExperience with big data (Hadoop, Spark)Experience with Git, GitHub, bash / UNIX scripting Check out some of our work here: https://tech.wayfair.com/team-data-science/About Wayfair Inc. Wayfair believes everyone should live in a home they love. Through technology and innovation, Wayfair makes it possible for shoppers to quickly and easily find exactly what they want from a selection of more than 10 million items across home furnishings, décor, home improvement, housewares and more. Committed to delighting its customers every step of the way, Wayfair is reinventing the way people shop for their homes - from product discovery to final delivery.  The Wayfair family of sites includes: Wayfair, an online destination for all things homeJoss & Main, where beautiful furniture and finds meet irresistible savingsAllModern, unbelievable prices on everything modernBirch Lane, a collection of classic furnishings and timeless home décorPerigold, unparalleled access to the finest home décor and furnishings Wayfair generated $5.2 billion in net revenue for the twelve months ended March 31, 2018. Headquartered in Boston, Massachusetts with operations throughout North America and Europe, the company employs more than 8,700 people. Wayfair does not accept unsolicited candidate referrals or resumes / CVs from third-party vendors, including recruitment agencies. Wayfair will not be responsible or liable for any fees or costs associated with such unsolicited submissions."}