{"jobID": "2583190391", "jobLocation": "Bellevue_WA", "jobTitle": "Senior Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.pokemon.com", "Headquarters": "Bellevue, WA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "154000", "jobDescription": "Job Title Senior Data Scientist Position Summary We are looking for an experienced and creative Senior Data Scientist interested in building, defining and pushing the boundaries of games analytics within the Pokémon mobile landscape. If you want to improve the experience of Pokémon trainers around the world, then this may be the right opportunity for you. You’ll help us to further understand, model, predict, segment and retain our players. You will be leading our new data science team to help us build amazing products that delight.  ​Primary Responsibilities Be the pro-active owner of the entire data chain for our digital games. Identify potential business opportunities and scope/design approaches to capture those opportunities. Translate business needs to technical requirements and AB-tests, then work with development teams to ensure correct implementation and tracking. Develop an analysis strategy and perform analysis of complex scenarios and AB-tests, both systematically and on a one-off basis. Carefully check, debug, and problem solve issues to ensure you deliver accurate and clear analysis and reports, even when confronted by subtle data complications. Provide an analytics perspective to discussions and helping to drive the priorities within your team. ​ Knowledge, Skills & Experience 3+ years of business insight: The ability to understand the problems and issues our games and business wants to solve, and then defining the right data, analysis or interpretation to lead to the right recommendations and decisions. 3+ years of player behavior: Understanding the players’ motivation is key to design valuable tests and interpret results. SQL: The ability to write complex SQL queries to analyze our databases (BigQuery/Redshift). Analytical coding: Using tools such as R, Python (and also Excel) for analytical purposes. Stats: Understanding the appropriate statistical techniques to use in different circumstances. Communication: Designing good ways of communicating, visualizing or reporting your results/analysis so they are clear and unambiguous.Education Bachelor’s Degree in Computer Science, Analytics, Information and Data Science, or related field, or equivalent experience.Work Conditions TPCi is a standard office work environment, with primarily open cubicles. Height adjustable workstations, adjustable chairs and monitor stands are provided for all employees. Ability to work flexible hours as required for key initiatives."}