{"jobID": "2698597083", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst, Product", "companyRating": "4.0", "companyInfo": {"Website": "www.celtra.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": " Join our growing product team in London and help us unlock the secrets of digital advertising. If you often wonder why people behave like they behave, if you wonder why the ads you are seeing online aren’t as great as they could be, if you love slicing through data to uncover meaning then you will really enjoy this position.  We are a technology company with a creative DNA. Our mission is to measurably improve the effectiveness of digital advertising. We empower brand leaders, agencies, and media suppliers.  We offer you a competitive salary and benefits package, a diverse and collaborative environment, focus on your growth and professional development and of course also a lot of fun along the way! ResponsibilitiesResearch user engagement with ads to uncover key elements that make great creativeAnalyze large amounts of Celtra’s unique data points covering in-depth interaction with display and video adsExecute brand lift and conversion lift studies for Fortune 500 brandsDesign and conduct experiments that will help you advance your researchAuthor research articles relevant for the wider industryCollaborate across teams and partner with senior members of our organizationRequirements3 years experience as data analyst within market research or advertising industryB.S. from a quantitative field, statistics is idealFluent in SQL programming languages, R a plusExtensive experience with analysing advertising performance, experience with brand lift studies a plusAbility to be self-driven, pro-active, systematic, well organised and rigorous about detailsAbility to operate in a highly multidisciplinary and collaborative environment where effective exchange of knowledge between peers is crucialA “can-do” mindset pursuing excellenceAbout Celtra Celtra is the Creative Management Platform for digital advertising. Brand and performance advertisers use our fully self-service platform to create, distribute and optimize the highest quality, data-driven ads at scale, across all channels and screens with great efficiency and control. We power the best video, native and rich media ads for 2/3 of Fortune 500 brands.  If you have an interest in a company who’s interested in both your wellness and your wallet (medical, dental, vision, parental leave, education, fitness, commuter, 401k... you get the picture), you should apply. Celtra is headquartered in Boston (MA), with offices in New York City, San Francisco, London (UK), Sydney (AU) and Ljubljana (SI). For more information, visit Celtra at http://www.celtra.com or @CeltraMobile on Twitter."}