{"jobID": "2741321596", "jobLocation": "San_Francisco_CA", "jobTitle": "IBM Code Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.ibm.com", "Headquarters": "Armonk, NY", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Public (IBM) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Accenture, Microsoft"}, "estimatedSalary": "88000", "jobDescription": "Job Description As a data analyst working in the IBM Code team you will have the opportunity to help define the future of IBMs developer advocacy platform. Using data as the core of decisions around how we structure and build our web site, how we communicate to developers, how we engage developers, and how we best help developer become better at their profession will be paramount to what this job entails. As a technology company working to better understand developers and how we can best help them solve problems faster and better, we gather a lot of data.  However, without someone that can help us understand that data, see trends in that data and make recommendations we will be lost. As a data analyst on this team you will be part of a team that works in a fast paced and exciting environment that changes as fast as the technologies that we are involved with. So, having the ability to understand and see trends in metrics that are gathered as a part of normal web site operation as well as A/B testing is a must. You must have strong communications skills as you will deliver reports and communicate the trends you see in the data to senior IBM leadership.  This opportunity is available in RTP, NC OR Austin TX, OR San Jose, CA  Required Technical and Professional Expertise This person should be highly skilled and have extensive experience in doing data analyst tasks in the web development arena.The ability to understand and see trends in metrics that are gathered as a part of normal web site operation as well as A/B testing is a must.This person must have strong communications skills as they will need to deliver reports and communicate the trends they see in the data to senior IBM leadership. Preferred Tech and Prof Experience  Master degree holder with more than 5 plus years of experience as Data Analyst in web development  EO Statement  IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status. "}