{"jobID": "2823924061", "jobLocation": "San_Diego_CA", "jobTitle": "Data Analyst (6 month contract)", "companyRating": "3.4", "companyInfo": {"Website": "www.lytx.com", "Headquarters": "San Diego, CA", "Size": "201 to 500 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": "Position Summary: Lytx is seeking a resourceful and highly motivated individual to join our Client Intelligence and Data Analytics Team.  The primary responsibility is to perform data analysis that provides insights for clients, account managers and various internal teams. The ideal candidate will have a strong analytical capability with attention to detail, be a strong problem solver and pro-active in reaching out to stakeholders as needed. The position will also include enhancements to existing analysis and team processes. Key Duties and Responsibilities:Manipulate large data sets, format into presentable reports and presentations with strong attention to detailUse problem solving skills to resolve data discrepancies, understand trade-offs associated with data relationships and react to unexpected eventsCollaborate with Client Account Managers to understand data needs to make appropriate recommendationsInterpret and articulate data results for the end userData mining and analysis on one-time projects and insights requestsWork with management to prioritize business and information needsCollect and articulate business requirements for reporting needsBe a strong team player and proactive in assisting teammates to meet deadlinesParticipate in team process improvement projects to create efficiencies and transfer knowledge to internal stakeholdersOther duties as assignedEducation, Experience & Qualifications:Bachelor’s Degree in Mathematics, Economics, Business, Computer Science, or equivalent combination of education and experienceStrong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracyProven working experience as a data analyst or business data analystKnowledge of data visualization techniques (e.g. Tableau)Experience working with large datasets and complex relational data models a plusBasic SQL knowledge a plusWillingness to learn new technologiesSelf-motivated, ability to find new ways to improve processesAbility to work effectively under tight deadlines and manage projects independentlyStrong team player with excellent verbal and written communication skills Lytx, Inc. is proud to be an equal opportunity/affirmative action employer and maintains a drug-free workplace. We are committed to attracting, retaining and maximizing the performance of a diverse and inclusive workforce. EOE/M/F/Disabled/Vet.Required Skills  Job Location  San Diego, California, United States  Position Type  Temporary "}