{"jobID": "2811723614", "jobLocation": "Boston_MA", "jobTitle": "Quality Improvement Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.childrenshospital.org", "Headquarters": "Boston, MA", "Size": "5001 to 10000 employees", "Founded": " 1869", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "53000", "jobDescription": "Title Quality Improvement Data Analyst  08-Jun-2018 Department Medicine-GI/Nutrition AutoReqId47685BRStatus Full Time Standard Hours per Week40Job Posting Description At Boston Children’s Hospital, success is measured in patients treated, parents comforted and teams taught. Join our acclaimed Division of GI/Nutrition and discover how your talents can change lives. Yours included. This Quality Improvement Data Analyst will be responsible for:Implementing and assisting with projects related to clinical quality improvement (QI), quality measurement and QI research in two multidisciplinary centers at Boston Children's Hospital: the Center for Advanced Intestinal Rehabilitation (CAIR) and the Center for Nutrition.Assisting faculty and staff with the design and implementation of QI projects in a variety of clinical settings, including the ambulatory clinic, procedural areas, operating rooms and hospital wards.QI project design and implementation, as well as entering, managing and helping to prepare data reports for presentations to clinical staff, division leaders, hospital leaders, and in other venuesData collection, database development and basic statistical analyses from information gathered in patient surveys, electronic health records, hospital administrative databases, and other sources.Analyzing indicators and compiling reports of performance indicators, providing trended data using statistical process control or other appropriate epidemiological techniques.Building and maintaining a valid, accurate data repository for departmental and clinical staff to ensure availability of appropriate data for quality evaluation and improvement. Obtaining external data from third-party sources as appropriate for benchmark use.Participating in quality improvement projects, clinical practice guideline initiatives, risk management activities, providing guidance regarding data collection and analysis and generating reports.Maintaining expertise in current and emerging data management and analysis methods, including appropriate computer software applications.To qualify, you must have:Knowledge of theories, principles, and methods utilized in the development health quality databases and analysis of health quality data typically acquired through completion of a Bachelor's degree in health policy/management or a closely related discipline, including coursework in biostatistics and data management. 1-2 years of related experience in a health care-related setting or a related advanced degree is preferred.Analytical Skills to resolve complex problems requiring the use of scientific, mathematical, or technical principles and in‑depth, experienced‑based knowledgeExcellent communication skills in order to effectively deal with conflicting views or issues and mediate fair solutions and well‑developed writing skills Selected candidate will be involved with many simultaneous projects embedded in a dynamic, multidisciplinary and collegial group of clinicians committed to understanding and improving the quality of care provided to children with nutritional disorders. The selected candidate must be highly motivated, well-organized and enthusiastic. Must also be independent, efficient and have exceptional interpersonal skills, as interaction with patients, families, biostatisticians and medical staff is necessary. 2 year commitment is preferable.  Boston Children’s Hospital offers competitive compensation and unmatched benefits, including a rotating days/evenings and week-end schedule, affordable health, vision and dental insurance, generous levels of time off, 403(b) Retirement Savings plan, Pension, Tuition Reimbursement, cell phone plan discounts and discounted rates on T-passes (50% off). Discover your best.  Boston Children’s Hospital is an Equal Opportunity / Affirmative Action Employer. Qualified applicants will receive consideration for employment without regard to their race, color, religion, national origin, sex, sexual orientation, gender identity, protected veteran status or disability. Office/Site Location Boston Boston Children's Hospital"}