{"jobID": "2827005191", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst, Risk", "companyRating": "4.3", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "98000", "jobDescription": "About Uber We’re changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now we’re a part of the logistical fabric of more than 600 cities around the world. Whether it’s a ride, a sandwich, or a package, we use technology to give people what they want, when they want it.  For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer.  And that’s just what we’re doing today. We’re thinking about the future, too. With teams working on autonomous trucking and self-driving cars, we’re in for the long haul. We’re reimagining how people and things move from one place to the next.  Uber is at the forefront of one of the most exciting marketplace challenges as the world rapidly evolves from desktop to on-demand mobile commerce. Our ability to effectively manage risk in this environment is key to our ongoing success and allows the company to make bold bets while maintaining a delightful and painless user experience. It’s our job to think about this so that our riders and drivers don’t have to.  We are looking for talented data analysts to join our team. This is a great opportunity to join a fast growing business and fast growing team. We are pioneering new techniques everyday to detect and counter bad actors all over the world who are constantly adapting and discovering new ways to abuse our platform. You will be working alongside best in industry data scientists and engineers, to solve very challenging risk problems.  You will be responsible to: Analyze rich user and transaction data to drive business decisions to contribute to machine learning models, rules, and other detection systemsDevelop strategy and analytical processes to effectively mitigate riskDesign analytical and reporting frameworks to make complex data easy to understand and drive decision making for stakeholdersWork with operations teams in various regions and cities to define risk policy and processesWork cross functionally on managing risk associated with new products, marketplaces, and payment methods Here are the kinds of skills we’re looking for: BS/BA or higher in quantitative fields, statistics, math, computer science, operations management, engineering or related disciplines1-3 years of experience as a data analyst in a high tech companyStrong risk and fraud domain knowledge/intuitionAdvanced knowledge of experimentation and statistical methods are a plusExperience in handling large scale unstructured data. Experience in SQL, as well as ability to learn more advanced data programming using Hive, Pig, Spark, etcCreative problem solving and critical thinking skills with a bias toward action and a get things done attitudeAbility to make sound judgement calls independently when presented with difficult decisions, especially when only partial information is availableAbility to take initiative in a fast-moving environmentTeam player mindset that takes ownership for a collective outcome and helps others along the wayDeeply passionate about the user experience and able to make product recommendations that delight the user while taking into account the needs of the businessA never-ending desire to grow and learnStrong interpersonal, verbal, and written communication skillsTrue passion for Uber’s mission and the company’s hybrid technology/operational nature. PERKS Employees are showered with Uber credits each month.Ground floor opportunity with the team; shape the strategic direction of the company.The rare opportunity to change the world such that everyone around you is using the product you built. We’re not just another social web app, we’re moving real people and assets and reinventing transportation and logistics globally.Sharp, motivated co-workers in a fun office environment. BENEFITS (U.S.): 401(k) plan, gym reimbursement, nine paid company holidays.Full medical/dental/vision package to fit your needs.Unlimited vacation policy; work hard and take time when you need it. We're bringing Uber to every major city in the world. We need brains and passion to make it happen and to make it happen in style."}