{"jobID": "2794764073", "jobLocation": "Chelsea_MA", "jobTitle": "Entry-Level Healthcare Data Analyst", "companyRating": "2.7", "companyInfo": {"Website": "www.northsuffolk.org", "Headquarters": "Chelsea, MA", "Size": "501 to 1000 employees", "Founded": " 1959", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "45000", "jobDescription": "Do you have a couple years of experience managing databases and conducting data analysis? Have experience or interest in healthcare data? North Suffolk Mental Health Association is seeking an energetic, full-time, entry level Data Analyst with experience working with large and complex sets of healthcare data that must be detail oriented with strong analytical, communication, critical thinking and math skills. The Analyst will report to the Director of Compliance and Quality Management and will interact closely with internal and external managers/constituents to define projects and detailed analysis plans and reporting systems that will help guide business decisions. The Analyst will support the current SQL database system and will conduct research on software applications that would support the Agency to be more efficient with data and outcomes collection and reporting. The Analyst must possess very strong organizational skills, maintain excellent documentation, and have experience with interpreting and presenting data to senior and executive level managers. Responsibilities:Develops and implements data collection process and reporting activities.Receives, stores, merges and cleans data sets of varying size and complexity, preparing data for analyses.Works closely with the Directors of Accounts Payable and Applications and Data Management with reporting and analyzing data from the electronic health record and health care claims databases.Coordinates migration and import of data from stand-alone databases to the Client Central system.Oversees maintenance and expansion of Agency databases.Works with clinical staff, administrators and managers to support the implementation of outcomes tools and quality reporting measures as required by state and federal funders.Provides detailed descriptions of analyses and findings for funding proposals, grants, compliance deliverables, and quality initiatives.Facilitates, interprets and presents data to various levels of management.Represents the Agency on external data-related workgroups or committees, as needed.Actively seeks new knowledge of methods for data management and analysis to increase quality and compliance measures.Assures integrity of data through system audits, staff training, etc.Qualifications:Bachelor’s Degree required in Public Health, Statistics, Computer Science or a similar discipline Master’s Degree preferred.A minimum of two years’ experience managing databases and conducting data analysis.Advanced computer skills including Microsoft Access, Excel, SQL, Outlook, Crystal Reports, and PowerPoint.Advanced skills in statistical analysis of healthcare data, performance measurement, business intelligence and evaluation.Database management skills, specifically Microsoft Access, SQL server, or comparable environment.Must be comfortable formulating and implementing statistical analysis plans of moderate complexity.Ability to work independently and to set priorities while managing several projects simultaneously; strong attention to detail is essential.Excellent interpersonal and communication skills.Cooperates and maintains good rapport with all levels of staff, inter-program departments, vendors, and community leaders."}