{"jobID": "2787526942", "jobLocation": "Boston_MA", "jobTitle": "Professional Mover", "companyRating": null, "companyInfo": {"Website": "www.olympiamoving.com", "Headquarters": "Boston, MA", "Size": "Unknown", "Founded": " 1993", "Type": " Company - Private", "Industry": " Transportation & Logistics", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Are you an experienced mover and want to be an integral part of a fast-growing company? Olympia Moving and Storage — a top Boston relocation company — is hiring athletic, skilled, and motivated leaders.Every day we deliver exceptional service, challenge the status quo, and make the industry better. This position is for athletic and able-bodied individuals seeking a full-time position with access to overtime and schedule flexibility. Moving experience is preferred, however we will give you all the tools and training you need to become a qualified relocation professional and part of our dynamic organization.Our Movers. . .Are on a fast lane to becoming a competent leaderHave access to both hands on and classroom training at our custom-built training facilityEarn an above average annual income per yearHave a voice in a growing company with offices in Boston, Philadelphia, and Washington, DCAre learning skills that can lead to a further career in the $16 Billion US relocation industryLeaders who have been with us for 2-3 years have. . .Been the solo operator of a vehicle transporting hundreds of thousands of dollars of household goods on a daily basisLead crews of 2-5 movers on over 1,000 commercial and residential movesBeen the main point of contact for high net-worth individuals on multi-day movesRepresent our company and exceed our customer’s expectations from the first knock on the door to the signing of the final billPacked household items including books, dishes, and antiques while protecting furniture, locations, and equipmentDisassembled & re-assemble furnitureReceived consistent and ongoing trainingThink you are up to the challenge? We are not an ordinary moving company and we do not hire ordinary people. Our ideal candidates will include:Experienced moversHigh School and College graduatesFormer student-athletes and those who have above average strength, stamina, fitness, and grit. Have you been a tough spot, but haven’t given up? We love co-workers like that.People who possess emotional intelligence - the ability to put customers at ease - and protect the customer’s goods and property while working quickly and efficiently.Leaders with punctuality and dependability – Always a few minutes early? Good. That’s what we look for.Those who have a valid Driver’s LicenseThose with a DOT Medical Card or CertificationBenefits for full-time employees:Earn top hourly wageLow cost individual and family health and dental plans401 (K) with company matchPaid holidays and vacationThe best hires will be eligible for a raise and promotion within just a few months!Physical Demands:While performing the duties of this job, the employee is regularly required to stand; walk; use hands to finger, handle, or feel; reach with hands and arms; climb or balance; stoop, kneel, crouch, or crawl; and talk or hear. The employee is occasionally required to sit. The employee must regularly lift and/or move up to 55 pounds. Specific vision abilities required by this job include ability to adjust focus. Must adhere to established safety practices and OSHA regulations."}