{"jobID": "2825148527", "jobLocation": "Gig_Harbor_WA", "jobTitle": "Crime Lab Data Analyst - Project IT Specialist 4 #P", "companyRating": "3.8", "companyInfo": {"Website": "www.wa.gov", "Headquarters": "Olympia, WA", "Size": "10000+ employees", "Founded": " 1889", "Type": " Government", "Industry": " Government", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "59000", "jobDescription": " DescriptionAre you looking for:Excellent benefits?Career growth opportunities?Opportunities to impact your community?A professional workplace that fosters respect, commitment and trust?  As an employee of the Washington State Patrol, you will be part of a team of dedicated professionals responsible for providing safety and security to the citizens of the State of Washington.   Troopers patrolling the highways are the most visible part of this agency. However, there are over 1,200 civilian employees who serve behind the scenes supporting the agency mission. To name just a few, we have: 911 dispatchers who are the critical vital link between calls for assistance and emergency response; Commercial Vehicle Enforcement Officers that work to inspect commercial vehicles to ensure safe and efficient travel on public highways; Deputy State Fire Marshals who help prevent fires in homes and workplaces; Forensic Scientists who process evidence that assists in prosecuting criminal cases; IT Specialists who leverage technology to enhance and sustain business processes, public safety infrastructure, and statewide emergency communications Records staff that process criminal information to ensure crimes are reported accurately so that offenders do not end up working with vulnerable people Administrative staff who provide exceptional customer service and respond to information requests while ensuring the agency runs smoothly and efficientlyApply today and join us in providing \"Service with Humility\"!DutiesWhy you should apply: The Washington State Patrol (WSP) is a professional public safety agency made up of dedicated professionals who work hard to improve the quality of life as well as prevent the unnecessary loss of life on a daily basis.  This is what you will do: Working with WSP Crime Lab staff, you will define and document business processes and software requirements for complex enterprise applications, systems, and services. In addition, the position will involve data management and the design and maintenance of custom reports pertaining to business operations to effectively communicate key performance indicators requested by stakeholders. This would include in-house and outsourced DNA cases There's more:In this position, you will:Analyze and evaluate complex process and/or system changes to applications. Create and maintain business analysis and requirements documentation. Translate business needs and processes for technical staff. Partner with test teams to define test plans and test cases. Change the current CD DNA case file data storage process to a digital storage system. Establish and maintain working relationships with business partners. Develop an understanding of the needs, issues, and opportunities of business partners. Facilitate the negotiation of requirements among multiple stakeholders. Identity the current and future state of business processes. Help business partners envision the future and how business processes must change to support that vision. Collect, organize, and analyze business data to identify patterns and business process information. Develop repeatable processes to report key process and performance indicators (KPIs) Develop reports to support the KPI reporting processThis is who you will work with: You will collaborate with executive leadership, end users, and stakeholders on a daily basis when gathering requirements, coordinating customer acceptance testing, discussing change requests, and other project development tasks that require customer input. .QualificationsUnique Requirement: Provide an oral DNA sample to be used in the CODIS Elimination Profile Index. Required Qualifications:Four years combined experience in information technology and business analysis. Two years' experience analyzing business processes, eliciting and documenting business and technical requirements, and communicating with stakeholders and technical staff. Certification and formal education may be substituted for one year of experience.Required Competencies:Facilitation SkillsManage the meeting structure, not the content – capture the content, but use tools to move through that content (agenda as one example). Use questions to develop individual involvement – ensure all team members are present and engaged. Highly skilled in this arena and may even be recognized as a leader.Effective Negotiation SkillsUse formal and informal tools to reach agreement between parties to a project. For example, negotiation may be about timing, scope, or alternative solutions. Look for opportunity to create agreements between teams, or individuals that meet the expectations of both parties. Highly skilled in this arena and may even be recognized as a leader.Interviewing Skills and TechniquesDemonstrated ability to coax information and details for requirements using a variety of interview techniques. Highly skilled in this arena and may even be recognized as a leader.Communication EffectivenessComplimentary skill to written communications which can be assessed in resumes and applications, the ability to verbalize appropriate content, at the appropriate level for the audiences involved. Use effective listening skills and apply effective written and oral communication techniques to convey clear, timely, persuasive messages that positively influence the thoughts and actions of others. Highly skilled in this arena and may even be recognized as a leader.Customer CenteredSearch out and identify internal and external customers' service delivery requirements to improve efficiency, effectiveness, and satisfaction.Desired Qualifications: Bachelor's Degree in Computer Science or Information Technology. Two years working within a government information technology environment. Supplemental Information The act of submitting application materials electronically is considered affirmation that the information is complete and truthful. The agency will verify this information and any untruthful or misleading answers will be cause for rejection of potential employment.   VETERAN'S PREFERENCE: Applicants who meet the minimum qualifications and wish to claim Veteran's Preference MUST attach a copy of their Form DD214, or other verification of military service, that shows the type of military discharge. Typically this is found on the Member 4 version of the Form DD214. Please blackout any personally identifiable data such as social security numbers.  Note: Applicants claiming veteran's preference points must attach the documentation with each on-line application. If you do not provide appropriate documentation to qualify for these preference points, the points will not be awarded. Preference will not be granted until service documents are verified. Documents must be received by the closing date of the announcement.  For additional information on Veteran's Preference and guidance on how to determine if you are eligible, click here.   We thank you and are grateful for your service.  QUESTIONS: If you have questions regarding this announcement, please contact Melodie Wulfekuhle at (360) 704-2307 or melodie.wulfekuhle@wsp.wa.gov.  HOW TO APPLY: Please complete the on-line application process at www.careers.wa.gov. Please include a resume and letter of interest explaining how you meet the qualifications for this position as outlined in the job posting. Provide clear, detailed information about your education and job-related experience.  SELECTION PROCESS: The hiring authority reserves the right and may exercise the option to make a hiring decision at any time. Candidate evaluation will be ongoing. It will be to the applicant's advantage to submit application materials as soon as possible.    The candidate evaluation and selection process will include a preliminary screening of application materials for qualifications, clarity and completeness. The applicants who meet or exceed the required qualifications and possess the most competitive background in directly related experience, knowledge, and training may be invited for interviews and testing by one or more panels.    In order to be considered further for this position, you must attach a letter of interest explaining how you meet the qualifications for this position as outlined in the job posting. Provide clear, detailed information about your education and job-related experience.   TESTING and/or ORAL INTERVIEW: For candidates that pass the on-line supplemental questionnaire process, and based on a review of your application materials, you may be invited to the next phase of testing which could include tests related to typing speed and accuracy, reading comprehension, spelling, data entry speed and accuracy, and prioritization AND/OR an oral interview.  POLYGRAPH & BACKGROUND INVESTIGATION: Prior to a hire, a polygraph examination and background check including criminal record history will be conducted. Information from the background check will not necessarily preclude employment but will be considered in determining the applicant's suitability and competence to perform in the position.  Applicants are required to sign release of information forms and will not have access to any investigative materials, files, or results. The Washington State Patrol has strict guidelines relating, but not limited to, personal and employment characteristics, arrests, convictions, and illegal drug usage, etc.  During the polygraph examination, candidates are required to sign an assessment sheet and participate in an oral interview process to verify responses to the Personal Background Evaluation, the Personal History and Background Questionnaire, and a Pre-Employment Interview. Untruthful or misleading answers or omissions will be treated as a falsification which will be cause for rejection of potential employment. TRANSCRIPTS: Education verification is part of the selection process. If selected as a top candidate, position required and/or applicant specified education will be verified. Please do not send these transcripts at the time of application. If you are selected as a top candidate you will be contacted by the Human Resource Division and asked to provide transcripts at the appropriate time.  UNION NOTICE: This position is in a collective bargaining unit and as a condition of employment you will be required to become a union member or pay a fee as outlined in the Master Agreement.  OTHER INFORMATION: Persons with a disability, who need assistance in the application or assessment process, or those needing this announcement in an alternative format, may call (360) 704-2317. Applicants that are deaf or hard of hearing may call through the Washington Relay Service 7-1-1 or 1-800-833-6384.   The Washington State Patrol actively supports diversity in the workplace and  is an Equal Opportunity Employer."}