{"jobID": "2812145936", "jobLocation": "Redmond_WA", "jobTitle": "Program Architect/Data Scientist, Data & AI Solution Strategy, WW Digital, Services & Success", "companyRating": "4.1", "companyInfo": {"Website": "www.microsoft.com", "Headquarters": "Redmond, WA", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (MSFT) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Amazon, Apple"}, "estimatedSalary": "139000", "jobDescription": " How would you like to leverage your passion and expertise in Data Science and AI to empower one of the most important business opportunities in Microsoft history?  Microsoft is making a big bet on AI, and the Data & AI Solution Strategy team is a critical part of Microsoft’s overall strategy, key to the success of our enterprise customers and partners. If you are hyper passionate about Data and AI and energized by the opportunity to bring its transformative power to Microsoft’s customers, then, read on!  The Data & AI Solution Global Solution Strategy Team in Microsoft Digital Solutions Strategy & Operations leads the Artificial Intelligence, Azure Analytics, and Data Estate strategy and aligned execution through Services, Commercial Business, Partners, and WW Industry and Public-Sector teams. We have a critical role in solution strategy, packaged offering development, as well as the programs that power the landing and adoption of our go-to-markets and field and sales enablement. Key to our success is working closely with our engineering partners in Research & Product Development, our sales and marketing partners and within our own Solution Strategies teams, as well as with the field delivery teams to ensure that our ‘marketecture’ is realized in implementations that delight our customers.  We are looking for a Program Architect/Data Scientist with consulting experience to collaborate with our partners to develop and land technical strategies and technical guidance to ensure alignment from sales to delivery across Microsoft, globally. In this role, you will be responsible for driving the Data & AI technical strategies across the Analytics and AI space in partnership with our Business Program Management team and key partners in other Solution Strategy teams, product engineering, the Services Data & AI leadership team, and other Digital HQ teams.Responsibilities"}