{"jobID": "2769936137", "jobLocation": "San_Francisco_CA", "jobTitle": "Lead Data Scientist, Machine Learning", "companyRating": "4.1", "companyInfo": {"Website": "www.glassdoor.com", "Headquarters": "Mill Valley, CA", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Indeed, LinkedIn"}, "estimatedSalary": "163000", "jobDescription": " Our mission is to help people everywhere find a job and company they love. We are disrupting an industry by changing how people search for jobs and how companies recruit top talent. In this specific role, you will be driving the ML solutions to help grow Glassdoor’s recruiting solutions for small businesses, which is an extremely strategic growth area for our company. Responsibilities You’ll be part of a very fast-growing and rapidly innovating machine learning team within Glassdoor, building our next generation product. As a Lead, you will help define the ML roadmap and then be the owner of modeling and delivery of all Machine Learning products to support small businesses. This includes a diverse range of needs covering areas like fraud prevention, paid advertising optimizations, and applicant delivery for job postings. A typical week would comprise of brainstorming with product on next gen features, prototyping models and improving model features, and collaborating with engineers to deploy ML pipelines and products.  The ideal candidate will be extremely curious, have a strong scientific background in statistics and machine learning but is obsessed about results. You exercise very sound judgment and have the ability to balance sophistication with simplicity, scientific rigor with pragmatism and agility with quality. All of this with a goal of improving Glassdoor’s product to help small businesses recruit and to grow Glassdoor’s revenue. Requirements4+ years of quantitative experience with large data-sets, from prototyping to business impactDeep understanding of machine learning and statistical methods with their underlying theory and mathDemonstrated work in building, deploying and demonstrating business value from predictive models and data productsProficient in Python. Experience with R a plus. Also, Java or other programming language experience would be valuable.Experience with distributed machine learning frameworks, like Spark, etc.Solid software development experience, including translating ML models into production softwareStrong and persuasive communication skillsMS or PhD in a quantitative discipline like Computer Science (with focus on Machine Learning, Artificial Intelligence), Statistics, Math, Neuroscience, Operations Research, Physics, etc.Why Glassdoor?Work with purpose – join us in creating transparency for job seekers everywhereGlassdoor gives back! Glassdoor is a Pledge 1% member; all employees receive 3 paid volunteer days per year100% company paid medical/dental/vision/life coverage, with 80% dependent coverageLong Term Incentive PlanConveniently located office in the heart of downtown San Francisco (Embarcadero)Fully-stocked break rooms with complimentary food and drinksPaid holidays and flexible paid time offYour choice between Mac or PC Glassdoor is committed to equal treatment and opportunity in all aspects of recruitment, selection, and employment without regard to gender, race, religion, national origin, ethnicity, disability, gender identity/expression, sexual orientation, veteran or military status, or any other category protected under the law. Glassdoor is an equal opportunity employer; committed to a community of inclusion, and an environment free from discrimination, harassment, and retaliation."}