{"jobID": "2720086296", "jobLocation": "San_Mateo_CA", "jobTitle": "Senior Product Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.thetileapp.com", "Headquarters": "San Mateo, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " TrackR"}, "estimatedSalary": "109000", "jobDescription": "About the RoleHelp forge a data-driven organization and culture at Tile. Surface key information to business leaders to improve decision making. Actively recognize opportunities by conducting exploratory data analysis. Help Tile make effective decisions by answering challenging business intelligence questions and continually improving our information lifecycle. Strategically work across the organization to promote a data-driven focus to company initiatives.Requirements You have excellent communication skills and can work independentlyYou are knowledgeable about statistics and have strong analytical skillsYou are stellar at writing queries, building reports, and visualizing informationYou have strong SQL skills (Python and R a plus!)You are knowledgeable about data visualization tools, like TableauBS in Statistics, Economics, Mathematics or Computer Science2- 10 yrs overall experience, at least 2 years doing quantitative analysis.ResponsibilitiesApply your expertise in quantitative analysis, data mining, and the presentation of data to see beyond the numbers and understand how our users interact with both our consumer and business productsPartner with Product and Engineering teams to solve problems and identify trends and opportunitiesThe Product Data Scientist role has work across the following three areas:Product OperationsForecasting and setting product team goalsDesigning and evaluating experimentsMonitoring key product metrics, understanding root causes of changes in metricsBuilding and analyzing dashboards and reportsBuilding key data sets to empower operational and exploratory analysisEvaluating and defining metrics Exploratory Analysis Proposing what to build in the next roadmapUnderstanding ecosystems, user behaviors, and long-term trendsIdentifying new levers to help move key metricsBuilding models of user behaviors for analysis or to power production systems Product Leadership Influencing product teams through presentation of data-based recommendationsCommunicating state of business, experiment results, etc to product teamsSpreading best practices to analytics and product teams.BenefitsOwn equity in the company--every employee is a stakeholder in our futureWork with an adept team of people who love what they doDaily breakfast and lunch along with company-wide events and outingsOn-site gym accessFree parkingComprehensive health insurance, dental, vision, 401k, and pre-tax commuter deductionAbout TileTile is creating a world where everyone can find everything that matters. When youve lost something, getting it back safe and sound can feel impossible. But thanks to Tile, theres a community of people out there helping that thing you love find its way back home.With over 85% of the market share, Tile devices, network and mobile app work together to help people locate more than three million unique items every day. Our global community spans 230 countries and territories, and were expanding more every day. Were headquartered in San Mateo, California, and our investors include Bessemer Venture Partners, GGV Capital and Khosla Ventures.We believe that loss should be a thing of the past, and that lending a helping hand should be effortless. Were not here to simply connect people to things. Were here to connect people to people, because things dont change the world. People do.Together we find. Join us!We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}