{"jobID": "2616821725", "jobLocation": "Murray_Hill_NJ", "jobTitle": "Bell Labs Summer Intern", "companyRating": null, "companyInfo": {"Website": "www.nokia.com", "Headquarters": "Nokia, Finland", "Size": "10000+ employees", "Founded": " 1865", "Type": " Company - Public (NOK) ", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " Ericsson-Worldwide, Huawei Technologies, Microsoft"}, "estimatedSalary": null, "jobDescription": "Help change the way people connect with the world…  Bell Labs, the Nobel Prize winning research organization, is accepting applications for our competitive internship program.  Bell Labs defines Nokia’s technological and architectural vision for the ICT industry, identifies the key challenges in this vision and invents solutions that are an order of magnitude (10X) better than existing solutions. It advises the industry on the economics of the vision​ and underlying technologies, and how best to transform to most efficiently achieve the goals. Driving thought leadership among customers and the industry strengthens Nokia’s role as a market leader and creator. ​​​​​​  Discovering the possibilities that shape the human experience are at the heart of everything we do. Our interns will have the opportunity to learn from and work with world experts, and the best and brightest minds, who solve the most formidable networking and communications challenges confronting our world through disruptive innovation and research.  Our researchers are continually massively scaling the capabilities of networks from the data center to the end device, to change the way we live and work, by inventing breakthrough technologies to make networks and systems faster, smarter and greener.As well as providing hands-on educational and collaborative experiences for a pool of talented and highly motivated students, our internship program will expand your field of study by exposing you to an unparalleled diversity of people, expertise and perspectives. In classic Bell Labs style, you will leave changed forever by an experience that will redefine your future.Application Areas:Access: Project topics include new breakthrough technologies for the communications systems that directly connect with end users, wireless in 5G radios, transceiver design, massive MIMO, and communications theory, new disruptions in faster fiber and fiber-like speeds over copper to enable seemingly infinite capacity and edge clouds for low latency computing. Application Platforms & Software Systems: Project topics include solving problems of service complexity in future networks by automating and simplifying delivery of cloud and sensor systems with intelligent, self-deploying, and self-healing control. Network Algorithms, Analytics, Control and Security: Project topics include developing disruptive, breakthrough solutions to critically hard industry problems, accomplishing this in network protocols, algorithms addressing networks and other complex systems, data and user-security, network control systems, and useful and real-time analytics.  ​IP and Optical Networks: Project topics include new ways of improving optical speed in the spatial, statistical, and optical domains; new error and signal processing techniques, and more flexible control. End to End Mobile Network Solutions: Project topics include how mobile networks are used, through creation of future-proof, adaptive and massively scalable End-to-End solutions. Emerging Materials, Components and Devices: Project topics include solving the great device challenges of the future. Research areas include III-V devices, silicon devices, hybrid modules, and emerging materials. Technology, Architecture, Vision, Standards & Services:Project topics include defining the technology and architecture vision of Nokia and the industry by providing the architecture guide, developing standards, creating intellectual property assets, and providing compliance and reliability testing. Innovation Incubation: Project topics include developing innovations from research to proto-commercial readiness. Bell Labs Consulting: Project topics include Telecommunications network analysis, Web development, and Market research & benchmarking. Nokia is a global leader in the technologies that connect people and things. With state-of-the-art software, hardware and services for any type of network, Nokia is uniquely positioned to help communication service providers, governments, and large enterprises deliver on the promise of 5G, the Cloud and the Internet of Things.Serving customers in over 100 countries, our research scientists and engineers continue to invent and accelerate new technologies that will increasingly transform the way people and things communicate and connect.Nokia is an equal opportunity employer that is committed to diversity and inclusion.At Nokia, employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law.Student Criteria: Overall GPA of 3.0/4.0 or above.  Must be enrolled as a full-time student. Work Authorization: U.S. Citizen or Permanent Resident preferred. Will accept students on F-1 Visa dependent upon program requirements or may consider sponsoring short-term J1 Visa PhD students dependent upon program requirements. Education Requested:Must be pursuing a degree in Biochemistry, Biomedical Engineering, Biophysics, Business Modeling, Chemical Engineering, Chemistry, Computer Engineering, Computer Science, Economics, Electrical Engineering, Engineering Mechanics, Industrial Engineering, Manufacturing Engineering, Mathematics, Mechanical Engineering, Microbiology, Nanotechnology, Operations Research, Physics, Statistics, Systems Engineering and Telecommunications from an accredited college/university."}