{"jobID": "2740919259", "jobLocation": "New_York_NY", "jobTitle": "Senior Enterprise Sales Executive - Tri", "companyRating": null, "companyInfo": {"Website": "www.crimsonhexagon.com", "Headquarters": "Boston, MA", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Overview Crimson Hexagon helps global brands better understand their consumers. With instant access to the world’s largest volume of unstructured text and images across social, online public, and enterprise-held data sources, Crimson Hexagon’s AI-powered consumer insights platform allows clients to analyze audiences, track brand perception and campaign performance, and even detect competitive and market trends. Our clients include Anheuser-Busch InBev, Adidas, General Mills, Paramount Pictures, and Twitter. We’re a high growth software company headquartered in Boston with offices in Chicago, New York, San Francisco and London. Find us on Twitter and on LinkedIn.Reporting to the Regional Vice President of Sales – East, you possess a hunter’s mentality, have an energetic personality and understand what it takes for a team to win. You are a self-driven and motivated individual who wants to expand your career in enterprise sales with a fast-growing software company. Your ability to demonstrate a successful track record in selling SaaS solutions to enterprise customers is key. Preference for those whom have sold into senior marketing leaders. Responsibilities Achieve quarterly and annual bookings and revenue objectives.Develop, manage and execute a territory plan to support lead generation, engage a sales cycle, and achieve financial targets.Grow and develop the pipeline through new business development, executing outbound sales activities, and supporting inbound marketing tactics.Execute an enterprise sales process that optimizes resource allocation and results in winning new business for the company.Successfully partner with an internal go-to-market team in winning new business.Engage and qualify new prospects, to develop and grow pipeline.Provide ongoing and accurate weekly, monthly and quarterly pipeline and forecast management. Qualifications Undergraduate degree or higher.7-15 years of total sales experience; Minimum of 4 years of experience in selling enterprise software solutions.Proven track record in new business development.Experience selling SaaS-based marketing technology solutions to C-level decision makers.Ability to work effectively with internal teams in sales, pre-sales, product, client services and marketing to succeed.Maintains a structured and strategic approach to business planning.Demonstrated success in executing an enterprise sales cycle from start to finish. Experience in strategic account and opportunity planning.Possesses skills and experience to recognize the influencers, decision makers and other stakeholders in the prospect organization, and articulate our value propositions to align with strategic business initiatives.Demonstrated experience in positioning and selling against an array of competitors.Passion, commitment and track record to exceed sales targets.Self-driven, organized, motivated, able to thrive under pressure, and able to effectively manage time and responsibilities.Ability to travel 25-40% of time within East territory."}