{"jobID": "2630749115", "jobLocation": "Playa_Vista_CA", "jobTitle": "Sr. Data Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.fullscreenmedia.co", "Headquarters": "Playa Vista, CA", "Size": "501 to 1000 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Media", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "78000", "jobDescription": "Fullscreen Direct (FSD) is looking for a seasoned analyst who will be responsible for leading the data analysis efforts for the organization. FSD is in the business of creating direct relationships between affinity brands (celebrities, musicians, athletes, social media stars, etc.) and their fans. This person will be pivotal in driving the FSD business forward through sophisticated analyses and insight development. This role is tasked with assisting in making sure that every client is optimizing their respective business on the FSD platform, and empirically proving that we are driving incremental revenue for our clients. This position reports to the SVP of Direct-to-Fan.Responsabilities Own the design, development, validation, and maintenance of ongoing metrics, reports, analyses, dashboards, etc. to drive key business decisionsConduct hands-on modeling/analytics retrieving, compiling, and analyzing large volumes of data from disparate databases into distilled, actionable information and insightsExecute quantitative analyses that translate into actionable insights for Fullscreen Direct and its roster of client accountsDeep understanding of e-commerce and the associated transaction funnel analyticsDevelop new insights that inform decisions and drive the collective business forward Develop standardized dashboards and reports with an emphasis on automation and scalabilityIdentify data requirements and data visualization/reporting needsEffectively present data and analysis to both internal stakeholders and external clients and 3rd parties Design and analyze A/B multivariate tests to drive KPI improvementQualifications 3-5 years of experience as a data analyst, preferably with an e-commerce or entertainment/ digital media companyExceptional analytical and quantitative skills with ability to interpret and summarize complex data that drive actionable plans that add value to the business Strong skills in MS Excel and SQL to query normalized relational data and dimensional warehouse dataExperience with MixpanelFamiliarity with reporting tools such as Tableau and QuickSight Bachelor’s degree with a major in Math, Statistics, Finance, Economics, etc. is strongly preferred (MBA a plus)Detail-oriented and exceptional organizational skills Excellent verbal and written communication skills with the ability to interact at all levels of the organizationAbility to work independently, be self-motivated and results-oriented but still be an excellent team player with a strong level of serviceAbility to thrive in a fast paced, entrepreneurial, high-energy environment that requires the ability to multi-task and implement high priority initiativesAble to work full-time in our Playa Vista-based officePerks & Benefits Use What You Need paid time offFlexible dress codeKitchen stocked with snacksPet InsuranceCatered meal on FridaysHealth, dental and vision benefits401(k) with a company matchBoth paid maternity time and paid paternity timeDog-friendly FridaysABOUT FULLSCREEN DIRECT:Fullscreen Direct is a comprehensive suite of digital tools designed to power direct-to-fan businesses for affinity brands and artists, empowering them to connect more deeply with their audiences to increase their overall business. Fullscreen Direct enables clients online businesses - websites, communities, stores, etc. We believe strongly in creating and activating an entire fan engagement ecosystem built around exclusive content, fan experiences and communities, and selling products directly to passionately engaged fans. Fullscreen Direct is powering digital business for some of the biggest talent in the world including Metallica, Kobe Bryant, Eric Church, Red Hot Chili Peppers and others.For a behind-the-scenes glance at what it's like to work at Fullscreen Media, click HERE.Fullscreen, Inc. is committed to employing a diverse workforce. Qualified applicants will receive consideration without regard to race, color, religion, sex, national origin, age, sexual orientation, gender identity, gender expression, protected veteran status, or disability."}