{"jobID": "2812354258", "jobLocation": "New_York_NY", "jobTitle": "Data Scientist", "companyRating": "4.1", "companyInfo": {"Website": "www.kochind.com", "Headquarters": "Wichita, KS", "Size": "10000+ employees", "Founded": " 1940", "Type": " Company - Private", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "118000", "jobDescription": " Who are we? Watch to find out! KS&T;, with offices in Geneva, London and with its head office in the US, is a global commodity trading company participating in nearly all commodity markets but focusing in petroleum and energy.  Individual will be responsible for ongoing development of internal quantitative trading IP and portfolio build up using proprietary Koch technologies, data and insights.A Day In The Life Typically Includes: Conceptualize financial drivers of oil markets and translate them into quantitative trading systems through rigorous analysis.Analyse cross commodity correlations and portfolio dependency/performance in different macro environments.Optimize portfolios and strategy sizing to maximize performance within Kochs risk framework.Developing and utilising advanced analytics and new technologies in financial markets.Manage the coordination with IT and infrastructure teams to ensure best practices are utilised. What You Will Need:  Basic Qualifications Expert in quantitative/econometric approaches utilising R and/or PythonExpert in Big Data methods of analysis (Machine Learning, Deep Learning, AI)Ability to communicate complex problem solving to peersExperience designing and developing scalable and reliable systemsPhD in a quantitative field (maths, econometrics, financial statistics, physics etc.)Excellent pro-active communication and interpersonal skills with proven ability to work as part of a teamHigh level of intellectual curiosityAbility to work accurately and efficiently Want to learn more about KS&T;?Salary and benefits commensurate with experience.  We are an equal opportunity employer. Minority/Female/Disabled/Veteran  Except where prohibited by state law, all offers of employment are conditioned upon successfully passing a drug test.  This employer uses E-Verify. Please visit the following website for additional information: www.kochcareers.com/doc/Everify.pdf Follow us "}