{"jobID": "2569613794", "jobLocation": "Waltham_MA", "jobTitle": "Software Engineering Intern", "companyRating": "3.5", "companyInfo": {"Website": "www.constantcontact.com", "Headquarters": "Waltham, MA", "Size": "Unknown", "Founded": " 1998", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Cimpress, Eventbrite, MailChimp"}, "estimatedSalary": "57000", "jobDescription": " Constant Contact, Inc. helps small businesses and nonprofits connect with their customers, clients, and members. Constant Contact® champions the needs of small organizations and provides an easy, affordable way to build successful, lasting customer relationships. Our customers get real results through email newsletters, surveys, events, Facebook promotions, online listings, and more.  We're looking to expand our team of developers located in our Waltham office.  As a part of our agile team, you'll be working with innovative tools, processes and people to engineer web applications that are distributed and consumed on a massive scale. About Us We are a fun, collaborative, agile work team solving interesting engineering challenges involving scale and big data. Our organization puts an emphasis on learning and career growth with a commitment to a work/life balance and sustainable development. We work with state of the art technologies, methodologies, and processes and are able to offer very competitive salaries. About You You are open to change and eager to work with tools and technologies that may be outside your comfort zone. You enjoy working in an open and collaborative environment. You express your opinions, and have the facts to back them up, but are willing to compromise when necessary. You like to have fun while youre working, but understand when its time to get serious. You are a dedicated software craftsperson who cares deeply about best practices and what it takes to write and maintain great code. ResponsibilitiesAs part of a cross-functional, full stack scrum team, contribute to the development of features that allow our customers to grow and manage their lists of contactsDevelop high quality, maintainable code with full automationEnsure high quality standards are maintained throughout the codebase by being an active participant in code reviewsMaintain the health of the codebase through appropriate refactoring and improvement of existing functionalityTechnical SkillsWorking towards a B.S/M.S. in Computer Science or equivalent disciplineExperience with Javascript, CSS, HTML and single page appsExperience with Backbone, Marionette or equivalent frameworkExperience with Ruby/Rails and/or Java"}