{"jobID": "2648755255", "jobLocation": "San_Jose_CA", "jobTitle": "Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.pg.com", "Headquarters": "Cincinnati, OH", "Size": "10000+ employees", "Founded": " 1837", "Type": " Company - Public (PG) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unilever, Colgate-Palmolive, Henkel"}, "estimatedSalary": "138000", "jobDescription": "Are you looking a job opportunity to innovate on technology? As a Data Scientist, you will be a business leader and you'll be able to transform and enable better decision-making through the usage of advanced analytics. To be successful you should look forward to be an effective communicator to drive insights into actions that improve our company business results. Are you passionate about analytics? We want your ability to connect and explore large data-sets, build predictive and descriptive models, and translate insights into business improving action are critical skills that we are looking for our work. You will go deep, using artificial intelligence, data visualization, and analytic tools to unlock business building insights in our mountains of data. You should be proficient at demonstrating such technologies for solving ad hoc business problems, innovating on potential future solutions, and working with technology partners to translate your innovations into robust, scaled, analytic solutions. So just you know, for this role you'll have to:Be creative and committed problem-solver using Big Data and Advanced analytics skill alongside leadership and direct engagement of business leaders.Design research and analytic frameworks in the context of overall project objectives such as media effectiveness, consumer engagement, business model, optimization, etc.Execute research and analytics, including data sources identification, processing, algorithm development, turning insights into actionable recommendation and drive actions to business value creation.Collaborate actively and effectively with other functions partners and senior management to accomplish project objectives.Participate in and lead analytic capability building program.QualificationsYou should possess Master's degree or Ph.D. in a quantitative field (Operation Research, Computer Science, Systems Engineering, Applied Math, Statistics, Analytics, etc.) or equivalent work experience.You should have minimum 3-5 years of work experience in Data Science field.Demonstrate leadership in applying analytic techniques to deliver actionable insights from data.You will need strong written and verbal communication skills to influence others to take action.You should demonstrate the ability to handle multiple priorities.Collaborate within diverse organizations and teams.Do you have two or more of the following specialties and experience with the following list?1. Specialties/Area of Research:Bayesian Analysis, Bayesian Decision TheoryProbabilistic Modeling and ComputationMachine Learning, including Deep LearningUncertainty Quantification,Optimization (global, local, stochastic methods)Dynamic (state-space) Models (Kalman Filter, Data Assimilation)Experimental DesignModel Reduction, Dimensionality Reduction2. Experience with Analytical Tools/Applications:Unix or LinuxBig Data Ecosystem: Hadoop, Spark, MapReduce, SQL, HiveScientific Computing: R, Python, C , Java, Scala,High-Performance Parallel and Distributing ComputingData VisualizationData Management SystemsBusiness Intelligence tools: such as KNIME, Tableau, SpotfireAre you ready to win with us? Click Apply Online to start the application process.Your application will receive consideration for employment without regard to race, color, religion, sex, national origin, protected veteran status, disability status, age, sexual orientation, gender identity and expression, marital status, citizenship, HIV/AIDS status or any other legally protected factor.IT at Procter and Gamble Information Technology at Procter & Gamble is where business, innovation and technology integrate to create a high-reaching advantage to us. Our mission is clear, we deliver IT to help the company win with consumers. IT professionals are diverse business leaders who apply IT mastery to deliver game changing, innovation business models and capabilities. Whether your role is to create an IT innovation strategy for a business, protect our critical information systems and assets, or lead a strategic supplier in our cutting-edge shared services organization, your technical mastery will be recognized and rewarded. Your passion for the industry will be further cultivated by our culture of continued learning and growth as an IT professional. A career in IT builds change leadership and influence skills, breadth of experience across multiple businesses, and depth of expertise in areas like Application & Integration, Infrastructure, Data& Analytics, and Security & Risk. About UsP&G; serves consumers around the world with one of the strongest portfolios of trusted, quality, leadership brands, including Always®,Ambi Pur®, Ariel®, Bounty®, Charmin®, Crest®, Dawn®, Downy®, Fairy®, Febreze®, Gain®, Gillette®, Head & Shoulders®, Lenor®, Olay®, Oral-B®, Pampers®, Pantene®, SK-II®, Tide®, Vicks®, and Whisper®. The P&G; community includes operations in approximately 70 countries worldwide. Please visit www.pg.com for the latest news and information about us and our brands"}