{"jobID": "2526565981", "jobLocation": "San_Jose_CA", "jobTitle": "Applications Engineer", "companyRating": null, "companyInfo": {"Website": "www.rfi.com", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Does solving mission critical projects and being known as the case matter expert describe you? Do you expect a lot of out of yourself and those who work on your teams? Are you research persistent, factual in your communication style, and someone who needs new challenges to conquer?  If this sounds like you, RFI, one of the United States top 20 Security & Integration companies is looking for you.  As an Application Engineer, you will be providing system startup, testing, and troubleshooting of integrated security systems, as well as, as interfacing with the customer to provide training of the system. You would also be an integral member of the RFI’s team in assisting sales, project managers and field engineers with pre-bid review and quality control. Duties:Maintains a good line of communications between Project Managers and staffEngineering sales support and review of the functionality and design of systems being proposed by sales or consultants, working with the Estimator.Working with Customer and IT Departments to ensure expectations are in line with scope of work prior to software configuration and that any hardware and/or infrastructure meet the design requirements.Pursue and Maintain IT certifications in the areas of Networking, Microsoft OS, Virtualization, SQL and/or any other IT areas to support the integrated security system deployments.Escalation troubleshooting for installation and service departments as required.Responsible for the adequate and accurate time posting of all engineering to jobsNew product review.Assist in technical training seminars for field personnel.Set-up and test new design concepts such as network devices, custom designed systems, system start up procedures, programming, and subsequent testing to ensure complete system compliance, performance, and completion.Performed all work to RFI standards and ensure quality installation techniques are practiced.Daily communications with Sales Executives, Project and/or Operations Manager on delays, requirements and general status of jobs.Maintain professional licensing and certifications as required by manufacturers and/or State and Local jurisdictions.Work proactively and in a positive manner with all co-workers.Communicate effectively and in a timely manner to resolve RFI, Client, or other inquiries and/or requests.Provide reports to managementAdhere to procedures and standards in system design for quality installations.Maintain accurate project information with in RFI shared files and system.Maintain communications with clients and sales executives to resolve customer issues.Ability to solve practical problems and carry out responsibilities without supervision.Ability to organize workload for effective implementation.Ability to write simple correspondence and present information in one-an-one and small group situations.Ability to adapt as the external environment and organization evolves.Maintain knowledge of current industry standards and emerging technologies.Other duties deemed necessary.Education, Work Experience and Requirements: High school education, or equivalent, and 2 year associate degree in electronic required. 4+ years working in the electronic field where AC/DC theory is used on a daily basis, 4+ years working with computers at the systems level. Advanced computer skills to include: software applications, installations, and configuration; local and wide area network systems, and databases. MCSE, Networking, Database and other IT certifications are desired.  This position requires a valid driver’s license, clean driving record and insurance."}