{"jobID": "2671942835", "jobLocation": "Brooklyn_NY", "jobTitle": "Account Executive", "companyRating": null, "companyInfo": {"Website": "www.hubinternational.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "AboutHUB International Limited HUB International is a top 10 global insurance broker providing a broad array of property, casualty, risk management, life and health, employee benefits, investment and wealth management products and services. Our regional offices throughout North America are dedicated to helping individuals and businesses evaluate and manage their risks and insurance needs. Account ExecutiveKey Objectives: To perform this job successfully, the incumbent must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. These qualifications are considered without regard to race, religion, color, sex, national origin, disability, or any other characteristic protected by federal, state, and local law. If this position requires licensing or certification, the incumbent must maintain that license or certification by meeting all continuing education and other requirements. The functions and roles of this position include: To service existing accounts and coordinate account activity:  · Work within a fast paced team environment supporting and reporting to the First Vice President of the Brooklyn Operations in Nursing Homes Division.  · Provides professional, courteous service to our clients, carrier representatives, underwriters, business partners, and HUB colleagues, resulting in a rate of account retention that meets or exceeds expectations.  · Provides a high level of support to Producers in obtaining, maintaining, and expanding business.  · May also be responsible for account rounding and the development of new business as appropriate and in accordance with standard practices, policies, and procedures.  · Makes major decisions independent of manager approval on books of insurance business for which the incumbent is responsible.  · Works closely with Producers and other HUB personnel on all aspects of client service, marketing, and renewal while adhering to HUBs best practices and standard procedures.  · Oversees the preparation and implementation of all transactions, paperwork, and internal processing for assigned accounts.  · Acquires understanding of clients insurance objectives and critically analyzes and compares insurance plans to determine suitability. Stays abreast of changes in the insurance industry and other external conditions that may impact their clients. Makes appropriate recommendations to clients in response to those changes independent of manager approval.  · Acts as liaison between clients and insurance carriers to resolve escalated complex service issues that require policy interpretation and experience based judgment to resolve. May also negotiate with underwriters and carriers. Troubleshoots claims and billing issues.  · Responsible for overall retention of accounts in assigned book of business.  · Develops new business from existing accounts and assigned leads, and contributes to meeting departmental production goals. Identifies and follows-up on cross-selling opportunities when appropriate.  · Manages, organizes, and conducts client meetings when necessary.  · Appropriately documents conversations with clients and carrier representatives and updates all HUB computer systems and automated agency management systems when necessary. Ensures the accuracy of data in those systems.  · Travels on company business as required.  · Prepares reports for management as required.  · Attends industry related continuing education training and courses.  · Performs other duties and projects as assigned.  · Manages a book of insurance business, while acting with a high degree of independent discretion, autonomy, and decision-making. Location: United States, New York, Brooklyn Required Education: High school or equivalent Required Experience: 5-7 years Required Travel: Negligible Date published: 23-Feb-2018 Department: Account Management & Service Ref#: P2330_20180222  HUB International Limited is an equal opportunity and affirmative action employer that does not discriminate on the basis of race/ethnicity, national origin, religion, age, color, sex, sexual orientation, gender identity, disability or veteran's status, or any other characteristic protected by local, state or federal laws, rules or regulations. The EEO is the Law poster and its supplement is available here at http://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm .  We endeavor to make this website accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact the US Recruiting Team toll-free at (844) 300-9193 or USRecruiting@hubinternational.com . This contact information is for accommodation requests only; do not use this contact information to inquire about the status of applications."}