{"jobID": "2691786832", "jobLocation": "New_York_NY", "jobTitle": "Business Development - National Accounts (High End Retail)", "companyRating": null, "companyInfo": {"Website": "www.neenah.com", "Headquarters": "Alpharetta, GA", "Size": "1001 to 5000 employees", "Founded": " 2004", "Type": " Company - Public (NP) ", "Industry": " Manufacturing", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Neenah is growing and we are actively searching for an individual with strong ties to the Beauty and Fragrance industry along with High End Retailers for a National Account - Business Development position. This is a B2B sales role with primary focus of developing strong relationships with key national brands that will lead to the purchase of multiple Neenah product solutions.  Neenah produces high-grade fine paper, packaging, filtration and performance materials that are recognized in the industry for their brand, image and performance; www.neenah.com. Build and develop an opportunity pipeline that will lead to the specification and purchase of Neenah packaging and wide format products.Identify and target new opportunities and applications with national brands who understand the value of image & performance.Conduct research, develop insights and strategic plans for accounts that tie back to Neenah’s capabilitiesTrade show participationBachelor Degree from an accredited college or university required.Minimum 5 – 8 years B2B NATIONAL ACCOUNT sales experience; manufacturing, distribution or specialty accounts highly preferred.Up to 50% travel with potential of International travel.Ability to upsell and articulate premium product and global supply chain solutions.Public speaking and presentation skills required.Hunter mentality with a proven track of developing business with large end users.Ability to work with multiple roles in an organization – brand managers, designers, engineers, supply chain management.Adept at following repeatable sales process and utilize CRM tools for forecasting and strategic account planning activitiesExperience with secondary packaging applications and wide format retail solutions are a plus."}