{"jobID": "2829715765", "jobLocation": "Bronx_NY", "jobTitle": "Merchandise Specialist", "companyRating": "2.9", "companyInfo": {"Website": "www.bjs.com", "Headquarters": "Westborough, MA", "Size": "10000+ employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Costco Wholesale, Sam's Club"}, "estimatedSalary": "11", "jobDescription": " BJ's Wholesale Club was the first retailer to introduce the warehouse club concept in the northeastern United States. Today, we’re a multibillion dollar operation with more than 200 clubs in 15 states from Maine to Florida.  While our Members know us for helping them save up to 25% off grocery prices every day, our Team Members love us for providing a supportive and engaging workplace that’s committed to developing great talent.  If you’re a motivated and enthusiastic person who enjoys working collaboratively and is committed to providing great service for our Members, we want to hear from you. BJ’s offers a fast-paced, team environment with great training opportunities and competitive salary and benefits packages to help you succeed. MERCHANDISE SPECIALIST Night Merchandise Specialists are responsible for ensuring merchandise is available for sale in proper quantities throughout the store. Duties also include supervising the work of Stocking Crew Team Members, which includes preparing lists for the Stocking Crew, and scheduling work hours. Additional responsibilities include but not limited to: Ensuring that the merchandise is properly displayed and has appropriate signageMaintaining sufficient inventory levelsRecommending changes that would enhance salesEnforcing all safety and sanitation policies and proceduresEnsuring Data Coding procedures are being followedProviding Members First service during all hours of the Club operationSuggesting and updating plan-o-gramsRecommending promotions for Stock Crew Team MemberRequirements:High school educationMerchandise handling experience at a grocery or discount store1 – 3 years of forklift driver and ticketer experienceMinimum Age Requirements: Must be at least 18 years of age.  BJ's Wholesale Club is committed to a policy of equal employment opportunity for all qualified team members and applicants for employment without regard to race, religion, color, sex, sexual orientation, age, ancestry, national origin, physical and/or mental disability, genetic information, atypical cellular or blood trait, marital and/or familial status, pregnancy, gender identity and expression, military or veteran status, or any other characteristics protected by applicable law."}