{"jobID": "2807384355", "jobLocation": "Santa_Clara_CA", "jobTitle": "Registered Nurse - RN Liaison - Care Transition Nurse Hospice", "companyRating": "2.9", "companyInfo": {"Website": "www.hcr-manorcare.com", "Headquarters": "Toledo, OH", "Size": "5001 to 10000 employees", "Founded": " 1991", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Kindred Healthcare, Genesis HealthCare, Sava Senior Care"}, "estimatedSalary": "50", "jobDescription": " Heartland Home Health Care and Hospice is part of the HCR ManorCare family, a leading provider of home health care, hospice care, skilled nursing, memory care and post-acute care.  Heartland Hospice Services of Santa Clara CA has an immediate need for a Registered Nurse Liaison.  The Liaison RN is responsible for providing the consistency and predictability necessary to transition a patient's care between care settings or levels of care within a care setting in a timely fashion. Once a referral has been made to Heartland, the Liaison RN coordinates the care transition for patients requiring the services of any of the products offered in that market including hospice, home care, infusion and IPU services as applicable. The role may include explaining benefits, assessing eligibility, completing part or all of the admission process and providing daily GIP visit services. The Liaison RN partners with the sales team to develop and maintain referral source relationships.  In return for your expertise, you'll enjoy excellent training, industry-leading benefits and unlimited opportunities to learn and grow. Be a part of the team leading the nation in healthcare.4687 - Heartland Hospice - Serving Santa Clara County, CaliforniaMinimum of two years of experience delivering home health care, IV care or hospice services.  Demonstrated knowledge of payer sources.  Demonstrated knowledge of the referral source types and community resources.Job Specific Details:  We are adding positions due to growth! We are also looking for a Director of Professional Services (DPS) as well as a dynamic RN."}