{"jobID": "2812263048", "jobLocation": "Los_Altos_CA", "jobTitle": "Mortgage Account Executive", "companyRating": null, "companyInfo": {"Website": "www.franklinamerican.com", "Headquarters": "Franklin, TN", "Size": "501 to 1000 employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Nationstar Mortgage, GMAC Mortgage"}, "estimatedSalary": null, "jobDescription": "Account ExecutiveFranklin American Mortgage is looking for a proactive, self-motivated individual with strong sales experience to represent the company as a Mortgage Account Executive in our Wholesale Department. The Account Executive is in charge of developing prospective accounts, maintaining loan production from active accounts, and identifying and soliciting prospective accounts within their defined territory. Additionally, this position provides a high level of service and training for current and prospective accounts.Responsibilties:• Monitoring pipeline performance on a daily basis, including tracking monthly volume, fall out, and loan quality.• Maintaining familiarity with regulatory and industry standards and requirements, including attending educational and industry seminars.• Assisting in development of new marketing materials; distribute materials to existing and prospective account base.• Maintaining daily contact with account base to provide training, review performance and solicit new business.• Interviewing prospective accounts, conducting on-site inspections of prospective accounts' premises, and reviewing necessary information required for account approval.• Maintaining up-to-date database with accounts' information.Franklin American Mortgage is a national \"A\" paper lender that specializes in Government and Conventional products. Please visit www.whyfamcwholesale.com for more informationQualifications:• Strong sales skills required with a history of past success, B2B sales preferred• Mortgage related experience preferred• Excellent presentation skills for both small and large audience• Strong analysis and judgment skills• Resourcefulness and excellent problem solving skills• Outstanding communication, both written and verbal• Detail orientation with strong organizational and follow-through skills• Ability to prospect new business effectively• The desire and ability to build and grow strong interpersonal and business relationships • Proactive and self-motivatedCompany Overview:Franklin American Mortgage Company is a privately-held mortgage banking firm. We are built upon traditional values and beliefs and our dedication to professionalism, unparalleled customer service and integrity in decision making and processes continues to set us apart within the industry. Internally, employee feedback often talks about our team oriented culture, supportive management and our ability to focus on growing and encouraging employees to achieve success individually and collaboratively through team dynamics. We choose to challenge ourselves to continue to be the best mortgage banker in an evolving industry.Franklin American Mortgage Company offers a three-tiered Medical Plan, Dental, Vision, Disability Plans, Company Paid Life Insurance and Wellness Program. Medical Insurance is available within 30 days of employment. Franklin American also offers 401k plan, professional work environment, room for growth and career advancement.For more information about the company and its services, please go to www.franklinamerican.com. Equal Opportunity Employer"}