{"jobID": "2524549788", "jobLocation": "Austin_TX", "jobTitle": "Performance Modeling Engineering Intern", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Samsung is a world leader in Memory, LCD and System LSI technologies. We are currently looking for exceptional software and hardware talent to join our Samsung Austin R & D Center (SARC) in Austin, TX and our Advanced Computing Lab (ACL) in San Jose, CA. SARC was established in Austin, TX in 2010 to be one of Samsung’s strategic investments in high performance low power ARM based device technology. Our CPU design teams develop IP for Samsung mobile products and their Application Processor (AP). Our GPU design teams, located in Austin (SARC) and San Jose (ACL), are developing a custom GPU that will be deployed in Samsung mobile products.  We are seeking performance modeling engineers with a strong background in simulation architecture, performance modeling, and performance analysis, as well as modeling framework design and development. Other areas of expertise needed include defining performance requirements for end-use platforms, performance correlation, software optimization, and modeling infrastructure and tools.  Desired Skills and Experience:Micro-architectural expertise: Have a thorough understanding of superscalar processor and memory subsystem micro-architectural concepts such as pipelining, renaming, scheduling, out-of-order execution, caches, cache coherency protocols, MMU, branch prediction, prefetching, etc. Be capable of detecting performance issues, devising appropriate improvements, modeling those improvements, and presenting these results to the wider team.Experienced C++ software developer to work in a team designing and building frameworks, infrastructure, visualization tools, and simulation models for performance analysis, bring-up, and software enablement.Design, develop, and test performance (cycle-timed) models of cores, caches, interconnects, and memory subsystems. Perform timing correlation analysis to evaluate model timing accuracy. Provide guidance to processor/SoC architects and logic design teams. Work closely with micro-architecture analysts to instrument and modify pipeline models to explore architectural design trade-offs.Critical Skills:Micro-architecture knowledge: candidate needs to have strong foundation in processor and memory subsystems. Must demonstrate ability to take micro-architectural concepts to cycle-accurate models.C++ programming experience: candidate needs to have written a large body of code (10K lines). Must demonstrate ability to design cohesive class organizations. Familiarity with generic programming techniques (e.g. templates) is required.OO Design and SW Engineering: must be conversant in the standard \"GoF\" (Gamma, et. al) design patterns (i.e. how to select and apply the most common patterns appropriately). Must follow software engineering best practices (coding conventions, code organizations, UML, documentation, etc.)Efficient Coding: must be able to design and implement highly efficient code sequences to maintain simulation performance. Candidate needs to be conversant in algorithms, data structures, and code translation effects as well as code profiling techniques. Must be able to weigh implementation and design tradeoffs for code efficiency, robustness, and extensibility.Important:Python experience: should be familiar with object oriented python development and class hierarchy (i.e. not just used python as a sequential programming environment).Data Structures and Algorithms: competency with the typical data structures (various lists, trees, hashes, etc.) and algorithms. Must be able to analyze algorithm complexity, and select the most suitable DS/algorithm according to the task.Desirable:Parallel Processing: must be familiar with common parallelization issues and techniques (e.g. pthreads, Intel TBB, mutexes, etc.)Libraries: must be familiar with STL (common containers, their characteristics, and the iterator pattern). Familiarity with the Boost library is highly desirable.Simulation Techniques: familiarity with common simulation techniques is required (e.g. simple functional simulation, simple time management, etc.). experience with GEM5, Simpoint, QEMU, and/or valgrind is highly desirable.Frameworks: Familiarity with XML, database development (MySQL), SystemC, and Ruby is a plusRTL: working knowledge of RTL and RTL development & simulation toolsetsESL: knowledge of system-level development tools from 3rd party EDA vendors including Carbon, Mentor, Synopsys etcEducation Required: Pursuing an advanced degree in Computer Science, Computer Engineering or related field with a minimum of 3.5 GPA.  Samsung provides Equal Employment Opportunity for all individuals regardless of race, color, religion, gender, age, national origin, marital status, sexual orientation, status as a protected veteran, genetic information, status as a qualified individual with a disability or any other characteristic protected by law."}