{"jobID": "2822281863", "jobLocation": "Oakland_CA", "jobTitle": "Programmer Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.pandoragroup.com", "Headquarters": "Copenhagen, Denmark", "Size": "10000+ employees", "Founded": " 1982", "Type": " Company - Public (PNDORA) ", "Industry": " Retail", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Tiffany & Co., Swarovski"}, "estimatedSalary": "83000", "jobDescription": " At Pandora, we're a unique collection of engineers, musicians, designers, marketers, and world-class sellers with a common goal: to enrich lives by delivering effortless personalized music enjoyment and discovery. Peoplethe listeners, the artists, and our employeesare at the center of our mission and everything we do. Actually, employees at Pandora are a lot like the service itself: bright, eclectic, and innovative. Collaboration is the foundation of our workforce, and we're looking for smart individuals who are self-motivated and passionate to join us. Be a part of the engine that creates the soundtrack to life. Discover your future at Pandora!  We have a great position available for an outstanding Programmer Analysis working in Enterprise Systems. In this role you will be responsible for supporting, maintaining, and enhancing our back-end Java and Postgres technologies that drive our automated revenue recognition processes. This includes understanding our current data model, performing enhancements to our Java code or database performance, and working with internal customers to troubleshoot issues with these systems. Exciting opportunity to also learn and bring in your analysis skills at forefront with analysis of key back office application like Ad revenue recognition, ERP, CRM and helping business streamline their business process through it.  The Enterprise Systems team works with various other departments in the company, and delivers new capabilities, optimizations, and automations that make our back-office operations more streamlined and effective. As a member of our highly motivated and collaborative team, you will be working with business stakeholders, business analysts, project managers, and developers, and should be dedicated to excellence and have a strong sense of personal responsibility. Strong written and verbal communication skills are a must. This role has excellent potential for growth and high exposure to a variety of professional experiences. Essential Responsibilities:Self-Motivated to learn new applications&technology;, adapting to changes, taking responsibilities in a fast paced organization.Excellent ability to explain technical issues to a variety of audiences such as enterprise architects, developers, business stakeholders&executives.;Develops and maintains applications and databases by evaluating needs; analyzing requirements; developing software systems.Enhances delivery of solutions; answering technical and procedural questions for less experienced team members; teaching improved process; mentoring team members.Identifies requirements by establishing personal rapport with potential and actual clients and with other persons in a position to understand service requirements.Arranges project requirements in programming sequence by analyzing requirements; preparing a functional description.Develops a technical plan to implement the functional description; Implements the technical plan.Confirms program operation by conducting tests; modifying program sequence and/or codes.Writing and maintaining user documentation.Maintains professional and technical knowledge by attending educational workshops; reviewing professional publications; participating in professional societies.Protects operations by keeping information confidential. Follows SOX guidelines.Contributes to team effort by accomplishing related results as needed.Supervises Enterprise Software Development and assigns programming tasks/projects to the Enterprise Software Development InternQualifications:BA or BS degree required.Excellent written, verbal, and interpersonal skills are a must6+ years of demonstrated expertise in engineering Java applications is a must; Experience using Java, J2EE(5.0), Servlets 2.5/3.0, JSP 2.1/2.2, JSF, EJB 2.0, JDBC, JNDI, HTML5, DHTML, XML&JavaScript;3+ years working with RDBMS systems, preferably Postgres or Oracle, with demonstrated SQL skill. Candidate should have high confidence&solid; work experience in all operational database activities (creating and understanding ERDs, changing schemas, tuning performance, etc.)3+ years of experience in deployment and administration of J2EE Application Servers and Containers, e.g. Tomcat, Spring, etc.3+ years of experience working confidently in Unix / Linux environmentsExperience with and understanding of build automation tools such as Maven and Jenkins, and their role within the SDLCCoding and debugging against Java APIs. Contributes, and has open source examples available for review on Git, GitHub, Butbucket, etc.Experience with unit testing automation technologies such as JUnit, Mockito, DBUnit, etc.Ability to quickly build POCs / prototypes / wireframes to assist in designing high-level product concepts and capabilitiesUnderstanding of security threats to web-based systems, and knowledge of how to protect against themCore analytical skills related to understanding and analyzing business use casesComfortable working with Change Management and Release Management processes.Having .net experience Big data experience with Hive / Hadoop and HDFS is a plusAny prior experience with ERP system like Oracle is a plus Pandora is committed to diversity in its workforce. Pandora is an equal employment opportunity employer and considers qualified applicants without regard to gender, sexual orientation, gender identity, race, veteran or disability status. Women and people of color are encouraged to apply.  Pandora is also a VEVRAA federal contractor. Pandora requests priority referrals of protected veterans from each ESDS, as required by regulation.  If you believe you need a reasonable accommodation in order to search for a job opening or to apply for a position, please contact us by sending an email to disability@pandora.com This email box is designed to assist job seekers who require a reasonable accommodation to the application process. A response to your request may take up to two business days.  In your email, please include the following: The specific accommodation requested to complete the employment application.The location or office to which you would like to applyThe subject of the email should read \"Request for Reasonable Accommodation\"."}