{"jobID": "1968269471", "jobLocation": "New_York_NY", "jobTitle": "Elementary School Science Teacher", "companyRating": null, "companyInfo": {"Website": "www.successcareers.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2006", "Type": " School / School District", "Industry": " Education", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "As the fastest growing, highest-performing charter school network in New York State, Success Academy has reimagined public education. Nationally recognized for achieving outstanding academic results for students from all backgrounds and zip codes, we have created an innovative K-12 school model that is preparing current and future generations of children with the subject mastery and skills to succeed in college and life. We now need a results-driven Elementary School Science Teacher to join our school community.Key responsibilities include: - Building a classroom culture in which scholars love science;- Teaching students Life, Physical, and Earth Science, through experimentation and inquiry-based learning;- Facilitating scholars’ increasing independence in developing their own scientific processes, fully internalizing the scientific method;- Driving academic outcomes by analyzing data, studying student work, and implementing high leverage instructional moves to ensure dramatic gains for all students; and- Training with colleagues and school leaders to receive targeted, in-the-moment feedback on instruction, as well as unparalleled support and professional development.Successful candidates should also have the following experiences and characteristics. They:- Have lead teaching experience with a proven record of propelling student growth;- Hold a Bachelor’s degree with an outstanding record of academic achievement and leadership- Are a person of high moral character; and- Are passionate about science and learning.To join our team, please upload a cover letter and resume that outlines your candidacy. Your cover letter should explain in detail your qualifications for the position. Resumes without cover letters will not be reviewed.Success Academy Charter Schools is an equal opportunity employer and actively encourages applications from people of all backgrounds. Compensation is competitive and commensurate with experience. Success Academy offers a full benefits program and opportunities for professional growth.Apply"}