{"jobID": "2831487806", "jobLocation": "Los_Angeles_CA", "jobTitle": "Sr. Data Analyst, Analytics", "companyRating": "3.6", "companyInfo": {"Website": "www.herbalife.com", "Headquarters": "Los Angeles, CA", "Size": "1001 to 5000 employees", "Founded": " 1980", "Type": " Company - Public (HLF) ", "Industry": " Consumer Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Beachbody, Guthy-Renker"}, "estimatedSalary": "86000", "jobDescription": "COMPANY OVERVIEW: Herbalife is a global nutrition company that has helped people pursue a healthy, active life since 1980. Our nutrition, weight-management and personal care products are available exclusively through dedicated independent Members in more than 90 countries. Our Mission is to change people's lives by providing the best business opportunity in direct selling and the best nutrition and weight-management products in the world. POSITION SUMMARY STATEMENT: The Sr. Data Analyst turns data into insight, and insight into business decisions. The position will be responsible for performing detailed analysis of digital marketing campaigns, for analyzing the effectiveness of targeted content, and for analyzing the performance of customer journeys. They will also be closely involved in supporting a global base of users in their analysis and report requests, and providing recommendations to the respective teams on how to improve user participation in our various marketing efforts. DETAILED RESPONSIBILITIES/DUTIES:Acquire data from multiple data sources for analysis.Identify, analyze and interpret trends or patterns in complex data systems using appropriate statistical and data mining techniques.Locate and define new process improvement opportunities.Analyze worldwide marketing and sales data to improve understanding of member/customer behavior and business trends.Help with the analysis of usage patterns of our websites. Actively contribute to finding new methods to understand user behavior and areas of struggle in their online experience.Present data findings to stakeholders and senior managementSupport day to day data requests as required.Test and audit the quality of data collected and work with the development teams to correct any inaccuracies/inconsistencies.Coordinate with other team members to ensure timely execution of the project plan.REQUIRED QUALIFICATIONS:Skills:Strong analytical skills with the ability to collect, organize, analyze, and disseminatesignificant amounts of information with attention to detail and accuracy.Knowledge of statistical and data mining techniques: Classification Analysis, Cluster Analysis, Regression Analysis, Anomaly Detection, etc.Advanced SQL skills.Advanced skills in MS Excel and PowerPoint.Experience presenting business driving insights to stakeholders.Familiarity with digital marketing principles and data.Excellent communication skills, both oral and written.Strong interpersonal skills to build effective business relationshipsExperience:5 years demonstrated experience as a Data AnalystEducation:Bachelor's degree in Mathematics, Computer Science or related fieldPREFERRED QUALIFICATIONS:Master's degree in Mathematics, Computer Science or related field.Experience using statistical tools such as Python, R, etc.Experience with Adobe Analytics Toolset.Experience with Microstrategy.Detailed understanding of web analytics concepts and principles."}