{"jobID": "2783405914", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": "2.9", "companyInfo": {"Website": "www.transdevna.com", "Headquarters": "Lombard, IL", "Size": "10000+ employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Transportation & Logistics", "Revenue": " Unknown / Non-Applicable", "Competitors": " First Transit, MV Transportation, Uber"}, "estimatedSalary": "111000", "jobDescription": " The Data Scientist will be a part of Compass Transportation, a subsidiary of Transdev. Compass Transportation has become one of the largest B2B transportation providers in the Bay Area over the past ten years. We specialize in providing commuter services across the Bay Area as well as exploring new shared ride products. As a transportation operator we have been gifted with heaps of data that we are looking to better utilize in driving improvements, efficiencies, and ultimately feeding into our strategy.  Do you have a deep quantitative background? Do you believe data builds better products and has a key role in engineering decisions? Are you able to translate data into strategy? If so, this is the job for you!  Our Data Scientist sits at the intersection of strategic planning and technology development. Whether it’s collaborating with product leadership to help create, implement, or evaluate success metrics or working with our developers to provide intuition on how to improve our products. Strategic planning based on data analyticsCollaborating with various department to evaluate product performanceFinding solutions on improvements of our productsEducation, License, Certifications:Bachelor's degree required, preferably in Statistics, Finance or related fieldMaster's degree preferredSkills and Knowledge Required:Experience with ExcelSQL, R, and Python experience preferred but not requiredStrategic mindset - you're comfortable thinking a few steps ahead of where the team is at nowDriven and focused self-starter, great communicator with amazing follow-through. You are someone who will aggressively tackle their work and love the responsibility of being individually empowered.A preference quality over quantity- you are driven to get the math right and aspire to build the right solution; and also are someone who enjoys a team that holds each other to a high bar.The above statements are intended to describe the general nature and level of work being performed by people assigned to this classification. They are not intended to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel so classified.Transdev is an Equal Employment Opportunity (EEO) employer and welcomes all qualified applicants. Applicants will receive fair and impartial consideration without regard to race, sex, color, national origin, age, disability, veteran status, genetic data, gender identity, sexual orientation, religion or other legally protected status, or any other classification protected by federal, state, or local law.EEO is the Law Poster: http://www1.eeoc.gov/employers/poster.cfmDrug free workplaceIf based in the United States, applicants must be eligible to work in US without restrictions for any employer at any time; be able to pass a drug screen and background check"}