{"jobID": "2824834232", "jobLocation": "Boston_MA", "jobTitle": "Senior Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.jobjuncture.com", "Headquarters": "Houston, TX", "Size": "1001 to 5000 employees", "Founded": " 1992", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Our client is a data-driven platform that uses unique data to help customize their consumers needs. They have the world's most complete dataset allowing them to connect consumers, brands, and retailers across their entire industry. This dataset is the fuel for deep personalization powered by AI and driven by our Science and Engineering teams. They are looking for energetic and motivated Scientists at all levels. What you will do:Define problems, research solutions, and figure out which data to use in a solution.Query, assemble, clean, and refine datasets in preparation for analysis.Analyze data using a variety techniques in order to build a proof of concept for a solution.Build high-quality prototypes and collaborate with the engineering team to implement the solution in a scalable framework (e.g.: Spark)Communicate findings to stakeholders and a broader audience of technical and non-technical co-workers.Excellent English communications skills (written and oral).Lead projects, work on teams, and mentor junior analysts/scientists.Required Experience/Skills:Education and/or experience in a quantitative field. (PhD/Master’s degree)3+ years professional experience at organization(s) producing solutions based on analysis of large data sets.Experience with statistics, mathematical modeling, and/or machine learning, and experience implementing such methods to tackle real world problems using real data.SQL, or experience with another database technology.Experience with Python (familiarity with a statistical programming package, such as pandas, is a plus).Experience with big data tools and frameworks, such as Spark, is a plus.Excellent English communications skills (written and oral).Experience with text analysis or computer vision is a plus.Willingness to learn new tools as they become needed."}