{"jobID": "2726937226", "jobLocation": "Redwood_City_CA", "jobTitle": "Psychological Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.kidaptive.com", "Headquarters": "Mountain View, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Kidaptive is looking for a data-science expert to join our Learning Team in Redwood Shores. The Learning Team’s work draws heavily from research in the fields of psychology, education, statistics, and computer science, but we apply that research to build real-world technologies. This position requires data analysis, statistical modeling, visualization, collaboration, and communication with internal and external stakeholders. Responsibilities:Oversee multiple technical measurement and research projects related to product development.Perform data cleaning/preparation, management, and statistical analysis of various types of data sets (e.g., gameplay data, online testing, user behaviors in digital environments), including basic and complex statistical design and analysis, recommendations, statistical modeling, and possibly psychometricsDesign, develop, document, and deliver technical and operational procedures and modules.Assist with development of technical reports including charts and graphs, to provide summary of findings, interpretation of results, and data-driven recommendations.Requirements:Master’s/Ph.D. degree (or equivalent experience) in quantitative psychology, statistics, computer science, or related fieldAdvanced training in psychometrics, machine learning, data science, or equivalentAbility to independently clean data, run exploratory analyses, fit models, and communicate findingsPersonal accountability with a strong work ethicBonuses:Experience applying research in real-world situationsExpertise with advanced machine-learning techniques (e.g., deep learning and/or Bayesian methods)Curiosity about mechanisms underlying observed behaviors, coupled with creativity in modeling those behaviorsExperience creating production-level code and/or automating ML models for production contextsExperience teaching, tutoring, or mentoringKnowledge of academic research literature on motivationAbout Kidaptive Kidaptive has brought together experts in the learning sciences, psychometrics, speech recognition, big data, and game design to achieve our vision of personalized, playful, lifelong learning. Our mission is to help children learn and have fun, and to empower parents, by creating a vibrant ecosystem of personalized learning experiences. We have created a groundbreaking adaptive-learning platform that powers our own learning products and our partners’ products, and we envision our ALP platform powering a large ecosystem of connected learning apps. We’re well funded by investors including Menlo Ventures, Formation 8, Stanford-Start X, New Schools Venture Fund, and NCSoft, among others. Our offices are in Silicon Valley, CA and Seoul, South Korea. To Apply: Please send a resume with the position in the subject line."}