{"jobID": "2787889239", "jobLocation": "Fremont_CA", "jobTitle": "Leasing Specialist", "companyRating": null, "companyInfo": {"Website": "www.essexapartmenthomes.com", "Headquarters": "San Mateo, CA", "Size": "1001 to 5000 employees", "Founded": " 1971", "Type": " Company - Public (ESS) ", "Industry": " Real Estate", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " AvalonBay Communities, Equity Residential, Irvine Company"}, "estimatedSalary": null, "jobDescription": " The person in this position is responsible for leasing, marketing and maintaining positive resident relations. Accountable for: securing appointments and presenting community features to maximize rentals, providing exceptional customer service to prospects and residents, and performing all administrative duties related to the on-site sales/marketing function. This position reports to the Community Manager or Assistant Manager.  Key responsibilities of this position include, but are not limited to the following: Lease apartments and sell ancillary products and servicesProvide a quality leasing experience for future residents as it relates to their interaction with the communityProvides professional service at all times, exercising discretion as it relates to confidential resident, property and company informationAssists residents with work order requests, ensuring quality and completionCompliance with company standards as defined in the Human Resources Policy Manual, Operations Playbook and applicable laws, e.g., Fair Housing, Landlord Tenant, Local Building Codes, OSHA, and EEOCHigh school diploma or equivalent preferredTwo years industry experience with proven track record of high closing ratio, or related experienceStrong sales, marketing and customer service experienceGood organizational and time management skillsValid driver license and automobile insuranceAbility to read and write English; speak English and understand spoken EnglishProficient understanding of the Microsoft suite, property management software preferred PHYSICAL REQUIREMENTS"}