{"jobID": "2811525322", "jobLocation": "Cambridge_MA", "jobTitle": "Structured Products Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.bracebridgecapital.com", "Headquarters": "Cambridge, MA", "Size": "Unknown", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "78000", "jobDescription": " Structured Products Data Analyst Location: Bracebridge Capital, LLC Job Code: 165 # of openings: 1 DescriptionWe are currently seeking a Data Analyst to work with our Structured Products group. The primary responsibilities of this position will include working closely with Surveillance Analysts and Data Team to streamline data collection and quality control, maintain proprietary systems, synthesize differences in data sources and cross-check with model output, and build out reporting tools in order to monitor asset performance and provide the senior investment team with detailed analytics. In this role, you will work across many areas of Structured Products, such as US and European RMBS, Consumer ABS, CMBS and CLOs. Interaction with trustees and other data providers will be required, as well as internal departments including both Research and Trading. You will also have the opportunity to work on ad hoc projects within the Structured Products group.  Responsibilities: Maintain surveillance data analytics and work with team to identify enhancements to surveillance logic, database, reports and workflowAnalyze remits, check payment numbers, update trackers, identify outliersSet up new parsing while improving on old scriptsProcess and analyze risk runsMonitor and track performance of current and new dealsAd hoc projects as needed  Qualifications:BS/BA degree with strong academic performance, preferably in a quantitative field1-3 years of data entry experience. Prior experience in Structured Products not requiredStrong programming skills. Experience in in C#, VBA and SQL a plus.Basic knowledge of economics, finance and accountingSolution"}