{"jobID": "2804213924", "jobLocation": "San_Jose_CA", "jobTitle": "QA Compliance Manager", "companyRating": "4.6", "companyInfo": {"Website": "www.outsetmedical.com", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " NxStage, Baxter, Intuitive Surgical"}, "estimatedSalary": "103000", "jobDescription": "Company OverviewOutset is a pioneering medical technology company that puts the patient before the machine. Our human-centered model is designed to dramatically improve not only the care experience – for patients, families, providers and physicians alike – but also cost-efficiency of dialysis delivery. We believe in introducing technology innovation in order to drive service model innovation. And in doing so, we intend to profoundly and permanently impact what, where and who can dialyze. Position Overview The QA Compliance Manager is an experienced person within the medical device industry with extensive knowledge performing their function within the Food & Drug Administration (FDA) Quality System Regulations (QSRs), International Organization of Standardization (ISO) 13485, Medical Device Directive (MDD) 93/42/EEC and ISO 14971. The incumbent has the ability to take strategic direction and establish efficient and compliant processes throughout the organization and has strong communication at all levels. Essential Job Functions:Deputy Management Representative – Understand and perform tasks described within the Quality System for Management Representative duties.Develop, administer and maintain quality assurance procedures and activities required to ensure that the company's processes and products are in compliance with applicable quality standards and requirements.Upgrades and implements Quality Management Systems, drafting procedures or revising existing SOPs, and training teams for proper adoption of new system requirements.Managing the Internal/ External Audit process with internal customers and third party certification and regulatory bodies (FDA, FDB, Notified Body, etc.).Maintaining and organizing the company's internal FDA quality audit program and managing corrective and preventive action plans.Identify quality assurance metrics; analyze and report trends to management.Assist in the failure investigation of product complaint and CAPA activities.Develop and maintain strong relationships with internal and external stakeholders to ensure optimal performanceWork collaboratively, negotiate and engage with key stakeholders to facilitate delivery and compliance with the purchasing strategy.Excellent interpersonal skills.A self-starter, motivated and able to positively motivate others  Focused, target driven with a positive, can-do attitude.People Management:Manage, coach and develop a high performing Supplier Quality team that meets agreed objectives and which delivers best practice results, added value and continuous improvements.Provide leadership, direction, management and development to the team-direct reports and QA support functions.Set department objectives/KPIs and review and assess ongoing performance of direct reports.Report on achievement of targets and identify any actions required.Manage and lead the team.Requirements/Qualifications:Bachelor’s degree.Minimum of 7+ years of hands on experience with increasing Quality Assurance responsibilities. Prior experiences in the medical device field is required, preferably experience with Capital Equipment medical devices.Thorough knowledge of FDA Quality System requirements, ISO 13485:2003 (Quality System) requirements, ISO 14971 (Risk Management) requirements, Medical Device Directives (MDD) requirements, Knowledge of Good Manufacturing Practices (GMP) and applicable Quality System Standards.Ability to work effectively in a fast paced and dynamic environment.Leadership and interpersonal skills to develop and manage good working relationships with internal departments (manufacturing, receiving, purchasing, product development, and regulatory), contractors, and suppliers; strong written and verbal communication skills. You are part of an organization that attracts and hires the best talent on the planet! You will be working with a great team of dedicated, friendly and knowledgeable individuals, developing novel and game changing product(s). We are dedicated to the development and growth of our Teammates.  In return, we offer you an opportunity to become a highly influential teammate who can build and support a first class Quality Engineering function by providing intelligence, discipline, problem solving and collaborative skills that can improve designs and processes.  "}