{"jobID": "2800776206", "jobLocation": "Duarte_CA", "jobTitle": "Data Scientist - Research Informatics", "companyRating": "3.5", "companyInfo": {"Website": "www.cityofhope.org", "Headquarters": "Duarte, CA", "Size": "5001 to 10000 employees", "Founded": " 1913", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " MD Anderson Cancer Center, Memorial Sloan Kettering, UCLA Health"}, "estimatedSalary": "112000", "jobDescription": " Job Title: Data Scientist Research InformaticsABOUT CITY OF HOPE: City of Hope, an innovative biomedical research, treatment and educational institution with over 5000 employees, is dedicated to the prevention and cure of cancer and other life-threatening diseases and guided by a compassionate, patient-centered philosophy.  Founded in 1913 and headquartered in Duarte, California, City of Hope is a remarkable non-profit institution, where compassion and advanced care go hand-in-hand with excellence in clinical and scientific research. City of Hope is a National Cancer Institute designated Comprehensive Cancer Center and a founding member of the National Comprehensive Cancer Network, an alliance of the nations 20 leading cancer centers that develops and institutes standards of care for cancer treatment. POSITION SUMMARY & KEY RESPONSIBILITIES: TheData Scientistwill be inquisitive in his/her approach to figuring out the right biomedical data set that needs to be mined from multiple clinical and clinical research systems at City of Hope (COH). Resource should be comfortable in asking questions about the data source, figure out the business rules around how it was put together, and look forward to aid scientists in their biomedical data identification and retrieval needs:  Will use data mining, statistics, statistical modeling and machine learning to understand relationships and patterns in data. The insights gathered from this analysis are translated into actionable steps and best practices  Responsible for developing tools to enable visualization to translate analytics into information that can be used by clinical and operational leadership  Will take a data driven approach to decision making in projects.  The Data Scientist with Clinical Research Focus position requires exceptional communication skills, a collaborative approach and attitude of service with a sense of urgency. The candidate must be self-driven and eager to learn new methods of data munging, data visualization and data analysis. Main Responsibilities Includes:Integrate multiple systems and perform analytics on large data setsPerform explanatory data analyses, generate and test working hypotheses, prepare and analyze historical data, identify patterns and correlations among various data points and discover new insightsPerform machine learning, natural language, and statistical analysis methodsMeet with researchers to explain data, data analysis, insights and relationships within dataAnalyze and interpret research data, extract scientific relevance and formulateProduce reports from research data to meet end-user needsCollaborate and develop working relationships with clinical informatics, bioinformatics and other computational groups at City of HopeCollaborate with other database and software developers.POSITION REQUIREMENTS:Minimum Education and Experience:Masters degree in statistics, mathematics, informatics, machine learning, computer science, epidemiology or a related field5-8 years of experience with data analytics3+ years of applicable experience developing and successfully implementing statistical models for data mining, predictive risk modeling, clustering, and classification2+ years of experience with decision treesExperience in using analytics to generate and validate insights from large data setsExperience with relational databases and SQL queriesOther Experience or Certification (Preferred):Ph.D. degree preferredExperience in a health care environmentExperience in health plans/payer environmentEHR experience3+ years of applicable experience developing and successfully implementing statistical models for data mining, predictive (risk) modeling, clustering, and classification2+ years of experience with decision treesSkills and Abilities:A doctorate degree in relevant discipline (e.g., medicine, basic sciences, clinical sciences, Health Sciences, applied statistics, data mining, machine learning, etc.)Deep familiarity with clinical research (clinical trials), clinical or healthcare domain is requiredFive years of experience in working with biomedical datasets in cancer research environmentA good understanding of statistical and predictive modeling concepts, machine-learning approaches, clustering and classification techniques and stratification analysis.Proficiency in SQL, MySQL and/or PostgreSQL.Expertise in one of the programing languagesDemonstrated understanding of machine learning and predictive analytics techniquesAbility to mine large datasets and analyze large, complex, multi-dimensional datasetsMust be knowledgeable in at least one statistical and analytic packages such as R, MATLAB, SAS, SPSS or WekaProficiency in at least one scripting language (e.g. Python, Perl)Ability to exercise independence and use creative approaches to problem-solving.Experience in data visualization of biomedical datasets.Comfortable communicating complex technical subjects to non-technical audiences using practical examples, and prototypes City of Hope is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, sexual orientation, gender identity, age, status as a protected veteran, or status as a qualified individual with disability.#LI-DA1 | *CB-DA ~dice~"}