{"jobID": "2796619027", "jobLocation": "Mountain_View_CA", "jobTitle": "Sr. Data Scientist", "companyRating": "3.9", "companyInfo": {"Website": "www.usertesting.com", "Headquarters": "Mountain View, CA", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "186000", "jobDescription": " Company DescriptionUserTesting enables companies to put their customers at the center of every business decision by leveraging the power of human insights. The most advanced on-demand customer insights platform, UserTesting enables product managers, UX researchers and designers, marketers, and digital executives to connect with their exact target customer in a matter of hours and uncover actionable insights that drive ROI. More than 35,000 companies have adopted UserTesting to make smarter business decisions throughout the design and development of their digital experiences as well as in their marketing messaging and competitive positioning.Job DescriptionAs a member of the Product Insights team, you will use machine learning and statistical techniques to understand and optimize the complex emergent behavior of our testing ecosystem. You will responsible for being a full-stack data scientist, from understanding and modelling the problem domain, all the way through developing and deploying production machine learning models to help us efficiently and effectively make business decisions at scale.  Integral to the role is your curiosity, deep analytic instinct, and your ability to design, create, implement, synthesize, and communicate machine learning and quantitative research using a variety of data. Define and measure quantitative product/business goals and metrics in collaboration with product managers, business owners and engineers.Prioritize and drive quantitative research and statistical modeling to solve complex business problems.Research, test, and deploy machine learning models to optimize the systems at the core of our businessCreate and support a data-driven culture among company decision makersQualificationsBachelor&apos;s degree with experience or advanced degree in an analytic field that uses quantitative methods to understand complex human systems: Economics, Sociology, Statistics, Mathematics, Science, Engineering and similar quantitative degrees welcome.3+ years of experience in an applied research setting, preferably in Consumer or B2B software development3+ years of experience in creating and deploying production machine learning systemsSubstantial coding experience with data/statistical packages (eg. SQL/Hive, R, Python (Pandas + Statsmodels + Scikit-learn), Pig, Julia, D3.js)Strong working knowledge of research methodology and statistical techniques including experimentation, statistical inference, and machine learningExperience performing advanced data analytics in a business, academic, or related context (e.g., high-tech, market research, management consulting, operations research, finance, etc.)Production-quality software development experienceAbility to explain value of different analytic methods, and the output of data analyses, to non-technical audiences, including executives and managersBig picture perspective and a healthy obsession with detailDeep curiosity and love of problem solvingDomain knowledge in: complex systems, game theory, pricing, economics, or auctions strongly preferred Additional InformationBesides a great work environment and the opportunity to change the world, we offer competitive salary, benefits, plenty of perks, as well as stock options. We value diversity, and we are proud to be an inclusive, equal opportunity workplace.  Learn more about what it is like to work at UserTesting at: https://www.usertesting.com/about-us/jobs"}