{"jobID": "2825875012", "jobLocation": "New_York_NY", "jobTitle": "Intern, Business Intelligence - IT- Part-Time", "companyRating": null, "companyInfo": {"Website": "www.automatic.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Metromile"}, "estimatedSalary": null, "jobDescription": " Temporary  Position Type: Internship  Session: Fall 2018 (September 17 - December 7, 2018)  Location: New York, NY Position Summary: SiriusXM interns don't just make coffee, they're on-air, on projects and making valuable contributions to SiriusXM. Join our internship program and learn about the radio world and get hands-on experience in your field of study.  Looking for a tech-savy marketing guru interested in joining our Business Intelligence team. Duties and Responsibilities:Obtain an understanding of IT practices built around supporting a subscription-based business and serve business goals such as customer acquisition, retention & engagement winback.Obtain an insight into working with structured and unstructured data.Understand real world IT processes around work intake, requirements definition, development, QA and production roll outs.Understand the SiriusXM marketing data model and assist with creation/maintenance of ERWIN data model.Understand and perform data integration, analysis and implementation of physical models through the development of scripts and ETL workflows.Assist in building, automating, and maintaining enterprise-wide data services and connectors for internal and external data sources that can be rapidly deployed to business analysts.Help to create proactive and reactive custom reports based on client needs.Troubleshoot issues, prepare summaries, document processes and workflows, propose solutions and collaborate and communicate with internal team members.Supervisory Responsibilities:None.Minimum Qualifications:You must be 18 years of age or older.Must be enrolled in a U.S. based college, university or trade school to qualify. Students who have completed at least two years of college are preferred.Pursuing Bachelor's degree in computer science, information technology, engineering, or related technical discipline with an IT focus.Course work and/or experience related to R, SQL, Programming basics.Course work or experience in mathematics, statistics, and relational algebra desired.Requirements and General Skills:Natural curiosity and flexibility in problem solving.Ability to generate insights from information.Excellent communication and customer interfacing skills (verbal and written).Ability to work independently multi-tasking in a deadline-driven environment.Must have legal right to work in the U.S.Technical Skills:Thorough knowledge of MS-Office Suite (Word, Excel, PowerPoint, Access).Ability to perform data manipulation, data conversion, and data analysis using SQL, Excel.Knowledge of R or SAS or other Natural Language Processing (NLP) platforms such as Java, Python, or Apache NLP. Please note that all SiriusXM internships are paid.  As an EEO/Affirmative Action Employer all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status.  The requirements and duties described above may be modified or waived by the Company in its sole discretion without notice.SDL2017"}