{"jobID": "2731964042", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Recruiter (Contract)", "companyRating": null, "companyInfo": {"Website": "www.stridehealth.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " HealthSherpa, Intuit, eHealth"}, "estimatedSalary": null, "jobDescription": "Stride Health is seeking a top notch Recruiter to work with our hiring leaders and employees to ensure we are attracting and hiring bright, creative and collaborative talent. We are at an inflection point in our growth, and this is an exciting opportunity to craft the future of the company. You will be responsible for making things happen in full-life cycle recruiting, sourcing and coordination. You will need to understand the various aspects of Stride's current business and future dreams in order to be an inspiring leader on all things Recruiting. You'll play a substantial role in defining and driving strategic and operational initiatives related to the amazing team and culture we are building. Sounds like you? Read onYour Mission Partner with employees and hiring managers to build links and deliver hires across the organizationBuild and handle a pipeline of candidates for each Stride team across multiple channelsMonitor and analyze the pipelineBuild and optimize our ATS, LeverPartner with our People Operations Team to cultivate a rich onboarding experienceProvide a personalized experience for every candidate from application stage to start date Recipe for Success A minimum of 5 years experience as a full-cycle recruiterStrong understanding of the importance of analytics to create, manage, and adjust a hiring programStrong intuition for identifying and creatively sourcing talentExperience working in high-growth technology companiesDemonstrated ability to recruit for a broad range of positionsExperience training managers and employees on premier sourcing and interview practices Cherries on Top Early stage in-house startup experience preferred but not requiredExperience working for a staffing firmAbout UsWe make software that helps the 100+ million people who work for themselves be more productive and successful, giving them economic security to thrive.For the past couple of years weve been solving really important problems for them like getting the right health coverage and simplifying their tax bills. Now were focused on building the worlds first all-in-one productivity platform designed to help them manage their business and make smart decisions every day.Our products are integrated into the worlds largest work-for-yourself platforms including Uber, Etsy, TaskRabbit, Postmates, Care.com, and others, and were backed by leading investment firms including Venrock, New Enterprise Associates, and F-Prime Capital Partners.Come help us take the work out of working for yourself!"}