{"jobID": "2791154697", "jobLocation": "San_Jose_CA", "jobTitle": "Maintenance Electrical Technician", "companyRating": null, "companyInfo": {"Website": "www.internationalpaper.com", "Headquarters": "Memphis, TN", "Size": "10000+ employees", "Founded": " 1898", "Type": " Company - Public (IP) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "What if you were given the opportunity and responsibility to make a difference? It is time to embrace your Infinite Possibilities. This is your opportunity to be part of International Paper, a Fortune 500 company and global leader in paper and packaging products. IP is known for our commitment to the environment and to cutting-edge technology. We have spent more than 100 years creating new ideas, and we are looking for people who can collaborate to help us build on our history, while creating future success. We are committed to attracting, preparing, promoting and supporting our teams. At International Paper, you control your destiny. We offer benefits, challenges, global opportunities and total rewards. When we say Infinite Possibilities, we mean it.  We currently have an opening for a Maintenance Electrical Technician at our manufacturing facility in Gilroy, CA. The Sheet Plant manufactures corrugated packaging for local and national customers. We are looking for motivated individuals who are capable of performing a multitude of functions in a flexible, fast-paced production environment. Our workplace requires individuals who understand the needs of the business while maintaing a focus on safety, customer satisfaction, quality and productivity. This position is responsible for safely providing maintenance support for our fast-pace Sheet Plant. We require both excellent mechanical skills and knowledge (pneumatics, hydraulics, bearings, power transmission, lubrication) and electrical/electronic skills and knowledge(PLC's, A/C, D/C motors and drives, AC/DC controls, and schematics) in our continuous process manufacturing environment to achieve machine uptime metrics. Work positively with teams to troubleshoot and solve problems and be engaged in preventative maintenance processes in assigned areas.  Requirements:  Specific responsibilities include but are not limited to:  Following all safety rules and practices, performing preventive maintenance activities such as lubricating, measuring wear, measuring positions, repositioning components; and observing operations, vibrations and noise levels. Performing emergency/break down maintenance as necessary to support plant operations. Accurately using measurement and test equipment. Performing electrical, mechanical, pneumatic, hydraulic, steam system, and other repairs and installations as needed. Maintaining clean and organized work areas, and cleaning up work areas as part of completing assigned tasks. Accurately and completely prepare and maintain maintenance records and other paperwork. Trouble-shooting and solving problems. Excellent teamwork, cooperation and problem solving skills. Willingness to fully cross train in other technical areas to enhance capabilities. Candidates must be willing to work alternative shifts, weekends, and overtime as required. Able to work with computer system for maintenance processes, stores and work orders. Performing other duties as assigned by supervision.  Competencies include:  Mechanical aptitude, troubleshooting expertise, electrical knowledge.  MInimum qualifications for consideration are a high school degree (Preferred), and 5 years of work experience in a Maintenance manufacturing environment with at least one year with the same employer. Highly-qualified candidates would possess manufacturing experience in the corrugated industry.  The hiring process for successful candidates will include a pre-employment aptitude and Maintenance tests, as well as a team interview. International Paper offers a competitive hourly wage rate. We also offer an excellent beneifts package that includes medical, dental, disability, life and accident insurance, as well as a 401(k) plan and pension plan.  International Paper is an Equal Opportunity Employer-Minorities/Females/Individuals with Disabilities/Veterans"}