{"jobID": "2497856115", "jobLocation": "Fremont_CA", "jobTitle": "Account Manager", "companyRating": null, "companyInfo": {"Website": "www.commercialenergy.net", "Headquarters": "Oakland, CA", "Size": "1 to 50 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Pacific Gas and Electric, Tiger Energy Services, Direct Energy Marketing Limited"}, "estimatedSalary": null, "jobDescription": " DescriptionWhat you will do:Your primary responsibility will be to prospect and develop new client relationships that are in line with Commercial Energy’s strategic priorities, gross margin objectives, and our defined sales processYou will continually uncover and develop additional sales opportunities via phone, e-mail, social media and all other communication channels availableProactively assess, clarify and validate customer needs on an on-going basisYou will consistently prepare and deliver electronic presentations and proposals in a professional manner that positions Commercial Energy in a strong value proposition to clientsDiligently update customer information utilizing SalesforceStay informed on all new developments in the Energy IndustryYou are always actively and consistently building and maintaining a robust network of business contacts within the industryWho you are:EXPERIENCE: You have 1 to 3 years, B to B Inside Sales Experience, preferably selling a strategic solution (not just a product) to C-level decision makers.SOLUTION SALES: You have succeeded best when you sold a solution for a client, not just a product, similar to our CE360 approach. CE360 helps each client manage their energy supply cost while providing technology to lower their usage (demand) and optimize their logistics/delivery costs from the utility.PERSONALITY: Activity driven, committed to competitive success, with a deep curiosity to understand client needs, a desire to become an expert and one who truly enjoys “hunting”.SKILLS: You are an exceptional communicator, both on the phone and through your e-mails and/or letters with:Demonstrated ability to use technologic and strategic selling tools, i.e. Salesforce, LinkedIn, etc.Bachelor’s Degree (GPA 3.0 or better) from a 4 year university.High energy, with unquestionable integrity, professionalism, and an ambition to succeed;Math is one of your strong suits, and Excel is a noun and a tool to you, not just a verb.You want to be tested to prove how good you know you are.Guided by the principle of always doing the right thing for the client and for your peers.Who we are and What we give you:LEVERAGE: An opportunity to leverage a twenty year old, employee owned company with over 3,000 established customers to grow its geographic reach selling something every business uses every day, energy.REAL MONEY! Not only do you receive an uncapped commission on all new sales and renewals, but also a strong base salary and commissions for client growth every month you are with us.CAREER GROWTH: Clear and proven advancement opportunities based upon your individual performanceTECHNOLOGY: State of the art technology tools for CRM and presentations and client solution portals, as well as a great support team.TEAM SPIRIT: We work hard here but we have fun too! We have scheduled parties, on-the-fly sporting events (our office overlooks Oracle Arena and the Coliseum) and we eat incredibly well.The usual extras: You are an employee here, not a contractor, so we help you take care of you and your family. The Company pays for your health plan benefits (Medical, Dental, Vision, Life), that meet your individual needs and much of your family as well.Extra Extras: Our 401-K plan provides up to an extra 4% cash contribution and our Employee Stock Ownership Plan provides equity and retirement income to you AT NO COST.Time off to rest and recharge. We have a generous PTO policy that lets you take time off whether you need to care for yourself, a loved one, or to enjoy that tropical or snow-bound vacation.INDUSTRY LEADERSHIP: You get to work in a positive, high energy environment, with others that share your dedication for providing, without question, the best customer experience to our clients in the fastest growing industry in America, ENERGY.Talk to Us Now, Your Future won’t wait any longer!"}