{"jobID": "2814017962", "jobLocation": "San_Francisco_CA", "jobTitle": "Product Manager- Data Infrastructure", "companyRating": "4.3", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "148000", "jobDescription": " About Uber Were changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now were a part of the logistical fabric of more than 600 cities around the world. Whether its a ride, a sandwich, or a package, we use technology to give people what they want, when they want it. For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer. And thats just what were doing today. Were thinking about the future, too. With teams working on autonomous trucking and self-driving cars, were in for the long haul. Were reimagining how people and things move from one place to the next. About The Role Data volumes at Uber are growing exponentially. Ubers business relies heavily on these rich datasets to gain deep insights and to make real-time business decisions. Analytics at Uber power critical applications like dynamic pricing, UberEATS delivery estimates, fraud detection, maps creation, driver activation, and many others. As a Product Manager, you will help define the strategy, drive requirements, and deliver products that power intelligence at Uber. Your teams will create and own systems that enable end-to-end data pipelines that take data from event emission and ingestion all the way through to BI applications and other Uber services built on top of our data. You will work closely with world-class Engineering teams, Product Managers, Technical Program Managers, Data scientists, and Designers. You will interface with nearly every aspect of the Uber organization - from Fraud to Finance, from Maps to Marketplace. If successful, you will change the course of data at Uber and create a world-class product suite that fuels and supports our unprecedented growth.Having excellent communication and collaboration skills, an entrepreneurial bent, excellent technical and analytical understanding, product management expertise, good judgment, and deep background in building scalable systems will allow you to thrive in this role. What Youll Do Internalize and deeply understand Uber's mission and strategy, as well as the mission and goals of multiple teams under your directionLead multiple teams and multiple projects working toward a scalable data infrastructure that supports your customers' needs. Attain internal product-market fit and widespread product adoption among data consumers at UberHelp recruit and mentor a team of highly technical Product Managers. Ensure excellent team dynamics, team and individual team member performance, growth and enthusiasmBe in the details. Know your team's work in depth.Work closely with other teams at Uber to ensure efficient and productive working relationshipsLead by example. Be incredibly truth-seeking and finger-tippy with data, set a high bar for the team to think boldly and creatively and then to funnel that energy into concrete products and execution plans, move fast and be biased toward action What Youll Need A computer science undergraduate degree or equivalent plus hands-on software engineering experience. Technical understanding must go from the highest abstractions down to the hardwareAt least 5 years experience leading product teams that delivered solutions/products related to data infrastructure at scaleA personality that encourages action, great collaboration and excellent simplification for communication.You never hesitate to roll up your sleeves and address something hands-on.Customer-centricity - you have many examples from your past of tough product issues that you persevered through to ensure customer satisfactionBonus: Familiarity with exciting and new data technologies, including HDFS, Hive, Kafka, Spark, Presto, Docker, Mesos, data warehousing solutions, and in-memory databases About the Team The Data team at Uber is a highly driven, motivated, and fun-loving team. In just a few years, the team has grown significantly to take the Data platform from a handful of products to one of the most sophisticated Data platforms in the world. You will learn from the best engineers and thought leaders in the valley."}