{"jobID": "2608697303", "jobLocation": "Santa_Monica_CA", "jobTitle": "Back-End / JAVA Developer Intern", "companyRating": null, "companyInfo": {"Website": "www.wirecash.com", "Headquarters": "Santa Monica, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About WireCash WireCash is an online marketplace for international money transfers, enabling U.S. residents to compare services and complete money transfers with a range of companies, to 100+ countries.  We build technology that empowers U.S. residents to make the best financial decision when they send money abroad to their family and friends. We bring choice, freedom, and transparency to international money remittance.  We have a fun, casual workplace, but maintain ambitious goals. With big goals come big challenges. Accordingly, we are looking for someone who is positive, nimble, and eager to seize the opportunity to make a powerful impact. Position Summary We're seeking a clever, dynamic Back-End / JAVA Developer Intern. In this role you would work closely with our engineering team on special projects that directly impact the customer experience and behind the scenes functionality of our processing of money transfers. A great opportunity to learn from our amazing team and contribute directly to the growth of our industry-shifting product. This is a paid position and, when interns excel we love to hire permanently! Required Skills:Ability to design, implement, and document RESTful APIs or webpages in JavaOpen to using new frameworks or librariesUnderstand and able to design and integrate NoSQL data stores.Knowledge in MVC patternsWorks great in a teamOrganized, and self-motivatedSystematic problem solving approach, coupled with a strong sense of ownership and driveBonuses:Experience with Amazon's web servicesKnowledgeable in Java side of Typesafe's Play frameworkGit and distributed revision control experienceHTML, CSS, and JSBilingualInternational travel experienceSDL2017"}