{"jobID": "2815813989", "jobLocation": "San_Francisco_CA", "jobTitle": "Software Engineer Intern", "companyRating": null, "companyInfo": {"Website": "www.mscripts.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Software Engineer InternAbout Us: mscripts is a fast growing mobile health start-up with headquarters in San Francisco, CA and development center in Bangalore, India. We provide pharmacies and other health and wellness organizations with mobile solutions delivered in a Software as a Service (SaaS) model. We're growing rapidly and have over 1,000,000 active users of our service across 20 pharmacy chains. In addition, we work with pharmacies, pharmaceuticals and other stakeholders to address the problem of medication non-adherence. Our products consist of a mixture of large enterprise and transactional systems, data management systems, and mobile technology. Role and Responsibilities mscripts, LLC is seeking a Software Engineer Intern with the skills to help with creating an analytics dashboard for our support systems which includes analysis, design and development of relevant code end to end.  The ideal candidate should have a technology background, and interested in learning how build SaaS applications, web services etc. Responsibilities and RequirementsTracking towards a Bachelors or Master's Degree (preferably in Computer Science or Information Science)Knowledge of how to design Java based workflows end-to-end (database to user interface)Good understanding of Core JavaSome knowledge of Spring FrameworkKnowledge of design and development skills with SQL and MySQL in particularKnowledge of Linux scriptingBasic tomcat to build out integration for the support systemInterest in contributing in the creation of detailed technical design documents.Interest in product development and agile development processes - coding modules as needed.Excellent communication skillsKnowledge on Tableau (Optional)"}