{"jobID": "2768373509", "jobLocation": "Newton_MA", "jobTitle": "Data Analyst", "companyRating": "4.2", "companyInfo": {"Website": "www.paytronix.com", "Headquarters": "Newton, MA", "Size": "51 to 200 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "59000", "jobDescription": "The kind of person we’re looking for:We’re looking for an energetic, thoughtful, intelligent, creative thinker to join the Data Insights team. You’ll need to have a passion for big data and analytics, and for solving difficult problems. You’ll need to be excited about trying new things, and looking for ways to create new intellectual property that can help Paytronix and our clients. And you’ll need to be a team player that is willing to be flexible to changing priorities, that is motivated by the opportunity to be part of building a business. The kind of stuff you’ll be doing:Using leading-edge tools to mine and analyze customer and transactional data to determine the impact of loyalty programs and marketing campaign on customer behaviorCreating actionable customer segments/clusters for reporting and targeting purposesCreating predictive models to determine expected results of loyalty programs/marketing campaigns.Analyzing email campaign data to recommend/improve promotional opportunitiesDeveloping new analytical methodologies to deliver deeper insights to our clientsPresenting results to both internal and external customersThe kind of experience you’ll need:Track record of excellent analytical and problem solving skillsProven ability to translate business problems into executable analysesA good understanding of statistics, including regression and predictive modelingExcellent communication skills to make recommendations and analysis to business users, both verbally and writtenBachelor of Science with a major in Statistics, Decision Sciences, Applied Mathematics degree or similar quantitative field of studyThe extra stuff that would be nice:Restaurant or Retail analytics experienceExperience with loyalty programsExperience using analytic software and BI (Business Intelligence) toolsProficient in SQL and knowledgeable about relational databases"}