{"jobID": "2830159423", "jobLocation": "San_Mateo_CA", "jobTitle": "Sr. Product Data Analyst – Virtual Assistant Product", "companyRating": "3.6", "companyInfo": {"Website": "www.asurion.com", "Headquarters": "Nashville, TN", "Size": "10000+ employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Apple, SquareTrade"}, "estimatedSalary": "113000", "jobDescription": "Asurion is seeking a talented senior data analyst who is passionate about the growing space of chat bots and Artificial Intelligent platforms. Our team works on creating disruptive and innovative products using emerging technologies. We are a close-knit team of scientists, engineers, designers, data experts and product managers currently building interesting products involving a customer facing virtual assistant (e.g Chatbot) in insurance vertical. You can learn more about the AI platform at https://www.asurion.com/about/research-labs/  Asurion offers technology solutions that enable the consumer to get the most out of their devices. As a partner to leading carrier, retail, and OEM companies, we have grown our white-labeled solutions to a subscriber base in the hundreds of millions. We are a privately held company with a healthy multi-billion USD annual revenue stream which enables us to focus on long term customer and client value. The Senior Data Analyst performs analysis of key performance measures for digital experience and the movement of customers across all channels in the claims process, including voice self-service, on-line chat, chat bots, SMS, and email. Role and Responsibilities: ·  Develop and automate reports, iteratively build and prototype dashboards to provide insights, solving for analytical needs.  ·  Conduct data analysis to make product recommendations (pre-launch forecasting, post-launch impact analysis).  ·  Working with engineering to define and implement tracking events, document, validate, and monitor logging and metrics.  ·  Track the movement of customers across channels within Asurion product ecosystem. Measure customer behaviors with effective data collection via SQL and other query languages to integrate data from multiple sources.  ·  Present results to senior management in a clear, concise, and compelling manner  ·  Operate with a high degree of autonomy in a direct support relationship to primary customers and meet all requirements with minimal management oversight  ·  Collaborate closely with product manager Here’s what you’ll bring to the team:  ·  3 years of proven experience in analytics preferably for a technology company  ·  Proficient in SQL. Strong understanding of databases, and query tools.  ·  Proficient in Excel  ·  Expert skill level in web analytics tools including Google Analytics and/or Mixpanel  ·  Critical thinker. Thoughtful, self-aware, and able to use available evidence to make decisions  ·  High-energy and a desire to work in a result oriented, fast-growth environment  ·  Intellectual curiosity, passion for problem-solving and comfort with ambiguity  ·  Strong interpersonal skills including confidence in dealing with people at all levels of the organization, ability to manage intake, and present insights  ·  Bachelor's Degree in Math, Physics, Statistics, Economics, Computer Science, or other quantitative fields required  ·  Experience with Web development for SEO/SEM is a plus  About Asurion: Simply put, Asurion helps people stay connected. As the global leader of connected life services, we provide over 290 million consumers around the world with simple, intuitive technology advice to help them get the most from their devices; support to fix their issues and connectivity crisis, and device protection to ensure they receive a replacement or repair. When a product is missing or simply doesn't work properly, Asurion’s 17,000 employees are focused on solving the problem with people and processes operating 24 hours a day, seven days a week, speaking six languages, and working across any device, platform, or provider. By partnering with leading retailers, mobile carriers and pay-tv providers, Asurion helps customers enhance their lives through their technology. For more information about Asurion, please visit www.asurion.comPRO00906 | San Mateo | California | US | 2018/06/28"}