{"jobID": "2529865089", "jobLocation": "Boston_MA", "jobTitle": "Business Development Representative", "companyRating": null, "companyInfo": {"Website": "www.klaviyo.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About KlaviyoKlaviyo is using technology to reinvent email marketing from the ground up. For too long marketing has been pretty selfish. Companies blast everyone with the same email, not because they think thats what customers want, but because they dont have a choice. Klaviyo fundamentally changes the game. Our software ties together everything companies know about their customers, processes massive quantities of data in real-time, and uses it to drive a platform thats part CRM, part analytics engine, and 100% an email platform that gets results.Technology has come a long way in the last 15 years, but email hasnt really changed. Were here to fix that.Inbound Business Development (iBD) at KlaviyoA crucial first step in the sales cycle. Properly qualifying and learning about a customer's needs is integral to success in a sales role. We possess a deep understanding of the value of Klaviyo's platform and the positive impact it can have on our prospective customers. We pride ourselves on accountability, effort and working collaboratively to create positive outcomes. We understand that these values are essential to meeting goals and exceeding expectations. You Will Generate meetings for the sales team through the rapid response to and qualification of inbound leadsLearn to effectively identify qualified leads, articulate Klaviyos value proposition, and route opportunities properly to the direct sales teamSupport the success of your peers and provide guidance and support to new BDRsSpend time optimizing the role/process of an iBDRReflect Klaviyos values of accountability and effortBuild a plan to reach out to key prospects and have a timeline for execution.Utilize all available resources to reach out to key prospects and establish a line of communication.You:Have a BA/BS or equivalentHave a strong desire to be in technology sales and have already developed a baseline framework for how to effectively sellContinually seek improvement and are rigorous in your pursuit of itAre excited, motivated, and inspired by exceeding goalsAre thoughtful, engaging, energetic, and self-awareHave experience working in a fast-paced environmentFocus on details, are a self-starter, and are relentless but professionalHave excellent written/verbal communication skillsKlaviyo is a team of people who are crazy motivated by growth.Its what we help our customers do: grow their businesses by making it possible and easy for them to use their data to power better marketing.Its how we behave as individuals; were all deeply passionate about learning.Its how we manage our business; we have thousands of paying customers, were profitable and were growing insanely fast.And its what our culture is all about. Working at Klaviyo means youll work on things you never imagined you would; youll grow in ways you didnt consider possible and youll do the best work of your career with people who are just as motivated and talented as you are.Your curiosity has led you this far, so if this sounds like your ideal place to work, apply now!No phone calls or agency submissions, please. Candidates from the local area only, no relocation available at this time."}