{"jobID": "2826434751", "jobLocation": "Palo_Alto_CA", "jobTitle": "Video and Design Production Intern", "companyRating": "4.2", "companyInfo": {"Website": "www.thoughtspot.com", "Headquarters": "Palo Alto, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "62000", "jobDescription": "Are you looking to join one of the fastest growing software companies in the Bay Area? ThoughtSpot’s Search & AI-Driven analytics platform is disrupting the BI industry by making analytics 1000x faster and easier for non-technical business people.Description: Spend your Summer in beautiful Palo Alto, California learning and helping our fast-growing team to attain our full potential. You’ll have a hand in making ThoughtSpot’s product learning experiences fun and memorable. If you’re into graphic design and making videos, you’ll get a chance to do that, too. Our goal is to make learning ThoughtSpot exciting, fun, and fast using new types of experiences. Depending on your skills and interests, you could reimagine the product onboarding experience, develop video and written content, or create an online course. If this sounds like you, please submit your experience (resume or LinkedIn) and a sample of your work.Responsibilities:Contribute to the strategy for product onboarding and learning for our customers.Help design and develop self-paced training programs and courses, including course materials, exercises, and skills evaluations.Evaluate the experience of learning about ThoughtSpot and design it to be faster and more fun.Required Skills/Qualifications:University level student pursuing a Bachelor’s degree with a focus in Communications, Instructional Design, Information Management, or a related technical discipline.Enthusiasm for creating new learning experiences.Excellent design, media product, and written communication skills.Creativity and innovation in the audio, visual and written realms.Image and video editing tools like Adobe Photoshop and Camtasia.About ThoughtSpot At ThoughtSpot, diversity isn’t a box to check, it’s how we live our core value of “Selfless Excellence” every day. The kind of problems we solve requires diverse perspectives and the team-spirit to see those differences as possibilities rather than roadblocks. To make our dent in the universe, we seek employees with unique identities, backgrounds, and perspectives. We aim to cultivate an inclusive and respectful company culture.  We support our employees with great benefits like 100% company paid medical/dental/vision/life coverage for employees and dependents; equity in a late stage startup backed by top-tier VCs; conveniently located Palo Alto office with an onsite gym; company-provided catered lunch and dinner; and paid holidays and flexible paid time off. We hope you’ll join us in our mission.  ThoughtSpot’s Search & AI-Driven analytics platform puts the power of a thousand analysts in every business person's hands. ThoughtSpot connects with any on-premise, cloud, big data, or desktop data source and deploys 85 percent faster than legacy technologies. ThoughtSpot’s customers include Amway, Bed Bath and Beyond, Capital One, Celebrity Cruises, Chevron Federal Credit Union, De Beers, Insurethebox, and Scotiabank.  We were co-founded in 2012 by CEO Ajeet Singh and technical co-founders from Google, Microsoft, Amazon, and Oracle. Backed by investors Lightspeed Venture Partners, Khosla Ventures, General Catalyst Partners, Geodesic Capital and Capital One Growth Ventures, ThoughtSpot has raised over $160 million to date. ThoughtSpot’s mission is to enable analytics at \"human scale\" and put search and AI-driven analytics in the hands of 20 million users by 2020. For more information please visit thoughtspot.com"}