{"jobID": "2622291434", "jobLocation": "New_York_NY", "jobTitle": "Attending Physician - Psychiatric - CATCH", "companyRating": null, "companyInfo": {"Website": "www.pagny.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Overview Physician Affiliate Group of New York (PAGNY) is comprised of nearly 4,000 physicians and healthcare professionals who provide services to NYC Health + Hospitals, the largest public health system in the United States. Our practitioners are highly skilled professionals with outstanding credentials who deliver the highest level of quality healthcare to patients throughout New York City.  Serving the southern Brooklyn community since 1875, NYC Health + Hospitals/Coney Island is Brooklyn’s most modern community hospital providing patients with the highest quality care. Coney Island Hospital is care for the “whole person” and seek to heal patients, their families and its diverse community in a way that respects both individuality and culture. Responsibilities Under general direction, performs or directly supervises the provision of the professional general or specialty medical work of ordinary difficulty. Performs all related work. The physician carries out protocols identified for the addiction treatment of adolescent, adult and geriatric designated patients reflecting accepted standards of medical practice commensurate with the candidate's training and certification. These protocols will include provisions for Case Management, including diagnosis, treatment and appropriate record keeping. As well as other determined jointly to be appropriate and outlined in delineation of privileges. Responsibilities:Lead the consultation team in evaluating and treating patients with addiction disorders and related chemical dependencies.Demonstrates knowledge of the Privacy and Security rules outlined in the HIPAA guidelineSuccessfully completes the mandatory one day HIPAA Training.Adheres and conforms to all hospital and departmental guidelines, policies and procedures.Examines patients, orders or performs appropriate diagnostic tests.Formulates diagnosis, directs or preforms appropriate therapeutic treatment and counsels patients.Consults with other members of the professional staff.Gives guidance and direction to the house staff and other members of the healthcare team.Provides guidance and participates in the teaching of house staff, in staff conferences, and in research projects as directed.Advises the less experienced members of the professional medical staff.Plans, organizes and directs the operation of a major segment within a medical service or medical program in a hospital or similar health facility; or assists the Chief of Service in the planning, organizing and directing of the entire medical service or medical program.Assists in the administration and coordination of the service.Assists in the establishment and maintenance of standards of performance for physicians and other professional employees working in the service.Performs other administrative, professional, consultative duties as needed by the Chief of Service.Participates in medical research.Prepares daily work log as required.Adheres to the departmental attendance policy.All other duties as required by the department.QualificationsQualifications:Graduate of an approved medical schoolPossession of a valid license to practice in New York StateCurrent Board Certification or eligibility issued by the appropriate American Specialty BoardCompletion of approved Residency in psychiatry or Internal MedicineCompletion of fellowship in addiction Psychiatry or Addiction MedicineBoard Eligible or Board Certification in Addiction Psychiatry ORBoard Eligible or Board Certification in Addiction MedicineBuprenorphine certified or willingness to become certifiedEOE M/F/D/V"}