{"jobID": "2331514038", "jobLocation": "Los_Angeles_CA", "jobTitle": "Jr. Business Development Analyst Intern", "companyRating": "3.6", "companyInfo": {"Website": "www.noxsolutions.com", "Headquarters": "Los Angeles, CA", "Size": "Unknown", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "36000", "jobDescription": "Apply NowJr. Business Development Analyst InternLocationHeadquarters (Downtown Los Angeles)Position TypeSales InternDescriptionWe are looking for a highly energetic and focused business development analyst intern to join our team. This individual will be working closely with the VP of Sales to find and qualify leads to follow up with, help create marketing literature, and be involved in the complete product sales life cycle. ResponsibilitiesMaintain a high level of daily, weekly, and monthly prospecting activities including cold and referral callingDevelop and execute territory plans and account penetration strategiesResearch and profile accounts including mapping company's organizational structure, identifying new contacts and key business issues as well as qualifying companies for size of opportunity and active projectsApply knowledge of NOX products to show how prospects can overcome business issuesFollow up and qualify on all telephone sales inquiries and web leads within 24 hourDeliver a steady stream of qualified leads to meet quarterly quotas and fill the field sales pipelineTrack and document prospecting activities and opportunity qualification notes To qualify for this position, the following is required:Exceptional, concise and enthusiastic telephone prospecting skillsMust have high aptitude for learning and must be self-driven in a high opportunity environmentAbility to articulate and personalize the value proposition of an enterprise solution to executive level stakeholdersKnowledge of selling to Retail, Consumer Manufacturing, Travel and Media organizations a plusFocus on Enterprise sales a plusCompensationThis is a paid internship with a solid potential for career growth in a stable company. "}