{"jobID": "2801693124", "jobLocation": "Santa_Clara_CA", "jobTitle": "Machine Learning Engineering Intern, Apple News", "companyRating": null, "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": null, "jobDescription": "Machine Learning Engineering Intern, Apple News Job Number: 113901993Santa Clara Valley, California, United StatesPosted: Jun. 4, 2018Weekly Hours: 40.00 Job SummaryThe Apple News team is looking for a Machine Learning Engineering Intern who has a real passion for building scalable services to enable a phenomenal user experience that delight millions of users every single day. You will be responsible for building features and infrastructure for upcoming releases of the servicesKey Qualifications - 2+ years experience developing in Java- Knowledge of distributed systems- Knowledge of Machine Learning algorithms- Proficiency with scalable technologies: Hadoop, Cassandra, SolrCloud, and Kafka a plus- Aptitude to independently learn new technologies- Excellent oral and written English interpersonal skills DescriptionWe are seeking a high-energy and motivated Server Side Software Engineer who will play a meaningful role in the delivery of scalable services. As a member of our dynamic group, you’ll have the rare and rewarding opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day. Responsibilities include: Design, develop and deploy systems and algorithms that process data in real timeDesign and build stable and scalable production systemsDesign and develop services using technologies such as Mesos, Cassandra, SolrCloud, and KafkaCollaborate with engineering and operations teams to deliver scalable, robust, and high-performance systemsEducationBS in Computer Science or Equivalent"}