{"jobID": "2826838561", "jobLocation": "New_York_NY", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.blackboardinsurance.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2017", "Type": " Subsidiary or Business Segment", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We’re looking for a rogue Data Scientist who would push the boundaries of applying cutting-edge scientific methods and drive the development of innovative data-driven solutions within the insurance industry. But first, get to know us: We are Blackboard InsuranceSM: a group of tech-forward, seasoned insurance experts ready to make a real change in our industry. We believe there’s a better way to do commercial insurance – a way that starts with a clean slate, free from inefficiency and outdated technology. We’re building a state-of-the-art, tech-enabled platform that delivers faster underwriting and claims services, giving brokers and companies more time to focus on what’s important: building their businesses. If you’re ready to join the revolution, and work obsessively with us to make insurance better, faster, and more efficient, then come join us. We know this opportunity and environment won’t be right for everybody. But please get in touch if you have:Ph.D. in a scientific discipline (e.g., Applied Statistics/Mathematics, Computer Science, Engineering, or Physics).Scientific expertise and applied experience in Machine Learning.Foundational knowledge of Natural Language Processing.Knowledge of advanced statistical theories, methodologies, and inference tools (e.g., Bayesian inference, hierarchical models, deep learning, Gaussian processes, and causal inference).Advanced programming skills in Python and/or R (and their related data processing, Machine Learning, and visualization libraries).Practical experience in preparing data for Machine Learning.The ability to work independently, anticipate problems, and forge a path into uncharted territory.Excellent (written and oral) communication skills.As a Blackboard Data Scientist, here are some of the things you will do:Provide innovative solutions for business problems developed using rigorous scientific approaches.Use data (including third party data) to fuel automation and decisions within our company.Develop and employ AI algorithms that can find (predictive) patterns in large multi-modal data.Work in highly cross-functional and collaborative teams together with developers, designers, analysts, underwriters and claims adjusters.Take ownership of development and implementation of ideas and solutions.As a member of the Blackboard Insurance team you will enjoy the thrill of turning the world of  insurance on its head as well as:A competitive salary.401(k) employee matching program.Medical, dental, vision, and life insurance.Pre-tax commuter benefits.Unlimited vacation days.Casual dress code (jeans are welcome). We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}