{"jobID": "2608219571", "jobLocation": "Woodland_Hills_CA", "jobTitle": "Data Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.aig.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1919", "Type": " Company - Public (AIG) ", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "114000", "jobDescription": " Functional Area:RK - RiskEstimated Travel Percentage (%):Relocation Provided:American General Life Insurance CompanyEmploy predictive analytic techniques to produce Variable Annuity and Index Annuity experience studies and assumption recommendations to be provided to the business, with a focus on policyholder behavior and actuarial assumptions ensuring consistency across downstream models. This position will report directly to the VP Finance Pricing Oversight and Experience Studies for the Individual Retirement business, and will have frequent and regular interaction across the Business Unit (BU) functions supporting both the finance team and the business unit. n addition, the candidate will be responsible for the following: Understanding complex business challenges, designing scientific solutions, manipulating large data sets, using cutting edge machine learning or statistical modeling techniques and synthesizing insightsIndependently coordinate and manage staff in the production and communication of annual Variable and Index Annuity experience studies and assumption recommendationsConduct adhoc analysis as requested or as identified independently that supports periodic assumption setting and/or provides the business with greater insights into policyholder behaviorProduce and maintain proper documentation and model controls, support model review processes and internal/external auditsBuilding scalable solutions that create great business impactStrong and effective communication (both written and verbal) with colleagues and business leadersContinuously advancing your skills and those of others on the team through discussions, work assignments, training and mentoringJob Requirements: Expertise in one or more modeling/machine learning platforms as such as R, SAS, and Python Experience with additional programming languages such as C++, Java, Matlab a plus Classification methods (e.g., Neural Net, Logistic Regression, Decision Trees, Random Forest) Regression methods (e.g., Linear, Nonlinear, Boosted Regression Trees) Time-series Modelling/Forecasting Statistical Analysis (e.g., Hypothesis Testing, Experiment Design, Hierarchical Modeling, Bayesian Inference) Advanced skills in SQL  It has been and will continue to be the policy of American International Group, Inc., its subsidiaries and affiliates to be an Equal Opportunity Employer. We provide equal opportunity to all qualified individuals regardless of race, color, religion, age, gender, gender expression, national origin, veteran status, disability or any other legally protected categories.  At AIG, we believe that diversity and inclusion are critical to our future and our mission – creating a foundation for a creative workplace that leads to innovation, growth, and profitability. Through a wide variety of programs and initiatives, we invest in each employee, seeking to ensure that our people are not only respected as individuals, but also truly valued for their unique perspectivesWe consider qualified applicants with criminal histories, consistent with applicable law."}