{"jobID": "2661375866", "jobLocation": "New_York_NY", "jobTitle": "Sr iOS Developer", "companyRating": null, "companyInfo": {"Website": "www.iamplus.com", "Headquarters": "Los Angeles, CA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Beats Electronics, Apple, Google"}, "estimatedSalary": null, "jobDescription": "Sr iOS Developer i.am+ was founded by innovator and musician will.i.am. We develop products for the connected lifestyle. At i.am+, we aim to create new products that combine fashion and technology in the evolving wearables segment. Our vision is to create a community of creatives and engineers that believe through music and technology as the first step, we can usher in a powerful new era built on artificial intelligence and a voice first user experience. We currently have over 250 passionate employees and are headquartered in Los Angeles, California, with additional i.am+ offices in New York, Singapore, India, and Israel. Role Summary: As a member of the mobile team you will develop, customize and optimize iOS applications to suit our products functional and UX requirements. You will work closely with the hardware, ODM, and QA teams to take the product from concept to customer release and ensure the highest level of quality for your deliverables. The applications you will be developing will be in the music streaming, A.I. personal assistant, and home automation realms. What you will do:Design, Architect and Develop modular applications and document them as necessaryBe part of a small, autonomous team of mobile engineers building our flagship mobile clientWork independently and own major components of the app.Work with project and product managers to clearly define requirements and translate them into technical tasksPerform code reviewHelp build a world class team that can compete with the big guns in the market.Work with Bluetooth and BLE peripheral devices to support new app featuresBe hands on and in the trenches with your teamInvestigate, prototype and deliver new and innovative system solutionsEnsure the performance, quality, and responsiveness of applicationsParticipate in design reviews, API development, and documentationPerform tasks including debug, bring-up, Beta and production software developmentHelp maintain code quality, organization, and automationWhat you will need to do it:4+ years of mobile development experience working on complex and challenging products/applications.Design the architecture and develop iOS applications in Swift/Objective CSolid expertise in Data Structures, Algorithms and Object Oriented design and concepts.Good understanding or hands working knowledge on Client/Server based apps.Experience working on multimedia/music focused applications.Good working knowledge of streaming protocols, audio/video codecs, networking modules.Obsession with quality and customer experience - Attention to detail coupled with ability to think abstractlyExperience in Computer Science fundamentals: object-oriented design, data structures, algorithm design, problem solving, and complexity analysisBachelors or Masters in Computer science or related field"}