{"jobID": "2830896670", "jobLocation": "Seattle_WA", "jobTitle": "Intern", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Job ID 10979  Type Temporary Part-Time  Company Fred Hutchinson Cancer Research Center  Location US-WA-Seattle  Category Laboratory Research Sciences  Overview  Cures Start Here. At Fred Hutchinson Cancer Research Center, home to three Nobel laureates, interdisciplinary teams of world-renowned scientists seek new and innovative ways to prevent, diagnose and treat cancer, HIV/AIDS and other life-threatening diseases. Fred Hutch's pioneering work in bone marrow transplantation led to the development of immunotherapy, which harnesses the power of the immune system to treat cancer. An independent, nonprofit research institute based in Seattle, Fred Hutch houses the nation's first cancer prevention research program, as well as the clinical coordinating center of the Women's Health Initiative and the international headquarters of the HIV Vaccine Trials Network. Careers Start Here. Responsibilities The purpose of these internships are to support the research while gaining hands-on experience in basic laboratory skills. These internships may be paid or unpaid (volunteer) depending on the lab. Some Universities/Colleges will apply credit for the work - please check with your individual institutions for their requirements. Work schedules will be for 32-40 hours/per week and require a minimum of an 8-week commitment. Specific Responsibilities: An intern will be trained in a range of skills, depending on the project chosen. Internship duties are likely include many of the following: General lab assay techniques including sterile technique, handling of blood-borne pathogens, etc.Media preparationData analysis and quality controlCell purification and cell cultureFlow cytometry staining and analysisCellular assaysGeneral lab maintenance including work with laboratory equipment, reagent control, and database managementQualificationsInterns may come from a variety of educational levels, however completion of at least 1 year of a bachelor's degree program in the sciences is requiredGood communication skills and an interest in learningAbility to work in a teamGood numeracy, literacy and organizational skillsWillingness to be flexible in working hours, including working some evenings and weekends if required. Our Commitment to Diversity  We are committed to cultivating a workplace in which diverse perspectives and experiences are welcomed and respected. We are proud to be an Equal Opportunity and VEVRAA Employer. We do not discriminate on the basis of race, color, religion, creed, ancestry, national origin, sex, age, disability, marital or veteran status, sexual orientation, gender identity, political ideology, or membership in any other legally protected class. We are an Affirmative Action employer. We encourage individuals with diverse backgrounds to apply and desire priority referrals of protected veterans. If due to a disability you need assistance/and or a reasonable accommodation during the application or recruiting process, please send a request to our Employee Services Center at ********************* or by calling ************.  Options"}