{"jobID": "2633023362", "jobLocation": "Boston_MA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.savesoftinc.com", "Headquarters": "Ashburn, VA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Data Scientist!  Job Description: Seeking data scientists with expertise in the strategy, design, development, and implementation of applied data science efforts across health care, life science, and operational domains. Responsibilities:Develop innovative and fit for purpose solutions across the business.Provide expertise with advising and deploying advance statistical techniques for solving problems and advancing business opportunities.Contribute to the design, development, and implementation of data science solutions that guide decision-making and building foundational capabilities.Plan and deploy methodological standards, standardized processes, demos, and POCs for the companys highest priority business needs.Support the translation and appropriately champion advanced analytics results and capabilities to non-technical audiences.Participate in the broader data science community to stay current with data and software development.Foster an entrepreneurial mindset and collaboration with IT and business partners and internal analytics community.Minimum QualificationsMasters degree (scientific field of study) and 3+ years of relevant experience.Extensive experience in applying data mining, and advanced analytics to complex problems, along with a broad understanding of core statistical principlesExpertise with programming languages such as R,JavaScript, or others.Proven track record of rapid prototyping and development of analytics solutions, leveraging open source or commercial frameworks (e.g. TensorFlow, Hadoop, AWS).Familiarity with parallel computing and databases (e.g. SQL).Familiarity with NLP (e.g. gloVe, word2vec) is desired.Familiarity with varied data visualization techniquesStrong data analysis skills and ability to integrate information from different sources to generate testable hypotheses.Comfortable working with both technical and non-technical staff to translate concepts and algorithms into working prototypes.Able to thrive in a fast-paced environment with uncertainty. Strong communication skills. Experience presenting experimental findings to people who are not data scientists or machine learning expertsAbility to collaborate with the team and translate existing research into practical solutions and productsAbility to build and maintain relationships with various collaborators across the company, and take ownership of data science projects and proof of conceptsExperience with supervised and unsupervised ML techniques, and graph theory/network analysis would be desirable."}