{"jobID": "2554109852", "jobLocation": "Brisbane_CA", "jobTitle": "Application Engineer/Developer INTERN – Multiphase Flow (Fluid Flow in Porous Media)", "companyRating": "3.0", "companyInfo": {"Website": "www.exa.com", "Headquarters": "Burlington, MA", "Size": "201 to 500 employees", "Founded": " 1991", "Type": " Company - Public (EXA) ", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "52000", "jobDescription": "Candidates: Undergraduate/Graduate students Location: San Francisco (Brisbane), California, USA Internship: Full time on-site paid internship for 6 - 9 months Start Date: October/November 2017 Position Profile: Exa Corporation is seeking a student for an Application Engineering/Development Intern position in San Francisco, CA to support the development for Exa’s DigitalROCK (www.digitalrock.com) solution offering. This can include single-phase flow and multi-phase flow in porous media, as well as other development needs to characterize pore spaces. In this position you will work with senior technical leaders and develop your commercial job skills working on new, leading edge applied research applications in complex fluids for world-wide industrial use.  As an Application Engineer/Developer Intern for Multiphase Flow you will: Perform literature review on selected topics and summarize your findingsGain experience with commercial Computational Fluid Dynamics (CFD) software and applicationsDevelop code/scripts to automate simulation and analysis functionalityPerform simulation studies, analyze and document/present the resultsResearch specific phenomena and report findings to the Application Management team Exa is a customer driven company that requires dedicated entrepreneurial individuals with the talent and flexibility to accomplish its aggressive goals. If you are an ambitious team player with keen technical skills and a desire to continue learning new technologies, while working in a fast paced environment, this may be the place for you. Job Requirements:Enrolled in an undergraduate or graduate degree program (BS/MS/PhD) in Mechanical Engineering, Computational Fluid Dynamics/Fluid Mechanics (CFD), Aerodynamics, Physics or equivalentCourse/lab experience using Computer Aided Engineering (CAE) toolsSolid knowledge of fluid dynamics fundamentalsKnowledge of any of the following topics is a plus: multi-phase flow, porous media flow, image processingUNIX Skills, Python programming in a UNIX/Linux environmentExperience with complex graphics and analysis toolsStrong English written/verbal communication and presentation skillsMust be available for minimum 6 months full time internshipTo Apply:"}