{"jobID": "2829547736", "jobLocation": "Mountain_View_CA", "jobTitle": "Restaurant General Manager", "companyRating": "3.5", "companyInfo": {"Website": "www.chipotle.com", "Headquarters": "Denver, CO", "Size": "10000+ employees", "Founded": " 1993", "Type": " Company - Public (CMG) ", "Industry": " Restaurants, Bars & Food Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Panera Bread, Noodles & Company, Qdoba"}, "estimatedSalary": "54000", "jobDescription": " Restaurant General Manager (18014809) DescriptionWhen Chipotle first opened its doors in 1993, the idea was simple: show that food served fast didnt have to be a typical fast-food experience. More than two decades later, not much has changed: we prepare fresh ingredients by hand every day using classic cooking techniques. You wont find a single microwave or can opener in our restaurants; rather, a full team of employees passionate about cooking and serving real food while pleasing every guest that comes through our doors. Its that combination of fresh, delicious food and industry-leading customer service that keeps our guests coming back.  Chipotle is growing fast were opening a restaurant every three days and we need leaders to grow with us! Our General Managers are the captains of the ship they understand what it takes to run a strong business, hire and train great people, and help to drive our company forward.  Our mission motivates us day-in, day-out: to cultivate a better world. If that sounds like something youd like to be a part of, read more below and apply today. Whats in it for you:Medical, dental, and vision insurance & 401kQuarterly bonus programOpportunities for people-development bonusesCareer growth (need we say more?)Paid time offHoliday closuresWhat were looking for:A friendly, enthusiastic attitudeSomeone who knows the ins-and-outs of running a business (P&L; management, food safety, sales-forecasting, staffingyou get the gist)Someone who can oversee the preparation of safe and delicious food and maintain a clean, neat and organized restaurantA creative approach to marketing (fundraisers, community-engagement, etc.)Someone that loves to develop and lead a teamThe ability to deliver a great guest experienceA team player who can jump in where neededPrevious restaurant experienceThe ability to communicate in the primary language(s) of the work location Primary Location: California - Mountain View - 0801 - Mountain View-(00801) Work Location: 0801 - Mountain View-(00801) 2400 Charleston Road Mountain View 94043 "}