{"jobID": "2721976402", "jobLocation": "West_Hollywood_CA", "jobTitle": "Android Developer Intern", "companyRating": null, "companyInfo": {"Website": "www.ideatree.com", "Headquarters": "Beverly Hills, CA", "Size": "1 to 50 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " ideaTree is building the world’s largest conglomerate of mobile and internet brands by identifying and accelerating new ideas and proven internet business models thereby transferring them to new and untapped markets where it seeks to scale them into market leaders.  Our goal at ideaTree is simple: Give extraordinary ideas and teams access to the resources they need to create exceptional technology companies. Job DescriptionWe’re looking for talented Android developer interns who have a track record of creative thinking and demonstrated abilities in Android development. You will help in the building and maintaining of our Android products. Candidates will have the opportunity to work with advanced and veteran industry developers and designers in a fast paced startup environment. This in-office position will give invaluable experience to anyone looking to build from the ground up an Android app at an innovative start-up.  This position will be located at our West Hollywood office and require a full-time commitment. Skills & RequirementsGeneral knowledge of Android DevelopmentGood grasp on technical components necessary for Android app buildingFamiliar with JavaGeneral understanding of SDLC and a handful of Software design patternsEager to learn, always looking for better solutions to existing problemsAbility to work in a teamIntererst in tech start-upsWork at our West Hollywood office full-time, Monday through Friday.Preferred Experience:Must have a couple of projects you are proud to show off (Can be school projects)Working in dynamic team setting to accomplish project goalsHave an app in the Google Play Store a plusOffice setting work experience We require all our Team members to use timedoctor (time and task tracking software) on their machine for time tracking. Please read more about this and confirm that you are comfortable with it before applying for a position."}