{"jobID": "2809348660", "jobLocation": "San_Jose_CA", "jobTitle": "Registered Veterinary Technicians Needed, $500 sign-on bonus!", "companyRating": null, "companyInfo": {"Website": "www.sb-animalhospital.com", "Headquarters": "San Jose, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Private Practice / Firm", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Registered and Experienced Veterinary Technicians$500.00 sign on bonus for California Registered Veterinary Technicians!Are you an amazing, skilled veterinary nurse? Are you the \"go-to\" person at your clinic? Are you bored with doing the same thing everyday and want to learn new skills? Do you want to be challenged? South Bay Animal Hospital & Pet Resort is the place for you!South Bay Animal Hospital and Pet Resort is a beautiful, state-of-the-art veterinary practice and pet resort in the heart of Silicon Valley. We are a very progressive small animal practice and we take pride in our advanced diagnostics, equipment and services. Our case load includes everything from wellness exams to internal medicine, specialty services to emergency and critical care.We provide Emergency Services 24 hours a day, 7 days a week. We are seeking full-time, amazing veterinary nurses for several opportunities for RVTs and mid to high-level skilled technicians for our emergency department. We are also seeking day time technicians for our day practice.All candidates must be able to work some weekends and Holidays.Though we are a very large facility, it is important for us to maintain a culture of family with our clients, pets and staff. We are looking for individuals who enjoy their clients, are thorough, and will take their time to ensure client satisfaction as well as the overall well-being of each pet. We are not like other emergency hospitals! All clients and patients are seen in a timely manner, with the utmost respect, dignity and empathy. All of our team members are highly compassionate for every pet, every client and their fellow coworkers and it shows in our one of a kind service.We offer a highly competitive salary, benefits package, bonuses, alternative scheduling and continuing education.Family-work balance is important to us! South Bay Animal Hospital & Pet Resort participates in alternative work scheduling providing 4 shifts of 10 hours and three days off a week to full time employees!!"}