{"jobID": "2705069461", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist, Optimization", "companyRating": "4.3", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "141000", "jobDescription": "About Uber We’re changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now we’re a part of the logistical fabric of more than 600 cities around the world. Whether it’s a ride, a sandwich, or a package, we use technology to give people what they want, when they want it.  For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer.  And that’s just what we’re doing today. We’re thinking about the future, too. With teams working on autonomous trucking and self-driving cars, we’re in for the long haul. We’re reimagining how people and things move from one place to the next. About the RoleWe are looking for an entry/mid level data scientist to join our cross marketing data science team to apply statistical, machine learning, econometrics, time-series and mathematical optimization methods to solve interesting business problems in the field marketing analytics and finance tech. You will be working with a highly cross functional team providing insights to inform decisions on Uber’s long/short term growth and efficiency. This is a unique opportunity to apply your skills and have a direct impact on global business.What You’ll DoBuild production grade models to optimize marketing performance by utilizing advanced statistical modeling, machine learning and operations research techniques.Leverage models to provide insights on budget planning, allocation and forecasting across different levers optimize key business metrics globally.Leverage large scale user level ML models to provide insights on digital media events.Leverage time-series models to provide insight on offline media events.Collaborate with marketing leadership, design, product and engineering teams to create internal products.Participate in project planning/prioritization meetings, stakeholder meeting, data prioritization meeting, etc.What You’ll NeedMinimum 1 year of experience as a data scientist at a company with global operationsExpertise with R or PythonExperience with machine learning, time-series analysis, mathematical optimizationAdvanced SQL skills - comfortable working with very large data setsExperience with big data using technologies and pipelinesPrevious experience in advertising tech is a plusGreat communication skills, organized, able to multitask and be a team playerBalance attention to detail with swift executionHunger and drive to learn complex topicsEnthusiasm about Uber"}