{"jobID": "2819153321", "jobLocation": "Seattle_WA", "jobTitle": "Data Scientist, Infrastructure Automation", "companyRating": "3.2", "companyInfo": {"Website": "www.lab126.com", "Headquarters": "Sunnyvale, CA", "Size": "1001 to 5000 employees", "Founded": " 2004", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "118000", "jobDescription": " Job DescriptionThe ideal candidate is a motivated self-starter with strong business acumen to join the team and build analytics driving actionable insights to accelerate the growth of the business. The Business Intelligence Engineer will partner with Senior leaders, product managers, and other internal stakeholders to build metrics.This role requires an individual with excellent analytical abilities, deep knowledge of business intelligence solutions as well as a passion for problem-solving. Ideally, you are comfortable with ambiguity and accessing and working with data from multiple sources. You will analyze large amounts of data, discover and solve real world problems, and build metrics and business cases around key performance of this program. You will be responsible for understanding the health of the service and business, and drive necessary changes as needed. This is a perfect position for someone who loves data and knows how to work fast and smart.Some of the key responsibilities for this position include:- Propose and implement business metrics for senior management reviews- Work with business intelligence and data engineers to design and develop data infrastructure to support business growth- Enable effective decision making by retrieving and aggregating data from multiple sources and compiling it into a digestible and actionable format- Perform deep-dives to find the root causes behind variances of key parameters over a given time-period- Develop intelligent, insightful self-reporting tools-Manage the data warehouse Key responsibilities: • Work closely with management, software engineering leaders, and business teams to plan catalog data improvements so as to maximize customer improvement impact. • Triage many possible courses of action in a high-ambiguity environment, making use of both quantitative analysis and business judgment. • Collaborate with software engineering teams to integrate experimental capabilities into large-scale, highly complex Amazon production systems. • Report results in a manner which is both statistically rigorous and compellingly relevant. • Assist in recruiting, mentoring, developing, and training other Research Scientists as well as other technical roles when needed.Basic Qualifications Bachelor's degree in math, finance, engineering, statistics, or related discipline is required3+ years professional experience in web analytics, business analysis, or comparable analytics position.Experience in designing and implementing custom reporting systems by managing or guiding technical teams with tools such as Tableau or CognosExperience with SQL/SASDemonstrated experience managing and prioritizing workload and roadmapsPreferred QualificationsPreferred Qualifications:Familiarity with AWS solutions such as EC2, DynamoDB, S3, and Redshift.Master's degree in Computer Science, Engineering, Math, Finance, Statistics or a related discipline.Advanced knowledge and expertise with SQL, Linux, Oracle and OLAP and data warehousing concepts.Knowledge and direct experience using business intelligence reporting tools. (OBIEE, Business Objects, Cognos, Tableau, MicroStrategy, SSAS Cubes, etc.).Knowledge of scripting for automation (e.g. Python, Perl, Ruby)Solid written and verbal communication skills"}