{"jobID": "2831374194", "jobLocation": "Bellevue_WA", "jobTitle": "Business Analyst Intern", "companyRating": "3.3", "companyInfo": {"Website": "www.limeade.com", "Headquarters": "Bellevue, WA", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": "Share PostFacebookTwitterLinkedinAbout us: Limeade is an engagement company that inspires employee commitment and elevates company culture. Our mission is to improve well-being in the world. We are looking for a Business Analyst intern to help us do exactly that.  At Limeade, we take a whole person, whole company and whole ecosystem approach to measurably improve employee well-being and performance. But we go much further than that, helping our customers build cultures that support well-being that move the needle on their business goals. Our engagement platform is immersive and holistic – as it must be to help solve the bigger well-being and engagement problems facing today’s businesses. Recognized for its own award-winning culture, Limeade serves over 100 employers and top global brands.  We’re committed to creating a mission-driven, positive culture of improvement made up of the best and brightest people in the business. And we’ve got the awards to back it up: Puget Sound Business Journal ranked us #1 Best Workplace in Washington, and Seattle Business ranked us one of the top three Best Companies to Work for in Washington State. We’re one of the fastest-growing companies in North America (Deloitte’s Technology Fast 500™), and Fortune magazine recognized us as a Best Workplace for Women. Learn more at www.limeade.com About the role: Limeade is looking for a Business Analyst intern to join our Business Insights team. As a business Analyst intern you’ll work with our Business Insights Professional Services team to help answer critical questions for our customers like “What can we do to drive program participation?” or “What are our customer’s most popular challenges?” You’ll help take our findings from data analysis and translate it into meaningful stories that resonate with customers. You’ll also help build Limeade’s documentation of internal tools so that the end users of the tools have a comprehensive reference of features and functionality. We are looking for you if:Data excites youYou have a knack for taking complex concepts and data sets and making them simple to understand.You’re quick with numbers and have an intuitive sense for what they meanYou’re a clear communicator, and are comfortable talking at all levels of the technical spectrumYou’re constantly looking for ways to do things betterResponsibilities:Work with internal customers to document questions and requirements for data analystsWork with data analysts to turn analysis into stories that resonateDocument Business Insights internal toolsRequirements:Ability to demonstrate our values in an on-going and consistent wayCurrently studying a technical discipline, graduating within 18 months.Presenting data analysis results and data-driven insights to business audiences.Familiarity with database modeling and data warehousing principles with a working knowledge of SQL.Familiarity with a data visualization tool such as Tableau or Power BIExperience with technical writing or documentation a big plus. Limeade provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, Limeade will provide reasonable accommodations for qualified individuals with disabilities.  Apply"}