{"jobID": "2745598373", "jobLocation": "Santa_Clara_CA", "jobTitle": "Senior Analog Design Engineer - CMOS, Mixed-Signal", "companyRating": "3.7", "companyInfo": {"Website": "www.marvell.com", "Headquarters": "Santa Clara, CA", "Size": "1001 to 5000 employees", "Founded": " 1995", "Type": " Company - Public (MRVL) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "121000", "jobDescription": "Become a member of a world-class analog design team in providing high performance analog and mixed mode circuits for leading data communications and networking products. Designers have opportunities to design high performance transceivers and other critical analog functions, including analog-to-digital converters (ADC),digital-to-analog converters (DAC),phase-Locked Loop (PLL),filter, adaptive equalizers, finite-impulse response (FIR) filter, and decision-feedback equalizer (DFE).serializer-deserializer (Serdes), clock and data recovery (CDR) circuits, and phase-locked loop (PLL) or other timing circuits. Team members participate in circuit architecture, circuit implementation, design review, layout, and silicon validation.  Qualified candidates have design experience in one or more area of high performance CMOS circuits in the following: ADC, including but not limited to flash, SAR, pipeline, cyclic, sigma delta, and other techniques.DAC for driving high precision output, such a 50ohm line driver.Filters and/or equalization, including but not limited to continuous time filter, discrete-time filters, FIR filter, and DFE.Serdes and timing circuits such as PLL, CDR, TX and RX functions.Other analog functions is a plus, such as bandgap, regulator, crystal oscillator, etc.Knowledge in signal processing and communication theories is a plus. #LI-KB1• MSEE with emphasis in CMOS analog/mixed-signal integrated circuit designPh.D. with research emphasis in CMOS analog/mixed-signal integrated circuit design and implementation.Familiar with the use of various CAD tools for design, physical layout, and verification"}