{"jobID": "2803081032", "jobLocation": "New_York_NY", "jobTitle": "Head of Design, WeWork Labs", "companyRating": null, "companyInfo": {"Website": "www.wework.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " WeWork is the platform for creators. We provide beautiful workspace, an inspiring community, and meaningful business services to tens of thousands of members around the globe. Our mission is to create a world where people work to make a life, not just a living. WeWork members are creators who run the gamut from entrepreneurs, freelancers, and startups, to artists, small businesses and even divisions of large corporations.  WeWork Labs mission is to become a long-term partner and friend to early-stage startups. We take an innovative, personal approach to helping startups grow and succeed, making the entire processfrom big idea to big impactmuch more human. Beyond providing workspace for startups, we provide programming and care to foster an engaged and growing community of creators.  The Role WeWork Labs is looking for a passionate, talented and experienced Communications Designer to join our team. The ideal candidate is versatile, adventurous, and a hustler who is enthusiastic about building new brands and products, designing effective and clever communication systems, and solving problems through visual design. You will take on projects that span across the entire WeWork Labs member experience, including branding, marketing, advertising, and product design, in both print and digital media.  This role will lead creative and visual development of the Labs product offering and brand experience, and will be responsible for founding the WeWork Labs design team. Initial focus will be working as the principal designer in a very hands-on environment with Labs teammates across many non-design disciplines. You will represent a thorough knowledge of design principles, and help the team understand how to utilize design to best reach our business objectives.  In time, this role will grow to encompass the development of a full design team as the business grows.  We thrive in our work-hard, play-hard culture. We get things done. Then we have funand lots of it. If this describes where you want to work, youll fit right into our team.Responsibilities:"}