{"jobID": "2671355934", "jobLocation": "Berkeley_CA", "jobTitle": "Job Announcement: Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.ebclc.org", "Headquarters": "Berkeley, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job Announcement: Data Scientist  Friday, February 23, 2018EBCLC is a non-profit legal services organization and the community-based clinical program for Berkeley Law School, committed to increasing justice through education and advocacy and building a culturally diverse workplace, centered on equity. With over 60 staff, 150 law students, and a $6 million annual budget, EBCLC is the largest provider of free legal advocacy in Alameda County, providing multimodal, collaborative, and holistic legal services to over 5,000 clients yearly and engaging in legislative and policy advocacy at the local and state level.  The Data Scientist is a new position created specifically to bring critical expertise to EBCLC to improve and institutionalize systems for program assessment and to create replicable models for other civil legal aid nonprofits and law school clinical programs. The Data Scientist will work closely with the Executive Management Team, consisting of the Executive, Deputy, Clinical, Finance and Administration, and Development and Communication Directors to implement processes for evaluating EBCLC’s approach to legal services and training, integrate data from internal and external sources, design and implement qualitative and quantitative studies, and facilitate the use of data to drive improvement. We are looking for a sophisticated, detail-minded individual with a passion for using data to understand and improve our core services, and help us better communicate who we are and what we do to technical and non-technical audiences.Primary Responsibilities: Serve as project manager to work with the Executive Management Team and program staff to develop, implement and manage a framework to consistently and rigorously monitor, evaluate and adapt EBCLC’s key program approaches of: providing client-centered, community-driven and culturally-responsive services in eight substantive legal programs;providing effective training for law and social work students to become skilled, knowledgeable and compassionate advocates;engaging in statewide and local systemic policy advocacy.Establish policies, protocols and practices for data collection, analysis and reporting by working with the Executive Management Team, Contracts Officer and program staff to make gathering and analyzing data more efficient and effectiveIdentify and improve systems and technology that support more efficient data collection within EBCLCTrack, analyze and communicate outcomes, indicators and/or benchmarks that demonstrate EBCLC’s progress against goals to staff, board, supporters, the broader community and other stakeholdersProvide clear and useful reports, case studies and graphics (such as dashboards) for staff, board and other stakeholdersOther tasks as needed to achieve the goals of this key area of responsibility or as assigned by SupervisorMinimum Qualifications:BA in fields related to research and evaluation (e.g. sociology, anthropology, psychology, public administration, public health, economics or other related disciplines)Master’s Degree is these fields or commensurate years of professional experience strongly preferredMinimum three (3) years of professional experience in research, evaluation or related capacity (public sector or community/non-profit setting preferred)Highly computer proficient; demonstrated knowledge of database systems and CRMsFamiliarity with a variety of qualitative, quantitative and mixed-method research techniques; specialists in one or more of these areas encouragedExperience manipulating and analyzing data in Excel and using statistical software (e.g. R, Stata, SAS, SPSS, etc.); knowledge of GIS and mapping software a bonusDemonstrated experience in designing, implementing and analyzing surveys; ability to use Census and other publically-available survey datasetsAbility to interpret and share data findings with both technical and non-technical audiences, including strong data visualization skillsAccuracy, attention to detail, and organizational skills a mustDemonstrated ability to work autonomously as well as part of a teamAbility to employ a racial, economic and social justice framework to evaluationFamiliarity with the civil legal services sector and/or commitment to social justice highly desirable Salary and Benefits:Starting salary range for this full-time exempt position is $74,000 – $88,000 based on number of years of prior relevant experience, as dictated by EBCLC’s salary scale.  Benefits include fully paid health insurance (medical, dental, and vision) for employees and their dependents, life and disability insurance, and generous paid leave (vacation, sick, and holidays); EBCLC also offers flexible spending accounts for qualified health, dependent care, and commute expenditures; and retirement options.  Professional development support includes membership in the relevant local, statewide and/or national associations, attendance at relevant conferences, as determined by EBCLC’s professional development policy and budget.Application Procedures:Interested applicants should submit application materials by email to jobs@ebclc.org (include “Data Scientist” in the subject line). Application materials should include a cover letter, resume, work samples, and names/contact information for three professional references. The position is open until filled, with applications reviewed and interviews scheduled on a rolling basis.  EBCLC is strongly committed to advancing justice through education and advocacy, and the need to transform legal service and legal education. Please take time to review EBCLC’s mission, vision, programs, and website, and ensure that your cover letter reflects how your background, experience, and expertise have prepared you to be successful in performing the responsibilities of the position. Additionally, EBCLC is committed to building a culturally diverse workplace centered on equity and providing an inclusive, welcoming, and culturally responsive environment for all members of our staff, volunteers, subcontractors, vendors, and clients. To achieve this goal, EBCLC works actively to improve our office climate, systems and structures, communications and community engagement to create an inclusive and respectful workplace that acknowledges and values differences.  Please address in your cover letter how your personal background or experiences, professional or otherwise, have prepared you to contribute to our commitment to cultural responsiveness and diversity amongst our staff.  We strongly encourage individuals from traditionally underrepresented communities to apply. EBCLC does not discriminate on the basis of race, color, religious creed, sex, gender, gender expression, gender identity, age, national origin, ancestry, disability, marital status, sexual orientation, military status, prior contact with the criminal justice system, or any other basis prohibited by law. Tags: data scientistEBCLC dataEBCLC jobsShare This:AddThis Sharing ButtonsShare to FacebookFacebookShare to TwitterTwitterShare to PrintPrintShare to EmailEmailShare to MoreAddthis"}