{"jobID": "2704995539", "jobLocation": "Watertown_MA", "jobTitle": "EEC certified Toddler/Preschooler Director in Cambridge", "companyRating": null, "companyInfo": {"Website": "www.efgboston.org", "Headquarters": "Watertown, MA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " School / School District", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "EFGB is a French Immersion school (Toddler to 2nd grade) with two campuses located in Watertown and Cambridge. Our school aims to reinforces a child’s sense of belonging to a Francophone community and helps him/her build a truly bilingual identity. Our multicultural student body and staff is unique and provides a diverse and fun environment to work in. We are looking to hire our new creative and motivated Director to help us implement an enriching and stimulating curriculum. Our school has a team based approach where teachers are mutually supportive and collaborate closely in developing and executing curriculum planning, social studies, Mathematics, Arts and Crafts and/or project based learning. The school offers our children high quality programming based on requirements and standards set by the French National Education guidelines and enhanced by Early Education Curriculum (EEC) programming. Our lessons are designed to promote the physical, intellectual and emotional development and well-being of each child. Students will acquire knowledge and skills while developing reasoning and critical thinking abilities.We offer competitive salary, benefits and professional training.We are seeking EEC certified Toddler/Preschooler Director. Candidates should have prior experience working in a classroom setting and provide 2 references. Speaking French is absolutly not required, our team is mixed with anglophone and francophone. Our school is growing rapidly, apply now! More information about who we are : http://www.efgboston.org"}