{"jobID": "2822890399", "jobLocation": "New_York_NY", "jobTitle": "Sales Development Representative", "companyRating": null, "companyInfo": {"Website": "www.forter.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Sales Development Representative - NY  Job Description  We are looking for a talented and self-driven Sales Development Representative (SDR) that thrives in a dynamic sales cycle environment to join our growing NY-based Forter team. The successful candidate will play a fundamental role in achieving our ambitious customer acquisition and revenue growth objectives. You must be comfortable making dozens of calls per day, generating interest, and qualifying prospects.  Stuff you'll be doing: Source new sales opportunities through inbound lead follow-up and outbound proactive outreach and work autonomously to explore data resources (websites, databases, online research)Understand customer needs and requirementsRoute qualified opportunities to the appropriate sales executives for further development and closureProvide insight into an organization’s structure, with ability to successfully identify the decision maker. Research accounts, identify key players and generate interestTeam with channel partners to build pipeline and close dealsPerform effective online demos to prospects Stuff you’ll need: 1-3 years’ experience with sales development within the technology spaceBachelor’s degree, preferably in a business-related programA good technical aptitude and genuinely interesting in technology and e-commerce solutionsExperience in a fast-paced startup, with the ability to work in a rapidly expanding and changing environmentExcellent written and verbal communication skills to be effective in positioning a clear, concise, and well-understood message If you’re up to the challenge, please send your CV with the title of the position you’re applying for to: join_us@forter.com.  Benefits:  Our compensation package includes: A competitive salary, a comprehensive and generous health, dental and vision insurance, and stock options. But most importantly - an excellence-driven working environment who is both inspiring and joyous.  Forter is an Equal Employment Opportunity employer that will consider all qualified applicants, regardless of race, color, religion, gender, sexual orientation, marital status, gender identity or expression, national origin, genetics, age, disability status, protected veteran status, or any other characteristic protected by applicable law."}