{"jobID": "2398616453", "jobLocation": "Mountain_View_CA", "jobTitle": "Software Developer - Intern or Fellow", "companyRating": "4.6", "companyInfo": {"Website": "www.khanacademy.org", "Headquarters": "Mountain View, CA", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Nonprofit Organization", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "65000", "jobDescription": "Khan Academy is looking for talented software developers to create a free virtual classroom for the world. Join us on our mission to provide a free world-class education for anyone, anywhere.We’re fun, quirky people at heart who believe that shipping beats perfection. We have built a talented development team with engineers from a variety of backgrounds. Our team includes industry leaders from Google, Apple, Facebook, Microsoft, Pixar, Fog Creek, and tiny startups, as well as people with non-traditional backgrounds who didn’t graduate from college. Together, we’re a small, talented team that is deeply invested in your future. We believe that no organization will be as invested in developing you as a professional.We are largely accepting applications for Summer 2017, but we will gladly review applications for Fall and Winter 2017 as well. Current students will be evaluated for our internship while post-grads will be evaluated for our fellowship. Our developers tackle world-changing challenges that have never been solved before. Recent examples include:Building innovative new ways to teach computer scienceDesigning a machine learning model to optimize a student’s learning pathRunning A/B tests to increase learning and affect real lives (not just increase page views)Reimagining ways for students to learn together onlineScaling all the infrastructure needed to handle millions of usersEvery day, learners of all ages rely on Khan Academy to learn. Khan Academy has been featured broadly, including in 60 Minutes, Wired, The Economist and of course, The Colbert Report. We use:Python, JavaScript (jQuery, Backbone), Google App Engine, Hadoop/Hive, Objective-C, and anything else that best solves the problem at handWe're not religious about using a specific technology. We're religious about providing an incredible experience for Khan Academy learnersYou need: A passion for software and engaging learning experiences, as well as desire to change the worldAn ability to chew through difficult software problems. You leave a trail of successful software projects in your wakeGreat intuition for how users like to learn. You have the motivation and courage to tackle any new subject you put your mind to, and not let go until you've mastered it12-24 weeks of availabilityYou don't need: Lisp expertise. Actually, we don't require experience in any particular technology, but you should have an impressive collection of cool projects. We’re confident that you’ll be able to learn whatever languages and frameworks we throw at you (or, more likely, you throw at us).We offer the following benefits: We may be a non-profit, but we reward our talented team well!Competitive salaries, housing stipends, and all travel coveredDelicious catered lunch daily plus tons of snacks and beveragesThe opportunity to work on high-impact software that's already defining the future of educationGreat location: walking distance to Caltrain and downtown Mountain ViewAwesome team events and weekly board game nightsThe ability to improve real livesA fun, high-caliber team that trusts you and gives you the freedom to be brilliant27 inch Mac monitors"}