{"jobID": "2756378311", "jobLocation": "Santa_Clara_CA", "jobTitle": "Senior Deep Learning Software Engineer, Autonomous Driving Perception", "companyRating": "4.3", "companyInfo": {"Website": "www.nvidia.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1993", "Type": " Company - Public (NVDA) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "160000", "jobDescription": " We are now looking for a Senior Deep Learning Software Engineer for Autonomous Driving Perception:NVIDIA is hiring senior engineers to build industry-leading perception models for self-driving cars. You'll develop deep learning models that incorporate camera, RADAR, LIDAR, and other sensor data to help cars understand and safely navigate the world around them. Whatyouwillbedoing:Design and optimize new machine learning models from the ground up - going from concept to data gathering through development, analysis, and deployment.Develop next-generation versions of core perception modules, improving accuracy, run-time performance, and breadth of features.Work on the bridging the gap between the latest in deep learning research and its application in real world productsCollaborate with other teams working on research, infrastructure, safety analysis, and in-car deployment.Build tools and systems to automate the training and analysis of deep learning models.Whatweneedtosee:MS or PhD in Computer Science, Computer Engineering or related field. You should have 6+ years of meaningful / relevant industry or research experience.Strong programming and software engineering skills, ideally with Python and/or C++.Excellent understanding of deep learning technologies and research. Experience with computer vision is ideal, but a background in speech, structured \\\"big data,\\\" or NLP can be transferrable too.Real-world experience building and deploying machine learning models. Experience developing and deploying systems based on deep learning is a big plus.Highly motivated with excellent verbal and written communication skills.Ability to work successfully with multi-functional teams, principles and architects. Project leadership skills and experience. GPU computing is the most productive and pervasive platform for deep learning and AI. It begins with the most advanced GPUs and the systems and software we build on top of them. We integrate and optimize every deep learning framework. We work with the major systems companies and every major cloud service provider to make GPUs available in data centers and in the cloud and we create computers and software to bring AI to edge devices, such as self-driving cars and autonomous robots  With deep learning, we can teach AI to do almost anything. New internet services, like Google Assistant, have learned speech from sound and provide a more natural way to access information. Self-driving cars use deep learning to recognize the space the car inhabits, the lanes in which it drives, and the objects to avoid. In healthcare, neural networks trained with millions of medical images can find clues in MRIs that until now could only be found through invasive biopsies. These are just a few examples. AI will spur a wave of social progress unmatched since the industrial revolution.  Nvidia is widely considered to be one of the technology world’s most desirable employers. We have some of the most brilliant and talented people in the world working for us. Are you creative and autonomous? Do you love a challenge? If so, we want to hear from you. Come, join our Deep Learning Software team and help us build the real-time, cost-effective computing platform driving our success in the dynamic and quickly growing field of Autonomous Driving.  ​​NVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression , sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.#deeplearning"}