{"jobID": "2827452339", "jobLocation": "Seattle_WA", "jobTitle": "GIS Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.critigen.com", "Headquarters": "Denver, CO", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": " Critigen is looking for GIS Data Analysts to work in a team environment supporting high profile client projects. This role will focus on GIS production data quality assurance and be responsible for comparative data analysis and trend analysis. The ideal candidate will have GIS experience with knowledge of Open Street Map, and will possess excellent problem solving abilities, have a strong attention to detail, and be comfortable working in a collaborative team environment. The ability to communicate effectively across the organization and an eagerness to learn and grow your career as the company grows is key to team member success at Critigen.  This is a great opportunity for someone looking to rapidly evolve their career in the geospatial field. Critigen team members enjoy outstanding benefits including: competitive salary and PTO, medical/dental/life benefits, and on the job development opportunities. Key QualificationsBS or equivalent, preferably in GIS, Geography, or Computer ScienceCritical thinker with the ability to solve problems independently, demonstrate innovative approachExcellent communication skills, ability to summarize findings and provide recommendations for product specification and training improvement3+ years of experience in GIS fieldProficiency with GIS editing tools and data digitizationSpatial data research & analysis with the focus on base map data (roadways, networks, building outlines, points of interest)Familiar with desktop GIS software (ArcGIS, QGIS)Familiar with databases and frameworks (PostgreSQL, Hadoop)Scripting skills for task automation (Python, UNIX)Keen eye for detail, tenacity and drive to process large amounts of data, to see the trends emerge Critigen is an Equal Opportunity Employer, Female/Minority/Veterans/Disabled/Sexual Orientation/Gender Identity."}