{"jobID": "2809041645", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.konghq.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About Kong Inc:We are the company behind Kong, the most widely adopted open-source API gateway. We have a world-class Enterprise platform and our mission is to facilitate a new revolution in software production by serving as the backbone of the distribution and consumption of data and services through APIs.Our vision is to enable developers to build more and manage less. We've built one of the most popular pieces of open-source software in the world and in the process grown an extremely engaged and active community. We're looking for a few great people who want to be part of a fun, highly-collaborative team.Our ideal candidate is someone who will thrive in our environment of really smart, driven people, who get to work with many new, leading-edge technologies that solve large customer challenges. We're looking for people who want to make a huge impact and have real ownership for the work they do. This opportunity is ideal for someone who wants to be in on the ground floor of our fully-funded and very special startup.As a Data Scientist, you will be responsible for R&D; features which automate finding insights for our users by taking advantage of Kongs crucial place in the networks stack, so that they can maximally leverage their data. The models we build use a mix of raw statistics, data science and machine learning; we are pragmatic and will use the simplest approach that works. This position is ideal for someone who is passionate about ML/DL algorithms and modeling. Requirements MS or PhD in Computer Science, Statistics, Applied Mathematics, Operations Research or related quantitative field.Has at least 3 years of experience, using machine learning or data science modeling to help build product features.Experience with fundamental machine learning algorithms like linear and logistic regression and the strong foundation in Bayesian statistics, inferential statistics, probability theory, distributions, etc.Experience with widely used algorithms like decision trees, random forest, SVM, KNN, k-means, SOM, CNN, RNN and ART etc.Familiar with optimization algorithms (stochastic & deterministics, convex & non-convex) Bonus Experience with machine learning at scale.Familiar with time series databases (OpenTSDB, Graphite, Prometheus, Grafana)"}