{"jobID": "2663061266", "jobLocation": "Seattle_WA", "jobTitle": "principal data scientist, data & measurement science, Customer Analytics", "companyRating": "3.8", "companyInfo": {"Website": "www.starbucks.com", "Headquarters": "Seattle, WA", "Size": "10000+ employees", "Founded": " 1971", "Type": " Company - Public (SBUX) ", "Industry": " Restaurants, Bars & Food Services", "Revenue": " $10+ billion (USD) per year", "Competitors": " Dunkin' Brands, McDonald's"}, "estimatedSalary": "172000", "jobDescription": "Job Summary and Mission This job contributes to Starbucks success by guiding business decisions through utilizing data analysis and consulting that results in predicting outcomes, understanding complex data relationships, and developing a quantitative return on investment. This position partners on a cross-functional team of data scientists, statisticians, and business analysts supporting strategic initiatives utilizing the latest in computing technologies and operating across customer transactions and data elements to unlock the opportunities to support our global business. Models and acts in accordance with Starbucks guiding principles. Summary of Key Responsibilities Responsibilities and essential job functions include but are not limited to the following: Extracts data from various databases; performs exploratory data analysis, cleanses, massages, and aggregates data - Employs scaling & automation to data preparation techniques Drives new methods to analyze structured and unstructured data; introduces novel visualization and presentation paradigms to communicate discoveries Introduces incremental improvements to data analysis, visualization, and presentation techniques to communicate discoveries Researches relevant emerging empirical methods and quantitative tools Possesses exceptional business acumen; identifies and understands business problems from strategy through operational impacts Identifies business problems to solve that have the most value to the company Consummate story-teller; expert global audience communicator (corporate wide) Drives to close the gap between insights and business operationalization, via, e.g., in-database and real-time analytics Initiates and owns major company-wide analytic initiatives from a methodology perspective Establishes Starbucks analytic practices across the corporation Mentors data scientists in algorithm development and corporate and industry-wide analytics evangelismSummary of ExperienceYears within data analysis field or discipline Minimum 10 Year’s Experience Basic QualificationsEducation: MS (PhD preferred) with concentration in quantitative discipline - Stats, Math, Comp Sci, Engineering, Econ, Quantitative Social Science or similar discipline PhD in quantitative discipline, preferred Required Knowledge, Skills and AbilitiesAbility to apply knowledge of multidisciplinary business principles and practices to achieve successful outcomes in cross-functional projects and activities Mastery and comprehensive proficiency across most Modeling & Machine Learning Techniques (regression, tree models, survival analysis, cluster analysis, forecasting, anomaly detection, association rules, etc.) Mastery and comprehensive proficiency across most Data ETL (Teradata, Oracle, SQL, Python, Java, Ruby, Pig) Mastery and comprehensive proficiency across most Analytic Languages (R, SAS, SPSS, Stata) Big data processing techniques, preferred Retail, customer loyalty, and eCommerce experience, preferred Core CompetenciesPuts the Customer First: Has a relentless focus on the customer. Understands what the customer wants and how to best deliver the experience. Works Well with Others: Listens and communicates well with others within and outside of Starbucks. Creates a team environment that is positive and productive. Leads Courageously: Takes personal responsibility to do the right thing, and persists in times of challenge or uncertainty. Adapts quickly to change and makes timely, thoughtful decisions. Develops Continuously: Continuously seek opportunities to improve self and others. Leads with trust, honesty and commitment to hire, coach and develop partners to achieve their potential. Achieves Results: Understands what drives overall business success and is accountable to prioritize and deliver quality results. Demonstrates knowledge of core products and processes to get results. Anticipates obstacles and takes action to prevent or minimize their impact. Starbucks and its brands are an equal opportunity employer of all qualified individuals, including minorities, women, veterans & individuals with disabilities. Starbucks will consider for employment qualified applicants with criminal histories in a manner consistent with all federal, state, and local ordinances."}