{"jobID": "2627213282", "jobLocation": "Boston_MA", "jobTitle": "Area Director", "companyRating": null, "companyInfo": {"Website": "www.atricure.com", "Headquarters": "Mason, OH", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Public (ATRC) ", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Medtronic, St. Jude Medical, Boston Scientific"}, "estimatedSalary": null, "jobDescription": "AtriCure, Inc. is a medical device company and a leader in developing, manufacturing and selling innovative cardiac surgical ablation systems designed to create precise lesions in cardiac tissue for the treatment of atrial fibrillation, or AF, and systems for the exclusion of the left atrial appendage. Cardiothoracic surgeons are adopting AtriCure’s ablation products for the treatment of AF during concomitant open-heart surgical procedures and sole-therapy minimally invasive procedures. AF affects more than 33 million people worldwide and predisposes them to a five-fold increased risk of stroke. The FDA has not cleared or approved certain AtriCure products for the treatment of AF or a reduction in the risk of stroke. POSITION SUMMARY: The Area Director will coordinate and direct the actions of the Regional Sales Managers, Minimally Invasive Managers, and Ablation Specialists in the performance of their duties. Concentrates on data collection and analysis of sales-related information and statistics in order to accurately and effectively plan retail interactions. Creates proactive action plans that increase brand awareness of AtriCure’s products in their assigned area. Manages and directs Regional Sales Managers and Ablation Specialists in a manner that creates strong lines of communication from the field to senior management. ROLES AND RESPONSIBILITIES: · Drives activities of Regional Sales Managers, Minimally Invasive Managers, and Ablation Specialists in a manner that increases brand awareness, product presence and revenue generation for all AtriCure’s products  · Directs sales forecasting activities and sets performance goals accordingly  · Coordinates activities with Marketing that target specific areas where increased traffic is anticipated  · Monitors sales data on a continual basis (weekly) and makes changes as needed  · Communicates regularly with all direct reports for updates on their activities  · Disseminates information to the field ensuring all product knowledge, initiatives and trends are up-to-date  · Develop and nurture strategic account and clinical relationships within area, as well as support and monitor key relationships of direct reports  · Build and maintain a comprehensive needs assessment and business plan for each strategic account in order to deliver superior value to the customer and accelerated, profitable growth for AtriCure  · Perform other related tasks such as representation at national and regional events, support of corporate initiatives, etc. BASIC QUALIFICATIONS:Bachelor’s degreeMust have ten (10) years of successful medical device sales and/or sales management experienceComprehensive understanding of what business drivers promote growth, profitability, and cash flowMust have the ability to identify obstacles that could impede new sales and defining a solution which results in the creation of an idea business approach and outcomeMust be able to think strategically, specifically to long term AtriCure business plans, goals and needs for the areaMust be able to travel as necessaryPREFERRED QUALIFICATIONS:MBA degreeESSENTIAL JOB FUNCTIONS (Physical or mental qualification requirement – i.e. walk, sit, stand, bend, push/pull, lift (how much), travel %; O=Occasional, R=Regularly, N=Never):Regularly walk, sit, and standOccasionally bend and push/pullRegularly lift up to 25 pounds, occasionally lift over 25 pounds25% travel possibilityPosition dependent upon candidate passing pre-employment physical/drug screen"}