{"jobID": "2825589167", "jobLocation": "New_York_NY", "jobTitle": "Medical Assistant Urology + Spanish +Russian", "companyRating": null, "companyInfo": {"Website": "http://www.newyorkurologyspecialists.com/", "Size": "1 to 50 Employees", "Founded": "2013", "Type": "Company - Private", "Industry": "Health Care Services & Hospitals", "Description": "We are pleased to have the trust of thousands of patients and doctors who refer other patients, their friends and relatives for second and third opinions to New York Urology Specialists. We treat men and women with complex urological care needs. Under the clinical and scientific leadership of Dr. Alex Shteynshlyuger, New York Urology Specialists offer individualized approach to each patient that is rarely found in modern healthcare. When it comes to urological care, we are proud to offer the most effective treatment options available today. "}, "estimatedSalary": "36000", "jobDescription": "Medical Assistant / Front Office / Call Center Coordinator and Medical Assistant for Medical Office -- Urology / Surgery Experience is Helpful - Manhattan *** A cover letter is essential if you're responding to this job posting ***Pre-requisites:You must be able to provide EXCELLENT references from past managers ***Must have excellent phone manners and communication skills . Foreign Languages are helpfulMust be available to work a flexible schedule including evenings and some weekends .Experience is helpful but drive, ambition and evidence of hard work are as important. Willing to train top-notch candidatesWillingness to work evenings and some weekendsKnowledge of out-of-network benefits, billing and collections is helpfulA urology practice is seeking an experienced medical office professional who can multitask and independently handle a variety of front-office, back-office and clinical tasks.Principal tasks include medical assistance, surgical assistance, manage the front desk / phone calls and benefit eligibility.An ideal candidate would also be able and willing to do medical assisting tasks as needed.This role is critical to creating a positive first impression for the practice. Your caring and positive attitude will have a significant impact on patient loyalty and their relationship with the practice.We are a smoke-free and drug-free organization. An ideal candidate would understand that this is as much a front desk position as it is a sales position as the ability to communicate with prospective patients for them to choose us is critical to business success. The employee should be able to manage and follow up on all patient requests. Prior successful sales experience is beneficial. We are looking for an experienced healthcare professional. An ideal candidate would have experience with the following skill set: PRIMARY FUNCTION:This job requires flexibility and availability to work evening and weekend hours as needed. Reliability is a must. Promotion is based on performance and initiative to solve problems. Must be comfortable handling urine specimens and blood specimens.Follow HIPAA rules; be able to confidentially discuss private medical issues with male and female patients such as sexual health and urinary incontinence in a professional manner. Your duties will include explaining our medical services; schedule appointments, answer and return calls from potential and existing patients. Document all interactions in EMR (electronic medical records). Check-in patients, verify insurances, pre-certify and schedule tests (CT, MRI, etc) and surgeries with insurance companies. Schedule hospital surgeries. Submit medical billing information; collect patient payments. Ideally, you have experience with medical assistance for procedures such as cystoscopy, urodynamics, uroflow or are willing to learn. Skills/RequirementsMust have experience in either surgical authorizations or billing.Extensive knowledge of health insurance companies and prior medical office experience (pre-authorizations, insurance verifications, appeals, out-of-network benefits, etc)-Extensive knowledge of medical billing and collection practices.-PC- based business applications software such as Microsoft Office, specifically Word and Excel- Proper English grammar, usage, spelling, and punctuation; modern business office procedures, including filing systems, business correspondence, and telephone techniques.-Excellent interpersonal skills, strong analytical and problem-solving skills. Job Type: Full-time"}