{"jobID": "2787678018", "jobLocation": "Mountain_View_CA", "jobTitle": "BCBA", "companyRating": null, "companyInfo": {"Website": "www.icanautism.com", "Headquarters": "Sunnyvale, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Unknown", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Intervention Center for Autism Needs (ICAN), LLCMy name is Dr. Saba Torabian. I am an adjunct psychology professor at San Jose State University where I have formed my own autism research lab . My passion and inspiration to help children and families affected by autism came after both of my sons were diagnosed with autism. Living with autism with my two children over the years made me learn and understand what an autism family really needs. Over the years, I sought out almost all possible treatments for my kids to notice the lack of effective treatments and services not only for the children who are affected by autism but also for their families. I recently establish a center and home-based therapy center at Mountain View and looking for a dedicated BCBA. If you are ready to start, please email me us immediately.Website: www.icanautism.comJob Skills/Credentials/Experience:Strong ABA (Applied Behavior Analysis) and clinical skillsSelf-disciplined: Able to schedule and attend client appointments and clinical team meetings with consistency, reliability and punctualityExcellent written and spoken communicationExcellent time management skillsExcellent interpersonal skillsExcellent team player attitude and customer service orientationA minimum of a Master’s degree in a related field is requiredCandidates must be a current Board Certified Behavior Analyst (BCBA)Have previous clinical experience at an autism service provider or in a school setting with Applied Behavior Analysis (ABA)Prior supervisory experience overseeing a team of ABA clinicians Job Types: Full-time, Part-time, Contract"}