{"jobID": "2813488998", "jobLocation": "Austin_TX", "jobTitle": "Support Reporting and Analytics Intern", "companyRating": null, "companyInfo": {"Website": "www.lithium.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Hootsuite, Sprinklr, Spredfast"}, "estimatedSalary": null, "jobDescription": "What You’ll Do Lithium is seeking a Reporting and Analytics intern for 40 hours per week as part of the Global Customer Support team. You’ll be using state-of-the-art CRM and data visualization tools to develop reports measuring KPIs that help us execute our support strategy. You’ll also have the opportunity to compare and evaluate enterprise software platforms. We definitely aren’t robots, but everything we do is strategic and data driven.  This is a great position for someone who wants to explore how to manage organizations by making smart use of data. You are resourceful, energetic, self-driven, strategic, and love data detective work. You’ll enjoy working in a team environment at a fast-paced startup in Austin, Texas. You must be comfortable with data and have strong skills in Excel as well as some experience working with other data tools or environments (for example, SQL, Access, Oracle, Domo, Tableau, Python, R, SAS, or Salesforce - and we hope you would have enjoyed it!) Expect one or two long-range projects, as well as pitching in with short term tasks that pop up from week to week. Examples of typical projects: You won’t be expected to initiate or guide any of these types of projects. You’ll be working with a supportive and skilled team, and we can use some extra help. Taking large sets of support data and breaking them down to reports showing progress for an individual support agent or a team.Creating and modifying processes recognizing and acting on trends in business data.Improving our existing reports using data visualization tools.Analyzing data outcomes from business processes and identifying problems, discrepancies, and root causes for variances.Using support data to make financial projections.Resourceful. Able to develop different approaches to solve a problem if the first approach doesn’t work out.Quality conscious.People skills to interact with staff, colleagues and cross-functional teams.Comfortable with advanced analytics and Excel."}