{"jobID": "2822575453", "jobLocation": "Milpitas_CA", "jobTitle": "Test Technician", "companyRating": "3.4", "companyInfo": {"Website": "www.skyworksinc.com", "Headquarters": "Woburn, MA", "Size": "5001 to 10000 employees", "Founded": " 1962", "Type": " Company - Public (SWKS) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "26", "jobDescription": "    If you are looking for a challenging and exciting career in the world of technology, then look no further. Skyworks is an innovator of high performance analog semiconductors whose solutions are powering the wireless networking revolution. At Skyworks, you will find a fast-paced environment with a strong focus on global collaboration, minimal layers of management and the freedom to make meaningful contributions in a setting that encourages creativity and out-of-the-box thinking. Our work culture values diversity, social responsibility, open communication, mutual trust and respect. We are excited about the opportunity to work with you and glad you want to be part of a team of talented individuals who together can change the way the world communicates.  Requisition ID: 46861  Test Technician    Performs electrical and environmental testing of optoelectronic products and some assembly-related activities, including high-volume component burn-in of serialized devices.     Performs MIL-STD quality testing and processing of high-reliability devices with applications in satellite, aerospace, medical and other critical domains.  Tracks testing of serialized production of thousands of devices with careful attention to detail and traceability of data.    Job Requirements:Experience with production-level serialized device testing and burn-in.Hands-on experience with electrical testing and production lot processing at MIL-STD quality or similar (such as AS9100, J-STD, or other) preferred.Proficiency in Microsoft Excel. Generating formulas and templates, formatting. Data collection, handling and interpretation.Use of specialized test apparatus and equipment.Data management and analysis skills helpful. Will train.Experience with high-current (up to 40 amps) and/or high-temperature (up to 250°C) equipment.Experience with ESD and clean room environments.Use of oscilloscopes, DVMs, curve tracers, signal generators and power supplies.Work from circuit schematics and diagrams to perform testing and troubleshooting.Soldering and circuit building and circuit testing.Assist engineering in determining methods/actions to remedy malfunctions.Assist engineering in design, construction, and check-out of test equipment.Associates Degree and/or 3 years relevant technical experience in electronics. Knowledge of electrical/electronic circuits needed (resistors, capacitors, transistors, LEDs). Basic business accounting skills or similar college education useful.                Skyworks is proud to be an equal opportunity employer supporting diversity in the workplace."}