{"jobID": "2804887978", "jobLocation": "New_York_NY", "jobTitle": "Registered Nurse, RN, Homecare PD", "companyRating": "3.1", "companyInfo": {"Website": "www.vnsny.org", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1893", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "41", "jobDescription": " Overview Visiting Nurse Service of New York (VNSNY) is the nations largest not-for-profit community-based health system. VNSNY provides a comprehensive array of home- and community-based programs, including health plans, tailored to the needs of high-risk, vulnerable New Yorkers, improving their quality of life. Each day, more than 18,000 VNSNY employees including nurses, rehabilitation therapists, social workers, dieticians, other allied professionals, and paraprofessionals deliver compassionate care, unparalleled medical expertise, and 24/7 solutions and resources to more than 35,000 patients, helping them to live the best lives possible. Responsibilities Looking for a Per Diem Registered Nurse (RN) to provide high quality multidisciplinary health services to patients in the Region/Program consistent with VNS Group Health Home Care philosophy, policy, goals and objectives, and Standards of Nursing Practice. Works under moderate supervision. Assesses the physical, social and psychological needs and living conditions of the patient through professional knowledge and skills of observation, interviewing and physical examination. Travels to patients homes and/or other facilities with varying environments (e.g., elevated buildings, walk-ups, care facilities, single/multiple family homes, presence of pets, etc.) using approved transportation options to deliver direct care to the patient. Implements the care plan and revisions by ongoing assessment, planning, coordination, counseling, teaching and supervision. Works collaboratively and consult with appropriate multidisciplinary health team members (i.e., physician, OT, PT, SW, SLP, family members). Transports and utilizes required medical equipment and supplies using VNS designated/supplied carrying case weighing up to 30 lbs. (as needed) to and from patient homes/care facilities. Provides nursing care in accordance with Agency policies, practices, procedures and Standards of Nursing Practice, which may require standing, stooping, sitting, crouching, bending and stretching to deliver patient care Documents content and process of all services provided in accordance with government regulations/requirements, Agency policies, practices, and procedures. Assists patients with activities of daily living, which may require positioning, moving, transferring and lifting patients of varying weights and physical conditions, with and without assistance and as appropriate, from family members and/or paraprofessionals. Monitors the effect of the care plans on the patient/family health status and informs physician and other team members of changes in the client's needs. Consults with and educates the client and family regarding the disease process, self-care techniques and prevention strategies. Appraises care provided and revises the goals and approaches to patient care, as needed. Initiates and maintains written (including clinical and progress notes) and verbal communications with team members and management to assure optimal patient care. Performs established work procedures in relation to Region Program workflow. Understands/interprets/implements the Agency standard reimbursement policy and determines the billing source for patient care. Consults with management on complex/unique reimbursement cases. Manages all aspects of a caseload, as assigned. Maintains productivity sufficient to meet Agency goals. Participates in the orientation of selected staff through buddy system field observation of staff and feedback to appropriate staff involved in orientation process. Participates in selected student programs by providing guidance, training and mentoring to students. Assumes responsibility for personal professional growth through attendance at in-services, training, continued formal education and select journal readership. Performs other related duties and participates in special project, as assigned. Licensure: License and current registration to practice as a registered professional nurse in New York State required, Registered Nurse (RN). Certified lactation counselor (CLC) or Lactation Certification accredited by a nationally recognized accreditation body preferred. Valid driver's license or NYS Non-Driver photo ID card, may be required as determined by operational/regional needs. Education: Bachelors Degree in Nursing from an approved program required. Experience: Minimum one year of experience in a medical/surgical environment preferred. Bilingual skills may be required, as determined by operational needs. Demonstrated computer skills may be required based on operational needs. Job Type: Full-time CA2018"}