{"jobID": "2787765180", "jobLocation": "San_Jose_CA", "jobTitle": "Algorithm Research Engineer", "companyRating": "3.8", "companyInfo": {"Website": "www.careers-continental.com", "Headquarters": "Hannover, Germany", "Size": "10000+ employees", "Founded": " 1871", "Type": " Company - Public (CTTAY) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Michelin, Bosch Security"}, "estimatedSalary": "95000", "jobDescription": "About Continental With sales of €44 billion in 2017, Continental is among the leading automotive suppliers worldwide and currently employs more than 240,000 employees in 61 countries. The Chassis & Safety division develops and produces integrated active and passive driving safety technologies as well as products that support vehicle dynamics. The product portfolio ranges from electronic and hydraulic brake and chassis control systems to sensors, advanced driver assistance systems, airbag electronics and sensorics as well as electronic air suspension systems all the way to windscreen washer systems and headlight cleaning nozzles. The focus lies on a high level of system competence and the networking of individual components. Thus products and system functions are developed along the SensePlanAct chain of effects. They form the foundation for automated driving. Chassis & Safety employs more than 47,700 people worldwide and generated sales of approximately €9.8 billion in 2017. Auto req ID 93802BR Job Title Algorithm Research Engineer Country United States Posting Location San Jose, CA Job Description Overview:  As part of our team you will be responsible for developing advanced concepts for low and high speed vehicle maneuvering by developing and implementing the latest sensor fusion, machine learning and control methods to push the technology to the next level. Job Requirements Minimum Qualifications: Bachelor’s Degree in an Engineering DisciplineComputer science fundamentals in algorithm design and problem solvingExperienced Programmer in C or C++Hands­on expertise in roboticsExpertise in Artificial Intelligence/Machine LearningExperience with sensor fusion, machine learning or environmental perception sensorsStrong oral and written communication skillsPreferred Qualifications:Master’s Degree in Electrical/Software/Computer Science/Computer Engineering/Controls Engineering.Expertise in development of computer vision / image processing algorithms for embedded systems.Experience in vehicle control systems calibration EEO Statement EEO / AA / Disabled / Protected Veteran Employer. Continental offers equal employment opportunities to all qualified individuals, without regard to unlawful consideration to race, color, sex, sexual orientation, age, religion, national origin, disability, veteran status, or any other status protected by applicable law. In addition, as a federal contractor, Continental complies with government regulations, including affirmative action responsibilities, where they apply. To be considered, you must apply for a specific position for which Continental has a current posted job opening. Qualifying applications will be considered only for the specific opening(s) to which you apply. If you would like to be considered for additional or future job openings, we encourage you to reapply for other opportunities as they become available. Further, Continental provides reasonable accommodations to qualified individuals with a disability. If you need assistance in the application process, please reply to North.America.Recruiting@continental-corporation.com or contact US Recruiting at 248.209.4000. Division Footer Text Ready to drive with Continental? Take the first step and fill in the online application."}