{"jobID": "2731742467", "jobLocation": "Palo_Alto_CA", "jobTitle": "Sr. Data Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.adara.com", "Headquarters": "Palo Alto, CA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "127000", "jobDescription": "Sr. Data Analyst ADARA is searching for a Senior Data Analyst for its headquarters in Palo Alto, CA. The ideal candidate will be expected to perform deep analytics and provide actionable recommendations to support and grow ADARA’s business. The candidate will also collaborate and support other key stakeholders in the organization such as Marketing, Business Development, Sales, Finance, Product and Engineering. This is a unique opportunity to make a big impact, solve interesting problems, and operate with a high level of autonomy. Responsibilities:Serve as a subject matter expert for ADARA’s analytics suite, reporting, and dataMentor, teach, and help enable the success of other analystsLead analytic functions and develop closed-loop processes that include performance analysis, business recommendations, and data driven solutionsAbility to conduct large scale analysis through all stages: understand business goal and strategy, formulate analytic approach, perform data extraction and exploration, and translate results into actionable itemsBe a thought leader and consultative resource for optimizing marketing campaigns and product developmentShepherd, manage, and drive projects from the incubation stage to final deliveryRecommend new solutions to help scale, streamline, and grow the business  Qualifications:Analytical Skills4+ years of hands-on analytics experienceAnalytics experience in programmatic / RTB environment for media campaigns (display, video, social, etc.) a plusProficient in SQL; must possess strong understanding and experience in database environmentStatistical analysis software such as R and SPSS a plusProficient in Excel and other MS Office applicationsStrong experience in Business Intelligence tools (i.e. Microstrategy) a plus  Business AcumenPossess long-term vision to further analytic efforts ranging from new data utilization, tools needed, and its application to the businessExcellent verbal, written, and presentation communication skillsCollaborate effectively with various areas of the organization to accomplish common goalsPossess strong business acumen and the ability to explain problems and solutions effectively to both technical and non-technical audiencesKnowledge of online advertising ecosystem and relevant performance metricsResults oriented driving results for internal and external key stakeholders  OthersHighly data driven, willing to roll-up the sleeves and dive head first into our dataGreat organization skills with high attention to detailAbility to self-motivate, prioritize work, and excel in a fast-paced start-up environmentPrevious experience in travel industry a plus  Education:Bachelor degree in Economics, MIS, Statistics or related fieldHigher learning and additional certifications a plus   "}