{"jobID": "2685481988", "jobLocation": "Boston_MA", "jobTitle": "Jr. Field Applications Engineer", "companyRating": "4.7", "companyInfo": {"Website": "www.pulseelectronics.com", "Headquarters": "San Diego, CA", "Size": "5001 to 10000 employees", "Founded": " 1957", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "66000", "jobDescription": " Jr. Field Applications Engineer  Power Business Unit  Remote - East Coast SUMMARY The Field Applications Engineer (FAE) provides technical expertise to a variety of customers that integrate Pulse products with a Power Integrated Circuit (IC) and related components for power conversion application designs. Duties will include providing support for all phases of product development from initial customer contact through to production status for any Power products on an as-needed basis. Must be familiar with AC/DC and DC/DC converter topologies and how Pulses Power products are used in them. Assignments include interpretations of designs, applications, and service information as well as generating specifications for new design opportunities. The FAE must be able to work with various Pulse support groups (Marketing, Sales, Customer Service, Engineering, Quality, and Process) as well as Pulses Sales Reps and Distributors to support customer requirements. The FAE must be able to establish relationships with key decision makers at Original Equipment Manufacturer (OEM), Original Design Manufacturer (ODM), Contract Equipment Manufacturer (CEM), and Integrated Chip (IC) manufacturers. The FAE will gather and disseminate information concerning the capabilities of a competitors products. The FAE represents customer interests at internal technical meetings and will conduct technical training and presentations internally and externally.  MINIMUM QUALIFICATIONS EDUCATION: BSEE required. EXPERIENCE: 0-3 years overall work experience preferred. KNOWLEDGE: Experienced with various DC/DC and AC/DC converter topologies and in specifying power magnetics that work optimally in the in the intended application. SKILLS: Working knowledge of MS Office Products including PowerPoint, Word, Excel and SalesForce.  INTERNAL AND EXTERNAL RELATIONSHIPS INTERNAL: Daily interaction with Marketing to coordinate magnetic design opportunities and product development. Will have daily interaction with divisional Design Engineers to aid in specifying product requirements for new designs and provide technical support of current products. Weekly interaction with Power Division cross functional team to prioritize and schedule product development needs. EXTERNAL: Daily interaction with OEM/ODM and smaller customers to provide technical support and Integrated Circuit manufacturers to define magnetics in support of their reference and custom designs.  PHYSICAL REQUIREMENTS  The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is regularly required to stand, walk, sit, and talk or hear. The employee must occasionally lift and/or move up to 25 pounds. The employee must occasionally crouch, stoop, or reach. Specific vision abilities required by this job include close vision, color vision, depth perception, and ability to adjust focus. The noise level in the work environment is usually moderate. CHALLENGES Establish relationships with key applications engineers, design engineers, and marketing managers at Integrated Circuit (IC) and Original Equipment Manufacturing (OEM) companies. Work with the decision makers in the early development stage of projects and ensure that Pulse has a part developed to support the new application and that Pulse attains a print position on their reference or custom design.  Serve as direct, first line of technical contact in product development. The FAE must be able to manage their time and work with internal resources such that multiple products are completed on time for samples and other materials such as datasheets and new product presentations. Responsible to schedule own travel in support of customer and 3rdparty IC visit goals. Must be a self-starter and demonstrate a great deal of personal creativity and ownership. The products chosen for 3rdpart IC development must be selected and qualified based on close knowledge and understanding of market requirements. Position requires a significant amount of travel, up to 50%. SPECIFIC POSITION DUTIESCustomer visits to third-party (silicon) manufacturers and OEM/ODM customers.Analyze industry and market technical requirements to define future product development needs.Work with Product Management and Marketing to define datasheets, update New Product Presentations, and develop other marketing collateral material.Aid in development of business plans and justification of department and company resources.Provide system level support to Design Engineers.Oversee, prioritize, and manage internal issues to ensure customer satisfaction in production development.Other duties as assigned.Up to 50% travelBENEFITS Whether you are considering a career move or looking for your first job, we understand that you will weigh the rewards and benefits a company has to offer. This is why we are 100% committed to providing our employees with a comprehensive package that stands as one of the most competitive within the manufacturing and engineering industries. All of our benefits start immediately, which means no waiting periods for you and your family. Competitive salariesYour choice of PPO or HMO Medical PlansDental, Vision, and Prescription plansGroup life insuranceShort and Long term disability coverageVacation and sick leaveHolidays401(k) Savings Plan MatchingFlexible Spending Accounts (FSA)NO Waiting Periods on any BenefitsPulse Electronics is committed to creating a diverse environmentand is proud to be an equal opportunity employer."}