{"jobID": "2826806370", "jobLocation": "Fremont_CA", "jobTitle": "Food Service Team Members", "companyRating": "3.5", "companyInfo": {"Website": "www.modpizza.com", "Headquarters": "Bellevue, WA", "Size": "5001 to 10000 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Restaurants, Bars & Food Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "12", "jobDescription": " Imagine if everyone had a place to go where they were encouraged to embrace their individuality and come as they are. A place fostering an environment that supports human growth and recognizes the value in second chances. This is the kind of place that MOD is committed to creating and maintaining every single day. By creating a culture where individual spirits are celebrated, we believe that our teams will feel empowered and committed to providing that same experience for every single customer that walks through the door.  With more than 350 locations across 20 states and the United Kingdom, MOD is committed to creating a positive social impact within these communities, creating not only an exciting place to eat, but a place where others are inspired to bring about change. We call it Spreading MODness.  As a MOD Pizza Squad Member you directly contribute to the success of the MOD community by presenting the MOD Pizza experience to all individuals who choose to visit our stores. The position is responsible for providing people with Super Fast service, a memorable experience, amazing Pizzas and Salads, and a cool environment. What you will do:Make quality pizzaKeep things upbeat and friendlyThrive in a team environment where you will collaborate with othersBuilds important connections with customers; discovers and responds to their needs with a customer first attitude.Become a MOD menu expertPrepare and restock food productsHelp maintain a spotless shopFollow all health, safety and sanitation guidelinesExperience and SkillsWhat you bring:A real passion for peopleReliable transportationConsistent attendance and punctualityYou are at least 18 years oldBonus points if you have:Food/service industry experienceCash-handling skillsProblem-solving abilitiesPhysical Requirements As a member of our MOD Squad, you will be working in a kitchen environment, rotating between front and back of house. This requires walking, bending, twisting, reaching, stooping, kneeling, crouching, pushing and pulling to handle or move objects weighing up to 50 pounds. You will also be asked to operate hand-held appliances and simple kitchen equipment (industrial can opener, dough press, industrial dishwasher, etc.). Depending on the location, you may need to go up and down stairs. You also have the ability to communicate and exchange information with coworkers and others is also required. Working ConditionsHigh noise levels due to operations, customers and overhead music (including, but not limited to, rock, punk and alternative)May be indoor or outdoor setting depending on store (varied weather conditions are expected)Will work near moving or mechanical partsVarying schedule to include evenings, holidays and extended hours as business dictatesWe make pizza so we can serve people Click here to see a day in the life at MOD- https://vimeo.com/97852904  Want to help us spread MODness? Apply today!  Our largely diverse community of MOD Squaders plays a huge role in making MOD a place that is welcoming to people from all backgrounds and walks of life. It is our mission to build up communities that empower and inspire one another, celebrating our differences and appreciating all that we each have to offer. In this regard, MOD is proud to be an equal opportunity employer and is committed to providing equal opportunity for all employees and applicants. MOD recruits, hires, trains, promotes, compensates, and administers all personnel actions without regard to race, color, religion, sex, sex stereotyping, pregnancy (which includes pregnancy, childbirth, and medical conditions related to pregnancy, childbirth, or breastfeeding), gender, gender identity, gender expression, national origin, age, mental or physical disability, ancestry, medical condition, marital status, military or veteran status, citizenship status, sexual orientation, genetic information, or any other status protected by applicable law.  Key words: restaurant, cook, line cook, dishwasher, cashier, register, customer service, fast food, busser, server, waitress, waiter, pizza, entry level, kitchen, prep"}