{"jobID": "2764116525", "jobLocation": "New_York_NY", "jobTitle": "B2B Operations Manager", "companyRating": "3.9", "companyInfo": {"Website": "www.wayup.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "62000", "jobDescription": " WayUp is the go-to platform for millions of early-career professionals to explore job and internship opportunities, receive advice, and get discovered by employers. Top companies from startups to Fortune 500s use WayUps platform to reach, recruit and engage with the new generation of early-career talent. Since launching in 2014, WayUp has helped millions of candidates launch their careers.  WayUp is seeking an awesome marketing operations manager to help drive and execute impactful digital and field campaigns. We are looking for an experienced campaign operations associate who can build process frameworks and system architecture at scale. The candidate must be positive, self-motivated doer with a passion for events. The candidate must must possess a strong teamwork ethic and have ability to work both independently and as part of a larger team. RESPONSIBILITIESOwn, optimize and integrate the B2B marketing technology stack for optimal performance to achieve the best in class marketing platformSupport marketing initiatives through marketing process automation (building email programs and landing pages, scoring leads for sales follow-up, and campaign-specific routing) and reporting on program performance (email engagement, new leads, pipeline and revenue generated/influenced)Work with stakeholders to develop framework to A/B test across all touchpoint of the customer journey including the website, nurture flows, emails, social, etc.Drive health of our database through data enrichment, hygiene, and persona segmentationBuild collaborative relationships with cross-functional stakeholders to improve data collection and alignment for systems and processesMaintain knowledge on the latest best practices in operations and marketing automationREQUIREMENTS3+ years in marketing automation systems and process design in a B2B industry (SaaS preferred)A meticulous approach to detail, process and data managementAnalytical approach to decision making to achieve real-time performance optimizationStrong time management skills, with a keen ability to manage multiple projects/deadlines, and adjust priorities based on ever changing business needsUnderstanding of Account-Based Marketing strategy, segmentation and processesExperience with B2B technology stacks including Splash, Livestorm, Everstring is a plusKnowledge of a B2B marketing automation tool (Pardot, Hubspot, Marketo) / SFDC expert-levelPERKS & BENEFITSComprehensive Healthcare Plan (Medical, Dental, Vision)401k Plan through MassMutualWeekly Catered Team LunchMonthly Lunch & Learns with Industry Leaders, CEOs, VC's and moreUnlimited Sick DaysPre-Tax Commuter & FSA BenefitsContinuous Education StipendOffice Snacks, Cold Brew and Lots of Dogs! By submitting your application, you agree to submit a list of references as part of the interview process and consent to WayUp contacting these references.  The Company values the array of backgrounds, talents and perspectives that a diverse workforce brings. All qualified applicants will receive consideration for employment without regard to actual or perceived race, religious creed, color, national origin, ancestry, physical or mental disability, medical condition, genetic information, marital or familial status (including registered domestic partnership status), sex and gender (including pregnancy, childbirth, lactation and related medical conditions), gender identity and gender expression (including transgender individuals who are transitioning, have transitioned, or are perceived to be transitioning to the gender with which they identify), age, sexual orientation, Civil Air Patrol status, military and veteran status, certain arrest or conviction records, domestic violence victim status, and any other consideration protected by federal, state or local law (collectively referred to as \"protected characteristics)."}