{"jobID": "2829885201", "jobLocation": "Culver_City_CA", "jobTitle": "Magento Sr Marketing Technology and Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.magento.com", "Headquarters": "Culver City, CA", "Size": "501 to 1000 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "87000", "jobDescription": "MagentoSr Marketing Technology and Data AnalystThe Company Magento Commerce is the leading provider of cloud commerce innovation to merchants and brands across B2C and B2B industries, with more than $124 billion in gross merchandise volume transacted on the platform annually. In addition to its flagship digital commerce platform, Magento Commerce boasts a strong portfolio of cloud-based omnichannel solutions that empower merchants to successfully integrate digital and physical shopping experiences. Magento Commerce is the #1 provider to the Internet Retailer Top 1000, the B2B 300 and the Top 500 Guides for Europe and Latin America. Magento Commerce is supported by a vast global network of solution and technology partners, a highly active global developer community and the largest ecommerce marketplace for extensions available for download on the Magento Marketplace. More information can be found at www.magento.com.   The Role The Sr Marketing Technology and Data Analyst is responsible for the designed and enhancing Magento’s Marketing Data Architecture, Automating Marketing’s Overall Performance Dashboards (In partnership with Sr Data Analyst), Partnering with IT and Sales Ops on SFDC enhancements, customizations and enriching content tagging on all Digital assets at Magneto. This role will working closely with IT, Digital Team, Sales Ops and the Demand Generation team and must be able to documents workflows and gain by in across stakeholders to drive alignment to business goals. ResponsibilitiesSupport the Head of Marketing Ops on Partnering with IT and Sales Operations on Marketing Technologies to architect scalable business models within SFDC, Marketo, and Adobe Experience Cloud SuiteGuide technical decision makers on creating business value through Marketing Data Architecture Design Sessions, Workshops, and Proof of Concepts.Propose and validate solution architecture and transfer knowledge on best practices to senior IT Infrastructure, Operational, and Security leaders.Serve as the as the go-to technical expert in SFDC, Marketo, Abode Experience Cloud and TableauWork across marketing and sales leaders to align KPIs and Targets to drive the businessAutomate dashboards that drive business decisions around revenue growthMonitor and interpret business performance, understanding key drivers and trendsEducate stakeholders on how to leverage the dashboards on day to day metrics while focusing on areas that need additional attention of insightsDevelop appropriate metrics and build and automate dashboards to monitor business performance  RequirementsOutstanding analytical, communication and business skills requiredExperience working on large datasets and analyzing dataExperience using SalesForce, Adobe Experience Cloud, Tableau and Marketing Automation SystemsKnowledge of data warehouses and BI systems is desiredAt least 10 years of relevant work experienceMinimum BS/BA DegreeAbility to tell stories with data, educate effectively, and instill confidence, motivating stakeholders to act on recommendationsExcellent problem solving skills and end to end quantitative thinkingOutstanding communications skills with both technical and non-technical colleaguesSuperior problem-solving skills. Must be able to accurately compile and synthesize quantitative and qualitative dataExcellent collaborative team attitude, excelling in fast-paced start-up environment WORKING FOR MAGENTO Working at Magento means becoming part of one of the fastest growing commerce solutions companies on the planet. More than 280,000 merchants rely on us to fuel their growth.    A career at Magento puts you on the cutting-edge of the commerce industry and offers many opportunities for advancement. And, as a part of our family of products and services, you’ll also gain valuable exposure to a wealth of commerce knowledge, experience, a global customer and employee base, and world-class resources.   We’re always looking for talented people who want to help shape the future of commerce, and who believe in the power of collaboration."}