{"jobID": "2776163354", "jobLocation": "New_York_NY", "jobTitle": "Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.okcupid.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2003", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "87000", "jobDescription": "OkCupid is looking to hire aData Analyst!OkCupid is looking for an experienced Data Analyst to contribute to our data-driven organization. We enjoy working on a product that helps millions of people find love and get a great sense of satisfaction in seeing our hard work make a difference. If thats the kind of thing that appeals to you, youre probably a good fit for OkCupid!In this role, you will:Analyze company performance across Product, Marketing, Finance, and morePrepare trend analysis and investigative reporting for product teams and senior managementDevelop stories using (a lot of!) real data to share with outside media publications and business partnershipsDesign and create intuitive yet scalable reports, dashboards and visualizations that business owners can rely on to provide Business Intelligence valueWork with product owners to test new features in the product and analyze the performance of your experimentsHelp us better understand the business of love!Were looking for:3+ years experience using SQL with any database. Big data knowledge a plus!Experience with at least one statistical programming language: Python, R, SAS, Julia (Python Preferred!)Experience with MS Excel / Google Sheets or BI Tools (Looker, Tableau, Power BI, etc)Strong analytical skills and the ability to turn unstructured problems into easily digestible analysis and conclusionsBachelors degree in Mathematics, Computer Science, Economics, Finance, Business, or Engineering related field a plusWhat are some perks?Competitive salary and full benefits, including Medical, Dental, Vision, and 401kWorkstation and tools of your choicePaid attendance to conferencesRegularly catered lunch and a bomb shelter stockpile of snacks and drinksCompany funded happy hours/eventsA sunny office full of incredibly curious and friendly peopleOkCupid is an equal opportunity employer. We celebrate diversity and are deeply committed to fostering an inclusive environment for all employees."}