{"jobID": "2276979402", "jobLocation": "Beverly_MA", "jobTitle": "Bioinformatics/Wetlab Sequencing Interns in Boston Lab", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Company Overview Genomic Expression is finding the best drug for the patient and the best patient for the drug by sequencing RNA. Analyzing RNA is able to tell if the tumor will respond to the new immune therapies, which is the only kind of therapy that is a potential cure. Job Summary Genomic Expression is looking for interns with either a bioinformatics or wet lab sequencing background or both. Responsibilities and DutiesAssist in the development of Cloud based bioinformatics platform (Bioinformatics)Assist in producing and improving sample prep and sequencing methods (wetlab)Specify how this position fits into your organization. You will be employed in a functional area focused on development of Next Generation Sequencing focused on diagnostics. You will have the opportunity to work within a small entrepreneurial team that offers significant growth opportunities.  The tasks will evolve dynamically in relation to the pipeline of projects in which the company is involved. You will be part of a team that fosters an open and professional dialogue across skills sets and disciplines.  If you have a keen sense of detail and perform your work in a timely manner, and if you are a creative and committed worker with a desire to participate in a challenging international research environment, then we want to hear from you. Qualifications and SkillsCan demonstrate experience with DNA and/or RNA sequencing.Can demonstrate experience in the development of novel scripts.Can demonstrate experience working in a wet lab with state-of-the-art molecular biological procedures.Broad experience within genetics, molecular biology or very closely related subjects.One or more courses in molecular biology and/or geneticsOne or more courses in statistical analysis and/or data scienceDeep interest in cancer researchThe ability to work independently.The urge to excel and achieve results.Requirements2-year/Community College/Certificate students must be enrolled in an Associates Degree or Certificate program or completed one within the past year.4-year college or university students must have or will complete(d) at least their sophomore year the semester before the internship, or have graduated within the past year.Graduate students must be enrolled in a Masters Degree program or received their Masters Degree within the past year."}