{"jobID": "2816082569", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst, Games and Marketing", "companyRating": "3.8", "companyInfo": {"Website": "www.kongregate.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Public", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "64000", "jobDescription": " Data Analyst, Games and MarketingThe Insights and Analytics team is responsible for providing data-driven insights and analytics support across the company. As a Data Analyst your mission is to help maximize the business success of our portfolio of mobile games. Your primary responsibility will be analyzing data to  improve all aspects of our free-to-play games, from the features that drive monetization and retention, to the analysis necessary to drive  profitable paid user acquisition. You will be exposed to many different industry facets, such as game design, product management, user  acquisition, game production, business development, and engineering. As a Data Analyst you will be completing most activities independently  with regular mentorship from your supervisor.  Our ideal candidate is an avid gamer and a SQL expert with a love for analytics and statistics. Essential Job Duties and Responsibilities  Collaborate with cross functional teams to analyze and optimize game systems and features.  Work with user acquisition managers to build the tools, reports and dashboard necessary to analyze and optimize campaigns.  Work with product managers to build the dashboards necessary to live service free-to-play games.  Take ownership of analysis and reporting on game mechanics and performance.  Design and analyze A/B tests for optimizing game elements.  Design and implement tools and processes for efficiently auditing data sources.  Assist with the design and implementation of schemas for tracking game events and data.  Troubleshoot data quality issues and work with product managers, producers, internal developers, and external game developers to reach solutions.  Basic and Preferred Qualifications (Education and/or Experience)  Quantitative degree (Engineering, Math, Economics, Finance, Computer Science, etc.) or equivalent experience.  2+ years of experience performing quantitative analysis, preferably for a technology company.  Expert knowledge of databases and SQL.  Related Competencies Stellar Communication: Clearly conveys information, ideas, and findings through a variety of written and oral media to both technical and non-technical audiences. Visualizes data to make information accessible, approachable, and actionable. Analytical Thinking: Examines problems, situations, opportunities, and data to identify causes, key factors, and potential outcomes with the desire to improve overall business results. Creative Problem Solving: Identifies novel approaches to solving problems. Discovers new opportunities or adapts solutions for problems by looking beyond current practices and uses innovative thinking.  Minimum Qualifications, Job Skills, Abilities  Working understanding of statistics.  Self-motivated, intellectually curious, and ambitious.  Proficient communication, multitasking, and problem-solving skills.  Self-motivated, intellectually curious, and ambitious.  Enjoy working in both individual and team settings.  Familiarity with Tableau, similar analytics platforms or the desire to dive in and learn new tools.  Experience automating analysis using analytics packages in languages like R or Python is a plus.This position can be filled at our Portland or Montreal locations. To apply, send a resume to jobs+DA@kongregate.com with \"Data Analyst\" in the subject line. back to top ↑"}