{"jobID": "2710346010", "jobLocation": "San_Francisco_CA", "jobTitle": "Measurement Data Scientist", "companyRating": "3.9", "companyInfo": {"Website": "www.pinterest.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "165000", "jobDescription": " Pinterest helps people find inspiration—for everything from tonight’s dinner to next summer’s vacation or a dream house down the road. Partners play a big role in making those inspirations a reality, through their organic and paid investment on Pinterest. As a Measurement Data Scientist, you'll work on diverse partner-facing analytical questions to help a variety of Advertising Partners understand and improve the effectiveness of their advertising on Pinterest.What You’ll Do :Apply expertise in quantitative analysis, data mining, modeling, and the presentation of data to understand how we drive value for our partners.Partner with cross functional teams, including Measurement, Insights, Partner Analytics, Partner Marketing, Partner Product, and Partner Engineering teams to solve problems, build products based on data, and identify new opportunities.Report, visualize and communicate results to internal stakeholders and to inform the industry as a whole.Design, build, and launch new data models of user behaviors for analysis that relates to Partner outcomes and involve in the implementation of the model.Use various statistical methods to lead research projects from beginning to end, and ensure an efficient execution process.What we’re looking for :2+ years of data science experience in the advertising or marketing industry.Strong knowledge in various statistical methods and/or machine learning.Expertise in working with relational databases, querying language (SQL, HQL), and statistical languages (R, Python).Ability to develop a research plan and deliver insightful and actionable results.Ability to work cross functionally with measurement teams, product teams, and other members of the wider analytical teams."}