{"jobID": "2770050725", "jobLocation": "San_Francisco_CA", "jobTitle": "Legal Practice Assistant - Litigation", "companyRating": null, "companyInfo": {"Website": "www.kslaw.com", "Headquarters": "Atlanta, GA", "Size": "1001 to 5000 employees", "Founded": " 1885", "Type": " Private Practice / Firm", "Industry": " Accounting & Legal", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Alston & Bird, Vinson & Elkins, Gibson Dunn & Crutcher"}, "estimatedSalary": null, "jobDescription": "Candidates will have the following responsibilities:Manage and maintain lawyers’ schedules and calendars.Schedule and organize onsite and offsite meetings, conference, speaking engagements, client proposals and events. Working with Marketing and/or other office personnel, coordinate food and beverage services, reserve rooms and prepare materials.Interface and establish ongoing positive business relationships with clients in person, by phone and/or email. Observe confidentiality of lawyer-client relationship.Maintain lawyers’ contacts in Outlook and InterAction with accurate contact information and notes.Answer and screen calls, field inquiries, relay messages, respond promptly to client needs; responds to email and voicemail as soon as possible (and no later than the following business day).Create, format, edit, proofread and manage Word documents, Excel spreadsheets and PowerPoint presentations. Print and/or transmit via email as requested.Draft routine correspondence, forms, etc.Assist lawyers with Marketing and Business Development functions to include: Access marketing materials (lawyers’ biographies, brochures, practices at a glance)Print, collate and bind materials for use in meetings, pitches and proposalsCoordinate updates to lawyers’ biographiesUndertake Internet research for lawyers’ business development as directed by lawyer(s)Open new clients and matters following New Business Intake and Records Departments' procedures. Prepare conflict of interest forms.Perform routine filing, photocopying, scanning, faxing, compiling and distributing of documents. Identify and coordinate available services provided by administrative departments such as office services, finance, records. Follow-up on delivery and receipt acknowledgements.Maintain client, administrative and personal filing for lawyers following established procedures. Prepare files using Legal Key procedures and maintain appropriate records for on and off site storage.Coordinate domestic and foreign travel including hotel, flights, car rentals; prepare travel itineraries and materials for meetings during travel, important numbers, locations and contact names for events/meetings.Track, organize and process expense reports, reimbursements and check requests using Chrome River.Maintain CLE records for lawyers.Perform other related duties as required and assigned.Requirements:Bachelors degree preferred.Preferred work experience as an executive, administrative or project assistant.Preferred minimum typing speed of 65 wpm.Adapts to changes in work environment and manages competing demands.Strong technical, organizational and administrative skills.Exhibits sound and accurate judgment; supports and explains reasoning for decisions; includes appropriate people in decision-making process; and makes timely decisions.Proficient in Microsoft Office Suite (Word, Excel, PowerPoint), as well as proficiency in formatting documents using Styles.Availability to work overtime.King & Spalding LLP (K&S;) is committed to providing equal employment opportunity to all applicants and employees in full compliance with all state, federal, and local laws prohibiting discrimination on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, genetic information, age, disability or any other status protected by applicable law"}