{"jobID": "2830800806", "jobLocation": "Seattle_WA", "jobTitle": "Enterprise Architecture Intern", "companyRating": null, "companyInfo": {"Website": "www.f5.com", "Headquarters": "Seattle, WA", "Size": "1001 to 5000 employees", "Founded": " 1996", "Type": " Company - Public (FFIV) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Citrix, VMware, Juniper Networks"}, "estimatedSalary": null, "jobDescription": " Come work at a place where innovation and teamwork come together to support the most exciting missions in the world!  F5 IT Enterprise Architecture is seeking an intern for a six-month position.  An intern on the IT Enterprise Architecture team will participate in several initiatives and projects across F5’s IT organization in close partnership with other team members. The intern role will have the opportunity to assist with cloud enablement, maturation of continuous integration and development pipelines, generation and refinement of cross-organization roadmaps, incubation of nascent technologies, and incorporation of F5’s own products and services into IT application lifecycle.  You will work in a largely cooperative manner, being closely paired with other team members or others in the IT organization. You will gain experience in identifying priorities, effectively participating in projects in a manner that supports and extends the goals of team, department, and F5, and understanding F5’s business needs from an enterprise architecture perspective. You will be mentored by more-senior team members to guide successful completion of assigned work in a manner consistent with F5’s corporate principles and policies. What will you do?Strives to fulfill IT customers’ business requirements in alignment with corporate and IT strategies.Participates in assigned work with an emphasis on applying scholastic skills to a corporate environment.Develops growth and learning plan in conjunction with EA Director and assigned mentor(s).Work closely with Business Analysts in Enterprise Architecture and other teams to identify dependencies and develop analysis and reporting for existing projects and initiatives.Consult with and engage Subject Matter Experts (SMEs) as appropriate.Under the direction of senior team members, assist in the curation and incubation of emerging technology trends and business for identifiable and quantifiable benefit F5.Attend meetings as required.Responsible for upholding F5’s Business Code of Ethics and for promptly reporting violations of the Code or other company policies.Performs other related duties as assigned.Students should be/possess:An ideal candidate for the intern position should be enrolled in a Computer Science, Software Development, Information Systems, or a closely-related sciences or technical program.They would have successfully completed Data Structures and Algorithms or a comparable course.Approaching their Junior year or beyond at the time of the internshipAvailable for a 10-12 week internship between July 2018 to December 2018Ability to commit to 40-hours per weekExcellent collaboration and interpersonal skillsStrong communication skillsProficient in Microsoft Suite OfficeOrganized, with an ability to prioritize time-sensitive assignmentsExcellent problem-solving skills #LI-DC1  The Job Description is intended to be a general representation of the responsibilities and requirements of the job. However, the description may not be all-inclusive, and responsibilities and requirements are subject to change. Equal Employment Opportunity It is the policy of F5 to provide equal employment opportunities to all employees and employment applicants without regard to unlawful considerations of race, religion, color, national origin, sex, sexual orientation, gender identity or expression, age, sensory, physical, or mental disability, marital status, veteran or military status, genetic information, or any other classification protected by applicable local, state, or federal laws. This policy applies to all aspects of employment, including, but not limited to, hiring, job assignment, compensation, promotion, benefits, training, discipline, and termination. Reasonable accommodation is available for qualified individuals with disabilities, upon request."}