{"jobID": "2745064964", "jobLocation": "Redwood_City_CA", "jobTitle": "Intern: Corporate Legal", "companyRating": null, "companyInfo": {"Website": "www.equinix.com", "Headquarters": "Redwood City, CA", "Size": "5001 to 10000 employees", "Founded": " 1998", "Type": " Company - Public (EQIX) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Intern: Corporate LegalAbout Equinix Equinix (Nasdaq: EQIX) is the leading global interconnection platform and the world’s largest data center provider. With more than 170 data centers on five continents and $3+ billion in annual revenue, we dream big and hire people who want to help us build a historically significant company.  We are more than lawyers protecting Equinix’s interests. We are valued business partners, known as responsive, consistent and proactive. We take customer service seriously and strive for excellence in our execution. Equinix’s dynamic growth trajectory keeps us on our toes and constantly learning. Our strong relationships with our internal clients, fueled by our solution-driven orientation and creative yet practical advice, bring us to the table “early and often” and lead to interesting and rewarding work directly in support of Equinix’s strategy.  Our global legal team may span four continents, but we are One Legal - a true team working together across borders in support of our shared strategic objectives. We work hard but take time to celebrate our accomplishments – both professional and personal, with a healthy dose of fun thrown in along the way. We look forward to coming to work each day to support Equinix and each other and highly value the “team first” culture we have created. We are proud that our collective efforts led to Equinix One Legal being named as one of the Top Innovative Law Departments in North America by Financial Times (FT, December 2015). Opportunities We are looking for bright and enthusiastic law students who love to learn and want to make an impact on the world. Join the Equinix team and shape the future of cloud computing and enterprise connectivity at one of the Fastest Growing Technology Companies in America (Forbes).  As a Corporate Legal Intern on the Equinix Legal team, you will work closely with attorneys, systems analysts, and administrators on a diverse array of legal issues and tasks in the areas of compliance, contracts, privacy, intellectual property, employment, real estate, government affairs, and SEC filings. You will collaborate with our Legal team and business partners on projects designed to give you real-world, practical in-house experience in a rapidly growing technology company. Projects May IncludeCompliance training and supportContract review and negotiationLegal researchWork with various legal databases and systems used by in-house law departmentsParticipate in day-to-day operations of a global in-house legal team, including attending legal team and business meetingsPerform other tasks as need by the Legal Team and more!QualificationsCurrently completing 1st or 2nd year of a J.D. degree at an ABA accredited law schoolExcellent legal research, oral and written communication, problem-solving, interpersonal, and analytical skillsProficiency with Microsoft Office (Word, Excel, PowerPoint, Outlook)Ability to prioritize multiple tasks/projectsWell-organized and detail-orientedPositive attitude, integrity, initiative and professionalismTeam player"}