{"jobID": "2823636080", "jobLocation": "New_York_NY", "jobTitle": "Senior Graphic Designer", "companyRating": "3.8", "companyInfo": {"Website": "www.youvisit.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "76000", "jobDescription": " YouVisit is looking for a tech savvy Senior Designer to join our growing team! Youll be responsible for developing, elevating, and protecting the visual and language identity of YouVisits digital brand. In short, were looking for an all-star with a natural affinity for storytelling and flexibility to move between mediums. This role will be directly responsible for evolving our brand identity, improving the user experience at every stage, and producing high-quality web, print and VR designs that are unequivocally YouVisit.  Our small, nimble team needs someone who's motivated, resourceful and, above all, very creative and collaborative. We want a team player, someone with an unparalleled willingness to get down and dirty. For you? No task is too big or too small so youll crank out everything from banner ads to working with our studio team to shoot teaser videos and other marketing collateral. Most importantly, the entrepreneur inside of you understands how to translate business objectives into creative solutions and think conceptually to constantly generate new ideas. Were a startup after all.  What will your typical day be like?  Bring our story to life and add value to the customer experience through various marketing/communication channels, a strong online web presence and tradeshows presence.  Collaborate across multiple teams to showcase your design prowess on everything from beautifully designed emails, to website redesigns, to pitch decks, and marquis content promotional launches. Responsibilities:Own the look and feel of every element of the YouVisit marketing experienceWork across the org (including engineering and product) to ensure brand consistencyCreate all necessary wireframes, visual prototypes, and final design specificationQualifications:4 + years of prior experience leading designProven ability (and interest) to concept and execute strong web experiencesExceptional visual design, user experience design, and user interface design skillsGreat ability to seek and interpret feedback while expressing your own views and rationalesResponsive Design is your middle name and you understand how to optimize for multiple screen sizes: desktop, tablet, mobileRequired expertise with Adobe Creative Suite, especially Photoshop and Illustrator. No exceptions.Familiar with presentation software like Google Suite, PowerPoint, and PagesOverall comfort rolling up your sleeves and working in a fast-paced, fluid environment - handling multiple assignments, deadlines, and technologies at once.Past experience managing one or more direct reports is preferred.High level of initiativePERKS & BENEFITSComprehensive Healthcare Plan (Medical, Dental, Vision)401k PlanBi-Weekly Catered Team LunchQuarterly team outingsUnlimited Sick DaysPre-Tax Commuter BenefitsOffice Snacks, Cold Brew and lots of cool folks YouVisit is an equal opportunity employer."}