{"jobID": "2825120814", "jobLocation": "San_Jose_CA", "jobTitle": "Engineering Intern", "companyRating": "3.6", "companyInfo": {"Website": "www.8x8.com", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 1987", "Type": " Company - Public (EGHT) ", "Industry": " Telecommunications", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Avaya, Five9, RingCentral"}, "estimatedSalary": "59000", "jobDescription": " Job ID 2018-3550  Location US-CA-San Jose  Category R & D  About the Job JOB SUMMARY 8x8, Inc. a leader in the business communications services is developing next generation Cloud based unified communication technologies. To handle large scale of cloud based unified communication solution, it requires technology from just about every area of computer science, including distributed computing, large-scale system design, networking, database, security, user interface design etc. 8x8 Engineering is looking for Senior Software Development Technical Lead who have a strong passion for innovation, developing state of art communications software solution, solving complex and interesting problems, developing of SaaS and PaaS cloud solution. RESPONSIBILITIESBe part of a team working on building mission critical web services and applications.Write well designed, testable, efficient, reusable codeQUALIFICATIONSMinimum Qualifications:BA/BS in Computer Science or related technical field or equivalent practical experienceGood problem solving skills.Ability and willingness to learn new technologies.Speak and write English fluently and idiomatically. Preferred Qualifications (some of the following areas) Experience with relational database like MySQL and Non-sql db like hbase, mongodb or other big data solution like hadoop ecosystem with Storm, Hive, Flume, ZookeeperCore Java, NodeJS, Ruby, Python, Git, JSON. Multithreaded programming.Knowledge about network protocol like HTTP/HTTPS, SIP,SDP, RTP/RTCP, SRTP/SRTCP, TCP/IP and network programming, Java NIO etcKnowledge about asymmetrical and symmetrical cryptography standards including PKI, RSA, 3DES, AES, MD5, SHA-1/SHA-2, HMAC etc.About the Company ABOUT 8x8  8x8, Inc. (NASDAQ: EGHT) is the trusted provider of secure and reliable enterprise cloud communications solutions to more than 45,000 businesses operating in over 100 countries across six continents. 8x8's out-of-the-box cloud solutions replace traditional on-premises PBX hardware and software-based systems with a flexible and scalable Software as a Service (SaaS) alternative, encompassing cloud business phone service, contact center solutions, and conferencing.  In today's competitive market 8x8 continues to deliver service excellence, with a consistent, innovative, cohesive, progressive and dynamic culture.  For additional information, visit ***********, ************** or connect with 8x8 on LinkedIn,  Twitter, Google+ and Facebook Additional Information 8x8 is proud to provide equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics.  For 8x8 jobs located in the US: 8x8 participates in the E-Verify program.  View the Participant Poster in English | Espaol.  View the Right to Work Poster in English | Espaol.  Options"}