{"jobID": "2723100783", "jobLocation": "Santa_Clara_CA", "jobTitle": "Client Service Associate", "companyRating": "3.2", "companyInfo": {"Website": "www.edelmanfinancial.com", "Headquarters": "Fairfax, VA", "Size": "501 to 1000 employees", "Founded": " 1987", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "65000", "jobDescription": "Edelman Financial Services, one of the nation’s largest and most well-known financial planning firms, is seeking a skilledClient Service Associate for ourSilicon Valley (Santa Clara, CA) location. The Client Service Associate provides full support to one or more Financial Planner, ensuring client satisfaction through direct contact with clients, vendors, and other operational employees, while adhering to regulatory standards. Responsibilities:Executing investment buy and/or sell ordersAnalyzing reports to determine the appropriate action to be taken on behalf of client accountsResearching client issuesPreparing client documentsMaintaining filesGreeting clients in the officeGeneral office managementRequirements:2-5 years minimum of operational experience within the financial services industry; specifically in a broker/dealer or registered investment advisor environmentSeries 6 or Series 7, and Series 63 (or equivalent) required; or must be obtained within 6 months from the start of employmentBachelor’s degree or equivalent industry experience preferredMust have strong organizational and prioritization skillsAbility to work independently to research and resolve client issuesProblem solving skills to determine the most efficient method of problem resolution while complying with corporate and regulatory proceduresMust have an understanding of appropriate paperwork and procedures necessary to process transactionsClient services orientedStrong attention to detailMust be computer literate and proficient with Windows, Word, and ExcelAbility to multi-taskWork both independently and within a team For more information: www.edelmanfinancial.com EOE. A comprehensive background check may be conducted on applicants for this position. Edelman Financial has an employment at-will policy.  If you are interested in an exciting career with Edelman Financial Services, apply to this job posting at:https://www.edelmanfinancial.com/careers"}