{"jobID": "2662722661", "jobLocation": "Cambridge_MA", "jobTitle": "Energy Storage Intern", "companyRating": null, "companyInfo": {"Website": "www.lockheedmartin.com", "Headquarters": "Bethesda, MD", "Size": "10000+ employees", "Founded": " 1995", "Type": " Company - Public (LMT) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Boeing, Northrop Grumman, Raytheon"}, "estimatedSalary": null, "jobDescription": " This is a full-time (40 hrs/wk) internship, beginning in January 2018 and ending in June 2018. The candidate will work with Research Scientists and Engineers to develop and test all aspects of our technology. The candidate must be comfortable working in both a wet chemical laboratory environment, and a fabrication/prototyping shop. The candidate will be expected to plan experiments, set up and de-bug instruments, collect and analyze data and report results to their team and management. Basic data reduction skills are required, as well as the clear documentation of test conditions and outcomes. The candidate will also support engineering staff in the design, part procurement, build, and operation of automated test equipment.  Lockheed Martin Advanced Energy Storage (LMAES) is focusing on the development of transformational renewable energy storage technologies that will enable renewable energy sources, such as solar and wind, to power our society anywhere, anytime, and at low cost. We are a small, development arm of a mature organization located in Cambridge, MA close to the Alewife T station.  Basic Qualifications  Currently enrolled in an accredited degree program pursing a Bachelor's or Master's degree in Chemical, Mechanical, or Electrical engineering, or Chemistry, electrochemical, materials science research, or related discipline.  Desired skills  The candidates will have atleast one of the following:  1) hands-on experience in wet chemical techniques OR  2) The design, setup, operation, and troubleshooting of test fixtures OR  3) Knowledge of basic electrical systems for test stands and related data acquisition is highly desirable OR  4) Knowledge of fluidic interfaces and related data acquisition is highly desirable.  In addition, individuals must be flexible, able to adapt to a fast-paced, dynamic work environment, and able to work independently and as part of a group.  Experience in the use of standard laboratory analytical equipment is highly desirable.  Experience working with other engineers both internally and externally to source and test electric and mechanical components is required.  Hands-on experience in assembling prototypes/components.  Programming experience in MATLAB, Labview, and/or Excel VBA, and experience in Solidworks, AutoCAD, or other related software.  Strong interest in renewable energy technologies  Minimum 3.0 GPA Requirement  As a leading technology innovation company, Lockheed Martin’s team of 113,000 people works with partners around the world to bring proven performance to our customers’ toughest challenges. Lockheed Martin has employees based in all 50 states and more than 570 facilities that span 70 countries.  Join us at Lockheed Martin, where we’re engineering a better tomorrow. Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, protected veteran status, or disability status. Job Location(s): Cambridge Massachusetts"}