{"jobID": "2829385005", "jobLocation": "Redmond_WA", "jobTitle": "Data Scientist (Sql, Hive, Dax )", "companyRating": "3.6", "companyInfo": {"Website": "www.tcs.com", "Headquarters": "Mumbai, India", "Size": "10000+ employees", "Founded": " 1968", "Type": " Company - Public (TCSN) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Accenture, IBM, Infosys"}, "estimatedSalary": "112000", "jobDescription": " Data Scientist (SQL, SSRS, SSIS, TFS, R, SAS, SSAS)  Detail of Requirement Data Analyst / Data Scientist  Role Data Scientist (SQL, SSRS, SSIS, TFS, R, SAS, SSAS)  Summary A Bachelor's or Master's degree in Computer Science or related field  Responsible for developing, interpreting and implementing data models.  End to end implementation, execution, business insight and analytics  Perform cost/benefit/risk analysis and complex design analysis  Experience working with big data and real time/near real time analytics and big data platforms SQL Server, SSRS, SSIS, TFS, R, SAS, SSASMap Reduce/Hive, Cosmos ML. Knowledge of C Mandatory Technical Skills • Knowledge on Power BI, Tabular Cubes, DAX is an added advantage Visualization skills using SSRS, Power BI etc. Desirable Technical Skills • Knowledge of SQL Master Data Services Ability to understand vast amounts of data, identify and fix data issuesExperience in building and maintaining enterprise level Power BI Tools is added advantageStatistical Modeling Mandatory Functional Skills • Excellent technical&analytical; skills with strong business acumen Experience in enterprise level datasets, strong technical skillsData Warehousing Principles, ReportingPassion to drive improvement in the overall customer experienceCustomer focused / user empathy skillsExperience working within a geographically-dispersed teamExperience working across multiple groups and teams Desirable Functional Skills • Be self-critical and have an accountable work approach  Total Experience Required 6 + years"}