{"jobID": "2670074820", "jobLocation": "Seattle_WA", "jobTitle": "Senior Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.washington.edu", "Headquarters": "Seattle, WA", "Size": "10000+ employees", "Founded": " 1861", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "96000", "jobDescription": " As a UW employee, you will enjoy generous benefits and work/life programs. For detailed information on Benefits for this position, click here. As a UW employee, you have a unique opportunity to change lives on our campuses, in our state and around the world. UW employees offer their boundless energy, creative problem solving skills and dedication to build stronger minds and a healthier world.  UW faculty and staff also enjoy outstanding benefits, professional growth opportunities and unique resources in an environment noted for diversity, intellectual excitement, artistic pursuits and natural beauty. All of which has allowed the UW to be nationally recognized as a \"Great College to Work For\" for four consecutive years.  Finance & Administration (UW-FA) is the largest and most diverse administrative units supporting UW. UW-FA is led by the Executive Vice President of Finance and Administration (EVPFA) and encompasses all major business functions including Controller, Capital Projects and Development, EVPFA, Enterprise Services, Facilities, Human Resources, HR/Payroll Modernization, Internal Audit, IT, Internal Service Center, Strategic Consulting, and Treasury. From investment, research grant-management, purchasing, parking, mail and transportation services, to maintenance, landscaping and custodial support, UW-FA's hallmarks are reliability, customer focus and efficiency across all activities and programs.  UW-FA has an outstanding full time opportunity for a Senior Analyst.  Please note: this recruitment will be used to fill two openings.  The senior analyst is responsible for high-level financial data management and analysis with primary focus on leading financial analysis for the Office of the EVPFA and all reporting units. Working closely with the Director of Finance & Administration (DFA), the senior analyst requires excellent skills in gathering, analyzing, and reporting financial data, often originating from multiple sources. This position is an integral member of the EVPFA team and must be adaptable, flexible, and able to manage a high volume of work. Position requires an innovative, creative, highly motivated, team-oriented individual. Requires a proactive and positive business approach focused on meeting current and future needs where data and knowledge derived from data will play a critical role in executive level decision making. The senior analyst must meet challenges with resourcefulness and innovation, respond effectively when dealing with tight deadlines, and work proactively. RESPONSIBILITIES: Analyst  High level analyst position responsible for financial data management and analysis with primary focus on supporting UW-FA leadership. Requires excellent skills in gathering, analyzing, and reporting financial data, often originating from multiple sources. Position requires an innovative, creative, highly motivated, team-oriented individual. Requires a proactive and positive business approach focused on meeting current and future needs where data and knowledge derived from data will play a critical role in executive level decision making. Basic functions and responsibilities:Use advanced features of applications such as Excel, SQL Server analysis tools, Tableau, Access and/or other similar applications to extract and analyze large volumes of data, to include formatting to suit various audiences.Use UW administrative system tools including, for example, MyFD, Workday, and Office of Planning & Budgeting database, and the Enterprise Data Warehouse to extract and download system data for analysis.Work collaboratively with process partners, peers and leaders. Oversee and deliver data extraction and analysis to the EVPFA.Primary partner in developing financial pro forma for multiple units across UW-FA. Quarterly to Yearly report out to EVPFA, CoS, VPs, and AVPs:Requires detailed knowledge of data mining within UW Financial System and in-depth understanding of how to interpret and use data to produce viable and accurate financial reports.Requires the ability to work collaboratively and in partnership with VP/AVP and Director level positions across UW-FA, and ability to take the lead in guiding other analysts.Requires deep knowledge of UW funding sources to analyze total sources and uses of funds across an array of UW-FA units that have varying operational models.Requires the ability to work independently to research key contractual obligations and stability of funding sources to make recommendations to CoS and VP/AVPs regarding maximizing resources.Requires in depth knowledge of software programs to maintain document credibility.Requires the ability to provide holistic financial review of AVP's and VP's units.Lead efforts in the creation of UW-FA Annual Budget Package for submission to the Provost, including collecting financial information to support narrative and oversight of format and text editing.Heavy involvement in organizational wide process and policy changes. This may include managing salary increases, developing auditing and reporting to provide to VP/AVP and Director Level to inform of changes and/or impact to bottom line.Significant involvement in the annual merit increase process.Manage and modify existing database applications and other programming applications as needed. Develop reports and present data for special projects as assigned.Oversee budgetary responsibilities for special project funds. Responsibilities include understanding the business purpose, strategy, and drivers for each project and working with managers to develop pro forma budgets, review variance reports, and manage on-going expenditures.Assist UW-FA leadership to implement any re-org activities related to budget and procurement.Assist UW-FA leadership in developing and implementing dashboard, key business and financial metrics and/or productivity platforms. Payroll and Fiscal Oversight and Special Projects Provide leadership for procurement related activities across UW-FA; payroll, time and leave tracking, purchasing compliance, and budget reconciliations as directed by Director of Finance & Administration. These duties may include:Lead implementation of payroll increases and funding changes (e.g., increases, decreases, permanent, temporary), in Workday and BGT as appropiate.Provide oversight to ensure departmental processes and procedures are in compliance with UW Records Retention Policies.Develop sophisticated tools that enable automating formally manually processes and increase departmental efficiency.Provide fiscal leadership to program initiatives including tracking of sponsorship commitments, cash transmittals, expense transfers, and providing reporting of fund balance.Manage ARIBA process for EVPFA unit and provide assistance to other UW-FA units. Responsible for ASTRA delegation and training of new staff as appropriate.Lead effort in the coordinating and management of SharePoint and OneDrive group access, communication, policy and procedure development for EVPFA.Continually identify opportunity for improvement or gaps in business processes across UW-FA, especially within EVPFA. Work to develop and implement process improvements.Special projects as assigned.Supervisory Responsibilities: Coordinate work of other Analysts and oversee Student Interns. REQUIREMENTS:Bachelor's Degree in finance, accounting, business or related field and 5 years' experience solving complex fiscal problems.Strong data mining skills.Demonstrated experience in analyzing and presenting financial information originating from multiple, large volume sources, using basic statistical methods where needed.Strong data mining skills.Demonstrated experience using advanced spreadsheet, database, and other technology applications for financial and administrative purposes.Working knowledge of financial planning, basic accounting, reconciliation and monitoring of expenditure cycle times, spending patterns and forecasting.Excellent oral and written communication, presentation, and analysis skills.High degree of professionalism, integrity and ownership needed; must be customer-committed and results-oriented.Experience with Lean or other process improvement technics highly desirable.Computer skills: highly proficient in a variety of financial and database management software applications including Excel, Access, Tableau, and SQL Server Visual Studio. Proficient in the full Microsoft Office suite of application including desktop and Office365 version. Equivalent education/experience will substitute for all minimum qualifications except when there are legal requirements, such as a license/certification/registration. DESIRED:MBA and/or CPA desiredFamiliarity with a variety of UW systems and policies, especially related to budgets, payroll/HR, procurement, travel (BGT, Workday, OPUS, OWLS, MyFD, EDW & Financial Cubes).CONDITIONS OF EMPLOYMENT:Application Process: The application process for UW positions may include completion of a variety of online assessments to obtain additional information that will be used in the evaluation process. These assessments may include Work Authorization, Cover Letter and/or others. Any assessments that you need to complete will appear on your screen as soon as you select \"Apply to this position\". Once you begin an assessment, it must be completed at that time; if you do not complete the assessment you will be prompted to do so the next time you access your \"My Jobs\" page. If you select to take it later, it will appear on your \"My Jobs\" page to take when you are ready. Please note that your application will not be reviewed, and you will not be considered for this position until all required assessments have been completed.SDL2017"}