{"jobID": "2759186324", "jobLocation": "San_Jose_CA", "jobTitle": "Respite Care Coordinator", "companyRating": null, "companyInfo": {"Website": "www.unitycare.org", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 1993", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job Title  Respite Care Coordinator  Position  ID 27063108 Duration  Location  San Jose,  CA 95110 Other Location  DescriptionAbout Unity Care Our mission is to provide quality youth and family programs for the purpose of creating healthier communities through lifelong partnerships. Headquartered in San Jose, with incredible weather, culture and sports, and the SF Bay and ocean just minutes away. Unity Care offers a wide range of services benefiting at-risk and foster youth and their families throughout Northern California. Its signature program, established in 1993, focuses on serving the housing needs of youth in foster care and beyond. The organization provides more than two dozen community-based, education and behavioral health programs, transforming the lives of over 6,000 youth and families annually. We are proud to have one of the most ethnically and culturally diverse workforce in the Bay Area. We have a friendly, servant-leader culture with significant growth opportunities. OVERVIEW: The Respite Care Coordinator activities will focus on providing support and coordinating Respite for Resource and Kinship Care families in order to stabilize and maintain children in their current placement. This position will support Santa Clara County Resource and Kinship Care families with children who are currently receiving services from DFCS and are placed in out-of-home care. All services will be provided in a manner that best meets the needs of the Resource and Kinship Care Family. These services will be made available to foster/adoptive, guardian, relative and non-relative families as issues arise and when Respite Care is needed. These services will be provided using, but not limited to: phone, mail, e-mail, home visits, appointments, meetings, and group functions. Location and hours of work will be scheduled on an as needed basis and may include evenings and weekends. Part time position Mon-FriDIRECT REPORTS:NoneQUALIFICATIONS:RequiredEducation, Training, and Experience. Completed course work equivalent to a Associates Degree.Have knowledge of the culture of the families they serve.Must have experience in working with the community.Skills in crisis intervention, safety, conflict resolution, and interpersonal communication.Good public speaking skills.Strong computer experience with MS Word, Excel.License(s). California driver’s license and ability to be insured by agency insurance carrier.Must be fingerprinted and pass a background check.Must be CPR trained and certified, including pediatrics.Must pass TB testExcellent time management skills.Case Management and billing knowledge.Knowledge of best practicesAbility to think creatively and intervene/respond in crisis situations.Ability to access and coordinate resources, and to learn processes of referral and linkageAbility to coach and mentorFluent in Spanish speaking, reading and writingPreferredSpeak, read, and/or write another language fluently, with a demonstrated ability to work with diverse ethnic populations a plus.Knowledge of the Foster Care systemRESPONSIBILITIES INCLUDE (but not limited to):Provide information and support for all resource families in need of respite care.Outreach to resource families and to Social Workers.Facilitate communications between resource families and Social Services Agency staff.Evaluate, monitor, and make recommendations regarding respite providers to resource families.Intervene and advocate as needed, when issues arise for resource families.Maintain updated information on current department policy and practices pertaining to children in out-of-home care.Maintain knowledge on respite care guidelines and approval/licensing criteria and policies.Maintain knowledge of Federal and State Laws related to foster parents.Maintain an understanding of the Prudent Parent Standard. Availability to support resource families by telephone, mail, email, text, and in-person as needed.Participate in staff training on issues that relate to resource families.Participate in county meetingParticipate and/or conduct home visits with previous approve by Program Manager or Program Supervisor.Meet regularly with other resource team members to coordinate services, establish effective communication and share critical information about respite.Coordinate with Title IVE trainer with West Valley to schedule trainings for all resource families.Update all forms and respite guidelines when needed.Work with Accounts Payable at DFCS and contract monitor when issues ariseMaintain good communication with the Licensing/Approval workers when issues arise with a resource family.Maintain a monthly audit to keep accurate records of county respite funds.Maintain accuracy on all Respite Care reports which includes but not limited of the Respite Care Providers ListMaintain updated information of clients in Awards on a daily basisComplete notes and upload forms in Awards in a daily basisCompensation We maintain a collaborative learning environment where people are challenged, grow, and have fun. We offer highly competitive compensation and an excellent benefits package, including generous time off, health and dental benefits, and 403b contribution. Unity Care is an Equal Employee Opportunity employer.  Please send a resume and cover letter to: vhamberry@unitycare.orgOpenings  1"}