{"jobID": "2720590691", "jobLocation": "Sunnyvale_CA", "jobTitle": "Intern Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.oath.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": " Oath, a subsidiary of Verizon, is a values-led company committed to building brands people love. We reach over one billion people around the world with a dynamic house of 50+ media and technology brands. A global leader in digital and mobile, Oath is shaping the future of media.A little about Oath Oath, a subsidiary of Verizon, is a values-led company committed to building brands people love. We reach over one billion people around the world with a dynamic house of 50+ media and technology brands. A global leader in digital and mobile, Oath is shaping the future of media. Our missionBuild brands consumers loveBuild platforms customers loveBuild a company talent lovesA Little About Us Our engineering teams are focused on delivering the best products across Search, Mail, Mobile, Homepage, Sports, Daily Fantasy and Finance just to name a few, and we have fun while we do it. Our team structure encourages trust, learning from one another, having fun, and attracting people who are passionate about what they do.  The advertising science team at Yahoo Research is looking for summer interns with great machine learning skills to help in solving the next generation of problems in advertising and understanding user behavior. You'll be working with some of the world's most recognizable brands (like Yahoo.com, Yahoo News, Tumblr, Yahoo Mail) and with humongous amounts of data. The candidates should be in a PhD program (preferably second year and above); prior experience in deep learning models, reinforcement learning, and sequence prediction, especially at scale, is a big plus. We also encourage publishing at top tier conferences. Your DayDesign, develop, code and test software systems or applications for software enhancements and new products; revise and refine as requiredParticipate in agile development of project timelines, implementation design specifications, system flow diagrams, documentation, testing and ongoing support of systemsRecommend modifications to processes and procedures, and contribute to best practices, architecture, and implementationsPromote and solicit ideas within project teamsYou Must HaveActively pursuing a BS, MS, or PhD in Computer Science or related major, and strong record of academic achievementKnowledge of software engineering processes, tools (e.g.: programming proficiency in a language, preferably Java, C/C++, methods, test development, support, algorithms and data structureFamiliarity with object-oriented programming concepts, large-scale software architecture, networking and distributed systems, and UNIX/Linux environmentsExperience in one or many of the following is a plus:Front-end language: HTML, CSS, JavaScript, Node.JS, JS Framework (React and Ember)Back-end experience (Grid, Hadoop, etc.)Familiarity with Perl, PHP, Python, Ruby, LAMPExperience building or maintaining databases (Oracle, mySQL, Hive, etc.)Cross-browser, cross-platform codingSecurityLarge-scale, large-user base website development experienceData mining, machine learning, AI, statistics, information retrieval, linguistic analysisStrong mathematical backgroundInternship experience at a tech company Oath is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on, age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Oath is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. Please let us know if you need a reasonable accommodation to apply for a job or participate in the application process.  Currently work for Oath? Please apply on our internal career site. ​"}