{"jobID": "2707210555", "jobLocation": "Boston_MA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.comlinkdata.com", "Headquarters": "Boston, MA", "Size": "1 to 50 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Data AnalystReports to: Director of Data Operations Location: Boston, MA  Comlinkdata is seeking a quantitative, critical thinker with an insatiable curiosity to join the Data Operations team as a Data Analyst. The Data Operations team is a critical component of Comlinkdata. They ensure our data is validated, the platform is working correctly and they explore opportunities to leverage new data sets to improve and create new products.  The Data Analyst will support the Data Operations team by gathering data, analyzing ad hoc reports, providing quality assurance and working jointly with the Client Services team to investigate data abnormalities. This candidate should be interested in working with large data sets in an “R&D; skunkworks,” product development environment. Responsibilities Including, but not limited to: Analyze and interpret data using statistical and business modelsIdentify correlations and trends in data, in addition to internal and external factors that could affect the results of our informationProvide input on how to integrate additional data sets from independent sources we can use to leverage our existing dataCollaborate with colleagues on ad hoc projects within the data science teams (Data ops and R&D;)Validate data daily using external data and research (quantitative and qualitative)Troubleshoot data issuesCandidate Profile Required Skills 0– 2 years of work experience (or comparable educational experience) in quantitative analysisProficient in Excel and SQLExperience business and statistical modelingStrong critical thinking and problem solving skillsCreative and independent thinker with a desire to learn new technical skillsSuccess at working on cross-functional teams to meet a common goalSelf-starter with a high sense of urgencyAbility to prioritize in a multitask environment Desired Skills Knowledge of PYTHON and VB a plus (or willing to learn)Knowledge of R, S-Plus, SAS, Stata, Gauss or Matlab a plus (or willing to learn) Please submit a resume and cover letter to joinus@comlinkdata.com.  At this time, Comlinkdata will not sponsor a new applicant for employment sponsorship for this position."}