{"jobID": "2494510545", "jobLocation": "Boston_MA", "jobTitle": "Lead Software Engineer", "companyRating": null, "companyInfo": {"Website": "www.klaviyo.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Engineering at KlaviyoKlaviyo is a Boston startup located right in the heart of downtown Boston. We craft software helping thousands of ecommerce companies to have engaging relationships with hundreds of millions of consumers. We love tackling tough engineering problems, and push each other to move out of our comfort zone, learn new technologies and work hard to ensure each day is better than the last. We seek out full stack engineers who specialize in certain areas but are passionate about building, owning & scaling new features end to end. We relish breaking through obstacles & technical challenges and moving continually faster.Klaviyo is looking for Lead Software Engineers to own core areas of our platform: guiding the technical architecture and engineering teams in areas such as:Product Experience - Owning and optimizing the frontend experience of the Klaviyo app in conjunction with the Product team, ensuring existing features remain best-in-class while continually launching new capabilities allowing marketers to easily make data-driven decisions, and send targeted communication, powered by Klaviyo.Integrations - Operating a reliable and scalable system to handle the chaotic world of 3rd party integrations. Klaviyo integrates with 50+ discrete 3rd party platforms hitting tens of thousands of unique API endpoints on the web daily. Were continually pulling billions of data points monthly, and are looking for a polyglot lead to manage our extensions and integrations.Analytics & Segmentation - Scaling a data pipeline & storage system already processing billions of events and doubling year over year. Klaviyo is challenged to perform real-time segmentation of hundreds of millions of users, enabling Klaviyo teams and our customers to answer complex queries in fixed time to gain insight.We have no pure people managers at Klaviyo and we expect everyone to be very technical -- this means everyone is coding down from the CEO, to the VP of Engineering and team leads. Lead Engineers are expected to spend the majority of their time coding while also working to level up the engineers on their team. Opportunities are available both for Lead Engineers that want to manage team members and grow in people management skills and responsibilities, as well as those that strictly desire to progress on a technical leadership track.You Will: Have the chance to wholly own features that thousands of our customers rely on daily to reach 100,000,000+ of consumers to drive their business forward.Work on crafting our highly scalable real-time data pipeline that processes billions of events monthly across data sets growing to petabyte scale.Lead your team by example, working with them to level up their code quality through code reviews and 1on1 mentorship, creating & vetting technical architectures, and writing code yourself that raises the bar for Klaviyo engineering.Be empowered to own the mission, technical direction and operations of projects that have immediate impact.Advance your technical skills in all facets ranging from front end web development and user experience to machine learning and massively parallelized data pipelines.Contribute to the company as a subject matter expert in multiple areas, constantly pushing yourself to be a better engineer and to level up all of your peers within your team and within Klaviyo.You:Have 5+ years of experience building products that matter and pushing yourself and your team to be better engineers and build a product with passionate advocatesHave proven that you can build & scale complex distributed systems including solving problems in sustainable ways, balancing pragmatic development with ideal architecture, breaking through technical obstacles with vigor, and leading teams through crises by working side by side with them in the trenches.Enjoy working with new technologies ranging from the frontend to backend, and are particularly passionate and an expert in multiple stack areas. You show this by having strong and opinionated experience with various technologies and know how to pick the right tool for any job.Love digging into performance and scalability issues to drive breakthrough solutions--whether it's a slow loading UI or too many clicks in a workflow, a database query timing out, or a queue that just wont drain. You recognize all problems can be solved.Enjoy shipping code early & often in an agile fashion, pairing with product management to craft better software by soliciting feedback from thousands of end users.Like working on a small, autonomous agile teams. At Klaviyo, you will have ownership of features, but you'll collaborate with everyone to make sure we produce the right solution.Technologies We Use:Klaviyo operates a real-time data platform coded in Python built for massive scale on Amazon Web Services (AWS). Engineers come to Klaviyo with experience in a variety of languages and from a number of disciplines. The core Klaviyo platform is comprised of the following components that all engineers are expected to become extremely proficient:Python, Django, CeleryMySQL, Cassandra, RabbitMQ, RedisHTML, JavaScript, LESS, Backbone.js, ReactAmazon Web Services (EC2, RDS, Aurora, etc.)Terraform, Ansible, Packer, and other DevOps toolsLead Engineers are expected to bring to Klaviyo subject matter expertise and demonstrate adaptability by continuing to acquire and master new skills, level up all those around them, and research and prototype new technologies and solutions to help scale Klaviyos systems and product capabilities.Problems Were Solving:As a high growth startup we look for candidates that can rise to any occasion and seek out new opportunities to make their mark on our product. The following are examples of exciting projects the engineering team is working on:Scaling our data processing systems to handle orders of magnitude more data and perform advanced analytics of billions of events in real time by innovating on event-driven data pipelines and building robust distributed data storesOverhauling our frontend interfaces to dramatically increase information density and capabilities of our analytics and reporting system. We will enable powerful, expressive and flexible querying of our data sets without compromising the ease of use of the experienceReliably integrating with 10s of thousands of remote API endpoints to process ecommerce data for historical and real-time syncsExtracting additional insight from our data sources using machine learning and other data science techniques to allow ecommerce marketers to more efficiently perform their jobs and grow their business, and build features into Klaviyo product to make it incredible easy for marketers to follow best practicesAbout KlaviyoKlaviyo is a team of people who are crazy motivated by growth.Its what we help our customers do: grow their businesses by making it possible and easy for them to use their data to power better marketing.Its how we behave as individuals: were all deeply passionate about learning.Its how we manage our business: we have thousands of paying customers, were profitable, and were growing insanely fast.And its what our culture is all about. Working at Klaviyo means youll work on things you never imagined you would; youll grow in ways you didnt consider possible; and youll do the best work of your career with people who are just as motivated and talented as you are.Your curiosity has led you this far, so if this sounds like your ideal place to work, please apply!"}