{"jobID": "2746212708", "jobLocation": "Mountain_View_CA", "jobTitle": "Security Officer w/ Hiring Bonus", "companyRating": null, "companyInfo": {"Website": "www.xccommand.com.my", "Headquarters": "Petaling, Malaysia", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Command Security Services LP, a licensed private security company is immediately hiring full-time and part-time Security Officers at competitive rates with benefits. We are a security company dedicated to providing superior uniformed security personnel and services to our clients. We offer expertly trained, licensed security professionals to help our clients keep people, property, and information safe and secure.  General Statement of Job:  Security Officers ensure that the client, its associates, and facility personnel are provided with a safe and professional working environment. The Security Officer will patrol an assigned zone by foot, enforce client policy and regulations, and investigate all facility-related incidents. The Security Officer reports to the Security Supervisor.  Specific Duties and Responsibilities Provide excellent customer service to the client, its associates, and facilities personnel.Patrol assigned post on foot to maintain visibility and observe possible unusual activity.Investigate and report maintenance and safety conditions which might endanger client, its associates, or public safety - including fires, evacuations, hazardous situations, or other facility related events. Provide assistance to client personnel as needed.Respond to all requests for assistance relayed by Supervisor or client; complete various company or client assignments as required; submit reports to a superior officer.Responsible for ensuring that all employees, suppliers, and visitors on company property have proper company-issued identification.Ensure that daily administrative documentation is kept concise and complete at all times; maintain all daily assigned equipment in functional and presentable condition.Perform other related duties as required. Minimum Training and Qualifications Must have high school diploma or GED.Must have a valid BSIS issued Guard Card/License.Must be able to sit and/or stand for long periods of time and climb stairs.Must have basic computer, administrative, and report writing skills.Must be able and willing to work with minimal supervision.Must be able to handle stressful situations and emergencies.Must be able to read, write, and speak English clearly. Compensation for Security Officers: Starting pay is $17 for most positions; $18/hr for SOC shifts, $19/hr for supervisor shifts$300 Hiring BonusEligibility for annual merit pay increases for performance.Health insurance coverage options (30+ hours).Paid time off (work 32+ hours).401k Retirement Savings Plan with company matchAffirmative action employer. All qualified applicants will receive consideration for employment without regard to race; color; national origin; religion; sex (including pregnancy, childbirth, and related medical conditions); disability (physical or mental); age (40 and older); citizenship status; genetic information; ancestry; gender identity and gender expression; AIDS/HIV; medical condition; political activities or affiliations; status as a victim of domestic violence, assault, or stalking; or status as a protected veteran."}