{"jobID": "2645522950", "jobLocation": "Boston_MA", "jobTitle": "Radiation Health", "companyRating": null, "companyInfo": {"Website": "www.navy.com", "Headquarters": "San Diego, CA", "Size": "1001 to 5000 employees", "Founded": " 1775", "Type": " Government", "Industry": " Government", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " \"About This JobNavy Radiation Health Specialists are health and safety experts responsible for all aspects of an occupational radiation protection program. They apply clinical medical physics expertise in diagnostic radiology and ensure compliance with Navy, Department of Defense and federal regulations.They also: Plan, direct and administer radiation protection programs Recommend appropriate radiation control measures  Act as the liaison between the Navy and other services and federal agencies Assist physicians in disease diagnosis and treatment Provide formal instruction and on-the-job training in radiation health programsAs a Radiation Health Specialist, you could: Serve as an instructor in a number of training programs for technicians, Radiation Health Officers, nurses, physicians and medical students Become eligible for leadership and management opportunities in medical and nonmedical programsNavy Health Care Specialists may serve at any one of more than 250 Navy and medical facilities around the globe, from Hawaii to Japan, Germany to Guam, and Washington, D.C., to Washington state.As a Radiation Health Specialist, you could work at one of the highly acclaimed National Naval Medical Centers in Bethesda, Md.; Portsmouth, Va.; and San Diego, Calif. Or you could provide support aboard one of two dedicated hospital ships: the USNS Comfort and USNS Mercy.More opportunities are available stateside and abroad in a variety of settings. Serve on a nuclear-powered aircraft carrier or at nuclear-capable shipyards and repair facilities, medical treatment facilities, and industrial and research facilities such as the Naval Surface Warfare Center (NSWC)Upon graduation from college, those pursuing a Radiation Health position are required to attend Officer Development School (ODS) in Newport, R.I. ODS is a five-week program that provides a comprehensive and intense introduction to the responsibilities of Navy Staff Corps Officers. Here they learn about the military structure of the U.S. Navy, its rich history of traditions and customs, leadership development and military etiquette.Promotion opportunities are regularly available but competitive and based on performance.\""}