{"jobID": "2828478627", "jobLocation": "Everett_MA", "jobTitle": "Testing Coordinator & Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.pioneercharter.org", "Headquarters": "Denver, CO", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " School / School District", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Pioneer Charter School of Science (PCSS), a high performing charter school with two campuses just north of Boston, is searching for hardworking, dedicated, creative and innovative Test Coordinator and Data Analysis Person. The responsibilities include: Coordinate, plan and disseminate of school wide testing calendar.Maintain student test records, test materials inventories and test data.Prepare required testing reports.Provide appropriate testing accommodations as outlined in the cumulative record (IEP, ELL, 504, etc.);Plan and coordinate all school site testingPrepare a school wide testing calendarPrepare a detailed testing schedule for all assessmentsCollect and deliver all test materials to appropriate scoring center in accordance with reference guides;Analyze and provide appropriate data to various school sites and district personnel which includes the following assessments: Benchmark Exams in all core subjectsFinal Exams in all core subjectsCollect data and analyze resultsMeet with low performing studentsManage intervention programsPractice Tests for State Exams (PARCC, MCAS etc.)Practice AP ExamsPractice SAT ExamsPSAT Tests Any other standardized tests given throughout the yearMaintain an ongoing dialogue with regards to testing calendar and schedulingProvide test materials ( Test Booklets, Answer Booklets, Answer Sheets) for teachers during assessmentsProvide training to new staff member on using schools testing moduleAssist Dean of Academic with data entry to the databasePreparation of other testing not on Schedule: Accuplacer, Star, etc. Coordinating and Scheduling Academic Contests in School ( MathCounts, AMC, Math League)Test Item Preparation ( Exam View Test Banks for all Subjects)More responsibilities can be assigned at Dean of Academics discretion."}