{"jobID": "2784696730", "jobLocation": "New_York_NY", "jobTitle": "Research Fall Intern", "companyRating": null, "companyInfo": {"Website": "www.imre.com", "Headquarters": "Sparks Glencoe, MD", "Size": "51 to 200 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "PositionResearch Fall InternPosition TypeInternLocationBaltimore Apply NowWe are seeking motivated college students for a paid fall internship with our research team. Ideal candidates will be in their junior or senior year, majoring in Marketing, Math/Statistics, Psychology, Communications or Computer Science. The opportunity involves assisting our market research team with both primary and secondary research projects, and gaining experience working with both quantitative and qualitative methodologies. Interns will get to see how market research is used as the foundation to provide strategic and actionable insights that drive client campaigns and programs.Requirements:o You are passionate about problem solving  o You are comfortable working with data and interested in seeing how data is turned into insights  o You are passionate about research, particularly uncovering insights related to audiences and products  o You work well in a collaborative team setting  o You are results driven, guided by principles and best practices, and thrive in a fast-paced environment  o You are a creative problem solver, and pay attention to detail  o You have good written and oral communication skills imre expectations for interns include: o Related academic course work  o A time commitment of 16 hours per week  o 12 week program  o A positive, team attitude  o A desire to learn and grow as an aspiring professional  o Punctuality and dependability  o Notice, as soon as possible, concerning absences Working Conditions: Normal office environment, where there is no physical discomfort due to temperature, dust, noise, or smoke.  imre is an equal employment opportunity employer. Employment decisions are based on merit, qualifications, abilities and business needs. imre does not discriminate in employment opportunities or practices on the basis of race, color, citizenship status, national origin, ancestry, gender, sexual orientation, gender identity, age, religion, creed, physical or mental disability, marital status, veteran status, genetic information or any other characteristic protected by law. This policy governs all terms and conditions of employment, including selection, job assignment, compensation, discipline, termination and access to benefits and training."}