{"jobID": "2768355669", "jobLocation": "Boston_MA", "jobTitle": "Data Scientist", "companyRating": "4.2", "companyInfo": {"Website": "www.vectranetworks.com", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "124000", "jobDescription": " Vectra Networks delivers a new class of real-time threat detection and advanced analysis of active network intrusions. Vectra Networks picks up where perimeter security leaves off using AI to provide deep, continuous analysis of both internal and Internet-facing network traffic for all phases of the attack progression as attackers attempt to breach, spy, spread, and steal within networks.  Vectra directly analyzes network traffic in real time using combination of patent-pending data science, machine learning, and behavioral analysis to detect attacker behaviors and user anomalies in the network. All detections are algorithmically correlated and prioritized to show an attack in context, and Vectra Networks' machine learning adapts as attacks evolve.  Position Overview:  Apply cutting edge machine learning, artificial intelligence, and modeling techniques to stop hackers in real time as they attack networks. As part of the data science team you will directly impact the product by developing and implementing the core algorithms that detect malicious and anomalous behaviors on the network.  Requirements: MS/PhD in Computer Science, Engineering, or similar computational discipline, e.g. physics, mathematics, or statistics (or equivalent experience)Strong machine learning and/or statistical modeling expertise with experience applying the techniques to real world problemsPython programming experienceComputational programming experience: R, Python/Pandas, Matlab/Octave Desired Experience: TensorflowObject oriented programming, C++ or JavaSpark or Map ReduceSQL and noSQL database experienceLinuxSource control experience, preferably GIT"}