{"jobID": "2826880435", "jobLocation": "Santa_Clara_CA", "jobTitle": "Sales Associate eCommerce and Phone - Acura Stevens Creek", "companyRating": "2.9", "companyInfo": {"Website": "www.autonation.com", "Headquarters": "Fort Lauderdale, FL", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public (AN) ", "Industry": " Retail", "Revenue": " $10+ billion (USD) per year", "Competitors": " Sonic Automotive, CarMax, Asbury Automotive"}, "estimatedSalary": "14", "jobDescription": "At AutoNation, doing what’s right by the customer comes standard at 300 locations coast to coast, so it’s no wonder we have served over 10 million happy customers. As an e-Commerce Sales Associate, you’ll be empowered with the resources and support needed to continue building customer loyalty that spans generations, including a best-in-class CRM, state-of-the-art equity mining tools, preferred relationships with over 30 lenders, access to a national inventory of over 100,000 new and pre-owned vehicles and your choice of a traditional commission or a base salary + commission pay plan. We represent 36 brands in 16 states, so there’s always opportunity to grow your career as an e-Commerce Sales Associate. Join AutoNation and accelerate as far and fast as your talent and our support can take you. Position Overview The e-Commerce Sales Associate interacts with hundreds of customers – online, over the phone and in person – to help guide their vehicle purchase in our no-haggle sales environment. Responding to leads in a timely fashion, answering questions, providing information and helping guide customers effectively from phone and internet contact to an in-store experience while providing an exceptional customer experience is key. With your outstanding communication and listening skills, you’ll help our customers select their perfect vehicle, negotiate terms to ensure that payment options meet their lifestyles, budgets, and expectations and close the deal. Our e-Commerce Sales Associates provide an exceptional customer experience both before and after purchase, driving loyalty by following up to ensure customer satisfaction and helping transition customers to the Service department to support their ownership experience. What are the requirements for this job?High school diploma or equivalentProven ability to provide an exceptional customer experienceDrive to set and achieve targeted goalsPrior sales experience, retail preferredDemonstrated communication, consultative, interpersonal and organizational skillsThe willingness to follow up with customersExperience and desire to work with technologyValid in-state driver’s license and an acceptable, safe driving recordWhy should I come work for AutoNation?You want to work for a car dealer that has a strong moral compass and treats all of its associates with respectAutoNation is an equal opportunity employer and a drug-free workplace."}