{"jobID": "2806705736", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.splunk.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2004", "Type": " Company - Public (SPLK) ", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "200000", "jobDescription": " Splunk's Guild of Data Science has been tasked with helping Splunk build smarter software and make data-driven decisions. While our mission is broad, individual guild members are involved in a subset of the efforts described below. We offer the flexibility to align your involvement with one or more efforts that interest you. Key Responsibilities:You understand various types of dataYou will closely interact with the research team as well as product management to derive requirements for how the data should be processed and what we are looking forYou will research, evaluate and implement statistical methods to track metricsQuick prototyping and evaluation of multiple solutions using frameworks like python/SparkImplementation of the solutions in a product environmentYou will derive data insights and bring them back to the product management teamYou will strive to find the best ways to visualize the data and the resultsYou will interact with various teams and areas throughout the product organization to collect feedback, improve the backlog, and define best practices for machine learning related matters.You will work as a traveler to help teams design features and products that are data-driven and/or rely on machine learning and statistics, assure the quality of the outcome, and actively participate in knowledge transfer.You will derive data insights and bring them back to the product management team.You will stay current on industrial and research trends, positioning, and customer needs.You will advocate for data science and machine learning through engaging with the external data science community and/or contributing to technical blogs.You will contribute to Splunk's privacy and compliance efforts.You will build and maintain a data repository and documentation standards.Required Experience/Skills & Education:You have expertise in statistical analysis tools such as R, Stata, Weka, Matlab - requiredYou have experience in Spark/MLlib specifically an added plusYou have the ability to code in Java or Scala, or pythonYou have experience working with large datasets, preferably using tools like SQL, Hadoop, MapReduce, Pig, Hive. preferredYou have experience with graph mining and graph algorithms an added plus, even more so knowledge of GraphXMath, Statistics or CS background with emphasis in Machine Learning - requiredWhat We Offer You:A constant stream of new things for you to learn. We're always expanding into new areas, bringing in open source projects and contributing back, and exploring new technologies.A set of exceptionally talented and dedicated peers, all the way from engineering and QA to product management and customer support.A stable, collaborative and supportive work environment.We don't expect people to work 12 hour days. We want you to have a successful time outside of work too. Want to work from home sometimes? No problem. We trust our colleagues to be responsible with their time and dedication, and believe that balance helps cultivate an extraordinary environment. We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability statusSDL2017"}