{"jobID": "2799402371", "jobLocation": "Seattle_WA", "jobTitle": "data analyst, Global Supply Chain Quality", "companyRating": "3.8", "companyInfo": {"Website": "www.starbucks.com", "Headquarters": "Seattle, WA", "Size": "10000+ employees", "Founded": " 1971", "Type": " Company - Public (SBUX) ", "Industry": " Restaurants, Bars & Food Services", "Revenue": " $10+ billion (USD) per year", "Competitors": " Dunkin' Brands, McDonald's"}, "estimatedSalary": "78000", "jobDescription": "Job Summary and MissionThe Starbucks Global Food Safety, Quality & Regulatory Strategy and Analytics team creates value at Starbucks by converting strategy into results via data-driven insights and strong operational rhythms. As part of our team, the data analyst will integrate data from numerous sources and make sense of it by conducting data manipulation, cleaning it and analyzing it. The analysis and accompanying visualizations will enable internal stakeholders and cross-functional leaders to make decisions that optimize product quality and mitigate food safety risk across the value chain. The position will be a member of the Global Food Safety, Quality, & Regulatory organization, and will frequently collaborate with cross-functional Analytics, Supply Chain, Operations, and Technology teams at Starbucks.Summary of Key ResponsibilitiesResponsibilities and essential job functions include but are not limited to the following:Extracts data form various databases; performs exploratory data analysis, cleanses, massages, and aggregates dataParticipates in discussions with business partners to define business question and to consultCreates impactful visual representations of analytic insights to audience needsPromotes and advocates for value of analytics and data among peersCommunicates insights via compelling narratives; able to influence director levels with timely and relevant insightCommunicates recommendations to team and project managers. Contributes to cross-functional team discussions. Assists in creating and developing structured presentations which detail project scope, analyses and recommendations.Creates robust and detailed modeling with minimal guidance. Accesses creative information sources to gather data.Manages individual workload for assigned portion of projects, meeting expectations for quality and timelinessSummary of ExperienceData analysis and modeling: minimum 1-year professional or equivalent experienceBasic QualificationsEducation: BA/BS with concentration in quantitative discipline – Data Analytics, Statistics, Math, Comp Science, InformaticsRequired Knowledge, Skills and AbilitiesStrong attention to detailExposure and business-applicable experience in several Modeling & Machine Learning Techniques (regression, tree models, survival analysis, cluster analysis, forecasting, anomaly detection, association rules, etc.)Exposure and business-applicable experience in several data ETL (Teradata, Oracle, SQL, Python, Java, Ruby, Pig)Exposure and business-applicable experience in several analytic languages (R, SAS, SPSS, Stata)Advanced skills in data visualization technology (Tableau and Power BI)Advanced skills in Microsoft Excel and PowerPointAbility to positively contribute in a cross-functional team environmentCore CompetenciesCustomer FocusDelivers legendary service that meets and exceeds all customers' expectationsEthics and IntegrityAdheres to Starbucks values, beliefs and principles during good and bad timesComposureRemains calm, maintains perspective and responds in a professional manner when faced with tough situationsPersonal LearningTakes personal responsibility for the continuous learning of new knowledge, skills and experiencesDealing with AmbiguityAble to successfully function during times of uncertainty and changing prioritiesDecision-MakingMakes timely and quality decisions based on a mixture of analysis, wisdom, experience and judgmentInterpersonal SavvyBuilds effective relationships with all people; up, down and sideways, inside and outside of StarbucksResults OrientedGets results and achieves goalsStarbucks and its brands are an equal opportunity employer of all qualified individuals, including minorities, women, veterans & individuals with disabilities. Starbucks will consider for employment qualified applicants with criminal histories in a manner consistent with all federal, state, and local ordinances."}