{"jobID": "2813328827", "jobLocation": "Mountain_View_CA", "jobTitle": "Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.manage.com", "Headquarters": "Mountain View, CA", "Size": "1 to 50 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "93000", "jobDescription": " Company DescriptionFounded in 2011, Manage is a self-funded and profitable Mobile Marketing Platform that helps advertisers acquire & re-engage with high value customers through In-App mobile advertising. Our clients include leading apps, brands, and agencies (e.g. Uber, Lyft, Zynga, etc.) focused on finding new customers within the mobile-first world.  Core to our company is a technology platform featuring proprietary algorithms, a machine-learning bidding engine and high-performance architecture. We reach over 2 billion consumers worldwide and access over 60 billion ad impression opportunities every month.  Headquartered in Mountain View, CA, Manage was named one of the Best Places to Work in the Bay Area for 2015 by the San Francisco Business Times and Silicon Valley Business Journal. We operate as a nimble startup, meaning we have a very flat org structure that allows every team member to have huge areas of ownership and authority. We like to move fast, iterate and improve, using a learn by doing mentality. Were looking for smart, driven team players who can help us get things done. Our team has a unanimous passion for doing things better with data, algorithms and machine learning to help our customers become successful.Job DescriptionWe are looking for a Data Analyst to join the team. Candidates should be naturally curious, detailed oriented, have a sharp analytical mind, are good with SQL, can write scripts and have the ability to communicate complex concepts with technical and non-technical people alike. What you&apos;ll be doingWork with various groups within the company to understand business needs, provide relevant data, and in-depth analysisWrite complex SQL queries to pull and process data from multiple data sourcesCreate dashboards to help business keep track of important metricsProvide ad hoc and regular reports on key business metricsWrite scripts to automate repetitive tasks QualificationsAbout you BS/MS Degree in Engineering, Computer Science, Statistics, or other highly quantitative field1-3 years of practical experience in SQL querying large and complex data setsExperience in Excel including pivot tables and common functionsProficiency in Python, PHP, or other scripting languages as well as proven ability to work with large data setsStrong communication and client-facing data presentation skillsProven ability to learn quickly, work independently, and adapt to change in a fast-paced environmentBonus pointsExperience with MemSQL, Hadoop, and other scalable architectureExperience in tools such as Pandas, R, etc.Experience with BI/reporting tools such as TableauPrevious internet/mobile industry experience Additional InformationWhat were offering to youCompetitive base salaries plus quarterly bonusesAn entrepreneurial environment with high growth potential100% employer paid health, dental, life and vision insurance; fsa and hsa401(k) plan and a wellness program and fitness reimbursement credit.21 days paid vacation and sick time, 2 paid floating holidays, 9 paid holidaysRegular fun team events, snacks, drinks and weekly meals in the officeFlat hierarchies and short decision paths, much like start-up environmentsWorking in a modern office located in the heart of Mountain View, CA"}