{"jobID": "2828031482", "jobLocation": "Fremont_CA", "jobTitle": "Inside Sales Representative", "companyRating": null, "companyInfo": {"Website": "www.asipartner.com", "Headquarters": "Fremont, CA", "Size": "501 to 1000 employees", "Founded": " 1987", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "ASI Corp is hiring for an Inside Sales Representative for our Fremont, California office. An Inside Sales Representative will work with customers to find what they want, create solutions and ensure a smooth sales process. Inside Sales Representatives work to find new sales leads, through business directories, client referrals, etc.    Salary:ASI offers a very competitive salary depending on experience.Benefits:ASI Corpdemonstrates our commitment to the health of our employees by offering all full-time employees a full complement of medical, dental and vision coverage as well as competitive 401k.Responsibilities:Possessing direct account ownership, the Sales Executive builds and expands strategic relationships with customers by educating and selling, ASI products, solutions and services.Proactively identifies, qualifies, and processes new and existing customer leads or current customers with low-activityAccountable for achieving overall revenue/profit/share objectives through active selling and operational execution within assigned customers.Manages and oversees the sales process for assigned accounts and develops a robust pipeline to drive ongoing sales opportunitiesPartners and plans effectively with internal ASI resources to ensure all areas of the sales process are executed to plan.Requirements:High School diploma or GED equivalent1-2 years’ experience in the hardware technology or related industry.Good communication skills, verbal and writtenGood interpersonal skills a must. We love energetic, outgoing people!Sales experience preferred, but not requiredMust be self-motivated, driven and have great work ethicKnowledge of IT Technology preferred, but not requiredProficient in Microsoft Office (Excel, Word, Outlook)About Us: ASI CORP is one of the largest PC Distributors in North America. ASI was founded in 1987 with the goal of assisting small, mid-tier and growing companies with a range of value-add services based on competencies unique to the system integrator and VAR channel. Today, the company maintains 14 locations throughout the US and Canada with revenues of more than $1.3 billion and represents over 15,000 products from the industry's most notable manufacturers.    ASI Corp is an equal opportunity employer (EOE).SalaryHigh SchoolFremont, CA, Fremont, California, United States of America Apply Now  See all jobs"}