{"jobID": "2684865585", "jobLocation": "Oakland_CA", "jobTitle": "Mental Health Clinician (Counseling Enriched)", "companyRating": null, "companyInfo": {"Website": "www.ebac.org", "Headquarters": "Oakland, CA", "Size": "51 to 200 employees", "Founded": " 1952", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Mental Health Clinician EBAC improves the well-being of children, youth and families by reducing the impact of trauma and social inequities and is committed to building a comprehensive, place-based continuum of accessible, trauma-informed and culturally relevant services that build resiliency, aid in recovery and, where possible, prevent exposure to adverse childhood experiences.  Our staff seeks to reduce barriers that contribute to disparities in wellness for socio-economically disadvantaged and racially marginalized families and to create communities where all children and families have supports to reach their full potential. A. FUNCTION Provide individual, group, and family therapy (as needed) to elementary school level children; collaborate with educational staff; perform intake evaluations, which include forming diagnostic formulations; provide case management, treatment planning, and therapeutic interventions for children as a member of the multi-disciplinary treatment team. B. QUALIFICATIONS MSW or MFT (license preferred), or appropriate masters degree and license eligible. At least one year experience in individual child therapy, group, and family therapy. Previous experience in day-treatment or other milieu therapy setting preferred. Able to keep clear, complete records and clinical charts. 5. Able to work cooperatively in a multi-disciplinary team setting. 6. Excellent written and oral communication skills required.C. RESPONSIBILITIESConduct individual therapy with children enrolled in the program. Maintain regular contacts with parents and family members so they would be more involved with the program. Manage intake and discharge process. Confer with community agencies regarding school placement, collaborative casework and other ancillary services. Present case material and case summary reports for case conferences, supervision, and treatment team meetings. Consult with classroom and milieu staff on individual children's progress. Maintain clinical charts, write treatment plans, other reports as required and complete all paperwork requirements in a timely manner. Lead the development of positive behavior intervention plans for each child, including documentation and provide direct service in the milieu. Comply with all Utilization Review (UR) requirements and attend UR as needed. Attend staff case conferences, staff meetings, and participate in trainings. Other duties as assigned.D. WORKING CONDITIONS AND JOB SETTINGWork is primarily in a classroom or office and an enclosed outdoor play yard setting with children. Work is directly with SED children who can, at times, become aggressive. Therefore, full mobility is required for standing walking, sitting, using hands, climbing, balancing, stooping, kneeling, crouching, and crawling.Staff must be able to physically restrain a child with or without the assistance of a second adult. Must complete certification in non-violent crisis intervention as provided by Crisis Prevention Institute, Inc. Noise levels may be high at times. 5. Periodic lifting up to 25 pounds is required. EBAC offers a uniquely generous time off package and an outstanding benefits package that includes health; chiropractic; dental; voluntary life insurance (for yourself and your family), AD&D; and SDT; accident and critical illness coverage (for yourself and family); flexible spending for medical, child care and commuter benefits; 403b retirement program; legal insurance; and, agency paid life insurance and long term disability coverage.  East Bay Agency for Children is an equal opportunity employer and encourages diverse candidates to apply by sending a cover letter and resume to group70@ebac.org, or by fax to 510-268-0143. Please use the job title as the subject. No phone calls please."}