{"jobID": "2670293843", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior IT Associate- GDPR", "companyRating": "4.8", "companyInfo": {"Website": "www.schellman.com", "Headquarters": "Tampa, FL", "Size": "51 to 200 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "82000", "jobDescription": " We get it- youve got options. In a sea full of IT Audit openings, how do you know which position parallels your vision and values? At Schellman, we make it very clear what were all about.  Were visible. Do you like to be a recognized contributor, not one of a million? Were big on acknowledging our team for their accomplishments and its easier to do so when youre not getting lost in the shuffle.  Were impactful. One of the best things about a firm our size is the ability to make a difference. We want to hear your ideas and suggestions for improvement but there will not be 10 layers for you to bypass, great ideas will be implemented. Our positions impact our clients by helping them to achieve their compliance objectives and your purpose is well-defined.  Were challenging. Our positions arent for everyone. We move quickly, and our projects are in-depth. Youll be taking your skill set and knowledge to the next level and enjoy the feeling of completion- often. We need our team to be prepared to work, flexible and excellent at time management.  Were rewarding. We only promote from within and offer an outstanding compensation and benefit package for your hard work. Our travel is around 50%, we pay a bonus if youre outside of the Monday-Thursday travel window, and you enjoy working from home when youre not onsite with the client.  Were empowering. What direction do you want to take your career? At Schellman, we leave the big decisions up to you. Want to specialize in GDPR but learn a new line of service down the road? You have the ability to choose what you specialize in; well provide the guidance and support to help facilitate the next step of your professional journey. We appreciate and reward initiative; advancement is based on performance and since we only hire experienced Associates, there is a high level of trust and autonomy in completing projects. We give you the ability to set your goals, limited only by your own ambitions. What background do we require? 2+ years experience from a large national consulting or CPA firm or industry experience from a national corporation, with specific, focused experience in GDPR, as well as a Bachelors degree in IT, Accounting, or a related field. Schellman might not be as well-known, but we are well-liked. Weve been recognized in the industry as one of the top Best Small Firms to Work for by Consulting Magazine, but even more importantly, our employees have great things to say about working here: https://www.glassdoor.com/Reviews/Schellman-and-Company-Reviews-E666239.htm  If our values parallel what youre looking for, wed love to hear from you. Join us in being part of something truly unique in the world of compliance.  Unfortunately, at this time, we can't consider candidates that require sponsorship or are outside of the United States."}