{"jobID": "2754500971", "jobLocation": "Santa_Clara_CA", "jobTitle": "Sales Manager, Real Estate", "companyRating": null, "companyInfo": {"Website": "www.keypointcu.com", "Headquarters": "Santa Clara, CA", "Size": "51 to 200 employees", "Founded": " 1979", "Type": " Nonprofit Organization", "Industry": " Finance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Real Estate Sales Manager is responsible for overseeing KeyPoint?s Real Estate Lending Internal and External Sales teams which encompasses managing the day to day sales and origination activities to meet established loan production goals. The Real Estate Sales Manager is responsible for providing motivation and training to Loan Officers to ensure their success as well as monitoring and managing them in accordance with established policies and procedures. Responsibilities:Direct and manage the Loan Officers to ensure that production and loan quality goals are metSupport external Loan Officers in sourcing and originating residential real estate loans through development of relationships with realtors, builders and business professionalsMonitor, manage and report on all inbound member direct leads and ensure that the internal Loan Officers are partnering with branches and members to find the best mortgage product available to meet their needsDevelop goals and objectives for each Loan Officer including production and competency goalsProvide constant training to the Loan Officers including, but not limited to, sales skills and techniques, product and underwriting guidelines and pipeline managementEstablish KeyPoint Credit Union as a Retail lender in the mortgage industryMaintain existing Correspondent relationships in accordance with the Credit Union?s strategic production planMaintain a strong working knowledge of all KeyPoint?s Portfolio and Investor guidelines as well as be fluent on loan level pricingConduct regular sales meetings as well as regular one on ones with each employee to review performanceRecruit additional Loan Officers as neededPartner with VP and Marketing department to create and implement defined and on-going marketing plan to advertise KeyPoint?s real estate department and its products and servicesCommunicate professionally and directly both verbally and in writing with direct reports, members, branches, correspondents and peers within KeyPoint Credit UnionAdherence to regulatory requirements, and Credit Union policies and procedures as they pertain to loan origination and salesLearn new CRM?s, LOS?s and other systems as needed to facilitate loan productionPrepare production related reports including, but not limited to, lead conversion rates and closed loan production per Loan OfficerPerform all other duties as assigned by ManagementPhysical Requirements: (Including lifting, sitting, walking, bending, reaching and squatting % of time in each function) The workstation consists of an indoor cubical. A workday consists of sitting 75% of the time with standing 10% of the time and walking 15% of the time. The job also has some of the following for a total of no more than 1 hour each day: bending, reaching, kneeling, squatting and lifting up to 25 pounds or less. High school diploma or equivalent, with AA or BS preferred.Minimum 5 years’ mortgage related experience, preferably as a Loan Officer, Account Executive or Account Manager.Minimum 5 years of in depth exposure to conventional mortgage underwriting on standard loan products is strongly preferred.Minimum 1 – 2 years’ experience in a management or supervisory role.Expertise in interpreting loan level pricing, underwriting guidelines, analyzing risk, and communicating with members and associates on loan level decisions.Solid time management and organizational skills. Solid knowledge of mortgage lending products and services including underwriting guidelines.Ability to communicate clearly and effectively, both verbally and in writing, across a variety of audiences.Strong interpersonal skills.Ability to solve a variety of problems and deal with complex scenarios by using common sense and practical applications. Ability to work in a fast-paced environment under stringent time constraints.Ability to work collaboratively with others.Superior computer skills, including proficiency with Microsoft Office Suite.Experience and detailed understanding of FNMA’s DU and FHLMC’s LP systems. This position requires S.A.F.E. registration at the time of employment. The Nationwide Mortgage Licensing System (NMLS) web site (mortgage.nationwidelicensingsystem.org) provides the MU4R questions and registration required for employment in this position. Ongoing employment is contingent upon meeting all such requirements, including acceptable background investigation results."}