{"jobID": "2825127917", "jobLocation": "San_Diego_CA", "jobTitle": "Analyst, Global Supply Chain (GSC) Analytics", "companyRating": "3.2", "companyInfo": {"Website": "www.bd.com", "Headquarters": "Franklin Lakes, NJ", "Size": "10000+ employees", "Founded": " 1897", "Type": " Company - Public (BDX) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Abbott Labs, Siemens, Baxter"}, "estimatedSalary": "70000", "jobDescription": " Analyst, Global Supply Chain (GSC) Analytics at Becton Dickinson & CompanyAsset 1 Skip Navigation - Offerings - Company - Clinical Excellence - Support - Investors - United States - Company - Careers - Opportunities - Veteran Job Opportunities - BD Total Rewards - Learning and Development - Inclusion and Diversity - University Relations and Recruitment - Why Join BD - - Job Description The Difference of One Search Our Jobs Keyword Search City, State, or ZIP Search radiusRadius5 miles15 miles25 miles35 miles50 milesSearch Analyst, Global Supply Chain (GSC) Analytics Job ID R-****** Date posted 06/20/2018 Job Description Summary Job Description Summary The Analyst, Global Supply Chain (GSC) Analytics is responsible for performing data analysis, recommending action based on insights gained from the analysis. This position will work closely with cross functional stakeholders including Businesses, Regions, Supply chain and QlikView development team to build KPI/Dashboard and analytic capabilities. This candidate will gather business requirements for a Supply Chain data repository to consolidate data from multiple ERP data sources into a comprehensive source for analytics. Will partner with the IT organization on the development and implementation of algorithms required to extract and cleanse data into the Supply Chain data repository for KPI/Dashboard and Metrics. The candidate should have knowledge and very good understanding of Qlikview tool. Responsibilities include: - Consult with the business users to document business requirements, design reports and dashboards to solve business problems - Gather data from disparate sources across the enterprise and synthesize/enrich information for meaningful business insights - Act as a liaison between business stakeholders and Qlikview developers - Deliver ad hoc reporting and analytics within an agreed-upon SLA - Assesses project issues and develops resolutions to meet productivity, quality, and stakeholder satisfaction goals - Build new capabilities and tools to drive self-service analytics for business users across supply chain functions - Develop detailed work plans, schedules, project estimates, resource plans, and status reports. - Work with the cross-functional stakeholders from various regions (North America, Latin America, Europe and Greater Asia), gather business requirement and support reporting needs - Presents results of detailed analysis and recommendations to the leaders using presentations, charts, graphs, etc. - Runs reports of varying frequencies for a variety of functional groups - Create ad-hoc customized reports for a variety of needs/functions - Participate in various projects (Integration, CI etc.) - 10 - 15% travel may be required Qualifications: - Bachelor's degree with 3 - 5 years of related experience - Experience with Supply Chain Analytics, Decision Support and Data Management - Experience with relational databases (SQL) and business intelligence tools QLIKVIEW required - Understanding of the E2E supply chain processes, broad Supply Chain knowledge - Order fulfilment (Distribution, Transportation) and customer service experience highly desirable - Experience with multiple ERP/MRP systems required (SAP) - Experience with lean/six sigma preferred - Must have analytical, project management, and consulting skills - Must demonstrate strong communication, interpersonal, and presentation skills. - Proficient in all Microsoft Office Applications (Excel, Access, PowerPoint, Word) - Ability to quickly understand and analyze data - Excellent analytical and communication skills - Good interpersonal skills Becton, Dickinson and Company is an Equal Opportunity/Affirmative Action Employer. We do not unlawfully discriminate on the basis of race, color, religion, age, sex, creed, national origin, ancestry, citizenship status, marital or domestic or civil union status, familial status, affectional or sexual orientation, gender identity or expression, genetics, disability, military eligibility or veteran status #LI-OPS Primary Work Location USA CA - San Diego Bldg A & B Additional Locations USA NJ - Franklin Lakes Work Shift Job: - Facebook - LinkedIn - Twitter - Email Similar Job Openings Nearby Lead Associate, Material Handling San Diego, California ******* Inventory Control Coordintator San Diego, California ******* Supervisor, Receiving Warehouse/Material Handling San Diego, California ******* Join our Talent Community Sign up to receive information about career opportunities, news and events. Sign up Join our Talent Community Sign up to receive information about career opportunities, news and events. Email Address Upload ResumeRemove Areas of InterestSearch for a category, location, or both, select a term from the suggestions, and click 'Add'. Category LocationAdd - Supply Chain, San Diego, California, United StatesRemove - Remove Confirm Email Find Your Role Select a job category, location or group to view its corresponding jobs. Jobs By Category - Accounting Jobs - Administrative Jobs - Administrative Assistant Jobs - Administrative Assistant/Administration Jobs - Advanced Manufacturing Engineer Jobs - ASR/Sales Jobs - Associate Engineer/Engineering Jobs - Aviation Jobs - BD/ MEdical Devices Jobs - BD/Medical Devices Jobs - Bio Technology Jobs - Buyer Jobs - Buyer/Planner Jobs - CAD Drafter Jobs - Clinical Affairs Jobs - Clinical Manager Jobs - Clinical Manager/Clinical Education Jobs - Clinical Research Associate Jobs - Clinical Safety Specialist I Jobs - Clinical Scientist Jobs - Clinical Trail Manager Jobs - Clinicial Specialist/Sales Jobs - Continuous Improvement Engineer Jobs - Continuous Improvement Leader Jobs - Controls Engineering Jobs - Corporate Security Jobs - Cost/Sales Analyst/Finance Jobs - Credit & Collections Representative/Collections Jobs - Customer Support Jobs - Data Management Rep/Finance Jobs - Director, Portfolio Management Jobs - distribution of medical devices Jobs - Document Control Coordinator/ Quality Jobs - Documentation Control Analyst/Quality Systems Jobs - EH & S Engineer Jobs - EHS Jobs - EHS & Safety Manager/Operations Jobs - Engineer Industrial Jobs - Engineering Jobs - Enterprise Architecture & Design Governance Jobs - Environmental Health & Safety Manager/Facilities Jobs - Ethics & Compliance Jobs - Facilities Maintenance Jobs - Facilities/Maintenance Jobs - Field Assurance Specialist/Quality Jobs - Field Service Engineer Jobs - Finance Jobs - Finance Manager Jobs - Financial Analyst Jobs - Financial Systems Jobs - Global Service Engineer Jobs - Hardware Quality Engineering Jobs - HEOR Jobs - Heor Technical Specialties Jobs - Human Resources Jobs - Information Technology Jobs - IT Security Specialist Jobs - Laboratory Supervisor Jobs - Legal Jobs - Machine Operator Jobs - MainMaintenance Technician B Jobs - Maintenance Technician 'C' Jobs - Manafacuturing Jobs - Manufacturing Jobs - Manufacturing Engineering Jobs - Manufacturing/Medical Device Jobs - Manufacturing/Medical Devices Jobs - Manufacturing/Shift Lead Jobs - Marketing Jobs - Marketing Associate/Marketing Jobs - MEDICAL Jobs - Medical Affairs Jobs - Medical Device Jobs - Medical Device / Finance Jobs - Medical Device / Manufacturing Jobs - Medical Device / Packaging Engineering Jobs - Medical Device / Product Development Jobs - Medical Device / Quality Engineering Jobs - Medical Device / Supply Chain Jobs - Medical Device Manufacturing Jobs - Medical Device/ Clinical Affairs Jobs - Medical Device/ Contracts Jobs - Medical Device/ Manufacturing Jobs - Medical Device/ Marketing Jobs - Medical Device/ Pilot Plant ME Jobs - Medical Device/ Platform Marketing Jobs - Medical Device/ Quality Jobs - Medical Device/ Quality Assurance Jobs - Medical Device/ R & D Jobs - Medical Device/ R & D Quality Jobs - Medical Device/ Regulatory Affairs Jobs - Medical Device/ Research & Development Jobs - Medical Device/ Sales Jobs - Medical Device/Customer Service Jobs - Medical Device/Facilities Jobs - Medical Device/Field Assurance Jobs - Medical Device/Finance Jobs - Medical Device/Manufacturing Jobs - Medical Device/Marketing Jobs - Medical Device/Operations Jobs - Medical Device/Operatives Jobs - Medical Device/Quality Assurance Jobs - Medical Device/Quality Engineering Jobs - Medical Device/R & D Jobs - Medical Device/Regulatory Affairs Jobs - Medical Device/Sales Jobs - Operations Excellence Jobs - Operations Manager, Quality Compliance & Audits Jobs - Optical Engineering Jobs - Organizational Effectiveness Manager-Continuous Improvement Jobs - Packaging Engineer Jobs - Payroll Jobs - Plant Accounting Manager Jobs - Post Market Surveillance Clinical Scientist/Medical Affairs Jobs - Primary Engineer Jobs - Process Engineer Jobs - Process Engineer/Operations Jobs - Process Safety Management Jobs - Procurement Jobs - Product Engineer Jobs - Product Manager/Marketing Jobs - Production Jobs - Production Coordinator Jobs - Professional Services Jobs - Project Management Jobs - Project Manager- Quality Assurance Jobs - Public Affairs Jobs - Purchasing Jobs - QA Sterilization Engineer/Engineering Jobs - Quality Jobs - Quality Control Inspector Jobs - Quality Coordinator Jobs - Quality Engineer Jobs - Quality Engineer /Quality Assurance Jobs - Quality Engineer II/Quality Assurance Jobs - Quality Engineer/ Medical Device Jobs - Quality Engineer/Quality Assurance Jobs - Quality Manager Jobs - R & D Manager Jobs - R & D Technician II Jobs - Recruiter/Human Resources Jobs - Regulatory Affairs Jobs - Regulatory Affairs Associate/Healthcare Jobs - Regulatory Affairs Specialist Jobs - Regulatory Affairs Specialist / Regulatory Jobs - Research and Development Jobs - Sales Jobs - Sales & Marketing Management Jobs - Sales Intern Jobs - Sales Training/Development Mgr/Sales Jobs - Scientist I/Medical Device Jobs - Service & Repair Technician/Service & Repair Jobs - Software Engineer Jobs - Sr Supply Chain Analyst/Supply Chain Management Jobs - Sr. Financial Analyst/Finance Jobs - Sr. Manufacturing Engineer Jobs - Sr. Packaging Engineer Jobs - Sr. Quality Engineer/Quality Jobs - Sr. R & D Engineer Jobs - Supplier Quality Engineer Jobs - Supply Chain Jobs - Supply Chain Manager/Supply Chain Jobs - Systems Engineering Jobs - Tableworker/Manufacturing Jobs - Technical Writing Jobs - Territory Manager / Sales Jobs - Territory Manager/Sales Jobs - TEST123 Jobs - Testing Jobs - Transfer Pricing Analyst Jobs - UX/UI Jobs - Work Leader Jobs Jobs By Location - Alabama Jobs - Albany Jobs - Albuquerque Jobs - Andover Jobs - Arizona Jobs - Arkansas Jobs - Ashland Jobs - Atlanta Jobs - Austin Jobs - Auvergne-Rhne-Alpes Jobs - Baltimore Jobs - Baton Rouge Jobs - Birmingham Jobs - Boston Jobs - Brea Jobs - Broken Bow Jobs - California Jobs - Canaan Jobs - Carol Stream Jobs - Cayey Jobs - Cayey Municipio Jobs - Chicago Jobs - Chihuahua Jobs - Cincinnati Jobs - Ciudad Jurez Jobs - Cleveland Jobs - Colorado Jobs - Columbus Jobs - Columbus Jobs - Connecticut Jobs - Covington Jobs - D.C. Jobs - Dallas Jobs - Denver Jobs - Des Moines Jobs - Durham Jobs - El Paso Jobs - Florida Jobs - France Jobs - Franklin Lakes Jobs - Fresno Jobs - Georgia Jobs - Grayson Jobs - Harrisburg Jobs - Hartford Jobs - Holdrege Jobs - Houston Jobs - Humacao Jobs - Humacao Municipio Jobs - Illinois Jobs - Indiana Jobs - Indianapolis Jobs - Iowa Jobs - Irvine Jobs - Jackson Jobs - Jacksonville Jobs - Kansas City Jobs - Le Pont-de-Claix Jobs - Los Angeles Jobs - Louisiana Jobs - Louisville Jobs - Mannford Jobs - Maryland Jobs - Massachusetts Jobs - Mebane Jobs - Memphis Jobs - Menlo Park Jobs - Mexico Jobs - Miami Jobs - Milwaukee Jobs - Minneapolis Jobs - Minnesota Jobs - Missouri Jobs - Moncks Corner Jobs - Murray Hill Jobs - Nashville Jobs - Nebraska Jobs - New Hope Jobs - New Jersey Jobs - New Mexico Jobs - New York Jobs - New York Jobs - Newark Jobs - North Carolina Jobs - Ohio Jobs - Oklahoma Jobs - Oregon Jobs - Pennsylvania Jobs - Philadelphia Jobs - Pittsburgh Jobs - Portland Jobs - Puerto Rico Jobs - Queensbury Jobs - Raleigh Jobs - Research Triangle Park Jobs - Reston Jobs - Reynosa Jobs - Rhode Island Jobs - Sacramento Jobs - Salt Lake City Jobs - San Antonio Jobs - San Diego Jobs - San Francisco Jobs - San Jose Jobs - Sandy City Jobs - Seattle Jobs - South Carolina Jobs - Sparks Jobs - St Louis Jobs - Sumter Jobs - Tamaulipas Jobs - Tampa Jobs - Tempe Jobs - Tennessee Jobs - Texas Jobs - United States Jobs - Utah Jobs - Vernon Hills Jobs - Virginia Jobs - Warwick Jobs - Washington Jobs - Washington, DC Jobs - Wisconsin Jobs - Woburn Jobs - Yorba Linda Jobs - Zelienople Jobs Jobs by Category + Location - United States Professional Services Jobs - Sandy City Machine Operator Jobs - United States Project Management Jobs - Franklin Lakes Product Engineer Jobs - United States Medical Device/Sales Jobs - Sparks Software Engineer Jobs - Franklin Lakes Information Technology Jobs - Queensbury Manufacturing Jobs - Franklin Lakes Regulatory Affairs Jobs - Columbus Machine Operator Jobs - California Sales Jobs - California Professional Services Jobs - Columbus Production Jobs - Columbus Manufacturing Engineering Jobs - Sparks Marketing Jobs - Franklin Lakes Marketing Jobs - Canaan Manufacturing Jobs - Canaan Manufacturing Engineering Jobs - Franklin Lakes Professional Services Jobs - Franklin Lakes Supply Chain Jobs - Reynosa MEDICAL Jobs - Columbus Manufacturing Jobs - Sparks Customer Support Jobs - San Diego Marketing Jobs - Franklin Lakes Quality Jobs - Columbus Facilities Maintenance Jobs - San Jose Marketing Jobs - Canaan Bio Technology Jobs - San Jose Software Engineer Jobs - Franklin Lakes Customer Support Jobs - San Jose Customer Support Jobs - Texas Sales Jobs - Sparks Bio Technology Jobs - Sumter Engineering Jobs - San Jose Engineering Jobs - Franklin Lakes Medical Affairs Jobs - Sparks Machine Operator Jobs - St Louis Machine Operator Jobs - Canaan Machine Operator Jobs - Sumter Manufacturing Jobs - Sumter Manufacturing Engineering Jobs - Sparks Engineering Jobs - San Diego Quality Engineer Jobs - Sparks Supply Chain Jobs - San Diego Project Management Jobs - San Jose Systems Engineering Jobs Becton, Dickinson and Company is an Equal Opportunity/Affirmative Action Employer. We do not unlawfully discriminate on the basis of race, color, religion, age, sex, creed, national origin, ancestry, citizenship status, marital or domestic or civil union status, familial status, affectional or sexual orientation, gender identity or expression, genetics, disability, military eligibility or veteran status. All applicants should complete the on-line application process. BD is committed to working with and providing reasonable accommodations to individuals with disabilities. If you require assistance or an accommodation because of a disability to participate in the application process, please call 855-BD-HELPS (************) or email ******************* - EEO is the Law - Right to Work (English) - Right to Work (Espanol) - E-Verify Participation (Eng/Esp) OFFERINGS - Capabilities - Brands - Integrated solutions - Catalogs COMPANY - Contact us - Careers - Sustainability - Suppliers - News - Investors - Video gallery CLINICAL EXCELLENCE - Case studies - Conferences and symposia - Webcasts SUPPORT - Technical support - Customer portals - Alerts and notices - Product security and privacy 2018 BD. All rights reserved. Unless otherwise noted, BD, the BD Logo and all other trademarks are property of Becton, Dickinson and Company. Privacy Policy | Terms of Use | Sitemap"}