{"jobID": "2796326854", "jobLocation": "San_Rafael_CA", "jobTitle": "Accounts Payable Clerk", "companyRating": null, "companyInfo": {"Website": "www.vionicshoes.com", "Headquarters": "San Rafael, CA", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Accounts Payable Clerk  IT BEGAN WITH A FLIP-FLOP.  But not just any flip-flop. A sandal that revolutionized the industry, bringing biomechanical support to a quintessential summer staple. From these humble beginnings in Australia to the bustling San Francisco Bay Area, Vionic has grown from a fledgling business to a global footwear brand. Were bringing together style and science and reimagining the look of supportive footwear.  The Vionic footwear collection is available at select quality retailers across North America, including Nordstrom, Dillards, Belk and Zappos.com, and at VionicShoes.com. Our corporate headquarters is located in San Rafael off of Highway 101, with easy highway access and plenty of free parking.  Vionic is nationally recognized as a Great Place to Work and has been voted one of the Best Places to Work by the North Bay Business Journal FIVE years in a row.  About the Position  We are looking for a skilled Accounts Payable Clerk to provide financial and clerical services. The main responsibility of this role is to maintain full cycle AP from invoice approval and posting to setting up payment runs.  Essential Responsibilities Review invoices for proper level of approval and coding.Post invoices in ERP system.Add and maintain vendor files.Prepare and process payment runs in accurate and timely manner.Responsible for clean and concise AP aging report.Provide supporting docs for external audits.Research and resolve any vendor account discrepancies.Build relationships with vendors and provide quality level of customer service.Assist with 1099 process.Ad hoc reports as necessary.Other duties as required. Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.  To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability generally required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  Education/Experience/Abilities: Bachelor's degree (B. A.) from four-year college or university; or two to four years related experience and/or training; or equivalent combination of education and experience.At least 3-5 years related experience, preferredStrong skills in Excel (vlookup, pivot and other basic formulas)Preferred experience with accounting software systems including but not limited to Microsoft Dynamics AX, Microsoft Dynamics Great Plains or any other comparable software.Basic skills in standard office software such as Word, Outlook, etc. are required.Acute attention to detail with strong organizational, problem-solving, and analytical skills; able to manage priorities and workflow.Strong interpersonal skills.Good judgement with the ability to make timely and sound decisions.Ability to identify and solve problems efficiently and quickly.Ability to multi-task and maintain productivity in a fast-paced and sometimes stressful environment.Ability to work independently and in a team as a positive, flexible team player.Demonstrates a positive view of role of relationship with customers, vendors, subordinates and coworkers. We offer a fun and dynamic workplace with a robust benefits package that currently includes 100% paid medical premium for employees, dental, vision, 401K retirement plan with employer match, Long Term Disability, Life insurance, and a generous amount of PTO. Fresh organic fruit and juices, Fitbit challenges, and celebrations abound, including Australia Day! You receive free shoes each season, and receive a seriously deep discount on our products, because you will want more!"}