{"jobID": "2830931650", "jobLocation": "Secaucus_NJ", "jobTitle": "Line Cooks - Start at $12.00+ per hour!", "companyRating": "3.2", "companyInfo": {"Website": "www.redrobin.jobs", "Headquarters": "Greenwood Village, CO", "Size": "10000+ employees", "Founded": " 1969", "Type": " Company - Public (RRGB) ", "Industry": " Restaurants, Bars & Food Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Chili's Grill and Bar, Texas Roadhouse, Applebee's"}, "estimatedSalary": "12", "jobDescription": " At Red Robin, we're not your typical burger restaurant. Our fans love us for our quirky personality, and the way we add an unexpected wink of fun to whatever we do. If you have a magnetic personality, contagious energy and are interested in working in an environment where anything is possible, come join our team!  Now Hiring Part Time:Line CookIf you are:A strong Team PlayerA Good communicatorOrganized with a great attention to detailAt least 18 years oldAble to prepare the best quality of food with uncompromising Health & Safety StandardsAs a Team Member at Red Robin, you'll enjoy:Flexible Work SchedulesFast Paced SurroundingsOpportunities to Build a CareerA Great Place to Make FriendsReferral bonuses for bringing new members to our teamRed Robin Food DiscountsAwesome discounts on great things like Computers, Cell Phone Plans, Event Tickets (Concerts, Sports, Events, etc...) & more! Our core B.U.R.G.E.R. values ensure that guests & team members alike are better for being here. BOTTOMLESS FUN - Our guests love coming here because we do too!  • Our playful spirit gets mixed into everything we do. UNWAVERING INTEGRITY- do the right thing, no matter what.  • Our word is a 100% guarantee we will deliver. Even when it’s tough or no one is looking. RELENTLESS FOCUS ON IMPROVEMENT - We are always striving to be better. We constantly seek knowledge and innovation to keep things popping!GENUINE SPIRIT OF SERVICE - We go above and beyond to meet our guests needs. Unbridled hospitality and personal connections are in our DNA.EXTRAORDINARY PEOPLE - Remarkable people make us better. We honor our Team Members by caring for, developing and rewarding them.RECOGNIZED BURGER AUTHORITY - Nobody does burgers as well as we do, nobody. We are the gold standard in taste, quality, presentation and innovation. Red Robin is an Equal Opportunity & E-Verify Employer RedRobin (RRGB) is a well established, full service restaurant concept that has growth opportunities for team members in a casual dining environment. At Red Robin Gourmet Burgers and Brews you can grow your career with us. We offer great restaurant culinary careers for line cooks (concinero / cocinera) who have back of house cooking, chef, saute cook or grill cook kitchen experience in a high volume restaurant environment."}