{"jobID": "2795127162", "jobLocation": "New_York_NY", "jobTitle": "Product Marketing Manager", "companyRating": null, "companyInfo": {"Website": "www.feedvisor.com", "Headquarters": "Tel Aviv-Yafo, Israel", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " At Feedvisor, were just as proud of our products as we are of our people. We work hard to assemble the best teams in the industry to create, manage, and sell the repricing tools that are shaping the future of e-commerce. Harnessing the powers of AI, Machine Learning, and Data Science, our Feedvisors are changing the way that business happens online. Our New York office is growing rapidly, and were looking forward to starting a conversation with you.  At Feedvisor, our technology makes a real and lasting impact on our customers businesses. As a Product Marketing Manager, you will be responsible for bringing new products, features, and/or services to market, working closely with our product development team and leading customer research. You will craft the messaging and positioning for products, and conceive and develop innovative marketing content and programs that drive demand This is a core role at the heart of all operations, from product development to marketing and sales. About the Role + Educating both internal and external stakeholders on our product features and their benefits  + Create and produce content (e.g. Marketing materials, sales documentation, product videos, website copy, blog posts, and forums) to articulate the benefits of our product to the market  + Develop the strategy for pricing and packaging  + Generate messaging and market positioning around products  + Create and manage demand generation programs  + Sales enablement: communicate the value proposition of our products to our sales team, ensuring the have the tools, training and support on new tools and products; assist sales on calls when appropriate to provide deeper dives into the product  + Conduct ongoing competitive and trend analysis and customer insights through interviews, surveys, focus groups and sales data to gain insight into customer use of current products and untapped opportunitiesRequirements:About You + 5+ years of software product marketing experience  + BA/BS in business or marketing/communications  + Very strong written communication skills  + Excellent people and management skills to interact with staff, colleagues, and cross-funcational teams  + An analytical approach  + Ability to lead and communicate cross-functionally with product/engineering and other departments Our Culture At Feedvisor we care a great deal about our company culture. You will be a great addition if:  + You're obsessed with excellence and consistently looking to improve  + You seek to understand the world through other peoples eyes  + You see opportunity in difficult situations  + You are trustful  + You get things done  + You are humble, radically candid, and open to feedback Benefits: You will be part of a dynamic team and have the privilege to work for a company that is building the infrastructure of the future.  We offer a competitive compensation package, which includes: comprehensive health, dental and vision insurance, Life insurance, generous PTO, a 401K and Happy hours, parties and events to insert joy into workflow.  Check out our profile on The Muse, our Customer Success Stories, and our Products page. All brought to you by the brilliant minds at Feedvisor - care to be one?"}