{"jobID": "2829168457", "jobLocation": "Wilmington_MA", "jobTitle": "Software Engineering Intern", "companyRating": "2.6", "companyInfo": {"Website": "www.symbotic.com", "Headquarters": "Wilmington, MA", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Dematic, Knapp Inc., Intelligrated"}, "estimatedSalary": "55000", "jobDescription": " Company DescriptionSymbotics talented and diverse workforce develops disruptive robotic solutions for warehouse automation and supply chain transformation, drives results and focuses on customer satisfaction. Our modular and scalable solutions utilize existing space and high-speed robotics combined with proprietary software and technology. Since forming in 2007, Symbotic has grown to over 700 employees in North America and supports an impressive, high-profile customer base. We seek candidates who are passionate about our solution and approach problem solving with a creative mind and a commitment to excellence. If you seek a challenge and want to impact the way the world distributes product from manufacturers to store shelves, we invite you to join our team.Job DescriptionSymbotic is looking for people who thrive in a fast paced, solutions oriented and creative environments. We are looking for Interns/Co-Ops to participate in the development of a suite of applications, both desktop and mobile, for our next generation of software to fleets of mobile robots and industrial systems. We are seeking individuals who thrive in a creative, collaborative and agile development environment.  We are looking for a Softare Engineer intern/Co-op for the Fall 2018 Semester.Qualifications Currently enrolled in an accredited university pursuing a bachelors or masters degree in Computer Science, Computer Engineering, Electrical Engineering, or a related major such as Math, Physics.Minimum of a 3.0 GPA or higher.Object oriented programing concepts, C# preferred.RDBMS - SQL Server or Oracle preferred.Familiarity with UI concepts and LINUX OS or Windows.Source code control, unit testing, design and defect tracking tools.New application development, preferably in an industrial environment.UML, OOD, Agile, multi-threading, multiprocessing, & SW/HW integration.And a desire to:Work within a distributed architecture, display of equipment and associated data, C#, C++, and multi-threaded / multi-processor environment.Work in a dynamic Agile/Scrum-based environment on cross functional and outsourced teams.Support the design and development of high-quality software using some of the following: C#, WPF, WCF, LINQ, Rx extensions, ASP.NET. Additional InformationCompensation and Benefits:  Symbotic offers competitive compensation and a dynamic, growing company environment. Benefits include very comprehensive coverage for medical, dental, life, disability, flexible spending accounts, and more.  Please No Agencies, Contractors or Consultants. Symbotic is an equal opportunity employer. We do not discriminate based on age, gender, physical or mental disability, nation of origin, veteran status, religious beliefs, sexual identity or expression. Symbotic supports a diverse workforce and we are committed to a work environment free of discrimination and harassment, where all are treated with dignity and respect."}