{"jobID": "2826718528", "jobLocation": "Boston_MA", "jobTitle": "Business Intelligence Intern", "companyRating": null, "companyInfo": {"Website": "www.runkeeper.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "We are currently seeking an Intern to join our Analytics team in Boston and reporting to our Business Intelligence Analyst. Over the course of the internship, you will learn how to work with a team of Analysts and Data Scientists, responsible for delivering BI and analytics solutions. You will help guide decision making and performance analysis by leveraging tools/technologies such as Tableau, Google BigQuery, Snowflake and Python and also get to work with Google AnalyticsResponsibilities Create and modify dashboards and reports using BI tools based on project requirementsCollaborate with members of the eCommerce, Product, Merchandising and Marketing team to gather requirementsBuild queries to answer ad-hoc questionsDevelop documentation for new dashboardsFocus on understanding the relationships within the data, and the businesss key performance indicatorsWorks with the Team to review, analyze, and develop solutions for operational leadersRequirementsPursuing a Bachelors degree, preferred fields of study include: Business Administration, Finance, Statistics or similar related fieldsExperience with Data Analytics or Business Intelligence tools like Tableau and Knowledge of SQLExperience writing Python or R codeBe eager to learn and contribute! ASICS Digital is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status, or fitness level."}