{"jobID": "2729551995", "jobLocation": "Oakland_CA", "jobTitle": "Design Engineer - Security", "companyRating": "4.5", "companyInfo": {"Website": "www.teecom.com", "Headquarters": "Oakland, CA", "Size": "51 to 200 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Telecommunications", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "93000", "jobDescription": "TEECOM | the tech in architecture®Advancing human performance. Creating more sustainable buildings. Utilizing machine learning. If these concepts intrigue you, you might be a perfect match for the energetic, collaborative environment at TEECOM. Were a $20+ million/year consulting engineering firm that has grown at an average rate of 20% per year for the past 20 years. We create the technology systems that deliver digital experiences at some of the worlds most innovative companies. We work hard in a fast-paced professional environment that will challenge you to learn and grow, and we also play hard through team lunches and philanthropic events that foster camaraderie. TEECOM is one of the fastest growing companies in the San Francisco Bay Area and our staff has voted TEECOM one of the Best Places to Work. Join us and make TEECOM even better.Ten Signs You are a Great Candidate You have a positive can-do attitude and solid work ethic.You have the flexibility to adapt to any challenge you are faced with.You have excellent communication and planning skills to represent TEECOM in a highly professional, concise, yet friendly manner on the phone, in person, and in writing.You have experience working on small to mid size projects (20,000+ sf) from a range of market sectors.You are familiar with the entire suite of electronic security systems, such as access control, video surveillance, communications, intrusion detection, building system interfaces, networks, and door hardware.You have a working knowledge of Revit, AutoCAD MEP, Navisworks, and Bluebeam Revu as well as networks, audiovisual systems, and electronic security systems.You have a strong understanding of the architectural design and construction process.You are a self-starter and comfortable working autonomously.You enjoy working with a team of engineers and designers.Words like trustworthy, collaborative, team player, and flexible describe you to a T. Essential Duties Design, coordinate, and engineer electronic security systems in markets such as: Aviation, Healthcare, Higher Education, and Workplace.Track decisions, budgets, and schedule for small to mid size projects while translating the clients vision into reality.Assist with client interface between the clients Security/Safety and Facilities staff and the architects, integrators, and contractors.Prepare contract documents under direction of senior engineers.Prepare drawings, specifications, and design calculations.Perform job site inspections to determine existing conditions and extent of progress made by contractors.Assist with proposal and interview coordination to win projects.Research technical product information.Mentor less experienced engineers within the team.Foster client relationships and fellow design team members. Experience Minimum of 3 to 5 years in the security design for facilities construction projectsEducation/Degree/Major: BS in Engineering (electrical preferred but not required)Experience: Revit, AutoCAD 2009+EIT, PSP, PE a plusCompensationCompensation is flexible depending on experience. TEECOM has excellent benefit packages to suit you and your family.Please submit your resume and a cover letter. Resumes submitted without cover letters will be rejected."}