{"jobID": "2828008523", "jobLocation": "Milpitas_CA", "jobTitle": "Data Analyst Engineering Intern", "companyRating": "3.7", "companyInfo": {"Website": "www.kla-tencor.com", "Headquarters": "Milpitas, CA", "Size": "5001 to 10000 employees", "Founded": " 1976", "Type": " Company - Public (KLAC) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Applied Materials, Nanometrics"}, "estimatedSalary": "79000", "jobDescription": " Company Overview  KLA-Tencor Corporation (NASDAQ:KLAC), a leading provider of process control and yield management solutions, partners with customers around the world to develop state-of-the-art storage, compound semiconductor, photovoltaic, and other related nanoelectronics industries. With a portfolio of industry-standard products and a team of world-class engineers and scientists, the company has created superior solutions for its customers for over 35 years. Headquartered in Milpitas, California, KLA-Tencor has dedicated customer operations and service centers around the world. Additional information may be found at www.kla-tencor.com.  Group/Division  Corporate Information Technology (IT) partners with each division in KLA-Tencor to develop, engage and promote global enterprise solution leading the way with innovations which meet the business' needs.  IT is responsible for delivering consultative services in support of our world-wide design engineering teams to meet our strategic objectives of bringing new products to market Better, Faster, and Cheaper. Responsibilities The Data Analyst Engineering Intern position will focus on engaging with our internal engineering teams to understand and provide solutions to complex data science problems. Interface with the global Design Engineering group and provide consultative services and solution which will support meeting our strategic objectives of bringing new products to market Better, Faster, Cheaper.Be responsible for identifying how we can use advance algorithm and various data mining techniquest to create actionable insights. Solutions can entail enhancements to current enterprise wide applications, changes to business process, application substitution or new technologies which will yield the desired improvements.Must have a strong working knowledge of statistics, machine learning and some visualization tools. Preferred Qualifications KNOWLEDGE: Knowledge in Machine Learning algortihms, R scripting, and Python are essentialJOB COMPLEXITY: Work on significant and unique issues where analysis of data will provide new and unique actional insights. The data analyst will exercises independent judgment in methods, techniques and evaluation criteria for obtaining results.SUPERVISION: Acts independently to determine methods and procedures on new or special assignments.Experience with the Semi Conductor is a plus.People person with the ability to establish good relationships with business partnersMinimum QualificationsCompleted or working towards a Master or PHD is Analytics. Equal Employment Opportunity  KLA-Tencor is an Equal Opportunity Employer. Applicants will be considered for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other characteristics protected by applicable law."}