{"jobID": "2788377999", "jobLocation": "Redmond_WA", "jobTitle": "Data Scientist 2", "companyRating": "4.1", "companyInfo": {"Website": "www.microsoft.com", "Headquarters": "Redmond, WA", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (MSFT) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Amazon, Apple"}, "estimatedSalary": "143000", "jobDescription": "The Microsoft Edge Team in the Experiences and Devices Group uses insights from data to improve the quality of Edge on our devices and services. Our work spans PCs, Xbox, mobile devices, HoloLens, and more. We combine our data science work with business and engineering knowledge to provide unique and compelling insight into customer scenarios that are chiefly responsible for informing a broad range of crucial org-wide decisions.  We are looking for highly motivated and passionate data scientists to apply scientific methodology to data to drive Edge success. We hire great people with diverse multi-disciplinary backgrounds, engineering and analytical skills, business experience, relentless curiosity, and a motivation to improve product quality and business outcomes with data. You should have a clear record of using data to improve the world around you and demonstrate an aptitude for mentoring others. Our work is highly varied and offers a chance to focus on many different data science techniques and aspects of the Edge business.  As an expert in data science, you will formulate approaches to solve challenging problems using well-defined algorithms and data sources in context of customer, engineering, and business needs. You will use data exploration techniques to discover new questions or opportunities within your problem area. You will also interpret the results of their analysis, validate their approach, and learn to monitor, analyze, and iterate to continuously improve. You will engage with peers to produce clear, compelling, and actionable insights that influence product and service improvements; crafting the experience hundreds of millions of customers have with Edge. You will contribute to research, identification, prototyping, and productizing of ML/AI techniques and algorithms that result in specific action plans. You will also engage in the peer review process and act on feedback while learning innovative methods, algorithms, and tools to increase the impact and applicability of your results. Responsibilities"}