{"jobID": "2827679036", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist, Marketing Analytics", "companyRating": "3.5", "companyInfo": {"Website": "www.prosper.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " LendingClub"}, "estimatedSalary": "132000", "jobDescription": " Who Are We?  Prosper is built on a simple idea: connect people who want to borrow money with those that have money to invest. Prosper is an online marketplace that gives borrowers access to individual and institutional investors. Borrowers get low, fixed rates with no hidden fees or prepayment penalties. Investors can earn great returns through the platform's data-driven underwriting for personal loans, creating a new and diverse investment opportunity. Through Prosper, more than $12 billion in personal loans have helped borrowers consolidate their credit card debt, pay for large purchases, make home improvements and cover medical expenses. Prosper Marketplace is headquartered in San Francisco and operations in Phoenix.  Prosper Marketplace is headquartered in San Francisco. The Prosper marketplace lending platform is owned by Prosper Funding LLC. For more information visit: www.prosper.com and follow Prosper on Twitter @ProsperLoans.  Our Team  Our Blog  What We Need  We are seeking an experienced data scientist to join our Marketing Analytics team in San Francisco. The successful candidate is a rigorous data analyst with a passion for seeking truth and driving Prosper's omni-channel marketing strategy. You will apply statistical and economic models to inform spend decisions for Prosper's multi-million dollar marketing budget. You must be able to work both independently and in a collaborative environment with acute attention to detail. This role will be reporting to the Director, Marketing Analytics.  What You Will Do Lead investigations into marketing program economics - segmentation, targeting, messaging, conversion, and loan performance - to drive growth and increase efficiencies.Leverage models to inform key marketing initiatives such as cross-channel spend allocation (UA and retention), expected response, multi-touch attribution, and LTV.Partner with marketing, product&risk; teams to create, develop and integrate marketing testing that align with product and risk strategies.Perform A/B test analysis and present test results and recommendations.Influence key decisions across marketing, product, and risk programs through robust data analysis, distilling and presenting actionable insights.Align closely with business units to develop analysis and predictive modeling to drive critical business organizational decisions and optimization efforts. What You Will Need To Have Master's Degree in STEM or other quantitative field. PhD preferred but not required.2+ years experience in a statistical modeling oriented role; marketing analytics experience preferred.Strong knowledge of Python / R or other mathematical programming languages; experience working with large data sets preferred.Knowledge of SQL preferred but not required.Proven experience with statistical modeling techniques.Desire to work in a fast paced, ever changing, start-up environment.Ability to drive solutions to complex problems quickly and successfully, both individually and as part of a team effort.Willingness to learn new skills and embrace a team-first culture. What's in It For You  In addition to working for a world class FinTech company and having a lot of fun doing it, Prosper provides its employees an excellent compensation and benefits plan. The plan includes incentive bonuses, stock options, company paid health, dental and vision insurance, paid vacation time, 401k with employer match and even fitness reimbursement and commuting reimbursement benefits."}