{"jobID": "2580211990", "jobLocation": "Brooklyn_NY", "jobTitle": "HR Manager", "companyRating": null, "companyInfo": {"Website": "www.nuxeo.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Alfresco Software, OpenText, M-Files"}, "estimatedSalary": null, "jobDescription": " AboutNuxeo provides a Hyperscale Digital Asset Platform that helps enterprise organizations unlock the full value of their digital assets. Leading organizations use Nuxeo for digital asset management, document management, knowledge management, and other content-centric business applications. Our mission is to empower your digital transformation by unlocking the value of your digital assets. What you will doNuxeo is hiring a self-starting, culture-building, gets-stuff-done Manager of HR to be based in our Brooklyn HQ and to help the Nuxeo team grow quickly over the next few years. The right person for this role will have a do-it-all mentality, and will be excited about joining a fast-paced tech company with an international footprint. Responsibilities you will have:Create a US HR strategy, including: recruitment, performance management, employee development, employee engagement, compensation, benefits, retention, compliance and culture initiativeBuild and iterate HR systems and processes to support a workforce that will scale our teams to grow quickly over the next few yearsGive strategic guidance to the executive leadership team; develop strong, proactive collaborative working relationships across the organizationBe a key team-building leader and people manager: someone people look to for guidance on a range of personal and professional challenges and questionsEstablish scalable solutions empowering our leaders to be better managers and develop programs that prepare high-potential employees for their next roleGet your hands dirty: we are a small company and we all wear a lot of hats. In this role you will be asked to pitch in wherever possible, and you will definitely have to roll up your sleeves and do the grunt work when needed What we are looking forSkills and qualities we are looking for:5+ years of experience building and leading HR processesPrior experience in high growth, high tech, innovative companies is a huge plusDeep knowledge and experience with legal HR compliance mattersExperience with the sensitive stuff, comfortable handling challenging HR issues with the appropriate stature, demeanor, and compassionHave excellent project management skills with a proven ability to design and implement people strategies and policies that drives business resultsBe entrepreneurial, energetic, self-directing, ready to roll up your sleeves, and excited about growing a tech company and an HR organizationIn an ideal world, you will:Be a natural coach and mentor who relates well with people across a huge spectrum of backgrounds and personalities, listens and communicates well, and who can build rapport with a diverse and eclectic workforceBe data-minded, comfortable with metrics, able to communicate numerically as well as personallyHave a great sense of humor and like to have fun at workBA/BS required, additional degrees/certifications always a plusWhy Nuxeo?Challenge: the opportunity for growth in a fast-paced, innovative tech company is yours for the taking. We have best-in-class technology, a top-flight management team, and an incredible market opportunity, and this is your opportunity to make a difference as you build an HR function from the ground upCompensation: we hire top talent, and we pay our people accordinglyBenefits: good medical/dental through TriNet (lots of plans), 8 weeks 100% paid parental leave, 401k plan + 5% company match, 3 weeks of PTO + holidaysOur people: we have a great team, filled with hard working people who also like to hang out together outside of work. Wide variety of different types, very collegial environment, with everyone working toward a common goal.Additional Information Contract type:Full-Time"}