{"jobID": "2819839204", "jobLocation": "Palo_Alto_CA", "jobTitle": "E-Billing Specialist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "New locations. New business ventures. New career opportunities. Working at Wilson Sonsini Goodrich & Rosati is a challenging and rewarding experience. Our firm is recognized as the leader in providing legal and business advice to technology and growth companies at all stages of development. Our broad spectrum of practices and entrepreneurial spirit allow our staff exceptional opportunities for professional growth and explorationJob DescriptionThe E-Billing Specialist is responsible for handling all aspect of eBilling from engagement to collections. The ideal candidate will be someone who has a thorough knowledge of the billing process as well as the Aderant billing system and the E-Billing Hub. This position works directly with clients to understand their needs and ensure a successful migration to E-Billing with WSGR. The E-Billing specialist will also work collaboratively with WSGR's Client Account Representatives to assist in timely collections of all electronically submitted invoices.Job ResponsibilitiesFoster and maintain professional and collaborative relationships with clients, attorneys, billing service representatives, and client account representatives to ensure compliance with client and attorney billing specifications.Responsible for client onboarding to E-Billing, including thorough review and implementation of client outside counsel guidelines and proper coding and set up in Aderant, the E-Billing Hub, and the E-Billing vendor sites.Work with new E-Billing vendors to implement as required by clients.Proactively manage submission and approval of working timekeepers for each client/E-Billing vendor monthly.Review and maintain proper rate structure; coordinate with billing service representatives as needed. Monitor tier discounts, budgets and fee caps. Escalate potential issues that might occur and delay billing.Submit all electronically billed invoices through the eBillingHub or the client's chosen eBilling vendor.Review time entries based on client and matter requirements (block billing, task codes, summer associate time, etc). Review cost entries and receipts for compliance with outside counsel guidelines. Review invoices for application of discounts or fee agreements where applicable.Diligently monitor and address eBilling issues and rejections with attorneys, client accounting representative, and billing service representatives as needed.Respond to inquiries from client accounting representatives and attorneys relating to payment status of invoices. Work closely with them to address any issues that might be preventing approval and payment.Coordinate with attorneys on status and budget requests for clients and submit to eBilling vendor sites.Monitor and address reduced payment of invoices.Manage and maintain client accounts for proper billing processes and procedures.Skills RequiredStrong attention to detailExcellent written and verbal communications skills.Strong organizational skills and ability to manage large amounts of dataProficiency in Microsoft Office (Work, Excel, Outlook)Customer Service FocusedExperience working independently, within cross-functional teams, in a collaborative environment.Education, Certification, and/or Experience2-5 years of experience with electronic billing applications and processesKnowledge of electronic billing systems (eBillingHub, Serengeti, Collaborati, CounselLink, TyMetrix 360, CounselGO)Bachelor's degree or equivalentWe offer a highly competitive salary and benefits package. Visit our website here. Equal Opportunity Employer. APPLY HERE: https://wsgr.wd1.myworkdayjobs.com/en-US/WSGR/job/Palo-Alto/E-Billing-Specialist_1844"}