{"jobID": "2481037904", "jobLocation": "Boston_MA", "jobTitle": "Senior Business Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.draftkings.com", "Headquarters": "Boston, MA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " FanDuel"}, "estimatedSalary": "88000", "jobDescription": " DraftKings is a leading sports entertainment brand that creates the most exciting digital sports competitions and experiences on the planet. Our goal is to transform the way fans experience sports. Our mission is to make sports better and make better sports fans by bringing them closer to the games they love.  As a Senior Business Data Analyst, you will be an internal consultant and focus on transforming data into actionable business insights to fuel the growth of DraftKings. Data is at the heart of every decision made within DraftKings, and our analytics team works to solve problems across a wide variety of topics. What you will do:Optimize acquisition spend and marketing strategies to drive growthRecommend contest sizing to positively impact the user experience and business efficiencyAnalyze and understand customer behavior throughout our platformIdentify ways to improve customer game-play through on-site changesMeasure how new features or site changes are driving changes in customer behaviorDevelop and systematize standard reporting for key business results (contest performance, player activity, segment performance, key player performance reporting)Build and execute test plans and drive the learning agenda for your areaProvide guidance/critique for others on their analysisWhat you will need to bring:BS in Engineering, Mathematics, Business, Finance, or a related field3+ years of analytics experience, preferably in an e-commerce or mobile gaming companyExperience with SQL, SAS, Matlab, Python, R, or other programming language requiredKnowledge of statistics and hypothesis testing required, with model building experience a strong plusDemonstrated history of autonomously developing new insights from dataStrong communication and organizational skillsComfortable in fast paced, results driven environmentAvid fantasy sports player with deep understanding of the daily fantasy sports industryHighly proficient with data analytics, and experience in data manipulation using a variety of toolsStrong communication and business consulting skills; able to influence others including and up through VP level to take actionExtremely strong ability to problem solve, with emphasis on working through ambiguityProven history of taking initiative, and having a self-driven approach to determining whats important to focus onNatural curiosity, and a demonstrated ability to turn observed data into a story about what behavior is driving that dataAutonomously defines the framework or approach to complex problemsSystematically seeks context in all situations before acting At DraftKings, we promote diversity and are proud to be an equal opportunity workplace."}