{"jobID": "2826812348", "jobLocation": "Seattle_WA", "jobTitle": "Senior Data Analyst - User Engagement", "companyRating": "3.3", "companyInfo": {"Website": "www.redfin.com", "Headquarters": "Seattle, WA", "Size": "1001 to 5000 employees", "Founded": " 2004", "Type": " Company - Public (RDFN ) ", "Industry": " Real Estate", "Revenue": " Unknown / Non-Applicable", "Competitors": " Zillow, Trulia, Coldwell Banker"}, "estimatedSalary": "78000", "jobDescription": " Redfin is redefining real estate in the consumer’s favor by combining our own technology and agents to create a service that’s better, faster, and costs less. As a Redfinnian, you'll make a difference in one of life’s most important events—buying or selling a home. Our hiring standards are high, our culture is humble. If you’re a brilliant analyst with fire in your belly to do work that matters, we want to hear from you.  As a Senior Analyst, focused on user engagement, you’ll use some of the most robust real estate data in the world to answer questions and build tools that drive key business decisions across the entire company. How should we define the stages of engagement with our technology? How can we improve our product to keep potential homebuyers and sellers coming back? How can our technology better tailor itself to the needs of each person using it? We need a Senior Analyst to help us turn the mysteries of user engagement into clear and undeniable recommendations for action. The RolePartner with Engineering, Product Management, and Data Scientists to analyze the health of our technology and prioritize potential projectsBuild beautiful, powerful reports in Tableau and / or RStudio that make it easy to dig into the state of our technologyCraft and deliver presentations on the state of user engagement, or on the results of recent analysis, to Product and Engineering teams and to C-level executive teamHelp create strategic A/B tests and analyze often-complex resultsDesired Skills & ExperienceBachelor’s degree in statistics, computer science, or a related fieldExpert-level SQL, Tableau, and Excel skillsAbility to build models and design experiments that produce actionable results fastBrilliant communication skills, ability to explain complex ideas clearly to a nontechnical audienceAn analytical juggernaut who doesn’t stop at the “What?” but hungers for the “Why?” and “What if?”Expertise with R or Python a plusWhat We OfferCompetitive compensation packages with a salary, bonuses, and stock grantsGenerous benefits, including three weeks of paid vacation, medical, dental, and vision insurance, and fully paid family leaveStrong startup culture with catered lunches, casual dress code, happy hours, and more To make sure we hire the most qualified people, we’ve designed a multi-step selection process which may include interviews, a homework assignment, and a reference check. We’re excited to get to know you and hope you’re ready to give this opportunity everything you’ve got!  Redfin is an equal opportunity employer committed to hiring a diverse workforce.Redfin"}