{"jobID": "2787890699", "jobLocation": "Foster_City_CA", "jobTitle": "Quant Research Intern", "companyRating": null, "companyInfo": {"Website": "www.bailard.com", "Headquarters": "Foster City, CA", "Size": "1 to 50 employees", "Founded": " 1972", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Bingham Osborn & Scarborough, Pzena Investment Management"}, "estimatedSalary": null, "jobDescription": "About Bailard Bailard is an innovative wealth management and investment management firm located in Silicon Valley and San Francisco. Built by entrepreneurs, Bailard attracts and retains talented individuals with intellectual curiosity, a passion for excellence, and a capacity for independent thought. Bailard maintains a high-trust culture that fosters professional growth and personal responsibility. We proudly serve more than 500 institutional and private clients, offering a variety of proprietary traditional and alternative investment products and extraordinary personal service. The Opportunity We are seeking a Quantitative Research Intern to assist the portfolio management team in researching stock selection strategies. In particular, we are looking to better understand analyst behavior at the granular level (forecast and recommendation changes) in domestic and international markets. The intern will work directly with portfolio managers and other analysts to pursue this research project. In addition, by exposure to weekly company-wide updates, quantitative research updates, and briefings on portfolio performance, the intern will gain insight into many aspects of asset management. QualificationsPhD/Masters (or currently pursuing graduate degree) in Financial Engineering, Math, Statistics, Computer Science, Economics, Physics or related fieldsCFA (or currently pursuing) or other equivalent financial experienceStatistical, modeling, probabilistic and data manipulation work done at a graduate level or in a professional settingDemonstrated skill with a variety of software programs, e.g. VBA, SQL, SAS, R, Python, scriptingCompensation: $25/hour + a great learning experience!Position type: Full-time internship; 10 weeks.How to Apply: In addition to your resume and cover letter, please submit answers to the questions below to dmckellar@bailard.com, subject line Bailard Quant Research Intern.QuestionsPlease note that the questions are vague do describe any assumptions that you feel are necessary. Be as specific as possible. 1. List and briefly describe some methods of measuring a quantitative factors effectiveness. Why might different methods lead to different conclusions?  2. A factor is tested on monthly data for an in-sample period between June 2005 and July 2007, showing good standalone backtest results. What concerns might you have before using this factor going forward? Briefly list some concerns, and specific ways to further analyze or mitigate them.  3. Another factor is tested which shows a curious pattern. In months where the overall market goes up, the factor also performs well, but when the market goes down, the factor performs poorly. What is going on here? Is this factor of any value? Can you describe a way of constructing such a quantitative factor?  4. Suppose that Apple and Bank of Americas stock returns have correlation 0.8, while Bank of America and Citigroup have correlation 0.9. What is the correlation between Apple and Citigroup?  Questions #5-7 relate to a table Analyst_Ratings below: Stock_Ticker Analyst_Name Rating_Date Rating_Name G Abramson 6/9/09 Hold  G Abramson 1/20/10 Sell  G Jones 12/5/09 Buy  5. Write a SQL query that would select the latest recommendation from each analyst for each stock.  6. Write a SQL query that would select the latest recommendation from each analyst for each stock as known on a specific date (e.g. 1/1/10).  7. What are some possible problems with this table design?"}