{"jobID": "2818412536", "jobLocation": "New_York_NY", "jobTitle": "Care Manager Registered Nurse", "companyRating": "3.0", "companyInfo": {"Website": "www.archcare.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1899", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " MJHS, VillageCare"}, "estimatedSalary": "65000", "jobDescription": " The Care Manager Registered Nurse plans and coordinates care management for members. Works in collaboration with Care Manager Social Worker and Clinical Services Associate to collaborate on the plan of care for the member, and also monitor effectiveness of the care plan and promote member satisfaction with the service provision.  • Communicates with enrollment personnel to ensure a smooth transition at the start of care.Maintains on-going telephonic communication with members and care givers.Collaborates with other Care Managers and the Primary Care Physician (PCP).Educates members and family in health management and community resources.Educates family members and family in health management and community resources.Participates and assists as necessary in development of the reassessment plan of care and makes changes in the plan of care based upon findings.Ensures that utilization of services is reasonable and necessary to member''s health and well being.Maintains oversight for the member's care management during inpatient acute episodes necessitating hospital admission. Ensures effective discharge planning for transfer to the community and resumption of services.Documents any change in member's condition and authorizes services to visit member for an assessment and possible change in the care plan.Participates in prevention, surveillance and control of infection via infection control policies.Intervenes as necessary to prevent dissatisfaction and resolve concerns and/or grievances.Participates in QAPI initiatives within ArchCare Community Life.Performs other related duties, as required. Education Requirements"}