{"jobID": "2830735850", "jobLocation": "Boston_MA", "jobTitle": "Trade Operations Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.wellington.com", "Headquarters": "Boston, MA", "Size": "1001 to 5000 employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "70000", "jobDescription": "WELLINGTON MANAGEMENT Wellington Management offers comprehensive investment management capabilities that span nearly all segments of the global capital markets. Our investment solutions, tailored to the unique return and risk objectives of institutional clients in more than 55 countries, draw on a robust body of proprietary research and a collaborative culture that encourages independent thought and healthy debate. As a private partnership, we believe our ownership structure fosters a long-term view that aligns our perspectives with those of our clients. POSITIONJOB RESPONSIBILITIESA Trade Operations Analyst will:Research and resolve trade and FX discrepancies by interacting with brokers, banks, and Wellington personnelInstruct trades and trade amendments to service providers when necessaryOversee external service providers (i.e. brokers, banks and vendors)Assist with the management and hiring of co-op students and internsManage strategic projects and initiatives as well as prioritizing information technology needs and requirementsParticipate in firm and industry working groupsPrepare reports for management and internal committeesMitigate risk through strong procedural discipline and prudent judgementResearch and evaluate operational requirements of new market/asset types being considered for investment or changes to existing marketsAssist other areas of the firm to support client needs and respond to general custody and trading inquiresAd hoc tasks as assignedJOB QUALIFICATIONS A Trade Operations Analyst must be able to work quickly and accurately under pressure, possess a high degree of analytical ability and have the ability to plan/prioritize tasks in a fluid environment. Team orientation and the ability to work in concert with external service providers and colleagues located around the world are essential. Successful candidates must have impeccable integrity, a fiduciary mindset, and the ability to consistently place the interest of our clients as the number one factor in judgment, decision-making and actions. Knowledge of equities, fixed income and foreign exchange is preferred but not required. Personal qualities and values that are consistent with and would be additive to Wellington Management's culture as described in our culture statementStrong analytical and problem solving skillsStrong organizational, verbal, and written communication skills, with an emphasis on accuracy, concision and timelinessA college degree with relevant work experienceExperience with commonly used business applications such as ALERT, OASYS, Bloomberg, Omgeo Connect/CTM, Omgeo TradeSuite and SWIFT will be considered a plusKnowledge of Microsoft Office (Word, Access, Excel) is required and technical skills, such as data mining via SQL, will be viewed favorablyGraduate education and/or professional coursework/certifications will be differentiatingJOB TITLE Trade Operations Analyst LOCATION 100 Federal Street  As an equal opportunity employer, Wellington Management considers all qualified applicants will receive consideration for employment without regard to race, color, sex, sexual orientation, gender identity, gender expression, religion, creed, national origin, age, ancestry, disability (physical or mental), medical condition, citizenship, marital status, pregnancy, veteran or military status, genetic information or any other characteristic protected by applicable law. If you are a candidate with a disability, or are assisting a candidate with a disability, and require an accommodation to apply for one of our jobs, please email us at Wellington@icareerhelp.com.SDL2017"}