{"jobID": "2788937949", "jobLocation": "San_Diego_CA", "jobTitle": "Report Writer/ Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.sharecare.com", "Headquarters": "Atlanta, GA", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": "Job Title: Report Writer/ Data Analyst, San Diego, CADepartment: Audit  Status: Full-TimeReports To: Director, Process Development  This job description is intended to be a general statement about this job and is not to be considered a detailed assignment. It may be modified to adjust for necessary changes.Job Summary This position is responsible for designing and implementing solutions related to reporting, analytics, data modeling and integration, and other business intelligence requests. Essential Job FunctionsObtain specifications for user report needs Develop new reports as needed/requested to provide timely and accurate information to decision makersTest and validate reports to insure accuracy and qualityMonitor performance of reports and taking corrective action to optimize or improve the performance of the reports when necessaryWork with Report Requester and Process Improvement Team to evaluate and clarify requests. Evaluate uniqueness of data request and offer alternative solutions where applicable, including non-automated methods of retrieving the requested informationElicit, document, and analyze reporting needs and requirements. Analyze data and reporting solutions to understand business impact, correlations/discrepancies, and to propose changes/alternate solutions.Analyze tables to establish knowledge of data for accurate retrieval and use in report writingWrite queries, views, or stored procedures to extract dataResearch workarounds to reporting service limitations and propose appropriate solutionsCreate scripts for importing, exporting, analyzing, mapping and converting dataDevelop and maintain a variety of report types, including but not limited to tabular, drill down, matrix, chartsMinimum Qualifications1-3 years of experience working with Microsoft SQL Server, Microsoft SQL Server Reporting Services (SSRS), building database queries, stored procedure writing and report creationAdvanced proficiency in MS Office, particularly Excel & AccessStrong analytical, quantitative and problem solvingTeam oriented with good interpersonal skills and the ability to collaborate effectively with coworkers and management teamMust be able to multi-task, handle multiple projects and meet internal deadlines Ability to manage own workload and take responsibility for tasksPreferred but not required: Report writing experience with Crystal Reports, Experience with Microsoft GPPhysical RequirementsAbility to sit or stand for long periods of timePhysical ability to lift and carry 25 lbs. of materialsManual dexterity and strength sufficient enough to enter information via computer keyboard for long periods of time, to write notes and information needed, and to pick up and hold paperwork, supplies and other items.Eyesight sufficient to effectively read documents and to accurately view information on a computer monitorSpeaking and hearing ability sufficient to effectively ……..Eye/hand coordination, hearing and visual acuity necessary for day to day tasksWorking ConditionsThe work environments involve everyday risks or discomforts which will require normal safety precautions typical of an office/clinical setting.Compensation PackageBased on experienceHealth InsuranceDental Insurance401k planAll business related expenses will be reimbursed through our expense report processHIPAA/ComplianceMaintain privacy of all patient, employee and volunteer information and access such information only on a need to know basis for business purposes.Comply with all regulations regarding corporate integrity and security obligationsReport unethical, fraudulent or unlawful behavior or activityMaintain current and yearly HIPAA certification.Acknowledgement Sharecare, Inc. and its subsidiaries are Equal Opportunity Employers and E-Verify users. Qualified applicants will receive consideration for employment without regard to race, color, sex, national origin, sexual orientation, gender identity, religion, age, equal pay, disability, genetic information, protected veteran status, or other status protected under applicable law. "}