{"jobID": "2632787859", "jobLocation": "Santa_Clara_CA", "jobTitle": "Senior System Software Engineer - Camera", "companyRating": "4.3", "companyInfo": {"Website": "www.nvidia.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1993", "Type": " Company - Public (NVDA) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "146000", "jobDescription": "We are looking for a Senior System Software Engineer - CameraNVIDIA’s invention of the GPU 1999 sparked the growth of the PC gaming market, redefined modern computer graphics, and revolutionized parallel computing. More recently, GPU deep learning ignited modern AI — the next era of computing — with the GPU acting as the brain of computers, robots, and self-driving cars that can perceive and understand the world. Today, we are increasingly known as “the AI computing company”. We are looking to grow our company, and grow with the smartest people in the world.  NVIDIA is hiring a senior system software engineer to work in Tegra Pixel software team. You will have very strong C/C++ programming skills, a solid background in OS fundamentals, and a deep understanding of camera/imaging software systems with emphasis on designing, developing, and testing system-level software.What you'll be doing: Design and develop camera drivers and system-level software for automotive and embedded system.Provide solutions to complex sensor and hardware control logic to work seamlessly with the imaging pipeline.Drive complex cross-team technical issues to closure.Specify software requirements and influence the hardware design of future SOC.Identify and address system-level performance and stability issues end-to-endDevelop unit and system-level regression testing for new featuresWhat we need to see:Dedicated and self-motivated, with a passion for developing fast and high-quality codeStrong design and programming skills in C/C++You have a good understanding of basic programming primitives, data structures, multi-threading, memory management techniquesExcellent analytical and problem-solving skills with an attention to detailsExperience in camera/imaging/video systemBS/MS degree in EE/CS/CE with 5+ years of experience, and strong verbal and written communication skills Ways to stand out:You have experience in one the following areas: Developing high-performance scalable and low latency softwareTracing at the user or kernel level for debugging and performance analysis.Telemetry, at the individual component level, or end-to-endDesigning reusable and extensible frameworks and APIsSystem software security, and secure development techniques NVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most brilliant and talented people on the planet working for us. If you're creative and autonomous, we want to hear from you!  NVIDIA is paving the way in groundbreaking developments in Artificial Intelligence, High-Performance Computing and Visualization. The GPU, our invention, serves as the visual cortex of modern computers and is at the heart of our products and services. Our work opens up new universes to explore, enables amazing creativity and discovery, and powers what were once science fiction inventions from artificial intelligence to autonomous cars.  NVIDIA is looking for extraordinary people like you to help us accelerate the next wave of artificial intelligence.  We are an equal opportunity employer and value diversity at our company. We do not discriminate based on race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.NVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression , sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law."}