{"jobID": "2797273595", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Scientist / Data Analyst", "companyRating": "3.0", "companyInfo": {"Website": "www.vcahospitals.com", "Headquarters": "Los Angeles, CA", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Consumer Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "101000", "jobDescription": "VCA Inc. is seeking a Data Scientist/Data Analystto join the IT Engineering team at our Support Office in West Los Angeles, California. ABOUT THE COMPANY: VCA Inc. owns, operates and manages the largest network of freestanding veterinary hospitals and veterinary clinical reference laboratories in North America, with over 800 hospitals located in 43 U.S. states and 5 Canadian provinces and more than 55 clinical laboratories. VCA is also a leading supplier of diagnostic imaging equipment to the veterinary industry, as well as operating a franchisor of premier dog daycare facilities. www.VCA.com JOB DESCRIPTION: VCA IT Department seeks an experienced data analyst with expertise in data management, statistical analysis and computer science and work closely with veterinarians of the organizations to manage, integrate and analyze health data. As a data analyst, you will work in a highly collaborative fashion as a core member of the BI Team to prioritize data collection, transformation, and advanced data analysis techniques. You will help define and measure key metrics, promote new analytical techniques, question assumptions, and tell the story behind the numbers. You will develop a deep understanding of our data, tools, and processes. RESPONSIBILITIES: This position is responsible for the analysis of health information, obtained from various sources, including clinical, financial and demographic data. It requires careful preparation, integration, analysis for the purpose of promoting information sharing and growing a foundational data science research effort with applications to pet health care. Perform complex data analysis in support of ad-hoc and standing user requests.Develop programs, methodologies, and data sets for analyzing and presenting data.Research new data sources and analytical tools; contribute to new application development and data quality improvement efforts.Use and support database applications and analytical tools: evaluate data quality, applications and functions, produce output, maintain operation and resolve data access and interface issues.Performs evaluation and analysis of data using standard statistical; prepares reports documenting results of findings and recommendations may participate in formal or informal presentation of research findings.QUALIFICATIONS:Experience with large scale data warehouse solutions and query languages like SQL.Experience in supporting BI/EDW Architecture, building data pipelines, and cloud platforms like Azure/AWS.Strong statistical knowledge and proficiency with a statistical analysis tool such as R preferred.Fluency in high-level programming languages such as Python preferredFluency in one or more object oriented languages like C#, C++, Java preferredProven experience writing queries regularly and using Power BI, SSIS and SSRS experience a plus.Pet health or human health experience preferred.Knowledge of or experience working with Azure ML and building and deploying predictive models5+ years relevant experience as a data analyst with a proven track record on advanced analytics projects.MS/BS degree in Statistics, Mathematics, Operations Research, CS, Econometrics or related field preferred.Physical Requirements and Working Conditions: Must possess mobility to work in a standard office setting and to use standard office equipment, including a computer, stamina to maintain attention to detail despite interruptions, strength to lift and carry objects weighing up to 40 pounds; vision to read printed materials and a computer screen; and hearing and speech to communicate in person and over the telephone. If interested in this opportunity, please click the “Apply” link below.Ifyou think this would be an ideal opportunity for someone you know, click “Share.”Required Skills Required Experience Job Location  Los Angeles, US-CA "}