{"jobID": "2650549228", "jobLocation": "Santa_Clara_CA", "jobTitle": "Deep Learning Software (TensorRT) - New College Grad", "companyRating": null, "companyInfo": {"Website": "www.nvidia.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1993", "Type": " Company - Public (NVDA) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "We are now looking for Deep Learning Software Engineers (New College Grads) to join our TensorRT team: Today, research in Artificial Intelligence is booming worldwide, and NVIDIA is in a rare position to make a positive impact on the field with its GPU technology and software tools. Extraordinary tools like TensorRT play a significant role in proliferating use of Deep Learning to solve problems in a diverse set of domains.  As an Engineer on our TensorRT team, you will create impact in the world of Artificial Intelligence, especially in the hyper-scale data center, embedded and automotive product platforms markets. The position offers you a rare chance to work on high-performance neural network inference engines for a broad range of AI/Deep Learning applications like object detection, text processing, video analytics and more. Join the team which is building software which will be used by the entire world! What you'll be doing:You'll deliver test automation, functional and performance test suites, and drive automated test coverage, execution and triage failuresYou'll be responsible for building and releasing infrastructure; also, you'll define test strategy, plans, and review them with partnersYou'll work closely with the infrastructure team to drive TensorRT automation and continuous integration needsWhat we need to see:BS or MS in Computer Science or related fieldDeep understanding of OOP concepts and C++Experience in scripting using Python or other widely used languages/toolsPositive attitude with the ability to work independently and in a team environmentWays to stand out from the crowd:Familiarity with GPU computing (CUDA, OpenCL) and HPC (MPI, OpenMP)Knowledge of Deep Learning conceptsExperience working in agile/scrum team environments #deeplearning  ​​NVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression , sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law."}