{"jobID": "2705069772", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist - Platform Development & Applied Consulting", "companyRating": "4.3", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "141000", "jobDescription": "About Uber We’re changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now we’re a part of the logistical fabric of more than 600 cities around the world. Whether it’s a ride, a sandwich, or a package, we use technology to give people what they want, when they want it.  For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer.  And that’s just what we’re doing today. We’re thinking about the future, too. With teams working on autonomous trucking and self-driving cars, we’re in for the long haul. We’re reimagining how people and things move from one place to the next. About the Product Platforms Data Science Team The Product Platform Data Science Team is a collection of teams that work horizontally across Uber. That means you’ll be solving problems in all different domains, with varying datasets, and novel challenges every day. Our teams break into several categories: PlatformDevelopment: We work toward the construction of scalable, powerful and easy-to-use platform tools that are used by everyone at Uber. Specifically... Forecasting and Anomaly Detection Platform - We develop cutting-edge methodologies to forecast business critical metrics over short and long horizons and to detect anomalous behavior. We also build a platform that makes our tools readily and broadly available.Experimentation Platform - The bedrock of all testing at Uber, we design, enhance, and expand the suite of experimentation tools for teams in search of insights and learnings.Natural Language Processing Platforms - Text and language surround Uber, so multiple teams require core DS skills as well as knowledge of NLP. These platforms are the backbone of Uber, impacting Marketplace to Marketing to Operations and every team in between.Communication PlatformCustomer SupportPeople ProductsSemantic PlatformsApplied Consulting: We consult and embed with internal data scientist, engineering, and operations teams to solve technically challenging problems and deliver customized solutions. AppliedMachineLearning - We are team of ML enthusiasts, who consult with Uber teams on projects across the entire company. Our team builds large-scale ML models, consults on optimal ML approaches, and prototypes new techniques and technology. We’ve pioneered Deep Learning for NLP, Computer Vision for document processing, and causality modeling to optimize incentives.BehavioralScience - The LABS team (Leveraging Applied Behavioral Science) translates theories from psychology, marketing, neuroscience, etc. into practice by collaborating with product and regional teams to guide the ideation and implementation of science-backed product development and business processes through experimentation.What you could be doing:"}