{"jobID": "2802905993", "jobLocation": "Boston_MA", "jobTitle": "Registered Nurse - Med Surg - 7 East Newton Pavilion - 36 Hours - Day/Night/Rotating - Every Other Weekend (MNA)", "companyRating": "3.6", "companyInfo": {"Website": "www.bmc.org", "Headquarters": "Boston, MA", "Size": "1001 to 5000 employees", "Founded": " 1996", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "43", "jobDescription": " The registered nurse, adheres to the rules and regulations of the Massachusetts Board of Registration in Nursing. The registered nurse is primarily responsible for professional performance and direct patient care. The role encompasses nursing assessment, diagnosis, planning, intervention, evaluation, and coordination of care for patients and their families across the health care continuum. The registered nurse is accountable for clinical, educational, quality and fiscal patient care outcomes using the model of care designed by the nursing department and in accordance with established agency policies, procedures, protocols, guidelines and standards of practice.Full Time 36 Hours - D/N/Rotating - Every Other Weekend - Newton Pavilion - MNA  Graduate of an accredited school of nursing with an Associates degree or Baccalaureate degree in nursing (BSN). BSN preferred. Candidates who do not have a BSN must be enrolled in a Baccalaureate program within 6 months of hire and must complete their BSN within 36 months of hire.  Registration and current RN licensure in the state of MA in good standing required.  Requires current basic life support (BLS) certification. Some units may require Advanced Cardiac Life support (ACLS) certification. Med/Surg or telemetry experience preferred. Chemo certification preferred.  Additional certifications may be required for certain practice areas Basic computer proficiency inclusive of ability to access, enters, and interpret computerized data/information.Effective interpersonal skills to facilitate communication with various members of the health care team, patients, and families.Organizational skills to set priorities and efficiently complete assigned work.Multilingual skills (beyond that of English) in languages appropriate to the patient populations served by the medical center preferred.Relevant clinical experience and/or specialty, certification required for certain practice areas, e.g., enterstomal therapy, epidemiology, peri-operative areas.Analytical ability to solve clinical nursing issues and conduct quality improvement research utilization projects.Ability to effectively delegate appropriate patient care activities.Effective verbal and written communication skills appropriate to the patient populations served.Physical ability to meet the core job responsibilities in accordance with practice setting demands for the patient populations regularly served.Ability to effectively manage stress due to critical issues related to patient care, changing organizational climate and personnel issues."}