{"jobID": "2825538337", "jobLocation": "San_Jose_CA", "jobTitle": "Immunology Sales Specialist, Dermatology", "companyRating": "4.0", "companyInfo": {"Website": "www.jnj.com", "Headquarters": "New Brunswick, NJ", "Size": "10000+ employees", "Founded": " 1887", "Type": " Company - Public (JNJ) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Abbott Labs, Novartis, Covidien"}, "estimatedSalary": "39", "jobDescription": "Janssen Biotech, Inc., a member of the Johnson & Johnson Family of Companies, is recruiting for an Immunology Sales Specialist, Dermatology to support the San Jose, CA territory.At the Janssen Pharmaceutical Companies of Johnson & Johnson, what matters most is helping people live full and healthy lives. We focus on treating, curing and preventing some of the most devastating and complex diseases of our time. And we pursue the most promising science, wherever it might be found.Janssen Biotech, Inc. delivers on the promise of new treatments and ways to improve the health of individuals with serious disease. Built upon a legacy of innovative firsts, Janssen Biotech pursues advancing patient care with immunology and oncology solutions.Please visitwww.JanssenBiotech.comfor more information.We are Janssen. Our mission drives us. Our patients inspire us. We collaborate with the world for the health of everyone in it.As the Immunology Sales Specialist, Dermatology you will:Be responsible for attaining sales objectives, presenting complex clinical and business information on Janssen Biotech's immunology products and services to an audience of office and institutional based Dermatology healthcare professionals, government agencies, professional and patient groups, health plans and others involved in the decision making process.Use discretion and judgment to execute the franchise and company brand strategy and tactics within the assigned customer segment, which may include physicians within specialty medical practices and their staff, specialists within local hospitals, clinics, and pharmacists within a specific geographic area.Influence decision makers and influencers within assigned customers to support the use of the company's products in the treatment of relevant disease states by developing and applying clinical and business expertise, and effective selling skills.Execute marketing strategies at the local level, leveraging resources appropriately and working successfully with company team members and counterparts to share ideas and information to enhance business results.Build customer loyalty by identifying and cultivating relationships with key decision makers at the local level who can influence decision making within the healthcare provider systems.QualificationsRequired Qualifications:A minimum of a Bachelors DegreeA valid driver's license and the ability to travel as necessaryMust reside in close proximity to the geography or be willing to relocate to it.Minimum oftwo (2) years of direct selling experience to healthcare professionals in the pharmaceutical, biotech, device or healthcare industry, or large account management, or business to business experiencePreferred Qualifications:Experience selling injectable / infused productsWorking knowledge of immunology and/or the Dermatology fieldExperience managing through complex reimbursement issuesExperience in project oriented selling situations in a high incentive and individual performance culture is preferred, along with a documented successful sales performance (high growth, results vs. planCompletion of Management Development course(s)Johnson & Johnson Family of Companies are equal opportunity employers, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, protected veteran status, disability status, or any other characteristic protected by law.Primary Location United States-California-San Jose Organization Janssen Biotech, Inc. (6014) Job Function Selling Pharmaceutical Requisition ID4382180615"}