{"jobID": "2738307172", "jobLocation": "New_York_NY", "jobTitle": "Front-End Developer Intern", "companyRating": "4.4", "companyInfo": {"Website": "www.saavn.com", "Headquarters": "New York, NY", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "55000", "jobDescription": "JOB TITLE: FRONT-END DEVELOPER INTERNLOCATION: NEW YORK, NYOUR STORY: Saavn is South Asias leading music streaming service with over 22 million active million users. We are 200 entrepreneurs, across New York, California, Mumbai, Gurgaon, and Bangalore, who help music lovers access, discover, and listen to their favorite songs across languages and genres. In early 2018, a merger between Jio Music and Saavn was announced; creating a combined entity valued at over $1 billion.  We blend digital technology, data analysis (which we have affectionately coined Music Science), and a strong, fearless business acumen to reach all corners of the globe. Through partnerships with Apple, Google, Amazon, Facebook, Twitter and Shazam - to name a few - Saavn reaches more music fans across the world. Our award-winning mobile products, partnerships, innovations and thought leadership have been featured in some of the worlds leading publications, from The New York Times, to The Wall Street Journal, The Economic Times to Forbes, and many more. We are well-funded by some of the worlds most successful institutional investors and global media companies as well as a number of strategic individuals. Beyond investing, they are advisors and supporters of our vision, our passion, and our collective ability to deliver a revolutionary music experience as the leader in India. OUR CULTURE: At Saavn, we ignite passion and performance to work towards a collective goal: creating the perfect mobile entertainment ecosystem that delivers the best possible music experience to millions of listeners around the world. Our default mode is that of perpetual innovation. Together, we form a concerted rhythm that goes beyond borders. We don't just go with the flow, we create it.  Saavn offers a dynamic and unconventional work environment, full of fun wholesome experiences from in-office performances by some of the worlds most beloved musicians to opportunities for international travel. We believe creativity and technology blend together like sweet melodies. When you choose Saavn, you join a diverse world of high-calibre techies, artists, and inventors hailing from companies like Yahoo!, Twitter, LinkedIn, Google, Qualcomm, HBO, Microsoft, Flipkart, Amazon, Paytm, Quikr, MSN, and NDTV. We are one of the few digital companies to provide employment opportunities that meet the Silicon Valley benchmark right here in Mumbai! Figures, since weve got Silicon Valley covered, too.  Our value-based, people-first work culture is about empowering every individual in our global team to be catalysts for change in this dynamic digital world. Every day is an opportunity to bring your vision to life, and to expand, learn and grow. No idea is left unconsidered. No voice is left unheard.  With listeners speaking multiple languages in almost every country in the world, we like to think we have the most diverse user base on the planet. This has only been made possible because of the value we place on radical inclusivity in our offices across the globe. We believe different is wonderful, and what sets us apart is also what brings us closer. Saavn prides itself on being an equal opportunity employer. We have committed ourselves to creating a safe environment with fair and equal access and opportunities, sans discrimination. We encourage everyone to be open to experiences and perspectives beyond their normal; divergent thinkers create differentiated products, and even better music.  If our vibe matches with yours, we'd love to hear from you. ROLE: Saavn is looking for a well-rounded and meticulous Front-End Developer Intern to join our team and help bring our design ideas to life. You should love the web (and mobile too would be even better), care as much about your code as designers do about their designs, and know how to bridge the gap between the two. You love taking concepts and transforming them into amazing experiences, beautiful animations, performant code, and most of all, love and take great pride in what you do. Saavn interns are not kept out of sight in copy rooms! The Front-End Developer Intern will report directly to the Chief Product Officer & SVP, Design. RESPONSIBILITIES:Help build and implement new site (and potentially mobile app) features and interactionsImprove, rebuild, and optimize existing features and elementsCollaborate and strategize with the Design and Engineering teams to ensure interactions are fully optimized, properly implemented, and built to performHave an opinion, produce consistently great work, and champion simplicity in all our products and user experiencesREQUIREMENTS:Bachelors/Masters Degree in progressKnowledge of Javascript (both native and jQuery), HTML(5), CSS(3), and browser complianceUnderstanding of native DOM APIs, the pros and cons of various Javascript implementations (inline, unobtrusive, etc)Knowledge of the latest web technologies, and an interest in using them when appropriateExcellent verbal and written communication skillsObsession with user experience and pixel perfect designsObsession with code quality, cleanliness, and organizationIdeally youll also have knowledge of one or more of these skills: iOS, Android, or Windows native development, UI / UX Design, and Hand sketching and illustrationBENEFITS AND PERKS: At Saavn, we blur work and play, and you get all the perks of a global company. You will get to work with a dynamic group of entrepreneurs, who are delivering results and working zealously across time zones to make a difference in the way the world experiences music. We love what we do, and we think you will too. Paid Internship!Free healthy (and unhealthy) lunches, snacks, and drinksSaavn-sponsored team outingsWE ARE PROUD TO BE AN EEO EMPLOYER M/F/D/V"}