{"jobID": "2746872306", "jobLocation": "Burlingame_CA", "jobTitle": "Intern – Airport Facilities Planning", "companyRating": null, "companyInfo": {"Website": "www.jacobs.com", "Headquarters": "Dallas, TX", "Size": "10000+ employees", "Founded": " 1947", "Type": " Company - Public (JEC) ", "Industry": " Construction, Repair & Maintenance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Fluor, Bechtel, AECOM"}, "estimatedSalary": null, "jobDescription": " LeighFisher, a global transportation management consulting firm (a subsidiary of Jacobs), is seeking highly motivated individuals to work in its aviation division, business and finance practice based in the United States. LeighFisher looks for outstanding candidates with strong academic credentials, a passion for numbers and problem-solving and a desire to work as part of a team on cutting-edge projects for our aviation clients. For more information on LeighFisher, please visit our website at http://www.leighfisher.com.  • Develop software tools to analyze and communicate aviation data and analyses  • Work with our project teams to develop large-hub airport master plans  • Design and model airport runway and taxiway systems  • Assess impacts of transportation networking companies (Uber, Lyft) on airport ground access  • Conduct strategic and integrated environmental and climate change assessments  This is a paid internship and will be based in our Burlingame, CA office. Housing and relocation assistance are not provided.Successful candidates should meet the following qualifications:Going into the fall 2018 semester, should be going into at least their junior year of a four year degree program in engineering, architecture, computer science, or related field of study is requiredMust have at least a 3.0 GPADemonstrated passion for aviationWorking knowledge of Microsoft Word and ExcelStrong analytical, conceptual, communication and organizational skills.Ability to work and thrive in a team environment.LeighFisher offers a highly competitive compensation and benefits package and the opportunity to work side-by-side with recognized industry-leading professionals, all looking to create a firm without limits to creativity and professional growth. LeighFisher is an equal opportunity employer—all qualified candidates are encouraged to apply by submitting their resume and cover letter. EOE/MFHV"}