{"jobID": "2456738995", "jobLocation": "Seattle_WA", "jobTitle": "Sr. Data Scientist", "companyRating": "4.2", "companyInfo": {"Website": "www.convoy.com", "Headquarters": "Seattle, WA", "Size": "51 to 200 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Transportation & Logistics", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "126000", "jobDescription": "Convoy, recently awarded Geekwires Start up of the Year, is a rapidly growing company that uses algorithms to revolutionize the highly fragmented $800 Billion trucking industry. Were employing human-in-the-loop ML to scale our manually driven components with personalization, precision, and economics to better understand and predict the marketplace, and hedge fund-like strategies to drive our pricing and bidding models.At Convoy you will be expected to work autonomously and own your domain end-to-end. We are a highly aligned and loosely coupled team where we operate in a fast paced environment and pivot where needed to focus on what matters most. You will work with high signal-to-noise data to power your deep dive research, modeling, and experimentation projects. If youre curious minded, love getting things done, and pushing the envelope of data science this is the place to be.You have the following skills and experience: MS or PhD in economics/econometrics, statistics, computer science, operations research, a natural science or equivalent quantitative subjectExperience with scientific/statistical languages such as R, Python, or Julia5+ years of experience doing statistical modeling for analysis and/or predictionIntelligent but practical; you want to get things done and love simplicityExcellent presenter and writerYoure a leader and will speak up where neededYou have a habit of bias-to-actionNice to have:Experience with two-sided markets (platforms) and other economic theoryExperience with human computation and human-in-the-loop ML frameworksExperience in bidding and pricing (e.g., quant experience)Experience designing machine learning solutions for a production environmentBig data tools such as Spark, and/or HadoopSQL fluencyConvoy is an equal-opportunity employer and we are actively seeking a diverse team. If you're a collaborative team player who wants to have an outsized impact with a small, tight-knit team, we'd love to hear from you!"}