{"jobID": "2816398947", "jobLocation": "Mountain_View_CA", "jobTitle": "Sr. Risk Data Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "About Bill.com Bill.com is the leading business payments network, with 3 million members paying and getting paid over $52 billion per year. Bill.com saves companies more than 50% of the time typically spent on financial back-office operations and helps businesses get paid 3 - 4 times faster by automating end-to-end payment processes. The company is the choice of 4 of the top 10 U.S. banks; leading accounting software providers QuickBooks Online and Xero; and over 50 percent of the top 100 U.S. accounting firms. It is the only business payments solution endorsed by the American Institute of CPAs (AICPA). The recipient of more than 70 awards, Bill.com proudly received multiple PC Magazine's Editor's Choice Awards and CEO René Lacerte was recently recognized as an E&Y; Entrepreneur of the Year. Mission: We are looking for a talented, enthusiastic and dedicated person to join Bill.coms Risk Management team. The incumbent will be responsible for leading key projects associated with predictive fraud detection, risk modeling and loss mitigation at Bill.com. This position requires a person who has experience with performing analytics, refining risk strategies and developing predictive algorithms preferably in risk domain. Professional Experience/Background to be successful in this role:Minimum 2 years of industry experience in risk analytics, data analysis or data scienceAn advanced degree (M.S., PhD.), preferably in Statistics, Physical Sciences, Computer Science, Economics, or a related technical fieldExperience using statistics and machine learning to solve complex business problemsExperience working with large datasetsProficiency in SQL, Python and/or R including key data science librariesAbility to clearly communicate complex results to technical experts, business partners, and executivesComfortable with ambiguity and yet able to steer analytics projects toward clear business goals, testable hypotheses and action-oriented outcomesDesirable to have experience and aptitude solving problems related to risk using data science and analyticsBonus: experience with AWSCompetencies (Attributes needed to be successful in this role):Functional/Technical ExpertiseLearning Abilities/Tech SavvyCommunicationTeam PlayerExpected Outcomes:Build and productionalize fraud detection algorithms by utilizing advanced statistical modeling, machine learning, or other data mining techniquesUtilize advanced analytics and data science to build strategies that can address fraud mitigation, customer friction and operations efficiencyContinuously evolve the strategies and models to improve the performance and detection ratesAnalyze diverse sources of data to achieve targeted outcomes related to anomaly detection and probability of fraudIdentify and evaluate new data sources to build effective fraud controls for online transactionsProvide on-going tracking and monitoring of performance of decision systems and statistical modelsWork with product and engineering team to evangelize data best practices and design/implement new analytical systems/frameworksDesign and measure A/B tests to optimize existing fraud and credit strategiesBill.com Culture:Humble No egoFun Celebrate the momentsAuthentic We are who we arePassionate Love what you doDedicated To each other and the customer"}