{"jobID": "2796541882", "jobLocation": "San_Jose_CA", "jobTitle": "Life Planning Research Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.fishercareers.com", "Headquarters": "Camas, WA", "Size": "1001 to 5000 employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "92000", "jobDescription": " OverviewFisher Life Planning is separate and distinct from our portfolio management division, and focuses solely on aging needs. The Life Planning Research Analyst will work as a resource for our support and client service teams. This role is a unique opportunity to use your extensive insights to help support a growing business.  As a Life Planning Research Analyst, you will use your aging landscape knowledge to help the Life Planning support team develop client deliverables and content for client educational events, conduct client interviews and identify opportunities for improvement, support Life Planning Counselors with specific aging related issues and topics and keep the group abreast of changes and advancements in the aging landscape. Responsibilities:Be the expert. In this role, you’ll be responsible for using your aging landscape knowledge to guide Life Planning Counselors through specific aging related client situations and to advise the Life Planning Support Team on ways to make content more focused on our target market.Help improve the service. As a Life Planning Research Analyst, you’ll help shape our service framework by offering suggestions based on your aging landscape experience and background.Have an impact on our clients’ lives. We focus on Life Planning clients’ best interests, and they need our help navigating the aging process. You will be there to help support the Life Planning Counselors —keeping them informed, comfortable, and prepared by addressing aging related inquiries.Grow with us. Work with us to train others inside Fisher Life Planning and across the firm. And help us to continuously strive to help our clients in ways they can’t find elsewhere.This is the role for you if:You have a background in the aging landscapePreferred Qualifications:Background in GerontologyCertified Senior Advisor (CSA)Aging landscape knowledgeYou enjoy process and document managementYou have an analytical mindset, understanding both the big picture and the smallest details at the same timeYou maintain a constant baseline of risk awareness and best practices in a regulatory environmentYou are flexible in dealing with multiple tasks and shifting prioritiesYou have a strong desire to work as part of a team and collaborate on a variety of projects"}