{"jobID": "2820110212", "jobLocation": "Woburn_MA", "jobTitle": "Data Scientist/Software Engineer", "companyRating": "4.8", "companyInfo": {"Website": "www.stresearch.com", "Headquarters": "Woburn, MA", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Aerospace & Defense", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "97000", "jobDescription": " STR is a privately-owned, rapidly growing business focused on research and development (R&D;) for the defense and intelligence communities. STR has approximately 200 employees at sites in Woburn, MA, Dayton, OH and Arlington, VA. We are a nationally recognized leader in research areas including data analytics, sensors and signal processing, electronic warfare, cyber, video and image understanding, command and control, and precision navigation. Several programs have transitioned advanced technology to military and intelligence users. While our primary focus is on serving US Government customers, we are pursuing commercial applications as well. Job Description:Develop tools and techniques for characterizing very large, multi-modal data sets, which can be applied to problems in graph analytics, text analytics, activity-based intelligence, and discovery of patterns of life.Transition and integrate user-facing software tools that empower analysts to explore complex data in novel waysCollaborate within a multi-disciplinary team to research new data exploitation, machine learning algorithms and system conceptsInteract with military and intelligence users to identify and implement mission-centric technical capabilitiesPosition may involve travel to customer meetings and/or data collections and experimentsBasic Qualifications:US citizenship is required, must have an active TS//SCI clearancePhD, MS, or BS degree with relevant experience in computer science, applied mathematics, electrical engineering, physics, or related technical disciplineStrong scientific programming skills in Python, Java, MATLAB, and/or C/C++Ability to rapidly prototype new algorithm concepts and ideas and make insightful decisions on research directions to enhance system performanceAbility to translate customer requirements into focused technical activitiesStrong communication skills and the ability to describe complex concepts to fellow researchers as well as to non-technical audiencesLevel of experience is flexible STR seeks to provide an outstanding work environment for its employees with excellent benefits and competitive compensation. Full-time employees enjoy 401(k), profit sharing, health and welfare benefits, subsidies for training and conference attendance to foster continued learning and development, and a casual yet technically challenging work environment.  At STR, we are dedicated to fostering a diverse and inclusive community to create an environment that is innovative, collaborative and empowering. STR is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race/ethnicity, religion, gender, sexual orientation, disability status, military veteran status, or any other characteristic protected by law. Applicants must be US Citizens."}