{"jobID": "2812894561", "jobLocation": "Los_Angeles_CA", "jobTitle": "Retail Research Intern", "companyRating": null, "companyInfo": {"Website": "www.jll.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1997", "Type": " Company - Public (JLL) ", "Industry": " Real Estate", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " CBRE, Cushman & Wakefield"}, "estimatedSalary": null, "jobDescription": " Job Description  The Retail Research Intern position will work with our National Retail Research team and local Los Angeles teams on data collection and management, market analytics and reporting as part of the Americas research department. This position will specifically focus on retail data collection, enhancement and analytics as part of an ongoing urban retail strategy. The goal is to create and maintain best in class research that differentiates JLL and drives a competitive advantage in the marketplace through market expertise, analysis and insight. This position will work closely with local market research and retail experts. This is an ideal opportunity for someone seeking to develop in-depth knowledge of a local market and retail dynamics as a member of the commercial real estate industrys leading service platform. What this job involves:Collect, enhance and maintain local market urban retail data using a variety of proprietary mapping and visualization tools .Physically walk retail neighborhoods to gather specific data points.Work closely with the national retail platform to support new and ongoing projects.Articulate in a compelling way market trends and insights internally and externally.Proactively leverage local market personnel to enhance knowledge and gather critical information.Collaborate with the Los Angeles research and retail teams to provide on-going support to retail initiatives.Sound like you? Before you apply its worth knowing what we are looking for:Seeking a current Undergraduate student in their Junior or Senior year of college.Intellectual curiosity with a strong academic performance.Passion and desire to learn about the real estate sector and a particular interest in urban retail.Organized with the ability and desire to multitask and effectively manage numerous projects and deadlines at the same time.Independent and collaborative with the ability to work independently and as part of a dynamic team.Creative and dynamic with excellent written and presentation skills with the ability to tailor reports and recommendations.Analytical with problem-solving skills and strategic-thinking capacity.A command of requisite technology including Excel, PowerPoint, Word and other database systems, as well as comfort with various database platforms and GIS applications.Familiarity with CoStar and/or Real Capital Analytics preferred.Ability to walk for periods of time in various weather conditions.What you can expect from us Youll join an entrepreneurial, inclusive culture. One where we succeed together across the desk and around the globe. Where like-minded people work naturally together to achieve great things.  Our Total Rewards program reflects our commitment to helping you achieve your ambitions in career, recognition, wellbeing, benefits and pay. Well offer you a competitive salary and benefits package.  Join us to develop your strengths and enjoy a fulfilling career full of varied experiences. Keep those ambitions in sights and imagine where JLL can take you...  Apply today! JLL Is an Equal Opportunity Employer JLL is committed to developing and maintaining a diverse workforce. JLL strongly believes in equal opportunity extended to all individuals in all aspects of the employment relationship, including recruitment, hiring, training, promotion, transfer, discipline, layoff, recall and termination without regard to race, color, religion, belief, creed, age, sex, pregnancy or maternity (including childbirth and related conditions), family responsibility (e.g. child care, elder care), nationality, ethnic or national origin or ancestry, citizenship, marital status, civil partner status, sexual orientation, gender identity or expression, transgender status, veterans status, genetic information, trade union membership, social position, political view or status as a qualified individual with a disability, protected leave status or any other protected characteristic in accordance with applicable law. The company also endeavors to make reasonable accommodations for known physical or mental limitations of otherwise qualified employees and applicants with disabilities unless the accommodations would impose an undue hardship on the operation of our business and ensures that employment decisions are based only on valid job requirements.  For employees in the United States, please see a fully copy of our Equal Employment Opportunity and Affirmative Action policy at https://jll2.sharepoint.com/CorporatePolicies/HR%20Policies/Equal%20Employment%20Opportunity%20and%20Affirmative%20Action.pdf.  If you have questions about careers at JLL or are disabled and require further assistance in applying for a position, please contact us at [Click Here to Email Your Resumé]"}