{"jobID": "2788950646", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst (BI)", "companyRating": "4.0", "companyInfo": {"Website": "www.saucelabs.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "90000", "jobDescription": " Do you thrive on using data to provide key insights to an organization? Do you take initiative to identify what an organization should be measuring and evaluating? Are you a thoughtful problem solver who is able to make actionable recommendations?  Sauce Labs provides the world's largest cloud-based platform for the automated testing of web and mobile applications. Its award-winning service eliminates the time and expense of maintaining an in-house testing infrastructure, freeing development teams of any size to innovate and release better software, faster. About the Position As the Data Analyst on our Data Science team you will be the analytical data partner for our Sales, Marketing and Customer Success Organizations. This newly created position is critical to drive company growth, understanding customer behaviors and patterns and getting actionable insights to predict trends. ResponsibilitiesCollaborate with colleagues in Sales, Marketing, and Customer Success to support their data needsDevelop a high level of expertise with Sauce Labs data by digging into the details, sources and history of the dataAnalyze product usage trends to identify factors that correlate with upgrades, downgrades and cancellationContinuously improve upon the definition and calculation of the customer health scoresBuild data visualizations using Looker & train colleagues to use themCreate and update data models in Looker to make more data available to internal stakeholders (SQL)Work closely with Data Engineers when new ETL processes need to be builtWork closely with Data Scientists when more sophisticated analysis is neededPerform research on topics assigned by Marketing with the goal of educating the market on testing trends, usage and new platform adoptionProactively report out trends on device / browser testing on a regular basisProactively notify Sales and Marketing of usage trends that appear unusual or alarmingRequirementsBachelors degree in a quantitative field (e.g. Statistics, Analytics, Economics)3-5 years work experience in data analysis, business intelligence, or similar2+ years of working experience in writing SQL scripts by pulling data from complex database environments1+ years of experience with reporting / dashboard tools like Tableau, Looker, PowerBI or the likeExperience working with a Sales, Customer Success, or Marketing teamDesired ExperiencePython skillsHave worked for a SaaS companyExperience using Looker"}