{"jobID": "2475183299", "jobLocation": "New_York_NY", "jobTitle": "Senior Quantitative Analyst", "companyRating": null, "companyInfo": {"Website": "www.riskcare.com", "Headquarters": "London, United Kingdom", "Size": "51 to 200 employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Lab49, Capco, d-fine"}, "estimatedSalary": null, "jobDescription": "NEW YORKRiskcare is seeking a strong quantitative finance and risk management professional to support business growth in areas including: derivatives pricing and margining, market and credit risk modelling, XVA computation, regulatory compliance and front office change for investment banking, insurance, asset management and commodities clients.Riskcare is a demanding and rewarding environment. Working for a smaller company means that employees can gain a wide variety of experience and there are no artificial restrictions to the possibilities of their career progression.The role is for practical financial engineers who are keen to contribute to mission-critical deliverables for typically, systemically important financial institutions. Projects can be performed either on the client site or on an outsourced basis within Riskcare’s offices.Applicants should be interested in working within an innovative and entrepreneurial environment, where they will be involved in all aspects of the company from pre-sales to lead project roles.Within these roles, they will work with our clients to create solutions by making use of the company's expertise in financial engineering, software engineering and business process engineering.They will also have the opportunity to contribute their knowledge and experience in our sales-informed internal research activities, where we are working with academia and other technology vendors.SKILLS AND QUALITIESRequired qualifications and duties:Masters level (PhD preferred) in mathematics, quantitative finance or scientific/engineering discipline.Practical working knowledge in derivative products and markets, with expertise in one of the following: Rates, FX, Structured Finance, Credit, Equities and/or Commodities.Strong knowledge of derivative pricing models and mathematics, including Stochastic Calculus, Numerical Methods and Linear Algebra.Prior experience in model validation for an investment bank. Must be comfortable leading project engagements and articulating complex quantitative issues with clients. Collaborate with senior quants and firm wide leadership. Provide direction and mentorship to junior quants.Desired qualifications:Knowledgeable in post-crisis best practices including but not limited to XVA, multi-curve construction, and/or pricing with collateral.Consultative skills and the ability to form and present clear and concise arguments, as well as produce professional business documentation.Self-starter and keen to work in hybrid teams, such as quantitative, business and technology.Motivated to be involved in pre-sales and broader project / growth / SME activities.Some experience coding models in languages, such as Matlab, R, Python, or C++.EXPERIENCEWe typically consider candidates with seven-plus years of financial modelling and related quantitative experience. Preference will be given to candidates with prior institutional experience from banks, broker-dealers and/or investment management firms.REMUNERATION, CAREERS AND CULTURERemuneration will be awarded in line with experience and productivity. Remuneration includes base salary, bonuses and benefits. We also offer a flexible training budget, sponsoring a range of industry-recognised training programmes to build up expertise in technology, finance and management.Once somebody has become established within Riskcare, we look at the work they are doing and the parts they enjoy such as coaching, application of technology and client relationships. Once we have a better understanding of the individual’s life interests, we look at how this can be incorporated within the company to ensure a long and enjoyable career with Riskcare.REQUIREMENTSMUST CURRENTLY LIVE IN THE TRI-STATE AREA.APPLICANTS MUST HAVE AUTHORIZATION TO WORK IN THE US. RISKCARE PARTICIPATES IN THE E-VERIFY SCHEME - www.dhs.gov/E-Verify.SPONSORSHIP IS NOT AVAILABLE AT THIS TIME.NO AGENCIES PLEASE"}