{"jobID": "2735339522", "jobLocation": "Mountain_View_CA", "jobTitle": "AI P&R; - JIMI - NLP Research Intern", "companyRating": null, "companyInfo": {"Website": "www.jd.com", "Headquarters": "Beijing, China", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Public (JD) ", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Responsibilities: As a Research Scientist Intern, you will be working with in-house Natural Language Processing (NLP) experts on cutting edge NLP problems. Your research will be firmly grounded on rich data from JD.com and is expected to produce significant improvements in customer experiences. Specific topics include, but are not limited to: Natural Language Understanding, Natural Language Generation, Conversational User Interfaces and Question Answering, Semantic Parsing for Information Extraction and Sentiment Analysis. Qualifications:Ph.D or M.S. students in computer science, machine learning, statistics, or NLP related fieldsAbility to communicate/collaborate with other researchers/engineersAbility to implement experiments in Java and using scripting languages (Python, Perl, bash) and tools written in C/C++Experience working with deep learning frameworks (Tensorflow, Pytorch, Torch, Mxnet, CNTK, etc.) is a plusAbout JD AI Research JD AI Research (JDAIR) focuses on the continuous innovation and optimization of algorithms to meet our developing business needs. Significant areas of research include natural language processing, computer vision, and machine learning (including deep learning and reinforcement learning). JDAIR has established research centers in Beijing and Silicon Valley, and we are in the process of opening an additional research center in Europe. About JD AI Platform JD AI Platform is designed to provide a flexible, efficient, and resilient AI infrastructure and services to JDs businesses and external partners. Our platform will consolidate comprehensive AI resources and capabilities (including scalable, optimized compute; data analysis, management, and storage; algorithms; and learning frameworks) in a generally available API, empowering JD and our partners to create the next-generation applicationsfrom dialogue-system robots and scene recognition to facial recognition and AR/VRthat are powering the future of retail. JD.com is an Equal Opportunity Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class."}