{"jobID": "2830864876", "jobLocation": "San_Francisco_CA", "jobTitle": "IT Audit Senior Consultant", "companyRating": "3.9", "companyInfo": {"Website": "www.crowe.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1942", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "88000", "jobDescription": "Job SummaryThe IT Audit Senior Staff will be responsible for being a contributing team member on IT Risk Consulting, IT Risk Assessments, IT Internal Audits, segregation of duties (SOD), implementation reviews, IT SOX, and similar engagements. Typical IT Senior Staff responsibilities include: Project Execution and ManagementPersonnel are expected to execute audit work/consulting and oversee the work of junior level personnel. Report directly to a project leader and/or executive with respect to communications of issues and completion audit tasks.Support overall project planning, supervising staff, and executing IT fieldwork.Identify and evaluate business and technology risks, internal controls which mitigate risks, and related opportunities for internal control improvement.Providing technical guidance to Crowe staff and client organization personnel.Presenting creative and logical solutions to identified problems.Consulting with clients to understand and address their needs.Assist with the development and quality assurance of key internal audit deliverables, including work programs, process flows, and audit reports.Communicating issues and status to Crowe project leaders/executives and client senior management. Client Management Developing lasting relationships with client personnel and seeking to further these relationships through quality service delivery and the successful execution of projects.Participate in proposal development efforts. People Management Defining performance expectations for staff IT auditors and providing performance feedback.Evaluating the performance of staff IT auditors.Participate in training efforts. Product Development Participating in strategic and tactical initiatives related to new product offerings and services.Facilitate use of technology-based tools or methodologies to review, design and/or implement products and servicesGenerate innovative ideas and challenge the status quo.QualificationsEducational and Professional Credentials Bachelor's degree required. Major in Accounting, Computer Information Systems, or Management Information Systems is preferred.2+ years working in internal audit, consulting, assurance services, or related field, either in professional services or industry.Professional Certification such as CPA, CIA, CISA, or similar strongly preferred. Required Knowledge and Skills Outstanding project management and supervisory experience.Strong interpersonal skills to interact in team environment and foster client relationships.Ability to work both independently and in a team environmentAdvanced verbal and written communication skills, including documentation of findings and recommendations.Strong analytical and problem solving skills.Strong technical knowledge is required (ERP such as SAP, Oracle, PeopleSoft, Microsoft Dynamics, NetSuite, WorkDay JD Edwards and Operating Systems and Databases such as Windows, SQL, iSeries, UNIX, LINUX)Strong technical skills in ERP security administration, ERP configuration controls or system implementations would be highly desirable.Evaluating application controls, report baselining, interface reviews, configuration reviews for Oracle Financials, SAP, NetSuite, or Hyperion.An in-depth understanding of internal audit processes and objectives.In-depth knowledge of core information technology processes and controls, current trends in corporate information technology and emerging themes in the market place.Understanding of commonly used internal control frameworks, including COSO and COBIT.Understanding of ERP GRC modules and SODUnderstanding of ERM, data analytics, GDPR, third party compliance and vendor management, EU GDPR (General Data Protection Regulation)Knowledge of audit methodologies and developing key internal audit deliverables, including process flows, work programs, audit reports, and control summaries.Knowledge of Sarbanes-Oxley Act and COSO provisions and methodologies for achieving compliance.Proficient in Microsoft Office suite applications with specific emphasis on Word, Excel and PowerPoint. Secondary emphasis on Visio and Access. Travel Requirements: 0-60%. This position may require national or international travel. ABOUT THE TEAM: Risk Consulting is organized by both industry specializations (financial services, healthcare, public sector, GRC Technologies Integration and emerging industries) and solutions (anti-money laundering, regulatory and compliance, internal audit, cybersecurity, emerging global solutions, GRC Technologies and third party risk). Risk Consulting provides governance, risk and compliance expertise to keep clients advised of emerging trends, industry benchmarks and best practices.  At Crowe, we strongly endorse an open door policy. Our partners are approachable and accessible across the entire organization. Our team-based culture encourages partners to be in touch with our professionals and active on client projects. The partners of our company lead by example and maintain a strong two-way channel of communication with their teams. We strive to create an environment that is relaxed, fun, dynamic and fulfilling. Our team-based culture has not only resulted in successful projects, but in long lasting friendships as well. Overall, our people find their career choices to be highly rewarding and fulfilling. HOW YOU CAN GROW: We will nurture your talent in an inclusive culture that values diversity. You will have the chance to meet on a consistent basis with your Career Coach that will guide you in your career goals and dreams.  Crowe (www.crowe.com) is one of the largest public accounting, consulting and technology firms in the United States. Crowe uses its deep industry expertise to provide audit services to public and private entities while also helping clients reach their goals with tax, advisory, risk and performance services. Crowe is recognized by many organizations as one of the country's best places to work. Crowe serves clients worldwide as an independent member of Crowe Global, one of the largest global accounting networks in the world. The network consists of more than 200 independent accounting and advisory services firms in more than 130 countries around the world.  Visit Crowe.com and find out what it's like to work at one of the “50 Best Workplaces for New College Graduates.” Crowe ranked seventh on this Fortune list, in addition to being named one of Fortune’s “Top 100 Best Companies to Work For” and among Fortune’s “20 Best Workplaces in Consulting & Professional Services”. In these surveys, Crowe personnel attribute the following policies to making Crowe a great place to work: Innovation: Each year, Crowe invests about two percent of firm revenue in new product development funding to develop ideas brought forward by its people. Building upon a foundation of deep industry specialization, Crowe professionals follow a detailed innovation road map to create original, practical solutions that help address their clients’ biggest challenges. This process allows them to see their ideas through from start to finish. Mobility strategy: Rolled out more than two years ago, this strategy defied the norm of the professional services industry. It allows Crowe personnel to work where they’re most productive – whether that be the office, their home or elsewhere – and wear jeans while they’re in the office. This policy continues to receive great reviews on annual internal employee engagement surveys. Benefits: The firm promotes healthy living through its internal well-being portal, which allows Crowe individuals to complete wellness activities – such as exercise challenges, healthy eating, doctor visits and mindful lifestyle changes – for gift cards and health insurance premium reductions. Additionally, on top of its healthcare and retirement programs, Crowe recently expanded its paid time off policies for military leave and all new parents. Community service: Recently acknowledged in the Fortune Best Workplaces for Giving Back list, the firm places a high priority on community service. In honor of the firm’s 75th year, Crowe personnel are working toward a combined goal of 75,000 hours of volunteering, which they’re well on their way to achieving. In addition, Crowe has policies in place to align its charitable contributions with the volunteer efforts of its people.  EOE  M/F/D/VCompany OverviewYour Journey at Crowe Starts Here: At Crowe, you have the opportunity to deliver innovative solutions to today’s complex business issues. Crowe’s accounting, consulting, and technology personnel are widely recognized for their in-depth expertise and understanding of sophisticated process frameworks and enabling technologies, along with their commitment to delivering measurable results that help clients build business value. Our focus on emerging technology solutions along with our commitment to internal career growth and exceptional client value has resulted in a firm that is routinely recognized as a “Best Place to Work.” We are 75 years strong and still growing. Come grow with us!"}