{"jobID": "2812635476", "jobLocation": "San_Jose_CA", "jobTitle": "Hyperion Essbase Consultant", "companyRating": null, "companyInfo": {"Website": "www.trianz.com", "Headquarters": "Santa Clara, CA", "Size": "1001 to 5000 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "HYPERIONESSBASE CONSULTANTSan Jose , CA6 month projectAbout TRIANZ TRIANZ is a global professional services firm committed to enabling leaders to develop and execute operational strategies, leverage new business and technology paradigms, and achieve results expected by senior management in their organizations- predictably. What We Stand For Our Clients are transforming their businesses, competitive strategies, product and service portfolios, customer-partner-employee interactions and their ecosystem as a whole. The cost of misses is not financial alone but a lost window of opportunity. So getting things right the first time is absolutely critical.  As a result, TRIANZ is focusing on three important themes in our engagement model with Clients. Crystallize business impact from a top management point of viewHelp Clients achieve results from strategy-by making execution predictablethrough innovative execution techniquesCreate a positive, enriching partnership experience in everythingwe doIndustries, Clients & Practices TRIANZ works with Clients across High Technology, Banking, Insurance, Manufacturing, Retail, Telecom, e-businesses and Public Services. Most Clients are Fortune 1000 organizations and our relationships are sponsored by senior leaders in Enterprise Analytics Sales, Finance, Marketing, Human Resources, Operations and Information Technology. We partner with our Clients to address the following key service areas: Information Management, Master Data & Data WarehousingBusiness Intelligence & AnalyticsBig Data & Business InsightsCloud Analytics About the role; Hyperion Essbase ConsultantSkills Needed:7+ years of work experienceStrong knowledge in Hyperion Essbase, Planning, SmartView (version 9.x and 11.x is a must & EPBCS/PBCS/Hyperion Cloud is a plus)Strong knowledge in DRM, DRGKnowledge in FDMEE is a plus Hyperion Planning/Essbase: Experience in support projects using Hyperion Essbase/PlanningExpert level knowledge required in load rules, calculation scripts to support legacy Essbase applicationsExpertise in Essbase BSO cube analysis, design and maintenance, Essbase database administration upgrades, performance tuning and optimizationUnderstanding of business requirements in the Hyperion Planning/Essbase space to support cloud applicationsKnowledge on supporting month-end Forecasting Close cycles DRM/DRG: Good knowledge in Master data creation and the metadata update on the Oracle Hyperion DRM applicationExpertise in developing Versions , Hierarchies , Properties , Property Categories for the maintenance of the metadata in DRMExpertise in developing validations and verifications in DRM for validating metadata as per business guidelinesGood understanding of creation and maintenance of alternate hierarchies for planning and reportingAbility to quickly sync up of metadata between DRM and Planning applicationWe are Growing Rapidly: 2016-2018 Highlights TRIANZ is growing above the average of the professional services industry. Here are some highlights. Voted significantly above other services firms by 90% + of Clients for business impact, execution predictability and organizational commitment in the recent TRIANZ wide Client satisfaction survey.Won the “Customer Obsession Award” from Amazon Web Services for our innovation and execution record in Cloud Infrastructure and Business Applications strategy and services.Won UNICOM awards for the #1 Digitization and #1 Analytics project over a wide array of competition.Featured by IDC in their Spotlight series under the theme of “Operationalizing Strategies through Execution Excellence: A New Paradigms in Technology Delivery”.Achieved 50%+ revenue and employee growth compared to prior year’s exit showing an increasing acceptance of our models and success from our differentiated methodologies in strategic execution."}