{"jobID": "2817160740", "jobLocation": "Santa_Monica_CA", "jobTitle": "Software Engineering Intern - Performance Brands & Partners", "companyRating": "4.4", "companyInfo": {"Website": "www.leafgroup.com", "Headquarters": "Santa Monica, CA", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Public (LFGR) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "78000", "jobDescription": " Leaf Group is a diversified Internet company that builds platforms to enable communities of creators to reach dedicated audiences in the ever-growing lifestyle categories.  We are looking for a Software Engineering Intern to join our Performance Brands & Partners team at our Santa Monica office.  Start your front-end software engineering career. Help us, Help you. Youll Report To: Sr. Director, Software EngineeringA typical day as a Software Engineering Intern might include:Create user experiences that help people.Code, Drink Free Coffee,Code, Pet a PuppyYou will be successful if you are confident in your CSS skills, have JavaScript and UI experience, and want to become a Front End Engineer.What You Have:CSS (only apply if you feel confident about your skill)UI design and layoutJavaScriptDesire to learn dailyExcellent verbal and written communicationNot afraid to wear multiple hats - no job being too small or too largeWe're casual and informal but we work hard and work responsibly. A pleasant and supportive demeanor goes a long wayExcellent verbal and written communication.Not afraid to wear multiple hats - no job being too small or too large.We're casual and informal but we work hard and work responsibly. A pleasant and supportive demeanor goes a long way.What You Will Gain:You will learn good programming habitsWe have millions of visitors, serving that traffic requires teamworkYou will learn the internet publishing businessWho We Are: We create experiences that celebrate the best of art, design, and technology. We want smart, curious people committed to putting people first, having fun while they work, a commitment to high quality service to make things better and a desire for constant growth. We work in a fun, hard-working collaborative environment that is diverse, adventurous, and open-minded. Check us out here: https://www.leafgroup.com/brands/ What We Have:Paid InternshipWinner of the 2017 Best Company for Diversity award ComparablyWinner of the 2017 Best Company Los Angeles award ComparablyCool office environment and culture (i.e., pet-friendly office, Thirsty Thursdays, Free Lunch Fridays, and all of the other fun activities we gather for)Employee discounts for Saatchi Art, Society6, and Deny DesignsFree ParkingMost importantly, hands-on experience within a fast-moving and fun environment Leaf Group, Ltd. is an equal opportunity employer. Applicants for all job openings are welcome and will be considered without regard to race, color, religion, national origin, sex, age, sexual orientation, physical or mental disability, or any other basis protected by state, federal, or local law. It is the intent of the Company to comply with all applicable federal, state, and local legislation concerning equal opportunity in employment. Agency Disclosure: If the Leaf Group Talent Acquisition department, or any current company employee, receives an unsolicited resume from a third party recruiting agency and Leaf Group does not have a signed Agency Agreement active, Leaf Group will not be deemed liable to pay a placement fee. The unsolicited resume will be considered a gift and can be considered for our recruitment efforts."}