{"jobID": "2683716959", "jobLocation": "Mountain_View_CA", "jobTitle": "Part Time Retail Merchandising Field Specialist", "companyRating": "3.4", "companyInfo": {"Website": "www.bdsmktg.com", "Headquarters": "Irvine, CA", "Size": "1001 to 5000 employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " MarketSource, Advantage Solutions, Creative Channel Services"}, "estimatedSalary": "15", "jobDescription": " Part Time Retail Merchandising Field Specialist - Mountain View, CA # of openings 1Apply NowYour valuable retail experience could set you on a new career path as a BDS Merchandising Field Specialist!!  Working nights and weekends? BDS offers flexible M-F work with NO nights or weekends required!  Tired of getting paid minimal hourly rates or wages? BDS offers competitive hourly wages.  Trapped at the same brick and mortar location each day?  If you answered yes to any of these questions it may be time to take a look at BDS and what we have to offer you.  Parlay your retail experience into a new career where you would be working with the latest and greatest in consumer technology.  Or if you are a consumer electronics enthusiast then channel that interest into a new career.  BDS Marketing offers schedule flexibility, paid mileage and drive time as well as earning a great hourly rate are all benefits to working on our merchandising team. WHAT ARE WE LOOKING FOR? BDS Marketing is looking for savvy retail warriors with a strong passion for consumer electronics. Our Retail Field Merchandising Specialists work in major retailers on state-of-the-art gadgets and technologies, from headphones, tablet displays to printers, drones and so much more. Their ability to troubleshoot, install and repair consumer electronics is key to their in-store success. They build relationships within store while interfacing daily with store management and associates.  We provide a stellar training program with direct in field support which enables our merchandising team to execute assignments at a superior level. If you have a retail or technical background and are eager to take your career in a new direction, we would like to connect with you. WHO ARE OUR RETAIL MERCHANDISING FIELD SPECIALISTS?Problem solvers and intuitive thinkersArticulate communicatorsOrganized, detailed plannersTechnology enthusiastsWHY WORK WITH BDS? · Top Industry Pay  · Paid Training and Administrative Time  · Paid Mileage and Drive Time  · Bi-weekly payroll direct to your bank account or by check  · Call Center Support  · Advancement Opportunities WHAT DO YOU NEED TO GET STARTED? · Smartphone, Tablet, or iPad  · Vehicle and valid driver's license  · Vehicle registration and insurance  · Access to basic tools including a cordless drill  · Pass a background check, MVR and Drug Screen  #consumerelectronics #retail #merchandising #field specialist #wireless BDS Marketing, LLC. (“BDS”) is an equal opportunity employer in every aspect of employment, including but not limited to; selection, training, development and promotion of the most qualified candidates and employees without regard to their race, gender, color, religion, sexual orientation, national origin, age, physical or mental disability, citizenship status, veteran status, or any other characteristic prohibited by state or local law. BDS is committed to equal employment opportunity in all other privileges, terms and conditions of employment that may not be covered in this statement. BDS is an at-will employer. BDSmktg is an award-winning retail marketing and sales partner. With over 30 years of experience guiding customers through the buying journey, we are experts at powering sales for the world’s top brands. BDSmktg offers our clients fully integrated solutions that drive brand demand and sell-through: Brand Advocacy, Retail Readiness, Retail Environments, Research, Commercial, and Digital Marketing. We craft custom solutions from our suite of services, and our specialized teams ensure your brand is ready for each new selling season. Founded in 1984, BDS Marketing, LLC. is headquartered in Irvine, California with regional offices in Columbus, Ohio and Chicago, Illinois."}