{"jobID": "2750977714", "jobLocation": "Berkeley_CA", "jobTitle": "Senior Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.elsevier.com", "Headquarters": "Amsterdam, Netherlands", "Size": "5001 to 10000 employees", "Founded": " 1880", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Clarivate Analytics, Springer Nature, Thomson Reuters"}, "estimatedSalary": "77000", "jobDescription": "As a Senior Data Analyst, you will work with Product Management teams to help build new digital products, or improve our current products, for researchers through data-driven prioritization. The aim of our Research division is to deliver best-in-class content and software for researchers around the world, supporting better academic outcomes.  Researchers and institutions seek a digital environment where ideas can be exchanged, examined, and applied with tools that empower scientific, medical and technical knowledge. Elsevier’s research platforms allow them to find and analyze data from over 5,000 publishers via Scopus; access the leading ebooks and journal articles published by Elsevier on ScienceDirect; and organize their research and showcase their work through Digital Commons and Expert Gallery Suite. These platforms make data and content easier to search, access, analyze, organize, and share.  Within Research Products, the role of the Analytics team is to turn the multitude of data into insights, AB testing opportunities that can be used to build better websites. Like us you thrive in a complex data environment. We like getting our hands into the data, focusing on insights which drive actions and product improvements. We extract data and make sense of it using SQL, Python/R, Tableau/Adobe Analytics and quantitative techniques (such as regression, or statistical testing).  Within a team of ~35 analysts and data scientists, you will have unique ability to work on some of the most insightful data in the world of research. Your responsibilities:Use your deep knowledge of customer behavior to define performance metrics with your stakeholders.Grounded in deep analysis of our datasets, make recommendations to improve our customer-facing products (eg. Digital Commons, Expert Gallery Suite,…) together with product managers, designers and engineers.Optimize these products through continuous testing and guide the product teams through iterative data-driven product optimizationBuild models to forecast product performance and predict user behavior.Innovate and discover new insights by diving deeply into the data combining various sources (including database and web-analytics data sources) from across the business, to support decisions and resolve strategic questionsEffective and engaging communication of insights and information through presentations, reporting and dashboards to all levels of the organisationAdvocate for a data-driven culture and help your stakeholders in how to interpret results, train them to use our Web analytics software Required Qualifications:3-5 years of experience in data analysis and/or product optimizationPrior experience: data analysis and insight generation with business impactweb-analytics tools (GA and Adobe) and techniquesdigital product optimization, A/B testingsupporting Product Managers by analyzing user behavior and product feature performancecommunicating findings and recommendations to audiences at all levelsBuilding predictive models for business outcomes/audiencesSQL ProficientStrong Excel (formulas, graphing, pivot tables, linking) and PowerPoint skillsStrong and effective communication skillsExperience with visual reporting and dash boarding tools (Tableau, etc.).Ability to initiate and drive projects to completion with minimal guidance.Ability to communicate the results of analysis in a clear and effective manner. Preferred Qualifications:Master-level degree with quantitative focus (Stats, Maths, Physics, Computer Science, or more broadly Economics, Sciences with a strong statistical foundation)Ability to analyze and combine large data sets using tools such as Amazon Redshift (or other Postgres DB), Databricks Spark, Python, RExperience in the context of academic research Benefits of being part of the team:An innovative, challenging, and learning environment with training optionsThe space for you to add your knowledge, skill and expertise to the team, and the company as a whole, without being rigid or inflexible about the way things need to be doneA conducive environment for voicing opinions, creative thinking and thought leadershipThe opportunity and freedom to support products used by millions of researchers and scientists  Elsevier is a global information analytics business that helps institutions and professionals progress science, advance healthcare and improve performance for the benefit of humanity. We help researchers make new discoveries, collaborate with their colleagues, and give them the knowledge they need to find funding. We help governments and universities evaluate and improve their research strategies. We help doctors save lives, providing insight for physicians to find the right clinical answers, and we support nurses and other healthcare professionals throughout their careers.  Elsevier provides digital solutions and tools in the areas of strategic research management, R&D; performance, clinical decision support, and professional education; including ScienceDirect, Scopus, SciVal, ClinicalKey and Sherpath. Elsevier publishes over 2,500 digitized journals, including The Lancet and Cell, more than 35,000 e-book titles and many iconic reference works, including Gray’s Anatomy. Elsevier is part of RELX Group, a global provider of information and analytics for professionals and business customers across industries.  Elsevier employs over 7,000 people in more than 70 offices worldwide. We are an employer of choice, attracting and developing talented and creative people who thrive in a challenging and fast-paced environment. We offer an excellent compensation and benefits package as well as a real opportunity for career growth in a growing organization. Elsevier is an equal opportunity employer: qualified applicants are considered for and treated during employment without regard to race, color, creed, religion, sex, national origin, citizenship status, disability status, protected veteran status, age, marital status, sexual orientation, gender identity, genetic information, or any other characteristic protected by law. If a qualified individual with a disability or disabled veteran needs a reasonable accommodation to use or access our online system, that individual should please contact 1.877.734.1938 or accommodations@relx.com."}