{"jobID": "2821239570", "jobLocation": "San_Jose_CA", "jobTitle": "Managing Doctor", "companyRating": null, "companyInfo": {"Website": "www.westerndental.com", "Headquarters": "Orange, CA", "Size": "5001 to 10000 employees", "Founded": " 1903", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " InterDent"}, "estimatedSalary": null, "jobDescription": " Requisition Number 18-1891 Title Managing Doctor City San Jose State CA Zip Code 95113 DescriptionSign on bonus and/or Relocation available for select locations! This is a fantastic opportunity for the right general dentist. Join a team of quality orientated dental professionals that you will be proud to be affiliated with. Working with Western Dental / Brident Dental you will enjoy practicing dentistry in one of  our brand new beautiful, modern, and fully equipped dental practices.  You will not have to worry about finding patients to grow your dental practice, ordering supplies, battling receivables, or any staffing issues. We provide you with experienced dental staff and wonderful patients that you will be proud to deliver excellent  dental care through evidence based dentistry. We are a Military Friendly Employer. With 200 offices throughout California, Arizona, Nevada and Texas, consider us as a place to practice dentistry on your off duty days or choose us as your post-service employer. Let us help you with a smooth transition.  We can help you navigate the required dental credentials you will need to practice. Opportunities available for Active Military, Military Veterans and Military Spouses.BenefitsWe offer an excellent compensation package for F/T Dentists which includes:Malpractice coverage - company paidContinuing Education (CE) programs provided at no cost to you401KMedical, Dental, VisionImmigration sponsoring programs: OPT, H1B, TN work visa and Green Card / permanent resident in selected regionsCareer Path: Western Dental University offers our clinicians established promotion tracks that can help develop your skills to take you to the next step in your career. Our Associate Dentists have been successfully promoted to Managing  Dentist roles or have been recommended for our Privileging Programs in Exodontics and Pediatrics. Requirements Must have a current dental license for the state in which you wish to practiceDoctor of Medical Dentistry (DMD) or Doctor of Dental Surgery (DDS)DEA and CPRAble to perform all aspects of general dentistryMust have excellent communication skills as well as a friendly and professional demeanor To apply please email: tmowrey@westerndental.com"}