{"jobID": "2795434646", "jobLocation": "Cambridge_MA", "jobTitle": "Senior Associate Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.amgen.com", "Headquarters": "Thousand Oaks, CA", "Size": "10000+ employees", "Founded": " 1980", "Type": " Company - Public (AMGN) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Genentech, AbbVie, Janssen Biotech"}, "estimatedSalary": "118000", "jobDescription": " Amgen is seeking a Senior Associate Data Scientist at our office in Cambridge, MA to join the Attribute Sciences Data Engineering (ASDE) group and who will report into the Process Development Senior Scientist.  This Senior Associate Data Scientist is part of the ASDE group providing support to Amgens commercial portfolio through application of process monitoring, data analysis, and engineering principles. The Senior Associate will include identifying abnormal data trends in product and method data, identification of root causes for trends and collaborating cross-functionally to implement corrections. In addition, the Incumbent will focus on identifying and deploying optimization opportunities while offering the opportunity to engage with multiple product modalities across a global manufacturing network.  The Attribute Sciences Data Engineering (ASDE) group applies scientific and technical engineering expertise in support of Amgens pipeline and commercial portfolio. This team applies continuous verification principles and advanced data analytics to advance product and method performance.  The Senior Associate Data Scientist is specifically responsible for: Applies statistical trending tools to product and method dataApplies engineering principles and multivariate statistical analysis in-order to understand sources of variation and evaluate opportunities for improvementsUses data analytics software to develop visualizations to review, assess, and improve analytical method performanceInterfaces with Quality Control, Quality Assurance, and Manufacturing organizations to resolve method issuesSupports generation of annual product review documents, regulatory inspections, and process documentationStays abreast of new technologies and statistical approaches in order to recommend improvementsBasic Qualifications Masters degree  OR  Bachelors degree and 2 years of Engineering or Data Science experience  OR  Associates degree and 6 years of Engineering or Data Science experience  OR  High School diploma/GED and 8 years of Engineering or Data Science experience Preferred Qualifications3+ years experience in a Biotech / Pharma Process Development and/or Manufacturing Support roleExperience with engineering principles and statistical analysis, including design of experimentsAbility to understand and apply statistical process control conceptsPossess understanding of regulatory and cGMP requirementsAbility to deliver high quality results in a timely mannerExcellent written and verbal communicationStrong leadership skills and decision-making abilitiesDemonstrated ability to work under minimal directionAble to adapt to changing business needs and operational requirementsFamiliarity with systems used for data analyticsUnderstanding of data structures, data types, and system thinking conceptsAble to multi-task and function in a dynamic environmentPossesses strong influencing and negotiation skillsAbility to solve difficult, non-routine analysis problems, applying advanced analytical methods when appropriateAbility to develop a comprehensive understanding of Amgen data structures and metrics Amgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.  Amgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve peoples lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the worlds leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.  #DS2018Amgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status."}