{"jobID": "2824759868", "jobLocation": "Seattle_WA", "jobTitle": "(USA-WA-Seattle) Technical Program Manager Intern", "companyRating": "4.4", "companyInfo": {"Website": "www.google.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (GOOG) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Apple, Facebook"}, "estimatedSalary": "123000", "jobDescription": " Applications are now closed. Please check back in winter 2019 for summer 2019 opportunities.  Note: By applying to this position your application is automatically submitted to the following locations: Seattle, WA, USA; Sunnyvale, CA, USA; Mountain View, CA, USA; San Francisco, CA, USA; Kirkland, WA, USA  Google's projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager Intern at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You're equally at home explaining your team's analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers.  Using your technical and leadership expertise, you run Engineering-focused projects that are well-defined under supervision.  Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From AdWords to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.  ## Responsibilities Work with Google Engineering teams to design, develop, implement, launch, and support new services and enhancements to existing services.Develop and execute plans under a set of implementation and delivery time constraints, optimizing for a blend of cost, schedule, and features.Collect and analyze relevant data and take actions accordingly.Facilitate broad collaboration with clear communications and documentation. ## Qualifications Minimum qualifications:Currently pursuing a Bachelors degree in Computer Science or a related field.Must be currently enrolled in a full-time degree program and returning to the program after the completion of the internship.Experience with one or more general purpose programming languages including but not limited to: Java, C/C++, Go or Python.Preferred qualifications:Currently pursuing a Masters degree in Computer Science or a related technical field.Experience writing code and contributing to open source projects.Analytical and solution-oriented background, with great people skills and structured problem solving capabilities.Ability to interact with diverse technical and non-technical groups, spanning all organizational levels.Effective analytical, problem-solving and organizational skills.Authorization to work in the United States.* * At Google, we dont just accept difference - we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you have a disability or special need that requires accommodation, please let us know.  To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees or any other company location. Google is not responsible for any fees related to unsolicited resumes."}