{"jobID": "2827609590", "jobLocation": "Boston_MA", "jobTitle": "STUDENT/INTERN / PER DIEM / DAY / BWH - RHEUMATOLOGY", "companyRating": null, "companyInfo": {"Website": "www.brighamandwomens.org", "Headquarters": "Boston, MA", "Size": "5001 to 10000 employees", "Founded": " 1996", "Type": " Subsidiary or Business Segment", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " GENERAL SUMMARY/ OVERVIEW STATEMENT:  Type 2 immunity plays a critical role in tissue homeostasis and repair, but pathologic dysregulation of these same pathways can lead to allergic disease. The Barrett lab is interested in defining the innate cellular and molecular networks underlying the initiation and persistence of type 2 immunity at mucosal sites, where environmental determinants play a key role in both immunopathogenesis and health.  Our major projects involve using newer molecular techniques to define dominant immune signaling networks in human type 2 diseases such as asthma and nasal polyposis, identifying crucial antigenic ligands from common human allergens, identifying receptors that immune and structural cells use to sense the external environment, and understanding the mechanisms by which key immune molecules and cells exert their pathologic actions, including proinflammatory lipid mediators, the cysteinyl leukotrienes.  The student will work under the direct supervision of the Principal Investigator and other members of the Research Staff and will be responsible for modifying established protocols and methodologies to help cloning, expression and purification of proteins and then utilize the validated candidate proteins to conduct a series of experiments. The individual will additionally be responsible for calculating, compiling and organizing data using various computer software programs  PRINCIPAL DUTIES AND RESPONSIBILITIES:  1.Assists with the culture of mouse bone marrow-derived mast cells (BMMCs)  2.Assists with the cloning, expression and purification of fungal proteins, by performing techniques of DNA amplification, restriction digestion, DNA ligation and transformation  3.Executes BMMC/BMDCs activation experiments with purified recombinant proteins, interprets results, and troubleshoots techniques required to complete experiments with help of supervisor.  4.Performs experiments to characterize immunologic properties of purified recombinant proteins with help of supervisor.  5.Performs quantitative PCR and ELISA assessments on samples obtained from BMMC/BMDCs activation experiments  6.Performs other duties and responsibilities as directed Qualifications 1.Student in a degree program leading to a Bachelor's degree in a biological, biochemical, biophysical, or mathematical science required. College level courses in Cell Biology required.  2.Relevant laboratory experience from core lab courses and thesis research in college  SKILLS/ ABILITIES/ COMPETENCIES REQUIRED:  1.Ability to follow a protocol accurately, be detail oriented, work with a high level of precision, record the procedure and the data methodically.  2.Good interpersonal and communication skills.  WORKING CONDITIONS:  1.Normal laboratory environment  2.Exposure to human and animal blood products and tissue  HOSPITAL WIDE RESPONSIBILITIES:  Works within legal, regulatory, accreditation and ethical practice standards relevant to the position and as established by BWH/Partners; follows safe practices required for the position; complies with appropriate BWH and Partners policies and procedures; fulfills any training required by BWH and/or Partners, as appropriate; brings potential matters of non-compliance to the attention of the supervisor or other appropriate hospital staff. EEO Statement Brigham and Women's Hospital is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, national origin, sexual orientation, protected veteran status, or on the basis of disability. Partner's Healthcare is acting as an Employment Agency in relation to this vacancy."}