{"jobID": "2776860892", "jobLocation": "New_York_NY", "jobTitle": "Banner SIS Project Manager", "companyRating": "4.7", "companyInfo": {"Website": "www.dcshq.com", "Headquarters": "West Lake Hills, TX", "Size": "51 to 200 employees", "Founded": " 1990", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "89000", "jobDescription": " Description OPPORTUNITY: We are looking for Banner SIS Project Manager for a 6-month contract opportunity in the Yonkers, NY area. RESPONSIBILITIES:The Project Manager is responsible for overseeing the successful delivery of Ellucian’s Banner SIS module.The Project Manager will manage the Student Information System (SIS) implementation project and will work with various stakeholders to ensure operational objectives are achieved within deadlines and within budget.Tasks that the Project Manager will be responsible for include successful project definition, planning, budgeting, time estimating, scheduling, project staff planning, resource leveling, and organizing. This individual must be able to lead a high-performance project team for the successful implementation of the SIS.With limited guidance, develops a sound implementation plan for meeting implementation strategies, within Project parameters. This individual provides expert analytical insights into implementation progress through detailed reporting and presentations designed to give stakeholders a comprehensive assessment of the progress of the implementation.Under the direction of the Business owner, the Project Manager will define project team roles and resPlan and set project goals and milestones based on input collected from the vendor and project team.Will develop the project work plan, work breakdown structure and schedule using a designated project management team tool for project team usage.Will monitor project health through regular status meetings.Will provide status report and initiate corrective action to ensure project success.Will manage the day-to-day activities of cross-functional project teams and ensure adherence to the schedule.Work to control the scope changes and minimize the impact to the budget.Identify and mitigate project risk by keeping issues visible to avoid impact to the success of the project.Confirm alignment with customer expectations and project goals.Develop Project ROI.Develop and maintain strong working relationshipsSchedule, organize and conduct project team meetings for the Executive Committee, Functional Implementation Groups, and various other advisory or governing bodies.Manage project activities with the Project Implementation Partner.Leads initiatives and process improvement efforts by applying innovative problem-solving techniques. Proactively identify risks and bottlenecks and propose solutions.Provide project status updates, updates, and analysis to various decision makers. Develop and implement a communications plan regarding the project timelines and deliverables.Act as a coordinator to ensure the submission of supporting information for decisions, documenting decisions and work efforts.Assist in developing and monitoring project budgets or financial plans and providing status reports designed for wide distribution to multiple committeesAssist in executing communications and change management plans.Other duties as assigned.REQUIREMENTS:Banner SIS modules 5-7 yrs experience.PMP or another PM Cert.Designing & creating reports for mgmt., MS Project & MS OfficeWHY DCS: Join DCS and get connected with a leading IT consulting firm who is passionate about creating strong client and consultant partnerships. We've been connecting the best with the best for over two decades and want to do the same for you. Are you ready to join our team?  For more info, visit us at www.dcshq.com."}