{"jobID": "2531804518", "jobLocation": "Boston_MA", "jobTitle": "Associate Market Researcher", "companyRating": "3.8", "companyInfo": {"Website": "www.cmbinfo.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Lieberman Research Worldwide, Ipsos, Millward Brown"}, "estimatedSalary": "39000", "jobDescription": " Associate Market Researcher Voices of CMB THE CHADWICK MARTIN BAILEY BLOG Check it outOur Clients  We work with amazing clients  Check them outOur Work  Interested in learning more about what we do?  Take a lookThe Associate Market Researcher will work on project teams with other project staff to oversee project administration tasks. This role will assist with project management including vendor management, contribute to development of questionnaire drafts, participate in qualitative and secondary research, perform data analysis, and assisting with deliverables.  Responsibilities and Expectations Client Services TeamAdhere to “The CMB Way” (defined approaches, processes, best practices, etc.)Contribute to marketing CMB by writing a blog annuallyTake advantage of training and development opportunitiesContributes to a team and/or committee for ongoing CMB initiativesEnsure end-to-end client/project delivery in alignment with Sales & Account Management leading to high client satisfaction with project deliverablesEssential DutiesActive participant as the Primary Associate on projectsManage data collection, cleaning, and processingDirectly participates in the production and proofing of client deliverables (e.g., reports, presentations, banner tables)Effectively communicates with project managers, peers and other senior staffActively owns and manages vendor relationships on projectsParticipates in peer reviews in a timely mannerQualificationsMinimum of one year of business experienceExcellent at proofreading and editing documents or presentationsExcellent at managing multiple projects and prioritiesExcellent attention to detailExcellent at establishing and managing relationships with clients, vendors and coworkersExcellent skills in PowerPoint, Excel, SPSS, Microsoft Word, and OutlookBA in a related field (e.g., statistics, marketing, market research, business management)Sense of humor and self-awareWe are looking for people to join our team that are collaborative, enthusiastic, and who can put their ego aside, roll up their sleeves and get the job done. If you are interested in any of these positions please forward a cover letter, a copy of your resume in MS Word, and your salary requirements to careers@cmbinfo.com. We are an equal opportunity employer. No agencies, please."}