{"jobID": "2816785446", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst, Consumer & Business Insights", "companyRating": "2.8", "companyInfo": {"Website": "www.williams-sonomainc.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1956", "Type": " Company - Public (WSM) ", "Industry": " Retail", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Room & Board, Design Within Reach, Pier 1 Imports"}, "estimatedSalary": "74000", "jobDescription": "Requisition Number: SS-13415  Area of Interest: Marketing  Organization: Corporate  Brand/Division: Shared Services  Position Type: Full-time JOB DESCRIPTION About the Team  The Marketing Strategy and Analytics team is based at the Williams-Sonoma, Inc. (WSI) corporate headquarters in San Francisco, CA. Through leading-edge expertise in Analytics, Data Science, and Marketing Strategy, our mission is to drive profitable growth across our brand portfolio and ensure that our brands are top-of-mind with consumers. We&apos;re responsible for leveraging multi-brand, multi-channel customer data to provide WSI with strategic advantages in the marketplace. We strive for continuous improvement and innovation in everything we do.  Our team delivers strategic advantages for the WSI family of brands by providing: Deep customer data insights to understand consumer behaviors and fuel opportunitiesPredictive analytics and data science best practicesData innovation & execution to power our world-class multi-channel marketing engineSophisticated, closed-loop measurement of marketing investment and programs About the Data Analyst Role Deliver customer analytic projects, providing actionable insights to business stakeholders. Examples include:Customer demographics, KPIs and other profile metrics for each brand as well as for key initiativesInsights to drive new customer acquisition, reactivation and retentionCustomer value, needs and preferences across life stages and cohortsMarket basket and other product-level analysesWork collaboratively with team members on various stages of analytic projects, such as:objective identification and hypothesis developmentsource data identificationprogramming in SQL, SAS, R or other statistical package for data manipulation and analysisinterpretation and extraction of insightssynthesis, packaging and communication of findings and recommendationsPublish business intelligence reporting for KPI tracking and performance trendingAssist with primary consumer survey data collection and analysis, integrating with CRM data to improve customer experience and business resultsCollaborate with Technology partners to improve data quality, new data capture and drive efficiency in usage.Seek continuous improvement in analytics tools and techniques, automation, results visualization and storytelling. Keep up with industry best practices. The successful candidate will... Be passionate about consumer data and curious about their behavior, always seeking ways to use data to impact their behavior with usHave a deep understanding of large scale marketing databases and systems, and expertise in data mining techniquesWork effectively with cross-functional partners in a collaborative environmentBe well-organized, with high attention to detail, deadline-oriented and act with a sense of urgency to drive actionable resultsHave excellent analytic and critical thinking skills, combined with strong written and verbal communication skills; Have strong ability to translate complex data into compelling stories; Have strong data visualization skills Why you will love working at Williams-Sonoma, Inc. We&apos;re a successful, fast-growing company with an entrepreneurial vibe and inclusive cultureWe&apos;re a data-driven business where marketing analytics are highly valuedWe&apos;re passionate about our internal and external customers, and live & breathe the customer experienceWe have a smart, experienced leadership team that wants to do it right and is open to new ideasWe have fun!REQUIREMENTS AND QUALIFICATIONS We&apos;re excited about you if you have... a degree in a quantitative field such as Statistics, Mathematics, Applied Analytics, Operations Research or Computer Science2 to 4 years of business-based analytics, with hands-on data analysis experience with SAS, SQL, R or other similar analytic tools. Knowledge of emerging analytic techniques and toolsExperience in multi-channel consumer retail industry is a major plus About Williams-Sonoma, Inc.  Founded in 1956, WSI is the premier specialty retailer of high-quality products for the home and kitchen in the United States. Our family of brands (Williams Sonoma, WS Home, Pottery Barn, Pottery Barn Kids, PBteen, West Elm, Rejuvenation, and Mark & Graham) are among the best known and most respected in the industry. We offer beautifully designed, stylish and functional products for every area of the home and for every life stage. We&apos;ve seen big changes since our first brick-and-mortar store opened more than half of a century ago. What hasn&apos;t changed is our passion for high-quality products, functional design, outstanding customer service, and enhancing the lives of our customers and the communities where we operate. Today, we&apos;re a multi-brand, multi-channel, global enterprise supported by state-of-the-art technology and some of the most talented teams in retailing -- and we&apos;re always looking for new energy and ideas.  Williams-Sonoma, Inc. is an Equal Opportunity Employer.  Williams-Sonoma, Inc. will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance, or other applicable state or local laws and ordinances."}