{"jobID": "2437896448", "jobLocation": "San_Francisco_CA", "jobTitle": "Forward-Deployed Data Scientist", "companyRating": "5.0", "companyInfo": {"Website": "www.heapanalytics.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Mixpanel, Kissmetrics"}, "estimatedSalary": "121000", "jobDescription": " We're looking for the founding member of our client-facing data science team.  We have access to an unprecedented amount of data due to how Heap works. Our approach to analytics means that we have a complete picture of everything our customers’ customers do within their product. We’ve barely scratched the surface of what we can do with that data.  As a forward-deployed data scientist, you’ll work with our largest clients on strategic projects to uncover insights about their users. The work you do will push the boundaries of what can be accomplished with Heap, will feed directly back into our product roadmap, and serve as the source of content to define Heap as a thought-leader in this space. You will have a deep impact on our customers’ strategy, and you’ll get to work with customers across a breadth of roles, industries, and business models. Your responsibilities: Be the data expert our customers don’t have access to. Learn what challenges our clients are facing, and solve their problems using your unique skillset and vantage point. Maybe a customer has a massive churn problem, and you build a statistical model to predict churn before it happens.  Think strategically about businesses. What questions are our customers not asking that they should be?  Become a Heap and SQL power user. The main platforms you’ll use are Heap and our customers’ data warehouses. You’re also not afraid to get your hands dirty with Python, R, JavaScript, or whatever else is required to solve a problem.  Publish your work. You’ll be among the first in the world to notice macro trends affecting various types of online businesses, and you’ll write reports about your findings. You'll need to have: Experience in a consultative, customer facing role (management consulting, account management, etc)  Multiple years of data analysis or software engineering experience.  Strong project management skills  Strong writing skills  A willingness to travel to clients as needed  Heap has raised $40M in funding from NEA, Y Combinator, Menlo Ventures, SVAngel, Sam Altman, Garry Tan, Alexis Ohanian, Harj Taggar, Ram Shriram, and others.  We work in SF, can cover relocation costs, and offer plenty of awesome benefits. We'd love to hear from you!"}