{"jobID": "2810683183", "jobLocation": "New_York_NY", "jobTitle": "Jr. Data Scientist", "companyRating": "5.0", "companyInfo": {"Website": "www.gracehamptons.org", "Headquarters": "Southampton, NY", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Non-Profit", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "76000", "jobDescription": " LocationNew York, New YorkShift:Day (United States of America)Description:  Join the Artificial Intelligence team at New York's #1-ranked hospital.  Junior Data Scientist  At New York-Presbyterian, we're leveraging the most innovative and transformative technologies to provide the highest quality care to our patients. This is your opportunity to provide world class technology solutions that will directly impact the quality of a patient's life. Thrive in our fast-paced environment, as you lead enterprise-wide implementation of AI. Join and collaborate with a tight-knit team of creative and ambitious data analysts, engineers, and developers, working on the most important enterprise initiatives in our healthcare system. Ultimately you will be a critical part of building the hospital of the future, as we integrate A.I. into all aspects of healthcare delivery and make a huge positive impact on patient lives.  Our Artificial Intelligence team is seeking an innovative, results-oriented data scientist to support, enhance, and expand NewYork-Presbyterian's artificial intelligence program in redefining our healthcare delivery operations. Our mission is to enhance healthcare delivery through integration of machine learning, extracting knowledge from millions of data points from the electronic medical record and clinical documents to generate actionable insights for our clinical, operational, and enterprise teams. As a critical member of our A.I. deployment team, you will oversee machine learning algorithm generation and be responsible for establishing and maintaining a quality pipeline of models. Working with senior executives and clinical leadership, you will have a prominent voice in shaping strategic decisions and process redesign across the enterprise.  Preferred Criteria Masters in Computer Science, Bioinformatics, Physics, Mathematics, or other data science related fieldExperience in neural network models in Keras and/or Tensorflow / TheanoExperience in MLaaS (AWS, Azure, GCP)Previous related experience in machine learning techniques and best practicesPython experience and related ML packages (scikit-learn, numpy, etc.)Proficiency in data analytics and engineering, able to clean, transform, and merge data for ML purposes Required Criteria Bachelor's degree or equivalent experienceThree to five years of previous work related experience Join a hospital where employee engagement is at an all-time high. Enjoy competitive compensation along with benefits such as tuition reimbursement, hospital retirement contributions, and financial planning assistance. Start your life-changing journey today. __________________#1 in New York, \"America's Best Hospitals 2017-2018\" - U.S.News&World; Report2017 \"Best Large Workplaces in New York.\" - Great Place to Work and Fortune2017 \"America's Best Employers.\" - Forbes Discover why we're #1 in New York and a best employer at: nyp.org/careers"}