{"jobID": "2801598767", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.anaplan.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "176000", "jobDescription": "Senior Data ScientistBLOGCOMMUNITYLOGINSolutionsCustomersPlatformAppsResourcesAboutGet demo Senior Data Scientist  Development San Francisco, United States now Description  Originally founded in York, UK and now headquartered in San Francisco, Anaplan has offices all over the world. In fact we may be the most successful company you've never heard of. We are on a mission to revolutionize how companies analyze and plan their businesses. And it's working - we are already trusted by hundreds of Fortune 2000 companies and we've only just begun.  The Team  We are looking for Data Science Evangelists to be part of our rapidly expanding global engineering effort.  The Role  As a Senior Data Scientist you will help disrupt the future of business planning through Machine Learning. Analyze a massive amount of data from Supply Chain, Sales, Marketing, Finance, to IT & Ops to develop predictive models to help our enterprise customers make better business decisions. Unlike many startups, we have many customers and a lot of real business data to tackle real problems. YOU HAVE6+ years of experience applying advanced AI techniques (machine learning, predictive analytics, optimization, semantic analysis, time-series analysis, advanced visualization) to real-world problems2+ years experience in Deep Learning such as CNN, RNN, LSTM.Proficient with R or PythonYou have a demonstrated ability to iteratively conceptualize, design and build data-driven analytical models, and have taken a project leadership role in shaping these solutions.Strong capabilities in modern analytics languages/tools.You have expertise in Deep Learning and one of the following other areas: Optimization or Operations Research, NLP or Machine Learning.Hands on experience with frameworks such as Tensorflow, Theano, Keras, Torch, is desirable.A huge plus if you have hands on experience in one of the following: Spark: pyspark MLlib (running ML algorithms on local Hadoop cluster environment), or GCP or AWS or machine learning on Azure.Master's in Computer Science, Operations Research, Statistics, Applied Math.You have experience manipulating and preparing large, heterogeneous data sets ('Big Data') to support advanced analytics.JUST SOME OF THE THINGS WE OFFER:The opportunity to work for one of the coolest companies in global tech - our awards include Top 10 Most Innovative Enterprise Software Companies (Fast Company 2016) & a double Magic Quadrant Visionary (Gartner, 2015)Highly competitive salaries - we're very serious about attracting the very best technologists in the industry.A long list of incredible benefits worthy of a leading Silicon Valley tech firm (inc. stock options, bonuses, healthcare, flexible working hours, global travel opportunities and much more.A rewarding, progressive and tailored career path with a company that values diversity, innovation and invests in you.Huge technical problems to solve - you will constantly be learning and pushing boundaries, working with some of the smartest people around!ABOUT US: Anaplan is driving a new age of connected planning. Large and fast-growing organizations use Anaplan's cloud platform in every business function to make informed decisions and drive faster, more effective planning processes. Anaplan also provides support, training, and planning transformation advisory services.  Find out more at ***************  now Later  {{ job.title }}  Powered by Jobvite PlatformOverviewBuild AppsFeaturesSolutionsFinanceSalesSupply ChainWorkforceMarketingITAppsOverviewFinanceSalesMarketingSupply ChainHRITResourcesBlogFinanceITMarketingPlatformSalesSupply ChainWorkforceAboutPeopleRecognitionCareersNewsCustomersPartnersLocationsContactSocialLinkedInTwitterFacebookGoogle+Get demo"}