{"jobID": "2735236346", "jobLocation": "New_York_NY", "jobTitle": "Customer Success Manager, Mid-Market", "companyRating": "4.8", "companyInfo": {"Website": "www.procore.com", "Headquarters": "Carpinteria, CA", "Size": "1001 to 5000 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "88000", "jobDescription": " Procore is seeking a Mid-Market Customer Success Manager to focus on building, retaining and growing our Mid-Market Clients. This person will work closely with Procores Install-Based Sales team and act as a liaison between various Procore teams in order to ensure our clients are set up for success.  To be successful in this role, were looking for individuals with a consultative mindset who can quickly understand both Procores Technology and the industries we serve. You will apply best practices and solutions to each client based on their individual business goals and objectives. Youll be instrumental in creating long-lasting Procore partnerships and responsible for delivering ROI analysis for your client base to drive positive client outcomes for Procore. Leveraging this consultative approach, you will deliver Industry and Technology thought leadership while encompassing Procores values of Openness, Optimism and Ownership.  All applicants must have at least 2-5 years experience in account management (preferably in a SaaS environment). Travel required (up to 15-20%).  This position is based in New York City, New York. What youll do:Strong understanding of best practices relevant to retaining and growing accounts within a personal portfolio while mitigating risk.Develop and execute on account strategies for mid-Market accounts, while working alongside Procores sale team to deliver positive outcomes for Procore clients.Build trust and create meaningful relationships among Champions and key Executives within each account.Ensure each client understands the ROI/value Procore delivers to their business through conducting virtual or on-site business reviews to each client that align to our clients business goals and objectives.Identify and forecast risk as well as growth opportunities within portfolio.Identify product improvements or new products by remaining current on customer needs, industry trends, market activities, and competitorsWhat were looking for:At least 2-5 years account management experience, preferably in a Saas environmentStrong empathy for customers AND passion for revenue and growthStrong understanding of value drivers in recurring revenue business modelsSuccessful candidates will be: innovative, persuasive, creative and have a genuine curiosity in their clients business. Goal and results oriented, optimistic, smart, value added mindset, proactive and easily adapts to change.Must work well within a team environmentPrevious sales experience a plusAbout Us Procore Technologies is building the software that builds the world. We provide cloud-based construction management software that helps clients more efficiently build skyscrapers, hospitals, housing complexes, and more. Our headquarters is located on the bluffs above the Pacific Ocean in Carpinteria, CA, with growing offices worldwide. Check us out on Glassdoor to see what others are saying about working at Procore!  We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Perks & Benefits You are a person with dreams, goals, and ambitionsboth personally and professionally. That's why we believe in providing benefits that not only match our Procore values (Openness, Optimism, and Ownership) but enhance the lives of our team members. Here are just a few of our benefit offerings: competitive health care plans, unlimited paid vacation, employee enrichment and development programs, and volunteer days."}