{"jobID": "2795972175", "jobLocation": "New_York_NY", "jobTitle": "UI/UX Designer", "companyRating": null, "companyInfo": {"Website": "www.konradgroup.com", "Headquarters": "Toronto, Canada", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Konrad Group Konrad Group is a next generation digital consultancy. We are dedicated to solving complex business problems for our global clients with creative and forward-thinking solutions. Our employees enjoy a culture built on innovation and a commitment to creating best-in-class digital products in use by hundreds of millions of consumers around the world. We hire exceptionally smart, analytical, and hard working people who are lifelong learners. Experience Designer (UI/UX) As an Experience Designer (UI/UX) you will be responsible for designing compelling digital experiences from conception to delivery in a cross-functional environment. You will bridge the gap between design, business, and technology to ship world-class digital experiences for leading companies and global brands. ResponsibilitiesDevelop a comprehensive understanding of project needs by attending design thinking workshops, performing user research, conducting user tests, and designing rich interactive experiencesIdentify areas of opportunities for clients and solve functional challenges through brainstorming, ideating, and designing digital solutions with other members of the teamWork with developers and consultants to understand technology requirements and business objectives as they relate to the designs of the productsBuild industry-leading solutions by staying up to date with design best practices and latest technologiesContribute to Konrads overall design culture by learning emerging softwares, standards and processesSuccessful candidates will have1-3 years experience in UI and UX designStrong conceptual thinking and design execution abilities in both visual and interaction designIntimate knowledge of Sketch, Adobe Creative Suite and prototyping toolsExperience in motion design and web or mobile development is a bonusOrganization, interpersonal and communication skills, with a passion towards the digital spacePerks and BenefitsFlexible Vacation PolicyHealth & Wellness ProgramsCulture of Learning & DevelopmentFully-Stocked Kitchens & LoungesNew Shiny Device UpgradesMonthly Socials & Team OutingsBonus Points: Have you taken any courses at BrainStation? A lot of our design and development best practices and processes are taught during our courses - make sure to highlight this experience in your cover letter if you have! Konrad Group is committed to maintaining a diverse work environment and is proud to be an equal opportunity employer. All qualified applicants, regardless of race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status will receive consideration for employment. If you have any accessibility requirements or concerns regarding the hiring process or employment with us, please notify us so we can provide suitable accommodation. While we sincerely appreciate all applications, only those candidates selected for an interview will be contacted."}