{"jobID": "2817129900", "jobLocation": "New_York_NY", "jobTitle": "Data Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.hsbc.com", "Headquarters": "London, United Kingdom", "Size": "10000+ employees", "Founded": " 1865", "Type": " Company - Public (HSBC) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " J.P. Morgan, Wells Fargo"}, "estimatedSalary": "72000", "jobDescription": " Role to assist the successful delivery of projects and sprints which requires getting data from a variety of different sources, getting it in the right formats, assuring that it adhere to data quality standards, and assuring that downstream users can get that data quickly. This role usually functions as a core member of an agile team.  The candidate will be responsible for insight from raw data and handling diverse sources of data seamlessly. Additional responsibilities will include developing prototypes and proof of concepts for the selected solutions with a focus on collecting, parsing, managing, analyzing and visualizing large sets of data using multiple platforms.  These professionals should have knowledge of data analysis, end user requirements analysis, and business requirements analysis to develop a clear understanding of the business needs and to incorporate these needs into business solutions.  These individuals must work well in a dynamic team environment. Key Accountabilities:Being open and approachable for new requirements and enthusiasm for improvement and coaching more junior colleagues within the teamDevelop and support a wide variety of information deliverables in both ad hoc and production fashionImplement profitability algorithms, segmentation schemes and propensity to purchase modelsWork with internal clients to translate complex business requirements into data models and outputs for reporting and deployment, including Qlik based visualizationDevelop a deep knowledge of data sources required to make recommendations on information to be extracted to meet the business deliverablesExtract, clean and validate data relevant to analysesBlend required data and transform with required business criteria and logical specifications to develop and produce key outputs including data for visualization teamEffectively document assumptions, methodology and validation techniques to meet audit requirementsAide in build out and ongoing enhancements of long-term data infrastructure that can be leveraged for analytical insights and prediction-based modelsAssist in identifying and connecting additional data sources to new and existing Business Intelligence environments.Provide thought leadership and technical mentorship to your teammates. Leadership&Teamwork; Support achievement of the HSBC vision, Values, goals and culture in personal behavior, actions and decision makingProvide technical leadership and support technical excellence by searching out external and internal best practice, monitoring technical and professional developments, sharing knowledge and encouraging others to do the same in the best interests of HSBC and its customersEncourage and enable constructive cross-country and cross-business teamwork by demonstrating collaboration and matrix management in action and challenging actions and behaviors that are not consistent with HSBC's diversity policy and/or the best interests of the business and its customersWe offer:Entrepreneurial job in professional teamInteresting path of career in an international organizationAgile environmentTechnical Requirements:Must have significant experience working with multiple datasets with a high degree of complex relationshipsExperience with integration of data from multiple data sourcesExperience with BI Tools. Python and R idealExperience with data analysis (data lineage, metadata, data quality and governance) and Data Modeling (conceptual, logical and physical) activitiesCommercial Banking industry experience is a plusPreferred Requirements:University graduate followed 3 experience,Experience in Agile type methodologies will be an advantage,Prior working experience in a bank or a financial institution will be an advantage but not a must,Ability to work in changeable environment,Curiosity and learning capabilities,Strong written and verbal communications skillsAdvanced ability to articulate analytical processes and resultsStrong qualitative and quantitative analytical skills EEO/AA/Minorities/Women/Disability/Veterans"}