{"jobID": "2751734312", "jobLocation": "Oakland_CA", "jobTitle": "Data Scientist Ops & Research Lead", "companyRating": null, "companyInfo": {"Website": "www.bodegaoncentral.com", "Headquarters": "Saint Petersburg, FL", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "You'll be responsible for one or more of the following:Logistics App: Our goal is to democratize physical distribution, so that mom and pop store owners, boutique brands, and large retailers can reach customers in ways they’ve never been able to before. You will design and help define the product, development, and metrics that allow us to optimize our complex supply chain.Experimentation Framework for Retail performance: We already collect and scalably warehouse per-transaction data that gives an unparalleled view on each transaction. You will design and own the system that we use to run, manage, visualize, and ultimately make actionable recommendations to our day-to-day operations and fulfillment businesses.Item discovery and recommendation: As we grow our brand and supplier item to grow our inventory set, we’re simultaneously building out hierarchies and taxonomies for tagging and classifying these items. You will help our retail team discover and metric the items we sell.Journal Club: You will help drive our internal journal club, where we review the latest and greatest papers, demos, and novel methods in your field of expertise.QUALIFICATIONS3+ years of experience using data and machine learning to solve business, logistics, or computationally intensive research challenges.MS/PhD in statistics, optimization, operations research, or machine learning.Background in one or many of: experimental design, demand forecasting, supply-chain optimization, linear optimization, collaborative filtering recommendation systemsStrong written and verbal communication skills, as you will need to interface with functional leads in our operations, retail, and sales organizations.Incredibly fast learner, hungry for growth and/or ready to lead.PREFERRED/BONUS QUALIFICATIONS1+ years of full-stack software development experience.3+ years of experience managing a retail or last mile supply chain.3+ years of experience with one or more general purpose programming languages including but not limited to: Java, C/C++, C#, Objective C, Python, JavaScript, or Go."}