{"jobID": "2812258610", "jobLocation": "Burbank_CA", "jobTitle": "Senior Managing Data Scientist, Digital Analytics", "companyRating": "3.9", "companyInfo": {"Website": "www.kaiserpermanente.org", "Headquarters": "Oakland, CA", "Size": "10000+ employees", "Founded": " 1945", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " HCA Healthcare, Dignity Health, Sutter Health"}, "estimatedSalary": "146000", "jobDescription": " Provides oversight and/or leads major projects that inform the growth and market strategies essential to KP's revenue, membership and margin goals. Strategic Market Planning Managers provide analytical/strategic-thinking and leadership skills that enable project teams to:  1) isolate business issues;  2) design and execute analytics for studying business issues (market research, scenario planning, forecasting, market share, profitability, etc);  3) bring technical/content expertise (competitive intelligence, utilization, financial analysis, market research, deep data analysis & programming);  4) vet findings and make formal recommendations to senior levels of KP leadership;  5) review/approve strategic recommendations. Incumbents would manage teams whose work includes membership forecasts & goals, strategies to achieve membership, revenue & margin goals, market research findings, competitive intelligence insights. Selects, develops, evaluates, coaches, and advises personnel. Essential Functions: Works with director to develop scope of work for team, sequencing, defining value proposition, setting strategic and business direction, context & priorities for the team.  Provides oversight, coaching & management to more senior individual contributors (e.g. Analysts, Data Consultants, Senior Market Strategy Consultants I, Senior Market Strategy Consultants II, and Senior Data Consultants).  Educate and communicate goals, strategy, and methodologies clearly and persuasively.  Build relationships with internal and external partners. Preferred Experience: Track record of Paid Search Analytics Basic Qualifications: Experience  Minimum eight (8) years of content/functional experience.  Minimum two (2) years of management experience, OR;  Master's degree and a minimum four (4) years of experience. Education Bachelor's degree in business, economics, mathematics, statistics, OR four (4) years of experience in related field.  High School Diploma or General Education Development (GED) required.  License, Certification, Registration  N/A Additional Requirements: Advanced knowledge (broad expertise or unique knowledge) of policies, practices and systems.  Develops advanced concepts, techniques, and standards.  Develops new applications based on professional principles and theories.  Viewed as functional expert in field within KP.  Applies advanced principles, theories, and concepts.  Contributes to the development of innovative principles and ideas.  Must be able to work in a Labor/Management Partnership environment. Preferred Qualifications: Minimum eight (8) years of content/functional experience preferred.  Minimum three (3) years of management experience preferred.  Master's degree preferred. "}