{"jobID": "2831520121", "jobLocation": "Boston_MA", "jobTitle": "Equity Analyst", "companyRating": null, "companyInfo": {"Website": "www.boston.k12.ma.us", "Headquarters": "Roxbury, MA", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " School / School District", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "***INTERNAL CANDIDATES ONLY Boston Public Schools seeks an Equity Analyst.  Reports to: Assistant Superintendent of Equity  Founded in 1647, Boston Public Schools (BPS) is the oldest public school district in the country. With approximately 58,000 students from over 114 different countries, nearly 10,000 employees, including nearly 5,000 teachers, and an annual budget of $712 million, the BPS is the largest school district in Massachusetts.  The Office of Equity is charged with monitoring and helping to ensure employment and educational equity district-wide. The Office has primary responsibility for investigating student, family, and employee concerns regarding bias-based conduct, responding to employee requests for disability and religious accommodations, providing training on how to prevent and address bias-based conduct, and ensuring that an equity lens is applied to school and district decision-making.  The analyst will: Assist with and conduct investigations of allegations of bias-based conduct, including conducting and documenting interviews, drafting investigative findings, and documenting case progress and closure.Assist with and conduct interactive dialogues regarding requests for accommodations, including interviewing employees, contacting medical personnel, and implementing accommodations.Assist with and deliver training, including taking the lead role in training for line staff and students.Supervise undergraduate interns who assist with intake and administrative work.Generate reports regarding the work of the Office of Equity.Serve as office manager, including overseeing the Office budget. We are seeking a talented, energetic individual to join our small, dedicated team. The analyst will take part in all aspects of the Office’s work. REQUIREMENTS:Investigate allegations of bias-based conduct, including conducting, comprehensive interviews with parties; accurately and thoroughly documenting interviews; drafting and/or proofreading clear, concise investigative findings; and ensuring all relevant steps and documents are entered in the case management system.Provide information to school and central office supervisors and managers regarding Equity policies and protocols.Respond to requests for accommodations, including interviewing stakeholders, contacting medical personnel, and implementing accommodations.Managing and delivering employee and student training sessions, including maintaining the My Learning Plan database to track participation.Monitor and track data to quantify the work of the Office of Equity and identify trends.Provide operational support to the Assistant Superintendent of Equity and other members of the Equity team.Other duties as assigned by the Assistant Superintendent of Equity.QUALIFICATIONS-REQUIRED:Current BPS EmployeeBachelor’s degreeStrong written and verbal communication skillsStrong organizational, problem solving, and interpersonal skillsStrong attention to detail and ability to coordinate multiple projects simultaneouslyAbility to work effectively and comfortably in a team oriented, fast paced environment both within the department and across departmentsAbility and willingness to reflect on and improve on own performance, including continually developing cultural competenceDemonstrated commitment to diversity, equity, and inclusion, with a history of working effectively with people from various identities, including race, ethnicity, language, religion, gender, sexual orientation, and disabilityAdvanced knowledge of Google and/or Microsoft Office products, including Word, Excel, and PowerPoint, and Google Mail, Docs, Sheets, Slides, and DriveCurrent authorization to work in the United States - candidates must have such authorization by their first day of employmentQUALIFICATIONS-PREFERRED:Experience conducting internal investigationsExperience conducting trainingPrior work experience in the field of education, particularly urban public educationPrior work experience in the public sectorFluent in Spanish or another of the most common languages among BPS families (besides English)QUALITIES-PREFERRED:Results-oriented team player who can work collaboratively, but is also able to take initiative and work independentlyThirst for knowledge and a “can-do” attitudeExceptional attention to detailA passionate and urgent desire to ensure that every child in Boston has equitable access to a high-quality education in a welcoming and inclusive school, and that every employee of the Boston Public Schools is able to flourish in a respectful and culturally responsive workplaceTERMS: Managerial Tier C. This position is subject to the City of Boston residency requirement. Please refer to www.bostonpublicschools.org/ohc (under \"Employee Benefits and Policies\") for more information on salary and compensation. Salaries are listed by Unions and Grade/Step.  The Boston Public Schools, in accordance with its nondiscrimination policies, does not discriminate in its programs, facilities, or employment or educational opportunities on the basis of race, color, age, criminal record (inquiries only), disability, homelessness, sex/gender, gender identity, religion, national origin, ancestry, sexual orientation, genetics or military status, and does not tolerate any form of retaliation, or bias-based intimidation, threat or harassment that demeans individuals’ dignity or interferes with their ability to learn or work."}