{"jobID": "2631119320", "jobLocation": "Stanford_CA", "jobTitle": "Pantry Chef", "companyRating": "3.1", "companyInfo": {"Website": "www.guckenheimer.com", "Headquarters": "San Mateo, CA", "Size": "1001 to 5000 employees", "Founded": " 1965", "Type": " Company - Private", "Industry": " Restaurants, Bars & Food Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "46000", "jobDescription": " Food. Cooking. Creativity. Is this your life? Do you believe that commitment unlocks unlimited potential? We are the perfect Company to launch or further your career. We are all about great ingredients, culinary innovation and nourishing inspiration. Oh yeah, we don't work weekends unless we are opening a new location or kicking it at some cool industry event.  Guckenheimer, is a national foodservice management company that pioneered restaurant style, healthful dining in the workplace. We encourage our team members to join in community events such as Chef Ann Foundation to support the #RealSchoolFood campaign, promoting cooking healthy meals with real ingredients at schools., Second Harvest Food Bank, Girls on the Run, and many more community programs.  We offer fantastic health and wellness benefit options that include but not limited to medical, HSA, a rewarding wellness program, dental, vision, FSA, commuter benefits, EAP, free meal each day, free pair of safety shoes at time of hire, and much more. Guckenheimer's own Learning Management System at your fingertips and a yearly tuition reimbursement program will enable you to enhance your career development in your new and exciting position with Guckenheimer!  We encourage you to apply to our Pantry Chefopportunity and bring your knowledge and passion of high quality food and customer service to our culinary program. Position Summary: Produce cold foods that are visually appealing and good tasting to Guckenheimer standards  Prepare, season, and cook meats, salads, cold catering or other foodstuffs as required. Qualifications:Passion for customer servicePositive attitudeDependableAbility to communicate effectivelyPosition Responsibilities:Prepare and supervise production of cold foods for the Health Bar, Sandwich Station, Specialty Salads, Grab and Go and catering as required.Season and cook food according to recipes and experience.Observe and test foods to determine if they have been cooked properly. Adjust seasoning to customer tastes.Use ingredients according to recipes, using various kitchen utensils and equipment.Portion, arrange, and garnish food, and serve food to patrons.Substitute for or assist other cooks during emergencies or rush periods.Complete produce inventory and orders.Organize product and utilize ingredients to minimize waste.Must follow all safety rules and actively prevent accidents.Commitment to the service values and ethics of the client company.Must comply with all ServSafe and HACCP programs and principlesEssential Skills and Experience:Must be able to correctly and safely use standards kitchen equipment. Chefs' knives; Convection ovens; Rotating rack ovens; Meat and cheese slicing machines, steamers, mandolins, grills, deep fryers, and broilers.Knowledge of raw materials, production processes, quality control, costs, and other techniques for food preparation. Use of food cost control methods.Reporting to this position: Supervises other employees assigned to prepare cold food items. Reports to: Food Service Manager, General Manager FLSA Status: Nonexempt Physical Demands and Work Environment:Ability to lift a minimum of 25 #.Ability to work on their feet 7.5 hour per day excluding breaks.Employee has to work under pressure and time deadlines during peak periods. Guckenheimer embraces equal opportunity employment  Guckenheimer participates in the E-Verify Program, as required by Law"}