{"jobID": "2740375972", "jobLocation": "Boston_MA", "jobTitle": "Marketing Data Analyst", "companyRating": "2.3", "companyInfo": {"Website": "www.vantagetravel.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 1983", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Viking Cruises, Grand Circle, Uniworld River Cruises"}, "estimatedSalary": "59000", "jobDescription": " OverviewThe Marketing Data Analyst is responsible for collaborating with marketing teams to gather & analyze data, create reports, research deep dives, and support data driven decision making.About Vantage Vantage Deluxe World Travel is the leader in adventure travel for thirty-five years. Since 1983, Vantage Deluxe World Travel develops and delivers memorable travel journeys on seven continents whether on land, riverboats or small ships.  Vantage Deluxe World Travel is a $300 million, state-of-the-art direct marketer of travel to the affluent mature market. When you join the Vantage team you become part of a global company, headquartered in Boston, with eight regional offices around the world. Our worldwide teams work together to provide exciting, culturally enriching travel programs to destinations on all seven continents, including on our European river cruise fleet. Since 1983, more than 400,000 travelers have joined us to see the world.Responsibilities Conduct ad-hoc analysis through database querying, subsequent interpretation, and refinementMaintain and enhance a core set of weekly reports used to operate the marketing departmentCultivate a deep understanding of business drivers, business metrics definitions, and pro-actively interact with business to give context and support them interpret reporting dataWork with data source providers and technology teams to ensure that key decision data is accurate, automated and timelyAdditional Responsibilities:Collaborate with business users to drive and analyze business campaigns such as emails, a/b tests, online advertising, etc.Conceptualize and run analysis that generate insights on customer behavior and customer needs to help further developing our service to the customerPartner with IT teams to support the development and enhancement of Business Intelligence infrastructure that supports the Marketing Department.Monitor existing metrics, develop and propose new metrics, and work across the organization to make actionable intelligence available to business stakeholdersQualificationsExceptional analytical skills coupled with solid business foundation.An innate aptitude for mathematics, logic, and data.A positive and self-directed attitude – interested in problem solvingProficiency with SQL, Relational Data, & Excel.Excellent oral/written communication and presentation skills.BA/BS Degree in Mathmatics or Computer ScienceMasters or MBA preferredMS SQL Server and TSQL preferred.This company is run by the numbers and strictly adheres to weekly reporting and holding people accountable to their numbers.EQUAL OPPORTUNITY EMPLOYER: Vantage Travel is an equal opportunity employer; applicants are considered for all roles without regard to race, color, religious creed, sex, national origin, citizenship status, age, physical or mental disability, sexual orientation, marital, parental, veteran or military status, unfavorable military discharge, or any other status protected by applicable federal, state or local law.  #ZR  #LI-SN1"}