{"jobID": "2651175326", "jobLocation": "Bellevue_WA", "jobTitle": "Data Scientist", "companyRating": "3.9", "companyInfo": {"Website": "www.lifeatexpedia.com", "Headquarters": "Bellevue, WA", "Size": "10000+ employees", "Founded": " 1996", "Type": " Company - Public (EXPE) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Priceline.com, Booking.com, Kayak.com"}, "estimatedSalary": "142000", "jobDescription": " ExpediaExamples of applications they work on include identifying credit card fraud in online transactions, user behavior analysis to detect suspicious login behavior and data transfers on the corporate network, automatically finding data inconsistencies, and optimization of transaction queues. Building on strong competencies in Statistics, Machine Learning, Artificial Intelligence, Data Mining, Operations Research, Natural Language Processing and so on, they work closely with business units and internal partners to understand issues and implement industry-leading solutions. ERS Data Scientists continually perform deep dives into the data to uncover new patterns and business opportunities, and take the lead to move new ideas from inception to production.  Responsibilities Develop, validate, and maintain data mining tools, algorithms, and other capabilities to solve problems in fraud and cybersecurityCollaborate with other statisticians and data scientists to formulate innovative solutions to experiment with and implement advanced modeling techniquesAnalyze data covering a wide range of information from customer profile to transaction historyCommunicate complex concepts and the results of the analyses in a clear and effective mannerCollaborate with Engineering, Product, and Operations teams Qualifications Requires a Ph.D. degree in Computer Science, Statistics, Engineering, Mathematics, Operations Research, or PhysicsMinimum two years of industry experience preferred in developing machine learning models and deployment in productionProfessional experience in fraud and/or security modeling preferredStrong coding skills in R, Python, SQL, and JavaExpertise in using TensorFlow and XGBoostStrong problem solving skills and communication skills *LI-DY1Expedia is committed to creating an inclusive work environment with a diverse workforce. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. This employer participates in E-Verify. The employer will provide the Social Security Administration (SSA) and, if necessary, the Department of Homeland Security (DHS) with information from each new employee's I-9 to confirm work authorization."}