{"jobID": "2748216148", "jobLocation": "Boston_MA", "jobTitle": "New Grad - Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.viasat.com", "Headquarters": "Carlsbad, CA", "Size": "1001 to 5000 employees", "Founded": " 1986", "Type": " Company - Public (VSAT) ", "Industry": " Telecommunications", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Harris, Gogo, Inmarsat"}, "estimatedSalary": null, "jobDescription": "Job ResponsibilitiesBecome a personal contributor in our mission to connect the world. Viasat Data Scientists innovate in an environment that encourages collaboration while challenging the status quo. Join the industry leader in satellite communication and technology and take control of your professional pathway.  Our culture empowers us to do the right thing and explore technology that will benefit people across the globe. It is uniquely Viasat and, intentionally, not like any other company.  As a new graduate, we understand that seeking your dreams is your ambition…and achieving them is ours.  Viasat Impact: Residential broadband service – over 700K customers and growingViasat Satellite technology holds the Guinness World Record for highest capacity communication satelliteOur in-flight Wi-Fi connectivity is presently streaming Amazon Prime and Netflix on providers like JetBlue and United AirlinesSecure communication services - trusted encryption and networking solutions (government, military, critical infrastructure & utilities) Are you interested in becoming part of a team that will change the way the Internet is experienced? The Acceleration Research and Technology (ART) group of Viasat, Inc (NASDAQ: VSAT) is developing products that will enable the Internet to be experienced as never before. The acceleration technology we are building will enable people to flip through web pages as quickly turning pages in a book.  Though we are part of a well-established public company based in San Diego, ART is a small start-up-like organization just off the Red Line south of MIT.  You will be working with large structured and unstructured data sets to develop and validate algorithms that learn how web pages are structured and evolve over time and will use these models to drive improvements in web page rendering. You will perform data modeling and predictive analysis as well as statistical analysis.Requisition15759BRRequirementsBachelor of Science or Arts degree or higher in Computer Science or Masters of Science or PhD candidate in a discipline requiring strong mathematics and statistical methods1+ years developing software in Java, python, C++ and other high level languages.Relevant experience as described above with a solid background in machine learning, statistical analysis, and software development.Solid background in machine learning, statistical analysis, and clustering algorithmsStrong software development skillsU.S. Citizenship or Lawful Permanent Residence status may be required for some projects in which case, verification of such status will be required upon accepting employment.Up to 10% travelPreferencesKnowledge and experience with predictive modeling including: Multivariate Regression, Logistic Regression, Combinatorial Optimization, Stochastic Processes, Complex Analysis, Principal Component Analysis and Time Series Analysis.Experience with Matlab, R , or Weka.Experience with using the Agile software development methodology to develop and deliver software so as to support a continuous integration/continuous deployment process.Working knowledge of LinuxStrong communication and presentation skills – you must be able to explain and present hypotheses and analysis results to a wide audience in a clear and concise manner.Experience developing distributed systems Our Boston office is located in the heart of this historic city, ideally situated in the center of the Financial District, just a block north of South Station. Neighboring the Downtown Crossing shopping district, Chinatown, and the Leather District’s trendy residences and restaurants, our downtown high-rise suite is so close to Boston Harbor employees can kayak during lunch.  Boston is one of the “Most Walkable,” “Most Transit-friendly,” and “Most Bike-friendly” cities in America and is known for its world-renowned colleges, tech start-ups, avid sports fans, and rich American history.  Our Boston site is also close enough to Viasat’s Marlborough, MA office – a 50-minute drive on I-90 - that employees can work in either office.  If you are ready to take control of your career and help illuminate the world for those who have been in the dark, you might be ready to join our team. Please take a minute to submit your resume. We will let you know once we’ve received it and will follow up with you if there is a possible match. This could be the start of something amazing! ** ViaSat is an EEO/AA/Disability/Protected Veteran Employer. U.S. Citizenship or Lawful Permanent Residence status may be required for certain positions. For positions requiring U.S. Citizenship or Lawful Permanent Resident status, verification of such status will be required upon accepting employment. "}