{"jobID": "2758021314", "jobLocation": "Redwood_City_CA", "jobTitle": "Survey Project Manager | Redwood City and Walnut Creek", "companyRating": "3.8", "companyInfo": {"Website": "www.bkf.com", "Headquarters": "Redwood City, CA", "Size": "201 to 500 employees", "Founded": " 1915", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "110000", "jobDescription": "ENR 2017 California's Design Firm of the Year  We are hiring in our Redwood City or Walnut Creek offices! Depending on your location and commute we can accommodate either office. KEY RESPONSIBILITIES The Survey Project Manager is the daily contact point with clients representatives and/or in-house Engineering Project Managers. The Survey Project Manager is responsible for the performance of all aspects of the firms services for the projects assigned. This position provides all the necessary direction, supervision, coordination and follow-up on the work to ensure quality standards are met, efficiency levels are maintained and the clients satisfaction, respect and confidence are assured. PRIMARY DUTIESDefines the project scope, prepares written proposals with the survey group Director or Principal-in-charge (PlC), plans, prepares and gives the oral presentation of the firms technical qualifications and approach to the project.With the Director or PlC prepares the schedule, establishes a budget, prepares a written work plan and organizes the execution of the project. Schedules and chairs project progress and review meetings.Monitors project progress to assure the quality of work performed, timeliness of action, compliance with contract requirements and control of job charges against approved budgets.Maintains periodic contact with Director, PlC, and client to communicate progress, resolve problems and assure client satisfaction with the work.Prepares written monthly progress reports for client, Director, and PlC.Prepares monthly billing and reviews with Director or PlC prior to submitting to client.Controls and directs the project to a satisfactory completion. Reviews all communications plans maps or other information prior to submittal to client.Prepares a project report at the end of the project and submits it to the Director or PlC who will review and file it in the Project Report File. Plans work schedules, conducts performance reviews and provides input for performance reviews by survey group Director and PlC.Identifies all extra work and changes in scope of service or contract terms and processes necessary extra work authorizations prior to performing work.Attends technical and management seminars, workshops and professional conferences to expand knowledge and skills in the technical and management aspects of the position.With Office Survey Supervisor ensures that the project is following office standards and procedures. Assist with the training of existing and new staff on appropriate activities to promote staff growth and proficiency.POSITION REQUIREMENTSPLS required10 years experience strongly preferredThis is a high level management positionEducation/Registration: B.S. Degree in Surveying and Mapping or Civil Engineering. Registration as a California Professional Land Surveyor or pre-1982 Professional Civil Engineer is required for this position.Experience: At least eight years of surveying experience at a professional level including at least two years experience in responsible charge of field survey work. Without a B.S., ten years professional experience is required. Experience must show progressively increasing level of responsibility, especially on large, complex, and/or difficult projects.Skills/Job Knowledge: Should demonstrate a thorough knowledge and show experience in all phases of land surveying including the following: legal principles of boundary determinations, sectionalized land subdivisions, California state plane coordinate system, California statutes regulating the practice of land surveying and the subdivision of land, control and geodetic surveys, aerial photogrammetric surveys, construction staking (subdivisions, municipal improvements, heavy construction, buildings, transportation projects, etc.), survey accuracies and precisions, uses and capabilities and adjustments of modern surveying instruments, and the use of office computer and data collecting electronic surveying instruments. Must have a knowledge of contract management, project management theories, project scheduling and reporting, proposal writing, budget control, communications and human resources management including a positive management style, well developed leadership skills, and respect by peers, clients, consultants, and subordinates.Ability to work on and manage a variety of tasks simultaneously.Ability to make formal presentations to company management, clients, and public agencies.Experience coordinating technical efforts of others, especially on significant projects (long duration, large dollar value, and/or technically complex).Level of Supervision: The Survey Project Manager reports to the survey group Director, Principal-in­-Charge, and Office Manager with respect to quality of services, schedule of staff assigned, maintenance of standards and financial status of projects. The Project Managers overall performance is reviewed by the survey group director, PlC, and firms clients.BENEFITS BKF offers an excellent compensation and benefits package that includes; competitive salaries, bonuses, profit sharing, pension plans, and 401k, as well as, premium medical, dental, and vision plans. BKF also offers life insurance, long-term disability, gym reimbursement, flexible schedules, free coffee, tea, fruit, bagels and oatmeal. Company sponsored sports teams and clubs. Annual Company Picnic at Six Flags with free admission for employees and their families, Holiday Casino Party Luncheon and Holiday Dinner Celebration. Employees also have access to BKFs corporate condo in Lake Tahoe! What makes BKF a great choice?ENR 2017 California's Design Firm of the YearBKF is on the \"Top 100 Hottest firms\" list\"Top Work Place 2013, 2014, 2015, 2016 and 2017 by the Bay Area News GroupZweigWhite 2014, 2015, 2016, and 2017 \"Best Firms To Work For\" Top 100 in the U.S.\"Best Firm to Work for North Bay\" North Bay Business Journal, 7 years in a rowThe chance to work on iconic Bay Area projectsCompetitive salary and performance bonusesProfessional development trainingCompany funded retirement planComprehensive benefits package BKF Engineers provides engineering, surveying, and land planning services for architects, commercial and residential developers, colleges and universities, cities and counties, governmental agencies, hotels, health care facilities, and large corporations. Headquartered in the San Francisco Bay Area since 1915, the firm has 13 California offices employing 400+ staff. Our project experience includes corporate headquarters, office buildings, healthcare facilities, sports facilities, hotels and resorts, justice, public buildings, multi-family housing, educational facilities, retail, industrial, parking, highways, roadways, bridges, and light/heavy rail transit projects.  Redwood City. San Jose . San Francisco . Walnut Creek . Pleasanton . Sacramento . Santa Rosa . Richmond . San Rafael . Oakland . Newport Beach . Lathrop . Salinas"}