{"jobID": "1925849930", "jobLocation": "San_Francisco_CA", "jobTitle": "Lead/Senior Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.shift.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "165000", "jobDescription": "Shift is bringing transparency and trust to the used car industry. Data is core to this transformation, from building best-in-class pricing, to loan decisioning, to logistics optimization, to in-product recommendations. If you’re passionate about using data to fix an enormous, antiquated industry, you’ll fit right in.The DataMillions of cars are bought and sold in the US every year, but knowing exactly how much your car is worth is a challenge. We believe that fixing the used car industry requires providing customers with fair, detailed pricing reports in beautiful, easy-to-understand interfaces. By combining as much data as we can get our hands on, from the millions of listings available online, to car auction sales, to every vehicle’s specific repair history, we’re building the most accurate, transparent pricing tool in the industry.The ImpactAs a two-sided marketplace, serving both car buyers and sellers, our vehicle data and pricing models are core to the business. As the first data scientist at Shift, you’ll have a direct, immediate impact on the success of the company. Initial projects will include exploring data, building models, informing product decisions, overseeing experiments, and collaborating closely with engineers on our pricing team. Over time, you’ll play a crucial role in growing and mentoring a team of data scientists that will be involved in nearly every initiative at Shift, including lending, fraud, lead scoring, user acquisition, optimal resource allocation, vehicle routing, and more!The TeamWe are a friendly, helpful community of engineers with a diverse background of experience. We espouse autonomy, trust, and learning from each other. The engineering team is excited to have grown to the capacity to support our first full-time data scientist. We believe that embedding data science into our engineering team provides a unique opportunity for significant autonomy and influence fully supported by the engineering resources you need.Responsibilities As our first data scientist, you’ll lead the design of our data architecture, with support from our engineering teamBuild and own our pricing models in collaboration with the engineering and business teamsGuide our data acquisition strategy and prioritiesSuggest, run, and analyze experiments across the companyHelp develop and mentor a team of data scientistsRequirements Knowledge of machine learning techniques, especially intuition for their benefits and drawbacks in real-world applications Experience wrangling data to explore new model features, build visualizations, and clean data3+ years of experience working as a data scientist and experience working with multiple data architectures in productionProficiency in a statistical computing language (such as R or Python) and SQL.Strong knowledge of statistics and experimental designCuriosity, desire to learn, passion for providing a great product to customersExperience mentoring other data scientists, as well as excitement at being an individual contributor to start(Nice to have, but not required) Production engineering experience. If you have engineering experience, that’s great, and basic coding skills are a must, but you’ll also be strongly supported by engineering for the heavy lifting, code-wise.EXTERNAL REFERRAL BONUS!We offer a generous referral bonus for your assistance in helping us find great engineers. You must know the engineer you are recommending, and they should not be someone we’re already talking to. We may also ask you to help court them if needed. Please send your referrals to builders@shift.com and a member of our team will follow up with you!ABOUT USShift is a San Francisco-based startup that is transforming the buying, selling, and servicing of used cars into a technology-driven, hassle-free experience. With Shift, one of our friendly car enthusiasts will work as your personal concierge from start to finish, whether it’s bringing a test drive to your door or providing an instant appraisal for the car you want to sell. All of our cars pass a rigorous inspection and come with a seven day money-back guarantee. Financing is also provided on most vehicles. Basically, we save you money, time, and the aggravation of working with a used car dealer.WHY US?We’re a team of ex-Google and ex-Dropbox leaders with demonstrated ability to successfully build teams and create game-changing products. We’re backed by leading Silicon Valley investors and poised for enormous growth this year."}