{"jobID": "2816758621", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.axs.com", "Headquarters": "Los Angeles, CA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Arts, Entertainment & Recreation", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "111000", "jobDescription": " We are looking for a Data Scientist that will guide data science process and help us discover the information hidden in vast amounts of data. This person will collaborate on data engineering efforts to access, transform, model, and store data to be used across the company, dive into exploratory data analysis to find insights and drive strategy, and develop predictive models that directly impact our products and strategy.  This position will work with our product, leadership and marketing teams. Its primary focus will be in applying data mining techniques, building high-quality prediction systems integrated with our products, automating scoring using machine learning techniques, building recommendation systems, and applying models to real-time data streams.  The ideal candidate is adept at using large data sets to find opportunities for product and process optimization and using models to test the effectiveness of different courses of action. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms and creating/running simulations. ResponsibilitiesSelecting features, building and optimizing classifiers using machine learning techniquesData mining using state-of-the-art methodsEnhancing data collection procedures to include information that is relevant for building analytic systemsProcessing, cleansing, and verifying the integrity of data used for analysisPerforming ad-hoc analysis and clearly communicating resultsCreating automated anomaly detection systems and constant tracking of their performanceIdentify opportunities for extending companys data with third-party sources of information when neededGuiding data science strategySkills and QualificationsExcellent understanding of machine learning techniques and algorithms, such as k-NN, Naive Bayes, SVM, Decision Forests, etc.Experience with common data science toolkits, such as Scala, Python, Numpy, Pandas, SciKit-Learn or similar. Excellence in at least one of these is highly desirableProficiency in using query languages such as SQL, SparkSQL, etc.Experience in AWS ecosystemGreat communication skillsGood applied statistics skills, such as distributions, statistical testing, regression, etc.Good programming and scripting skills in Java, Python, Scala or similarData-oriented personalityNice to haveExperience with Redshift Experience with Streaming data technologies such as Kinesis and KafkaExperience with distributed data/computing tools: Spark, Map/Reduce, Hadoop.Deep Learning understanding using some of the latest technologies (TensorFlow, PyTorch, Keras)Experience with data visualization tools such as Mode Analytics, D3.js, GGplot, Looker, etc."}