{"jobID": "2829870012", "jobLocation": "Culver_City_CA", "jobTitle": "Graduate IT TV Business Analysis Intern Fall 2018 - Entertainment and Media Industry Opportunity", "companyRating": null, "companyInfo": {"Website": "www.sonypictures.com", "Headquarters": "Culver City, CA", "Size": "1001 to 5000 employees", "Founded": " 1982", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Universal Studios, Warner Bros., Disney Studios"}, "estimatedSalary": null, "jobDescription": " Graduate IT TV BRM Business Analysis Intern, CORP Fall 2018Sony Pictures Entertainment requires an Intern in the TV IT Business Relationship Management (BRM) department to support our TV Networks Business. TV Networks is a very dynamic and international environment that is growing and evolving at a very fast pace in the Digital Age. This position will report directly to the Executive Director of IT who supports the Digital Media/ Networks and AdSales, Finance, Business Affairs lines of business for Sony Pictures Entertainment.  The internship will offer a high exposure to the business processes covering:  Content Acquisition/ Production and Exploitation (Digital and Non-Digital)  Financial lifecycles (AdSales, Finance & Accounting, FP&A;, Biz Dev)  System integrations  The Intern will have the opportunity to acquire understanding of the core business processes and how these are modeled/supported by the TV Networks application landscape (AdSales, Linear and Non-Linear Program Scheduling, Rights, Finance, Planning, CRM, etc).  The intern will be part of the Business Relationship Management (BRM) team and be introduce to the day-to-day operations, support and requirement gathering, testing and delivery phases. In addition, the intern will have visibility into project lifecycle, and project management best practices and from inception to deployment, including the planning phases of the business case and cost-benefit analysis. RESPONSIBILITIES: Support the PM and Senior BAs in the collection, review, analysis and documentation of user and technical requirements  Participate in the documentation of detailed functional & data business requirements, process flows, use cases, & information needs  Participate in the production of operational and strategic reporting which provides value to the business and facilitate strategic decisions  Support in the creation of test cases  Execute and document test cases  Support the PM and Sr. Bas with the deployment and post deployment tasks QUALIFICATIONS: Currently enrolled in an accredited college/university for the duration of the internship and able to work part time  MIS, Computer Science or Equivalent education  Good understanding of data models (databases, relationships, primary keys, data quality)  Natural ability for teamwork  Passionate and motivated to always improve and learn new concepts SPE INTERN PROGRAM DETAILS: The Sony Pictures Entertainment Internship program offers a unique opportunity to work alongside the teams that come together to create movies, TV shows, and other great experiences. These seasonal paid assignments provide meaningful and productive work that allow you to build your resume, experience and develop your skills further. You will be provided with challenging tasks, real-world experience, valuable networking opportunities, and many educational and social opportunities while on the lot.  This Fall internship is from Tuesday, September 11th through December 14thbut is flexible with start date based on school schedule. All candidates must be able to work between 10-29 hours and be currently enrolled in a college or university. Sony Pictures Entertainment is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, national origin, disability, veteran status, age, sexual orientation, gender identity, or other protected characteristics. Sony Pictures - CA - Culver City Area & Studios"}