{"jobID": "2524417709", "jobLocation": "Palo_Alto_CA", "jobTitle": "Administrative Assistant", "companyRating": "3.7", "companyInfo": {"Website": "www.firstrepublic.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 1985", "Type": " Company - Public (FRC) ", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Silicon Valley Bank, City National Bank (Texas)"}, "estimatedSalary": "54000", "jobDescription": " OverviewFirst Republic is an ultra-high-touch bank that provides extraordinary client service. We believe that one-on-one interactions build lasting relationships. We move quickly to serve our clients’ needs so that their financial transactions are handled with ease and efficiency. Client trust and security are paramount in our line of business. Ultimately, our goal is unsurpassed client satisfaction which will lead to personal referrals – our number one source of new business.  We recognize that our competitive advantage starts with our people and our culture. At First Republic, we work hard and move quickly as a very coordinated team. If you are looking for an opportunity to grow and contribute in a fun, fast-paced environment, First Republic is the place for you. We have exceptional people focused on providing extraordinary service.  The Assistant to the Wealth Manager in First Republic Investment Management is responsible for optimizing efficiency through effective administrative support including, but not limited to, interacting with clients, prospects and employees and answering telephones, scheduling meetings and appointments, making travel arrangements, preparing correspondence and handling special projects as assigned.Responsibilities Schedule appointments and maintain calendar for Regional Managing Directors, including making travel and hotel arrangementsHandle incoming phone calls and mailCoordinate and set up meetings, gathering and preparing agenda/materials and arranging logistics (conference room, bridge line, Pictel) and taking minutesPrepare memos, letters and other documents and reports for internal and external distributionCopy, file/organize and distribute various reports and documentsSubmit expense reports, sponsorship requests, and check requisitionsCreate and maintain client and prospect address lists for marketing mailings and various other mailersMake catering arrangements for team and client meetings as requestedOrder office and marketing supplies and create marketing packagesInterface directly with all levels of external clients and prospects as well as internal team membersLead and manage special projects as they arise on behalf of the Regional Managing DirectorProvide input and suggestions for process improvementsStay in touch with all facets of the company and identifies potential issues to the Regional Managing Director before they escalateAssist with the recruiting and integration of new hiresPerform duties and responsibilities specific to department functions & activitiesPerform other duties and responsibilities as required or assigned by supervisorAttend meetings when necessaryMaintain a flexible work schedule QualificationsPREFERRED SKILLS, KNOWLEDGE AND ABILITIES:Excellent written and verbal communication skills, exceptional customer service orientation, and ability to pay close attention to detail and accuracyStrong organizational skillsAdept at Microsoft Office applicationsAbility to independently translate conceptual direction into succinct communicationsHard-working, willing to work extra hours as necessary, and able to thrive in a fast paced environmentAbility to navigate organizational infrastructure to solve or resolve problemsCollege degree and strong understanding of banking and lending are requiredMENTAL/PHYSICAL REQUIREMENTS:Vision must be sufficient to read data reports, manuals and computer screens.Hearing must be sufficient to understand a conversation at a normal volume, including telephone calls and in personSpeech must be coherent to clearly convey or exchange information, including the giving and receiving of assignments and/or directionsPosition involves sitting most of the time, but may involve walking or standing for brief periods of time.Must be able to travel in a limited capacity"}