{"jobID": "2821552422", "jobLocation": "San_Jose_CA", "jobTitle": "Hair Stylist", "companyRating": null, "companyInfo": {"Website": "www.hairclub.com", "Headquarters": "Boca Raton, FL", "Size": "501 to 1000 employees", "Founded": " 1976", "Type": " Subsidiary or Business Segment", "Industry": " Consumer Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Why Us: We're Hiring & We Want You! Imagine a place where you can make a difference every day, LOVE WHAT YOU DO, and make a great living doing it. You just found it, Hair Club Has It All!  Hair Club has been the leading provider of hair loss solutions across North America for over 40 years. We pride ourselves in making a difference in the lives of our clients every day. And not only do we help thousands of men and woman restore their hair and transform their lives, we also contribute to the community through our charitable organization and volunteer programs. Become part of Hair Club's success-oriented and passionate company today!  Your Role as a Hair Stylist for Hair Club:  Express your passion for people and customer service by providing the ultimate client experience (\"UCE\"). Showcase your hair cutting, coloring, styling skills and talents. Work with a team of professionals to transform our clients dream of restoring their hair and changing their lives. Ideal Candidate Qualifications: Current active cosmetology license in the state in which you are applying.  Skilled at analyzing, consulting and educating clients regarding hair care and hair care products.  Persuasive selling techniques to educate and encourage clients.  Honest and ethical to preserve strong client and team relationships.  Demonstrate strong technical skills with a passion and devotion for your art.  Works independently and adapts well to change and business needs.  Willing to continuously improve and an eagerness to learn new skills and techniques.  Strong active listening skills.  Bilingual (English/ Spanish) a plus. Great Perks: Attractive work hours: Tuesday through Saturday, with Sundays and Mondays off. Closed most major holidays.  Receive the best benefits in the industry, including;  Paid time off  Full Comprehensive Benefits: Medical, Dental, Life insurance  Participation in 401(k) plan  Tuition reimbursement  Full Company paid training and excellent opportunities for growth and advancement.  Complete training in Hair Club's non-surgical hair restoration techniques.  Hair Club is an Equal Opportunity Employer"}