{"jobID": "2767351058", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.castlighthealth.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2008", "Type": " Company - Public (CSLT) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "89000", "jobDescription": "About the Team Castlight’s Strategic Analytics team has a wide scope of work, and is responsible for managing incoming claims data, administrating BI tools and producing custom outbound files. This role is specifically within the custom outbound file production group. On a daily basis, you will work with Customer Success Managers and members of the team to spec new files, deliver existing files and ensure adherence to existing standards. Custom outbound files are a core component of the Wellbeing platform, delivering HRA/HSA contributions, premium reductions and cash contributions to our users. This Data Analyst will report directly to the Director of Strategic Analytics. Responsibilities:Manage process, coordination and scheduling of outbound customer filesProvide support to vendors/clients with specific questions they may haveReport issues or delays with file delivery to internal/external clientsTroubleshoot and identify issues with ETL data, file formats and jobsPerform data quality checks and report to internal/external clientsMaintain documentation of ETL process and support procedures for each clientWork with client to make minor changes in data file layoutsRequired Skills:Strong SQL (MySQL, POSTGRES) skills, ability to write complex queriesStrong ability to communicate effectively verbally, in writing, and fluentlyStrong ability to provide a high level of problem solving and technical troubleshootingAbility to work independently to meet objectivesStrong ability to actively collaborate with other support teams for problem resolutionMaintain and secure sensitive/confidential information (PHI)Ability to multi-task and prioritize workloadR and/or Python familiarity preferred"}