{"jobID": "2564417693", "jobLocation": "Brooklyn_NY", "jobTitle": "Account Executive (Benefits)", "companyRating": null, "companyInfo": {"Website": "www.hubinternational.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Account Executive (Benefits)  Provide full service account management to clients in the Employee Benefit Department. Manages accounts for all health and welfare plans including medical, dental, short and long term disability, vision, life/AD&D;, travel accident, voluntary benefits and long term care. They can be groups of two (2) or more Core Responsibilities Day to day contact for client Develop strong relationships Resolve claims and administrative issues Act as liaison with insurance carriers and as an advocate for clients Design benefit plan in conjunction with client needs and financial resources Process renewals, including competitive bidding, providing cost effective plan design alternatives and employee contribution scenarios Prepare spreadsheets and renewal presentations as appropriate Prepare summary plan descriptions and other employee communication materials Provide client with periodic financial reports (monthly, quarterly, or annually, as provided by insurer) to assess plans performance and as a tool for renewal planning Coordinate timely delivery of Schedule A information for 5500 preparation, as appropriate Maintain & manage client information through HUBs Agency Management System & data standards Typical Additional Responsibilities Coordinate health fairs and wellness initiatives when requested by client Prepare claim utilization analysis on self funded and large fully insured clients, as appropriate Secure stop-loss coverage for self insured clients, as appropriate College degree or equivalent work experience Minimum of 5 years experience in brokerage, consulting, insurance company, or corporate benefits environment Excellent analytical & problem-solving skills Excellent verbal and written communications skills Excellent interpersonal skills Computer literate in Word, Excel and PowerPoint Highly detail-oriented Ability to multi-task Location: United States, New York, Brooklyn Required Education: Bachelor's degree (4-year degree) Required Experience: 2-5 years Required Travel: Up to 25% Date published: 1-Sep-2016 Department: Account Management & Service Job Type: Full-time Ref#: AvaR9_19000101  HUB International Limited is an equal opportunity and affirmative action employer that does not discriminate on the basis of race/ethnicity, national origin, religion, age, color, sex, sexual orientation, gender identity, disability or veteran's status, or any other characteristic protected by local, state or federal laws, rules or regulations. The EEO is the Law poster and its supplement is available here at http://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm .  We endeavor to make this website accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact the US Recruiting Team toll-free at (844) 300-9193 or USRecruiting@hubinternational.com . This contact information is for accommodation requests only; do not use this contact information to inquire about the status of applications."}