{"jobID": "2745288513", "jobLocation": "San_Jose_CA", "jobTitle": "Job Coach", "companyRating": "2.9", "companyInfo": {"Website": "www.optionsforall.org", "Headquarters": "San Diego, CA", "Size": "201 to 500 employees", "Founded": " 1985", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "32000", "jobDescription": "POSITION SUMMARY Job Coaches provide job-site-based support, supervision and instruction to participants with intellectual & physical disabilities. ESSENTIAL FUNCTIONSProvide vocational support, supervision, motivation and instruction to participants at job sites.Ensure that participants receive evaluations from employers.Collect and record data during participant job site visits.Report Social Security wages, as required.Meet independent employment site dress code and work quality requirement standards.Capture all authorized and assigned program hours.Complete and submit billing support information.Diffuse crisis situations and provide crisis intervention, as necessary.Conduct monthly safety drills with participants.Maintain the health and safety of program participants.Complete all required documentation and reports.Effectively relay issues and concerns to the Program Manager.Maintain participant files and records.Record participant progress toward achievement of goals and objectives.Ensure that the participants? work and training schedules are followed and documented.Engage actively with participants at worksites.Attend all required meetings and in-services.Complete all required training.Support fundraising activities of the organization.Comply with all Employment & Community Options policies and procedures.Conserve company resources.Other duties, as assigned.EducationHigh School Diploma, equivalent or GED.Bachelor’s Degree in Human Services or related area (preferred).ExperienceDirect (hands-on) experience with individuals with a wide range of intellectual & physical disabilities, including persons with the most severe challenges (preferred).Experience in community-based instruction in critical life needs areas (preferred).Experience in assisting individuals in the use of adaptive devices and communication aids (preferred).Required SkillsAbility to communicate effectively both orally and in writing.Professional English writing ability, including usage, grammar, spelling, punctuation and vocabulary.Other RequirementsImmediate access to a vehicle with working seat belts, valid driver’s license, current auto insurance and acceptable DMV record.Ability to travel within and throughout the assigned program area in which services are provided.Ability to travel in and throughout the county on a quarterly basis to attend meetings, trainings, etc.Successful completion of drug screen and background check.CPR/First Aid Certification (preferred).PHYSICAL DEMANDS & WORK ENVIRONMENT This position requires the employee to regularly stand, walk, sit, talk and hear. They must be capable of writing, using a computer keyboard, telephone and related office equipment. Ability to lift 25lbs. required.  The physical demands are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  This position is community-based, which means the majority of the employee’s time will be spent in the community. In the community, the employee may experience varied environments depending on work assignments. Exposure to blood borne pathogens could occur when administering first aid to participants. Hepatitis B vaccines are offered at no cost to each employee."}