{"jobID": "2823636207", "jobLocation": "San_Jose_CA", "jobTitle": "Early Intervention Specialist Mentor (BILINGUAL - SPANISH)", "companyRating": null, "companyInfo": {"Website": "www.younginterventions.com", "Headquarters": "Corona, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Young Interventions, Inc. is hiring for a Bilingual Spanish Speaking Early Intervention Specialist Mentor - Field Supervisor, in Santa Clara County San Jose & surrounding areas. If you are interested in being part of an organization whose mission is a commitment to improving the quality of life for infants and toddlers with or at risk of developing developmental disabilities, then Young Interventions is for you. We are looking for qualified, motivated, energetic and creative professionals, to work with children in the family homes to help implement personalized family focused treatment programs. Young Interventions, Inc. Programs focus on a Parent Coaching Model to guide the family in helping their child reach their developmental milestones.  Field Supervisors provide Early Intervention services for developmentally delayed infants & toddlers during home visits, provide developmental assessments, develop reports based on standardized assessment results, create routines based goals and curriculum planning, as well as supervise a small staff of Early Intervention Specialists. This position is a full-time salaried position with benefits offered. This position will require you to drive to various home sites within Santa Clara County. These areas may include San Jose, Milpitas, Santa Clara, Mountain View, Sunnyvale, Gilroy, Morgan Hill, Hollister and surrounding areas. Please visit our website to learn more about the services we provide to children & families: www.younginterventionsinc.com Requirements:Bachelors Degree or higher required (Child Development or related field)Solid knowledge of basic stages of Infant / Toddler Child DevelopmentMinimum of 3-years experience working with children 0-5 yearsExperience working with Children with Special Needs is preferredProficient in Microsoft Office SuiteDemonstrate knowledge of best practices in Early Intervention: understanding family systems, different diagnosis, intervention strategies, resources, assessments, etc.Excellent oral and written communication skillsPrior Supervisory or Mentor Role is helpful in this positionAbility to speak and read fluently in Spanish is required for this positionALL Candidates MUST:Hold a valid Driver's LicenseHave reliable transportation and willingness to travel to various home based sites throughout the day (within 30 mile radius)Maintain current Vehicle Insurance & RegistrationMaintain current CPR Certification (Infant, Child & Adult)Compensation: An industry competitive salary is determined based on applicant's level of education and experience. Company Perks:Flexible scheduleComprehensive Benefits Package (including 401K w/ company match)Paid Vacation & Sick TimeMileage compensationCompany LaptopCell Phone StipendPaid TrainingOngoing Reflective Supervision Qualified & interested professionals should submit a cover letter & resume for immediate consideration."}