{"jobID": "2813054061", "jobLocation": "New_York_NY", "jobTitle": "Sales Development Representative", "companyRating": null, "companyInfo": {"Website": "www.adjust.com", "Headquarters": "Berlin, Germany", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "We are seeking a proactive Sales Development Representative for our successful and growing US market. In this role, you will focus on connecting with prospects across phone, email, social and in-person and create sales opportunities based on mutual business fit, research and consultative discussion. You will have a strong partnership with your Regional Sales Manager to find, collaborate and sell into strategic accounts with a career development goal to become a Sales Manager in 2 years.In this role you will focus on:Mastering proactive, strategic outbound as a lead channelWorking with top tier mobile companiesResearching prospects and understanding their business use case to have constructive conversations with themMatching our product offering with clients’ needs After an extensive onboarding training period in Berlin, Germany, you will have a broad understanding of the Adjust product as well as the mobile ecosystem we are operating in (publishers, advertisers, app developers etc.). You will create high quality SQLs working closely together with Inbound Marketing team, handling and qualifying inbound leads, and with a sales team qualifying and prospecting outbound leads. Your success and performance at Adjust will be based on your ability to respond quickly to inbound requests, hitting your MQL targets, opening strategic accounts through outbound, and general product and sales savviness.Being hard working, precise and persistent as well as having a “go-getter” mentality and endless willingness to learn will be essential to become a great Sales Development Representative.Do you thrive on directly contributing to Sales and are ready to join the mobile app analytics ecosystem? Then let’s get in touch and talk about this great opportunity in detail!"}