{"jobID": "2817713403", "jobLocation": "Boston_MA", "jobTitle": "Offering Manager Intern", "companyRating": null, "companyInfo": {"Website": "www.ibm.com", "Headquarters": "Armonk, NY", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Public (IBM) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Accenture, Microsoft"}, "estimatedSalary": null, "jobDescription": "Job Description IBM Hybrid Cloud Analytics is hiring an Offering Manager Intern for our Austin, Texas or San Jose, California locations. Offering management is a cross functional role that involves interactions with development, marketing, sales, design, support and other groups. Its like being a quarterback on a football team. IBM Private Cloud for Data is a new product announced recently by our CEO and General Manager at IBM's annual conference, THINK. This product is unique as it cuts across our entire Analytics portfolio representing approximately $6 billion of revenue. It is a great opportunity for someone who is ambitious and looking for exposure to Data and Analytics software business.  This role offers you the opportunity to work with Offering Managers, Development, finance, sales, marketing and design. Your responsibilities will include: Synthesize primary research on users, competitors, ecosystem participants, partners to support offering strategyDevelop business models supporting outcomes, pricing and packaging approach etc.Validate market requirements with customers and prospects and translate requirements into offering roadmapCollaborate with other disciplines to project manage offering roadmapWork effectively with other Units; Engage with clients, sellers, partners, market stakeholders to solicit feedbackBuild effective presentations, summarize findings, etc. If you are passionate about Analytics, Big Data, Data Science and Machine Learning, then this is the role for you! The ideal candidate will be a hardworking, pro-active team player with excellent communication skills.  Required Technical and Professional Expertise Expertise in essential technical domainsExpertise in relevant industry and/or functional domain Preferred Tech and Prof Experience  None.  EO Statement  IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status. "}