{"jobID": "2803051678", "jobLocation": "Braintree_MA", "jobTitle": "Commercial Audio Video Installation and Service Technician", "companyRating": null, "companyInfo": {"Website": "www.prosoundservice.com", "Headquarters": "Braintree, MA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Pro Sound Service Specializes in Design, Sales, Installation and Maintenance of Commercial Audio and Video systems. This is not an A/V Production or set-up job. The ideal candidate will have 2-5 yrs. experience in a Commercial Pro or Residential A /V environment as an installer / technician. We will however consider less experienced candidates who possess the core skills and aptitude needed for the position and are willing to learn. This position requires knowledge of: We will provide training on: This is a field installer’s position at customer’s jobsite's performing installations and service, it is not a \"desk job\". This is a perfect position for an experienced Electrical installer or Electricians helper with Pro Audio and Video knowledge. Former Military Electrical or Electronics techs would also be ideally suited for this position.  This position requires extenstive ladder work and some heavy lifting at times. Strong organizational skills and attention to detail as well as a neat appearance and strong work ethic are required. This position requires experience with mechanical and electrical installation methods as well as Audio and Video systems set up and troubleshooting. If you don’t possess those skills you won’t be suited for the job. Reliable transportation and a clean driving record are required.  We offer excellent starting salary and a generous benefits package which includes Medical insurance plan 100% company paid HMO (single person plan), Dental, life insurance, Long term disability as well as generous vacation and sick time allowances. This is a full time permanent position 40 hours wk, M-F with occasional overtime as required.  Our hope is to find an exceptionally qualified person who can grow with the company and expand this position We are looking for a mature person with a great work ethic who is not easily flustered and can \"take the ball and run with it\". Pro Sound Service respects the service that our nation’s Military Veterans provide and strongly encourages Veterans to apply for any of our employment opportunities.  Please reply with a complete resume including salary history/ requirements as either a word document or PDF with your name in the file title field to Sales@ProSoundService.com. Salary negotiable depending on qualifications. Pro Sound Service Inc. is an Equal Employment Opportunity Employer. House of WorshipSchoolsPerformance, Sports and Recreation facilitiesRestaurants – HospitalityEntertainment VenuesCorporate ClientsElectrical and mechanical installation methods and codes including wire and cable installation, pulling and termination/ testing.Mechanical installation including rigging, and equipment mounting both on the ground and in the air. Various control systems. Extensive ladder work is involved in this job.Audio and Video Signal flow and troubleshooting.Pro Audio/ Video installation and distribution methods.Current state of the art Pro Audio gear and DSP processing including BSS Soundweb, Harman HI-Q net, Smart & various digital consoles.High end Pro Audio gear including Loudspeaker arrays, intelligent amplifiers/ DSP devices."}