{"jobID": "2796996722", "jobLocation": "Oakland_CA", "jobTitle": "Financial Analyst & Performance Manager I", "companyRating": "3.9", "companyInfo": {"Website": "www.kaiserpermanente.org", "Headquarters": "Oakland, CA", "Size": "10000+ employees", "Founded": " 1945", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " HCA Healthcare, Dignity Health, Sutter Health"}, "estimatedSalary": "92000", "jobDescription": " Develops long-range objectives and strategic plans for NCAL region by identifying internal and external strategic issues that could affect growth and profitability. Provide coordination with subject matter experts on scanning environment for business opportunities maintains surveillance on health care market and perform financial analysis, budget oversight and forecasting. Develops and monitors profitability, productivity, and growth targets. Provides decision support and business cases on proposals, recommend financial and non financial strategic objectives and alternatives, and implement and maintain strategic and operational plans. Acts as a liaison with the Service Area, or functional leader, and Regional Planning group. Plans and coordinates business reviews, resource allocations, and financial analysis. Provides ad hoc analytics. Essential Functions: Performance Monitoring - Proactively drive performance within assigned responsibilities including the preparation of the monthly variance analysis and coordination of the Monthly Operating Reviews (including Action Plans to address performance).  Proactively manage coordination of subject matter experts within area of responsibility. - Daily productivity monitoring.  Participate in semi-annual benchmarking.  Budgeting & Forecasting - Coordinate the budget and forecasting process for the assigned Service Area and/or Functional Areas.  Decision Support - Work with assigned Service Area and/or Functional Area on the development of business cases for capital projects, leases and internalizations.  Business Advisor - Prepare adhoc analysis as required by customers.  Work collaboratively with customers within assigned area of responsibility and Regional planning on the development of market plan for the Service Areas.  Serve as advisor/consultant to key customers to help translate financial data into tactics to drive operation efficiency within the organization.  Long Range Planning- Work with Service Areas and/or Functional Area in long term planning including the development of a long range operating margin plan.  Scope of Responsibility- Area Tier 1. Basic Qualifications: Experience  Minimum six (6) years of experience in financial planning analysis in a health care setting environment. Education Bachelor's degree OR four (4) years of experience in a directly related field.  High School Diploma or General Education Development (GED) required.  Licenses, Certifications, Registrations  N/A. Additional Requirements: Must be able to work in a Labor/Management Partnership environment. Preferred Qualifications: MBA preferred.  CPA preferred. "}