{"jobID": "2755009022", "jobLocation": "San_Jose_CA", "jobTitle": "Senior Software Engineer, Cloud", "companyRating": "3.7", "companyInfo": {"Website": "www.xilinx.com", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 1984", "Type": " Company - Public (XLNX) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Qualcomm, Intel Corporation, AMD"}, "estimatedSalary": "115000", "jobDescription": "DescriptionXilinx is the leading provider of All Programmable FPGAs, SoCs, MPSoCs and 3DICs. Xilinx's all-programmable devices are designed into tens of thousands of products that improve the quality of the everyday lives of billions of people worldwide. For over 30 years, Xilinx has been behind some of the greatest advancements in technology and science - from the industry's first fabless semiconductor model to the NASA Curiosity Mars Rover, to today's autonomous vehicles and hyperscale data centers. Xilinx uniquely enables applications that are both software-defined, yet hardware optimized - enabling smart, connected and differentiated applications across technology's biggest megatrends, including Machine Learning, 5G Wireless, Embedded Vision, Industrial IoT and Cloud Computing and more.If you are a passionate, innovative and an out-of-the-box thinker that enjoys challenging projects, Xilinx is the right place for you. Our global team is growing and we are looking for bold, collaborative, and creative people to help deliver groundbreaking technologies that enable our customers to differentiate. Come do your best work and live your best life through collaboration, wellness and giving back to your community as a member of the ONEXILINX team.SummaryWe are looking for highly motivated software engineer to join the Xilinx Reconfigurable Acceleration Cloud development team. This team is responsible for developing cloud services for FPGAs using SDAccel and to support datacenter customers using Xilinx FPGA accelerators in their cloud infrastructures.As a Software Engineer, you work on a small team who sees the future of where cloud computing is headed and want to be at the forefront of a new era of computing. We need our engineers to be versatile and passionate to handle new problems as we continue to push cloud acceleration forward. You will quickly ramp up as a subject matter expert for the Xilinx Reconfigurable Acceleration Cloud and become the go-to person for designing Xilinx cloud-based solutions. You will apply your expertise of cloud computing stack, broad software technologies, and open source tools to resolve difficult and unsolved FPGA cloud platform challenges for our customers.Responsibilities:Write server side code for Xilinx Cloud Platform based applications, create robust high-volume production applications, and develop prototypes quickly."}