{"jobID": "2799457550", "jobLocation": "Bellevue_WA", "jobTitle": "Data Scientist, Contract", "companyRating": "3.0", "companyInfo": {"Website": "www.intellectualventures.com", "Headquarters": "Bellevue, WA", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "130000", "jobDescription": " Global Good is a collaborative effort between Bill Gates and Intellectual Ventures (IV) to tackle humanity's toughest problems through invention, focusing on developing countries. We work with governments, NGOs, and commercial partners around the world to conceive, develop, and deploy inventions that save lives.  Youll be partnering with key personnel at Global Good and work closely with creative world-class business professionals, scientists and inventors at IV and the IV Lab to bring our ideas through innovation and into reality.  The Renewable Energy group seeks a Data Scientist who will be responsible for creating a new set of statistical models, related to renewable energy, which will provide decision support for future energy grid design, operation, and facility siting. The focused data may include wind, solar, grid demand, weather, demographic indicators, planned and existing energy generation facility locations, and energy storage. ResponsibilitiesMine and analyze data from renewable energy study databases to drive optimization and improvement of renewable energy integration strategies.Work with research scientists and research software engineers to understand the requirements for source data, appropriate techniques for validating intermediate results, and apply advanced statistical and data mining techniques on renewable energy related datasets.Work with the team to conduct comprehensive renewable energy integration research and perform simulation studies.Work with external research institutes and universities to understand their data sets and data visualization.Specify, design, and implement software for data access APIs and data visualization tools with high quality in accordance with given requirements and chosen design.Build data processing tools in Python to support electric grid simulation.Collect, analyze and process data to inform the modeling effort.Run model sensitivity analysis to determine the impact of uncertain data sets.Assist in production of reports and presentation. Qualifications and Skills Masters degree in Data Science, Computer Engineering, Statistics, Applied Math, or a similar field of study and 3+ years of software development.3+ years of expert capability reading and writing code in Python2+ using statistical packages and standard libraries in R, Python, Maltab, etc., to manipulate data and draw insights from large data sets.Must have knowledge of advanced statistical and data mining techniques and concepts (regression, properties of distributions, statistical tests and proper usage, Random Forest, Boosting, Trees, text mining, etc.) and experience with applications.Must have knowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks.Must have data engineering and analysis experience.Must have strong analytical skills and research skills.Must be a clear and effective communicator.Must be comfortable in a startup working environment.Experience with large geospatial data processing and visualization highly desired.Experience with database programming and multiple database (SQL Server, PostgreSQL) servers highly desired.Strong scientific computer modeling background highly desired.Knowledge of renewable energy and electric grid modeling is strongly preferred.Experience with Mathmatica and C/C++ experience a plus. We are an equal opportunity employer."}