{"jobID": "2826671634", "jobLocation": "Oakland_CA", "jobTitle": "Data Analyst III (Administrative Support)", "companyRating": "3.3", "companyInfo": {"Website": "www.mvminc.com", "Headquarters": "Ashburn, VA", "Size": "Unknown", "Founded": " 1979", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "90000", "jobDescription": " TITLE: Data Analyst III/Administrative Support  LOCATION: Oakland, CA  DURATION: Full time  Job Summary:  The Administrative/Data Entry Support Specialist has experience in handling a wide range of administrative and support-related tasks and should be able to work independently with little or no supervision. The ideal candidate must be extremely well-organized and detail oriented, and has a positive disposition and \\\"can-do\\\" approach. This position will support a Federal Law Enforcement client in Oakland, CA. Therefore, a high level of professionalism and confidentiality is crucial in this role, as well as a commitment to superior service. Essential Functions and Responsibilities:Provide day-to-day administrative support (filing, copying, answering incoming calls, assisting with mailings, etc.) to senior level staff at customer sitePerforms other duties as assignedAssist with weekly, monthly, quarterly excel reportsMinimum Qualifications and Skills:High School DiplomaMinimum of two (2) years of demonstrated experienceProficient in Microsoft OfficePreferred Qualifications:Good organizational skillsAnalytical and problem solving skillsApplicants selected may be subjected to a Government background investigation and may be required to meet the following conditions of employment:A Favorable credit check for all cleared positionsMust be a U.S. CitizenSuccessfully passing a background investigation MVM offers a competitive benefits package, and fosters a highly skilled, energized and empowered workforce.  Due to the high volume of applications received, the Recruiting Department will contact you directly, should you be selected to advance in our recruitment process.For more information about the company please visit our website at www.mvminc.com"}