{"jobID": "2745258719", "jobLocation": "New_York_NY", "jobTitle": "Strategic Account Executive", "companyRating": null, "companyInfo": {"Website": "www.zendesk.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2007", "Type": " Company - Public (ZEN) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Freshdesk, RightNow Technologies"}, "estimatedSalary": null, "jobDescription": "Zendesk is looking for a Strategic Account Executive in (New York) who is responsible for customer adoption, retention, and growth within a territory. We need an experienced sales person who has a consultative sales approach, a successful track record growing and on-boarding clients with polished presentation skills.This individual will be ultimately responsible for their success within their territory, ensuring incremental growth in monthly recurring revenue, new logo acquisition and customer retention, whilst providing the best sales experience possible for our customers.Responsibilities Develop and manage relationships within accounts in your territoryExceed monthly / quarterly sales targets by driving new opportunities and selling Zendesk products into existing accountsGenerate short-term results whilst maintaining a long-term perspective to maximize overall revenue generationWork with multiple Account Executives assigned to your territory to prioritize opportunities and apply appropriate resourcesDemonstrate / sell value to key stakeholders within the accounts during complex sales cyclesExceed activity, pipeline, and revenue goals on a quarterly basisTrack all opportunity and customer details including use case, purchase time frames, next steps, and forecasting in SalesforcePartner with customer success to ensure high satisfaction within your accountsRequirementsBachelors degreeExperience selling to VP and C level executives10+ years of software selling experience; SaaS experience preferredTrack record of success selling into mid-market and enterprise companiesConsistent track record of success with 6 figure dealsExperience managing and closing complex sales-cycles using solution selling techniquesTrack record of over-achieving quota (top 10% in your company)Strong interpersonal and presentation skillsExceptional verbal and written communication skills.Team-selling experience a plusWillingness to travel#LI-AF1The best customer experiences are built with Zendesk. Zendesks powerful and flexible customer service and engagement platform scales to meet the needs of any business, from startups and small businesses to growth companies and enterprises. Zendesk serves businesses across a multitude of industries, with more than 125,000 paid customer accounts offering service and support in more than 30 languages. Headquartered in San Francisco, Zendesk operates worldwide with 15 offices in North America, Europe, Asia, Australia, and South America. Learn more at www.zendesk.com.Interested in knowing what we do in the community? Check out the Zendesk Neighbor Foundation to learn more about how we engage with, and provide support to, our local communities.Individuals seeking employment at Zendesk are considered without regards to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, or sexual orientation.By submitting your application, you agree that Zendesk may collect your personal data for recruiting, global organization planning, and related purposes. Zendesk's Candidate Privacy Notice explains what personal information Zendesk may process, where Zendesk may process your personal information, its purposes for processing your personal information, and the rights you can exercise over Zendesks use of your personal information."}