{"jobID": "2761881039", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.zendrive.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Imagine a world where smartphones are used to make roads safer and where driving is more relaxed thanks to the use of big data and data science. Think about how the insurance industry could drastically change and become more efficient if there were better ways in which to assess risky drivers.As one of FastCompany's Most Innovative companies of 2018 and San Francisco's best places to work in 2017, Zendrive is executing its mission of making all roads safer.At Zendrive, we get excited by challenges that touch billions of people. We constantly challenge the status quo and keep asking how things can be done in new and better ways. When it comes to execution, we are tenacious and never give up. At the most difficult of times, perseverance and determination are driving forces in realizing our vision.If you are inspired by pulling insights from huge, complex data sets, and if you are passionate about transportation and about leaving a meaningful impact on the world, we would like to hear from you.Responsibilities As a senior data scientist, you will develop the next generation of our algorithms to model driving behaviors at a personalized level for various purposes. You will leverage Zendrives rich datasets (100+ billion driver miles) and employ machine learning and behavioral analytics techniques to create cutting-edge technologies.The impact of your work will have a direct impact on several of Zendrives lines of business. You will work closely with product, insurance team, development group, etc., to take your algorithms/models to scalable realization.You know how to balance sophistication with simplicity, scientific rigor with pragmatism, and agility with quality. You are expected to go beyond the mere exercise of machine learning and statistical modeling to a deep understanding of explanations behind the patterns/phenomena you discover in our data. Skills and Experience Requirements PhD in Statistics, Applied Math, CS, EE, or other quantitative engineering fields with a focus on machine learning, statistical, and mathematical algorithms5-10 years of experience in statistical modeling and machine learning algorithms for real-world problemsExperience in handling massive datasets and expertise in big data technologiesHands-on experience with statistical analysis and data mining tools (e.g. R and Python, etc.)Ability to balance theory and pragmatics to develop and apply advanced analytics to real-world problemsAbility to work with product managers and engineers to translate requirements into designs that can be implemented into code Bonus Past experience in the insurance industry (risk modeling, underwriting, pricing, etc.) is a plus.Domain knowledge and experience in analyzing driving patterns, traffic safety, and transportation systems is a plus.Experience with Geospatial and temporal data desirableZendrive is an equal opportunity employer and values diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.To all recruitment agencies: Zendrive does not accept unsolicited resumes. Please do not forward resumes to Zendrive employees or any other company location. Zendrive is not responsible for any fees related to unsolicited resumes."}