{"jobID": "2690102390", "jobLocation": "Emeryville_CA", "jobTitle": "Paid Social Media Specialist", "companyRating": "4.3", "companyInfo": {"Website": "www.justmedia.com", "Headquarters": "Emeryville, CA", "Size": "51 to 200 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "47000", "jobDescription": " DescriptionIn the ever-changing landscape of digital media advertising, paid social media is the front-runner of this evolution. In the past year, we’ve seen Facebook launch engagement retargeting capabilities, LinkedIn build Lead Generation ad units, Snap Inc. launch a self-serve advertising tool and Instagram start experimenting with paid ads within Stories. In the wake of all this, brands and businesses need guidance on how to effectively run a paid social media campaign. Enter, the Paid Social Media Specialist.  The Paid Social Media Specialist will be responsible for understanding the intricacies and best practices for paid advertising on Facebook, Twitter, LinkedIn, Instagram YouTube and Pinterest. He/She will build, launch, optimize and report on paid social media campaigns for a variety of different clients in both B2B and B2C sectors. Additionally, he/she will have the motivation to expand their knowledge into the broader scope of digital media advertising technology and strategy. POSITION REQUIREMENTSBachelor’s Degree, preferably in Marketing or Advertising; or equivalent work experience  Proficient in MS Office, particularly Excel, PowerPoint and Outlook1+ years of experience in online advertising, specifically with paid socialKnowledge and understanding of paid vs. organic social media strategyExceptional organization and communication skillsHighly motivated with a strong desire to meet or exceed expectationsExceptional attention to detail and the ability to meet aggressive deadlinesUnderstanding of integrated marketing communications and the digital media landscapeA good sense of humorThe Following Skills are a Huge Plus (Not required)Facebook Power Editor ExperiencePaid advertising experience in LinkedIn, Twitter, YouTube and PinterestAdobe Analytics and/or Google Ad Words ExperienceAd Serving ExperiencePrimary ResponsibilitiesOrganizing and launching paid campaigns in Facebook, Instagram, Twitter, LinkedIn, YouTube and other social platformsSet up and organize tracking links for social campaignsWorking with Data Team to ensure all tagging and ad serving is properly executedCoordinating with Media team regarding accounts as neededCampaign monitoring and optimization based on KPIsWeekly and Bi-weekly reporting on campaign performanceServe as point of contact to clients for anything social related on reporting calls, recommendations and day-to-day collaborationConstantly stay on top of platform improvements and new offerings in the social media spaceAssist in social media strategy creationShadow senior specialists and managers at in-person client meetings Apply"}