{"jobID": "2697694396", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist - New Grad", "companyRating": "3.3", "companyInfo": {"Website": "www.yelp.com", "Headquarters": "San Francisco, CA", "Size": "5001 to 10000 employees", "Founded": " 2004", "Type": " Company - Public (YELP) ", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Google"}, "estimatedSalary": "125000", "jobDescription": "At Yelp, we see our 148 million reviews not only as a great source of information about the best salted caramel ice cream in San Francisco, but also as a vast storehouse of data. You will help us use that data to connect our users with great local businesses. You will work tightly with the Product and Engineering teams to answer questions ranging from who is more likely to like a flavor of ice cream to which experimental features move the needle. In this role you’ll be tackling a variety of projects ranging from design and analysis of A/B tests to data-driven blog posts. As your role grows you’ll identify new analyses, scope new data-driven products and help us define new metrics.If you’re passionate about asking and answering questions in large datasets and you are able to communicate that passion to product and engineering teams, we want to hear from you!We Are Looking For: Minimum BA/BS degree in Statistics, Math, Physics, Computer Science or related quantitative disciplineEndless ideas about how to leverage Yelp's unique data setExperience with analytical and quantitative problem solvingFluency with analysis tool(s) such as Pandas or RFamiliarity with at least one scripting language such as PythonFamiliarity with relational databases and SQLComfortable working in a Unix environmentExperience with MapReduce, Hadoop, Hive or similar systems is a plusSpecific interest in search engines, recommendation systems, or social networksIf you have 2+ years of industry experience in a quantitative role, please apply here.What You Will Do:"}