{"jobID": "2798873028", "jobLocation": "Santa_Clara_CA", "jobTitle": "Digital Lending Specialist", "companyRating": null, "companyInfo": {"Website": "www.keypointcu.com", "Headquarters": "Santa Clara, CA", "Size": "51 to 200 employees", "Founded": " 1979", "Type": " Nonprofit Organization", "Industry": " Finance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " To provide excellence in member service and experience, as a part of KeyPoint Credit Union?s Digital Lending Team. To include working closely with members whom apply for loan products and services through KeyPoint?s digital channel and acting as liaison with other team members, as a driving agent to facilitate the loan closings in accordance with the digital teams commitment to superior service level agreements. To assist management in identifying service level challenges from a system and procedural standpoint and be an advocate for change in improving the digital member experience.  Accurate and timely processing of all incoming applications in accordance with KeyPoint?s Retail Loan Policies and all applicable regulatory compliance requirements, leveraging all technology resources available (e.g. live chat, Docusign, email, document upload portal, LOS, etc.). To effectively communicate in a consistent and highly professional manner, with a strong attention to detail in accordance with the Digital Teams commitment to superior member service.  The Digital Lending Specialist will provide loan processing, sales, service and technology support for loan applications received through the Digital Channel. Additional duties as assigned, which may include but are not limited to any of the following: Responsibilities:Primary communication contact and support between assigned Member?s and the various departments and individuals of the company throughout the process of the loan, including but not limited to Loan Officer, Branch Staff, Funding, Account Operations, Member Support, IT, Call Center, etc.Assist members with loan application and product selection as necessary (which includes but is not limited to the set-up of the loan file, establishing membership, rate/price quotes, review of program benefits, reviewing loan decision with member, follow up for stipulations, SLA pipeline management, running credit reports as applicable based upon loan type, LOS system and current procedures, issuing instant approve/instant issue credit cards, assist with setting up Apple Pay, Direct Deposit, etc.).Monitor online application activity and incoming communications and stipulations for assigned pipeline.Obtain necessary stipulations from members and effectively manage the pipeline to have all conditions cleared within established turn-times based upon loan type.Process and follow up on all vendor orders.Assist departmental support staff as assigned by management and when necessary.Perform other related duties as assigned.Physical Requirements: (Including lifting, sitting, walking, bending, reaching and squatting % of time in each function) Work environment: indoor office  Work position: standing 15%, walking 15 %, and sitting 70%. Minimal lifting ~30lbs. and some carrying, bending, reaching, kneeling/squatting and climbing stairs/ladders.  Excellent command of written and verbal skills. High School diploma or equivalent. Two years’ experience in a high touch customer service excellent oriented role within a financial institution is desirable, however, is not required. Passing of all computer based tutorials required by KeyPoint CU. Obtain and maintain all applicable licensing required to process all loan types offered by KeyPoint Credit Union."}