{"jobID": "2645520002", "jobLocation": "Boston_MA", "jobTitle": "Entomology", "companyRating": null, "companyInfo": {"Website": "www.navy.com", "Headquarters": "San Diego, CA", "Size": "1001 to 5000 employees", "Founded": " 1775", "Type": " Government", "Industry": " Government", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " \"About This JobNavy Entomologists fill a variety of research, support and training positions worldwide. They plan, direct and participate in operational, consultative, training, quarantine and research programs for infestation prevention and arthropod pest control.Navy Entomologists may be called upon to: Assess and reduce disease risk using innovative surveillance and control techniques  Develop and implement comprehensive disease- and pest-control programs Provide professional consultation and guidance for contingency, disaster relief or humanitarian operations Conduct research on vector-borne diseases, including the physiology, bionomics and taxonomy of medically important arthropods Provide instruction to civilian and military personnel  Assist in the development and/or evaluation of pesticides, equipment and techniquesNavy Health Care Specialists may serve at any one of more than 250 Navy and medical facilities around the globe, from Hawaii to Japan, Germany to Guam, and Washington, D.C., to Washington state.As a Navy Entomologist, you could work at one of the highly acclaimed National Naval Medical Centers in Bethesda, Md.; Portsmouth, Va.; and San Diego, Calif. Or you could provide support to pilots and air crews aboard one of two dedicated hospital ships: the USNS Comfort and USNS Mercy.Still more health-care opportunities are available stateside and abroad in a variety of settings. Conducting research at any one of dozens of Navy hospitals located around the world. On board a surface ship. Or even with the Fleet Marine Force.Upon graduation from graduate school, those pursuing an Entomologist position are required to attend Officer Development School (ODS) in Newport, R.I. ODS is a 5-week program that provides a comprehensive and intense introduction to the responsibilities of Navy Staff Corps Officers. Here they learn about the military structure of the U.S. Navy, its rich history of traditions and customs, leadership development and military etiquette.Promotion opportunities are regularly available but competitive and based on performance.\""}