{"jobID": "2652624002", "jobLocation": "Cambridge_MA", "jobTitle": "Data Scientist - Cancer Dependency Map", "companyRating": "4.1", "companyInfo": {"Website": "www.broadinstitute.org", "Headquarters": "Cambridge, MA", "Size": "501 to 1000 employees", "Founded": " 2004", "Type": " Nonprofit Organization", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "99000", "jobDescription": "Job Description The comprehensive analysis of cancer genomes is nearly complete, but leveraging this wealth of information to improve patient outcomes remains an elusive goal. Now, a critical task in cancer research is to predict those genes and proteins that are essential to the survival of a variety of tumor subtypes. Identifying these essential genes would pave the way for developing therapeutics against specific molecular targets, and would highlight specific patient populations likely to respond to such targeted interventions. We are launching a new initiative to find vulnerabilities of cancers dependent on a well-credentialed therapeutic target for which no effective therapy exists, and to discover small molecules that may target these vulnerabilities. As part of this effort, we seek a highly motivated and talented individual with a strong computational background to join the Cancer Data Science team.  You will collaborate with scientists and engineers in a collegial work environment characterized by informality and intellectual rigor. You will work with a team that facilitates constructive exchange and builds broad knowledge from the diverse expertise of its members. By applying your computational and modeling skills to multimodal cancer data, you will drive the generation and testing of hypotheses that may lead to new therapeutic approaches and insights in biology. The Broad Institute provides a vibrant research environment with close links to top academic institutions across the Boston area and provides the potential for your contributions to be used and recognized worldwide. CHARACTERISTIC DUTIES Design and execute data analysis strategies to support research projects involving multimodal cancer datasets. Develop new methodologies for predictive modeling of high-dimensional genomic data. Explore novel data representation modes with emphasis on integrating diverse data types. Conceive, implement and test statistical models; work with wet-lab researchers to translate these models into testable experiments; analyze data from experiments. Present results to a broad range of non-computational staff. Prepare written reports and presentations for internal use and publication. REQUIREMENTSA PhD in Computer Science, Engineering, Math, Statistics, Physics, or a related quantitative discipline (or equivalent experience) Fast learner, analytical thinker, creative, \\\"hands-on\\\", team-player. Strong background in statistics and applied machine learning.Experience in mathematical modeling of real-world data is preferred.Proficiency in at least one modern programming language.Experience with a scientific programming environment, such as R or Matlab, is preferred. Strong communication skills and an ability to apply those skills effectively across disciplines.Knowledge of cancer genomics is a plus but is NOT required.An inclination to acquire such knowledge is imperative. EOE / Minorities / Females / Protected Veterans / Disabilities EEO is The Law - click here for more informationEqual Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}