{"jobID": "2814728547", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.joinhomebase.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Our mission is to make hourly work easier for local businesses and their employees. As former hourly workers ourselves, we get the struggles teams face and build our products with empathy to banish paperwork and time consuming daily tasks (like scheduling, timesheet management, or team messaging). Today, more than 60,000 local businesses rely on our collective data and expertise to better control the hours in their week and the dollars in their pocket. We are in the early stages of what we will accomplish as a company, and we are just getting started. The team brings local business expertise from Intuit, Square, OpenTable, Yelp, and First Data. Based in San Francisco and Houston, Homebase is backed by leading venture investors Baseline Ventures, Cowboy Ventures, and Khosla Ventures. At Homebase, the Data Scientist will work with the product and business teams to understand our users and give recommendations that shape the direction of our product and company. You will join our growing Data team and help shape our data thinking as we grow. A successful candidate will have a deep understanding of data science overall, be bilingual in both “business” and “data”, and will always be proactive in surfacing opportunities for the Marketing and Product teams. You will be responsible for analyzing our data, making recommendations, and coming up with long-term projects that will help us identify key areas of opportunity for the business. You will guide us to the best decisions for our users, including analyzing user engagement, measuring the results of feature deployments and marketing, and generating new user insights. What You’ll Be DoingUnderstand the process of decision optimization, data analysis, as well as analytical and operational partners' workCreate pipelines (data processing, data analysis, optimization, implementation) for automated strategy developmentCollaborate closely with analytical and operational partners in creating and maintaining tools to reduce their repeated manual effort, and improve decision quality and process efficiencyCommunicate efficiently and frequently with partners to gather requests and feedback, then quick adopt these requests and feedback into products your are buildingInterest and ability in learning new techniques and research on how to apply them into daily work QualificationsBA degree (MS is a plus) in Computer Science, Computer Engineering, Electric Engineering, Mathematics or equivalent practical experience2+ years of Data Scientist experience required.Experience with data manipulation and analysis tools (SQL, Python, R or similar languages)Familiar with typical data mining and machine learning algorithms such as linear regression, decision tree, logistic regression, and clustering's representation and implementationEffective communication skills What We Can Offer YouA chance to be one of the first Data Scientists in a quickly growing, data-driven company backed by leading investorsAwesome data-minded co-workers with deep knowledge of and passion for our spaceThe freedom to explore projects that you think will drive the most value for our businessThe opportunity to solve real-world problems for millions of local businesses and hourly employeesPlease note: relocation is NOT offered for this role If this sounds like you, we’d love to talk. You’ll be a core member of the Homebase team as we build a great company. You’ll make life better for millions of people, and be rewarded for the great work you do.Homebase is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, ethnicity, color, national origin, religion, sex, protected veteran status, or disability."}