{"jobID": "2729850140", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst", "companyRating": "2.7", "companyInfo": {"Website": "www.intelliprogroup.com", "Headquarters": "Santa Clara, CA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "102000", "jobDescription": "Project Overview Wear OS is the company's wearables software platform. Wear OS smartwatches help you get more out of your time. Fitness tracking, messaging, help from you Assistant and more all from the convenience of your wrist. Job Description As a Data Specialist, you will have the opportunity to support foundational research about what people are doing in the world, so that the company can develop products most aligned with those activities. We are looking for people who have experience with text processing, diary studies, programming, are diligent, and have excellent communication and problem-solving skills. The position is a contract role for a duration of 6 months, and can be extended depending on performance and need. Overall Responsibilities- Work with others to identify text data and groups of that text relevant to products- Process the text data with software to identify groups- Analyze the quality of incoming data- Manipulate data so that it is cleaned, organized, and easily accessible to collaborators- Analyze qualitative and quantitative data, including statistical analysis- Assist with creating reports (including graphs, slides, etc)- Communicate findings from data to the research leadTop 3 Daily Responsibilities:- Analyse quantitative data- Perform statistical analysis- Answer quantitative research questionsRequired Skills/Qualifications- B.A./B.S. (completed) or M.A/M.S. (in progress or completed) in Computer Science, data science, Software Engineering, human-computer interaction, statistics; or in lieu or degree, related work experience- 2+ Years of work experience analyzing data- Experience analyzing data in spreadsheets- Familiar with a range of statistical analysis methods- Detail-oriented and ability to work fairly independently on a variety of tasks- Can prioritize time between multiple projects, and be flexible by adapting to changing schedules and different projects- Experience programming machine learning and data processing, with preference to: python, Go, RNice to Haves- Experience with human subjects research- Experience in a programming language commonly used for data manipulation and computational statistics (such as Python, R, Matlab, C++, Java, Go, or SQL)"}