{"jobID": "2819045187", "jobLocation": "Santa_Monica_CA", "jobTitle": "Intern, Information Technology (IT) - Enterprise Data & Analytics - Entertainment and Media Industry Opportunity", "companyRating": "3.5", "companyInfo": {"Website": "www.lionsgate.com", "Headquarters": "Santa Monica, CA", "Size": "1001 to 5000 employees", "Founded": " 1997", "Type": " Company - Public (LGF) ", "Industry": " Media", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "48000", "jobDescription": " Position SummaryInformation Technology (IT) - Enterprise Data & Analytics:The Information Technology, Enterprise Data & Analytics intern will have the opportunity to foster real world experience in a fast paced, exciting, groundbreaking environment. This intern will support efforts related to business intelligence, data science, data governance, SQL, R & Tableau, SAP BW and BOBJ. The intern will be trained in analytics tools, which might include Tableau server 9.0, big data technologies, SAP BI and key performance indicators, metrics and reporting for the media & entertainment industry. Preferred candidates will be working towards a Masters degree in computer science or engineering, will have had exposure to modern analysis tools and techniques, and have a natural interest in architecting solutions to support promotion of Lionsgate films and television products.  Internship Details  Lionsgate Internship Program Fall 2018  Santa Monica, CA / September 17 December 14, 2018 / 20 hours per week maximum  LIONSGATE is the leading independent filmed entertainment studio with a strong and diversified presence in motion pictures, television programming, home entertainment, family entertainment, video-on-demand and digital distribution of content.  The Lionsgate Internship Program is designed to provide interested students with a hands-on experience in the entertainment industry.  Please read the following information carefully before submitting an application. Important Dates: The Lionsgate Fall 2018 Internship program dates are: September 17 December 14, 2018  The last day to apply is Friday, July 13, 2018 at 1PM PST. Applications received after this date will not be considered.  All interns are required to attend orientation on either Monday, September 17, 2018 OR Tuesday, September 18, 2018. Details: All internships are located in Santa Monica, CA, unless otherwise stated. Interns must provide their own housing and transportation.  Interns can work a minimum of 10 hours/week and up to a maximum of 20 hours/week.  All internships are paid.  Interns must be current sophomores through recent grads (within 6 months of internship start date). To Apply: All candidates must submit a cover letter, resume and completed application questions. Click on your preferred area(s) of interest to begin the process. Applications that do not contain a cover letter and resume will be considered incomplete. Incomplete applications will not be considered.  The Lionsgate Internship Program offers internship opportunities in many departments. All candidates applying should keep in mind that they may be considered for departments not listed."}