{"jobID": "2767424275", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Services and Integration Developer", "companyRating": null, "companyInfo": {"Website": "www.blueshieldca.com", "Headquarters": "San Francisco, CA", "Size": "5001 to 10000 employees", "Founded": " 1939", "Type": " Nonprofit Organization", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Overview: A Senior Developer of Services and Integration, you will be responsible for developing complex technology solutions. Responsibilities include designing and developing service based integration solutions.  Reports to Senior Manager of Services and Integration. This position is located in our San Francisco, CA headquarters. Responsibilities: This person must have demonstrated ability to lead design and development activities on concurrent complex projects with multi-source, on and offshore teams. Provide technical leadership in designing and implementing large scale, complex enterprise applications requiring high performance and availability. Be able to synthesize complex data/information, and lead complex technical implementations on plan. Ability to matrix manage/organize others with the IT organization in order to get work done quickly. Experience in a large, complex organization or corporate structure environment required. Responsible for design and development of Integration and services aspects of Facets applications area.Responsible for unit testing the deliverables to ensure quality of the deliverablesWork with the stake holders to gather functional and non-functional requirementsWork with project managers to provide estimates and timelinesResponsible for establishing best practices in services development, integration of applications and govern detailed designs generated by the vendorsDemonstrate leadership skills on services development, services adoption and service governance.Evaluate and review design frameworks and methodologies and approves design in order to achieve functional and non-functional requirements and conformance to the architectureWork effectively with service vendors and IT service functions to ensure superior service (meeting or exceeding SLAs) delivery for all application core technologies and support services.Proactively addresses potential system issues to meet or exceed established timelines and delivers service within budget constraints and seeks ways to reduce application related costs.Qualifications:Five or more years’ experience in developing enterprise services and application integrations(REST, Web services and IBM Pure Apps)Five or more years’ experience in either WebSphere Integration products (MQ, ESB, DataPower, SOA, WTX, WODM) or equivalent ESB products (Mule, JBOSS etc) or Java Web services (J2EE, EJB, JAX-WS, Spring, Hibernate, SOAP, JSON) stackExperience in implementing enterprise level turnkey software packagesVery strong technical skills with at least 5 to 7 years hands-on design, coding, integration and deployment experience in enterprise applicationsExtensive experience in Java, J2EE, JDBC, JAX-WS,JAX-RS, Spring, REST, XML, SOAP, JMS, XSLT, MQ and OracleExperience with iterative development life cycle methodologies and application of those principles, especially Agile development practicesStrong knowledge of design patterns and API Modelling language like Swagger, YAMLStrong understanding of SOA, API and Micro Services principles and implementationDemonstrated ability managing projects with tight timelines in a matrixed organizationStrong ability to analyze business requirements and transform into technical design and system solutionsDemonstrated experience working with vendor partnersAble to effectively communicate status, design and approach with management/business sponsors/product managersFamiliar with standard software development tools, including source version control, defect tracking, documentation, and testing systems.Self-directed, works with limited management direction and exercise considerable latitude in determining technical objectives of assignment.Ability to build strong relationships and drive alignment on difficult topicsBachelor or Master Degree in Computer Science, Electronic Engineering or equivalent experience.Additional Skills (add bullets if needed):Experience in FACETS is preferredHealthcare industry experience is preferredNice to have Alexa experienceAt least five years of experience in technology consulting and enterprise level software implementation preferred"}