{"jobID": "2670498788", "jobLocation": "San_Francisco_CA", "jobTitle": "Software Intern", "companyRating": null, "companyInfo": {"Website": "www.whistle.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Consumer Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Whistle was born out of our love for pets. As the worlds first technology company dedicated to helping pets live longer and happier lives, we build solutions for common problems faced by pet parents everywhere. Whether a pet is an escape artist, an avid adventurer or a happy couch potato, Whistle provides information and insights to help ensure both pets and their people stay healthy and happy for years to come.  Our current market-leading products include a cellular-enabled GPS tracker and a WiFi & Bluetooth-enabled activity monitor. We do all design and development in-house, from PCB design to embedded software, data analytics to mobile apps. Our pack thrives on solving hard problems in nimble teams.  Backed by the largest petcare company in the world, Whistle is positioned for growth as we continue to evolve our product offerings and add to our very dynamic team. If you believe you have what it takes to work in a highly independent, fast-paced environment where teamwork is critical and flexibility is a must, then Whistle might be the place for you.  Our Software Intern will work side-by-side with our Mobile and Rails teams to develop new features in the areas of: Design & Data Visualization: work with designers and product management to implement a pixel perfect UI and UX.Reliability: develop a robust platform for staging, testing and deploying our code in a fast and automated fashion.Data Storage and Transfer: work with our firmware team to create a fail proof system to transfer & store device data, deploy firmware updates and manage devices in the field.Machine Learning & Signal Processing: research and develop methods for processing our data to gain useful insights that can be presented to users.Requirements:Available for 3 months of full-time work during summer 2018Pursuing degree in Computer Science, Electrical Engineering, Math or related technical field, graduating between April - December 2019.Expertise in Python, Ruby, JavaScript, HTTP, HTML/DOM, and/or CSS.Strong understanding of network protocols and database design."}