{"jobID": "2645523684", "jobLocation": "Boston_MA", "jobTitle": "Surface Warfare Officer (Nuke)", "companyRating": null, "companyInfo": {"Website": "www.navy.com", "Headquarters": "San Diego, CA", "Size": "1001 to 5000 employees", "Founded": " 1775", "Type": " Government", "Industry": " Government", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " \"About This JobNothing projects naval power and capability more dramatically and instantaneously than the U.S. Navys Fleet of nuclear aircraft carriers. Surface Warfare Officers (SWOs) with advanced nuclear training oversee the propulsion systems and personnel aboard these multibillion-dollar, megaton cities at sea.Because of their potential to carry so much of the Navys capabilities forward, aircraft carriers are at the core of ongoing missions. Nuclear Surface Warfare Officers ensure that Sailors in their division maintain and operate the ships complex systems safely and efficiently.Surface Warfare Officers form the backbone of Fleet leadership. In this role you could serve as Commanding Officer over an elite crew and be an authority in every aspect of your Navy assignments. Doing any or all of the following: Directing personnel operations aboard Navy vessels, especially aircraft carriers Managing shipboard vertical launch systems Using computer displays and advanced technology in battle and ship defense Providing support to Navy expeditionary forces, Theater Air Missile operations, anti-submarine warfare, surface-to-air warfare, and support and supply missionsNuclear Surface Warfare Officers are exposed to a variety of different work environments from academic settings to training on prototype units to sea tours and shore assignments. The time spent on conventional ships and nuclear-powered aircraft carriers involve deployments of a few to several months at a time. Once fully qualified, members may go on to hold positions that involve instructing, advising, consulting, recruiting or even commanding surface ships.\""}