{"jobID": "2809132157", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.unity.pl", "Headquarters": "Wroclaw, Poland", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Data Scientist San Francisco, Full-time  The Data Scientist will be a key contributor to the Analytics Data Science team, which supports multiple Analytics product teams. This person will be harnessing massive amounts of data to help create a more personalized gaming experience for each user. You will work with product teams to develop and implement decision-making algorithms. You'll not only be responsible for writing production code, but doing in depth statistical analyses and presenting results to product leads. The ideal candidate will need to be able to effectively communicate technical concepts across multiple teams and needs to be able to think creatively and to be able to test out new ideas and iterate rapidly. RequirementsMS/PhD in Data Science, Analytics, Statistics, Computer Science or other quantitative discipline2+ years experienceSpark (PySpark/Scala), PythonExperience implementing algorithms (preferably in real-time environment)Deep understanding of statistical concepts and applying themExperience with big data Bonus Points Implementation of deep learning algorithm(s) (TensorFlow, PyTorch)Reinforcement learning Who We Are // About Unity  Unity is the creator of the world's most widely-used real-time 3D (RT3D) development platform, providing content creators around the world with the tools they need to build rich, interactive 2D, 3D, VR and AR experiences. In fact, apps made with Unity reach 2.7 billion devices worldwide, and were installed more than 24 billion times in the last 12 months.  The global engineering team keeps Unity at the forefront of technology and working alongside partners like Magic Leap, Google, Facebook, Oculus and Microsoft ensures optimized support for the latest technology and platforms. Unity is powering the real-time revolution, expanding beyond games and breaking into other industries including automotive, film, architecture, engineering, construction and more.  Unity is an equal opportunity employer committed to fostering an inclusive, innovative environment with the best employees. Therefore, we provide employment opportunities without regard to age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, or any other protected status in accordance with applicable law. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know.  Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.  Headhunters and recruitment agencies may not submit resumes/CVs through this Web site or directly to managers. Unity does not accept unsolicited headhunter and agency resumes. Unity will not pay fees to any third-party agency or company that does not have a signed agreement with Unity.  Job details  Location  San Francisco  Department  Engineering  Job type  Full-time  Apply now!  Other positions in Engineering  NoSDL2017"}