{"jobID": "2820650040", "jobLocation": "San_Diego_CA", "jobTitle": "Senior Business Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.nationalfunding.com", "Headquarters": "San Diego, CA", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": "We currently CAN NOT provide visa sponsorship for this position. National Funding is continuing to grow its Analytics Department and has an exciting opportunity for a SeniorBusiness Data Analyst. This high profile role is at the center of innovation for the company and is a major driver and contributor to National Fundings core strategy. This key role provides strategic thought leadership on our overall Credit Strategy, which includes lending decision support, risk analyses, portfolio analyses, and providing recommendations for improving performance. Senior Business Data Analyst Major ResponsibilitiesProvides analytical support and strategic thought partnership to the Credit/Operations teamAble to tell stories with the data, communicate effectively and instill confidence in recommendations to motivate stakeholders to take actionBuilds recommendations by synthesizing data from multiple sources, developing assumptions where needed, to drive business insights and improvements in our predictive capabilitiesCompletes analytics projects requiring collaboration with business stakeholders, including implementation and deployment of real-time solutions with the technology teamBuilds, validates, and publishes analytics reports and dashboards for the businessDelivers key insights with interpretation and recommendation, contributes to the development of hypotheses and actions, and presents them to the management teamEvaluates third-party data against internal loan performance to determine best practices for utilizing external data to inform smarter credit decisionsDevelops new and better analytics approaches to solve questions in a creative wayThe Ideal Candidate3-7 years of experience in credit risk analytics (preferred) or business analyticsStrong knowledge of SQLStrong analytical and problem solving skillsExperience with Tableau (preferred) or similar BI toolsOutstanding communication skills with both technical and non-technical colleaguesFamiliarity with credit scoring and use of data to inform credit decisionsIdeal candidates will have experience in Finance, Mortgage, or BankingWhy National Funding?Positive, energetic, passionate, business casual environmentFantastic benefits package including medical, dental, vision, life, LTD, FSA, 401(k) with an employer match and PTO.Numerous employee events throughout the year including our annual traditions such as a Day at the Del Mar Racetrack, Del Mar Mud Run, Bring Your Kid to Work Day, Holiday Party, Employee and Family Picnic, sporting events, and more.National Funding is one of the leading providers of short term loans and equipment leasing for small businesses across the United States. In both 2013 and 2014, we were ranked by the San Diego Business Journal as one of the 100 Fastest Growing Private Companies in San Diego and listed on the Inc. 5000 List of Americas Fastest Growing Private Companies. Since 1999, we have been in the forefront of the equipment leasing business, working with businesses in hundreds of communities and industries to expand and upgrade their business equipment. As we have grown, so too has our product line, and now we are one of the countrys largest private lenders of small business loans. Our customers call on us to get working capital, merchant cash advances, credit card processing, and, of course, equipment leasing."}