{"jobID": "2760885942", "jobLocation": "Carson_CA", "jobTitle": "Applied Mathematician - Data Scientist", "companyRating": "3.0", "companyInfo": {"Website": "www.arconic.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1888", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "128000", "jobDescription": "Title Applied Mathematician - Data Scientist  03-May-2018 Job Function Research & Development / Technology Business Unit Group Engineered Products and Solutions Position Description Arconic Fastening Systems is looking for an Applied Mathematician – Data Scientist for our New Product Development Team. This is a unique opportunity to join a multidisciplinary team of creative and passionate individuals changing the face of Aerospace Manufacturing. We are driven by the company’s business strategy and work on high-impact projects in 8 countries across 4 continents utilizing multiscale process engineering, data analytics and machine learning to improve product design and manufacturing processes. The NPD team is a lean, flat team combining analytic methods, material science, product knowledge and experimental science and engineering to identify and inject high-value insights into manufacturing processes at their point of highest impact. The team works in quick iterations, using the combination of physical science-based techniques and algorithms best suited for solving challenging problems. This position is located at our aerospace plant in Carson, CA.  Arconic Fastening Systems (AFS) holds the number one global position in aerospace fastening systems, and we’re the North American leader in commercial transportation fasteners. Our high-tech, multi-material fastening systems are found nose to tail on aircraft and aero engines. Our products are also critical components of industrial gas turbines, automobiles, commercial transportation vehicles, and construction and industrial equipment. Headquartered in Torrance, CA; we employ over 6,000 people in 11 countries at 31 locations. AFS is a business unit of Arconic (NYSE:ARNC).  Join Arconic and join a network of people who are passionate about industry-changing technology that advances the world. You’ll have the opportunity to work with leading global companies that operate in world-changing industries—such as aerospace, automotive, building and construction, defense and commercial transportation. It’s not just a job. It’s a career and a path to the future. You’ll be part of a diverse culture of learning, teaching and mentorship. Arconic is fully committed to developing people: providing employees with the resources, and learning and development opportunities they need to excel and build a career. Key Responsibilities:Advocate, evangelize and build data-driven design and manufacturing processes that drive efficiency.Develop a process design space exploration framework which enables design parameter sensitivities used to inform initial design of electromagnetic induction heating processes, large scale deformation and structural mechanics.Research, design, implement and validate cutting-edge algorithms to analyze diverse sources of data to achieve targeted outcomes.Provide insight into leading analytic practices, design and lead iterative learning and development cycles, and ultimately produce new and creative analytic solutions that will become part of our core deliverables.Construction of isogeometric sensitivity analysis and surrogate models to enable rapid design space exploration.Develop numerical techniques to optimize steady and non-steady forming processes utilizing inverse problem formulation together with evolutionary search schemes.Application of isogeometric analysis to model the elastic deformation and electromagnetic heating of multi-phase metallic materials.Become an expert on our datasets while working with cross-functional team members to identify and prioritize acquisition of new, actionable, high-impact data across a variety of core business and manufacturing processes.Skills:Clear communicator with strong ability to communicate insights in a clear, concise, and valid, data-driven way, so that others in the company can effectively act on those insights.Strong desire for a fast paced, data-driven, collaborative and iterative engineering environment. Strong love of learning, especially complementary physical sciences including Mechanics, Physics and Material Science.Excel at making complex concepts simple and easy to understand by those around you.Passionate about asking and answering questions in large datasets, and able to communicate that passion to product managers, Manufacturing managers and engineers.Keen desire to solve business problems, and live to find patterns and insights within structured and unstructured data.Requisition Number23457BRMinimum Years of Experience3Preferred QualificationsMS or PhD, from an accredited institution, in Applied Mathematics, Operations Research, Industrial Engineering with Mathematics focus, Machine Learning, or Physics, or similar quantitative discipline3+ years of experience delivering computation approach to outcomes solving complex analytical problems using quantitative approaches with your unique blend of analytical, mathematical and engineering skills.Experience in ManufacturingUnderstanding of statistical and predictive modeling concepts, machine-learning approaches, clustering and classification techniques, and recommendation and optimization algorithms.Accomplished in the use of statistical analysis environments such as R, MATLAB, SPSS or SAS.Experience with BI tools such as Tableau or MicroStrategy.Comfortable with relational databases and Hadoop-based data mining open-sources frameworks.Familiar with SQL, Python, Java and C/C++.Experience with isogeometric analysisExperience with optimization of process designPrimary Location CA-Carson Minimum Education Required Masters Minimum Travel Required None Basic QualificationsMaster’s Degree from an accredited InstitutionMinimum 3 years of experience with data analytics.Employees must be legally authorized to work in the United States. Verification of employment eligibility will be required at the time of hire. Visa sponsorship is not available for this position.This position is subject to the International Traffic in Arms Regulations (ITAR) which requires U.S. person status. ITAR defines U.S. person as an U.S. Citizen, U.S. Permanent Resident (i.e. 'Green Card Holder'), Political Asylee, or Refugee.Business Unit Arconic Fastening Systems Job Type Experienced "}