{"jobID": "2751422071", "jobLocation": "New_York_NY", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.alliancebernstein.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1967", "Type": " Company - Public", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Number9564New York, New York USAB is a leading global investment-management and research firm with more than $500 billion in assets under management and a presence in 22 countries, with more than 3,400 employees worldwide. We serve clients ranging from institutions to individuals and private clients, and we offer independent research, portfolio strategy and brokerage-related services tailored to our clients’ unique needs. With forward-looking perspective and expertise in equities, fixed-income, alternatives and multi-asset strategies, more than 500 investment professionals collaborate to share ideas and make connections across disciplines, geographies, asset classes and sectors. These collective insights drive innovation and better solutions, helping us keep our clients AHEAD OF TOMORROW®.C We are looking for both junior and senior level Data Scientists to join our Data Science team. This team is chartered with building data science capabilities across the firm. Projects encompass all aspects of our organization, spanning asset management research, portfolio management, sales / marketing, trading, risk management, and operations. Data Scientists work with the stake-holders at AllianceBernstein to surface challenges and opportunities that can be addressed using data science techniques and to develop solutions around algorithms, tools, and infrastructure that can significantly impact our business. Initiatives include harnessing modern data technology and machine learning modeling techniques to improve investment outcomes and to improve sales productivity and client interactions. The Data Scientists will also work closely with the data scientists, engineers, and other analysts in the Data Science Team, IT professionals in other department of the organization, and participants of the AB Lab.  The qualified candidate should have background in computer science with a strong focus in machine learning and data analysis or other related fields that require heavy use of statistical modeling, machine learning, and data analysis  • A Ph.D. degree in Computer Science, Computer Engineering, Physics, Statistics, or related fields is required Must be proficiency in Python, R, and SQLMust be very well-verse in data wrangling and data analysis of both structured and unstructured dataStrong understanding of and practical experience with a wide-range of machine learning algorithms is a mustGood understanding of and practical experience with statistical modelingProficiency in other programming and scripting languages is a plusExperience working with large structured and unstructured datasets and be well-versed in modern data technologies including the entire Hadoop ecosystem, Spark, and cloud computing platformsWorking knowledge of data engineering is a plusInterested in applying data science to investment management and researchStrong verbal and written communication skills is a must  Our employees typically have track records of outstanding professional performance and academic achievement, excellent analytical and financial skills, and strong verbal communication skills. Candidates should have a strong ability to work in a collaborative environment and to present results to both expert and non-expert audiences.  Data Scientists are responsible for executing on a variety of data science projects with topics ranging from asset management research, sales, and marketing. They will help develop data science capabilities, which include robust, repeatable, and scalable algorithms, and leverage them across the organization. Ultimately, data scientists will help the firm harness modern data technology and data science techniques in making better and faster decisions. Specific responsibilities typically include tasks spanning the entire data science model development cycle. Responsibilities may include, but not limited to:  • Work with stakeholders from business units from across the firm to surface opportunities for data science projectsConvert business questions to questions that can be answered using data science techniques, provided that required data is availableIngest data from both relational SQL and NoSQL databasesClean, wrangle, analyze data to generate preliminary insightsDevelop, evaluate, and test statistical and/or machine learning modelsConvert model results into usable business insightsCreate presentation summarizing modeling methodologies, results, and usable business insightsPresent research summary to various audiences within the firmCreate data and model documentationDevelop and maintain modeling pipeline  We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}