{"jobID": "2807458179", "jobLocation": "Los_Angeles_CA", "jobTitle": "Software Engineer Intern", "companyRating": null, "companyInfo": {"Website": "www.earny.com", "Headquarters": "Los Angeles, CA", "Size": "1 to 50 employees", "Founded": " 2016", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Earny is seeking a highly-motivated individual to participate in our fast-paced paid internship program. Who we are: With one click Earny (www.earny.com) gets you money! Earny is a personal assistant that automatically gets you money back on almost every purchase. Earny uses low-latency price tracking to identify the lowest possible prices, and obtains refunds using credit card price protection.  Every year, online shoppers in the US lose 50 billion dollars in unclaimed money, and weve developed an elegant way of returning that money back to our customers. Our simple customer experience means sophisticated back-end decision-making on their behalf.  Were currently looking for innovative and passionate people, who are eager to make a difference and play a vital role in Earnys growth and success. Responsibilities: The intern will take part of the engineering team and will work closely with the Director of Engineering, as well as with all the different departments of the company.  The desired candidate will be able to build innovative technical projects and work on interesting topics like email parsing, web scraping, natural language processing, machine learning and data intelligence. Minimum Qualifications:Currently in his or her junior or senior year of collegeLive around or will, in the summer, live around Los AngelesFront-End: Swift for ios, Java for android, Angular 2 for the websiteBack-End: Nodejs / Python / PhantomjsCloud infrastructure on Microsoft Azure and Amazon Web ServicesDatabase: SQL Server, NoSQL, Redis.Desired Qualifications:Previous internship experienceTeam player with an assertive natureHigh levels of creativity and quick problem-solving capabilities"}