{"jobID": "2823861442", "jobLocation": "Oakland_CA", "jobTitle": "Transportation Engineering Intern", "companyRating": "3.2", "companyInfo": {"Website": "www.aecom.com", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " 1990", "Type": " Company - Public (ACM) ", "Industry": " Business Services", "Revenue": " $10+ billion (USD) per year", "Competitors": " Bechtel, ABB, Louis Berger"}, "estimatedSalary": "41000", "jobDescription": " Business Line Transportation  Position Title Transportation Engineering Intern  United States of America - California  Oakland  Job Summary  AECOM is actively seeking a highly motivated Transportation Engineering Intern for employment in the Oakland, CA office. AECOM is searching for candidates that have the ability to be a role model, be client-focused, be impactful and be decisive.  Imagine working on rewarding projects within a diverse culture, and having access to exceptional training and career development opportunities. Working at AECOM means being part of a global team, working with award-winning professionals across the world. Aspire to be a key player on some of the best projects regionally, with opportunities to work on projects nationally or internationally. Our people bring deep industry knowledge to help you succeed.  Work in collaborative fashion with the group to help solve project challenges and develop a high quality project deliverables. Efficiently work with the project team in a responsive and diligent manner. Some of the key job responsibilities include the following: Assist in developing set of Contract Plans and ExhibitsHelp the design team on a variety of projects in the transportation realm.Must be able to work effectively in team situations and establish strong relationships with other teamsConstruction support and help to develop response to Contractor Requests for Information and Submittals on transportation and transit projects. Minimum Requirements Currently pursuing Bachelors of Science degree in Civil EngineeringProficient in Autodesk AutoCAD and Microsoft Excel, Word, PowerPoint and ProjectMust be able to work effectively in team situations and establish strong relationships with other teams Preferred Qualifications Basic knowledge of industry standard computer software for the position (examples include software such as of Land Desktop, Civil 3D, InRoads, InSite, and MicroStation)Experience as an internRudimentary knowledge of transportation engineeringKnowledge of relevant computer hardware and software programs, which may include Internet applications and GISAnalytical skills to interpret research data for reports and apply mathematic techniques in practical situationsA university student that has more than one year of school remaining before earning a degree preferred, these students typically are Freshmen, Sophomores, or Juniors in university. Successful Interns may be eligible to return for additional internships. What We Offer  AECOM is a place where you can put your innovative thinking and business skills into high gear and work alongside other highly intelligent and motivated people. It's a place where you can apply your skills to some of the world's most challenging, interesting, and meaningful projects worldwide. It's a place that values the diversity of our areas of practice and our people. It's what makes AECOM a great place to work and grow.  AECOM is an equal opportunity employer and Minorities, Females, Veterans, and Disabled persons are encouraged to apply. For further information, please click here to view the EEO Is The Law poster. NOTICE TO THIRD PARTY AGENCIES: Please note that AECOM does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed Recruitment Fee Agreement, AECOM will not consider or agree to payment of any referral compensation or recruiter fee. In the event a recruiter or agency submits a resume or candidate without a previously signed agreement, AECOM explicitly reserves the right to pursue and hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of AECOM.  Job Category Vacation Student / Internship / Graduate  Business Group Design and Consulting Services Group (DCS)  Country United States of America  Position Status Intern / Student  Requisition/Vacancy No. 189922BR  Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status."}