{"jobID": "2744475030", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.hpe.com", "Headquarters": "Palo Alto, CA", "Size": "10000+ employees", "Founded": " 2015", "Type": " Company - Public (HPE) ", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Oracle, Accenture"}, "estimatedSalary": "118000", "jobDescription": " Hewlett Packard Enterprise (HPE) is an industry leading technology company that enables customers to go further, faster. With the industrys most comprehensive portfolio, spanning the cloud to the data center to workplace applications, our technology and services help customers around the world make IT more efficient, more productive and more secure.  Learning does not only happen through training. Relationships are among the most powerful ways for people to learn and grow, and this is part of our HPE culture. In addition to working alongside talented colleagues, you will have many opportunities to learn through coaching and stretch assignment opportunities. Youll be guided by feedback and support to accelerate your learning and maximize your knowledge. We also have a reverse mentoring program which allows us to share our knowledge and strengths across our multi-generation workforce.  Enterprise Group works to streamline innovation and simplify IT with superior solutions. By combining ESSN (Enterprise Server, Storage and Networking) and Technology Services into one division, we gain a strategic advantage in our focus on Converged Infrastructure. The HPE Enterprise Group supports our customers with the transformation and integration of their technology. We are there for our customers come join us!  At Hewlett Packard Enterprise (HPE), were building the futureone big idea at a time. Ready to unleash your professional potential? Our employees use their experience and scientific knowledge to design, develop, implement, and test hardware, software, systems, and processesand continue our growth as a technology leader. If solving the worlds biggest technology challenges sounds like the right career path for you, read on.  About the Data Scientist Pointnext Data, AI & Emerging Technology Centre of Excellence  HPE Pointnext is looking for highly qualified, experienced and motivated candidates to help build out the data science capability within the services organisation and the Data, AI & Emerging Technology Centre of Excellence.  You will be responsible for assisting in: Driving the strategy around data science-led product solutionsDelivering them to HPEs customers, andInnovating around big data, machine learning, and all forms of artificial intelligence at a global level You will also help drive that knowledge and capabilities into the regional teams for delivery to customers and partners.  No relocation assistance available. Target areas for hire are:  Palo Alto, CA, USA  Singapore  Bangalore, India Responsibilities: You will be responsible for scoping, designing, and developing data-led solutions to form part of the Pointnext Data Science portfolios. You will work alongside other specialist groups within HPE to cover the full spectrum of the technical stack. You will also be targeted charged with developing specific intellectual property for HPE and Pointnext, including the creation of patentable solutions and unique capabilities within the industry.  Your additional duties will include: Liaising with pre-sales and customer-centric teams to qualify demand and opportunities for proposed solutionsBuilding data science-focused solutions in the appropriate technologies to drive the identified outcomesEnsuring the solution is as modular as possible and can be plugged into other solutions in a value chain, leveraging standards where appropriateIdentifying portfolio gaps and opportunities, and evaluating requirements to fill those gapsReviewing existing solutions, and identifying opportunities for improvements and incremental value-add HPE Pointnext: exceptional people supporting business technology in action. Pointnext is made up of talented professionals who bring the technical insight, process excellence, and resource flexibility to help customers drive business outcomes through optimization of their data centers and other technology operations. At Pointnext, we know relationships and people matter--and our people and our services create a powerhouse solution designed to solve our customers' most challenging IT problems.  Qualifications  At HPE, people are our strategic advantage. People with the right mindset, coupled with the right talent, education and experience, will be instrumental to HPE maintaining and extending its prominence in the global IT market.  Talent, education and experience will only take us so far. Having the right mindset means being: Adaptable Takes in stride and constantly attunes to the changing needs of a highly dynamic business.Curious our key contributors are always seeking to grow their knowledge, to gain new perspectives, and to find better ways forward.Tenacious our businessour industrydemands self-starters who will takes ownership of projects and bring them to completion despite difficulties or setbacks. Sound like a place where you can make an impact? If so, please let us hear from you by applying today! Knowledge and Skills Desired:3+ years industry experience applying analytics and data scienceDeep understanding of multiple machine learning and artificial intelligence frameworksUnderstanding of code optimization in analytics and machine learning algorithms and models3+ years programming experience in two or more relevant languages2+ years experience with data visualisation methodologies (eg. Tableau, Qlik, etc.)Professional qualifications / certification in at least one relevant technology / frameworkExperience with an industry vertical e.g. Financial modeling, Bio-Science, Physics etc.Knowledge and understanding of some data pipeline tooling; Dataiku idealEducation and Experience Required:PhD degree in Mathematics, Statistics, Operations Research, Computer Science or equivalentWithout a PhD, a Master´s Degree in one of these areas and 3+ years industry experience applying analytics and data scienceKnowledge and Skills Required3+ years experience in programming in Python or RBroad, general knowledge of Machine Learning and Artificial Intelligence Framework ecosystems and languages, such as:CaffeTensorFlowPython (Numpy)RDeep knowledge of at least one of the frameworksDeep mathematical understanding of statistics, calculus and other related fields Hewlett Packard Enterprise Values:  Partnership first: We believe in the power of collaboration - building long term relationships with our customers, our partners and each other  Bias for action: We never sit still - we take advantage of every opportunity  Innovators at heart: We are driven to innovate - creating both practical and breakthrough advancements  HPE is an EOE / Female / Minority / Individual with Disabilities / Protected Veteran Status  What do we offer?  Extensive social benefits, flexible working hours, a competitive salary and shared values, make Hewlett Packard Enterprise one of the world´s most attractive employers. At HPE our goal is to provide equal opportunities, work-life balance, and constantly evolving career opportunities.  If you are looking for challenges in a pleasant and international work environment, then we definitely want to hear from you. Apply now below, or directly via our Careers Portal at www.hpe.com/careers  You can also find us on:  https://www.facebook.com/HPECareers  https://twitter.com/HPE_CareersHewlett Packard Enterprise is EEO F/M/Protected Veteran/ Individual with Disabilities. HPE will comply with all applicable laws related to the use of arrest and conviction records, including the San Francisco Fair Chance Ordinance and similar laws and will consider for employment qualified applicants with criminal histories."}