{"jobID": "2787494503", "jobLocation": "San_Bruno_CA", "jobTitle": "Software Engineering Intern, BS/MS, Fall", "companyRating": "4.4", "companyInfo": {"Website": "www.google.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (GOOG) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Apple, Facebook"}, "estimatedSalary": "102000", "jobDescription": "Applications are due by June 29, 2018 at 11:59pm PDT. Please submit both a current resume and the most up-to-date version of your transcript (an unofficial copy is fine). Our team will review applications on a rolling basis and it’s in your best interest to apply early. Thank you for your patience while we consider your application.This application is intended for candidates that are eligible for full-time authorization in the United States upon completing their education. If you do not meet this requirement, please consider applying for international internship opportunities which should be available in EMEA starting in September 2018, LATAM starting in March 2019, and APAC throughout the year. Please check internship opportunities in the office where you are eligible for full-time authorization.Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; Boulder, CO, USA; Cambridge, MA, USA; Chicago, IL, USA; Irvine, CA, USA; Kirkland, WA, USA; Los Angeles, CA, USA; New York, NY, USA; Pittsburgh, PA, USA; San Bruno, CA, USA; Seattle, WA, USA; San Francisco, CA, USA; Sunnyvale, CA, USAJoin us for a unique 12-14 week paid internship that offers personal and professional development, an executive speaker series, and community-building. This program will give you an opportunity to work on complex computer science solutions, to develop scalable, distributed software systems, and also to collaborate on multitudes of smaller projects that have universal appeal - which requires research, awareness, interactivity, and the ability to ask the right questions.  From AdWords to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another. We focus on being a collaborative, global organization consisting of engineers who are ready to address some of technology's greatest challenges and make an impact on millions, if not billions, of users. As a Software Engineering Intern, you will work on our core products and services as well as those which support critical functions of our engineering operations. Depending on your background and experience, you will be working in one of the following areas: Product and Systems Development: Whether it's finding new and innovative ways to advance search quality, building computing platform and networking technologies, automating the indexing of videos, or continuing to refine and scale complex auction systems (just to name a few), you will be developing solutions to some of the most challenging technical problems out there. You will research, conceive and develop software applications to extend and improve on Google's product offerings, and collaborate on scalability issues involving access to massive amounts of data and information. Examples of specialist domains: UI development with AJAX and similar technologies, security, embedded systems and mobile apps (Android), developer tools (IDEs, large-scale build systems, compilers). Engineering Productivity: As a Software Engineer in the Engineering Productivity organization, you'll use your software design, analysis and programming skills to create innovative automated test systems. The test team undertakes a broad range of challenges on a daily basis, designing and building intelligent systems that can explore various use cases and scenarios for distributed computing infrastructure. Just imagine trying to design and build an automated testing system for something that's never been done before. Site Reliability: Software Engineers working in Site Reliability are involved in every facet of Google's production and work on the cutting edge of cloud-based computing. As a member of this team, you are in the thick of everything involved with keeping Google running, from code-level troubleshooting of traffic anomalies to maintenance of our most cutting-edge services; from monitoring and alerts to building new automation infrastructure. Software engineers on this team love to create robust and scalable software that scales to tens of millions of users. You will handle challenging, novel situations every day, and work with just about every other engineering and operations team to provide services and applications that are quintessentially Google - fast, reliable and accessible to all.  Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From AdWords to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another. Responsibilities Apply knowledge gained in computer science courses to real-world problems.Analyze information and evaluate results to choose the best solution to effectively solve problems.Develop scripts to automate routine tasks.Create and support a productive and innovative team. This includes working with peers, managers, and teams. Qualifications Minimum qualifications:"}