{"jobID": "2791469850", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.sofi.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "82000", "jobDescription": "About the team: The Analytics and Data Science team is looking to add a Data Analyst who will serve as an arbiter of truth in data and an authority on company performance. Success of this role hinges on your technical aptitude, quantitative abilities, and business acumen: you know how to plow through data with SQL/Python/R/Tableau, identify the appropriate metric to assess performance, and design the best visualization to convey the pertinent information. You treat stakeholders as a partnership – you are there at each step of the way and you know that we only succeed if we succeed together. At SoFi, you’ll become part of a new kind of finance company based around speed, transparency, and alignment with our members’ interests. Our goal is to be at the center of our members’ financial lives. We created student loan refinancing, addressing the biggest financial challenge of a new generation through a modern approach to lending and personal finance. We expanded into other types of loans, and then into insurance and wealth management with similarly inventive products and soon to be launched SoFi money a modern take on a checking or savings account. As the company has grown, we’ve been able to help more people with these tools. SoFi has achieved significant growth, with ambitious plans ahead, but to continue this growth we need great talent.Responsibilities:Selectively craft the set of metrics and dashboards that provide top level and drill down visibility into company performanceCreate presentation materials for regular weekly and monthly strategic and tactical meetingsAnswer ad-hoc questions through data analysis, statistical tests, and/or modelingProactively explore data to identify pain points and size opportunitiesDesired Skills and Experience:1-3 years of relevant work experienceIntellectual curiosity and aptitude to pick up new technical skillsAbility to initiate and drive projects to completion with minimal guidanceHigh EQ with ability to influence outcomes and communicate technical content to general audiences.Degree in Computer Science, Math, Physics, Engineering or quantitative fieldSQL, R, Python and TableauBachelor’s degreeBenefitsCompany paid lunch program, a fully stocked kitchen, and subsidized gym membership.Competitive salary packages and bonuses.A flexible vacation policy allows you to truly relax and reboot.Comprehensive health, vision, dental, and life insurance as well as disability benefits.100% of health, vision, and dental premiums paid by SoFi for employees and their dependents.401(k) and education on retirement planning.Tuition reimbursement on approved programs, up to $5,250 a year.Monthly contribution to help you pay off your student loans.#LI-CP1"}