{"jobID": "2612274239", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist - Sensing, Inference, and Research", "companyRating": "4.3", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "141000", "jobDescription": " About Uber Were changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now were a part of the logistical fabric of more than 600 cities around the world. Whether its a ride, a sandwich, or a package, we use technology to give people what they want, when they want it. For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer. And thats just what were doing today. Were thinking about the future, too. With teams working on autonomous trucking and self-driving cars, were in for the long haul. Were reimagining how people and things move from one place to the next. About the Role We are looking for a Data Scientist to work on an emerging research area within Uber that leverages mobile sensors to understand the limiting factors of a trip experience. This data scientist will provide data science and machine learning individual contribution work on the sensors and inference team. This team does work on machine data, mobile sensor signal quality (gps, IMU, video), & sensor inference modeling to support a wide variety of products at Uber. The team also includes the location platform, which is the source of truth for rider and driver location. The Data Science role is focused on embedding with product teams and assisting in creating competitive advantages through product efficiencies with a focus on defining experiments, metrics, insights and data improvements. You will work with product and engineering leaders to identify metrics, create global dashboards, envision studies, and understand large data sets, derive insights that get acted on to improve the business, build and maintain internal systems for analysis and monitor core company performance metrics. In this role, your work will broadly influence the products metrics, data and products. A high aptitude for business impact and ability to think out of the box is necessary. We seek a candidate with demonstrated experience in data analytics, applied statistics, and machine learning, who can collaborate cross-functionally with PMs and engineers. The data science lead will work with the engineering and product leads to drive the direction of the team through data-driven insights, to understand the teams impact, and to guide the development of its production algorithms and data products. The candidate will also identify, understand and communicate limitations surrounding data quality and/or quantity, as well as methodologies. They will accomplish these results through a combination of direct hands-on activity and by leading junior members of the team. This individual should be a self starter that can take Ubers products, discover data improvement projects, conduct the necessary analysis, and recommend improvements to both the Product and Engineering leaders on the team. What You'll Do:Partner with other departments to solve problems and identify trends and opportunities since we are a sensor platform team driving efficiencies across UberDesign and deliver quality and timely experiments, visualizations, and presentations of data analysisProvide thought leadership internally for the sensor teamDevelop new insights and analyses that inform decisionsDevelop algorithms for location estimation combining multiple data sources, and for sensor data processingProvide advice and education in the usage and interpretation of dataClearly define your own project deliverables, timelines, and dependencies for team members, internal stakeholders, and clients What You'll Need: M.S. or Ph.D. degree in Computer Science, Statistics, or other quantitative discipline.2-3 years of relevant experience in analysisStrong background in statistics; experience with R, Python, SAS, SPSS, Stata or similarExcellent SQL skillsProficiency with reporting tools and dashboard buildingFamiliarity with NOSQL tools like Hadoop and Spark is a plus.5 years conducting analysis for customer and software product analytics idealAbility to execute research projects, and generate practical results and recommendations.Good communication. Ability to partner with other teams to envision and execute on projects together.About the Team The Sensors and inference research team builds the systems and services that provide the location & sensor backbone of Uber's functionality. The team strives to provide real world context through sensors. Our group's systems mediate our users' digital connection to their physical world through location prediction, safety incidents, traffic modeling, travel time estimation, geospatial search, hotspot computation, and map display and navigation."}