{"jobID": "2820974166", "jobLocation": "New_York_NY", "jobTitle": "Nurse Case Manager", "companyRating": "3.0", "companyInfo": {"Website": "www.archcare.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1899", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " MJHS, VillageCare"}, "estimatedSalary": "52000", "jobDescription": " The Case Manager Registered Nurse plans and coordinates care management services for members, coordinates benefits and collaborates with the Medical Director, MLTC Care Manager, Primary Care Provider, Social Worker and Clinical Services Associate to develop, implement and monitor the plan of care for ArchCare Advantage members. Monitor effectiveness of the care plan and promote member wellness and self-management as well as member satisfaction with the service provision.  The candidate will have proven working experience in case management, including as a nurse, medical care manager or a related job. Excellent knowledge of case management principles and Medicare/Medicaid reimbursement including National and Local Coverage Determinations. Familiarity with Millman & Roberts or Inter-Qual Criteria, knowledge of discharge planning and home care service management. Excellent organizational, time management and communication skills a must. Develop a comprehensive care plan jointly with the member that includes short and long term goals focused on attaining, maintaining and achieving positive health outcomesAt least twice annually evaluate and update the member care plan based upon changes to health status and other factors detailed in the assessment/reassessment document or by change in condition needsCommunicates with enrollment and assessment teams to ensure a smooth transition at the start of care.Maintains on-going telephonic communication with members and care givers.Collaborate with other Care Managers and the Primary Care Physician (PCP) to insure optimal implementation of the care plan.Conduct risk reduction counseling with all members to identify and prevent risk factors and provide referral to appropriate community resources and services. Educate members and family in health management and community resources.Facilitate access to care by assisting with appointment and identification of appropriate network providersCoordinate Medicare/Medicaid benefits to maximize service and resource utilization as well as cost effectiveness through referrals to appropriate level and frequency of care/servicesEnsures that utilization of services is reasonable and necessary to member's health and well-beingMaintains oversight for the member's care management during inpatient acute episodes necessitating hospital admission. Participates and ensures effective discharge planning for transfer to the community and resumption of services upon dischargeDocument any change in member's condition and request/authorize services or assessment and possible change in the care planParticipates in prevention, surveillance and control of infection via infection control policiesIntervenes as necessary to prevent dissatisfaction and resolve concerns and/or grievances.Participates in Quality Assurance and Improvement initiatives within ArchCare Advantage.Refer to nurse practitioner case management any member whose health status has declined. Follow-up on the referral to ensure the member was successfully linked with nurse practitioner care management.Perform other related duties, as required.BSN/RN Licensed and currently Registered in the State of New YorkMust have Medicare and/or Managed Care backgroundProven working experience in case management, including as a nurse, medical care manager or a related job.Excellent knowledge of case management principles and Medicare/Medicaid reimbursement including National and Local Coverage Determinations.Familiarity with Millman & Roberts or Inter-Qual Criteria,Working knowledge of discharge planning and home care service management.11Excellent organizational, time management and communication skills. #CB"}