{"jobID": "2756017115", "jobLocation": "New_York_NY", "jobTitle": "Data Scientist", "companyRating": "4.1", "companyInfo": {"Website": "www.fanduel.com", "Headquarters": "New York, NY", "Size": "201 to 500 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Arts, Entertainment & Recreation", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "112000", "jobDescription": " FanDuel is the pioneer of online daily fantasy sports, one of the fastest growing sectors of the sports and entertainment industry. Since our launch in 2009, we've been disrupting the fantasy sports industry and changing the way millions of fans experience sports.  Sports is our game, but fast-paced technology is at the heart of our business. We make products that sports fans love to use and our teams love to build. Working at FanDuel provides the opportunity to impact the lives of millions of sports fans through the code you write and where you'll work with and learn from multi-award winning highly entrepreneurial and ambitious teams.  At FanDuel we champion the customer and work in empowered streams, autonomously tackling complex challenges that provide the very best experience for our users. About the role We are looking for a Data Scientist to tackle our most challenging analytics problems. Who we're looking for1-3 Years of Industry Experience in data science, analytics or engineeringStrong analytical and quantitative skills, with high proficiency in Python or R, and SQLUnderstanding and application of Bayesian statisticsExperience building and using models to help create production level products and toolsComfortable with command line tools and GitHubObject-oriented design and coding skillsStrong verbal and written communication skillsAbility to work across teams, locations and time zonesInterest or experience in sports and fantasy sportsWhat you get in return Beyond working with such a great team? An exciting environment with real growthContribute to exciting products used by a highly passionate user basePersonal learning and development opportunitiesUnlimited vacation allowance100% coverage of health insurance premiums There's more, but we don't want to go on and on. FanDuel is an equal opportunities employer. Diversity and inclusion in FanDuel means that we respect and value everyone as individuals. We don't tolerate bias, judgement or harassment. Our focus is on developing employees so that they reach their full potential."}