{"jobID": "2537252918", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.agilone.com", "Headquarters": "Sunnyvale, CA", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Adobe, IBM"}, "estimatedSalary": "115000", "jobDescription": "As a Professional Services Data Scientist, you are in charge of designing, building and deploying complex technical custom projects in particular around data integration, data processing and data analytics. You will also work closely with clients, account managers and product implementation to understand clients business use cases, define business and technical requirements and communicate deliverables.In order to succeed in this position, you should be autonomous, analytical, a self-starter and organized. You are adaptable and thrive on working with minimal structure and guidance. You are also excited about working with customers -- both internally and externally. As an experienced professional, you are expected to manage and drive forward multiple complex projects and act as a mentor to less experienced team membersWe work hard to maintain our fast-paced, friendly culture and help us maintain our leadership position in the retail industry and beyond. Responsibilites Develop a deep expertise of AgilOnes platform architecture, data layers and capabilitiesWork with clients, account managers and product to understand the clients business use cases and dataDesign, build, and deploy elegant custom solutions and extensions to the platform in particular around data structures, data integrations, data analytics and data modelsWrite production-quality code and technical documentationTroubleshoot product and data anomalies and ensure absolute integrity of deliverablesUse project, delivery and reporting tools including Salesforce and MavenlinkWork with internal product and engineering teams and contribute to the continued enhancement and improvement of our platform Qualificiations Bachelor's Degree in Engineering, Information Technology, Computer Science, Mathematics or similar technical/analytical degreeStrong academic qualifications, including advanced understanding/coursework in database management and math (Linear, Algebra, Calculus)\\2+ years of experience in a data analytics positionSolid programming skills in SQL, TSql, PL/SQL or similar database programming languageProficiency in statistical data analysis and data mining packages (e.g R, Python)Intellectual curiosity, along with excellent problem-solving and quantitative skills, including the ability to disaggregate issues, identify root causes and recommend solutionsSelf-motivated and good sense of ownership - comfortable working in a fast paced environment with limited directionExcellent organizational skills and ability to manage multiple tasks simultaneouslyExcellent written and verbal communication skills tailored to an audience of professionals, management and staff with a broad range of technical skillsHumility and sense of humor Nice to have Experience with ETL tools (e.g SQL Server Integration Services)Understanding and experience of integrating with APIs. Knowledge of standards such as REST, JSON, XML, SOAP and OAuthStrong object oriented programming skills (e.g Java, JavaScript, Scala)Understanding of the Cloudera Big Data Stack. Hands on experience with Hive, Impala and Spark.Experience with digital analytics concepts (e.g Next Product to buy, cross channel attribution) and tools digital analytic (e.g. Google Analytics, CoreMetrics, SiteCatalyst)Prior IT consulting and/or project management experienceMasters Degree or MBA with a technical undergraduate degreeThe AgilOne Story:AgilOne, the Customer Data and Engagement Hub, provides enterprise consumer marketers the power to integrate customer data across digital, physical, and mobile channels, deliver customer analytics with predictive insights and 360-degree profiles, and engage customers at every touch point in order to maximize lifetime value. Currently, the AgilOne solution supports more than 150 brands worldwide.We leverage the latest technologies in big data, machine learning and data quality management to deliver an enterprise-grade, scalable and high performance tool for customers such as Tumi, Lululemon, Lilly Pulitzer and Davids Tea.AgilOne is funded by the best in the Valley - Sequoia Capital, Tenaya, and Mayfield.Competitive compensationExcellent benefitsEquity401kCatered lunches, snacks and beveragesA fun environment to work hard and play harder with passionate people building great products!"}