{"jobID": "2815220168", "jobLocation": "San_Jose_CA", "jobTitle": "Outside Sales | California (Los Angeles)", "companyRating": null, "companyInfo": {"Website": "www.janmarini.com", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Obagi Medical, SkinMedica"}, "estimatedSalary": null, "jobDescription": " Account Executive in Outside Sales | Los Angeles, CAWe are a quickly expanding aesthetic company based in California that offers its employees a truly entrepreneurial experience. This position provides the ability to work as a practice builder with accounts and creatively grow sales. The company offers amazing support tools that make the position an exciting business building opportunity on a daily basis. Join our team of highly motivated executives and experience the thrill of being a part of a leader in the medical skincare industry.  The company, Jan Marini Skin Research, Inc. was founded in 1994 and is a recognized leader and innovator in skincare that is committed to continually expanding and improving the professional skincare market. JMSR's two primary focuses are to provide innovative technologies that deliver proven measurable results and an unwavering commitment to the ongoing success of our customers.  We believe the account executive position to be the most crucial part of the company. Our support and focus on this position is our number one priority.  We are looking for candidates who want to make a career in the medical skincare industry and have the desire to be a part of a dynamic sales atmosphere. We offer growth opportunities within the account executive category so there will continually be a new challenge to strive toward. If you are interested in a career, not just a paycheck, then check this out: To begin, you will be put through a highly interactive training course located at our beautiful corporate office in San Jose, CA. You will then return to your home office for a supported in the field at home training experience. You will be required to master our state-of-the-art CRM system which is one of many tools provided for your success.The need to focus on the exciting endeavor of opening new accounts on a monthly basis will lead to your achievement. This will take the ability to research appropriate prospects and show them the opportunity they have to grow their business by adding JMSR.Your ability to juggle lots of tasks and be accountable for forecasting your business weekly is required. You will be the customer consultant expected to handle post-sales support, customer product training as well as be a business consultant to your accounts. They will look to you to support the ongoing growth of their business with our product.Our customers expect you to have actionable ideas on how to grow their business every time they place a new order. You will have a pivotal role in your accounts' business-expected to assist the account by being an effective business consultant. Sell through of the account product is your #1 priority and is an exciting part of the job when brainstorming with your accounts on how to make this happen.You will be accountable for a monthly/quarterly number and when this is achieved, success is measured in bonus and commission which is untapped!Your ability to analyze your business needs and route yourself accordingly on a weekly basis will be crucial to keeping our Physicians, high end spas and licensed skincare facilities happy.You will need to have the ability to be a dynamic presenter of product and business ideas.The position offers the exciting ability to travel outside of your territory, including trade shows and medical conferences that are required to support your growth. We offer an exceptional compensation and benefits package. The competitive base salary plus a NO-CAP highly attractive commission structure, which is geared to base and new business development, is outstanding. In addition to this, we also have an annual performance based plan. If you like the opportunity to earn more all year long, we have a structure you will find motivating and exciting! We offer a full benefit plan which includes: medical, dental, vision, group life, 401k, paid holidays and PTO. We also offer a monthly expense reimbursement which includes a car allowance, gas & oil change reimbursement as well as normal expense.This position is for the Los Angeles, CA territory. Your strong ability to prospect and focus on opening new accounts will lead to your success. Are you ready for a career in the skin care industry? Start here and apply today: h.r@janmarini.com. An HR representative will reach out to you directly. We look forward to hearing from you and thank you for your interest in Jan Marini Skin Research. Connect with us on LinkedIn"}