{"jobID": "2398065463", "jobLocation": "San_Francisco_CA", "jobTitle": "Bilingual Customer Service Representative", "companyRating": "3.6", "companyInfo": {"Website": "www.sfhp.org", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "22", "jobDescription": " Overview  Established in 1997, San Francisco Health Plan (SFHP) is a an award winning, managed care health plan whose mission is to provide affordable health care coverage to the underserved low and moderate-income residents in San Francisco county. San Francisco Health Plan is chosen by eight out of every ten San Francisco Medi-Cal managed care enrollees and its 145,000+ members have access to a full spectrum of medical services including preventive care, specialty care, hospitalization, prescription drugs, and family planning services. SFHP was designed by and for the residents it serves, and takes great pride in its ability to accommodate a diverse population that includes young adults, seniors, and people with disabilities. POSITION SUMMARY As a Bilingual Customer Service Representative, you’ll have one of the most important roles in our organization as the face of our Health Plan.  If you enjoy working in an exciting, talented & fun team environment where you’ll learn a wealth of knowledge and grow your client relation skills, this is your opportunity. You should naturally thrive on listening, talking with and helping others, be outgoing and committed to improving every member’s call experience and help address any questions and/or issues professionally and efficiently.  You’ll be responsible for serving SFHP clients, among them our Health Plan members, prospective members, providers, staff members and the public in general. You’ll help to provide Health Plan orientation, education, and assistance, including plan benefits, updates, programs, policies, complaints and procedures. Being well spoken, clear and patient with all interactions should accurately describe you. This position is a temp-to-hire and bilingual fluency in English and Russian, Spanish, Vietnamese, or Cantonese is required. Excellent benefits like very generous PTO, free health insurance, commuting subsidies and retirement benefits are provided after your temporary status ends and you become an SFHP employee.WHAT YOU'LL DOResponds to customer requests, questions, concerns, and complaints in a timely, respectful, caring and competent manner.Answers telephone calls promptly and minimizes delays that may lead to abandoned calls.Verifies member eligibility, coverage or exclusion of services.Assists members in selecting or changing personal doctors or medical groups according to established guidelines.Informs and educates customers on Plan policies, procedures and services.Promotes the rights and responsibilities of Plan members.Provides information, referrals and coordinates member services with community resources for covered and non-covered services.Participates in activities that reach out to prospective members and to the communities that the Plan serves.Keeps the Customer Service Supervisor and Manager informed of service problems, changes in our contact database, including members, providers, resources, etc.Receives customer complaints and works with the Customer Service Supervisor and/or Manager to resolve concerns.Provides information to members on preventive and primary care services.Compiles and enters electronic data.Completes all training programs and certifications as required.Assists prospective members with applications for Medi-Cal, Healthy Families, Healthy Workers and other lines of business as needed and according to guidelines.Provides coverage of all areas under the responsibility of Customer Service, including front desk and mail services.Performs other duties as assigned.WHAT YOU'LL BRINGBilingual fluency/skill in English and Russian, Chinese, Vietnamese, or Spanish is required.At least 1-2 years of experience in customer service, call center, or similar.Excellent written/oral communication skills with a high degree of professionalism, including discretion in working with confidential information.Good knowledge of MS Office and customer management applications.Ability to produce accurate, precise and quality work in a dynamic and diverse environment while meeting deadlines.Able to work well both as a team and independently.Familiar with health care and managed care terminology.Prior experience in health care and knowledge of managed care or Medi-Cal preferred.College degree is preferred or equivalent work experience.San Francisco Health Plan is an Equal Opportunity Employer (EOE) M/F/D/VPursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records."}