{"jobID": "2822918970", "jobLocation": "New_York_NY", "jobTitle": "Director of Recruiting- IT & Technology Division", "companyRating": null, "companyInfo": {"Website": "www.adviceny.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Director of Recruiting – IT & Technology DivisionAs part of our continued growth and expansion, Advice is launching a brand new Information Technology Division designed to expand our service offerings to our growing portfolio of forward thinking, technology driven clients. The division will specialize in the recruitment of the technical professionals that design, build and scale the technology infrastructure behind some of the most progressive, fastest growing companies in the Greater NYC area. Core focus areas will include (but not be limited to) the following:Technology DevelopmentFunctional SupportSoftware & Mobile Apps Business & Systems AnalysisSystem Architecture Data Support & MaintenanceData Management Platforms Business IntelligenceNetwork & Infrastructure Project ManagementHelpdesk Support ERP/CRM CollaborationConcurrent with the launch of this new division, we are seeking a Director of Recruiting to spearhead the build-out and continued development of the department. The Director of Recruiting should come in from day one with extensive knowledge of the practice areas outlined above along with the drive and ambition to lead this division. The Director of Recruiting will have access to an immense network of pre-existing client relationships built up over our 35 years in the industry and will be tasked with the mission of expanding those partnerships into these new practice areas.What You’ll Be Doing…Partnering with senior leadership to design, develop and implement effective strategies for the operation and growth of the real estate division.Building close partnerships with clients, providing critical support, guidance and advice to ensure they make the best hire for their business.Actively engaging in marketing and business development activities to generate mutually beneficial relationships with new clients.Leading the eventual recruitment, training and development of a strong support team of trusted recruiters and account managers.Designing creative solutions to promote long-term, value-add relationships with all clients and business partners.Identifying and recruiting active and passive candidates using a variety of channels, including referrals, networking, internal databases, and innovative research tactics.Interviewing and assessing candidate qualifications by developing deep-rooted industry knowledge.Offering advice to prospective applicants and existing clients, including resume preparation, interview preparation, salary negotiation strategy and education on current market trends.What We’re Looking For…Bachelor’s Degree preferred5+ years of full-cycle recruiting or sourcing experience with a specialization in technology or IT supportProven track record of generating new business relationshipsExtensive knowledge of technical skills, market compensation, industry terminology and typical job functions for information technology professionalsEntrepreneurial spirit with a passion for designing, enhancing and improving business processes.Strong leadership skills with the ability to lead and manage multiple staff.Let’s Talk Numbers…Uncapped commission structureCommission override on team productionIncentive-based compensation for sales & activity goalsCompetitive bonus potential based on annual performanceWho We Are…At Advice, we develop strategic partnerships with our clients, advising and guiding them through the entire recruiting process. We take pride in immersing ourselves within their organization, learning their business, and acting as an extension of their team.The Advice team is made up of passionate, relationship-oriented and conscientious career advisors and hiring consultants who recognize the significant value that can be gained through a truly special recruiting relationship. We recognize that recruiting is not just about finding good resumes, but more so how the people behind those resumes fit in with the vision of a particular company and position. The Advice advantage is all about the people on our team and the value that we place in becoming a trusted advisor and source of information for both our clients and candidates.Still not sold? Take a look at our collection of web series on our Advice Personnel YouTube Channel.Please send your resume for immediate consideration to Kevin Roth at: kroth@adviceny.comAdvice Personnel*Celebrating over 30 years as New York’s trusted boutique executive recruiting & staffing firm"}