{"jobID": "2293067780", "jobLocation": "Seattle_WA", "jobTitle": "Software Engineering Intern", "companyRating": null, "companyInfo": {"Website": "www.karat.io", "Headquarters": "Seattle, WA", "Size": "1 to 50 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Our mission at KaratKarat has reengineered technical hiring to ensure that great talent gets noticed by great companies. We augment engineering organizations by conducting the first-rounds of technical interviews on their behalf. Our service saves material engineering time and drives a highly responsive and consistent experience for candidates. Karat continuously invests in cutting edge interview methodologies with an aim of reducing bias and letting candidates demonstrate their true ability.We operate as strategic partners for engineering leaders at the world's leading technology companies including Jet, MuleSoft, Roblox, Intuit, Ten-X, Minted and many more. As the gold standard of technical interviewing, our well-funded company is scaling quickly to meet our growing list of client's needs. Come join us!Engineering at KaratAs a member of Karat's engineering team, you will get to work on an exciting mission with a superstar team that feels like family. You will be able to easily relate to the product given that we've all been through technical interviews. We work in a Ruby and Unix environment, practice continuous integration and regularly unit test. As we are a young company, you will receive close mentorship from industry veterans as you help us to shape the premium interviewing experience we are endeavoring to create. We want individuals who are hungry to take ownership of their work and who want to make a significant impact. We believe that a flexible work environment is where people are most comfortable and productive. About You You believe in our mission and crave the ownership and responsibility we will give you.You have strong experience in a dynamic language used for web development, such as Ruby, Python, or Go.You are comfortable working on dynamic websites using AJAX and modern frameworks like Angular or React, as well as plain old JavaScript.Youve worked on web apps - you know how HTTP, Rest, and web security works.You are at home in a Unix/Linux workflow.You have a distinct passion for product driven development and you love writing clean, understandable, and maintainable code.You have a desire to learn and improve your craftsmanship, plus you will always go the extra mile to provide happiness to your customers.Interviewing, teaching, or mentoring experience is a plus as it will help you relate to our mission and culture."}