{"jobID": "2786672965", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Software Engineer in Test", "companyRating": "4.1", "companyInfo": {"Website": "www.glassdoor.com", "Headquarters": "Mill Valley, CA", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Indeed, LinkedIn"}, "estimatedSalary": "128000", "jobDescription": " Our mission is to help people everywhere find a job and company they love. We are disrupting an industry by changing how people search for jobs and how companies recruit top talent.  We’re looking for a passionate, skilled and driven Sr. Software Engineer in Test to help us take our product to the next level for our San Francisco office. At Glassdoor you’ll have the freedom to leverage your intuition, creativity and expertise to help one of the top job sites in the world to continue its rapid expansion.  A typical week includes working with Product Managers and fellow Engineers to understand and clarify new feature requests that support Glassdoor’s business goals. You will collaborate with fellow Software Engineers in Test to discover new ways of creating and executing tests. By providing guidance on testing methodologies, you will help keep the entire team accountable for the quality of work released in our biweekly sprints. Finally, you will push new efficiencies with your team, from promoting test coverage to creating new tools and evangelizing automation best practices. Responsibilities Our ideal candidate will have experience with various automation frameworks, a strong understanding of QA best practices, and a passion for quality. Object oriented programming experience and navigating Linux environments is also a necessity.  As a late stage startup, we look for self-starters who thrive in a fast-paced, agile environment – which means wearing multiple hats, being able to change direction quickly, and showing an eagerness to learn new technologies as the need arises. In this role you work with a cross-functional, collaborative environment – so excellent interpersonal and communication skills are also a must. And most importantly – we look for people who can prioritize, multi-task, and deliver. Skills and RequirementsSeveral years (4+) of testing consumer web sites and building functional automation testsExperience with automated test tools and frameworksExperience building maintainable and efficient tests using Java-based tools like Selenium and JunitProgramming experience with Java or other object oriented languagesKnowing QA best practices and how to create processes to drive quality in a productBeing comfortable working with a cross-functional team of developers and quality engineers to develop innovative automated testing solutionsSolid understanding of the software development life-cycle and Agile methodologiesSelf-starter who is comfortable taking a task and delivering on it without lots of managementFamiliarity with Linux, SQL, Ruby, performance tools, bash scripts and version control systems such as git are also a plusCS degree or equivalent experience* LOCATION - This position will be based in our San Francisco, CAWhy Glassdoor?Work with purpose – join us in creating transparency for job seekers everywhereGlassdoor gives back! Glassdoor is a Pledge 1% member; all employees receive 3 paid volunteer days per year100% company paid medical/dental/vision/life coverage, with 80% dependent coverageLong Term Incentive PlanConveniently located office in the heart of downtown San Francisco (Embarcadero)Fully-stocked break rooms with complimentary food and drinksPaid holidays and flexible paid time offYour choice between Mac or PC Glassdoor is committed to equal treatment and opportunity in all aspects of recruitment, selection, and employment without regard to gender, race, religion, national origin, ethnicity, disability, gender identity/expression, sexual orientation, veteran or military status, or any other category protected under the law. Glassdoor is an equal opportunity employer; committed to a community of inclusion, and an environment free from discrimination, harassment, and retaliation."}