{"jobID": "2796869822", "jobLocation": "New_York_NY", "jobTitle": "Development Intern", "companyRating": null, "companyInfo": {"Website": "www.allstarcode.org", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "WHO WE ARE Only 1% of VC-funded startups have a black or Latino founder, and we think this is unacceptable. All Star Codes mission is to attack this statistic head-on, empowering young men with the skills, networks, and mindsets they need to create new futures through technology. We do this through our flagship program, a six-week Summer Intensive and ongoing alumni services for our graduates.  Unlike most coding programs, All Star Code doesnt just focus on Computer Science and technology; we also introduce soft skills and expose them to the tech startup culture by integrating our programs into tech spaces and successful companies with inspiring guest speakers and, most importantly, fun. All Stars finish the Summer Intensive as coders, makers, and entrepreneurs. MISSION & VISION All Star Code works to close the wealth gap by developing a new generation of entrepreneurs.  All Star Code is a non-profit computer science education organization that creates pathways to educational, professional, and entrepreneurial success in technology for motivated young men of color. We invest primarily in Black and Latino high school males because there are currently no national organizations focused on preparing this underserved group for careers in the innovation economy. THE OPPORTUNITY The Development Intern will report to the Development Associate and will perform various duties as outlined below. Were looking for a detail oriented go-getter, excellent communicator, and passionate advocate for economic justice. The Development will need to be an exceptional writer, detail oriented, and eager to learn. RESPONSIBILITIESAssist the development staff in entering data into Salesforce, All Star Codes donor database.Maintain donor files and other development materials.Conduct research on potential donors, strategic partners, markets and industries.Draft correspondence, reports, proposals and donor appeals.Attend department and staff meetings.Assist with mailings, filing, and special projects as needed.WHO YOU AREA Detail-Oriented multitasker, with the ability to prioritize projects, while meeting deadlines.An Excellent Writer with strong research, and interpersonal communication skills.A Results-oriented Professional with experience in data collection and tracking.Desire to learn more about fundraising and philanthropy.Proficiency in Microsoft Word, Excel, PowerPoint, and Salesforce.WHAT TO EXPECT AT ALL STAR CODE Joining our squad means committing to live our mission and our values, which ultimately means learning. We ask our students to learn new and difficult skills in computer science and we ask them to step outside their comfort zone on a daily basis. We pledge to apply this learning through coding education, books & articles, professional development, workshops & conferences however learning applies to you!  We are a transparent organization with open calendars, clearly defined salary bands, and a collaborative approach. So, if you make a mistake, fail to meet a target, or cant quite solve a problem, we share that failure as a team. Not only do we share it, but we also celebrate failure because it is a sign that you are really challenging yourself!  We are driven; we love the thrill of a clear goal and working hard to get there, and we balance that with a commitment to wellness for each of us, because we know that a sound mind and sound body are crucial components of a sound team. We tell our story. We bring our full selves to work and support our team members side hustles, their pets, and their family members. We get to know each other as people and make all decisions from a place of empathy. Perhaps most importantly, each of us carries a strong sense of justice. We consider our work to be necessary and important to create a more equal world, and that is the foundation of why we do what we do. LOCATION New York City COMPENSATION AND BENEFITS This part-time, ten-week position is offered at $15/hour. All Star Code is an equal opportunity employer and welcomes candidates from diverse backgrounds."}