{"jobID": "2747861429", "jobLocation": "San_Francisco_CA", "jobTitle": "Jr. Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.brightbytes.net", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "56000", "jobDescription": "About BrightBytes BrightBytes, the leading end-to-end data management solution for education organizations, provides educators with the power to turn big data into big benefits for students. With the data integration platform, DataSense™, BrightBytes enables educators to cleanse, integrate, and bi-directionally manage complex data from multiple systems. The decision support platform, Clarity®, then analyzes and organizes meaningful data across research-based frameworks to deliver visualized, actionable information that drives student learning.  BrightBytes has assembled a team of over 100 Ivy-League data scientists, creative engineers, world-class researchers and inspirational education leaders. We hire mission-driven individuals who are eager to apply their educational expertise in a fast-paced, fun, entrepreneurial environment that delivers the tools that educators need to improve children's lives. Job Description We’re seeking a Junior Data Analyst to help the BrightBytes Data Operations team scale our impactful education solutions, providing critical insights to districts across the country. We’re looking for someone with strong analytical skills, who wants to put data into action by helping school districts make better informed decisions. You’ll be working directly with our district customers and data research partners to bring our SIS data powered modules into districts, schools, and classrooms. For you, managing mountains of potentially messy data sounds like a fun way to spend the afternoon -- and wrapping it up in a beautiful, statistically significant bow? All the better. Here’s what you’d do:Explore new data setsInvestigate school district raw data and formulate questions to enhance data quality and completenessWrite queries to transform raw data into fantastically clean, normalized datasetsWork with school district technical teams to improve data quality and address inconsistencies, gaps and other issuesResearch and acquire publicly available data to supplement what is available from district student information systemsRun, evaluate and extend data quality reporting tools and proceduresCreate customer-facing materials to help with data verification stepsTrain and score statistical models that drive our dashboardResearch and prepare publicly available data sets to support features of additional BrightBytes modulesGenerate ad-hoc reports for customersAnalyze internal data and prepare results to be used in marketing, white papers, and customer communicationsHere’s what we’re looking for:Detail-oriented and extremely thorough: you take pleasure in ferreting out the smallest inconsistencies and making sure things always add up.Data savvy: you have a background in statistics and you feel confident navigating and analyzing large data sets. You’re also comfortable with database design, relational database terminology and can write advanced SQL queries.Strong problem solver: you live for the thrill of the chase. Naturally curious, you can’t help but dig deeper and get to the root cause of an issue.Clear communicator: you get your point across with the fewest most impactful words. Talking to customers, you know how and when to simplify complex technical issues vs. get into the nitty gritty.Collaborative: you thrive working with others to get the job done, and you bring an attitude that helps lighten the load for everyone.Technical aptitude and interest: you’re extremely comfortable navigating new systems and are excited to learn new tools that help you get the job done quickly and efficiently.Mission Driven: you care deeply about improving the state of US education and fulfilling the BrightBytes mission of improving the way the world learns.And here are the requirements:1+ years of relevant work experience that includes quantitative analysis and client-facing work.Bachelor’s degree in Economics/Statistics/Business or another quantitative field.Strong desire to work in the education sector.Experience with SQL is a must, exposure to other statistical languages (R, Stata, SAS) is a plus.Available to start on or before June 1"}