{"jobID": "2825164273", "jobLocation": "San_Jose_CA", "jobTitle": "Software Engineering Intern", "companyRating": "3.4", "companyInfo": {"Website": "www.hpe.com", "Headquarters": "Palo Alto, CA", "Size": "10000+ employees", "Founded": " 2015", "Type": " Company - Public (HPE) ", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Oracle, Accenture"}, "estimatedSalary": "74000", "jobDescription": " At Hewlett Packard Enterprise (HPE), we live by three core values that drive our business: Partner. Innovate. Act. These values combine to help us create important work all over the world to advance how people live and work.  HPE makes Hybrid IT simple. HPE helps customers to design the right mix of Hybrid IT to serve their unique needs. We bring next generation infrastructure that uses intelligent software to simplify and accelerate the delivery of new apps, services and business insights. Providing with new ways to deliver and manage IT on-premises and in the cloud.  Hewlett Packard Enterprise is seeking a highly motivated Software Engineering Intern to work in the Durham, NC office. The Intern will develop/test software across the full stack from server side back-end code to client side interfaces.  Responsibilities: Plan, Design, document, maintain, automate and execute test case scenarios for Nimble Storage systemsResponsible for test execution and automation for system management, data provisioning, high availability, access control, REST APIs Design functional, stress, scalability, HA type of tests for the product. Testing and configuration of iSCSI/FC clients and switches connected to Nimble storage arraysWork closely with cross functional teams.Create reports, engineering documentation, and best practices based on test results analysisCollaborate with Development and QA Engineers to build robust and efficient automated test libraries and scriptsEffectively manage multiple assignments or projects Education and Requirements: Must be currently enrolled in a Bachelors or Masters degree program majoring in Computer Science or Computer Engineering.Knowledge in a storage, network, security or systems environmentBackground with scripting language, preferably Python.Ability to work independently in a fast environment and take on a variety of roles as needed.Demonstrated experience working with multiple teams and implementing their requirements. We offer:  • A competitive salary and extensive social benefits  • Diverse and dynamic work environment  • Work-life balance and support for career development  Want to know more about HPE? Then lets stay connected!  https://www.facebook.com/HPECareers  https://twitter.com/HPE_CareersHewlett Packard Enterprise is EEO F/M/Protected Veteran/ Individual with Disabilities. HPE will comply with all applicable laws related to the use of arrest and conviction records, including the San Francisco Fair Chance Ordinance and similar laws and will consider for employment qualified applicants with criminal histories."}