{"jobID": "2811508937", "jobLocation": "New_York_NY", "jobTitle": "Full-Time Fall 2018 Internship Program", "companyRating": null, "companyInfo": {"Website": "www.christies.com", "Headquarters": "London, United Kingdom", "Size": "1001 to 5000 employees", "Founded": " 1766", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Full-Time Fall 2018 Internship ProgramOverview:Christie's is currently accepting applications for our paid Internship program that will expose individuals to the art world and auction industry through hands-on experience during the first half of the year. Depending on where the company and department are in their sale cycles, a persons’ tasks may include the following: administrative, research, cataloguing, assisting with sales, writing provenance documents, and other assigned projects.This is a paid program, which will require all chosen participants to undergo a verification process. Christie’s will also not reimburse travel, housing, or other expenses.Placements are available in Specialist departments, select Business Support departments in and with both part-time and full-time availabilities* By applying to this posting, you are verifying that you are available to work on a full-time basis throughout the duration of the program.Fall Internship Dates: August 20th, 2018 – December 21st, 2018*Successful Christie’s applicants are not necessarily art history majors but have a passion for art and a strong desire to learn about the auction business. For certain departments, proficiency in another language, such as German, Mandarin, Russian, and Spanish, is highly desired.Structure: General length for this program is roughly 18 weeks. All full-time positions require a commitment of approximately 35-40 hours per week during the Fall and Winter months. Please be mindful of your schedule and/or course load before applying for an internship.*Note: Candidates may make special arrangements with their department for any schedule adjustments.Successful applicants are placed in positions according to their background and areas of. Candidates may request specific departments through our online application and should be mentioned in their cover letters. These requests are taken into account but are not guaranteed.In addition to working in assigned departments, accepted individuals will also be required to attend orientation, auctions, and additional planned events throughout the semester. International Candidates:International individuals may apply for a U.S. internship as long as they have the necessary visa status. Christie’s does not sponsor visas for any candidate for our internship program. Eligibility:All candidates must have appropriate work authorization (CPT/OPT complete), as Christie’s does not sponsor visas for entry level positions. Selected international students must be in possession of the following documents prior to their start date.For students covered under CPT:1. Foreign passport2. I-94 Form3. Visa4. I-20 FormFor students covered under OPT:1. Foreign passport2. I-94 Form3. Visa4. Employment Authorization Card5. I-20 Form confirming their OPT6. Social Security CardCandidates must be undergraduate students, master’s students, or within one year of graduation from University, either undergraduate or masters.All candidates should be available for the entirety of the internship and should prepare for their schedules for the time and workload commitment All accepted individuals must complete verification screenings.All applicants must apply online through Christies.com and complete the application titled “Fall 2018 Internship Full-Time”Skills and Requirements:Excellent communication and interpersonal skills, including superior written and spoken communicationStrong follow-up skills with attention to detailStrong knowledge of Microsoft Office (especially Excel, PowerPoint and Outlook) Ability to learn Christie’s systems Highly collaborative natureAbility to handle a fast-paced environmentDemonstrated ability to multi-task and prioritizeSuperior client service skillsExperience with Research LibrariesClosing Date of Applications: July 13th, 2018"}