{"jobID": "2587530122", "jobLocation": "New_York_NY", "jobTitle": "Marketing Content Writer- NYC", "companyRating": null, "companyInfo": {"Website": "www.feedvisor.com", "Headquarters": "Tel Aviv-Yafo, Israel", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " At Feedvisor, were just as proud of our products as we are of our people. We work hard to assemble the best teams in the industry to create, manage, and sell the repricing tools that are shaping the future of e-commerce. Harnessing the powers of AI, Machine Learning, and Data Science, our Feedvisors are changing the way that business happens online. Our New York office is growing rapidly, and we cant wait to start a conversation with you.  We are seeking a Marketing Content Writer to help tell the story of Feedvisor through engaging copy and unforgettable storytelling. About the Role + Youll write a wide range of killer content that shares Feedvisors vision with the world: web copy, ad copy, whitepapers, landing pages, case studies, email campaigns, press releases, weekly blogs, social posts, and so much more.  + Youll serve as our own personal writing whiz/content-marketing-thought-leader: blogging, speaking, and generally spreading Feedvisors story however you can. Sort of like a medieval bard, with a laptop instead of a lute.  + Youll play a pivotal role on our marketing team: overseeing freelancers and agencies, keeping our team up-to-date on the best content marketing trends (and telling us which ones to avoid), and developing strategies to help our content channels grow to new heights.  + Youll let data guide your creativity. Youll oversee the success of our marketing content on various channels, and let that data drive your decisions.Requirements:About You + Youre a master storyteller with volumes of work to show for it. Your expertise in writing copy and content is undeniable, and you have years of company blogs, press releases, website content, and so much more in your back pocket. Maybe even a novel or two.  + Youre curious, quick, and relentlessly creative. Youre known for your way with words and always ready to brandish your creative powers with unexpected flair. You can easily understand technical concepts and make them sound, well, a little less technical and a little more human.  + You have native-level fluency in English, and youre fluent in the language of marketing, as well. You have experience using a CMS for creating web content, and youre well-versed in SEO best practices, too. Youre probably old friends with Mailchimp, Marketo, and Hootsuite.  + Youre not a newbie. Youve got 10+ years experience writing content, preferably in tech and especially at a software company. You have a BA degree or equivalent experience. Youre a whiz at effectively editing Wikipedia or other MediaWiki sites, and you might know your way around HTML, too.  Along with your resume, well want to see three samples of your best writing, covering a broad range of types of work: blogs, ads, landing pages, website content, press releases, case studies, etc. Be sure to send these through the Attach Portfolio section of the application form. Our Culture At Feedvisor we care a great deal about our company culture. You will be a fit if:  + You are obsessed with excellence and consistently looking to improve.  + You seek to understand the world through other peoples eyes.  + You see opportunity in difficult situations.  + You earn and keep others trust.  + You get things done.  + You are humble, radically candid, and open to feedback. Benefits: You will be part of a dynamic team and have the privilege to work for a company that is building the infrastructure of the future. We offer a competitive compensation package, which includes: comprehensive health, dental and vision insurance, life insurance, generous PTO, a 401K and happy hours, parties and events to insert joy into workflow.  Check out our profile on The Muse, our Customer Success Stories, and our Products page. All brought to you by the brilliant minds at Feedvisor - care to be one?"}