{"jobID": "2797061242", "jobLocation": "Bellevue_WA", "jobTitle": "SAP Concur - Data Analyst", "companyRating": "4.4", "companyInfo": {"Website": "www.sap.com", "Headquarters": "Walldorf, Germany", "Size": "10000+ employees", "Founded": " 1972", "Type": " Company - Public (SAP) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Salesforce, Oracle, Microsoft"}, "estimatedSalary": "59000", "jobDescription": "Requisition ID: 173774 Work Area: Software-Research Expected Travel: 0 - 10% Career Status: Professional Employment Type: Regular Full Time Career Level: T2 COMPANY DESCRIPTION As market leader in enterprise application software, SAP helps companies of all sizes and industries innovate through simplification. From the back office to the boardroom, warehouse to storefront, on premise to cloud, desktop to mobile device – SAP empowers people and organizations to work together more efficiently and use business insight more effectively to stay ahead of the competition. SAP applications and services enable customers to operate profitably, adapt continuously, and grow sustainably.  SAP Concur Travel’s Corporate Travel Booking solution powers more than $37 Billion in annual travel spend. Employees booked more than 36 million itineraries via the tool last year. Thousands of SAP Concur customers configure the SAP Concur Travel product in countess different ways. Making sense of an incredible volume of customer data is a huge challenge and an amazing opportunity.     In addition, there is a massive shift in global business travel spending, and China has recently overtaken the United States as the number one business travel market in the world. Travel product vendors globally are evolving their technology platforms and products for a more modern, complex world and a wide range of traveler types—both corporate and leisure.     In this role, you will directly contribute to the success of SAP Concur Travel by leading analyses and providing business insights to support the data-driven decision making. You will report to the Sr Director of Product Management – Travel, and partner with stakeholders across the organization, external partners, and SAP Concur clients to drive business results. You will work across product teams globally to assess the success of our existing products, identify areas for improvement, and help shape the product roadmap. You will be part of a very diverse, engaged, and fun team that is driving major innovations in an industry that is becoming increasingly more complex.    In the first 12 months you will deliver:   SAP Concur Travel Dashboards and Reporting System: You will partner with the Concur Business Intelligence and data systems team to measure and drive Concur Travel product activity and the successful delivery of new features. You will sustain and improve the OBT product team’s ability to quantify the value of our product and zero in on problem areas and opportunities to add value.SAP Concur Travel Online Booking Tool product support: You will work with the SAP Concur Online Booking Tool product team to understand their businesses, identify their analytics needs, and provide an analytics roadmap to support their decision making with custom analysis. The SAP Concur Online Booking tool has an exciting product roadmap with global analytics opportunities including advanced web analytics on a global scale with millions of user sessions weekly, perhaps the largest, richest database of global corporate travel patterns in the world, access to industry data, and a constant stream of quantitative and qualitative customer feedback.   In order to accomplish this you will need to:Partner with stakeholders to understand the problems they’re trying to solve, and structure analyses to address their business needs. The successful candidate will have excellent business acumen and an ownership mindset. We are not looking for an order taker who will produce data without first understanding the business problem.Be able to independently extract data out of Big Data technologies such as Hadoop, and produce impactful analyses with clear, actionable business insights. You are able to synthesize complex analyses and communicate succinctly with internal and external stakeholders at all levels of the organization.Have a strong attention to detail, high standards when it comes to data quality, and the ability to discover, cleanse and merge data across disparate data sources.   Qualifications: Bachelor’s Degree in a quantitative field (e.g. Finance, Economics, Mathematics, Statistics)Proven track record (5+ years) leading successful Analytics projects that help drive business and product decisions in a fast paced and complex environment.Excellent data analytics skills using Big Data technologies such as Hadoop, Hive SQL, and Oozie. Python, Spark, and/or Jenkins a plus.Excellent reporting and data visualization skills ideally with Tableau and Excel.Excellent communication skills and the ability to effectively communicate complex analyses to internal and external stakeholders at all levels.Industry experience in hospitality and travel is a plus.Positive attitude and a team player with a “roll up your sleeves” mindset.   SAP'S DIVERSITY COMMITMENT To harness the power of innovation, SAP invests in the development of its diverse employees. We aspire to leverage the qualities and appreciate the unique competencies that each person brings to the company.  SAP is committed to the principles of Equal Employment Opportunity and to providing reasonable accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team (Americas: Careers.NorthAmerica@sap.com or Careers.LatinAmerica@sap.com, APJ: Careers.APJ@sap.com, EMEA: Careers@sap.com). Requests for reasonable accommodation will be considered on a case-by-case basis. EOE AA M/F/Vet/Disability: Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, gender, sexual orientation, gender identity, protected veteran status or disability. Additional Locations :apply now"}