{"jobID": "2694147446", "jobLocation": "Mountain_View_CA", "jobTitle": "Junior Data Analyst (Contract)", "companyRating": "3.3", "companyInfo": {"Website": "www.mozilla.org", "Headquarters": "Mountain View, CA", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Nonprofit Organization", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Apple, Microsoft, Google"}, "estimatedSalary": "88000", "jobDescription": "TheRoleBased in Amsterdam (The Netherlands) remote candidates in European countries will also be considered and a flexible (including part-time) working schedule is negotiable. You should have the right to work in the Netherlands under Dutch taxation and labour regulations.  Do you want to explore massive, unruly data corpora from a variety of angles? Are you a strong believer in rigorous scientific methodology? Do you want to work on the boundary between application-focused research and academic pursuits?  As a supporting analyst in the Intelligent Systems group you will support the team of researchers and engineers by actively participating in structuring and analysis of data derived from both exploratory/observational studies and structured interventional studies. You will be responsible for data cleaning, report generation, dashboard development, and communication of experimental findings both internally and externally.You will learn about experimental design and be involved in the reviewing of meaningful academic literature as it relates to ongoing research projects.KeyResponsibilitiesinclude:Support the effective creation, management and use of their data to resolve business problems.Responsible for data quality, the improvement of data to meet the defined specifications and the analysis of data or the creation of statistics to support business delivery, development or change.Data pre-processing and filtering to reduce data messiness for downstream analysis.Visualising multivariate mixed-type data and reporting on aggregate properties of experimental payloads via custom-built dashboards.Collaborating on reporting strategy and dissemination of findings in an industry and academic context.Contribute to the preparation of scientific manuscripts for dissemination at international conferences and publication in academic peer- reviewed journals.Skills&ExperienceA degree in a relevant subject (computer science, mathematics / statistics) or experience in a comparable role.You will have the ability to expertly perform data capture, creation and manipulation across a variety of specific datasets.Experience of delivering data extraction and manipulation based on defined requirements and be able to build, manage and utilise data.Strong quantitative analysis skills and keen analytical abilities, some experience with one or more statistical computing packages/environments (Matlab, Python, or R)Methodical and systematic way of working.Excellent communication (written, oral, and presentation) in English; experience with formal scientific writing and publication in peer reviewed journals a plus.You may have experience of the following: Associate Data Analyst, Junior Data Analyst, Graduate Analyst, Data Analyst, Database, Data Administrator, Database Analyst, Microsoft Office, Excel, Access, Database Administrator, Geographic Information Systems, Data Modelling, DBA, Data Handling etc.TheTeamThe Mozilla Intelligent Systems group performs fundamental and exploratory research into the nature of the World Wide Web and the interaction between people and web technologies.TheCompanyMozilla is a global technology nonprofit super-powered by a worldwide group of volunteers, and with a mission to ensure the Internet is a global public resource open and accessible to all. We drive impact through our products, technology and people by advocating for individuals’ online lives and on their behalf for the health of the Internet. We are engineers, designers, makers, and problem solvers.  To be part of the team, we ask that you be technically curious, capable, always passionate about learning more, and excited to be moving the Mozilla mission forward.  Mozilla isn’t just a great place to work; it’s an experience you’ll carry with you throughout your career.  We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, colour, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}