{"jobID": "2606003400", "jobLocation": "Mountain_View_CA", "jobTitle": "Sr. Software Engineer - Cloud", "companyRating": "3.6", "companyInfo": {"Website": "www.egnyte.com", "Headquarters": "Mountain View, CA", "Size": "201 to 500 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Dropbox, Box, Hightail"}, "estimatedSalary": "122000", "jobDescription": " Sr. Software Engineer - Cloud (Mountain View, CA - USA)  About Egnyte:  Egnyte a leader in the Gartner Magic Quadrant for Enterprise File Share and Synchronization, allows organizations to connect, protect, and unlock value from all their content. Our Content Intelligence platform delivers smart  content collaboration and governance in the cloud or on-premises to thousands of businesses around the world in even the most regulated industries. Founded in 2007, Egnyte is privately held and headquartered in Mountain View, CA. Investors  include venture capital firms, such as Google Ventures and Kleiner Perkins Caufield & Byers, as well as technology partners, such as CenturyLink and Seagate Technology. Position Description: We store multibillion files and multiple petabytes of data. We observe more than 2K API request per second on average as per New Relic. To make that possible and to provide the best possible experience, we rely on great engineers. For us,  people who own their work, from start to finish, are integral. Our engineers are part of the process from design, to code, to test, to deployment and back again for further iterations. You can, and will, touch every level of the code depending  on the day and what project you are working on.  We’re looking for a passionate Lead Software Engineer to join our world class Engineering team and help take Egnyte Architecture to the next stage of exciting and rapid growth. We have re-architected our core layers multiple times to meet  the ever increasing scale demands. The ideal candidate should be able to take a complex problem and execute end to end, in this process they would work with product managers, engineers, and our CTO to come up with a solution and implement  it or with the help of other members. Responsibilities of the ideal candidate would involve doing all of the above things that current engineers do and bring fresh ideas based on experience to do them better.  Engineers work on game changing features that are used by millions of people every day. Specific Responsibilities will include: Design and develop highly-scalable elastic cloud architecture that seamlessly integrates with on-premises systems.Challenge and redefine existing architectural fundamentals in order to provide next level of performance and scalability; ability to foresee post-deployment design challenges, performance and scale bottlenecks.Work with multi-cultural, geographically distributed teams and closely coordinate with cross-functional teams in multiple time zones.Deliver enterprise-grade products to customers and continuously work with engineering team to refine products in the field.Mentor interns and junior engineers, collaborate with Operations, and work closely with CTO on roadmap items.Extensive penetration testing to ensure security across a hybrid deployment between public/private cloud.Monitor and manage 700+ nodes using modern DevOps tools and APM solutions.Proactive performance and exception analysis.The successful candidate will need:Demonstrated success designing and developing complex systemsExpertise with multi-tenant, highly complex, cloud solutions. Experience with Hybrid and/or on premises solutions desired.Experience owning all aspects of software engineering, from design to implementation, QA and maintenanceExperience with the following technologies: Java, SQL, Linux, Python, Nginx, Haproxy, BigQuery, HBase, New Relic,Graphite, and/or PuppetData driven decision processRelies on unit testing instead of manual QAExperience in working with AWS or GCE is preferredKnowledge in DevOps techniques Please send your resume to jobs_engineering@egnyte.com add \"Sr. Software Engineer - Cloud\" in the subject line."}