{"jobID": "2535768601", "jobLocation": "New_York_NY", "jobTitle": "Public Sales Consultant", "companyRating": null, "companyInfo": {"Website": "www.dalecarnegie.com", "Headquarters": "Hauppauge, NY", "Size": "51 to 200 employees", "Founded": " 1912", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Franklin Covey, Miller Heiman Group, Development Dimensions International"}, "estimatedSalary": null, "jobDescription": " As a NYC Public Programs Sales Representative, you are developing client relationships by enrolling individuals in our public courses, converting leads and attending promotional events.  You enjoy phone and face to face sales and have a genuine desire to help companies and their people succeed. You use your consultative approach, enthusiasm and proven Dale Carnegie programs to meet the needs of our clients. We are seeking candidates with a business focus, high energy level, and strong work ethic. You bring a willingness to consistently work hard and we’ll provide you with the training and background that will propel you forward in your business career. What are the rewards of the job?Experience that will lay the foundation for a career in businessExtensive training from the global leader in performance improvementCompensation tied to your performanceWhat does the \"Day to Day\" look like?High outbound call volumeAttending promotional events in NYCProspecting for new clients and reactivating dormant accountsBuilding new business from within existing accountsRegistering individuals and teams into public seminars and coursesHandling inbound web leads from the internet and converting to conversationsWorking with the Corporate Sales Team to support organizational goalsRequirements4 year College DegreePrior sales, promotional or marketing representative experience is preferredFlexibility to work during the day and occasional eveningsComputer literacy – High degree of comfort with Word, Excel, PowerPoint, CRM – Salesforce, email and email management, normal web and internet functionality and useBenefitsManhattan based office, Dale Carnegie Training, NYC Center of ExcellenceDale Carnegie Training Sales Academy development processProfessional development through Dale Carnegie training programsEligibility to attend Annual Sales Convention401K planMedical & Dental plansCompensation PlanSalary, commission and bonus planAbout Dale Carnegie Training: At Dale Carnegie, we help you see yourself in a whole new light, building courage and confidence as we polish the unique strengths that help you achieve more in every part of your life.  Our programs will help you communicate in a way that’s truly electric, allowing people to see the most intelligent, trustworthy and irresistible parts of your character. As you draw people in, forming more meaningful, authentic and lasting relationships, you’ll uncover even more opportunities for growth –from tackling new and different projects to taking on more responsibility to doing work that has the power to affect more people in more places.  We’ve helped millions of people make their mark on the world by changing the way they interact with it. Our approach has changed with the times, but our goal remains the same – ensuring that no one sees themselves the same way again."}