{"jobID": "2513527432", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist - Uber Eats", "companyRating": "4.3", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "141000", "jobDescription": " About Uber Were changing the way people think about transportation and logistics. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now were a part of the logistical fabric of more than 600 cities around the world. Whether its a ride, a sandwich, or a package, we use technology to give people what they want, when they want it. For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer. And thats just what were doing today. Were thinking about the future, too. With teams working on autonomous trucking and self-driving cars, were in for the long haul. Were reimagining how people and things move from one place to the next. About the role Are you interested in working at the intersection of applied quantitative research, engineering development, and data science? Do you have interest in developing and applying quantitative solutions related to Uber's uniquely challenging problems? If so, then this is the job for you. About the team Uber Eats Data Scientists help solve the most challenging problems related to Uber's ambitious and rapidly expanding on-demand food delivery business. These fascinating and difficult problems include personalized search and recommendation for restaurants and dishes, travel and food preparation time prediction, text mining and natural language processing, demand and supply forecasting, growth and spend optimization, dynamic pricing, dispatch and routing optimization, and many more. To solve these problems, data scientists leverage unique data sources diverse in both geographical and temporal dimensions and in both structured (data from app sessions, trips, etc.) and unstructured (menu descriptions, food photos, support contacts, etc.) forms. Since Uber Eats Data Scientists focus on the mathematics and engineering related to optimizing the growth and economics of Uber's logistics delivery marketplace, particular preference is given to candidates with backgrounds in AI & Machine Learning, Statistics, Operations Research, Economics, or similar. What you'll need We are looking for people with advanced quantitative degrees who are comfortable enough with research methodologies that they can address abstract business and product problems with extreme precision, and who have the enthusiasm and initiative necessary to deliver those answers at Uber's fast pace. You should also have demonstrable programming skills and be comfortable with engineering development process. Prior research, data science modeling, or engineering experience in the aforementioned domainsSuperb quantitative background: Graduate degree required and PhD preferredFamiliarity with technical tools for analysis - Python (with Pandas, etc.), R, SQL, etc.; previous software engineering background a plusResearch mindset with bias towards action - able to structure a project from idea to experimentation to prototype to implementationPassionate and attentive self-starters, great communicators, amazing follow-through - you have a great work ethic and love the responsibility of being personally"}