{"jobID": "2803080948", "jobLocation": "New_York_NY", "jobTitle": "Senior Data Engineer - Infrastructure", "companyRating": "3.3", "companyInfo": {"Website": "www.wework.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "177000", "jobDescription": " Data is at the core of our business, providing insights into the effectiveness of our products and enabling the technology that powers them. We build and operate the platform used by the rest of the company for streaming and batch computation and to train ML models. Were building an ecosystem where consumers and producers of data can depend on each other safely. We thrive to build high quality systems we can be proud to open source and an amazing experience for our users and ourselves. We regard culture and trust highly and are looking forward to welcoming your contribution to the team.  If youre passionate about building large scale data processing systems, and you are motivated to make an impact in creating a robust and scalable data platform used by every team, come join us. You will jump into an early stage team that builds the data transport, collection and orchestration layers. You will help shape the vision and architecture of WeWork's next generation data infrastructure, making it easy for developers to build data-driven products and features. You are responsible for developing a reliable infrastructure that scales with the companys incredible growth. Your efforts will allow accessibility to business and user behavior insights, using huge amounts of WeWork data to fuel several teams such as Analytics, Data Science, Sales, Revenue, Product, Growth and many others as well as empowering them to depend on each other reliably. You will be a part of an experienced engineering team and work with passionate leaders on challenging distributed systems problems.Responsibilities"}