{"jobID": "2619107977", "jobLocation": "Redwood_City_CA", "jobTitle": "Software Engineering Intern", "companyRating": null, "companyInfo": {"Website": "www.alation.com", "Headquarters": "Redwood City, CA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Alation was founded in 2012 when a PhD engineer from Google, a designer from Apple, and an executive from Oracle teamed up to help people to connect with the data they need. Today, our team consists of creators and communicators with varied backgrounds. From Stanford and Cal, big companies and one-man startups, the United States and abroad, we all came together to work toward a shared vision of a world where informed decision-making is the norm -- we are incredibly driven to make data more accessible in every industry.We’re based in sunny Redwood City, CA and funded by top investors like Andreessen Horowitz, Data Collective, and Costanoa Venture Capital. Our customers include some of the world’s largest organizations, with thousands of employees and petabytes of data.What we are Our team is a group of intelligent, hard-working, and fun people with diverse backgroundsOur product consists of a solution for people to find, understand, use, and govern dataOur system runs smart algorithms to organize data from diverse sources and deeply analyzes their semantics and usageWhat we are NOT A database or cloud computing companyA business intelligence companyA consulting companySome of the things you will be doing include... Be constantly challenged by tough engineering and design tasks.Be hungry to learn and take on responsibilities.Have lots of fun with your colleagues, in and out of the office.Have an impact on our product and users and be recognized it.You should have… (in no particular order) At least two years toward your degree in Computer Science or related subjects.Knowledge of algorithms, data structures, and data modeling / management.Some experience building data-driven web apps.Proficiency in Python, Java, or Javascript.A desire to participate in a fast-paced and intense startup environment.Curiosity about different areas of software engineering and a willingness to leave your comfort zone.If you resonate with our mission, want to work on challenging problems, have fun, and create products with a broad and positive impact, come join us for an exciting summer!"}