{"jobID": "2826173700", "jobLocation": "San_Francisco_CA", "jobTitle": "Intern - Pride", "companyRating": null, "companyInfo": {"Website": "www.phf.org", "Headquarters": "Washington, DC", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Heluna Health invites applications for the position of Pride Intern for the Pride Engagement Program (PEP) in the Population Health Division (PHD) of the San Francisco Department of Public Health (SFDPH). Project Pride is a 3-year demonstration project funded by the CDC to increase awareness and the uptake of PrEP in San Francisco. Project Pride is responsible for reaching African American MSM, Latino MSM, and Trans Females in San Francisco. To date, Project Pride has been involved in several community and cultural events to reach priority audiences.  PHD is committed to attracting a diverse workforce that is reflective of the populations served by our Department and one of several critical steps that organization must take to achieve health equity. To achieve this goal, SFDPH has created the Pride Engagement Program which offers a flexible internship program to allow individuals at different stages of training to spend time with talented public health professionals and gain practical experience. We are seeking students in public health or a related field, or individuals with significant lived experience and a desire to learn more about potential careers in public health as trainees.  The Pride Engagement Program ultimately aims to increase the number of public health professionals from under-represented communities, including minority racial/ethnic groups (especially Black/African Americans, Latinos, Native Americans, and natives of Alaska, Hawaii, and the US Pacific Islands), persons with disabilities, persons from disadvantaged backgrounds, and persons from lesbian, gay, bisexual, and transgender (LGBT) communities. Individuals from these backgrounds are strongly encouraged to apply.  This is a grant-funded, Full time, 3 month temporary and non - benefited position. Employment is provided by Heluna Health. ESSENTIAL FUNCTIONS In 2018, PEP is partnering with mentors in the Population Health Division to work with intern scholars who may be interested in pursuing programmatic and evaluation-focused projects such as the following: Under the mentorship of Mikael Wagner, a trainee (in public health or related field) will assist in the review and evaluation of Project Prides informational materials on PrEP for Trans-identified communities. The essential duties will be to conduct semi-qualitative interviews with this community, to pilot and administer a community survey, to enter data into a database, to conduct analyses under the guidance of the mentor, and to summarize results, while providing recommendations on improving PrEP messaging and outreach initiatives to Transgender communities. In addition to these duties, trainees will have the opportunity to attend HIV- and sexual health- focused seminars as well as professional development workshops and networking events hosted by CLI and the Summer HIV/AIDS Research Program (SHARP). Clinical shadowing opportunities may be available for those interested. Everyone will be asked to participate in health equity scholar program evaluation activities. NON-ESSENTIAL FUNCTIONSOther duties as assignedMINIMUM QUALIFICATIONSA high school diploma or GED equivalentFor undergraduate students: enrolled in an undergraduate or certificate program in a biological, health science or social science field (or intended major) at a U.S. accredited college or university; orWork, volunteer, or life experience working with communities that are highly affected by HIV, or other diseases/health issuesDESIRED QUALIFICATIONSKnowledge of and sensitivity to diverse communities, particularly communities of color and gay/lesbian/bisexual/transgender communities and those most affected by HIVKnowledge of and sensitivity to issues related to HIV prevention, HIV care, and stigma and discrimination faced by persons living and affected by HIVExcellent verbal and written communication skillsDemonstrated ability both to take individual initiative and to collaborate effectively on teamsExperience and/or coursework in research and evaluation methods such as conducting focus groups, surveys, statistics, and program evaluation are desired, but not required.PHYSICAL DEMANDS Stand Frequently  Walk Frequently  Sit Frequently  Handling / Fingering Occasionally  Reach Outward Occasionally  Reach Above Shoulder Occasionally  Climb, Crawl, Kneel, Bend Occasionally  Lift / Carry Occasionally - Up to 50 lbs  Push/Pull Occasionally - Up to 50 lbs  See Constantly  Taste/ Smell Not Applicable  Not Applicable Not required for essential functions  Occasionally (0 - 2 hrs/day)  Frequently (2 - 5 hrs/day)  Constantly (5+ hrs/day) WORK ENVIRONMENT General Office Setting, Indoors Temperature Controlled APPLICANT PROCEDURE Interested individuals should submit a resume and cover letter for consideration.  All qualified applicants will be considered for this position in accordance with the San Francisco Fair Chance Ordinance.  Heluna Health is an Affirmative Action, Equal Opportunity Employer that encourages minorities, women, veterans, and disabled to apply. "}