{"jobID": "2831090793", "jobLocation": "Revere_MA", "jobTitle": "Receiving/Inventory Supv", "companyRating": null, "companyInfo": {"Website": "www.bjs.com", "Headquarters": "Westborough, MA", "Size": "10000+ employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Costco Wholesale, Sam's Club"}, "estimatedSalary": null, "jobDescription": " BJ's Wholesale Club was the first retailer to introduce the warehouse club concept in the northeastern United States. Today, we’re a multibillion dollar operation with more than 200 clubs in 16 states from Maine to Florida.  While our Members know us for helping them save up to 25% off grocery prices every day, our Team Members love us for providing a supportive and engaging workplace that’s committed to developing great talent.  If you’re a motivated and enthusiastic person who enjoys working collaboratively and is committed to providing great service for our Members, we want to hear from you. BJ’s offers a fast-paced, team environment with great training opportunities and competitive salary and benefits packages to help you succeed. RECEIVING & INVENTORY CONTROL SUPERVISOR Responsible for the supervision of the receiving department. Ensures the receipt and disposition of merchandise and inventory in the club, including processing paperwork, verifying merchandise, comparing receipts against purchase orders, and checking for damaged products/concealed shortages. Makes sure policies and procedures are followed within the department. May lead a team of Receivers and/or DDR Clerks. Maintains the operations of the receiving department, including matching received inventory against purchase orders and reviewing discrepancies in received inventory.Processes inbound and outbound shipments. Ensures all product pricing and signage is displayed.Ensures radio frequency (RF) guns are used when receiving merchandise.Makes sure all receiving paperwork is complete and accurate.Separates pallets and verifies that pallets are in the correct selling or non-selling location.Supervises Receivers and/or DDR Clerks. Acts as a mentor to team members in the receiving/inventory control department. Reports any issues to management.Processes damaged/defective merchandise, including hazardous materials.Completes receiving documents and other daily reports.Maintains all club policies and procedures.Performs other duties as assigned, including working in other departments as needed.Requirements:Supervisory experience preferred.Prior experience working in a big box receiving environment preferred.Computer skills preferred.Job Conditions:Majority of the time is spent moving about continuously on hard surfaces. There may be a need to frequently position oneself to examine or scan merchandise, including bending, climbing, crawling, handling, pulling, reaching, and/or stooping.Continuously requires lifting objects up to 30 pounds. May require lifting and moving heavy and/or awkward objects more than 30 pounds with assistance.Usually in a comfortable environment surrounded by moving machinery and/or loud equipment that may require shouting in order to be heard. There may be occasional exposure to cleaning agents. BJ's Wholesale Club is committed to a policy of equal employment opportunity for all qualified team members and applicants for employment without regard to race, religion, color, sex, sexual orientation, age, ancestry, national origin, physical and/or mental disability, genetic information, atypical cellular or blood trait, marital and/or familial status, pregnancy, gender identity and expression, military or veteran status, or any other characteristics protected by applicable law."}