{"jobID": "2754728451", "jobLocation": "Seattle_WA", "jobTitle": "Game Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.bigfishgames.com", "Headquarters": "Seattle, WA", "Size": "501 to 1000 employees", "Founded": " 2002", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Zynga, DoubleDown Interactive, King"}, "estimatedSalary": "70000", "jobDescription": "Come Play Since its founding in 2002, Big Fish has been the worlds largest producer and distributor of casual games, with titles which continuously land us at the top of app store charts. Big Fish is home to six individual studios, each with its own unique style of game-play. Together, were united under a common goal: to produce and develop the very best in mobile gaming and bring fun and entertainment to our millions of customers across the globe! The Mission Big Fish is seeking a skilled, positive, and passionate Data Analyst to join the Triton Studios team! The successful candidate enjoys combining analytic skills with business acumen to provide the game team peers with the data and insights that will drive our success. The Data Analyst works with key decision-makers on a daily basis as a data-driven advisor and partner on strategic issues. The candidate should enjoy both working with people and performing technical analyses.Responsibilities include:Work alongside the game development team to help define and recommend KPI'sMonitor and provide reporting from key metrics across mobile social gamesDevelop new insights and analyses that inform decisions and help us continue to improve gameplayAnalyze game-specific data and pro-actively make recommendations to Product Managers, Game Producers, Game Designers and UX DesignersDevise and run game-specific A/B tests to directly and indirectly drive KPI improvementsRequired experienceBachelor's degree or equivalent work experience in Computer Science or related discipline such as Statistics, Mathematics, Economics, etc.3+ years of prior data analysis experience2+ years of prior experience creating, maintaining, and optimizing (SQL) reporting ETL'sAbility to change directions quickly based on business, project, and team needsAbility to effectively communicate complex findings and ideas simplyAdvanced SQL experience with ability to work on large scale datasetsDrive quality improvements of team's code through reviews and feedbackExperience using descriptive and inferential statistics to analyze and present findingsExperience using visualization techniques for presenting data and analysisExperience working with business teams to identify and define problemsBonus PointsExperience in mobile products and games industryExperience building Tableau dashboards and visualizationExperience working with data in Python, R, or SparkScripting for ETL development and automationWorking knowledge of relational and dimensional data modelsWant to discover more about life at Big Fish? Check us out on TheMuse.com. Be the next Big Fish in the Pond!"}