{"jobID": "2684844208", "jobLocation": "New_York_NY", "jobTitle": "Data Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.cbre.com", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " 1906", "Type": " Company - Public (CBRE) ", "Industry": " Real Estate", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "110000", "jobDescription": "We are a former real estate startup, acquired by CBRE in 2017. We are uniquely positioned within the organization to access global data, tools, resources, and leaders throughout the industry. We have the stability of secure backing and the freedom to explore and experiment to develop leading-edge products. For more information about our team, please visit http://www.floored.com.  We’re problem-solvers at our core. Audacious. Enterprising. But most of all, humble. True to our values, we appreciate anyone who shares our drive to create. Our greatest strength is our collective talent.  As a team, we’re changing the way commercial real estate gets done. Responsibilities:Analyzing proprietary commercial real estate data on availabilities, lease rates, and market statistics to identify trends and opportunitiesRefining predictive models for space estimation and time-forecasting for capacity planningEmpowering user research and improving customer engagement through development and analysis of user metricsArchitecting data models and developing ETL functions to move data between RDMBS and NoSQL storesLeveraging machine learning and data mining to take multiple streams of data and create novel customer experiencesAutomating manual processes to generate data like lease availabilities and floor plan layoutsWorking closely with our heads of Product and Engineering as well as team leads across the company to address a wide variety of business problemsIdentifying new approaches and tackling ambiguous problems with creativity and improvisationRequirements:Smart, productive and tolerant of sarcasmSelf-motivated and curious, crafty and drivenInterested in building a friendly, collaborative, and transparent work environmentProgramming experience in Python, Julia, Torch (Lua), or other programming languages/frameworksBachelor's degree in a related field or equivalent work experienceMinimum of 2-3 years of relevant experience requiredWhy work at CBRE Build:Great team - Diverse. Smart. Nice. We like to always keep learning.High impact - We’re a small team with a global reach in a trillion dollar industry.Growth and development - We invest in employee development. Time to explore. Machine shop with a laser cutter and 3d printer. Funding for education, conferences, etc.Benefits - Unlimited vacation. Flexible work hours. Work life balance. Health, vision, dental for employees and their dependents. 401k plan with a 3% match."}