{"jobID": "2829518913", "jobLocation": "San_Jose_CA", "jobTitle": "Field Service Technician - Doors / Windows", "companyRating": null, "companyInfo": {"Website": "www.vpiwindows.com", "Headquarters": "Spokane, WA", "Size": "201 to 500 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "ABOUT VPI:At VPI Quality Windows, we believe in producing a product that exceeds the standards of our customers. Our vinyl windows and doors are designed to meet the needs of commercial customers around the nation.As important as the quality of our product is the satisfaction of our employees. We strive to demonstrate the values of Safety, Integrity, Respect, Excellence, Personal Growth and Family. While we understand the needs of running a successful business, we also recognize that the employees are what make us successful.BASIC FUNCTION:This position is responsible for working in conjunction with the Warranty Service Coordinator to ensure product complaints and service requests are resolved effectively and efficiently while providing exceptional customer service.PRINCIPAL JOB DUTIES & RESPONSIBILITIES:Actively support and participate in company’s safety and health program.Perform in-field service repairs, evaluations and inspections.Accurately diagnose and report all product faults, failures and errors.Provide professional and timely communication to VPI’s customers and internal support staff.Complete clear and concise reports and other service documentation in order to facilitate timely closure of all service requests.Manage and maintain company assets, including company vehicle, tools, office equipment.Travel out of state occasionally for multiple nights. 10 %Water testing/ inspection, investigation and diagnosisOver the edge trainingWORKING CONDITIONS:Exposure to weatherLifting up to 75 pounds on a regular basis.Heights above 50 feetSCHEDULING:This position is regularly scheduled for 40+ hours per week, Monday through Friday (hours vary) with occasional Saturdays and overtime as required.REQUIRED SKILLS AND EXPERIENCE:Skills:Valid driver’s license and excellent driving recordVinyl window and door product knowledge or previous experience working in the construction industryExceptional math skills and the ability to apply spatial relationships in a practical applicationSelf-motivated and works efficiently with little supervisionAble to effectively solve problems as they ariseDemonstrated customer service skillsClear and concise communication skillsAbility to perform several tasks concurrently with ease and professionalism.Previous experience using Microsoft programs.Experience:High School Diploma or GED.1 year of job related experience and/or training is preferred."}