{"jobID": "2806322734", "jobLocation": "Rockland_MA", "jobTitle": "Data Analyst - Programs", "companyRating": "3.3", "companyInfo": {"Website": "www.noblesupply.com", "Headquarters": "Rockland, MA", "Size": "51 to 200 employees", "Founded": " 1982", "Type": " Company - Private", "Industry": " Aerospace & Defense", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " SAIC, Lockheed Martin, ADS"}, "estimatedSalary": "49000", "jobDescription": "Noble Supply & LogisticsAre you looking to join a Dynamic Fast-Growing Company with an Entrepreneurial Feel? If you’re prepared to take your Career to the next level. Apply today and Join Us!!!!Company profile Noble Supply & Logistics streamlines the procurement process for government using state-of-the art technology to deliver a huge selection of materials, supplies and services to the DoD and Federal Government agencies. Our contracts with the U.S. Federal Government give us the opportunity to distribute millions of trusted, brand-name items to military and civilian government customers. We operate in 26 global locations and process 225,000 task orders annually utilizing our network of 11,000 suppliers and service partners. We proudly serve the U.S. Army, U.S. Navy, U.S. Marine Corps, USCG, USAF, FEMA and civilian government agencies. We provide mission-essential products including industrial and MRO supplies, construction materials, personal protective equipment, office supplies and furniture, military & law enforcement gear and emergency preparedness supplies and deliver them across the globe. Noble’s customized services include supply chain management, logistics support, storefront operations on military bases, disaster relief support and hazmat logistics. We are a team of individuals who take pride in our work, our community and building relationships with our customers and business partners. Employees have a true sense of the value of their contribution. They know their work directly supports our nation’s war-fighters, its emergency response to natural disasters, and many other diverse needs of the DoD and U.S. Federal Government. We take pride in our company, our community, and our nation and feel a sense of personal and professional satisfaction dedicating ourselves to work that really matters. Work with Program Managers to analyze customer and competitor procurement data for each of Noble's Federal and State & Local contracts.Provide intelligence that can be leveraged to adjust offers, pricing and competitive startegies to keep, grow and expand exisiting business and take competitor share.Align efforts and work cooperatively with marketing, pricing, vendor relations and the G-Commerce operations team to effectively support the Program Manager in implementing and measuring solution results.Requirements3+ years proven experience mining and analyzing customer, company and competitor sales and performance data.Provide support and technical expertise to Program and Sales Managers to deliver year over year revenue and operating earning growth and achieve plan.Must be proficient in Netsuite ERP, Data Analysis techniques, Excel, Tableau, Wrike and Salesforce CRM.Benefits Medical, Dental, Life, LTD, 401k & PTO."}