{"jobID": "2725178389", "jobLocation": "Seattle_WA", "jobTitle": "Marketing Data Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Catalysis is more than just a digital agency. We are a tight knit group of technically capable experts who share a passion for creativity and innovation within our digital world! We are currently seeking a Marketing Data Analyst to support our agency in the planning, design, and performance of descriptive and statistical analyses as they relate to our clients’ specific marketing objectives.  We enjoy a casual, dog-friendly culture, and are located in a unique historic building in Seattle’s Capitol Hill neighborhood. Smart, inventive co-workers are helping the company grow to national recognition and you could be part of it! Essential Duties include: Statistical Analysis Understand client business needs, design data structures and attribute implementations, and select analyses that are consistent with project goalsIdentify the proper unit of analysis (individual, segment, population) and perform statistical and data mining analyses to support our clients’ marketing objectivesValidate data, specify data transformations, and work closely with multiple internal teams to ensure that we have actionable data for analyses and reporting to support our clients' strategic and tactical directions Descriptive Analysis Develop test plans for accurate and statistically valid reporting and conduct quality tests of measurement results for online initiativesMake optimization recommendations based on analyses to support integrated campaign strategy, including targeting and response measurement, email performance, local search, and banner advertisingPerform advanced analyses to identify KPIs and drivers of customer behaviorPossess the ability to lead and motivate everyone working on a project with well-thought-out ideas and directionThe successful candidate will be naturally inquisitive, able to work both as a team member and independently, thoughtfully react to evolving client requirements, and be able to deliver sound conclusions based on available data, results, outside research, and other documentation. Qualifications include:Bachelors or Masters in an analytical disciplineFour or more years of experience in marketing analytics with a command of the terminology, methods, strategy, fundamental metrics, and the role of data in optimizing campaignsUnderstanding of basic and advanced data and analysis conceptsExperience with Microsoft data repositoriesCompetency in a some of the following tools: SQL, SPSS, SAS, Power BI, Data Modeler, Marketo, ExactTarget, SFMC, Webtrends, Google Analytics, Omniture, InsightExperience with reporting on complex projects involving multiple response groups under a variety of treatments, or A/B testing experienceDemonstrated client service excellence and the ability to adapt to changing circumstances while achieving results with accuracy and precisionProven track record of formulating and testing hypotheses that maximize business value for the clientExperience transforming data into a form suitable for the desired statistical or data mining analysis"}