{"jobID": "2683361739", "jobLocation": "San_Jose_CA", "jobTitle": "Construction Lead Estimator", "companyRating": null, "companyInfo": {"Website": "www.henselphelps.com", "Headquarters": "Greeley, CO", "Size": "1001 to 5000 employees", "Founded": " 1937", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Lead Estimators are responsible for the development of CSI Division and Uniformat estimates and all estimating forms and formats for both the conceptual estimate and final bid. They are responsible to the Senior Estimator for the development of pricing strategies and specific purchasing methodology for major projects. It is the responsibility of the Lead Estimator to develop a working relationship with subcontractor principals and estimating departments. Lead Estimators support the development of all conceptual estimates for design-build and guaranteed maximum price projects as well as help put together bids for Design-Bid-Build projects.  \",\"PositionRequirements\":\"Essential job functions include: Estimate key scopes on major projectsLead estimates on smaller projectsExhibit good communication and meeting skillsDevelop strategies to gain an advantage on their estimatesIdentify risk and address during the procurement processEnsure a complete scope has been captured during the estimating processAble to survey and price all self-work items (concrete, rough carpentry, building specialties)Proficiency   in computer skills. Able to adapt and learn programs such as On Screen  Take-Off, Building Connected, SAGE and AssembleConduct estimate reviews on smaller projects for executive managementDevelop and maintain subcontractor and supplier relationshipsPersonnel evaluation and development Preferred qualifications: Possess good communications skills and be detail orientedBasic knowledge of UNIFORMAT and conceptual estimating processComputer software - Microsoft Office Suite, specifically Excel based templatesMinimum of 3-4 years’ experience in estimating on large commercial construction projects \",\"PositionNotes\":\"Hensel Phelps is an equal opportunity employer and contractor. All qualified applicants will receive consideration for employment without regard to their protected veteran status, nor will they be discriminated against on the basis of disability.  EOE AA M/F/Vet/Disability  Hensel Phelps will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with Hensel Phelps’ legal duty to furnish information."}