{"jobID": "2610568510", "jobLocation": "Seattle_WA", "jobTitle": "Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.gettyimages.com", "Headquarters": "Seattle, WA", "Size": "1001 to 5000 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "111000", "jobDescription": "Who You Are:We’re looking for a data scientist to connect people with striking visuals that fit their project and brand. You’ll evaluate large data sets through quantitative analysis, modeling, and visualization to help us build better data products and experiences for customers and content contributors. We’ve built a work environment that is highly collaborative and gives you the opportunity to develop creative solutions with the world’s best imagery.Our team is responsible for developing new products based on our data. These products span a wide-range of data science skill-sets: visual AI and analysis, natural language processing, recommendation engines, and experimental design. Your expertise in one or more of these areas will create the foundation for the new and exciting products we build.Your Next Challenge:Perform data exploration, statistical analysis, and modeling on how the world interacts with Getty ImagesWork with and develop state of the art visual models for image classification and recommendationPartner with product teams to understand customer needs and areas of opportunityDevelop data products that make it easier for our customers to find and license the best imageryPresent research and findings to senior management to help drive strategy What You'll Need:Advanced degree in a scientific (natural, social, computer) field or related area and/or 5 years of experience in a data science role.Deep understanding of machine learning algorithms and proven experience with neural networks.Strong coding skills in a statistical/modeling language including: Python/R/C++Your project portfolio has algorithms written in one of the following frameworks: Tensorflow/(Py)Torch/Keras/Caffe(2)Experience with distributed computing (Spark/Hadoop) and database technology/query languages (SQL/Hive/etc)Ability to collaborate closely with multiple teams across with a wide range of technical backgroundsCuriosity to bring technical solutions to challenges in the creative spaceStrong interpersonal skills#LI-MM1Who We Are:Getty Images is the world’s leader in visual communication, with over 170 million assets available through its premium content site www.gettyimages.com and its leading stock content site www.istock.com. With its advanced search and image recognition technology, Getty Images serves business customers in more than 100 countries and is the first place creative and media professionals turn to discover, purchase and manage images and other digital content. Its award-winning photographers and content creators help customers produce inspiring work which appears every day in the world’s most influential newspapers, magazines, advertising campaigns, films, television programs, books and online media.Visit Getty Images at www.gettyimages.com to learn more about how the company is advancing the unique role of digital media in communications and business, and enabling creative ideas to come to life. For company news and announcements, visit press.gettyimages.com, and for the stories, innovation and inspiration behind our content, visit Stories & Trends http://stories.gettyimages.com. Find us on Facebook at www.facebook.com/gettyimages and Twitter at https://twitter.com/GettyImages.Getty Images is an equal opportunity employer and strongly supports diversity in the workplace."}