{"jobID": "2728841084", "jobLocation": "Watertown_MA", "jobTitle": "Junior Data Analyst-- Internship", "companyRating": "4.2", "companyInfo": {"Website": "www.liaisonedu.com", "Headquarters": "Watertown, MA", "Size": "201 to 500 employees", "Founded": " 1991", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " HOBSONS, TargetX, CollegeNET"}, "estimatedSalary": "44000", "jobDescription": "Liaison, named to Glassdoor’s 2017 Best Places to Work, offers the following:A place to work with fun, smart, collaborative and driven people. Liaison is unique in that we are an established and profitable company but have that fast-paced energy and feel of a start-up. Our SaaS based admissions management software and services helps millions of students take the next step in their academic career and is utilized by over 5,000 academic programs!! We are looking for a Data Analyst to join our Product Management team to help turn our usage data into meaningful insights for our internal & external stakeholders. This person will be responsible for the end to end delivery of these insights, including understanding the business need & context, developing the data queries, performing the analysis & presenting visualizations that help communicate the insights. This is an opportunity to make an immediate impact, as you’ll be working directly with the customers to deliver the data critical to their organizations success. What You'll Do Here:Form a deep understanding of Liaisons strategic goals and the goals of our partner organizationsAnalyze digital platform data and usage characteristics to create actionable insight and tangible business valueConduct ad hoc analyses for special projects as neededCollaborate with key business unit stakeholders product managers, and software engineers to define high quality, synthesized outputSynthesize analyses and present findings to management at multiple levelsWork with Analytics partners to identify new opportunities to enhance the overall performance of the teamSkills You Will Need Here:Minimum of 1-2 years of experience working on data analysis, modeling and reporting systems (can be academic experience)Strong academic background & achievement requiredStrong understanding of data analysis tools (including SQL) and techniques with experience working with Business Intelligence (BI) platforms to deliver synthesized reports and data-driven insightsComfortable wearing multiple hats working across the organization including working with end-users to define pain points/critical data needs and working with engineers/developers to identify and access necessary source dataStrong writing and verbal presentation skills, enabling her/him to prepare and present information and recommendations to a broad and diverse audienceAble to self-manage progress and deliverables with a high degree of accountability and personal urgencyPersonal Attributes:High degree of accountabilityHighly analyticalComfort with and eagerness to tackle ambiguous problemsInterest and/or previous experience in education and/or software is a plusStrong interpersonal skills with ability to build working relationships with all levels of management and stakeholders"}