{"jobID": "2672226502", "jobLocation": "San_Francisco_CA", "jobTitle": "Installation/Service Technician", "companyRating": "3.3", "companyInfo": {"Website": "security.kastle.com", "Headquarters": "Falls Church, VA", "Size": "201 to 500 employees", "Founded": " 1972", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Datawatch, Genesis Securities, Tyco"}, "estimatedSalary": "13", "jobDescription": " Kastle Systems is the leader in managed security, with a track record of introducing innovative technologies to serve over 460M square feet of real estate globally. Clients span the commercial and multifamily real estate, education, and construction industries and the customers they serve. With delivering a world class customer experience driving everything we do, Kastle’s mission is to be our customers’ best service provider and to make their security the most effective, efficient, and convenient it can be. Kastle's integrated security solution, including access control, video, and remote video monitoring, significantly reduces costs and improves the critically important 24x7 performance for building owners, developers and tenants.  The Installation/Service Technician will install, test, troubleshoot and repair all aspects of our security systems including access control, Intercom, phone, and IP video systems at customer sites. To that end, the Service Technician interacts directly with the client, client representatives, other contractors and Kastle personnel to ensure a successful service and repair solutions. The Service Technician will ensure that service orders are completed accurately and on time, and that these services meet or exceed client expectations. Install, service and repair Kastle access control, security components and IP Video Systems.Interface with customers to insure their complete confidence in the Kastle System.Verify completed work is documented accurately and consult with manager to resolve discrepancies.Maintain companyowned vehicles, tools, equipment and individual tool issue.Maintain and protect building keys to customer buildings.REQUIRED ACCREDITATION:Five years of experience in the alarm, access control, IP Video and Networking.Work history must display stability and consistent attendance.Demonstrated ability to accept responsibility and carry out assigned tasks with limited supervision.Knowledge of building codes pertaining to construction, fire and electrical systems.Ability to read and interpret wiring diagrams.Experience and or knowledge of AMAG and Genetec systemsREQUIRED SKILLS AND ABILITIES:Networking, Computers, Alarm systems, Access Controls and CCTV.Aptitude in basic programming.Able to be on a 24 hour on-call rotation for on-site service.Thorough knowledge installation techniques.Thorough knowledge of electronic testing equipment, hand and power tools.Proficient with MS Windows 7, MS Word & MS Excel.Must successfully complete Kastle’s Training curriculum.Mechanical aptitude and ability to use metering devices.Must be able to climb stairs and ladders, and carry tools and equipment not to exceed seventyfive pounds.Must be able to distinguish colors.Ability to write and maintain accurate and concise daily records.Ability to interface and communicate with customers and coworkers in a clear and professional manner.Self-motivated and excellent attention to detail.Must be available to work overtime, weeknights, and/or weekends as needed.Must be willing to participate in and pass the company’s pre-employment screening process including a background investigation, drug screening and driving record.Must continue to maintain a safe driving record and valid driver’s license to fulfill the travel requirements of this position.Must be able to meet and continue to meet state licensing requirements for security.Must be able to meet client background and suitability screening when required to access client’s data and/or site.Must be eligible to work in the U.S. and at least 18 years old. These physical demands are representative of the physical requirements necessary for an employee to successfully perform the essential functions of the job. Reasonable accommodation can be made to enable people with disabilities to perform the described essential functions of the job.  While performing the duties of this role, the employee may be required to talk and hear face-to-face and while using telecommunication devices; sit for long periods of time; use hands and fingers to handle or feel, and manipulate standard keyboard, mouse and office equipment; stand, walk, and reach; lift and carry with arms and hands; use close vision; and be able to adjust visual focus. The employee must be physically and mentally capable of functioning effectively for extended periods of time and consistently produce organized thoughts and execute sound judgment in environments with: Moderate to high levels of stress.  Competing demands and dynamic response required.  Open floor plans with ambient noise and activity consistent with office or call center work.  Ongoing construction. Travel requirements: By automobile, plane and other modes of public transportation may be required. Must be able to:Lift and carry up to 75 poundsWork unsupervised.Work closely with others/ as part of a team.Work under close supervision.Work in enclosed spaces.Use color vision to distinguish colored wires, signals, other lighting devices.Use and manipulate hand tools, small power tools, communication and diagnostic devices. The following work environment characteristics are representative of the environment the employee will encounter while performing the duties of his/her job:  - The employee is subject to prevailing weather conditions at the time. The noise level in the office environment is usually quiet to moderate.The employee may be exposed to moving mechanical parts, tools and vehicles.  Reasonable accommodation may be made to enable people with disabilities to perform the essential functions of the job.  *All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, color, religion, sex, sexual orientation, national origin, age, disability, or protected veteran status or any other characteristic protected by federal or applicable state laws. Kastle Systems takes affirmative action in support of its policy and to advance in employment individuals who are minorities, women, protected veterans, and individuals with disabilities.  A requirement of this position is that you must be a US Citizen  #kastle"}