{"jobID": "2639045182", "jobLocation": "New_York_NY", "jobTitle": "Primary Care Physician - Medicine", "companyRating": "3.3", "companyInfo": {"Website": "www.pagny.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "211000", "jobDescription": " Overview Physician Affiliate Group of New York (PAGNY) is comprised of nearly 4,000 physicians and healthcare professionals who provide services to NYC Health + Hospitals, the largest public health system in the United States. Our practitioners are highly skilled professionals with outstanding credentials who deliver the highest level of quality healthcare to patients throughout New York City. The NYC Health + Hospitals/Gotham Health,Morrisania, affiliated with NYC Health + Hospitals/Lincoln, offers patient-centered, personalized healthcare to adults and children in the South Bronx community. A team approach is taken to ensure that full spectrum health services are provided to meet every patient’s needs. Morrisania is currently seeking a full time Primary Care Physician to join their dynamic team!ResponsibilitiesPlans, coordinates, delivers and manages comprehensive healthcare services for individuals requiring primary care case management, including but not limited to those enrolled in the NYS Medicaid Managed Care Program; ensures patient/provider continuity and access to timely and appropriate levels of care.Coordinates and manages their assigned panel of patient care across various levels of service. Where required by the practice, responsible for the supervision of mid-level providers.Direct participation in the twenty-four hour phone coverage for a reasonable number of primary care patients, which includes all of those in the Primary Care Physician's own panel of patients.Maintains a work schedule, including evenings, and weekends,that ensures availability and continuity of care.Arrange patient session schedules that allow for both scheduled and non-emergent unscheduled (walk-in) visits by their primary care patients.Participate in the inpatient care and follow-up of their primary care patients through admitting privileges in the appropriate department.Participate in inpatient teaching rounds as developed with the department.Participate in all administrative functions required by physicians in the practice including but not limited to the QA Committee and peer review. Prepares necessary documentation.Maintain a satisfactory workload that is consistent with Corporate minimum standards and which meets the needs of the practice.QualificationsGraduation from an approved Medical SchoolLicensed to practice in New York StateCompletion of approved residency in the specialty and Board Certified or Eligible in either Internal Medicine or Family MedicineMust meet the criteria for credentialing and privileging in the department as defined by the Medical Staff By-lawsMust meet all NYS Medicaid Managed Care requirementsEOE M/F/D/V"}