{"jobID": "2613851088", "jobLocation": "Boston_MA", "jobTitle": "Senior Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.theceresgroup.com", "Headquarters": "Boston, MA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Sr. Data Analyst  We are building a new Data Analytics group. The role of this group is to support the global audit teams by collaborating with them to provide meaningful data and successfully employ the use of data analytics in audit activities. These activities cover the different product lines and functions within the company globally. This includes Insurance, Wealth, Investment, and Banking products as well as actuarial and information technology functions.  The position of Sr. Data Analyst is a key team member in contributing to the development and execution of the Data Analytics group strategy. The successful candidate will bring their innovation, mindset for critical thinking, curiosity and functional expertise, and a passion for leveraging data and analytics tool sets to drive the success of this initiative.  This position reports to the Sr. Data Analytics Consultant, Audit Services.  This is an opportunity to join a new initiative of the company and would fit someone who enjoys working in an undefined setting that needs to be built from scratch. Key Accountabilities:Extract, transform and load relevant data and data files from various applications and databasesEvaluate the appropriateness of data sources for quality and accuracyPerform or consult audit teams on data validation, consolidation and cleansing processesPerform data analytics procedures to evaluate controls and business objectives. Analytics should be designed to identify outliers, anomalies, patterns, or other compliance indicators that may be hidden in the dataDevelop data delivery processes for both structured and unstructured data types utilizing various internal and external data sources; interface with data experts & data sourcing resourcesDevelop detailed business and system knowledge within supported areas. Document business, system, and data knowledge to help build a robust knowledge-base for future effortsTrain and support audit teams in the analysis of captured data as well as technical training to auditors across all levelsAutomate processes to increase turnaround time on data availability and increase efficiencies in the audit processBuild & maintain effective working relationships with IS and IT teams across the organizationJob Requirement:Bachelor's Degree in a technical (computer science, statistics, math, etc.) or equivalent technical expertiseGenerally, a minimum of 2 years' experience in data analytics/data management/programming experience.Significant experience with data gathering, storing, and retrieval methodsExpertise with SQL, MS Access, and other methods for manipulating relational databases.Competency in data analysisExpertise in Excel and VBAExperience with web scrapping, and statistical tools R or SAS. Experience with statistical techniques (e.g., regression analysis, cluster analysis, and decision trees)Experience with visualization tools such as Tableau or QlikviewExperience with other BI and ETL tools a strong advantageInsurance or Financial Services industry experience preferredCompetencies:Strong technical knowledge of data and data concepts; Ability to educate othersDetailed oriented with a problem solving mind setStrong collaboration and elaboration skillsAble to prioritize, meet deadlines, and be results orientatedTurn statistical and computational analysis into user-friendly visualizationsStrong commitment to organizational success, share resources and leverages knowledge across the organizationAdaptable and open to changeSDL2017"}