{"jobID": "2578024448", "jobLocation": "San_Francisco_CA", "jobTitle": "Market Launcher", "companyRating": null, "companyInfo": {"Website": "www.plenty.ag", "Headquarters": "South San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Agriculture & Forestry", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Market Launchers are the front lines of our organization, leading Plenty’s expansion into new markets across the globe. As the feet on the ground of our global expansion efforts, you will have ownership over multiple markets at a time. You will research your markets to learn the pain points, regulations, and opportunities for Plenty. You will engage with local stakeholders including government officials, electric utilities, and real estate companies to understand the path to success and to create a foundation for collaboration. Finally, you will coordinate cross-functionally across internal teams including sales, marketing, facilities, and talent to align efforts and timelines and ensure successful market launches.Who we’re looking for:Doer: You are a doer. You are diligent to understand what needs to be done, and then execute with speed, resourcefulness, and a go-getter attitude. You like to roll your sleeves up and make things happen in the face of ambiguity. You aren’t afraid to fail, but don’t make the same mistake twice. You feel the need for speed.Diverse set of skills: You are a utility-player. You can make something out of nothing, and put structures in place where previously there were none. From business development to marketing to operations, you know enough to be dangerous and are excited to apply your diverse skills widely.People skills: You have a unique ability to forge strong relationships. You can identify the influencers in a market and build them into champions who will help us achieve our goals.Project management: You have the ability to coordinate complex projects across multiple stakeholders. You understand that clear and effective communication is the key to success.Problem solving ability: You have excellent analytical skills and can navigate obstacles in a thoughtful, effective and efficient manner.Passion for Plenty: You are deeply passionate about Plenty and our mission.Experience:3+ years of marketing or operations management experience required.Prior experience managing cross-functional teams, negotiating partnerships, and executing business opportunities required.Prior experience interacting with government agencies and electric utilities a plus.Prior experience in a fast-growing company a plus.Willingness to travel frequently required."}