{"jobID": "2828106401", "jobLocation": "Kirkland_WA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.pivotalcommware.com", "Headquarters": "Bellevue, WA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Imagine ubiquitous 5G connectivity that will deliver on the promise of 4K video, augmented reality, autonomous driving, drone delivery, and super-fast inflight internet. These bandwidth intensive technologies of the future cannot take place utilizing current wireless and broadband network infrastructure. Pivotal Commware has developed a revolutionary technology called HBF or Holographic Beam Forming, a breakthrough in electromagnetic physics. This disruptive software defined antenna technology is revolutionizing wireless and broadband networks by helping network operators solve their biggest wireless access challenges capacity and spectral efficiency. Our patented antenna technology helps wireless service providers squeeze every ounce of performance from their networks at the lowest cost, size, weight and power consumption available. While Pivotal has completely redefined the physics and economics of providing broadband wireless access for consumer, business and military applications, we still need to tailor our technology for a multitude of compelling use cases. Looking ahead, our team will also be developing artificial intelligence and machine learning solutions to complement and enhance our fundamental technology. If you are passionate about what you do and want to apply yourself to this fascinating endeavor, then wed like to hear from you.Pivotal is seeking a Data Scientist to drive fast-paced research and development projects while working closely with a small group of scientists, engineers and business leaders in a start-up environment. The candidate will be responsible for applying both analytic, numerical, ML and AI methods to improve antenna performance, optimize KPIs and enhance communication system efficiency. The successful candidate will demonstrate the ability to think creatively and to operate within a flexible, rapid development program dedicated to expanding Pivotals market and mindshare. This position reports directly to the Chief Technology Officer. Responsibilities:•Understand business needs and apply Data Science, Artificial Intelligence (AI), Machine Learning (ML), Machine Vision (MV) technology and methods to architect and apply to antenna systems problems •Build and optimize models using Data Science, Artificial Intelligence, Machine Learning, Machine Vision including method selection to apply to engineering challenges •Improve rapid antenna optimization strategies for holographic beam forming antennas •Create high fidelity models illustrating KPI differences between holographic beam forming antennas and conventional beamforming antenna systems •Develop algorithms for optimal exploitation of a holographic beamforming antennas operating within next-generation communications networks •Be a thought leader for the company to provide technical guidance in the above areas for experiments and projects Required Qualifications:•PhD in Computer Science, Applied Mathematics, Electrical Engineering, or similar. •Background in machine learning, neural networks or related field •Experience with implementation of numerical and statistical models •Experience with implementation of optimization strategies •Experience applying machine learning and computational math to topics such as recurrent neural networks, feature selection via mutual information matrices, Massive MIMO, Self-Optimizing Networks or application specific models for learning•Software skills in C, C++, Python and/or MATLAB •Ready and able to coordinate with a cross-disciplinary teams throughout all phases of development •This position is not eligible for visa sponsorship Desirable Expertise:•Industry experience as a Data Scientist, Systems Engineer, Applied Mathematician, Mathematical Modeler or related title •Familiarity with 4G and pre-5G standards •Experience with commercial modeling tools •Familiarity with antenna and electromagnetic theory •Familiarity with modern communication theory We are an equal opportunity employer."}