{"jobID": "2795556771", "jobLocation": "Boston_MA", "jobTitle": "Entry-Level Business Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.draftkings.com", "Headquarters": "Boston, MA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " FanDuel"}, "estimatedSalary": "69000", "jobDescription": " DraftKings is a leading sports entertainment brand that creates the most exciting digital sports competitions and experiences on the planet. Our goal is to transform the way fans experience sports. Our mission is to make sports better and make better sports fans by bringing them closer to the games they love.  As an Entry-Level Business Data Analyst, you will be an internal consultant and focus on transforming data into actionable business insights to fuel the growth of DraftKings. Data is at the heart of every decision made within DraftKings, and our analytics team works to solve problems across a wide variety of topics. What you will do:Optimize acquisition spend and marketing strategies to drive growthRecommend contest sizing to positively impact the user experience and business efficiencyAnalyze and understand customer behavior throughout our platformIdentify ways to improve customer game-play through on-site changesMeasure how new features or site changes are driving changes in customer behaviorDevelop and systematize standard reporting for key business results (contest performance, player activity, segment performance, key player performance reporting)Build and execute test plans and drive the learning agenda for your areaWhat you will need to bring:BS in Engineering, Mathematics, Business, or a related field0-1 year of analytics experience, ideally in an Ecommerce companyExperience with SQL, SAS, Matlab, R, or other programming language is a plusKnowledge of statistics and hypothesis testing required, with model building experience a plusDemonstrated history of autonomously developing new insights from dataStrong communication and organizational skillsComfortable in fast paced, results driven environment At DraftKings, we promote diversity and are proud to be an equal opportunity workplace."}