{"jobID": "2796541924", "jobLocation": "San_Jose_CA", "jobTitle": "Senior Executive Assistant", "companyRating": "3.5", "companyInfo": {"Website": "www.fishercareers.com", "Headquarters": "Camas, WA", "Size": "1001 to 5000 employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "116000", "jobDescription": " OverviewSummary The Sr. Executive Assistant reports directly to the CTO. The successful candidate will be experienced in handling a wide range of administrative and executive support related tasks and will be able to work independently on projects and assignments. The role serves as the primary point of contact for internal and external constituencies. The ideal candidate will be experienced in supporting dynamic leaders and thriving in a fast paced environment with shifting priorities. The Sr. Executive Assistant will be successful at exercising good judgement in a variety of situations with strong written and verbal communications, administrative, and organizational skills. Ultimately, this individual will serve as a gatekeeper to the CTO while ensuring effective relationship management with stakeholders. Responsibilities Event Planning•Organize quarterly all-hands, team building, volunteer events and offsite planning sessions•Partner with internal resources to build and execute communication strategy in support of events Document Management•Track and manage documents that require CTO signature•Prepare and finalize PowerPoint presentations, Word documents, and Excel spreadsheets as needed•Maintain SharePoint document library Logistics Management •Manage CTO’s extremely active calendar of appointments allowing the executive to complete their obligations in an organized, efficient way•Coordinate internal and external meetings including one-on-one meetings, team meetings, all-hands meetings, off-site meetings, and vendor meetings•Works closely with the CTO to keep her well informed of upcoming commitments and responsibilities•Manage travel arrangements, including transportation, reserving accommodations, preparing detailed itineraries and coordinating materials•Book domestic and international travel within Fisher Investment travel guidelines•Submit accurate expense reports in a timely manner adhering to Fisher expense guidelines•Handle express mailings and faxes as requested•Create copies, scanning and maintenance of electronic files•Complete administrative project work and special assignments as requested Skills & Experience Required •Minimum 5 years’ experience serving C-level Executives•Experience with supporting a large technology-focused organization or division•Bachelor’s degree preferred•Must have excellent Microsoft Outlook Calendaring skills•Proficient in Microsoft Word, Excel, PowerPoint, and SharePoint•Working knowledge of video conferencing•Strong organizational skills that reflect the ability to multi-task and prioritize, while holding many items front of mind•Ability to anticipate needs and think critically•Strong oral and written communication. Ability to effectively and maturely communicate and collaborate with diverse personalities in all levels of management•Previous experience working closely with outside vendors in the Technology space•Previous experience handling confidential information in a professional and discreet manner•Demonstrated ability to maintain effective relationships while serving as a gatekeeper •Must be available to respond to issues outside of regular working hours  FISHER INVESTMENTS IS AN EQUAL OPPORTUNITY EMPLOYER"}