{"jobID": "2830339622", "jobLocation": "Cambridge_MA", "jobTitle": "Polymer Additive Manufacturing Simulation Intern", "companyRating": null, "companyInfo": {"Website": "www.boschsecurity.com", "Headquarters": "Grasbrunn, Germany", "Size": "10000+ employees", "Founded": " 2001", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Polymer Additive Manufacturing Simulation Intern One Kendall Square, Binney St, Cambridge, MA 02139, USAIntern Legal Entity: Robert Bosch LLC Company DescriptionThe Bosch Research and Technology Center North America with offices in Sunnyvale, California, Pittsburgh, Pennsylvania and Cambridge, Massachusetts is part of the global Bosch Group (www.bosch.com), a company with over 70 billion euro revenue, 400,000 people worldwide, a very diverse product portfolio, and a history of over 125 years. The Research and Technology Center North America (RTC-NA) is committed to providing technologies and system solutions for various Bosch business fields primarily in the areas of robotics and autonomous systems, visual computing, natural language understanding, car infotainment, web technologies, data mining, wireless solutions, energy materials and technologies, complex simulations, sensors, circuit design, and software engineering. In all areas we work in close collaboration with our partners at leading US universities, leading-edge industry partners, and other worldwide Bosch research, development, and marketing units.Job DescriptionThe Bosch Research and Technology Center in Cambridge, MA is looking for outstanding students in engineering and computer science to work on simulation of polymer additive manufacturing.  The goal of the internship is to identify an optimal multi-physics polymer additive manufacturing simulation tool (code). The goal will be reached by researching, testing, and comparison of various tools for simulation of a specific polymer AM process including printing, post-processing, and final part properties.  Job tasks & Responsibilities: Work with international project team to understand the process/product requirements and limitationsCreate a database of commercially available simulation tools and their associated capabilitiesDevelop a test plan for assessment of simulation toolsDown-select top simulation tools for assessment testing and test toolsProduce report on findings QualificationsME, CS, or closely related field with focus on additive manufacturingCurrently pursuing a MS or PhDCompetent in multi-physics simulationsExperience in additive manufacturing is a plus Additional InformationInternship Details:Location: Cambridge, MADuration: 3-4 monthsTentative start: September 2018 BOSCH is a proud supporter of STEM (Science, Technology, Engineering & Mathematics) Initiatives FIRST Robotics (For Inspiration and Recognition of Science and Technology)AWIM (A World In Motion) By choice, we are committed to a diverse workforce – EOE/Protected Veteran/Disabled.Job Location"}