{"jobID": "2810721101", "jobLocation": "Kirkland_WA", "jobTitle": "(USA-WA-Kirkland) Security Engineer Intern, Summer", "companyRating": "4.4", "companyInfo": {"Website": "www.google.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (GOOG) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Apple, Facebook"}, "estimatedSalary": "79000", "jobDescription": " Applications are now closed. Please check back in late 2018 for future openings.  Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; Kirkland, WA, USA  Join us for a unique 12-14 week internship that will take place Summer 2018.  Our team will review applications on a rolling basis and it's in your best interest to apply early. All hiring will be completed by March 2018. Thank you for your patience while we consider your application.  At Google, our users come first, and the Systems Infrastructure team is at the heart of that promise. We build the technologies that transform the way we think about doing business. Whether working on our cloud systems, researching the latest in computer technology or keeping Google's internal systems humming, Googlers and users alike rely on us to keep things running. We're back-end experts: protecting your privacy and ensuring your security.  There's no such thing as a \"safe system\" - only safer systems. Our Security team works to create and maintain the safest operating environment for Google's users and developers. As a Security Engineer Intern, you help protect network boundaries, keep computer systems and network devices hardened against attacks and provide security services to protect highly sensitive data like passwords and customer information. Security Engineers work with a broad range of devices, actively monitoring our systems for attacks and intrusions. We focus on the offensive/testing side and work with software engineers to proactively identify and fix security flaws and vulnerabilities. We also build tools, scripts and other automation to help our project teams achieve Google-scale impact.  Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From AdWords to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.  ## Responsibilities Responsibilities may vary by area. ## Qualifications Minimum qualifications:Currently pursuing a Bachelor's in Computer Science, Information Security or a related technical field.Enrolled in a full- time degree program and returning to the program after the completion of the internship.Coding experience in one or more general purpose languages.Preferred qualifications:Master's degree in Computer Science, Information Security or a related technical field.Expected graduation date in late 2018 or Spring/Summer of 2019.Knowledge of attacks and mitigation methods, with knowledge in two or more of the following: Network protocols and secure network design; Operating system internals and hardening (e.g. Windows, Linux, OS X, Android); Web application and browser security; Security assessments and penetration testing; Authentication and access control; Applied cryptography and security protocols; Security monitoring and intrusion detection; Incident response and forensics; Development of security tools, automation or frameworks.Authorization to work in the United States.* * At Google, we dont just accept difference - we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you have a disability or special need that requires accommodation, please let us know.  To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees or any other company location. Google is not responsible for any fees related to unsolicited resumes."}