{"jobID": "2820285777", "jobLocation": "Boston_MA", "jobTitle": "Environmental Analyst IV", "companyRating": null, "companyInfo": {"Website": "www.mass.gov", "Headquarters": "Chelsea, MA", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Government", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Environmental Analyst IV will serve as a Senior Scientist in the Environmental Toxicology Program and Chief of the Exposure Assessment Unit and will supervise other professional staff involved with evaluating human exposure through the use of human biomonitoring or evaluating the risk of environmental chemical exposure at contaminated sites in Massachusetts. This individual is expected to have experience with the statistical analyses of environmental data using SAS or R, as well as professional expertise evaluating the possible health impacts associated with exposure to chemicals and radiation. The Environmental Analyst IV will be involved with providing technical and scientific advice and assistance to senior management, community residents, public officials, and other stakeholders concerned with the health effects from exposures to environmental contamination from chemicals, radionuclides and ionizing radiation.  Detailed Statement of Duties and Responsibilities Clean, analyze and interpret environmental sampling and human health data.Develop project management processes and tracking mechanisms for Environmental Toxicology Program and Exposure Unit specific projects.Develop QA/QC and data cleaning and analysis procedures in SAS, R and Excel.Directly supervise junior staff and interns, and conduct performance reviews in conjunction with Commonwealth guidelines.Review scientific reports on geology, hydrogeology, geochemistry to evaluate the fate and transport of radioactive isotopes in the environment.Use risk assessment techniques to evaluate environmental pathways and public health impacts from chemicals and environmental radiation.Use regulatory and non-regulatory health-based comparisons in environmental media to evaluate exposure scenarios for radioactive materials.Analyze testing methods, environmental and biologic sampling strategies, and analytical laboratory techniques.Monitor environmental monitoring data for radioactive material and evaluate the likelihood of public health impacts.Prepare technical reports evaluating of environmental data.Develop technical educational materials for broad audiences.Assemble scientific research related to toxicology, health physics, and radiation health.Interpret and critique study reports evaluating the biological effects of ionizing radiation.Evaluate environmental fate and transport and health impacts from exposure to industrial sourced radioactivity including state or federal hazardous waste sites.Coordinate environmental sampling, for the presence of radiological constituents.Coordinate service, repairs, and performance of radiation environmental monitoring system. Preferred Qualifications Knowledge of the principles and practices of environmental science and public health.Knowledge of the terminology and standard abbreviations used in environmental science and public health.Knowledge of the methods of general and technical report writing.Ability to prepare technical and general reports.Ability to maintain accurate records.Ability to write concisely, express thoughts clearly and to develop ideas in a logical sequence.Ability to give oral and written instructions in a precise, understandable manner.Ability to assemble items of information according to established procedures.Ability to understand, apply and explain the laws, rules, regulations, policies, procedures, specifications and guidelines governing assigned unit activities.Ability to establish and maintain harmonious working relationships with others.Ability to deal tactfully with others.Ability to establish rapport with others.Ability to work independently.Ability to adapt to varying work situations.Ability to operate a motor vehicle.Ability to determine proper format and procedure for assembling items of information.Ability to supervise: including planning and assigning work according to capabilities of subordinates and available resources; controlling work through periodic reviews and/or evaluation; determining subordinates' training needs and providing or arranging for such training; motivating subordinates to work effectively; determining the need for disciplinary action and either recommending or initiating disciplinary action. Mission Statement  The mission of the Massachusetts Department of Public Health (DPH) is to prevent illness, injury, and premature death, to assure access to high quality public health and health care services, and to promote wellness and health equity for all people in the Commonwealth.  We envision a Commonwealth in which all people enjoy optimal health. Massachusetts ranks among the healthiest of states according to comparative analyses, but we face numerous challenges, including chronic and infectious disease, substance abuse, violence, preventable hospitalizations, and health disparities.  DPH coordinates programs and policies to address specific diseases and conditions and offer services to address the needs of vulnerable populations. We also develop, implement, promote, and enforce regulations and policies to assure that the conditions under which people live are most conducive to health and enable people to make healthy choices for themselves and their families. We license health professionals, healthcare facilities and a variety of businesses that impact public health. We operate the state laboratory and four public health hospitals. We monitor health status and manage vital records including births, marriages and deaths. We educate people about public health issues and work closely with local boards of health and community partners to identify and solve public health problems.  Total Compensation  As an employee of the Commonwealth of Massachusetts you are offered a great career opportunity influencing a wide-spectrum of services to the diverse populations we serve - but it's more than a paycheck. The State's total compensation package features an outstanding set of employee benefits which you should consider towards your overall compensation, including: 75% state paid medical insurance premiumReasonable Dental and Vision PlansFlexible Spending Account and Dependent Care Assistance programsLow cost basic and optional life insuranceRetirement Savings: State Employees' Pension and a Deferred Compensation 457(b) plan11 paid holidays per year and competitive Sick, Vacation and Personal TimeTuition Remission for employee and spouse at state colleges and universitiesShort-Term Disability and Extended Illness program participation optionsIncentive-based Wellness ProgramsProfessional Development and Continuing Education opportunitiesQualified Employer for Public Service Student Loan Forgiveness Program Pre-Hire Process  A criminal background check will be completed on the recommended candidate as required by the regulations set forth by the Executive Office of Health and Human Services prior to the candidate being hired. For more information, please visit http://www.mass.gov/hhs/cori  Education, licensure and certifications will be verified in accordance with the Human Resources Division's Hiring Guidelines.  Education and license/certification information provided by the selected candidate(s) is subject to the Massachusetts Public Records Law and may be published on the Commonwealth's website.  For questions, please contact Health Human Resources at 1-800-850-6968.  First consideration will be given to those applicants that apply within the first 14 days.  Minimum Entrance Requirements  Applicants must have at least (A) five years of full-time, or equivalent part-time, technical or professional experience in the field of environmental science, biology, chemistry, earth science, environmental health, meteorology, natural science, toxicology or public health, of which (B) at least three years must have been in a professional capacity, and of which (C) at least one year must have been in a supervisory, managerial or administrative capacity, or (D) any equivalent combination of the required experience and the following substitutions.  Substitutions  I. An Associate's degree with a major in the field of environmental science, biology, chemistry, earth science, environmental health, meteorology, natural science, toxicology or public health may be substituted for a maximum of one year of the required (A) experience.*  II. A Bachelor's degree with a major in the field of environmental science, biology, chemistry, earth science, environmental health, meteorology, natural science, toxicology or public health may be substituted for a maximum of one year of the required (A) experience.*  III. A Graduate degree with a major in environmental science, biology, chemistry, earth science, environmental health, meteorology, natural science, toxicology or public health may be substituted for a maximum of three years of the required (A) experience and one year of the required (B) experience.* Education toward such a degree will be prorated on the basis of the proportion of the requirements actually completed. NOTE: Educational substitutions will only be permitted for a maximum of one year of the required (B) experience. No substitutions will be permitted for the required (C) experience.  An Equal Opportunity / Affirmative Action Employer. Females, minorities, veterans, and persons with disabilities are strongly encouraged to apply."}