{"jobID": "2758427033", "jobLocation": "Boston_MA", "jobTitle": "Financial Data Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.baycove.org", "Headquarters": "Boston, MA", "Size": "1001 to 5000 employees", "Founded": " 1973", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "45000", "jobDescription": "BAY COVE JOBS - POSTING DETAILSRequisition Number: 8158Position Title: Financial Data AnalystDivision: AdministrationProgram Name: AccountingLocation: BostonHours: 40Schedule: M-F 9-5Date Posted: 05/02/2018Responsibilities: Maintains departmental budget and subsidiary template workbooks in Excel and other formats and creates new workbooks and processes for the Business Office as needed.  Performs monthly internal auditing for analysis on operational activities including historical, current and projected revenue and expense, cash flow, variances and costs.  Develops and monitors budgets and other fiscal projections.  Gathers, reviews and analyzes data and prepares routine and special financial reports.  Identifies trends and reconciles issues.  Negotiates fiscal contract terms, completes contract paperwork, contract budgets and amendments and other reporting as needed with our funders.  Partners with Accounts Receivable to monitor billing; provides a resource for problem solving and training on cost coding, financial report interpretation, and information sharing.Qualifications: Degree from an accredited School or College with an emphasis in the Accounting, Finance, Human Services Management, or related field.  Three years of experience in fiscal analysis; and preparing and interpreting financial reports and statements.  Ability to acquire data from multiple data sources (Dayforce HRIS, Great Plains Dynamics, templates) for analysis.  Ability to use advanced features throughout the Microsoft Office Suite (pivot tables, functions, data imports).  Strong analytical skills with the ability to collect, organize, manipulate, analyze, and disseminate significant amounts of information with attention to detail and accuracy.  Experience with financial accounting and budgeting software systems and reporting functions.  Thorough knowledge of the principles and practices of budget and contract administration.  Ability to comprehend program goals, objectives, and operations and to relate Knowledge of GAAP principles, State and Federal regulations as they apply to Massachusetts Human Service providers  Understand various program structures, basic contractual requirements as well as Bay Cove’s internal budgets, policies, and payroll systems, while adhering to GAAP principles.Driver's License Required? YesClick Here to Apply for this Position Now!  Bay Cove Human Services Benefits Bay Cove Human Services, Inc. is an Equal Opportunity/Affirmative Action Employer"}