{"jobID": "1917393754", "jobLocation": "New_York_NY", "jobTitle": "Data Analyst, Pre-Sales Solutions - NYC", "companyRating": "4.8", "companyInfo": {"Website": "www.looker.com", "Headquarters": "Santa Cruz, CA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Tableau Software, Chartio, Periscope Data"}, "estimatedSalary": "68000", "jobDescription": "WHO WE ARE Looker is on a mission to bring better insights and data-driven decisions to every business. Everything we do is aimed at making sure our customers love every aspect of Looker, from our products and technologies to our ease of doing business and our support. We are looking for curiously brilliant individuals to join our team as we reinvent data analytics. Get data-driven and see yourself at Looker. WHAT WE'VE GOT GOING ON Looker is seeking technically savvy Pre-Sales Solutions Consultants to demonstrate and articulate the value of our products to business and technical prospects, users and buyers. In this role, you will collaborate with the sales, marketing and services teams to deliver and continually improve our product demonstrations and trials. This includes sales scripts, customer needs discovery, implementing prototypes, developing and sharing expertise/training and guiding solution development/deployment. You will grow to possess breadth and depth of knowledge in data discovery and analysis, and will help shape the product and direction of the company by communicating market needs to the technologists. WHAT WE NEED YOU TO DODevelop customized presentations, demonstrations and prototypes of our software to articulate use cases and value to the customerParticipate in selling the value of Looker’s products using multiple channels, including phone, presentation, and live online and in-person product demonstrationsManage customer trials, ensuring that they are engaging with the product, the trial and the resulting solutionArticulate and educate on technical and architectural concepts to a variety of audiences, including developers, architects, and IT professionalsRespond to functional and technical elements of RFPs as necessary, leverage and build upon existing knowledge baseStay up-to-date on product releases and new features, assist in training new hires and colleagues in the fieldDocument and communicate product feedback and new requirements from the fieldWHAT YOU BRING TO LOOKER2+ years of software pre-sales experience, preferably in Data Analytics A passion for exploring data and extracting valuable insightsProven analysis and problem solving expertiseProficiency in SQLExperience with business intelligence tools with a physical model (e.g., Microstrategy, Business Objects, Cognos) a plus.Experience delivering presentations and demonstrations to senior level business and technical audiencesExperience responding to functional and technical elements of RFPsAbility to learn and assimilate technical information quicklyAbility to travel up to 25%A LITTLE MORE ABOUT LOOKER Looker brings data-driven decision-making to every level of an enterprise with a data platform that creates a single source of truth so every business team can easily ask and answer their own questions. The company is powering data-driven cultures at more than 500 industry-leading companies such as Yahoo!, Gilt, Warby Parker, and Sony. The company is headquartered in Santa Cruz, California, with offices in San Francisco, New York, and London. Investors include Kleiner Perkins Caufield & Byers, Meritech Capital Partners, Redpoint Ventures, First Round Capital, Sapphire Ventures, and PivotNorth. For more information, connect with us on LinkedIn, on Twitter, Facebook and YouTube or visit looker.com. "}