{"jobID": "2610611602", "jobLocation": "Boston_MA", "jobTitle": "Life Sciences Technology Consultant", "companyRating": "3.5", "companyInfo": {"Website": "www.paconsulting.com", "Headquarters": "London, United Kingdom", "Size": "1001 to 5000 employees", "Founded": " 1943", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " McKinsey & Company, Accenture, Deloitte"}, "estimatedSalary": "91000", "jobDescription": " Job DescriptionPA Consulting Group transforms Life Sciences organizations by working directly with executive teams to design, develop and deploy sophisticated operational and IT systems. We help companies to innovate and succeed commercially by speeding the right products to market, maximizing their impact, extending product lifecycles through leveraging technology advances and providing market-based insight and strategy. We start them off in the right direction and stay with them every step of the way. Our priority is to build lasting partnerships with our clients and make sure their new or existing IT services fit their organization and its goals. What we do:Give our clients independent assurance that their IT programs meet their business needs and future strategy in the areas of product and process development, clinical, regulatory, quality, manufacturing, discovery research and development, supply chain and commercial business developmentDesign the integration of new IT systems with existing architectureBuild the requirements and manage the deliveryAlign the dynamics between in-house teams and external suppliers so that people work together to solve problems. What can PA offer you? Original, strategic and operational consulting that makes a real business difference to high-profile clients. We never offer second-hand work or ready-made solutions.The opportunity to work in committed teams that blend in-depth industry experience with high quality consulting expertise. Intelligent and interesting colleagues who will develop and challenge you.A transparent career path where your advancement is objectively measured, enabling you to achieve your full potential.A compelling benefits package that is competitive with the market and designed to reward you for achieving success.Job RequirementsWhat we want: You should have a track record of successful project delivery working within a major professional services consulting firm. We also look for you to demonstrate the following: Strong consulting skills, including a high degree of communication and presentation skills, with the ability to manage projects, working with both people and technology to achieve successful outcomesLeadership of substantial projects within a teamCommercial acumen to understand requirements and formulate realistic and robust solutions while appreciating and managing risk appropriatelyA robust intellectual approach with a degree-level education; an advanced degree or a specialization in life sciences or computer science is preferredA willingness to learn and to develop yourself and others around youDeveloping strong relationships with colleagues and maintaining such a network to ensure that all opportunities are developed carefully and shared with other business unitsActively supporting the recruitment and development of team capabilities and talentAdditional Expertise:Bachelor’s degree required. An advanced degree or a specialization in life sciences, computer science or engineering is preferredBroad experience in IT operations within Life Sciences organizations with knowledge in Commercial, R&D; or AI and skills in one or more of the following areas: o IT Strategy and Implementation – developing business led IT strategies, requirements gathering, vendor management, IT service management  o Business Intelligence – reporting systems, dashboards  o Delivery Assurance – technical project management, stakeholder management Strong interpersonal and team-building skillsExemplary communication skills, including written, verbal and presentationThe ability to successfully manage client expectations and relationshipsEntrepreneurial, with creative thinking skillsAbout PA Consulting GroupWe are the consulting, technology and innovation firm that uses constant curiosity and ever-evolving expertise to make a lasting impact on the world. We are PA Consulting Group. Specializing in technology and innovation, management and IT consulting, our employees operate globally across a wide range of sectors, delivering practical solutions that make the difference for our clients. Getting exceptional results that have a lasting impact on businesses, communities and individuals is what we do. And finding fresh angles, exploring new avenues and following the unconventional path is how we do it. We are solving some of the world’s most complex problems. But where others settle for off-the-shelf solutions, we approach each challenge with fresh eyes, unconstrained thinking and a perfectly balanced team of experts handpicked for the task.  Join us and make the difference with your career.  VEVRAA Federal Contractor  We are committed to recruiting, promoting and rewarding our people solely on the basis of their ability to contribute to PA’s success. All qualified applicants will receive consideration for employment without regard to race, color, gender, religion, sexual orientation, age, marital status, national origin, protected physical or mental disability, military/veteran status, citizenship, ethnicity, political belief or affiliation, or other protected category.”  We are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class. VEVRAA Federal Contractor"}