{"jobID": "2826812616", "jobLocation": "Long_Island_City_NY", "jobTitle": "Direct Sales Rep - New Hire", "companyRating": null, "companyInfo": {"Website": "www.rcn.com", "Headquarters": "Princeton, NJ", "Size": "1001 to 5000 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Telecommunications", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Requisition Number 18-0203 Post Date 6/18/2018 Title Direct Sales Rep - New Hire City Long Island City State NY Description Direct Sales Representative  RCN, a growing leader in telecommunications is seeking dynamic individuals to join our team in various sales roles. We are a \"Triple Play Provider (cable, internet, phone)\" offering superior customer service and advanced technology to our residential clients.  The ideal individual will be dynamic, creative and self-motivated, bilingual Spanish/English skills a plus. The right candidate will have unlimited earnings potential as well as a \"fun and exciting\" working environment.  RCN offers ongoing training, tuition reimbursement, competitive salary & benefits package, 401K and much more! Responsibilities:Connect with potential residential customers through relationship building, telemarketing, networking and door – to - door sellingAchieving goals and expectations through these relationships, reaching sales objectives and maximizing the penetration of RCN services within their assigned territory Must be customer service focused and be able to resolve customer concerns.Distribute marketing materialParticipate in special sale eventsEducation & Experience:High School Diploma or General Education Degree (GED), College experience preferredRequirements:2-3 years sales experience, preferredMust be bilingual-English & SpanishExcellent verbal / written communications skillsPrior experience in maintaining successful / ongoing business partner relationships with customer base Outstanding Organizational skillsExperience in implementing Sales process improvement programsStrong management / leadership experience in managing sales / operations teamsExperience in developing and support of compensation plansStrong working knowledge and experience with Excel, PowerPoint, Word We are proud to be an EEO/AA employer M/F/D/V. We maintain a drug-free workplace and perform pre-employment substance abuse testing."}