{"jobID": "2585485475", "jobLocation": "Santa_Clara_CA", "jobTitle": "System Software Engineer", "companyRating": "4.3", "companyInfo": {"Website": "www.nvidia.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1993", "Type": " Company - Public (NVDA) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "125000", "jobDescription": " Nvidia is now looking for a System Software Engineer for its Self-Driving Car teams. As a Senior Engineer on our team, you will be responsible for developing and maintaining system software and infrastructure tools for platforms and products to build Autonomous Vehicles. What you’ll be doing:Help craft and maintain system software for Autonomous Vehicle productsYou will design and sustain system tools for product development and product verificationBe a part of helping to develop real-time data processing functions for high-end autonomous vehicle compute platformsResponsible for helping with performance optimizationWhat we need to see:Have a BS, MS, or PhD in Computer Science, Computer Engineering, Electrical Engineering or closely related field with 4 years of work or lab experienceYou possess strong programming abilities in C, C++, and PythonGood experience developing user mode System SW and drivers for HW acceleratorsYou should have familiarity with source control (git, Perforce, etc.)Ways to stand out from the crowd:Experience working on GPU technology, CUDA, imaging, camera, and multimediaHaving knowledge of AI, Deep Learning and/or Computer Vision, real-time data processing, networking and communicationRelevant Automotive SW experience (e.g. ADAS systems, autonomous driving, DDS, Some/IP, AutoSAR, etc) Academic and commercial groups around the world are powering a revolution in artificial intelligence using deep learning techniques running on NVIDIA GPUs, enabling breakthroughs in problems from image classification to speech recognition to natural language processing.  Intelligent machines powered by AI computers that can learn, reason and interact with people are no longer science fiction. Today, a self-driving car empowered by AI can meander through a country road at night and find its way. An AI-powered robot can learn motor skills through trial and error. This is truly an extraordinary time. The era of AI has begun.  NVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most brilliant and talented people in the world working for us. Are you creative, autonomous and looking for a challenge in the autonomous auto / self-driving car space? If so, we want to hear from you.  NVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression , sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.#deeplearning"}