{"jobID": "2813820240", "jobLocation": "San_Jose_CA", "jobTitle": "Sales Associate - Base Plus Incentives Pay Plan- Volvo Cars", "companyRating": "2.9", "companyInfo": {"Website": "www.autonation.com", "Headquarters": "Fort Lauderdale, FL", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public (AN) ", "Industry": " Retail", "Revenue": " $10+ billion (USD) per year", "Competitors": " Sonic Automotive, CarMax, Asbury Automotive"}, "estimatedSalary": "14", "jobDescription": " Job Details  Connect With Us  Apply Now Job ID 2018-92872 Date posted 06/13/2018 Job Location San Jose, California Job Type Regular Full-TimeAt AutoNation, doing what’s right by the customer comes standard at 300 locations coast to coast, so it’s no wonder we have served over 10 million happy customers. As a Sales Associate, you’ll be empowered with the resources and support needed to continue building customer loyalty that spans generations – including a best-in-class CRM, state-of-the-art equity mining tools, preferred relationships with over 30 lenders, access to a national inventory of over 100,000 new and pre-owned vehicles and your choice of a traditional commission or a base salary + incentive pay plan. We represent 36 brands in 16 states, so there’s always opportunity to grow your career as a Sales Associate and beyond. Join AutoNation and accelerate as far and fast as your talent and our support can take you. Position Overview The Sales Associate interacts with hundreds of customers to help guide them in their vehicle purchase in our no-haggle sales environment. With your outstanding communication and listening skills, you’ll help our customers select their perfect vehicle, negotiate terms that ensure payment options meet their lifestyles, budgets, and expectations and close the deal. Our Sales Associates provide an exceptional customer experience, driving loyalty by following up to ensure customer satisfaction and helping transition customers to the Service department to support their ownership experience. Pay PlanBase Salary + Incentive Take advantage of stability. Earn a base salary of $2,500 per month for three months while training. After training, earn $2,000 per month, or a similar hourly rate, plus bonuses based on each vehicle sold, vehicle purchased, your longevity with the company and more. What are the requirements?High school diploma or equivalentProven ability to provide an exceptional customer experienceDrive to set and achieve targeted goalsPrior sales experience, retail preferredExcellent communication, consultative, interpersonal and organizational skillsThe willingness to follow up with customersExperience and desire to work with technologyValid in-state driver’s license and an acceptable, safe driving recordWhy should I work for AutoNation?You want to work for a car dealer that has a strong moral compass and treats all of its associates with respectAutoNation is an equal opportunity employer and a drug-free workplace."}