{"jobID": "2816216928", "jobLocation": "Santa_Clara_CA", "jobTitle": "Member Service Specialist I", "companyRating": "3.3", "companyInfo": {"Website": "www.keypointcu.com", "Headquarters": "Santa Clara, CA", "Size": "51 to 200 employees", "Founded": " 1979", "Type": " Nonprofit Organization", "Industry": " Finance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "13", "jobDescription": " The primary responsibility is to research and resolve incoming member inquiries from external delivery channels not limited to, Branches, and web based delivery channels. The Member Service Specialist is a high member touch position and requires excellent verbal and written communication skills in addition to a high level of knowledge of the operational processes and procedures. The Member Service Specialist is expected to maintain a professional demeanor at all times. This position will ensure timeliness and follow up with unresolved member escalations and route to appropriate departments as necessary. The Member Service Specialist will triage incoming requests, troubleshoot, and provide responses to members. The Member Service Specialist is expected to have a high degree of analytical skills with a high level of understanding of our products and services and how the inner-working. The Member Service Specialist must demonstrate a high level of accuracy in processing of member requests. The Member Service Specialist will have some understanding to recognize the latest fraud trends to ensure they can detect and prevent loss exposure to the Credit Union. Assist in Special Projects as requested. Responsibilities:Provide a high level of member service to members, branch personnel and all external delivery channels to include the Contact Center.Exude a high level of Operational knowledge regarding the Credit Union?s policies, procedures, products and services demonstrating expertise in the inner-workings.Ensure Branches maintain a high level of Operational Integrity and incur no negative impact to Member Service due to inaccurate information on procedures or processes.Ensure that research and incoming requests are processed in a timely manner from all delivery channels to include the Branch Network, members and emails from message center and CMC when needed, plastics issues, service support, info @ & contact us and VOD requests.Proper completion of designated reportsAccuracy in Transaction ProcessingFraud Detection and PreventionProjectsAssist in development and facilitation of training classes as needed.Stay current in training in the operating of systems specifically in following areas; OSI, Call Handling Guide, OLB, Bill Pay, Plastics, WITS and KeyPoint Institute, etc.Physical Requirements: (Including lifting, sitting, walking, bending, reaching and squatting % of time in each function) This position does not require any physically strenuous effort. This is an indoor assignment. The incumbent will spend approximately 90% sitting at a desk and using the telephone and PC to perform most of the work duties. 10% will be walking into work areas. In addition, the group is required to lift and carry approximately 30 - 50 pound boxes when researching or preparing information for our off-site storage facility. High School Diploma or equivalentPrevious work experience in a member service departmentCollege degree (Accounting preferred) or equivalent experience.A minimum of 5 years financial experience.Knowledge of Windows, Excel, and Word.10 key by touch.Reconciliation experience is a strong plus.Excellent interpersonal relations, written and verbal communications, analytical, report writing, and time management skills."}