{"jobID": "2425891879", "jobLocation": "Boston_MA", "jobTitle": "Data Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.apptopia.com", "Headquarters": "Boston, MA", "Size": "1 to 50 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Datanyze, App Annie, Sensor Tower"}, "estimatedSalary": "79000", "jobDescription": " **We are only considering local candidates at this time. This is an onsite, full-time position (cannot be done remotely or on a freelance/consulting basis).  Backed by well known investors like Mark Cuban and Ashton Kutcher, Apptopia is the fastest growing mobile app intelligence company in the world. Our data science group is the heart of the organization and our mission is to make Apptopia's mobile intelligence the most trusted in the industry, and relentlessly seek to discover new ways to harness our data to create value for customers.  First and foremost, we are looking for hackers, makers, doers that have grit, hustle, and strive for excellence in everything they do. As a Data Scientist, you will: ● Be creative and clever in solving complex computational problems in the face of large, messy, and incomplete data  ● Manage several long term research projects and short term ad hoc analyses that inevitably happen during rapid growth.  ● Develop a deep understanding of the global app market, our product functionality and customer perspective to provide context for every problem.  ● Conduct EDA to generate new hypotheses and insights so that we know things before anyone else.  ● Engage with stakeholders to produce clear, compelling, actionable insights that influence product and service improvements that will influence the future of the global app economy.  Do you want to be a part of a world-class data science group that drives the future of a business and an industry? Come join us. Qualifications • 1-3 years experience of data science in R  • Insatiable curiosity and team player, this is a place where “I” comes to die.  • Strong interpersonal, communication and consulting skills.  • Demonstrable depth of coding skills (algorithms, data structures)  • BIG data skills. Demonstrable experience computing on large complex and often times unstructured data sets (Spark is preferred).  • Analytical chops. Bachelors degree in computer science, statistics, mathematics, economics, or other quantitative-focused field or rigorous online programs such as edX/Udacity. Other signals can substitute for formal schooling, such as publications in these respective fields.  • Demonstrable experience in data analysis and applying statistical concepts; foundational understanding of ML techniques preferred (experience with H2O.ai ML platform is a plus)  • Familiarity with AWS and Databricks is a plus.About Apptopia:Apptopia provides highly accurate data and intelligence on the mobile app industry by estimating downloads, revenues, and active users for every mobile app in every world. We also provide deep SDK analysis and recognition.  Our actionable app store data and intuitive business intelligence tool helps companies like Facebook, Verizon, & AMC Theaters make more informed decisions."}