{"jobID": "2747444525", "jobLocation": "San_Francisco_CA", "jobTitle": "Lead Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.rivierapartners.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About Riviera: Riviera powers startups! It’s no secret that recruiting is broken. The current process leaves all engaged parties – candidates, clients, and recruiters alike – exhausted; this is all too telling of the status quo’s fundamental flaws. Candidates struggle to find the best jobs for their skillsets; clients can’t fill their open roles with the best people; a recruiter’s ability dictates the pace of information flow, for better or worse. When you combine these factors, the resulting experience leaves much to be desired and begs the question as to why nobody has yet cracked this code in a tech-driven world. Until now.  For the last decade, we’ve had our hand in building the hottest startups and well-known tech companies around. We believe everyone deserves to have a job they love, so we’re building a next-generation recruiting platform that matches job hunters with companies meeting their exact career needs and objectives.  Our platform was designed to bring brilliant minds together in order to solve difficult challenges. We’re well on our way to delivering the most interesting career management platform in existence and we need talented people like you to help continue building the software that will drive us and the tech marketplace forward! About the Position Are you interested in uncovering the profound behavior patterns from data? Do you want to help the most innovative companies grow? Riviera Partners Data Science team is the place if you are passionate about solving real-world problems with machine learning techniques.  This role will contribute to the scientific advancement of Riviera business and product initiatives working with partner teams.  This role will work closely with data scientists on the team, design and implement algorithms, models, and systems for improving document tagging, feature extraction, predictive models on matching between jobs and candidates, and optimization in the machine learning platform.  The role will also design experiments and prototype new algorithms and analyze results. ResponsibilitiesWork in a broad capacity: work cooperatively with teams to design and build algorithms and solutions.Data Science and Engineering -Own end to end process from prototyping an algorithm to production deployment. Using a variety of techniques, innovate new generations of machine learning models based on rich interaction data and build systems to run these machine learning models. Design simulations and analyses to help frame decisions and requirements around key complex business problems.Required Experience & Qualifications:Hands-on experience as a machine learning scientist working with large real-world data set.Experience with:Statistical learning modelsNLPBehavioral models: causal model experience is a plusNetwork models: link prediction, network graph model experience is a plusGame theory a plus.Advance degree in a quantitative field: Mathematics, Economics, Engineering, Operations Research, Computer Science, or a related field. Extremely strong quantitative and logical problem-solving skills.Expert level knowledge of data mining technique and tools with Python is required. Minimum 3 years Python development experience. Familiar with AWS environment.Initiative and ability to seek and take responsibility.Hands-on, results-driven who can work with efficiency, excited to learn new things, forge new areas of understanding, and enable other teams to manifest them.This position is located in San Francisco, CA and requires someone to be on-site with our team. Learn more about the culture at Riviera, meet our team, and connect with us through our social channels below. We look forward to meeting you!  Website- https://rivierapartners.com/  Blog – https://rivierapartners.com/blog/  Twitter- https://twitter.com/RiviTeam"}