{"jobID": "2821058660", "jobLocation": "New_York_NY", "jobTitle": "Sr. Data Scientist - Search Relevance & Ranking", "companyRating": "3.6", "companyInfo": {"Website": "www.grubhub.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 2004", "Type": " Company - Public (GRUB) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " DoorDash"}, "estimatedSalary": "142000", "jobDescription": "Got a taste for something new?We’re Grubhub, the nation’s leading online and mobile food ordering company. Since 2004 we’ve been connecting hungry diners to the local restaurants they love. We’re moving eating forward with no signs of slowing down.With more than 80,000 restaurants and over 14 million diners across 1,600 U.S. cities and London, we’re delivering like never before. Incredible tech is our bread and butter, but amazing people are our secret ingredient. Rigorously analytical and customer-obsessed, our employees develop the fresh ideas and brilliant programs that keep our brands going and growing.Long story short, keeping our people happy, challenged and well-fed is priority one. Interested? Let’s talk. We’re eager to show you what we bring to the table.Grubhub as a business has unique challenges when it comes to search relevance and ranking. We have to consider diner to restaurant distance, market demand during the time of day (Dinner Rush, etc), restaurant opening hours, restaurant density, restaurant quality, traffic and driver demand. All of these aspects impact our ability to provide quality service. Relevance and ranking are key features that help us provide quality service to our diners.Building and improving large scale information retrieval (IR) systems and improving local search ranking.Explore large volumes of diverse data sets (clickstream, user orders, geo location) to find cohorts and fine tune search relevance across all geo locations.Using sound scientific guiding principles in analysis, model training, testing and validation of the data models to create precise, high performing and reliable models to be used in product.Using software principles to write functional, scalable, tested and clean deployable code, during the implementation stage of algorithms.Collaborate and work closely with Engineering, Product and Design to create high quality reliable products.5+ years of hands-on experience in large scale information retrieval systemsExperience building and fine tuning deep learning based systems or large scale information retrieval systems for mission-critical projectsProgramming - Our team pushes very hard to scale through automation. Advanced Python and Spark skills are very relevant to this job.Strong cross-functional communication skills - The algorithms we develop are central to how the business runs. So it's critical for you to understand the drivers of our business very deeply, and to be able to explain your approach to a wide variety of both technical and non-technical stakeholders and take input from them where appropriate.SQL experience - Experience in transactional and data warehouse environments using MySQL, Hive, or other database systems. Must deeply understand joins, subqueries, window functions, etc.Humility - Admit when you’re wrong and make a mistake, then let’s laugh about it. You might even make our achievements board!PhD or Masters in quantitative discipline.Got These? Even Better:Good understanding of data structures and computational complexity.Working knowledge of Scala or interest to pick up new programming languages.You know how to sell an idea to a large group of people. Internal PR is important.Predictive Analytics- Clustering, regression, neural networks, etc.Blog/portfolio/Github linksUnlimited paid vacation days. Choose how your time is spent.Never go hungry! We provide weekly GrubHub/Seamless credit.Regular in-office social events, including happy hours, wine tastings, karaoke, bingo with prizes and more.Company-Wide Initiatives encouraging innovation, continuous learning and cross-department connections. We deliver favorites every day. Join us as we move eating forward. Grubhub is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics. The EEO is the Law poster is available here: DOL Poster. Grubhub is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please send an e-mail to TalentAcquisition@grubhub.com and let us know the nature of your request and your contact information."}