{"jobID": "2830986457", "jobLocation": "Jersey_City_NJ", "jobTitle": "Career Placement Manager", "companyRating": null, "companyInfo": {"Website": "www.npower.org", "Headquarters": "Brooklyn, NY", "Size": "51 to 200 employees", "Founded": " 2002", "Type": " Nonprofit Organization", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "BACKGROUNDNPower is a high-performing leader in providing pathways to successful digital careers for veterans and young adults from underserved communities across the US and Canada. NPower’s award winning training programs use curriculum informed by senior industry leaders and labor market trends. On average, NPower graduates 85% of enrolled students, and has over an 80% rate of success for employment or continued education within 6 months of graduation. Notable corporate partners include Symantec, Cisco, Bank of America, Citi, CBS, JPMorgan Chase, ServiceNow, and HP.We address many of the primary barriers that our veteran and young adult community confront. Beyond free technical classes, our career training programs provide in-demand certifications within weeks, paid internships, professional networking and mentorship with business leaders, soft skills coaching, connection to social services, job placement assistance, transit assistance and an opportunity for graduates to give back to the program via our professional volunteer network. We provide ongoing career coaching, advanced certifications, and leadership development for our alumni, ensuring that we are developing true pathways for long-term success for our students.Position Summary:The Career Placement Manager is responsible for employment opportunities for NPower’s Jersey City program veteran and young adult graduates and match qualified them with employment opportunities in the public and private IT sector. Our goal is 100% placement for all of our graduates and are looking for someone committed to excellence.He/She will be responsible for developing relationships with employers, senior executives, tech incubator start-up owners, nonprofit leaders among others and successfully place participants into job and provide ongoing retention services to support both the employer and the NPower graduate. This position requires someone that has experience in workforce development, case management and/or sales and marketing. Responsibilities:Supervise Internship Placement employeePromote student development through professional development weekly activities.Establishing and maintaining relationships with employers;Securing internship and job opening for NPower students and alumniMatching the skills of students with the proper job openings;Coordinating referrals and conducting follow-up with both students and employersHelp prepare students for interviews one-on-one or in group/workshop settings and write/review resumes for alumniScreen students for job interviews and make appropriate referrals to employers.Make ongoing follow-up calls with students and employers to determine employment status and satisfaction with services delivered.Network with businesses, trade associations and other groups to develop new employer relationships.Manage database of job development leads.Qualifications:Bachelor’s degree preferredAt least three years’ experience in job development or account management.Prior experience working with veterans or young adults with barriers to employment preferred.Demonstrated experience meeting goals in a performance-driven setting.Superior communications skills, ability to engage a wide range of constituents.Demonstrated ability to collaborate with a team.Strong organizational skills.Exceptional sales skills with a demonstrated ability to generate leads, close deals and deliver results.Proficiency with Microsoft Office, CRM’s and online sourcing tools.COMPENSATION:Commensurate with experience"}