{"jobID": "2297445926", "jobLocation": "San_Jose_CA", "jobTitle": "6th Grade Math and Science Teacher (2018-2019)", "companyRating": "3.2", "companyInfo": {"Website": "www.alphapublicschools.org", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " School / School District", "Industry": " Education", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "57000", "jobDescription": "REPORTS TO: Principal KEY RELATIONSHIPSAlpha Public Schools students and familiesAlpha school leaders, office manager, teachers, education specialists and CMO staffLOCATION: San Jose, CA Alpha: Blanca Alvarado Middle SchoolAlpha: Jose Hernandez Middle SchoolAlpha: Cornerstone AcademyORGANIZATIONAL OVERVIEW Alpha Public Schools is a network of public charter schools serving the students of East San Jose.  Alpha students, families and teachers collaborate to develop the 21st century academic skills and character strengths students need for success in school, college and career. Together we create self-reliant leaders committed to making positive change in the world. ROLE SUMMARY Alpha is seeking entrepreneurial teachers who will thrive in a dynamic startup environment. Alpha teachers have high expectations for all students and a willingness to work hard, doing whatever is necessary to ensure the success of every student. They possess a growth mindset, strong personal character, and a consistent track record of high performance that is results-oriented. They are hard working, punctual, urgent, energetic, and embrace a spirit of self-reflection with a constant desire to improve. Finally, Alphas teachers hold a deep belief that all students can succeed in college, and that it is the responsibility of secondary school teachers to ensure that success. RESPONSIBILITIESInstruction & DeliveryDesign and implement curricula aligned to Common Core standardsParticipate in all professional development meetings/retreats and opportunities to further enhance your expertise as a teacher and leadership skills as an Alpha employeeReflect regularly on teaching practice and act on constructive feedbackEngage in collaborative curricula development, data analysis, and problem solvingMaximize personalized learning by creatively leveraging blended learning resources and adjusting teaching practices to ensure high student achievementRelationship ManagementCreate a safe, fun and academically challenging classroom cultureReinforce the school-wide behavior management systems and expectationsBuild on the student core values and personalized leadership training in and outside of the classroomHold all students to high expectations both academic and behaviorDevelop positive relationships with students, families, and colleaguesData DrivenUse assessment data to refine curriculum, inform instructional practices, and drive progress towards academic standardsCollect and assess data from the student database and all blended learning applications to drive decision making around student performanceAnalyze data with families, students and school leadersQUALIFICATIONSEXPERIENCED: Alpha teachers typically have 1-5 years of teaching experience in an urban public school and Alpha teachers must hold a valid teaching credential.DRIVEN: Alpha teachers have a relentless drive to advance the minds and lives of students in and out of the classrooms. They have a strong sense of personal responsibility.ENTREPRENEURIAL: Alpha teachers are risk takers who innovate in the classroom to best suit the needs of students. They learn from data, and act on constructive criticism to improve their craft.COLLABORATIVE: Alpha teachers engage in regular problem solving and curriculum construction in grade level teams. They demonstrate strong communication and relationship building with students, families, and colleagues.FLEXIBLE: Alpha teachers adapt to meet the needs of students and a startup work environment.Bachelors DegreeValid Multiple Subject Teaching CredentialIntern Credential will be consideredSingle Subject Math and/or Science w/an added authorizationConversational Spanish or Vietnamese a plusWhat Alpha Offers Its Teachers As a teacher at Alpha, you will change the educational and economic trajectory of students who otherwise would not attend college. You will significantly and directly impact the success and direction of a startup charter school, and have the opportunity to advance into a leadership role within a rapidly growing organization. Alpha OffersCompetitive starting salariesExcellent medical benefitsPathways to leadership and specializationFrequent instructional coaching and administrative supportA safe, engaging, dynamic work environmentTechnology needs, including a laptop computer, email, and class web pageA remarkably supportive staff and mission-driven organizationApply to work at Alpha: Please submit your application online ResumeA cover letter that includes the following:Why do you want to teach at Alpha Public Schools? (250 words or less)What is your philosophy and approach on student behavior management and why? (250 words or less).Incomplete applications or those with errors will not be considered. As an equal opportunity employer, we hire without consideration to race, religion, creed, color, national origin, age, gender, sexual orientation, marital status, veteran status or disability. We are strongly committed to hiring a diverse and multicultural staff and encourage applications from traditionally under-represented backgrounds. If you have any questions, reach out to the Recruitment Team at jobs@alphapublicschools.org"}