{"jobID": "2657126363", "jobLocation": "San_Jose_CA", "jobTitle": "Certified Clinical Hemodialysis Technician", "companyRating": null, "companyInfo": {"Website": "www.satellitehealth.com", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 1973", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " DaVita, Fresenius Medical Care - North America"}, "estimatedSalary": null, "jobDescription": " Requisition Number 18-0090 Post Date 2/7/2018 Title Certified Clinical Hemodialysis Technician Location Wellbound San Jose Job Status Full Time Work Hours 40 City San Jose State CA DescriptionSatellite Healthcare is a successful, nonprofit organization that has improved the lives of people living with kidney disease since 1973. We earn our national reputation for excellent patient care each day by offering a complete  range of dialysis therapy choices, personalized clinical services, and unparalleled wellness education.  Satellite Healthcare provides expert, personalized kidney care at over 80 centers across the U.S. as well as at acute dialysis locations in California and Texas. Learn more about Satellite Healthcare at  www.satellitehealth.com.  The Certified Clinical Hemodialysis Technician (CCHT) provides direct patient care under the supervision of the Registered Nurse, following Satellite policies and procedures per their state Scope of Practice in a safe and efficient manner. Care includes taking  and monitoring patient vital signs, performing blood tests, documenting appropriate patient information, preparing and monitoring dialysis equipment, and cleaning equipment. The CCHT will fulfill the Satellite Dialysis Mission Statement: “Making Life Better  For Those Living With Kidney Disease” by providing superior customer service as part of a collaborative team. Essential Functions:The essential functions listed are not a comprehensive inventory of all duties, tasks, and responsibilities. Employees may also perform other duties as assigned. All employees must  work in accordance with Satellite’s I-CARE Standards. • Provides superior customer service by acknowledging and responding to their needs promptly and appropriately Performs the hemodialysis treatment according to Satellite and the local center’s policies and proceduresAdheres to all infection control procedures and understands the consequences associated with failing to follow those procedures: a. Wears appropriate personal protective equipment (PPE)  b. Follows all clean/dirty procedures in order to eliminate cross-contamination  c. Performs cannulation using aseptic technique for needle insertion and all other required procedures  d. Disinfects machines, station area, and chairs after each patient treatment  e. Maintains a neat and clean environment Performs thorough patient data collection and documentation of patient information prior to, during, and post dialysis, per scope of practice. Provides detailed and thorough documentation on treatment sheets and medical records, both manual and electronicCommunicates significant patient information to the appropriate team members in a clear, concise, and accurate mannerProvides reinforcement of education given to patients and their caregivers to increase their understanding of the disease and its treatmentPrepares dialyzer according to procedure during prime and set up; removes dialyzer at end of treatment, preparing it for reuse procedures per MD ordersResponsible for ensuring all safety checks are completed prior to initiation of treatmentCannulates dialysis accesses, initiates treatments, monitors patient and machine, terminates treatment per policy and proceduresAdministers medications such as normal saline, heparin, and lidocaine per MD orders under the direction and supervision of the Registered Nurse, and per scope of practiceAdministers oxygen as necessary by cannula or mask under direction and supervision of Registered Nurse or MD orders, per scope of practiceObtains blood samples and culture specimens as ordered and performs routine testsResponds to emergencies and alarms appropriatelyParticipates in CPR as needed and as directedParticipates in initial/annual clinical and technical competencies evaluations as appropriateDevelops and/or participates in in-service education programs; attends and participates in staff meetingsPerforms other duties as assigned"}