{"jobID": "2826748919", "jobLocation": "New_York_NY", "jobTitle": "Commercial Banking Client Service Specialist", "companyRating": "3.7", "companyInfo": {"Website": "www.leumiusa.com", "Headquarters": "New York, NY", "Size": "201 to 500 employees", "Founded": " 1954", "Type": " Company - Public", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " J.P. Morgan, Citi, Israel Discount Bank"}, "estimatedSalary": "71000", "jobDescription": "Overall summary of the role:The principal purpose of the role is to enhance the client experience by servicing clients and providing transactional and administrative support to Relationship Managers. The role is responsible for managing the processes associated with client onboarding, general account maintenance (including account changes and closing), transactions and inquiries. Building and maintaining positive and productive relationships externally and internally is an essential part of the role. Your knowledge of firm policy, procedures and technology allows you to interface with clients and prospective clients, anticipate their needs, resolve their issues, and follow through to provide exceptional service.Primary responsibilities:Provide personalized service to Commercial Banking clients in a professional manner and ensure a positive customized client experience at each touch point.Maximize the client experience by reviewing and consolidating the KYC process and minimize the touch points between the client and the bank by understanding the documentation requirements across all entity types, with specific focus on complex corporate structures.Customize account opening documentation for the client’s review and signature, understanding how the client type, client risk, and product type play a role in preparation.Verify client instructions and prepare appropriate documentation in a timely fashion to facilitate the execution of transactions and coordinate the process flow by partnering with internal business units and follow up until completion.Properly manage client’s expectations when communicating and responding to processing requests, instructions, inquiries, issues, voicemails, and emails to help maintain client relationships. Produce ad-hoc reports on account cash balances, overdrafts, significant balances, currency transactions and ensure the proper disclaimers are attached.Monitor client’s daily transactions and inform Banking team of potential issues, possible fraud or unexpected activity that is not in line with the customer’s standard instructions.Educate clients on account services and capabilities (i.e. how to read statements / confirmations, how to use Online Services, paperless options, etc.).Review client database on an on-going basis to keep information up to date and record major developments.Additional Responsibilities:Build and maintain positive and productive working relationships within Bank Leumi USA in order to resolve any potential client issues and problems efficiently.Communicate logically with clients and staff across all levels of organization.Develop comprehensive knowledge of all Leumi Commercial Banking products.Assist in on-boarding and training of new members within the team.Support and drive the firm’s initiatives while maintaining risk awareness and regulatory knowledge.Continually reassess the risk inherent to the business and team so as to minimize exposure to losses and fraud while maintaining integrity.Be aware and ensure strict compliance to all relevant policies and procedures within the role and act in accordance with risk, audit, business and operational risk objectives as well as external rules/regulations.Perform other job-related duties as assigned.Skills:Hebrew fluency will be considered a plus Client service oriented with a high level of professional and personal integrity; demonstrate a positive and optimistic perspective during each client interaction.Clear written and verbal communication skills.Strong work ethic with pride in ownership of taking assigned tasks to completion.Detail oriented with proven organizational skills.Ability to identify key risks and trends that require escalation.Complex problem resolution skills with the ability to draw the correct conclusions.Strong time management skills with a keen sense of urgency and the ability to prioritize workload.Ability to manage multiple/changing priorities with tact, diplomacy and confidentiality.Perform effectively, efficiently and professionally within a team, with business partners, colleagues, and all levels of staff and management."}