{"jobID": "2731526995", "jobLocation": "San_Jose_CA", "jobTitle": "Financial Services Rep. II/Floater - San Jose, Req", "companyRating": "4.1", "companyInfo": {"Website": "www.meriwest.com", "Headquarters": "San Jose, CA", "Size": "201 to 500 employees", "Founded": " 1961", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "57000", "jobDescription": "Financial Services Representative II/Floater Position SummaryThe Financial Services Representative II/Floater will assist and provide coverage for all of the Meriwest Credit Union Financial Centers as needed. Provides personalized service to members in order to attract, enhance, and retain member relationships Incorporates Service Plus into all aspects of member contacts and continually builds relationships with members in order to retain and increase memberships. Further enhances these relationships through the cross-selling of products and services to meet all the members’ financial needs. Knows the detailed features and benefits of all products and services available and presents them in a professional manner. Meet assigned share, deposit, lending and referral partner targets. Support Credit Union in all Initiatives with a positive attitude and willingness to get the job done.Essential Duties and ResponsibilitiesAssists members in opening all checking, savings, and certificate products. Provides members with dividend projections by the use of the system calculation form, being able to manually calculate dividend projections. Must be capable of negotiating rates within guidelines when necessary. Maintains understanding of account ownership.Ability to analyze member’s financial needs and ask leading questions to effectively cross-sell products and services.Effectively makes presentations to members on all deposit, loan, and business banking products in an understandable manner. This requires extensive knowledge of all deposit, lending, business banking, and insurance products and services.Serves as back-up for all Member Service Representatives (including handling member transactions) as required.Assists members with lending needs through loan interviews. Maintains an understanding of all lending policies and procedures. Uses the loan application to process all loan requests according to the lending guidelines set forth by the Credit Union.Performs other duties as assigned. Minimum QualificationsHigh School or Equivalent required.Minimum of 3 years prior Credit Union or Banking Experience highly preferred with a minimum of 2 years' experience in new accounts, products sales and lending.Must be extremely sales oriented and have a strong desire to continually surpass goals and sales targets. Proven ability in a competitive sales environment required.Knowledge of business banking deposit accounts, payroll, merchant, and the ability to promote business banking loan options.Must have excellent communication skills in order to make professional and effective presentations to members. Ability to promote all credit union products and services to members and overcome objections and concerns.Comprehensive understanding of all loan products. Full-cycle knowledge of new account functions.Ability to work independently, exercise judgment, follow instructions, and maintain a high level of professional conduct.Strong customer service focus with previous experience in a service industry.NMLS SAFE ACT compliant. This position requires that you obtain, and maintain, a National Mortgage Licensing Systems (NMLS) number as required by the SAFE Act.Must be PC literate; experience with banking software a strong plus.Must be able to work Saturdays 8:30am - 1:30pm.Do you want to be valued as an employee?Employees are Meriwest’s most valuable resource. We provide competitive wages and a supportive environment that promotes career advancement. We also offer an excellent, fully comprehensive benefits program, including: Medical/Dental/Vision on the first day of employment for full-time employeesFree Long Term Care Insurance for employeesEducation AssistancePension Plan/401KBonus and incentive potentialGenerous Paid Time Off (PTO)/Holiday programCareer growth support and planning programsIn-house fitness centerDiscounts on new Mortgage after 6 months of employmentWe are an EOE. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of disability or veteran status.To apply please reference Req. #3144 "}