{"jobID": "2806699031", "jobLocation": "Santa_Clara_CA", "jobTitle": "Data Analytics Intern", "companyRating": null, "companyInfo": {"Website": "www.hitachi.com", "Headquarters": "Tokyo, Japan", "Size": "10000+ employees", "Founded": " 1910", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Data Analytics Intern  Company: Hitachi America, Ltd.  Division: R&D;/Big Data Lab/Energy Solutions Team  Location: Santa Clara, CA  Status: Intern, Full-Time  Duration:May-August 2018  Summary  Hitachi America, Ltd. (http://www.hitachi-america.us/) has openingsfor Summer Interns in the Big Data Laboratory located in Silicon Valley. Themission of this laboratory is to help create new and innovative solutions inbig data and advanced analytics. The laboratory focuses on research, technologyinnovation, proof-of-concept activities, technical marketing and businessdevelopment for novel big data solutions, leveraging Hitachi's technologies,reinforcing Hitachi's messaging around big data, and establishing Hitachi as aleader in big data.  We are seeking an Intern to work with our Energy Solutions Team. The DataAnalytics Intern will work on developing innovative data analytics frameworksunder guidance of senior researchers, he/she will advance selective dataanalytics modules using state-of-art machine learning and artificialintelligence methods and create models of demand and renewable generationswithin the Energy IoT environment and benchmark performance against industry commonpractices. You will work in a team environment with significant interactionwith Researchers.  More information about the research done at the Big Data Laboratory canbe found at:  http://www.hitachi-america.us/rd/about_us/bdl/  More information about Hitachi IoT technology in Smart Industry can befound at:  https://www.hitachivantara.com/en-us/solutions/iot-insights/industrial-iot.html Qualifications:A Ph.Dstudent pursuing a degree in Computer Science, Computer Engineering, IndustrialEngineering, Electrical Engineering or any other related degree; especiallywith a focus on analytics.Previousresearch related to Energy&Demand; forecasts and/or time series short termforecasts/data prediction is required.Expert knowledge of power and energy analytics,nature of electrical loads is preferred.Proficiency in Python, R or MATLAB is required.Hands on experience with state-of-art MLlibraries is required.Familiar with popular database software, i.e.MySQL, Postgres etc. is preferred.In addition, the successful candidatewill possess the following behavioral characteristics: o Must have strong problem-solvingskills  o Must be highly-motivated team playerwho can thrive in a dynamic startup-like environment  o Must have excellent communicationskills, both written and verbal  EOE-Females/Minorities/ProtectedVeterans/Individuals with Disabilities"}