{"jobID": "2542732085", "jobLocation": "Los_Angeles_CA", "jobTitle": "Sales Intern", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Surkus is a data-driven technology company. We match brands and businesses looking to acquire their ideal crowd and connect them with people that are seeking memorable experiences. In 2 years we have worked with 1,000+ brands, delivered crowds to 5,000+ events and have grown to 175,000+ members (users).  We are looking for a highly motivated, ambitious and results-oriented individual who is hungry to learn and craves a challenge. As a Surkus Sales Intern, you will be responsible for identifying and cultivating new sales opportunities that fuel pipeline growth. You must have the ability to quickly learn Surkus, the science of prospecting, and the art of creating new opportunities. You will use your energy, resourcefulness and enthusiasm to be successful. Responsibilities:Generate new business opportunities among assigned market and verticalIdentify, qualify and cultivate new sales leads through online research, publicly available sources such as LinkedIn, referrals, personal networking, emails, and cold-callsAchieve monthly targets such as number of businesses identified, leads generated, number of daily activities/ tasks, call quality, appointment setting, and sales skills.Acquire research and further contact information where needed to develop a profile of companies for sell-in opportunities.Ability to work effectively in CRM, report progress, and provide insight on lead movementCommunicate regularly with colleagues, management, and potential prospects.RequirementsHunter’ mentality in seeking out new businessEnergy and desire to make numerous (30+) phone calls dailyAbility to communicate clearly and effectively via email and via telephoneClearly articulate the Surkus mission and value proposition in a persuasive manner via telephone and emailStrong organizational, problem-solving, and analytical skills.Comfortable spending the majority of the workday on email or phone with prospect contacts at all levels of the organizationDesire for continuous learning, improvement and overall career growthExcited about working for a fast growing tech startupSelf-starter with track records of success in their professional and personal or collegiate livesStrong attention to detail and accuracyProficient in Keynote and ExcelMust be coachable and a team playerAssertive and not afraid to take risksBenefitsWorking at one of the hottest LA tech companiesFree snacksWeekly catered lunchesChance to attend some of the coolest LA events"}