{"jobID": "2815228773", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analytics Intern - Grid Services", "companyRating": null, "companyInfo": {"Website": "www.sunrun.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2008", "Type": " Company - Public (RUN) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Auric Solar, SolarCity, Sunrun"}, "estimatedSalary": null, "jobDescription": " As the nation’s largest residential home solar, storage and energy services company, Sunrun is on a mission to transform our energy system into the modern and sustainable grid of the future while making clean, renewable energy, accessible to all residential households.  To realize this vision, Sunrun is developing advanced technologies, products and services designed to reinvent the way people power their homes. We are actively seeking a data analytics intern in our Energy Services product team, focused on building tools and analyzing opportunities to provide grid services to utilities. You'll work alongside other passionate directors, engineers and managers engaged in the design and development of a product that is making real positive impact on our world.  If you are passionate about analysis, execution oriented and motivated by solving for one of the biggest and most critical challenges of our time, then we say bring it on…help us disrupt a 100 year old industry and partake in advancing Sunrun’s mission of creating a planet run by the sun.  You will be a part of the Energy Services and Grid Services team, working to create data pipelines and replicable analyses for the business. You will help to design, code, and develop our Energy Services platforms. During the course of the internship, you will partner with Sunrun’s analytics and business teams in the Energy Services group to identify, plan and carry out high-impact analytics projects to directly support the growth of Sunrun’s grid services business. Techno-economic analysis could include customer tariffs, grid services products and programs, modeling of solar and storage economics, load management and/or data structuring to enable more powerful analyses in the future.  Responsibilities: Perform data analysis using SQL and PythonDevelop process methodologies for the Energy and Grid Services teamSupport Energy and Grid Services in go to market strategyIdentify, structure and carry out end-to-end analytics projects for business impactGain fluency with key aspects of distributed solar+storage for grid services. Qualifications: Currently enrolled in a full-time post-secondary institution in a program related to renewable energy, computer science, or engineeringWorking knowledge of Python and SQLExperience with time series data manipulation, optimization, and forecastingBackground in statistics and mathematicsAble to work from a problem statement, data resources, and informational starting points to define robust analytical approaches, build requisite models, and derive and present solutions.Able to work semi-independently on self-driven projects and also work in close coordination with business teams for spot analysis and business support.Experience or interest in creating repeatable / scalable tools for use by technical and non-technical peers.DISCLAIMER This description indicates the general nature and level of the qualifications and duties required of employees in this job classification, as well as the essential functions a person must be able to perform to do this job. It is not designed to be a comprehensive inventory of all duties and qualifications required of employees assigned to this job.  Sunrun Inc. and its subsidiaries are equal opportunity employers and make employment decisions on the basis of merit and business need. We hire without consideration to race, color, religion, citizenship, political activity or affiliation, marital status, age, national origin, ancestry, disability, veteran status, sexual orientation, gender identity, gender expression, sex or gender, or any other basis protected by law."}