{"jobID": "2605885959", "jobLocation": "El_Segundo_CA", "jobTitle": "Computer Vision Engineering Intern", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Computer Vision Engineering Intern  Do you love Disruptive Technology, Big Business Opportunities, Space, Big Data Analytics, Computer Vision or AI? We do! At Slingshot, we are charting the intersection of GIS, remote sensing imagery, machine learning, and big data technology!  Slingshot employs team members from a variety of disciplines, including technical and engineering fields. We are a small team with plans for rapid growth. We currently looking to fill a new position as a computer vision engineer at the Los Angeles facility. You will be developing computer vision algorithms to extract information from high-resolution satellite images and other remote sensing data.  In this role, you will be engaged in fundamental research in deep learning neural networks, including CNNs, RNNs, GANs and others. You will develop novel algorithms for object detection and recognition and scene understanding, moving beyond what is possible to do with off-the-shelf software.  Basic requirements: Solid understanding of current deep learning computer vision techniquesStrong understanding of statistical machine learning methodsHands-on programming skills in Python, C++, or JavaDemonstrated ability to create, invent, and be innovativeAbility to work both independently and collaboratively in a fast-paced research environmentEnthusiasm for pursuing new challenges and technologiesDegree or coursework in computer science, electrical engineering, or equivalent experience in statistics, machine learning, image processing or fields with heavy focus on these disciplinesMust be a U.S. citizen authorized to work in the U.S. Preferred background (not required): Experience with using deep learning frameworks such as Tensorflow, Theano, or CaffeExperience with satellite imagery or remote sensingPublications in computer vision and machine learning conferences and journalsOpen source contributionsExcellent critical thinking capabilitiesPhD degree in computer science or electrical engineering, or equivalent experience in statistics, machine Learning, image processing or fields with heavy focus on these disciplines from a Top Tier UniversitySuperb communication skills. Youll need to be able to explain yourself and your methods both within the company and with customers.Excellent data analysis & visualization skills in PythonStrong Unix/Linux skills Your commitment: Full Time Internship If youre interested in this role, let us know. Tell us what excites you and why you would be a good fit. Looking forward to hearing from you!"}