{"jobID": "2756725406", "jobLocation": "New_York_NY", "jobTitle": "Marketing Associate", "companyRating": null, "companyInfo": {"Website": "www.movethisworld.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "At Move This World, we’re looking for a full-time Marketing Associate to support strategic business development in the US K-12 education space.About Move This WorldMove This World's social emotional learning program provides PreK-12 educators and students with digital tools to strengthen their social and emotional wellbeing in order to create healthy environments where effective teaching and learning can occur. Through evidence-based, developmentally appropriate digital tools, Move This World ritualizes a daily practice of identifying, expressing and managing emotions. To date, Move This World has impacted nearly half a million students across 17 states. By providing 24/7 access to educational videos, classroom resources, and a dedicated wellbeing consultant, Move This World is increasing accessibility to effective social emotional learning.About the RoleAs Move This World’s Marketing Associate, you’ll be responsible for implementing our digital marketing strategy. You will help us ensure our message is heard.You will be responsible for strengthening and maintaining our online presence. You will be responsible for optimizing and updating our website and growing social media engagement. You will plan and launch targeted marketing campaigns to spread Move This World’s mission. You’ll work closely with our Marketing Manager to build a common, united, pitch perfect voice for our external messaging.About YouYou are a creative, innovative and detail-oriented problem-solver. You’re flexible and willing to do what it takes to help our team thrive. You understand schools, teachers, and students. You know and respect that teachers and students are facing new and unique challenges everyday and you want to help them overcome these obstacles. You prioritize your own wellbeing and encourage those around you to do the same.RESPONSIBILITIESCollaborate with the Marketing Manager to develop digital marketing strategy.Collaborate with teammates to ensure consistency of messaging. Strengthen MTW’s overall branding experience.Work with teammates to enhance external communications, improve website design, and own social media strategy.Create and monitor the performance of multi-channel digital marketing initiatives, including paid digital advertising across Facebook, Google Adwords, and LinkedIn.Translate our messaging into creative, compelling visuals, fliers, and other branded materials. Continually develop new ideas for design.Oversee general and targeted email marketing campaigns and newsletters.QUALIFICATIONS1 to 3 years of digital marketing experience required.BA/BS or equivalent work experience.Proven experience implementing organic and paid social media strategy.Experience working with Squarespace or a comparable platform.Strong communication skills, with an ability to articulate Move This World’s vision and mission to various audiences.A highly creative individual who possesses self-confidence, flexibility, and positive energy, and who thrives working in a dynamic environment.A quick learner who can pick up skills and projects in a fast-paced environment.Troubleshooting and problem solving skills, with creative ability to overcome challenges.Strong organizational, analytical, and project management skills.Demonstrated ability to take ownership and accountability.Ability to travel occasionally.Experience working within education is preferred.Recommended: Proficiency in Google Adwords, Google Analytics, Facebook Advertising, and Adobe Photoshop/Illustrator.BENEFITSCompetitive salaryComprehensive health, vision, dental and life insuranceTransit stipendThree weeks paid vacation + 10 company holidays (we’re also flexible & encourage you to take the time you need in order to thrive)Opportunities to regularly practice and prioritize our own wellbeing as a teamProfessional development, growth and learningSnacks for daysColleagues who laugh, have fun, challenge and inspire one another"}