{"jobID": "2825135681", "jobLocation": "Long_Beach_CA", "jobTitle": "Intern (Water Infrastructure Engineering)", "companyRating": "3.5", "companyInfo": {"Website": "www.atkinsglobal.com", "Headquarters": "Epsom, United Kingdom", "Size": "10000+ employees", "Founded": " 1938", "Type": " Company - Public (ATK) ", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " AECOM, CH2M, Arup"}, "estimatedSalary": "48000", "jobDescription": " SNC-Lavalin's Atkins business is one of the world's most respected design, engineering and project management consultancies. SNC-Lavalin's Atkins business has been providing infrastructure planning, engineering, construction, environmental consulting, urban planning, architecture, and program management services to public and private clients across the United States for more than 50 years.  SNC-Lavalin's Atkins business was ranked as the world's 11th largest global design firm by ENR in 2016 with nearly 18,000 employees worldwide. We have the depth and breadth of expertise to respond to the most technically challenging and time-critical infrastructure projects and the urgent transition to a low-carbon economy.  Atkins seeks an energetic and highly motivated self-starter to join our Long Beach Water Infrastructure Group as an Intern (Water Engineering). Major Function/Role: Under supervision, performs a variety of basic technical tasks to assist technicians, engineers, architects, planners, surveyors or scientists working in transportation, development, environmental, land surveying or other technical services of the company. Job Duties: Performs basic technical support assignments. Education and Experience: High school level courses in math, technical drafting, computer assisted drafting and/or science may be required. No experience is generally required with the applicable high school courses or equivalent training, or if accepted into an Associate's or Bachelor's degree program in a related technical field. Special Skills: Math skills to perform simple calculations; willingness to learn. Basic computer skills required to enter data into spreadsheets or databases. Professional Registrations:N/AAdditional Requirements:N/A Atkins offers its employees a robust rewards package which includes: a competitive salary; a broad benefits package including medical/RX, dental, vision, life, disability, legal, hospitalization and other valuable voluntary options; generous time-off programs; flexible work schedules; 401(k) with employer match; professional and career development opportunities through our corporate university, as well as a highly-regarded tuition reimbursement program; and an unmatched culture focused on client-service, quality, and tireless pursuit of excellence in all we do. Atkins is an equal opportunity, drug-free employer committed to diversity in the workplace. EOE/Minorities/Females/Vet/Disability.  Please view Atkins Equal Opportunity Statement here: ******************************************************************************************************************"}