{"jobID": "2755009795", "jobLocation": "San_Jose_CA", "jobTitle": "Staff Software Platform Test Engineer (Cloud)", "companyRating": "3.7", "companyInfo": {"Website": "www.xilinx.com", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 1984", "Type": " Company - Public (XLNX) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Qualcomm, Intel Corporation, AMD"}, "estimatedSalary": "105000", "jobDescription": "DescriptionXilinx is the leading provider of All Programmable FPGAs, SoCs, MPSoCs and 3DICs. Xilinx's all-programmable devices are designed into tens of thousands of products that improve the quality of the everyday lives of billions of people worldwide. For over 30 years, Xilinx has been behind some of the greatest advancements in technology and science - from the industry's first fabless semiconductor model to the NASA Curiosity Mars Rover, to today's autonomous vehicles and hyperscale data centers. Xilinx uniquely enables applications that are both software-defined, yet hardware optimized - enabling smart, connected and differentiated applications across technology's biggest megatrends, including Machine Learning, 5G Wireless, Embedded Vision, Industrial IoT and Cloud Computing and more. If you are a passionate, innovative and an out-of-the-box thinker that enjoys challenging projects, Xilinx is the right place for you. Our global team is growing and we are looking for bold, collaborative, and creative people to help deliver groundbreaking technologies that enable our customers to differentiate. Come do your best work and live your best life through collaboration, wellness and giving back to your community as a member of the ONEXILINX team. Staff Software Verification EngineerThis position offers the opportunity to verify many parts of Xilinx software. You will get a chance to tackle many interesting and challenging problems on taking designs from high level programming languages to cutting-edge Xilinx FPGA hardware. Your responsibilities will include -Defining use models, scope, and priority for new software features.Creating test plans from product specifications.Carrying out manual testing of test plans on new features.Maintaining and creating automated tests for various product areas.Collaborating with other testing resources to ensure comprehensive testing of features.Performing manual testing exploring customer design flows.Change request (CR) authoring, validation, and management.Customer issue escalation supportQualification:Strong C++ programming abilitiesKnowledge of computer architecture, especially memory subsystemExperience with OpenCL or CUDA Experience with performance optimization on various hardware platforms including one of the following: ARM, x86, or GPU is a plusExperience with FPGA/SOCs and Data Center workloads is a plusUnderstanding of digital logic design principles.Good time management, organization, teamwork, communication and interpersonal skills.Good analytical skills and motivated to learn.An awesome attitude and passion for solving complex problemsCreates environment and infrastructure to test designs in a customer-like environment, and running test scenarios #ikQualifications:Strong C++ programming abilitiesKnowledge of computer architecture, especially memory subsystemExperience with OpenCL or CUDA Experience with performance optimization on various hardware platforms including one of the following: ARM, x86, or GPU is a plusExperience with FPGA/SOCs and Data Center workloads is a plusUnderstanding of digital logic design principles.Good time management, organization, teamwork, communication and interpersonal skills.Good analytical skills and motivated to learn.An awesome attitude and passion for solving complex problemsCreates environment and infrastructure to test designs in a customer-like environment, and running test scenarios.Education:BS in EE/CE/CS + 7 years of experience, or MS in EE/CE/CS + 4 years of experience, or a PhD."}