{"jobID": "2670371160", "jobLocation": "New_York_NY", "jobTitle": "Intern", "companyRating": null, "companyInfo": {"Website": "www.lrwonline.com", "Headquarters": "Los Angeles, CA", "Size": "201 to 500 employees", "Founded": " 1973", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Ipsos, Millward Brown, Hypothesis"}, "estimatedSalary": null, "jobDescription": "Role As a Market Research Intern you will support your project team in its desire to understand consumers and influence business decisions. Using your attention to detail, creativity and flexibility, you will solve problems and assist team members to help achieve high-quality client results.  About You Education and/or Experience:Business, Math, Psychology, Marketing, Economics, Social Sciences, or other research-related majors preferredPrevious internship or office experience preferredStudents must be currently attending a related course or be interested in learning market research techniques3-4 month commitment, 15-20 hours/week during the school year and 40 hours/week during the summerKnowledge, Skills, and Abilities:Strong written and verbal communication skillsAbility to learn quicklyStrong attention to detailStrong follow-through and analytical skillsAbility to work independently with minimal instructionsMust be dependable and show commitment  What You Will Be DoingExecuting a wide variety of special assignments and administrative tasks related to research projects; including proofreading reports, presentations, and numerical dataCalculating and assisting in data analysis and proofing numerical data for accuracyRe-screening survey participantsProviding switchboard reliefAbout Us LRW is an innovative, fast-growing market research firm with an entrepreneurial culture. Globally recognized for work with top brands and consultative deliverables, LRW delivers more than data to drive strategic change.  What We OfferPaid time off, paid parking, casual dress, fun companywide/team eventsCentrally located offices in exciting locationsPerformance based culture and unlimited opportunityOpportunities for mentorship and formal trainingWORKING CONDITIONS:Professional office environment; uses standard office equipmentProlonged sitting, normal degree of walking; occasional lifting to 15 lbsUp to 15% local and national travel LRW is an equal opportunity employer, and does not discriminate against any employee or applicant because of race, creed, color, religion, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, marital status, pregnancy or related condition, or any other basis protected by law. It is our policy to comply with all applicable national, state and local laws pertaining to nondiscrimination and equal opportunity. Further, the functions, specifications, physical demands, and work environment listed in this job description represent the essential functions of the job which the incumbent must be able to perform either with or without reasonable accommodation. The listed functions and responsibilities do not necessarily include all activities that the incumbent may perform.   "}