{"jobID": "2826812350", "jobLocation": "Seattle_WA", "jobTitle": "Senior Data Analyst - Marketing", "companyRating": "3.3", "companyInfo": {"Website": "www.redfin.com", "Headquarters": "Seattle, WA", "Size": "1001 to 5000 employees", "Founded": " 2004", "Type": " Company - Public (RDFN ) ", "Industry": " Real Estate", "Revenue": " Unknown / Non-Applicable", "Competitors": " Zillow, Trulia, Coldwell Banker"}, "estimatedSalary": "78000", "jobDescription": " Redfin is redefining real estate in the consumer’s favor by combining our own technology and agents to create a service that's better, faster, and costs less. As a Redfinnian, you'll make a difference in one of life's most important events: buying or selling a home. Our hiring standards are high, our culture is humble. If you’re a brilliant analyst with fire in your belly to do work that matters, we want to hear from you.  As a Senior Analyst focusing on Marketing, you'll help Redfin make big and crucial decisions about how to use our marketing firepower as efficiently as we can to help Redfin grow as fast as we can. You’ll partner with Redfin’s Marketing teams to deliver the reports we need to run the business and answer key questions about exactly what we’re getting out of our marketing investments and how we can help Redfin grow ever faster in an increasingly competitive industry. Who You AreSuccessful: We're looking for someone with at least 4 years of on-the-job experience helping businesses make fast decisions in a complex spaceSharp: These problems are tough! You should have a history of outstanding analytical and quantitative skillsPractical: We’re moving quickly and we need rapid answers to business questions. You must be able to build beautiful reports and deliver clear analyses that produce actionable results on the doubleCurious: Redfin is looking for an analytical juggernaut that doesn’t stop at answering the “what” questions. We want someone who hungers for the “why” and “what if” questionsConcise: Communicating your ideas clearly to folks who don’t share your passion for analytics is the mark of mastery.Inspiring: You are a brilliant writer and an influential conversationalist. You know how to work a (meeting) room and translate ideas into solutionsDesired Skills & ExperienceTechnical chops: Tableau, Excel and SQL wizardry are required. Google Analytics experience is preferred. Experience in either R or Python would be a strong plusHistory of success: We're looking for people with a passion for the numbers and data, as well as a demonstrated ability to play an active role in putting your analytical findings into practiceEducation: A bachelor's degree in finance, business, computer science, mathematics, statistics, computer science, or engineering is required.What We OfferCompetitive compensation packages with a salary, bonuses, and stock optionsGenerous benefits, including three weeks of paid vacation, medical, dental, and vision insurance, and fully paid family leaveStrong startup culture with catered lunches, casual dress code, happy hours, and moreAmazingly smart and fun teammates, and a management team invested in your growth and success To make sure we hire the most qualified people, we’ve designed a multi-step selection process which may include interviews, a homework assignment, and a reference check. We’re excited to get to know you and hope you’re ready to give this opportunity everything you’ve got! Redfin is an equal opportunity employer committed to hiring a diverse workforce.Redfin"}