{"jobID": "2817160964", "jobLocation": "New_York_NY", "jobTitle": "Regional Account Manager (NY & Tri-State Territory)", "companyRating": null, "companyInfo": {"Website": "www.tricomquest.com", "Headquarters": "Gardena, CA", "Size": "1 to 50 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Pasona NA, Interesse International, Interplace"}, "estimatedSalary": null, "jobDescription": " Posted on Regional Account Manager (NY & Tri-State Territory)  TriCom Quest  in  New York, NY USA Compensation  $60,000 to $75,000 Annually Benefits Offered  401K, Dental, Life, Medical, Vision Employment Type  Full-Time Why Work Here?“We are a growing consumer goods manufacturing company.”Regional Account ManagerArchitecture Hardware and Industrial ComponentsA leading manufacturer of architectural / industrial components is in search of a Regional Account Manager to handle the New York and Tri-State region. We seek candidates with strong follow-up/follow-through skills and a natural knack for relationship-building to work with architects, designers and industrial clients on a variety of projects.Title: Regional Account Manager for the NY & Tri-State Area Location: Field Status: Direct Hire / Exempt Schedule: Monday – Friday, 8:00am – 5:00pm with 50% travel Compensation: $ 60K – 75K / year base (DOE) + commission and bonus potential Benefits: Health, vision, dental + 401K matching Job Description: · Develop new business while nurturing existing relationships with architects, designers, distributors and OEMs  · Execute market penetration strategies and develop sales objectives  · Act as consultant to dealers, distributors and channel partners by providing merchandising, promotions, product/technical support, product training and host continuing education events  · Participate in trade shows, exhibits, seminars and trade association events  · Industry and competitor market analysis/research  · Provide reporting and presentations on market research, sales activities/results and project updates  · Perform other related duties as assigned Requirements: · Bachelor’s degree in business or related  · At least 3 years of B2B sales experience  · Experience working with architectural OEMs, distributor sales, architects, designers or millworkers is a plus  · Effective negotiation and communication skills  · Strong work ethic with a capacity to learn  · Strong attention to detail and time management skills  · Working knowledge of customer relationship management and product database systems  · Proficiency in Microsoft Office Suite About TriCom Quest:For over twenty years, TriCom Quest has been a leader in the employment consultant industry, providing staffing services for both employers and job seekers, at virtually every level - from entry to executive. Our service spans the United States, providing placements for a broad range of companies, including those headquartered in the Pacific Rim with satellite offices within the United States. Yet what makes us stand out from the employment \"crowd\" is our service. Whether you're hiring employees or in search of a job, TriCom Quest is committed to quality service, from the very first handshake to placement, and beyond.Company website:  http://www.tricomquest.com  Other applicants:  20+ 20+ other people applied to this job.  Posted date:  6 days ago  View all Jobs at TriCom Quest"}