{"jobID": "2767283315", "jobLocation": "Boston_MA", "jobTitle": "Clinical Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.om1.com", "Headquarters": "Boston, MA", "Size": "1 to 50 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " As a member of the Clinical Informatics team, the Clinical Data Analyst’s main responsibility is:  Develop and maintain key data related artifacts, models and solutions that support the company’s goals of delivering quality, accurate and timely data to business users. Data may be available in different formats / structures (flat file, relational database, xml file) and accessed using various tools (SQL query tools, Microsoft office suite, GSuite etc.). This role will perform the following essential tasks: Work intimately with Big Data in very large-scale healthcare data sets in its raw form. The analyst will be working with data from the backend and warehouses of EMR systems; as well as working with pre- and post- adjudicated claims data.Responsible for data analysis, integration and transformation. Work closely with the data governance study group and engineering / data scientist team to define data elements, metadata, master/reference data rules, processes to abstract and integrate data from multiple sources.Create deliverables such as source to target mappings & information model specification documents for data marts.Assist the Data governance study group with the implementation and oversight of company’s policies, standards, practices and technologies related to data management.Requirements1-2 years’ experience in healthcare data analytics fields, using either claims or electronic medical record dataSolid understanding of relational databasesAbility to write SQL codeDemonstrated experience with one or more database, data analysis and data visualization tools such as any relational database, SQL, Microsoft office, Google suites.Strong critical thinking, interpersonal and documentation skill and detail-oriented mindsetPreferred knowledge of healthcare standard terminology (ICD, SNOMED, CPT, NDC, LOINC etc.)Preferred knowledge of programming using Python, SAS, R, T-SQL or PL/SQLB.S. in related field or equivalent experience - basic science, engineering, computer science, health informatics"}