{"jobID": "2830961033", "jobLocation": "Santa_Clara_CA", "jobTitle": "Python Developer", "companyRating": null, "companyInfo": {"Website": "www.htbase.com", "Headquarters": "Toronto, Canada", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Are you looking for a position where you take initial product ideas, engage in requirements clarification discussion, and turn it all into reality? Are you experienced with Python development? Do you get excited about working with an innovative technologies, such as containers, Cloud, Cloud API, virtualization, IoT and others?HTBASE is looking for a Python Engineer to be a part of our team, this role has responsibilities for back-end development. Job Responsibilities:Working with developers, designers, testers, and product managers in a collaborative agile environment to deliver product enhancements on an ongoing basis to live deployment.The Software Engineer will code high-volume software, suggest, collect, and synthesize requirements and create effective feature roadmap.Help architect, build and maintain systems code in Python, as well as other languagesContribute to documentation for both our customers and other engineersCollaborate effectively with othersShip code that is well-tested and survives at internet scaleRequirements:Solid experience with PythonPython data structures and best practicesLinux experienceBash scriptingProfessional experience with a SQL-based database, such as MySQLWrites organized code with appropriate exception handling and loggingUnderstanding of HTTP network requests and responsesUnderstanding of JSON formatsAbility to write technical documentation and comment codeAbility to write test suites and set up automation environmentsBS or Masters degree in Computer Science, related degree, or equivalent experienceExperience with at least one of the cloud providersExperience with containers is a mustWho we are:HTBASE differentiates itself in the IT infrastructure space by delivering on the concept of a true multi-cloud Infrastructure for edge computing, empowering quickly applications and services deployment across multiple cloulds (public and private) and edge devicesBenefits:We strive to create a fun, friendly, and comfortable working environment.We're in this business for the long haul. We give our team time to think and to do things right.Our team is a democracy. Everybody has a voice in how things are done.We want our team to be the best they can be. Each person works with their manager to create and implement a personal development plan. We also offer some benefits such as personal development budget.Competitive SalaryUnlimited personal time offHealth, Dental, and Vision InsurancePizza and beer at the end of each sprintWe would love to hear from you if you have any questions, want to learn more, or just want to say hello!"}