{"jobID": "1968269478", "jobLocation": "New_York_NY", "jobTitle": "Soccer Coach", "companyRating": null, "companyInfo": {"Website": "www.successcareers.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2006", "Type": " School / School District", "Industry": " Education", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "As the fastest growing, highest-performing charter school network in New York State, Success Academy has reimagined public education. Nationally recognized for achieving outstanding academic results for students from all backgrounds and zip codes, we have created an innovative K-12 school model that is preparing current and future generations of children with the subject mastery and skills to succeed in college and life. We now need a results-driven Soccer Coach to join our school community. Key responsibilities include:- Inspiring a profound love of soccer in all students;- Collaborating with other coaches across the network to build a world-class soccer program;- Instilling values of respect, team spirit, passion, modesty, fair play, and individuality within our scholars;- Managing a rigorous after-school soccer program focused on developing scholars’ technical skills at a high level;- Investing parents and families in the transformative role soccer can play in children’s lives; and- Receiving routine, ongoing feedback and support from an outstanding leadership team and faculty.Successful candidates should also have the following experiences and characteristics. They:- Have experience coaching youth club and/or academy soccer;- Have experience coaching futsal (preferred);- Have an USSF National Youth License, USSF B, C, D, or NSCAA license equivalent;- Hold a bachelor’s degree, with an outstanding record of academic achievement and extracurricular leadership;- Are a person of high moral character; and- Are passionate about soccer and learning.To join our team, please upload a cover letter and resume that outlines your candidacy. Your cover letter should explain in detail your qualifications for the position. Resumes without cover letters will not be reviewed.Success Academy Charter Schools is an equal opportunity employer and actively encourages applications from people of all backgrounds. Compensation is competitive and commensurate with experience. Success Academy offers a full benefits program and opportunities for professional growth.Apply"}