{"jobID": "2513525799", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist - Uber for Business", "companyRating": "4.3", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "141000", "jobDescription": " About Uber Were changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now were a part of the logistical fabric of more than 600 cities around the world. Whether its a ride, a sandwich, or a package, we use technology to give people what they want, when they want it. For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer. And thats just what were doing today. Were thinking about the future, too. With teams working on autonomous trucking and self-driving cars, were in for the long haul. Were reimagining how people and things move from one place to the next. Uber for Business is on a path to revolutionize the way businesses manage their ground transportation needs. We need creative, quantitative thinkers with the ability to clearly synthesize and communicate insights from product data to accelerate us down this path. As a Data Scientist on Uber for Business you will work hand in hand with the Product, Marketing, Design, Sales and Engineering teams to keep product development data driven and informed. Candidates are expected to act with high levels of autonomy to guide their teams roadmaps and build their data products. We have multiple roles open with responsibilities spanning all of the following:Predictive modeling of fraud, user behavior and sales opportunitiesExperimental design for product changes (many with difficult constraints)Defining and measuring metrics and KPIsQuantitatively understanding the end-to-end business travel experienceSales and Onboarding optimization What youll need:Quantitative background in Statistics, Computer Science, Math, Economics, Physics or another technical field. Graduate degrees preferred.Extensive experience with common analysis tools - SQL, R, Python, Julia or similar. Demonstrable familiarity with programming concepts.2+ years experience in quantitative analytical roles, preferably product related.Highly analytical and able to extract key insights from data then communicate them clearly and effectively to stakeholders.Ability to work in high growth, ambiguous environment.Advanced knowledge of experimentation and statistical methods. PerksEmployees are given Uber credits every month.The rare opportunity to change the way the world moves. We're not just another social web app, we're moving real people and assets and reinventing transportation and logistics globally.Smart, engaged co-workers.Benefits401(k) plan, gym reimbursement, nine paid company holidays.Full medical/dental/vision package to fit your needs.Unlimited vacation policy; take time when you need it.Be sure to check out the Uber Engineering Blog to learn more about the team.Uber is an equal opportunity employer and enthusiastically encourages people from a wide variety of backgrounds and experiences to apply. Uber does not discriminate on the basis of race, color, religion, sex (including pregnancy), gender, national origin, citizenship, age, mental or physical disability, veteran status, marital status, sexual orientation or any other basis prohibited by law."}