{"jobID": "2748965980", "jobLocation": "Walnut_Creek_CA", "jobTitle": "Innovation Data Analyst / Scientist", "companyRating": "3.4", "companyInfo": {"Website": "csaa-insurance.aaa.com", "Headquarters": "Walnut Creek, CA", "Size": "1001 to 5000 employees", "Founded": " 1914", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable", "Competitors": " GEICO, Allstate, State Farm"}, "estimatedSalary": "92000", "jobDescription": " External candidates: In order for your application to be correctly processed please sign-in before you apply  Internal candidates: Please go to Workday and click \\\"Find Jobs\\\" link under Career  Thank you for considering opportunities with us!  Questions? TalentAcquisition@cs​aa.com​ Job TitleInnovation Data Analyst / ScientistRequisition NumberR2586 Innovation Data Analyst / Scientist (Open)LocationWalnut Creek, CaliforniaAdditional LocationsJob Information Are you a problem solver who can simplify complex assumptions based on research, data, and industry trends? Are you comfortable with automating, querying, manipulating and analyzing large data sets to support a fast-paced, agile development process?  We are looking for an analyst to join our agile Corporate Venture Labs Team supporting mobile initiatives. The analyst will work closely with engineering and marketing teams to technically evangelize best data practices for e-commerce, mobile apps, mobile user acquisition, mobile user engagement and machine learning algorithms.  This team is part of the newly formed Strategy & Innovation function at CSAA Insurance Group. The group’s mission is to ‘innovate our future’ by building new products, services, and ventures that deliver extraordinary value to current and future AAA members. We are aiming high with an audacious goal to generate $1B in new revenue in the next decade. Toward this end, we are launching different pilots that provide innovative solutions from both inside and outside of the insurance sector. The result will be new sources of value and relevance to AAA members and club partners, an expansion and diversification of our business, an associated expansion of our member base, and an advantage in the markets we serve. ResponsibilitiesEnhancing / automating mobile app data tracking using tools such as MySQL, Segment, Periscope, AppsFlyerResearch and import data from various sources to monitor and forecast key performanceProvide recommendations for various projects that are supported by data insightsEnhance machine learning algorithm with our Advanced Technology teamWork towards creating new pricing models for our mobile initiativesRequired:2+ years of experience in a data analytics role; multiple functions experience is preferredSuperior analytical, processing and mathematical skills with ability to review and direct analysisProven oral and written communication skills, including the ability to give formal presentationsOrganizational skill to prioritize tasks and ability to work in a fast-paced environmentIn-depth actuarial industry knowledge and knowledge of the insurance marketplaceBA/BS in Statistics, Computer Science, Applied Mathematics or equivalent combination of education and experiencePreferred:Expert in SQL complex queries and aggregation pipelines for MongodbExpert in Microsoft Excel or other BI toolsExperience with R (ggplot2, R shiny, dplyr), Python (matplotlib, numpy)Master’s Degree in Data Science, Statistics, or Financial EngineeringExperience related to Machine Learning implementations and thorough understanding of their business use cases We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.  *LI-LS1Apply"}