{"jobID": "2650211649", "jobLocation": "Seattle_WA", "jobTitle": "Sr. Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.mty.ai", "Headquarters": "Seattle, WA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Founded in 2014, Mighty AI delivers the human insights which artificial intelligence (AI) engines need to see, hear, talk, and “think” like humans. Our Training Data as a Service™ platform helps companies get the accurate, high-quality datasets they need to train and scale their computer vision and natural language models. Our customers are building game-changing applications that will reshape our lives forever – and for the better! And we help them achieving this goal.  Mighty AI raised a strategic round of financing from Accenture, Foundry, Google Ventures, Intel Capital, Madrona and NEA. We are expanding and improving our innovative platform to provide superior, domain-specific training data efficiently, on demand and at scale. Our goal is to provide a dynamic, optimized combination of human and computer cognition that enables businesses to apply their ML / AI models commercially. Along the way, we are enjoying the journey. We care deeply about not only what we achieve, but also how we do it.  Mighty AI is seeking a results-oriented, experienced data scientist to join our cross-functional team of data scientists, computer vision experts, and software engineers. The right person for this role will have deep expertise in statistical modeling, combined with the practical, results-oriented mindset required to deploy sophisticated models in a customer facing system.  Responsibilities: Maintain, productionalize, and innovatively extend the real-time machine learning models that form the core of Mighty AI’s quality systems.Architect, design, and deliver statistical models that are deeply integrated with our customer-facing production software systemsWrite architectural design documents and own delivery of new featuresProvide technical leadership, mentoring other engineers and data scientists Required: Master’s degree or higher in a quantitative field (PhD preferred)Strong statistical backgroundTechnical depth -- 5-10 years of experience in predictive modeling within a variety of applications and contextsSolid coding skills (R and SQL required, bonus points for Ruby or Python)Experience deploying statistical models in customer facing systemsAble to communicate technical concepts to both technical and non-technical audiencesCreative problem solver, willing to get hands dirtyAbility to thrive in a fast-paced and sometimes ambiguous startup environment Bonus Points for: Experiment design expertiseTrack record of technical leadership"}