{"jobID": "2766282736", "jobLocation": "Seattle_WA", "jobTitle": "Intern, Quantitative Investment Strategy", "companyRating": null, "companyInfo": {"Website": "www.russellinvestments.com", "Headquarters": "Seattle, WA", "Size": "1001 to 5000 employees", "Founded": " 1936", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Role Summary As part of the Investment Strategists’ Team (IST), the intern will take a prominent role expanding and improving the capabilities of Russell’s core short term forecasting models under the guidance of quantitative investment strategists. The responsibilities of the individual in this position include:Actively help improve the existing modeling framework by implementing financial research in a collaborative software environment Design, write and document scalable code in Python, R, and MatlabResearch new methodologiesAutomate model run proceduresTest and refine model covariate specificationsAssist in the creation of regular deliverables by updating data and running models.Be intellectually curious and genuinely like solving puzzles.The successful candidate will have extensive demonstrable skills and experiences including the following:Computer programming skills Required: Experience with Python, Matlab, R, Excel.Preferred: Experience in Linux environmentBonuses: Undergraduate degree in computer scienceC++, JavaFinancial/economics background Required: Interest in financial modeling, portfolio optimization, and time-series econometricsPreferred: Basic understanding of quantitative financial modeling, trading strategies, portfolio optimization, and time-series econometricsSome exposure to data providers (e.g. Datastream, Factset, Bloomberg) and macroeconomic/financial databases (e.g. FRED)Bonuses: Start-to-finish research experience that includes literature review, developing a methodology/model, implementing and testing the model in statistical software2 years advanced training working and/or studying in finance, economics or statisticsSoft skills Required: Ability to work autonomously and as a team on a wide range of projects simultaneously under tight deadlinesSelf-motivated drive to solve puzzles, whether it’s investigating trading strategies or troubleshooting computer code. Takes initiatives to make improvements.Verbal and written presentation skills with particular emphasis on communicating statistical, econometrics and financial concepts to both a technical and non-technical audienceCredentials: Required: Pursuing Master's degree in finance/economics/statisticsBonus: progress towards a PhDRussell Overview Russell Investments is a global financial services firm that serves institutional investors, financial advisors and individuals working with their advisors in more than 40 countries.  Founded in 1936, Russell Investments is one of only a few firms that offers actively managed multi-asset portfolios and services that include advice, investments and implementation. With core capabilities extending across capital market insights, manager research, asset allocation, portfolio implementation and factor exposures Russell Investments stands with clients to achieve their desired investment outcomes.  A pioneer, Russell Investments began its strategic pension fund consulting business in 1969 and today is a consultant to some of the largest pools of capital in the world. With four decades of experience researching and selecting investment managers, meeting annually with more than 2,200 managers around the world, Russell Investments is well-known worldwide for its investment advice.  Headquartered in Seattle, Washington, Russell Investments operates globally with 21 offices (as of August 2016) across the world, providing Investment Services in the world’s major financial centers, including London, Paris, Amsterdam, Sydney, Tokyo, Shanghai, San Diego and New York.  Russell Investments offers a competitive compensation and benefit package to associates including: medical, vision and dental coverage; a profit-sharing retirement plan; sabbatical leave every 10 years; and tuition assistance. Most importantly, Russell Investments offers a work environment where respect for the individual and teamwork are part of our fundamental values. As an Equal Opportunity Employer, Russell Investments supports workforce diversity."}