{"jobID": "2808680780", "jobLocation": "Redmond_WA", "jobTitle": "Jr Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.wimmersolutions.com", "Headquarters": "Seattle, WA", "Size": "51 to 200 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Xtreme Consulting, Slalom, Revel Consulting"}, "estimatedSalary": null, "jobDescription": "JUNIOR DATA ANALYST Our Client is looking for a Jr. Data Analyst to join their growing team. This Data Analyst will provide data that is accurate, congruent, and reliable, and ensure the information is easily available to users for direct consumption or integration with other systems. You will work closely with internal clients and development teams to turn data into critical information and knowledge that can be used to make sound business decisions. This role will be working with the university recruiting efforts of our client and offer a great chance to join the front-lines of a major player in the technical world. RESPONSIBILITIESData de-duplication: matching and merging dataData cleansing: matching, linking, updating records, such as organization records, in batch and real timeHierarchy management: identifying, creating, correcting, update, and maintaining complex relationships among parent and child recordsData conversion: changing / transforming the data based on business rules, usually done before the data is integrated into a new systemRaise escalations and communicates issues to Project LeadDesign, and document dashboards, alerts, and reports either on a regular recurring basis or as neededMay perform analysis for a wide range of requests using data in different formats and from various platformsREQUIREMENTSUndergraduate or Master studies student with high GPA2+ years of relatable work experienceAbove average excel skills (vlookups, creating pivots, and basic functions at minimum)Experience with PowerBi or similar system,Proficient in English (verbal and written)Advanced computer literacyTeam-oriented attitude and excellent interpersonal skillsCommitment to accuracy, quality and attention to detailsPREFERRED QUALIFICATIONSExperience in Recruiting field or related industryMore about Wimmer Solutions At Wimmer Solutions, we’ve built a reputation for results-driven, innovative, business and technology solutions that help companies execute on their strategic initiatives. We custom tailor our services to fit our clients’ needs from consulting and technology process outsourcing to interim technical talent resourcing.  We’re all about people and community. Since 2002, we have offered technology staffing and managed services for the great Seattle area. We focus on getting to know our clients and candidates to create lasting partnerships and ensure success. Not only do we provide a wide variety of benefits like medical and dental, but we are also committed to inspiring and creating positive change in the world with our community outreach programs. You will join a large team of professionals who are passionate about their careers as well as their community. For more career opportunities or to refer a friend, please visit http://wimmersolutions.com/careers."}