{"jobID": "2821697717", "jobLocation": "Seattle_WA", "jobTitle": "Sr. Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.fiveby.com", "Headquarters": "Mercer Island, WA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " FiveBy has an exciting opportunity for a Sr. Data Analyst (you?) to innovate, influence, transform and inspire on cutting-edge tech. We encourage you to apply to learn more!  The Sr. Data Analyst will assume an integral role in engineering solutions for our client. The work will involve querying and analyzing large amounts of complex and disparate data to derive insights. The successful candidate will excel at interpreting business needs and creating data solutions which help solve for issues both known and unknown. This position will work closely with Business Owners, Developers, Systems Engineers and Operations teams to provide excellent support for the client’s analytics and reporting systems.  The ideal candidate shall demonstrate the ability to work with minimal supervision, exhibit accountability and possess excellent interpersonal communication skills and experience in working with customers, vendors, subcontractors, and non-engineering personnel.  Primary Responsibilities: Leverage data analysis and visualization skills to solve strategic business problemsAnalyze complex data sets to detect patterns and anomaliesClearly communicate analysis to the team and clientServe as a data analytics subject matter expert for the team Qualifications: 5+ years of experience in data analytics, quantitative analysis, or data modeling5+ years SQL experience3+ years of experience using Tableau, Qlik, Power BI, or other data visualization tools3+ years of experience in Python, R, or other scripting languagesAbility to communicate complex quantitative analysis in a clear, precise, and actionable manner2+ years of experience in machine learning preferredExperience with supply chain management or anti-piracy is beneficial The Sr. Data Analyst role requires a self-starter, comfortable with ambiguity and able to create and maintain efficient and accurate models. Additionally, the successful candidate will be detail oriented and possess the ability to work well with cross-functional teams. If this sounds like you, please submit your resume today!  FiveBy is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form."}