{"jobID": "2828411149", "jobLocation": "San_Francisco_CA", "jobTitle": "Analytic Consultant 5 - Business Data Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.wellsfargo.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1852", "Type": " Company - Public (WFC) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "96000", "jobDescription": "Job DescriptionAt Wells Fargo, we want to satisfy our customers financial needs and help them succeed financially. Were looking for talented people who will put our customers at the center of everything we do. Join our diverse and inclusive team where youll feel valued and inspired to contribute your unique skills and experience.  Help us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you. Wells Fargos Chief Administrative Office (CAO) consists of enterprise functions that work together to promote and protect the Wells Fargo culture and brand, and support our team members. Groups within CAO work to protect our reputation, tell our story, bolster team member engagement, connect with our customers, and bring new and innovative solutions to life. CAO functions include Commitment to Customer, Corporate Responsibility & Community Relations, Data Management & Insights, Human Resources, Marketing, Stakeholder Relations, and the CAO Integration and Planning Office.  The Wholesale Data Office team delivers trusted, reliable data which drives strategic decisions, enables business growth, and facilitates a strong risk discipline. We enable usage of common data that is complete, trusted, understood, and aligned with our financial reporting.  This position will be supporting our iHub service with the Business Data services team. ihub is an authorized provision point which standardizes common foundational data and distributes to downstream applications and reporting services.  The position will support a number iHub workstreams tied to risk, regulatory and internal business line initiatives primarily focusing on loan and leasing data supporting our eOne initiatives. The eONE initiative seeks to build a 'one number' instrument data foundation that is complete, reliable, and aligned to the general ledger. The initiative will also establish the authoritative data source for common data elements between Corporate Finance and Corporate Risk management to support in scope risk and regulatory reporting. eONE will create a federated, coordinated set of applications and databases to support risk and finance, which will allow for agile and accurate risk and regulatory reporting and analytics that complies with BCBS 239, G&O; and the Wells Fargo Enterprise Data Governance Policies and Standards Key Responsibilities Include: The applicant should have a strong data management, Wholesale business background, and experience leading project workstreams. You will be expected to perform complex analysis of datasets, build data mapping, and conduct data validation. You will have the opportunity to interact with business and technology partners across Wholesale such as Risk, Finance, Lines of Business, and Systems of Record owners.Required Qualifications8+ years of experience in one or a combination of the following: reporting, analytics, or modeling; or a Masters degree or higher in a quantitative field such as applied math, statistics, engineering, physics, accounting, finance, economics, econometrics, computer sciences, or business/social and behavioral sciences with a quantitative emphasis and 5+ years of experience in one or a combination of the following: reporting, analytics, or modeling3+ years of commercial lending experience3+ years of experience with SAS or SQL, or other data management, reporting and query tools4+ years of experience in one or a combination of the following: data management, metrics & business intelligence, data warehouseDesired QualificationsExtensive knowledge and understanding of research and analysisStrong analytical skills with high attention to detail and accuracyExcellent verbal, written, and interpersonal communication skillsAbility to articulate complex concepts in a clear mannerAbility to work and influence successfully within a matrix environment and build effective business partnerships with all levels of team membersKnowledge and understanding of data governance challenges and approaches: metadata, data quality, and data stewardshipManagement experience in an matrixed organization environmentOther Desired Qualifications Proven experience working with data problems to solve and come up with innovative ideas and make things happen without management direction Knowledge and understanding of wholesale banking: products, platforms, policies, processes, and procedures Experience with database platforms such as Oracle, Hadoop, or Teradata Techno-functional skills with exposure to various banking products Logical thinker and problem solver. Takes analytical, creative approach to problem solving Positive, people oriented, and energetic attitude Strong communication skills to effectively work with Finance, Risk, Regulatory, and remote team members Ability to manipulate data from non-normalized or disparate data sources Clear understanding of data warehousing principles, dimensional data and data modeling Preferably experience with Oracle Financial Services Data Foundation(FSDF) implementationDisclaimerAll offers for employment with Wells Fargo are contingent upon the candidate having successfully completed a criminal background check. Wells Fargo will consider qualified candidates with criminal histories in a manner consistent with the requirements of applicable local, state and Federal law, including Section 19 of the Federal Deposit Insurance Act.  Relevant military experience is considered for veterans and transitioning service men and women.  Wells Fargo is an Affirmative Action and Equal Opportunity Employer, Minority/Female/Disabled/Veteran/Gender Identity/Sexual Orientation."}