{"jobID": "2792347047", "jobLocation": "Austin_TX", "jobTitle": "IRIS Data Scientist/Principal Supplier Process Engineer - Austin, TX", "companyRating": "3.8", "companyInfo": {"Website": "www.dell.com", "Headquarters": "Round Rock, TX", "Size": "10000+ employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " IBM, Apple, HP Inc."}, "estimatedSalary": "100000", "jobDescription": "R34503 IRIS Data Scientist/Principal Supplier Process Engineer Austin, Texas What gives Dell our competitive advantage? Its our ability to achieve cost savings as we operate at the cutting edge of technology. Working in an environment thats as complex as it is critical, our Buyer team within Materials and Procurement manages a group of indirect categories, such as real estate, marketing material, supplies or software. We use our in-depth knowledge and experience to develop strategic relationships with external suppliers as well as with key stakeholders. Our role also includes leading contract negotiations, managing risk, driving cost-saving initiatives and implementing strategic sourcing best practices. Role Overview We are actively looking for talented and motivated individuals to join our supply chain data analytics team. You will be using data to solve challenging problems that inform business decisions to create value for the company. If you are curious by nature and inspired by how data is changing the world, then we are interested in talking with you.  This role will focus on utilizing analytics to further advance Dells competitiveness in the areas of supply chain procurement, planning and quality and includes Role Responsibilities -You are passionate about asking and answering questions in large datasets  -You have a strong desire to create strategies and solutions that challenge and expand the thinking of everyone around you  -You have comfortable with or are highly motivated to learn and apply database tools and statistical predictive models by analyzing large datasets with a variety of tools (R, Python, SQL, Microsoft PowerBI and Tableau)  -You desire a fast paced, collaborative and iterative environment  -You love learning, data, scale and agility. You excel at making complex concepts simple and easy to understand by those around you  -Youre driven to show the world the power of applied analytics  -You are curious and enjoy diving deep into data to find answers to yet unknown questions and have a natural desire to go beneath the surface of a problem  -You are a thinker who can ask the right business questions  -You ask relevant questions and possess the skills to build algorithms necessary to find meaningful answers  -You think strategically about how to use data to drive competitive advantages  -You can creatively visualize and effectively communicate data findings and insights in a variety of formats Requirements Requirements  -8+ years of related experience with a Bachelors degree in Engineering, Statistics, Computer Science or Data Sciences; or 6+ years with a Masters degree  -Advanced knowledge of statistics utilizing statistical programming languages (R, Python, etc.)  -BI, Data Mining, Machine Learning experience  -Proficient in SQL Preferences -PhD in Engineering, Statistics, Computer Science, Business Analytics, or Data Sciences  -Advanced knowledge of Microsoft BI Stack  We offer highly competitive salaries, bonus programs, world-class benefits, and unparalleled growth and development opportunities all to create a compelling and rewarding work environment. Company Description With more than 100,000 team members globally, we promote an environment that is rooted in the entrepreneurial spirit in which the company was founded. Dells team members are committed to serving our communities, regularly volunteering for over 1,500 non-profit organizations. The company has also received many accolades from employer of choice to energy conservation. Our team members follow an open approach to technology innovation and believe that technology is essential for human success. Why work with us?Life at Dell means collaborating with dedicated professionals with a passion for technologyWhen we see something that could be improved, we get to work inventing the solutionOur people demonstrate our winning culture through positive and meaningful relationshipsWe invest in our people and offer a series of programs that enables them to pursue a career that fulfills their potentialOur team members health and wellness is our priority as well as rewarding them for their hard workDell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Learn more about Diversity and Inclusion at Dell here.  Come join us! For More Information, visit us on the web at www.dell.com/careers.  LIPriority"}