{"jobID": "2746378207", "jobLocation": "Lexington_MA", "jobTitle": "HRIS Compensation & Data Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.ll.mit.edu", "Headquarters": "Lexington, MA", "Size": "1001 to 5000 employees", "Founded": " 1951", "Type": " Company - Private", "Industry": " Aerospace & Defense", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "80000", "jobDescription": " HRIS Compensation & Data Analyst  Apply now » Apply now  Start apply with LinkedIn Start apply with Facebook Apply Now StartPlease wait...Date: Jun 22, 2018 Location: MA, US#job-location.job-location-inline {  display: inline;  }Company: MIT Lincoln LaboratoryRequisition ID: 24185  The Human Resources Department is customer focused in the design and delivery of services to employees, managers, and candidates. Services include the oversight of MIT Lincoln Laboratory's recruiting programs, including college recruiting, summer undergraduate and graduate programs, and student co-op programs. Additionally, the department supports the Laboratory's diversity and inclusion efforts, manages training and career development, and administers compensation and performance management systems. The department also provides benefits counseling and administration, supports employee and labor relations programs, and manages Human Resources Information System data and applications.  The ideal candidate must be able to present data in a format appropriate to various levels of the business. Support on-going technical reporting responsibilities, including but not limited to, SAP performance appraisal, Training and Learning solutions, General Hire to Retire employee and subcontractor analysis and reporting. Be able to manage projects from conception to conclusion.  Principal Duties: Work within the existing team to support SAP HCM and BW/BI analytics and reportingWork within the existing team to support ongoing SAP HCM configurationWork with the HR Compensation lead to produce and analyze “Survey Data” Job Requirements: 5+ years of experience with compensation and/or analytics specifically around handling HR or other sensitive dataBachelor’s degree in Computer Science, Statistics, or IT related field preferredAdvanced knowledge of Microsoft applications including Excel, Word and Power PointDemonstrated ability to synthesize and present information in a meaningful way that supports decision making.Experience with Business Objects Enterprise desiredExperience with other reporting and analytical tools like Microsoft BI or R desiredStrong analytical, problem solving and communication skills are necessary to work in a consultative role with users. MIT Lincoln Laboratory is an Equal Employment Opportunity (EEO) employer. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, veteran status, disability status, or genetic information; U.S. citizenship is required. Apply now » Apply now  Start apply with LinkedIn Start apply with Facebook Apply Now StartPlease wait..."}