{"jobID": "2795137584", "jobLocation": "San_Jose_CA", "jobTitle": "Asset Protection Associate", "companyRating": "3.8", "companyInfo": {"Website": "www.bestbuy.com", "Headquarters": "Richfield, MN", "Size": "10000+ employees", "Founded": " 1966", "Type": " Company - Public (BBY) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "14", "jobDescription": "What does a Best Buy Asset Protection Associate do? At Best Buy our mission is to leverage the unique talents and passions of our employees to inspire, delight, and enrich the lives our customers through technology and all its possibilities. If you have a passion and curiosity for what is possible and enjoy people, we invite you to join us on this mission.A Best Buy Asset Protection Associate coaches and leads employees in asset protection best practices to ensure a safe, secure and profitable environment throughout the store. They work with the Asset Protection Lead to resolve any hazards or compliance issues and investigate any accidents. They also demonstrate preparedness and exhibit behaviors for proper emergency response procedures.At Best Buy we give you plenty of ways to challenge yourself. Youll find working in a high-paced retail environment increases your ability to solve problems, multitask and work in a team environment. Further, our leadership is committed to helping you succeed in your current role and prepare you for the next through coaching and performance appraisals.40% of your time you will:Monitor the store for potential security risks and alarm function.Protect against fraudulent activity by creating AP Alerts and reporting and documenting incidents properly when necessary.30% of your time you will:Teach and coach store employees about the principles, standards and policies related to safety and crisis events and monitor their fulfillment.Work with the Asset Protection Lead and others to resolve any hazards or compliance issues and investigate any employee or customer accidents.30% of your time you will:Interact with customers and store employees to maintain a safe and profitable environment.What are the Professional Requirements of a Best Buy Asset Protection Associate?Basic QualificationsAbility to work successfully as part of a teamAbility to work a flexible schedule inclusive of holidays, nights and weekendsAbility to lift or maneuver 50-100 pounds, with or without accommodationsPreferred Qualifications3 months experience in retail, customer service or related fields"}