{"jobID": "2810528801", "jobLocation": "Playa_Vista_CA", "jobTitle": "Quantitative Market Research Intern - Entertainment and Media Industry Opportunity", "companyRating": "3.1", "companyInfo": {"Website": "www.added-value.com", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "45000", "jobDescription": " STRATEGIC MARKETING THAT WORKSQuantitative Market Research Intern  Los Angeles, CA  The Quantitative Market Research Interns are exposed to all areas of the business and all levels of work. They are immersed from the very beginning, and are given a number of opportunities to learn, grow, and contribute. Our Added Value - Los Angeles office is an open, fun, and creative environment. Our employees are passionate about what they do, and have strong relationships with each other. Your fit within our team is important we look for individuals who are not just focused and on top of their work, but are spirited, fun, expressive, and able to think differently and creatively. Internships are full time (40-hour work week), typically last 4 months.  At Kantar Added Value, we help world-famous brands champion issues and deliver experiences that customers genuinely want to engage with. A creative marketing consultancy based in 9 countries, our strategic insight adds value to different businesses and inspires new thinking to transform brands and shape the world we live in. Join us and youll be part of 30,000 colleagues and 12 world leading research, data and insight brands at Kantar. At the heart of WPP, our unique consumer insight inspires clients to flourish in an extraordinary world. WHAT WERE LOOKING FOR We are looking for candidates that possess a keen desire to understand what makes consumers tick, to grasp the deep-rooted psychology of why someone chooses one brand over another.  Digitally savvy : Immersed in the rapidly changing world of communications and the impact of digital on the insights business, including the latest thinking in how brands are strategically using social media, multi-channel campaign analysis, new approaches to sampling and questionnaire design. KEY OUTCOMES Work closely with senior team members on multiple consumer research studies across a variety of industries and clients.  Assist with project set-up and coordination.  Help team proof and analyze high-level data on a variety of subjects.  Help prepare informal and formal client reports and presentation materials. CAPABILITIES College Graduate- Bachelor degree in (Marketing, Psychology, Sociology, Economics or Business focus) or Graduating in the next couple of months.  Previous internship in an Advertising agency/Market Research environment a plus.  Microsoft Office (Word, Excel, PowerPoint); other statistical software experiences a plus but not necessary.  Detail-oriented, self-starter, fast learner, creative, enthusiastic and conscientious.  Must have excellent organizational and writing/logic skills. WHAT WE OFFER Leading light: the opportunity to work for one of the leading marketing insight and brand consultancies in the world, with all the benefits of being part of an extensive international network and the WPP group.  Inspiring people: all our people have exceptional and diverse backgrounds, research and brand experience so there is a wealth of wisdom to learn from as well as the opportunity to inspire others  Mentor mentality: we operate a buddy-system, where management provides coaching to ensure our talent is well nurtured and able to perform to the highest standards.  Training: tailored to individuals needs to equip them with the skills and knowledge to drive their own development and push thinking further for our clients.  License to play: a fun and social environment, where play and experimentation are strongly encouraged anything that broadens horizons, builds team spirit and sparks inspiration is highly valued. JOIN US At Kantar we have an integrated way of rewarding our people based around a simple, clear and consistent set of principles. Our approach helps to ensure we are market competitive and also to support a pay for performance culture, where your reward and career progression opportunities are linked to what you deliver.  We go beyond the obvious, using intelligence, passion and creativity to inspire new thinking and shape the world we live in. Apply for a career thats out of the ordinary and join us."}