{"jobID": "2829247611", "jobLocation": "San_Jose_CA", "jobTitle": "NetSuite Senior Consultant", "companyRating": null, "companyInfo": {"Website": "www.frankrimerman.com", "Headquarters": "Palo Alto, CA", "Size": "201 to 500 employees", "Founded": " 1949", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Requisition Number 18-0014 Title NetSuite Senior Consultant City San Jose State CA DescriptionFrank, Rimerman Consulting, a division of Frank, Rimerman + Co. LLP, is a value-added  reseller of NetSuite. The software is the worldwide leader in cloud-based ERP solutions for companies and nonprofits of all sizes. With capabilities for financial accounting, purchasing, sales, time & expense management, inventory management, manufacturing,  multi-currency, consolidations, reporting & analytics, and industry-based dashboards, the platform enables organizations to make better, faster, more collaborative decisions that drive a true competitive advantage. Description: You will serve as part of an implementation team, under the direction of a Project  Manager, assisting clients in migrating from their existing accounting/ERP solution to NetSuite. You will be responsible for module configuration, data conversion, end-user training, and custom report writing. The successful candidate must work well in a team  environment while being a resourceful, independent self-starter able to work effectively with minimal direction. A Bachelor's degree in Accounting, Finance, Computer Information Systems or a an equivalent field and . Advanced Excel skills are essential and  experience with ERP/accounting applications is desired. This position will be can be based out of our San Jose office or remotely for the right candidate. The employee will complete training and certification requirements during their first six months while  working with the Frank, Rimerman Consulting team. Duties and Responsibilities:As a project team member work with project lead/managers to execute NetSuite  implementations and changes to existing systems using the firm's project methodologyEnsure completion of tasks, milestones, and components including but not limited  to functional specifications, design specifications, configurations, quality assurance, implementations, and project reviewsWork as a member of the implementation team to design changes to existing systems  and integrate new systems into client's infrastructureWork alongside the project lead to implement process improvements with systematic  solutionsTrain end users on how to effectively use financial systems features and applicationsDevelop customized saved searches for shared business user usage and to support  integration needsDevelop informational reportsTake a hands-on approach to troubleshooting Requirements Bachelor's degree in Accounting, Finance, Computer Information Systems or an equivalent field3-5 years’ experience in a back office accounting or finance role, including GL accountant, staff accountant, assistant controller, or financial systems technician are highly preferredExcellent written and verbal communication skillsStrong problem-solving skillsHighly skilled with MS Excel, Word, and other Office products, and technology literate in generalExtremely organized, detail-oriented and able to manage multiple projects simultaneouslyExperience with ERP/accounting solutions desired Apply Online Send This Job to a Friend"}