{"jobID": "2806571009", "jobLocation": "New_York_NY", "jobTitle": "Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.barclays.com", "Headquarters": "London, United Kingdom", "Size": "10000+ employees", "Founded": " 1690", "Type": " Company - Public (BARC) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Deutsche Bank, HSBC Holdings, Royal Bank of Scotland"}, "estimatedSalary": "95000", "jobDescription": "Job Title: Data AnalystLocation: 1301 Ave of the Americas, New York, New YorkAbout  Us Barclays  is a transatlantic consumer, corporate and investment bank offering products  and services across personal, corporate and investment banking, credit cards  and wealth management, with a strong presence in our two home markets of the UK  and the US. Our goal is to become the bank of choice by providing superior  services to customers and clients and supporting our stakeholders via a  commercially successful business that generates long-term sustainable returns.  About Barclays in the US  Barclays offers corporate  and investment banking and credit card services in the US. Our 10,000 US  colleagues are located in offices across the country, with headquarters in New  York City. In 2017, Barclays announced plans to create a world-class campus in  Whippany, New Jersey, for our Technology, Operations and Functional teams in  the US. Other principal locations include Delaware, Nevada, Ohio and Maine.  About Global Markets Operations  Global Markets Operations is  part of CIBD operations and is made up Operations support for Trading and  Funding Desks, Settlements, Core Custody, Financial Monitoring & Control,  and post drawdown management & Collateral.  Overall purpose of role Provide Business Analysis  and Data modelling design solutions for building Data fabric as part of  target state architecture within post trade services space for Operations  and technology IT supporting Equities, Institutional and Prime  businesses.Planning and facilitating  requirements gathering sessions with the global front, middle and back  office teams and come up with solution to address via data store  capabilities.Capturing and preparing  business and functional requirements using structured analysis techniques.  Facilitating business comprehension and sign off of requirements  documentation.Managing business  interaction through iterative development and testing cycles.Your  RoleCollaborate with an  experienced team of SMEs, Operations, Dev managers, Engaging stakeholders  both onshore and offshore and understand the requirements for defining  data fabric solution mainly for data hydration and distribution to build  reporting framework out of ODS.Engage with stakeholders and  3rd party vendors and external agencies, [Eg: Broadridge, DTCC,  BONY,SRO’s, CCP’s] to understand the data supplied and achieve goals to  defining the data models.Conduct specific business  analysis tasks as directed by the management teamFacilitate the delivery of  optimal end to end business data models.Provide input to communicate  status and updates to the stakeholders across the Barclays International  franchise.Maintain awareness of  business structures/process /change /volume change & other business  function dynamics to ensure data analysis & frameworks are current  & focused.Effectively track &  report progress on changes to business processes.Basic  Qualifications/Skills8 years of Business  Analysis /Data analytics for Investment Banking Capital Markets Domain3 years of Data modelling  in IB Domain, Capital Markets across Equities and Fixed Income asset  classes3 years working on data  attributes used to define various data models like Trades, Securities  Positions and Cash3 years working within  Operations across front or middle or back office data2 running SQL Query basicsPreferred  Qualifications/SkillsProblem solving skills to  review operational data issues and provide a solution by defining a data  strategyHaving operations background  is a plusWorking knowledge as Data  Scientist and helping build Data Lineage strategyExperience working in  various Settlements and Sub ledger functions like PNS, Stock Record  and Settlements, PnLKnowledge in BPS and IMPACT  products from BroadridgeExpertise in ability to  build SQL queriesRisk and  Control Objective All Barclays  colleagues have to ensure that all activities and duties are carried out in  full compliance with regulatory requirements, Enterprise Wide Risk Management  Framework and internal Barclays Policies and Policy Standards. Your Application To be  considered for this role, click on the apply button now. Barclays  Values & Diversity Dynamic working gives  everyone at Barclays the opportunity to integrate professional and personal  lives, if you have a need for flexibility then please discuss this with the  hiring manager. We are an equal  opportunity employer and we are opposed to discrimination on any grounds. It is  the policy of Barclays to ensure equal employment opportunity without  discrimination or harassment on the basis of race, colour, creed, religion,  national origin, alienage or citizenship status, age, sex, sexual orientation,  gender identity or expression, marital or domestic/civil partnership status,  disability, veteran status, genetic information, or any other basis protected  by law."}