{"jobID": "2711592608", "jobLocation": "El_Segundo_CA", "jobTitle": "Signal Processing Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.aerospace.org", "Headquarters": "El Segundo, CA", "Size": "1001 to 5000 employees", "Founded": " 1960", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "120000", "jobDescription": "Requisition ID: 39931All Locations: El Segundo, CA (California)  A trusted partner. A national resource. A leader in national security space. We are THE Aerospace Corporation. A team that takes pride in our readiness to solve some of the most complex technical challenges in existence. With challenges spanning clandestine to commercial, you’ll have the unique opportunity to work on projects that are literally evolving our nation's space and launch capabilities. We all share a common passion and aspiration – to serve a mission much bigger than ourselves. When you join our team, you’ll be part of a rare collection of thought leaders and game-changing innovators. Are you ready to launch your career?Responsibilities The Aerospace Corporation’s Digital Communications Implementation Department uses software define radio and FPGA technology to design digital transceivers. We conduct our own research and development and in this position you can have the opportunity to innovate in algorithm design. Join us on the leading edge of digital communications development.  To be successful in this role you must have a strong theoretical data science and preferably some signal processing experience. We are looking for a candidate that is extremely hands-on with the ability to lead small groups of engineers. Additionally, you should be eager to explore modern techniques and unconventional methods for algorithm design and problem-solving. Key FunctionsWorking in a digital communication team whose main objective is to solve signal processing / digital communication problems using data science.This position requires a strong theoretical digital communication foundation and to be very hands-on.Experience required in Data Science which includes: data-centric problem formulation, data cleaning hands-on experience as well as knowledge of classification and regression.Conduct specialized technical studies, lead internal research and development efforts.Candidate should be eager to explore modern techniques and unconventional methods for algorithm design and problem-solving.We are looking for a person who can work and lead small groups of engineers. The nature of our work requires the candidate to work on a couple of projects simultaneously. This position has a very limited proportion of systems engineering work.We expect the chosen candidate to be able to be an active software developer in some of the programming languages described below.QualificationsRequiredMinimum of 5 - 8 years of experience since obtaining a bachelor's degree.Experience in data science projects.Familiarity with one or more of the following programming languages: Python, C/C++ and MATLAB within Unix/Linux programming environments.Working knowledge of Machine Learning libraries in any language.Strong written and verbal communication skills.This position requires the ability to obtain and maintain a security clearance, which is issued by the U.S. government. U.S. citizenship is required to obtain a security clearance.PreferredAdvanced degree in the area of digital communications, machine learning or signal processing.Experience working with Linux, and development on a Linux platform.Hands-on experience implementing data-science solutions in Python.Familiarity with TensorFlow, Theano, Keras.Experience in implementing data science algorithms on GPUs.Familiarity with Agile methodology.Current and active secret clearance.Transcript Requirement Transcripts are required for this position.Additional Requisition DetailsSystem Job Title: MEMBR-TCH STF SR Clearance Requirement: Secret Access: None Polygraph: None Relocation Available: Yes Employment Type: Regular Work Schedule: Full Time Company Statement The Aerospace Corporation has provided independent technical and scientific research, development, and advisory services to national security space programs since 1960. We operate a federally funded research and development center (FFRDC) for the United States Air Force and the National Reconnaissance Office, and support all national security space programs. We also apply more than 50 years of experience with space systems to provide critical solutions to technologically complex systems in such areas as communications, shipping, law enforcement, and cyber, among others.  From our inception, our highly skilled technical staff has focused on ensuring the success of every mission and developing the most effective and economic space-related hardware and software in the world. Our greatest asset is the technical expertise of our people. Our state-of-the-art laboratory facilities are staffed by some of the leading scientists in the world. Equal Opportunity Commitment The Aerospace Corporation is an Equal Opportunity/Affirmative Action employer. We believe that a diverse workforce creates an environment in which unique ideas are developed and differing perspectives are valued, producing superior customer solutions. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, gender, gender identity or expression, color, religion, national origin, sexual orientation, protected veteran status, or disability status.  You can also review The Equal Employment Opportunity is the Law poster and the supplement, as well as the Pay Transparency Policy Statement. Nearest Major Market: Los Angeles Job Segment: Database, Scientific, Engineer, Scientist, Secret Clearance, Technology, Engineering, Science, Government"}