{"jobID": "2827163482", "jobLocation": "Milpitas_CA", "jobTitle": "Applications Intern", "companyRating": null, "companyInfo": {"Website": "www.kla-tencor.com", "Headquarters": "Milpitas, CA", "Size": "5001 to 10000 employees", "Founded": " 1976", "Type": " Company - Public (KLAC) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Applied Materials, Nanometrics"}, "estimatedSalary": null, "jobDescription": " Company Overview  Calling the adventurers ready to join a company that's pushing the limits of nanotechnology to keep the digital revolution rolling. At KLA-Tencor, we're making technology advancements that are biggerand tinierthan the world has ever seen.  Who are we? We research, develop, and manufacture the world's most advanced inspection and measurement equipment for the semiconductor and nanoelectronics industries. We enable the digital age by pushing the boundaries of technology, creating tools capable of finding defects smaller than a wavelength of visible light. We create smarter processes so that technology leaders can manufacture high-performance chipsthe kind in that phone in your pocket, the tablet on your desk and nearly every electronic device you ownfaster and better. We're passionate about creating solutions that drive progress and help people do what wouldn't be possible without us. The future is calling. Will you answer?  Group/Division  The Global Service Support Organization (GSS) team headquartered in Milpitas, CA is our service organization that consists of Service Sales and Marketing, Spares Supply Chain management, Field Operations, Product Training, and Technical Support. The GSS organization partners with our field teams and customers in all business sectors to maintain the high performance and productivity of our products through a flexible portfolio of services. Our comprehensive services include: proactive management of tools to identify and improve performance; expertise in optics, image processing and motion control with worldwide service engineers, 24/7 technical support teams and knowledge management systems; and an extensive parts network to ensure worldwide availability of parts. Responsibilities KT Pro group is responsible for sales/marketing and applications support of fully refurbished pre-owned systems, mature tools upgrades and product enhancements, buybacks, re-marketing and flexible trade-in programs for surplus tools.  KT Pro Applications organization is responsible for coordination of customer sold tools acceptances, applications training on systems, demos, STRs, source inspections, RFQ and spec responses, maintenance of sales collateral for internal and external websites, pre-sales, benchmarking and technical engagements to drive customer adoption and strategic penetrations.  Support applications execution in the demo process (understanding DRF, talking to account team RPM, apps to define demo success criteria), delivering final reports to the customer.  Technical function and maintenance of knowledge database for KT Pro product, apps review of specs and STRs. Define and arrange for chargeable STRs, billable support KT Pro apps contracts.  Support developing tools and sales collateral enabling field and internal sales to sell KT Pro's range of product offerings. Working with diverse KT Pro organization and global field organization.  This role reports to the Director of Application in KT Pro group responsible for fully refurbished pre-owned systems, mature tool upgrades and product enhancements, buybacks, re-marketing and flexible trade-in programs for surplus tools. Specifically this job will require to support applications organization for setting up demo share point.Benchmark divisional practices and make recommendations on what would work best for KT Pro's demo share point.This sharepoint will contain customer and internal demo request forms, cusotmer problem statement, confidential baseline data, all related demo data and demo reports.The project will require development and organization of database that would be easy to follow and manage.Initial hands-on introduction to at least one KT Pro product line would be part of the job assignmnet. Preferred Qualifications  Candidate must have BS/MS/Phd in Engineering, Physics, Material Science or related fields. Minimum Qualifications Candidate must have min of BS in Engineering, Physics, Material Science or related fields.  Equal Employment Opportunity  KLA-Tencor is an Equal Opportunity Employer. Applicants will be considered for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other characteristics protected by applicable law."}