{"jobID": "2557926961", "jobLocation": "Sunnyvale_CA", "jobTitle": "Intern - Engineering Intern", "companyRating": "3.7", "companyInfo": {"Website": "www.netapp.com", "Headquarters": "Sunnyvale, CA", "Size": "10000+ employees", "Founded": " 1992", "Type": " Company - Public (NTAP) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " EMC, Nimble Storage, Pure Storage"}, "estimatedSalary": "77000", "jobDescription": " Job Summary  Explore a business where nothing stands still. Where your ideas can make a difference. And where you’ll be part of a collaborative, open-minded culture while you contribute to meaningful work. Organizations count on NetApp for cutting-edge ways to store, manage, move and protect their data. Help us meet their needs as you broaden your skills, get exposure to senior leaders and jump start your career. About our Sunnyvale Office: At NetApp’s headquarters located in Sunnyvale, CA we collaborate to ensure that the quality of work is at its best. Our inclusive environment offers each employee an opportunity to be their best self as we embrace different perspectives and experiences that each employee brings to the table. As part of our values, we not only want to empower our customers, but also our employees, which is why we provide several trainings and certifications for our employees to continue growing professionally. NetApp Sunnyvale also provides an entertaining environment as well. Here you’ll find we have a fun, competitive spirit in our sporting events and leagues, such as basketball, volleyball, futsal, and even ping pong and foosball!  As an Engineering Intern you will have the opportunity to immerse yourself in NetApp’s culture as well as the products and solutions. You will have the opportunity to be part of large teams that expand across the globe and take on projects that increase your industry knowledge, provide a range of challenge, difficulty and function. You will be part of delivering the Data Center of the future! Essential Functions:Modifying and maintaining existing systemsResponsible for providing support in development and testing activities of other engineersCodingDesigningTesting and/or Unit TestingTest automationDebuggingPerformance AnalysisParticipate in technical discussions within the team or other groups within the Business Unit associated with specified projectsWilling to work on additional tasks and responsibilities that will contribute towards team, department, and company goals We invest heavily in new talent. Your energy and fresh ideas are vital to cementing our position as a market-leader. We’ll push you beyond your comfort zone with a belief that no idea is off limits. At the same time, you’ll have all the resources, mentoring and feedback you need to grow. What’s more, whatever your role, you can be yourself in a team that celebrates individuality and welcomes different perspectives.  Job Requirements  - Strong oral and written communication skills Ability to work collaboratively within a team of engineers driven to produce resultsProven aptitude for learning new technologiesResourceful in applying creative ideas to solve problemsProficient in C/C++ programmingBasic understanding of computer architecture, Data Structures  Education  We are seeking candidates that are pursuing a Bachelor’s, Master’s or Ph.D. degree in Computer Science, Computer Engineering, Electrical Engineering, Information Systems or an equivalent degree."}