{"jobID": "2627198483", "jobLocation": "San_Jose_CA", "jobTitle": "Data Analyst/ Architect", "companyRating": "1.0", "companyInfo": {"Website": "www.cognateinc.com", "Headquarters": "Milpitas, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "64000", "jobDescription": " Position: Data Analyst With Healthcare Experience Location: Los Angeles Duration: 9 Months + Interview: Face to Face is a MUST (Locals only) Exp : 10 yrsJob Requirements: · Perform analyses and profiling of the data, create detailed mapping documentation including transformation rules. · Experience with data profiling, data analysis, and healthcare data. · Has understanding of healthcare and healthcare payor data, subject areas and source systems. · Must understand data, data relationships at the table and attribute level. · Able to interpret measurement definitions, and perform data decomposition. · Perform gap analysis and impact analysis on any changes that are being suggested. · Possesses working knowledge of Relational Database Management Systems (RDBMS) and data warehouse, including full reference architecture from data integration, through semantic layer and reporting. · Strong knowledge of data and dimensional modeling. Exp with Oracle/ MDM / Informatica tools is preferred Exp data profiling/analysis of large data is preferredHow to Apply: If you are qualified for this position, please submit your resume in Word format along with a brief cover letter to *APPLY NOW* through this site.About Us: Headquartered in the heart of Silicon Valley, Cognate Inc. was established in 2005 and is a leading IT staffing and IT Consulting Company. Our focus areas includes Staffing and Consulting for Cloud Computing, Data Analytics, Big Data, Enterprise Security & Risk Management, Mobile Applications Development, IT Infrastructure Support, Enterprise Applications Support, E-Commerce, and Software & Platform as Service etc."}