{"jobID": "2814452828", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Search Software Engineer/Data Scientist", "companyRating": "2.6", "companyInfo": {"Website": "www.clarivate.com", "Headquarters": "Philadelphia, PA", "Size": "1001 to 5000 employees", "Founded": " 2016", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " RELX Group, Wolters Kluwer, Informa"}, "estimatedSalary": "122000", "jobDescription": "Clarivate Analytics clients are the trailblazers and risk takers who come up with life-changing ideas. We’re looking for our own trailblazers to help us keep providing clients some of the world’s most trusted brands, spanning scientific and academic research, patent analytics, pharmaceutical and biotech intelligence and IP management.We’re an independent owned company with a rich heritage and a bold entrepreneurial mission. If you’re excited by the thought of helping people and organizations go from new ideas to life-changing innovations faster, we’re excited to consider you for a position at Clarivate. Senior Search Engineer  Analytics accelerates the pace of innovation by providing trusted insights and analytics to customers around the world, enabling them to discover, protect and commercialize new ideas faster. Formerly the Intellectual Property and Science business of Thomson Reuters, we own and operate a collection of leading subscription-based services focused on scientific and academic research, patent analytics and regulatory standards, pharmaceutical and biotech intelligence, trademark protection, domain brand protection and intellectual property management. Clarivate Analytics is now an independent company with over 4,000 employees, operating in more than 100 countries and owns well‐known brands that include Web of Science, Cortellis, Thomson Innovation, Derwent World Patents Index, CompuMark, MarkMonitor and Techstreet, among others. For more information, visit Clarivate.com.  Major responsibilities:  -Design and implementation of the search infrastructure  -Works in collaboration with Data Scientists to constantly optimize the performance of the search engine.  -Explores existing data for insights and recommends additional sources of data for improvements.  Technical /Professional Skills & Competencies:  -Excellent problem solving skills.  -Advanced knowledge of ElasticSearch/Solr/Lucene.  -Deep understanding of Java server platform and system tuning  -Advanced knowledge of backend paradigms  -Knowledge with vector space models, text classification and categorization  -Implement high quality code in an agile software development environment.  -Able to respond and present work to peers, answer in-depth questions, accept constructive feedback, and modify product accordingly.  Education and Background:  -Bachelor or Master's Degree in Computer Science/Engineering, or equivalent experience  -3+ years’ experience with search engine technology.  -1+ years’ experience with big data, distributed processing, or high-performance computing It is the policy of Clarivate to provide equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, Clarivate will provide reasonable accommodations for qualified individuals with disabilities."}