{"jobID": "2827050904", "jobLocation": "Needham_MA", "jobTitle": "BWPO DATA ANALYST / 40 HOURS / DAY / BWH - MEDICAL MANAGEMENT", "companyRating": "3.9", "companyInfo": {"Website": "www.brighamandwomens.org", "Headquarters": "Boston, MA", "Size": "5001 to 10000 employees", "Founded": " 1996", "Type": " Subsidiary or Business Segment", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "62000", "jobDescription": "GENERAL SUMMARY/ OVERVIEW STATEMENT:Please be aware that this position will be moving to Needham, MA. The Data Analyst position on the Brigham and Women's Physicians Organization (BWPO) Medical Management team supports the mission to improve the quality and value of clinical care through data analytics and reporting. The BWPO Analyst will provide analytic and project management support for the activities of the BWPO Medical Management Team, specifically related to cost-of-care and quality.  The Data Analyst will report to the BWPO Director of Data, Analytics and Evaluation and will work closely with the BWPO Medical Management senior leadership team and clinical and administrative leaders from across the Brigham Health (BH) system. The Data Analyst will collaborate with leaders to define both cost and quality improvement opportunities and provide analytical support for ongoing and future projects. This collaboration and support will include the development and coordination of all aspects of data projects from conception through implementation and evaluation, as well as high-level and in-depth data analytics.This will involve analysis of administrative and clinical databases, linking existing databases to create powerful data repositories, and collaborating with other BWH and Partners data repositories and analytic teams to build actionable data assets to address cost-of-care and quality improvement. As the Enterprise Data Warehouse (EDW) is implemented at BWHC, the Analyst will also become a subject-matter expert in the systems, structure and content of the EDW. The Analyst will also provide project management support including the development and documentation of project plans, timelines and progress reports.  The Analyst is expected to work with the broader data analytics community at BW/F and Partners. This may include meeting and working with clinical and administrative leaders from the BWPO, BWH IS, General Physicians Organization (MGPO), Partners Population Health Management, etc.S/he is also expected to develop and maintain a collaborative working relationship with BWH Primary Care.  S/he proactively maintains the timeliness and thoroughness of project plans, specific to data needs; performs analysis, facilitates key meetings and workgroups, manages expectations of senior leaders, manages contingencies, and provides regular, proactive updates to stakeholders. Additionally, s/he will be a strong communicator, both verbally and written, to convey key data and data analytics to various levels, including within the teams, to peers and Sr. Leaders. PRINCIPAL DUTIES AND RESPONSIBILITIES: Participates in the analysis of clinical and administrative data needed to support the efforts of the BWPO Medical Management Team. With guidance from Sr. Project Managers, Managers and BWPO Administrative and Medical Directors, interprets and/or produces comprehensive data analytics and reports, specifically related to trend and quality, for senior leaders of the organization. Collaborates with Partners teams to develop and implement data warehouse and front-end reporting strategies within those database environments. Collaborates with BWPO and BW/F clinical and administrative quality leaders to generate specifications needed for ad hoc analyses and long-term trend and quality reports. Participates in meetings to review and discuss analytic methodologies, results, and improvement opportunities. Develops and implements data collection systems and other strategies that optimize data presentation, statistical efficiency, and data quality. Investigates and proposes solutions for validating and integrating data from different sources including, but not limited to, the information systems at the hospital and department levels, billing data, and claims data. Establishes data quality and validation processes. Performs quality assurance and develops system documentation. Advises management on the consistency, reliability, and validity of data. Interfaces with vendors and representatives of clinical and administrative data repositories to ensure smooth operation of clinical data collection and reporting. Uses a variety of applications for data acquisition, data management, data validation and data presentation. These may include Business Objects, QlikView, and Tableau, among others. Working both with guidance and independently, chooses appropriate statistical methods for analyzing datasets. Performs analysis using MS SQL, MS Access, MS Excel, and other tools such as SAS, SPSS, or STATA as appropriate, and develops reports. Assists, mentors and influences data analysts and other colleagues throughout the BWPO Medical Management Team, provides support and helps to problem-solve issues as needed. Leads the analysis, synthesis and documentation of quality and cost performance reports pushed to BWPO. Recommends analytic paths to investigate patterns identified in reports, and communicates results to appropriate audiences. Project management responsibilities include the development and documentation of project plans, timelines, and progress reports; data collection, tracking, and analysis; dashboard creation and maintenance; staffing meetings and programs. Develop and maintain project plans and tracking documents to assist with the monitoring and oversight of the quality measures included in the Internal Performance Framework and external contracts. Produce and regularly distribute and present progress reports related to the quality work to team members and senior leadership. Facilitate discussions regarding metrics being considered for future IPF targets, as well as current IPF performance; investigate and synthesize entity concerns to be reported back to the appropriate Partners committee(s). Understands and maintains compliance with standards set by the hospital, the Joint Commission and other regulatory and accrediting bodies. Assists BWPO Medical Management Team and/or BWHC clinical/administrative leaders with preparation of manuscripts for presentation or publication. Manages other projects, at the discretion of the Director of Data, Analytics and Evaluation, Executive Director of Care Redesign & Population Health Management, and Medical Directors. Annually reflects on competencies included in the BWPO Competency Model (forthcoming) and engages with supervisor to create an action plan for those competencies that may require further developmentFISCAL RESPONSIBILITY: Awareness of project budget; expectation that s/he will monitor budget, report any variances, and collaborate with Manager for Clinical Performance Reporting, Analytics, and Evaluation, and Sr. Director for Population Health Management in fiscal year budget planning processQualificationsQUALIFICATIONS: Masters degree in public health, business healthcare administration, statistics, or related field, preferred Minimum of 3-5 years experience in healthcare field and/or data analysis, programming or project management. Demonstrated expertise in managing working relationships in a matrix structure Experience in facilitating and engaging clinical and administrative leaders in discussing and understanding data, data analytics, etc. Strong preference given to candidates with demonstrated experience in and understanding of statistical and health services research and quality improvement methodologies. This includes accessing large databases and applying appropriate statistical analyses. Strong communication, presentation, project management, training skills. Ability to work as part of a team and one-on-one with clinical and administrative leaders to address complex operational, strategic and theoretical issues in healthcare quality. Requires attention to detail to accomplish critical tasks and understand the impact of results on all affected stakeholders. Requires the ability to juggle multiple assignments, manage time efficiently, and with a minimum of supervision. Experience in statistical analysis of clinical, survey and medical claims data sets using data management, reporting and visualization tools such as MS SQL, MS Access, MS Excel, Microstrategy, QlikView, Tableau, SAS, SPSS, or STATA. Ability to work as part of a team and one-on-one with clinical and administrative leaders to address complex operational, strategic and theoretical issues in healthcare qualitySKILLS/ ABILITIES/ COMPETENCIES REQUIRED: Excellent analytical and problem solving skills. Ability to take initiative, embrace challenges and develop creative solutions. Demonstrated expertise in reporting and presenting data with focus on quality assurance and validation. Experience with project planning including the development of project plans and timelines. Exposure to data management and reporting tools. Able to develop effective relationships with individuals at all levels in a matrix environment. Demonstrated ability to adhere to confidentiality polices for sensitive clinical information. Excellent writing and presentation skills Excellent time management and organizational skills and ability to manage multiple projects simultaneously, set priorities, and work independently Strong interpersonal skills; ability to work well with others in a demanding and changing environment, including those whose expertise is not analytical or technical; ability to develop effective relationships with individuals at all levels in a matrix environment Ability to see projects through from conception to completion Ability to take initiative, embrace challenges and develop creative solutions Independent learner who can acquire the necessary software skills to compete the work, including learning new applications, reporting tools, or programming languages Demonstrated expertise in manipulating and interpreting data using clinical, hospital-based, ambulatory, and claims-based databases Experience using data management and reporting tools such as MS SQL, MS Access, MS Excel, SAS, SPSS, or STATA Demonstrated ability to adhere to confidentiality polices for sensitive clinical informationWORKING CONDITIONS: Office-based environment Travel to various BWH/BWPO campus locations as well as to other PHS facilities to meet with business leaders and/or project teams May require carrying meeting materials and small boxes Cubicle located with the Medical Management Team at 111 Cypress Street, Brookline, MA.EEO Statement Brigham and Women's Hospital is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, sex, sexual orientation, gender identity, national origin, ancestry, age, veteran status, disability unrelated to job requirements, genetic information, military service, or other protected status.  Partner's Healthcare is acting as an Employment Agency in relation to this vacancy."}