{"jobID": "2756568525", "jobLocation": "Los_Angeles_CA", "jobTitle": "GD CA 18-19: Middle School Science Teacher", "companyRating": "3.4", "companyInfo": {"Website": "www.greendot.org", "Headquarters": "Los Angeles, CA", "Size": "1001 to 5000 employees", "Founded": " 1999", "Type": " School / School District", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": " Thank you for your interest. If you are a Green Dot employee, please apply using the Career Worklet on the Workday Home Page.ABOUT GREEN DOT  Green Dot Public Schools is a non-profit charter management organization driven by the mission to transform public education so that ALL students graduate prepared for college, leadership, and life. Green Dot operates 26 public schools in historically disadvantaged communities in Los Angeles, Tennessee and Washington. As one of the three largest charter management organizations in the nation, Green Dot schools consistently achieve outstanding academic outcomes through innovative college-preparatory curriculums, collaborative and personalized teaching methods, and strong support systems for both students and staff.  Outside of the classroom, Green Dot schools provide a rich array of after-school programs and services for students so that they have safe, educational and enjoyable opportunities after the bell rings. Additionally, Green Dot strongly believes in community empowerment. Schools regularly organize events that bring together students, parents, educators and political leaders to advocate for active civic engagement and unity. Since 1999, Green Dot has been a celebrated leader in closing discrepancies in access to high-quality educational opportunities, regardless of race, ethnicity or socioeconomic status. OPPORTUNITY Green Dot recognizes that high-quality teaching is central to the academic success of students. Green Dot teachers effectively deliver a superior education built on the rigorous requirements of Common Core State Standards and the expectations of the state college systems. Simultaneously, the collaborative and flexible nature of Green Dot’s curriculums encourage teachers to develop creative lesson plans to personally and thoroughly engage each student in their classrooms. Green Dot is committed to ensuring that every student, regardless of background or circumstance, is not only provided with the opportunity to succeed, but empowered with the self-confidence and support networks necessary to transform opportunities into accomplishments. This mission has fueled Green Dot’s thriving professional development and growth programs, which support and challenge teachers to maximize their impact in the classroom and advance their careers as leaders in education. Recognizing the importance of professional empowerment, teachers are represented by the Asociación de Maestros Unidos (AMU), an affiliate of the California Teachers’ Association, and the National Education Association.  Candidates who will be eligible for a CA intern credential (for the relevant subject) by July 2018, are encouraged to apply now for our teaching positions. ESSENTIAL RESPONSIBILITIES > Exhibit and uphold Green Dot core values  > Create a community culture of learning in the classroom  > Engage in data-driven planning and assessment of student learning  > Establish a culture of respect and rapport with the students which supports the students’ emotional safety  > Facilitate rigorous learning by delivering cognitively engaging lessons that incorporate GDPS instructional best practices  > Engage in critical reflection, constantly revising practice to increase effectiveness  > Participate in a professional community across the school site and network  > Develop partnerships within the community by communicating with families and leveraging resources that support student success in college, leadership, and life  This job primarily operates on a school site and in classrooms, and utilizes typical office equipment (computers, phones, photocopiers, etc.). Physical demands include: positioning to lift (should be able to lift up to 50 pounds to waist high), carry, push, and/or pull, kneel, stoop, crouch and bend. Generally, the job is 60% Stationary and 40% moving/traversing. Normal business hours are approximately 7:00am – 4:00pm, Monday-Friday (although these hours may vary and may require occasional evening and weekend work based on organizational needs). Minimal or no travel required, other than visits to other local school sites or the Home Office (as needed). QUALIFICATIONS > A growth mindset and love of learning  > Bachelor’s degree and passage of the CBEST  > California multiple subject* or single-subject intern, preliminary or clear credential Applicants with a multiple-subject credential are eligible for hire. However, Green Dot requires that you obtain your single-subject credential or subject-matter authorization by June 30, 2019 NOTE: Applicants with an out-of-state teaching credential or no teaching credential should visit the California Commission on Teacher Credentialing website before applying. Please check to see that you will be eligible to teach in a California public school by July 2018. http://www.ctc.ca.gov/  > Strong content knowledge, pedagogical understanding, and the capacity to plan and deliver instruction to meet the needs of students.  > Relentless commitment to and high standards for high quality execution  > Passionate with a high level of personal responsibility towards ambitious goals  > Excellent collaborative and organizational skills  > Excellent verbal and written communication skills  > A strong ethical base and self-awareness  > Dependability, humility, sense of humor, and rock-solid commitment to Green Dot’s mission and the communities we serve.  > Must be able to pass a TB test and background check at time of offer  The information contained herein is not intended to be an all-inclusive list of the duties and responsibilities of the job, nor is it intended to be an all-inclusive list of the skills and abilities required to perform the job. COMPENSATION Our current annual teacher salary scale ranges from $49,500 - $90,218, based on education and experience. We also offer a comprehensive benefits plan, STRS participation, as well as the opportunity to impact a growing, mission-driven organization that is committed to the success of all students.  Only those applicants chosen for an interview will be contacted, and we hire on a rolling basis. We are looking to fill positions for the 2018-19 school year.  Green Dot Public Schools is a fair chance and equal opportunity employer. As such, Green Dot is committed to providing equal employment opportunities to all applicants, without regard to their actual or perceived race, religious creed (including religious dress or grooming practices), color, national origin or ancestry (including native language spoken), physical or mental disability (including HIV or AIDS), medical condition (including cancer or genetic characteristics), genetic information, marital status (including registered domestic partnership status), sex (including pregnancy, childbirth, lactation and related medical conditions), gender (including gender identity and expression), parental status, age (forty (40) and over), sexual orientation, Civil Air Patrol status, military and veteran status, citizenship, immigration status or any other consideration protected by federal, state or local law. Please note that we are unable to sponsor H1-B Visa applicants."}