{"jobID": "2827778178", "jobLocation": "Cambridge_MA", "jobTitle": "(USA-MA-Cambridge) Technical Solutions Consultant Intern, Summer", "companyRating": null, "companyInfo": {"Website": "www.google.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (GOOG) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Apple, Facebook"}, "estimatedSalary": null, "jobDescription": " Applications are now closed. Please check back next year for 2019 opportunities.  Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; Cambridge, MA, USA; San Francisco, CA, USA; New York, NY, USA  In little more than a decade, Google has created one of the world's largest global computing infrastructures for both internal and external use. Using our unique technologies, along with open source tools, we keep Google's products and services running, robust and secure. Our objective is to create solutions that allow people to work and communicate in new and innovative ways giving back to the world's technical community whenever we can.  As a Technical Solutions Consultant intern, you will be part of teams that provide technical support to Google's external partners and clients. As such, you will play a role in supporting external partners and clients, and develop tools to make our operations smarter and scalable. Your projects could range from driving analysis to determine root causes of customer dissatisfaction, building tools to automate and scale operations or developing custom solutions for some of Google's top partners.  Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From AdWords to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.  ## Responsibilities Build internal solutions, with custom front-ends (web, mobile) and backend services that automate business processes. Maintain highest levels of development practices including: technical design; solution development; systems configuration; test documentation/execution; issue identification and resolution; writing clean, modular and self-sustaining code.Help partners in their day-to-day challenges by delivering innovative and scalable solutions, and troubleshooting their problems. Understand operational workflows, identify and define tool needs to enable operational scaling, and drive the development (initial and ongoing) and deployment of these tools with Engineering.Create and update documentation as integration methods are applied (e.g., requirements document, technical design document, project plan, etc).Integrate third-party products into internal systems as well as support and upgrade implemented systems. Work closely with analysts to translate business requirements into technical solutions.Solve problems that may involve access and analysis of massive amounts of data and information. Help to develop massively scalable, distributed software systems and collaborate on different smaller projects. ## Qualifications Minimum qualifications:Must be currently enrolled in a full- time degree program pursuing a Bachelor's in Computer Science or a related technical field and returning to the program after the end of the internship.Experience with web technologies and experience with HTTP, HTMP, XML.Database design and SQL Query construction experience.Experience in one or more programming languages: C++, Python or Java; experience with SQL and data modeling.Preferred qualifications:Enrolled in a full- time degree program pursuing a Master's in Computer Science or a related technical field and returning to the program after the end of the internship.Experience in systems software or algorithms.Some client facing experience (gained through university, part time work, etc), or proxy skills (university society membership, organizing/leading voluntary activities).Demonstrated business savvy and effective communication skills (relevant for a technical audience).Authorization to work in the United States.Expected graduation date in late 2018 or Spring/Summer of 2019.* * At Google, we dont just accept difference - we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you have a disability or special need that requires accommodation, please let us know.  To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees or any other company location. Google is not responsible for any fees related to unsolicited resumes."}