{"jobID": "2817362380", "jobLocation": "Oakland_CA", "jobTitle": "Data Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.askmediagroup.com", "Headquarters": "Oakland, CA", "Size": "51 to 200 employees", "Founded": " 1996", "Type": " Company - Public ( IACI) ", "Industry": " Media", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Quora, Inc., eHow"}, "estimatedSalary": "143000", "jobDescription": " Company DescriptionHome to the iconic Ask.com website and headquartered in Oaklands thriving downtown, Ask Media Group is a collection of websites that help curious people find the information they need. Our growing portfolio of websites helps our users discover everything from bathrobes to tax forms, and we thrive on the challenge of developing a wide variety of sites that address everyday questions, no matter how large or small. Our team knows how to not only create but profitably grow digital properties to meaningful scale, touching the lives of millions of people each day. Ask Media Group is owned and operated by IAC (NASDAQ: IAC) and is a part of IAC Publishing, IACs collection of premium content brands.  Our key capabilities include: Multi-channel audience acquisition and monetization expertise.A rapid release application platform allowing us to develop and test a variety of new products.Deep data management, analytics, and machine learning expertise to drive engaging media experiences.24x7 operations services with experience supporting multiple, international domains at scale. Job DescriptionWe are looking for a mid/senior level Data Scientist to join our Data Science Products team--a small team whose mandate is to solve complex data science problems with engineering solutions optimized for consumer-facing applications. The data science product team plays a key role in Ask Media Groups business, owning projects from ideation to production, and collaborating with our engineering teams to build scalable solutions. We have mountains of language and user-interaction data that we use to drive breakthroughs both in performance marketing and the creation of engaging search and content experiences. As a member of the team, you will collaborate across the organization within a culture that values pragmatic solutions.QualificationsYoure a great fit for this job if you have the following qualities: You are a leader - you have deep knowledge and enjoy providing mentorshipYou have broad knowledge that you apply in new contexts, and you eagerly learn new technologies to help drive solutionsYou are pragmatic - you choose simplicity over complexityYou are a collaborator and put team first - you take pride in the teams successYou are strong communicatorYou are helpful in a bi-directional way - you do not shy away from offering and asking for help at the right timeYou are flexible and thrive in a changing environmentYou are tenacious, and continue working on a problem even in the face of setbacks. We are also looking for these skills and experience: You have deep understanding of topics in data science and machine learning.You are able to quickly prototype ideas and solve complex problems by adapting creative approaches.You are a capable developer who can provide production quality data science solutions.You have extensive experience in Python and using Pythons data science stack. Python3 experience is a plus especially migration from Python2.You are a strong collaborator and communicator who is comfortable working with data scientists and software engineers within the team and outside the team.You have minimum 3 years of experience in a relevant field (Machine Learning, Natural Language Processing, Information Retrieval, Text Classification).You having a Ph.D. in a relevant field is a bonus.You have experience in or have a desire to learn Hadoop/Spark related Big Data technologies.You have experience in or have a desire to learn Apache-Solr. Additional InformationWe have some of the greatest benefits such as: unlimited vacation for salaried employees, medical/dental/vision options, pet insurance, 401(k) matching, commuter subsidy, tuition reimbursement, charity gift matching, huge discounts to wireless/gym/travel/much more. Our office has free snacks, catered lunch, in-house massage chair, and more. More importantly we know how hard you work so we celebrate that hard work often.  We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}