{"jobID": "2658301706", "jobLocation": "Santa_Monica_CA", "jobTitle": "Senior Data Analyst", "companyRating": "4.5", "companyInfo": {"Website": "www.tala.co", "Headquarters": "Santa Monica, CA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "88000", "jobDescription": " At Tala, we are connecting millions of people to the financial services they deserve. The Data Analytics team operates in a nimble working style, flexing between a variety of business questions and data needs at the company. We are asked to investigate and solve big questions other companies have yet to find solutions for such as digital identity management and understanding customers fully based on their mobile data. You will be part of an innovative and fast growing team that pushes to provide access, choice, and control to thousands of customers.  As a Senior Data Analyst, your goal is to deeply understand internal client needs and to build out data products that provide the company with real-time and in-depth insights about our diverse customer base.  This role will be based out of our Santa Monica, CA office. In this role you will:Live and search for data: you build datasets and reports that resolve key insights about our customers through internal and external data sourcesFocus on scale: move beyond the day-to-day asks so teams can self-service data and have their reporting automated and flexibleProblem solve: you translate vague business questions into specific data-driven solutionsKnowledge share: coach other team members in their work, translate complex data theories into learning opportunitiesWhat were looking for:3+ years in a data-intensive role (or equivalent experience)BA/BS in a quantitative fieldExpert in at least one analytics language (ex. Python, R)Proficient in SQL, GitHub, bash commandsPerfect candidates would have: Experience with an early stage analytics teamExperience in emerging markets (either personally or in professional scope)Advanced modeling and machine learning expertise outside of school or KaggleAble to look beyond the immediate deliverable, find the real data problem, and solve for itAbout Tala: Tala is the leading mobile technology and data science company committed to financial inclusion globally. More than 1.3 million people have borrowed through Talas smartphone app, which provides instant credit scoring, lending, and other personalized financial services in emerging markets. Tala has raised more than $105 million from leading venture and impact investors including Revolution, IVP, Ribbit Capital, Data Collective, and Lowercase Capital. Talas global team is headquartered in Santa Monica, with additional offices in Nairobi, Manila, Dar Es Salaam, Mexico City, Mumbai, and Bangalore."}