{"jobID": "2822118012", "jobLocation": "Campbell_CA", "jobTitle": "Executive Assistant II", "companyRating": "3.7", "companyInfo": {"Website": "www.upliftfs.org", "Headquarters": "Campbell, CA", "Size": "501 to 1000 employees", "Founded": " 1867", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "77000", "jobDescription": "Title: Executive Assistant II Classification: Exempt Salary Range: $57,737 - 86,606 Actual offers will be determined by the candidate’s creditable years of experience in conjunction with internal equity considerations and based on the organization’s current compensation practices.Job Code: 556 Job Summary Works within the vision, mission and philosophy of the agency. Exercises independent decision making in assignments, coordination of activities with external contacts, Board members and agency staff. In the Executive’s absence, may act for the executive in providing direction or guidance to resolve immediate issues. Serves as the primary point of contact on behalf of the Executive for internal and external constituencies on all matters pertaining to a wide variety of activities and confidential matters with discretion. Has the ability to work independently on projects, from conception to completion. Essential Duties 1. Applies the highest level of confidentiality and recognize the level of confidentiality necessary for various types of information.  2. Demonstrates ability to maintain credibility, trust and support with senior management staff.  3. Prioritizes conflicting needs; handles matters expeditiously, proactively and follows through on projects to successful completion, often with deadline pressures.  4. Applies knowledge of agency practices and organizational requirements.  5. Participates in or leads activities at an agency level to help agency meet requirements or regulatory standards.  6. Receives and reviews significant communications to the agency; conducts research and analysis to support executive decision- making with relevant background information.  7. Has strong written and verbal communication, administrative, organizational skills and the ability to manage multiple priorities.  8. Edits agency documents for grammar, spelling and formatting. May recommend or alert executive to the need for revisions to documents based upon extensive knowledge of agency and outside organization contact and experience.  9. As a representative of the agency, maintains appropriate professional and courteous manner in communicating with members of outside agencies, vendors, youth and families.  10. Coordinates and manages special events.  11. Independently creates forms, reports manuals, filing systems and the like in order to facilitate completion of agency business.  12. Acts as an informed source of company policies and procedures by answering questions or routing to appropriate employees for answers.  13. Handles a broad range of administrative functions including managing an active calendar, timely completing expense reports, arranging travel plans, preparing agendas, keeping all filing current, budgets, ordering of office supplies and equipment, and performing or arranges for routine maintenance of basic office equipment.  14. Keeps track of all expenses and assist in conducting reconciliation and preparing reports on activities costs.  15. Works well with colleagues at all levels of the organization.  16. Observes and participates in committees and continuous quality improvement activities as needed  17. Other related responsibilities, as assigned, to support specific department/business needs. Qualifications To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. All employees are responsible for keeping job requirements up to date. This can include but are not limited to certifications, licensure, and maintaining a clear criminal record. Education Requirements • Associate's Degree (AA/AS) required or equivalent combination of education and experience in an executive administrative role. Experience Requirements • Four (4) years of progressively responsible executive administrative experience or five (5) years of senior level Administrative Assistant experience.  • Computer skills: intermediate to advanced skill with Microsoft Office (Word, Excel, PowerPoint, Visio, One Note and Outlook), Adobe Acrobat and other software applications such as database management or organizational and flowchart software. Preferred Qualifications • Typing speed at seventy (70) words per minute (wpm).  • Pro legal, risk management or contract management experience a plus. OtherSpecific Requirements • Must pass Department of Justice (DOJ), Federal Bureau of Investigations (FBI), and Child Abuse Index Check (CAIC) background clearance.  • Valid California Driver's license with two years experience driving and clean driving record may be required. Work Environment/Conditions The work environment conditions as described below are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable qualified individuals with disabilities to perform the essential functions.  While performing the duties of this job, the employee may be required to use hands to handle or feel objects, tools or controls; reach with hands and arms; and taste or smell. Specific vision abilities required by the job include close vision, distance vision, color vision, peripheral.  In addition this position requires sitting, standing, walking, kneeling, and climbing. Employee Statement of Understanding I have read and understand the job description for my position. I am able to perform all of the essential functions of this position.  I agree to successfully complete all required training indicated for this position. I agree to keep all of my required certifications and licenses current and up to date and provide proper documentation of the same to the Human Resources Department. I agree to comply with all Agency policies and procedures. I agree to comply with the agency compliance plan and all laws, rules, regulations and standards of conduct relating to my position. As an employee, I understand my duty to report any suspected violations of the law or the standards of conduct to my immediate supervisor. As an employee, I will strive to uphold the mission and vision of the organization. All employees are required to adhere to the values in all their interactions with youth and families and fellow employees."}