{"jobID": "2787494665", "jobLocation": "San_Bruno_CA", "jobTitle": "Data Analyst, Trust and Safety, YouTube", "companyRating": "4.4", "companyInfo": {"Website": "www.google.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (GOOG) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Apple, Facebook"}, "estimatedSalary": "104000", "jobDescription": "Google's brand is only as strong as our users' trust--and their steadfast belief that our guiding principles are what's best for them. Our Trust and Safety team has the critical responsibility of protecting Google's users by ensuring online safety by fighting web abuse and fraud across Google products like Search, Maps, AdWords and AdSense. On this team, you're a big-picture thinker and strategic leader. You understand the user's point of view and are passionate about using your combined technical, sales and customer service acumen to protect our users. You work globally and cross-functionally with Google developers and Product Managers to navigate challenging online safety situations and handle abuse and fraud cases at Google speed (read: fast!). Help us prove that quality on the Internet trumps all.  As a Data Analyst for YouTube, you are passionate about cutting-edge freedom of expression issues and you want to help define how people around the world communicate with one another and express their points of view through YouTube. You will leverage the power of data to assist with the implementation and enforcement of YouTube's advertising, program and content policies. In this role, you will also serve as the policy and data expert on cross-functional teams with Product, engineering and Legal.  At Google we work hard to earn our users’ trust every day. Gaining and retaining this trust is critically important to Google’s success. We defend Google's integrity by fighting spam, fraud and abuse, and develop and communicate state-of-the-art product policies. The Trust and Safety team reduces risk and protects the experience of our users and business partners in more than 40 languages and across Google's expanding base of products. We work with a variety of teams from Engineering to Legal, Public Policy and Sales Engineering to set policies and combat fraud and abuse in a scalable way, often with an eye to finding industry-wide solutions. Trust and Safety team members are motivated to find innovative solutions, and use technical know-how, user insights and proactive communication to pursue the highest possible quality and safety standards for users across Google products. Responsibilities Conduct data analysis project work to scope policy issues and quantify their impact.Represent a well-researched, data-driven, user-focused stance for Google that balances users, advertisers, product, and brand considerations across a variety of policy issues and platforms.Conduct complex queries and analyses, build statistical and visual models, and construct presentations on abuse trends to aid in fraud prevention and influence change in existing abuse detection systems.Apply industry knowledge and best practices in abuse fighting to refine policy enforcement efforts and influence the strategic direction of the team.Collaborate with cross-functional groups such as Engineering, Sales and Legal on machine-learning initiatives to increase automation, develop front-end tools, update policies, fix product loopholes, and provide a better online experience for users. Qualifications Minimum qualifications:"}