{"jobID": "2738429362", "jobLocation": "Boston_MA", "jobTitle": "Senior Business Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.entmatrix.com", "Headquarters": "Herndon, VA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Contract", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Oversees the acquisition, analysis and dissemination of subject matter knowledge. Conducts high level business analysis involving complex business requirements and processes. Analyzes current processes and recommends process improvements. Provides technical and business knowledge. Writes project-related documents (BR100s and MD50s). Works with QA department on test cases. Write test cases for UAT and assisting during the UAT process. Provide expertise and assist during project deployment phase. Minimum Job Specs: Bachelor's Degree in technology, finance, business or equivalent, 8 years of related financial services experience, Extensive knowledge of business functions, Experience with project management methodology, Excellent analytical skills, Very strong relationship management skills, Strong writing and presentation skills What are the Top 3 must-haves you will be looking for in the resumes/interviews for this role?Ability to write project-related requirements documents (BR100s and MD50s), write test cases, and support project deployment efforts What business unit is this supporting? GPS and FRIBS Is it supporting a specific project or initiative? If so, which one and in what way? Supporting a project that expands Beeline into other countries What type of software skills is an absolute must have? Word and Excel  o How is this team comprised? Typical style project team with PMs, testing staff, IT staff, and sr mgrs.  We would like a local resource  o What will the interview process entail (phone screen, face to face, meet with team, etc.) Phone, then face-to-face  What would this person's day to day look like once they are onboard? Working with project team members in person and via web conferences  Will there be any training provided or would the need to jump right in first day? Limited training, mostly jump right in"}