{"jobID": "2746507032", "jobLocation": "Santa_Clara_CA", "jobTitle": "Customer Sales Rep", "companyRating": null, "companyInfo": {"Website": "www.napaautojobs.com", "Headquarters": "Atlanta, GA", "Size": "5001 to 10000 employees", "Founded": " 1928", "Type": " Company - Public", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " AutoZone, Advance Auto Parts, O'Reilly Auto Parts"}, "estimatedSalary": null, "jobDescription": "The Role: Are you passionate about finding and winning new customers Do you thrive off of \\\"\\\"the hunt\\\"\\\" for finding new business, closing deals and sustaining these relationships even after the sale If this sounds like a perfect fit for you, our NAPA sales team would love to hear from you! Specifically, we are seeking self-motivated Customer Sales Representative to achieve success in a pay for performance (we offer a base pay plus commission), business to business, outside sales role through growing our current customers and creating new customers by promoting our entire line of products and services.  This is the right opportunity for you if you: Have a passion for \\\"\\\"the hunt\\\"\\\" and winning customersEnjoy building and sustaining customer relationshipsEnjoy promoting an entire line of products because you truly believe in the productsTruly love and understand basic selling conceptsA Day in the life:Drive growth of company-owned NAPA Auto Parts stores, customer base, sales and profitsPromote the entire line of NAPA products and programs to Wholesale CustomersWork with local Store Manager to develop plans to increase sales and proactively initiate, contact, manage and develop leads on a local basisIdentify specific needs of customers and align solutions with NAPA's offerings.Work with manufacturer's representatives to improve program offerings and grow customer knowledge of linesEngage customers and keep them connected through all of NAPA's eSales programsPerform educational seminars, clinics and presentations on NAPA product lines and servicesMaintain customer satisfaction and provide strong customer service including solving customer problems, complaints and questions in person or by telephoneWhat youll need:Prior experience in a Retail store or outside sales2+ years of experience in a customer focused role and the ability to perform in a quota-driven environmentUnderstand and demonstrate basic selling skills such as preparing for the sales call, managing the customer meeting, handling customer resistance, closing the sale and account maintenanceCapability to present information in group meetingsValid driver license with no more than 2 moving violations in the last 4 years requiredAnd if you have this, even better:Bachelor s DegreeBackground in the Automotive Industry Why NAPA may just be the right place for you: Base Salary plus commissionVehicle & Cell phone allowanceOutstanding health benefits and 401KStable company. Fortune 200 with a family feelCompany Culture that works hard, yet takes care of employeesOpportunity for accessing multiple career paths, ongoing development, with support from leaders and your teamAdditional information for you: NAPA has great careers for people with all backgrounds and interests. So if after reading this, you dont think that it is the perfect fit for you, check out a few of our cool day in the life career videos from our awesome employees by visiting NAPAautojobs.com. While on our career site, check out the list of the many other diverse roles we have as well. We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law.  GPC believes the fair and equitable treatment of employees, customers, suppliers and other persons is critical to fulfilling its vision and goals. GPC conducts its business without regard to sex, race, creed, color, religion, marital status, national origin, age, pregnancy, sexual orientation, gender identity, genetic information, disability, military status, status as a veteran, or any other protected characteristic. GPC's policy is to recruit, hire, train, promote, assign, transfer and terminate employees based on their own ability, achievement, experience and conduct and other legitimate business reasons.  Apply Now!"}