{"jobID": "2275411576", "jobLocation": "New_York_NY", "jobTitle": "Project Management Intern – Tailored Technologies", "companyRating": "3.6", "companyInfo": {"Website": "www.markspaneth.com", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " 1907", "Type": " Private Practice / Firm", "Industry": " Accounting & Legal", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "55000", "jobDescription": "Project Management Intern – Tailored Technologies Marks Paneth LLP is a premier accounting firm with origins dating back to 1907. With a team of nearly 700 professionals, the firm provides a full range of audit, accounting, tax and consulting services, with specialties in international tax, forensic accounting, litigation support, family office and financial advisory services.  Marks Paneth professionals deliver expert knowledge in a wide range of industries, including real estate, hospitality and restaurants; nonprofit, government and healthcare; manufacturing, wholesale and distribution; theater, media and entertainment; high-net-worth; and financial and professional services. The firm offers expanded resources through its subsidiary technology consulting firm, Tailored Technologies, LLC, and its membership in Morison KSi Ltd., a global association of professional service firms serving clients’ cross-border accounting, tax and consulting needs.  Headquartered in New York City, with additional offices throughout the East Coast, Marks Paneth is ranked by Accounting Today among the top 50 accounting firms in the nation and the top 10 in the Mid-Atlantic Region. Job description: We currently have an opening for a Project Management Intern in our Tailored Technologies division located in our New York City office location. Seeking a part time (20 hours per week) student intern assisting with managing and tracking IT audit schedules on a regular basis. Additional ad hoc projects will be assigned. Requirements:Undergraduate degree in Project Management or Business Administration requiredMaster’s degree in Accounting and/or Computer Science/Information Systems a plusGood computer skills including the suite of Microsoft products including VisioOutstanding interpersonal skills including written and verbal skillsAbility to adjust changing priorities; basic problem resolution skillsAbility to work at a high-level accuracy with attention to detailAbility to work independently as well as a part of a team to achieve desired resultAbility to manage and drive various resources to forecasted scheduleResponsibilities Include:Managing and tracking audit schedulesCommunicating any questions, concerns or issues to IT audit teamEnsuring adequate documentation in the work papersAssisting with daily projectsLocation – Manhattan, NY All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, creed, color, religion, sex, sexual orientation, gender identity, national origin, marital status, citizen status, age, disability, military or protected veteran status, genetic predisposition or carrier status or any other legally protected status. Marks Paneth takes affirmative action in support of its policy to and advance in employment individuals who are minorities, women, protected veterans, and individuals with disabilities.  Please visit our website as well at: www.markspaneth.com  Direct Apply: https://markspaneth.csod.com/ats/careersite/JobDetails.aspx?site=1&id;=103"}