{"jobID": "2674137164", "jobLocation": "Boston_MA", "jobTitle": "Travel Sales Manager", "companyRating": null, "companyInfo": {"Website": "www.audleytravel.com", "Headquarters": "Witney, United Kingdom", "Size": "501 to 1000 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " Unknown / Non-Applicable", "Competitors": " Trailfinders, Flight Centre Travel Group, Abercrombie & Kent"}, "estimatedSalary": null, "jobDescription": " Audley Travel is now eagerly searching for ambitious Regional Sales Managers to join our Europ team. As a Regional Sales Manager (RSM) you will focus on the recruitment, training, management and motivation of your team. It is your job to ensure our Specialists are fully maximizing sales and are able to actively generate new leads when incoming leads are insufficient. It is essential you have experience managing a small team preferably within the travel industry, along with a proven and consistent track record of excellent sales and customer service. Responsibilities:Drive energy and urgency within teams to ensure maximum sales are extracted from the available leads.Effectively manage the performance of individuals ranging from new starters to high performers.Provide sales training and constant support to Country Specialists within your region and ensure their product knowledge is continually up to date.Responsible for responding to operational and emergency situations within your region, including issues caused by suppliers, airlines, or unexpected events to ensure best results for clients.Requirements:Experience managing a sales teamA proven track record of consistent sales and high customer service feedback.An ability to inspire, motivate, engage, and develop a sales team.Excellent organizational skills with the ability to manage a high workload.Clear and confident communication, resilient to pressure.Excellent customer service and problem solving skills.Positive and results-driven.Bachelor’s degree or equivalent work experience.International travel experience and passionThis is a really unique Management opportunity for many reasons. Here are a few:The opportunity to develop, motivate and support a small team who is extremely passionate about what they are selling.The sale here is fun! We are selling experiences that get us just as excited as we want our clients to be. It’s nice to sell something that people genuinely want, not need.Travel is a way of life, most of our people have seen a lot more than the general population – and you get to be surrounded by these experts day in and day out.You will be a part of a transparent company that is nimble like a start-up but has 20 years of experience under its belt. In addition to that we offer a solid basic salary with a generous bonus structure and excellent benefits package where we cover 100% of the cost of Medical, dental and vision as well as providing 401k and 20 days PTO off the bat! About Audley Travel US Inc. Audley connects discerning travelers to a more rewarding travel experience in nearly 80 destinations around the world. Each of our Country Specialists has first-hand knowledge of the best guides, food, lodging, and local secrets in a specific region of the world, having lived or traveled there extensively. This allows them to tailor each journey to a client’s individual travel style and interests. The local knowledge and personalized service creates a streamlined and stress free planning experience.  Our carefully curated experiences, candid advice and level of service including personalized travel packs go above and beyond client expectations. Audley Travel Group is an Equal Employment Opportunity/Affirmative Action employer. We are committed to the policy of providing equal employment opportunities without regard to race, color, religion, sex, sexual orientation, gender identity, veteran status, disability or national origin.This employer participates in E-Verify. The employer will provide the Social Security Administration (SSA) and, if necessary, the Department of Homeland Security (DHS) with information from each new employee's I-9 to confirm work authorization."}