{"jobID": "2538589506", "jobLocation": "San_Bruno_CA", "jobTitle": "Quality Engineer Intern - Summer", "companyRating": "3.2", "companyInfo": {"Website": "www.walmartlabs.com", "Headquarters": "San Bruno, CA", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, eBay, Google"}, "estimatedSalary": "124000", "jobDescription": "Position DescriptionYOUR INTERN PROGRAM EXPERIENCE  Far beyond your specific assignment, the program immerses you in business, allows you to develop cutting edge technology, and shows off your socials skills, all in-between a lot of fun! Over the 10 to 11 week period you connect with executives, learn advanced skills, participate in HackDay, and network at social events. Whether you are playing in the Intern Olympics or going to a Giants game, there is always something going on. With the San Francisco Bay Area as your playground the opportunities both inside and outside of work are endless!Minimum QualificationsABOUT YOU A visionary engineer with a passion for learning new technologies, testing and automation, and resolving quality issues.Experience participating in building test frameworks on web, mobile, or services platforms using any of programming languages; Java, Objective C, Javascript or Node.jsKnowledge of internet technologies, such as AJAX, HTTP, HTML/XML, Java script , CSS, XSL/XSLT, XPATHKnowledge with environment configurations, defect tracking, build or release management and debugging toolsKnowledge of test automation efforts using open source testing tools and test frameworks on web or native platformsKeep up with changes in field of internet and mobile technology and apply them in day-to-day testing challengesEnjoy working in small teams, solving problems togetherPassionate about user experienceEDUCATIONAL REQUIREMENTSCurrently enrolled and pursuing a Bachelors, Masters, or PhD in Computer Science, Software Engineering, Computer Engineering, Electrical Engineering, or a related field.Graduating December 2018 or laterAdditional Preferred QualificationsNoneCompany SummaryWalmart Global eCommerce is comprised of Walmart.com, VUDU, SamsClub.com, and our technical powerhouse @WalmartLabs. Here, innovators incubate next gen e-commerce solutions in real-time. We integrate online, physical, and mobile shopping experiences for billions of customers around the globe. How do we do it? We continuously build and invest in new technology including open source tools and big data innovations. Data scientists, front and back-end engineers, product managers, and web and UX/UI teams collaborate alongside e-commerce experts to envision, prototype, and bring revolutionary ideas to life in a dynamic, flexible and fun work culture.Position SummaryABOUT QUALITY ENGINEERING INTERNS The teams within @WalmartLabs design, prototype and build technology-fueled products that bridge the gap between what's next and what's best. As a Quality Engineer Intern you will work on teams to test efforts of Walmart products on one or more platforms. As part of your project, you will not only work with fantastic technical leads and engineers to lead test efforts on multiple mobile platforms, but also with great partners in product management, UX (interaction and visual), project management and beyond. We believe in small teams of smart people working together to deliver the best product. Our process is light and tight. Come join our high performance team! "}