{"jobID": "2811694700", "jobLocation": "Santa_Clara_CA", "jobTitle": "AutoGear Window Tint Technician - MINI of Stevens Creek", "companyRating": null, "companyInfo": {"Website": "www.autonation.com", "Headquarters": "Fort Lauderdale, FL", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public (AN) ", "Industry": " Retail", "Revenue": " $10+ billion (USD) per year", "Competitors": " Sonic Automotive, CarMax, Asbury Automotive"}, "estimatedSalary": null, "jobDescription": " Job Details  Connect With Us  Apply Now Job ID 2018-92530 Date posted 06/11/2018 Job Location Santa Clara, California Job Type Regular Full-TimePosition Overview AutoNation is seeking a driven, highly motived Window Tint and Paint Protection Film (PPF) Installer looking to join a fast-paced industry with long-term career opportunity. This candidate will be responsible for the installation of both products on new car inventory and sold customer vehicles.  What are the day-to-day responsibilities?Subject matter expert in AutoGear Window Tint and Paint Protection FilmInstallation is to conform to dealership and/or manufacturer specifications and time allowances.Window Film and PPF installer is expected to perform quality work without direct or continual supervision and be able and willing to work on all work assigned to him/her.Ability to operate computer, and plotter system for tint/PPF productsMust show attention to detail to deliver a consistent high quality installation.Follow Company safety procedures to avoid exposure to fumes, dirt, dust, harsh chemicals.Demonstrate behaviors consistent with the Company’s Vision, Mission, and Values in all interactions with customer, co-workers and suppliers.Adhere to all company policies, procedures and safety standards.What are the requirements for this job?Work in a fast-paced environment with various work schedules / days / hours of operations.High School diploma or equivalent. Technical school experience is preferred.At least one year’s experience as a specialty tint technician in an aftermarket or Auto Dealership is preferred.Possesses a strong attention to detail.Able to follow processes to ensure quality and safety.Valid in-state driver’s license and have and maintain an acceptable, safe driving recordAble to read and comprehend written instructions and information.General mechanical skills.Able to drive manual transmission vehiclesManual dexterity, good judgment and ability to operate power and hand tools and other types of machinery safely.AutoNation is an equal opportunity employer and a drug-free workplace."}