{"jobID": "2750377812", "jobLocation": "Los_Angeles_CA", "jobTitle": "Summer Intern", "companyRating": null, "companyInfo": {"Website": "www.hubinternational.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "ABOUT US: HUB International Limited is an insurance brokerage providing an array of worldwide brokerage services including property, casualty, risk management, life and health, employee benefits, investment, and wealth management products and services. HUB has more than 300 offices across the United States, Canada and Puerto Rico with more than 8,000 employees. We are a company dedicated to superior customer service with employees committed to adding value to every client activity. RESPONSIBILITIES:Complete assigned duties to acquire knowledge of methods, procedures, and standards required for successful performanceDuties may include gathering and organizing data to provide information for departmental special projects or reports; basic arithmetic computations; preparing written reports; accompanying professional level employees on assignmentsAssisting the front desk and working with Benefits Analyst and Account Managers to front load pre-renewals packets in employee benefitsData entry clean up for the offices that are converting into EpicSpecific activities vary by assignment; a wide range of college majors are considered based on specific needs of department \\#CA Location: United States, California, Los Angeles Required Education: High school or equivalent Required Experience: 1-2 years Required Travel: No travel required Date published: 26-Apr-2018 Department: Office Administration & Clerical Ref#: P2662_20180424  HUB International Limited is an equal opportunity and affirmative action employer that does not discriminate on the basis of race/ethnicity, national origin, religion, age, color, sex, sexual orientation, gender identity, disability or veteran's status, or any other characteristic protected by local, state or federal laws, rules or regulations. The EEO is the Law poster and its supplement is available here at http://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm .  We endeavor to make this website accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact the US Recruiting Team toll-free at (844) 300-9193 or USRecruiting@hubinternational.com . This contact information is for accommodation requests only; do not use this contact information to inquire about the status of applications."}