{"jobID": "2656050458", "jobLocation": "New_York_NY", "jobTitle": "Sr. SAP Transportation Management", "companyRating": null, "companyInfo": {"Website": "www.tgv.com.ar", "Headquarters": "Buenos Aires, Argentina", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Unknown", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "TGV AMERICAS is looking for a Senior SAP Transportation Management & Event Management (TM & EM) consultant. The SAP Transportation Management consultant will report to Senior ERP staff and will primarily support the team’s design and build for the implementation of the new Transportation Management application [SAP TM 9.0/9.1 to TM 9.3/9.4] in the SAP solution during 2018. Functional duties:As part of Supply Chain Management team, and under the supervision of Senior ERP Analysts, the SAP Transportation Management & Event Management (TM & EM) consultant will be responsible for the following duties: - Following SAP methodologies, standards and ERP SAP implementation best practices, contribute to the design, build and implementation roll-out of the SAP TM & EM solution for Transportation Planning, Execution and Management. - Support the gathering and definition of requirements for the SAP-based TM & EM solution, working with the various concerned teams in transitioning, testing and providing further feedback with respect to functional requirements. - Contribute to the preparation of test cases and execution of testing cycles to support the delivery of SAP TM & EM functionality, including the provision of demos of out-of-the-box modules on request. - Contribute to the preparation of business specification documents, functional specification documents and training materials, inter alia. - Maintain track monitoring on the deadlines and deliverables, and communicate status updates to the project lead against milestones, escalating as appropriate. - Perform knowledge transfer to Functional and Technical team - Provide post-go live functional and technical support, including acting as focal point to address questions/issues and services requests regarding the implementation of the Transportation Management solution. - Record and follow up on tracking incidents or production change related work orders. Technical SAP TM & EM requirements:SAP ERP - Full understanding of the integration points of the below ERP areas with TM & EM functions (including interfaces) and of the overall financial accounting integration aspects: Purchasing Sales, ReturnsShipping TransportationMaterials Master and Business Partner Master RecordsInventory Management Warehouse ManagementServices ProcessingTracking and Tracing VisibilityAlerting Demurrage ProcessingHighly desirable:- Implementation experience in a project landscape which included Supplier Relationship Management (SRM) solution (Extended Classic Scenario) as this constitutes the key component of the Public Sector Procurement. - Understanding of integration aspects with SAP APO DP/SNP in order to implement a fully optimised Supply Chain. - Functional-technical expertise with the implementation of real time tracking, monitoring, exception handling and analysis of purchase orders, deliveries, shipments (Freight Orders, Units, Parcels, Vehicles, Containers) and freight conditions (e.g. secured transportation) to provide visibility on status, location, history, analytics, and forecasts of Supply Chain. - Functional-technical expertise with the implementation of End-to-End routing with optimization, Multi-step Planning and Planning Scenarios, Planning Cockpit personalization, Management of Cargo consolidation and flow, Package and load planning, Dangerous Goods Management, Strategic Freight Procurement, TM Collaboration Portal, Carrier and Broker Data Integration, Settlement of Suppliers’ invoices.- Functional-technical expertise of interfacing / integrating a variety of sources, such as barcode scanners, 3rd party applications, mobile / messages alerts, geo data / GIS provider. Experience requirements:Experience with at least 1 full life-cycle Transportation Management implementation project in a hands-on role, including conducting Blueprint sessions with customers and complete functional specifications, design, build and deployment.Functional-Technical experience with implementation of SAP Event Management, in particular in connection with SAP Transportation Management implementation is required. Including: Establishing system connections, implementation of relevant BADIs, coding of relevant extractors, configuration of EM functionality and exposing relevant data to BI.Experience with SAP TM [7.0 or 8.0/8.1, or 9.0/9.1 and 9.3/9.4].Understanding of transportation planning, scheduling, route determination, route optimization, freight rate management, tendering, SD Order integration etc. is mandatory.Experience with CIF-integration models definition and configuration is required.Understanding of Transportation Management Business environments of Shippers, and Logistics Service Providers.Good understanding of SAP Order Fulfilment Processes (OTC), and hands-on SAP R/3 SD/LES - or APO-TP/VS - shipping and transportation functionality experience.Experience and knowledge of SAP ERP SD/LES/WM moduleRelevant SAP Certifications such as SAP TM, SAP SCM, SAP MM are required.Additional desirable experience:Experience with SAP APO TP/VS (Transportation and Vehicle Scheduling in APO) or other market leading TMS solutions experience is desirable.Understanding of SAP TM related RFCs, BAPIs, BADIs, BDCs, user exits and enhancement points is desirableABAP debugging, BI reporting and batch job analysis skills are desirableSAP TM & EM - Functional and technical expertise with the relevant TM & EM areas: Transportation Master Data Transportation order ManagementProduct and Service Catalogue Quotation and RFQ ManagementEnd-to-end Order management Freight order management, Freight procurement and capacity planningPackage, Load and Dispatching Planning, Execution and monitoringOptimization of ERP Logistics integration Interactive planningSubcontracting and Tendering Customer and Supplier contractsAgreement management and settlements [invoicing]Tariff and rate calculation Charge calculation and settlementsOrder workflow control Internal chargingDraft customer and supplier invoices Document ManagementOutput ManagementEvent Management configuration & association to Transportation Management processSAP Supply Chain event management visibility processesInfraestructure and administrationProject Location:New York City Long term assignmentLooking for a major career challenge? Apply by sending your resume to jobs@tgvamericas.netVisit us at https://www.tgv.com.ar/index_ing.html"}