{"jobID": "1518285423", "jobLocation": "Seattle_WA", "jobTitle": "Principal Data Scientist", "companyRating": "2.9", "companyInfo": {"Website": "www.spacecurve.com", "Headquarters": "Seattle, WA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "144000", "jobDescription": "Lead Data ScientistJoin an expert team that is breaking records in real-time Big Data performanceChange the way the world manipulates and analyzes large quantities of dataAddress our customer’s data pain points and delight them with your solutionsSpaceCurve is building Big Data analytic solutions focused on spatial, temporal, sensor and graph applications. Targeting mobile, life sciences, oil and gas and government markets. Our unique database technology can power real-time models of reality. We are enabling completely new applications and radical enhancements to existing applications. The role: Our product is a distributed database and data platform purpose-built to parallelize storage and retrieval of realtime geospatial data on clusters of shared-nothing commodity hardware. We’re looking for a Principal Data Scientist with the vision and hands-on skills to drive early adoption as a key person in the core technical team. You will be working to fuse a wide variety of feeds and data sources, including geospatial/geotemporal, vehicle and industrial sensors, social networks, and place and personal data.  Your recent experience must be directly with Terabyte class datasets or larger. You should be adept at managing the full life cycle of massive datasets including ETL, EDA, cleaning, model building and deployment. You should be thoughtful and knowledgeable about algorithm performance and maximizing throughput. You should be very solid with open source and/or commercial technologies like Linux/Unix, SQL, Python and R/S-PLUS, ESRI, Octave/MATLAB, SciPy, NumPy or SAS. To be considered for our Lead Data Scientist, you will need:5+ years in the field; you’ve been a data scientist longer than the term’s been in vogue.2+ years of recent experience working with terabyte or larger datasets.Vision! You must be able to design, articulate and create something new. You will be a key member of the team that anticipates, researches and understands the needs of stakeholders like data suppliers, data consumers, privacy advocates, regulatory agencies, general public, etc.Advanced degree in Math, Statistics, CS, a related field or equivalent experience.Hands-on, current experience with data analysis life cycle tools.Practical experience working on Linux.Python and/or other popular scripting languages.SQL and ETL tools – you must be a strong SQL programmer.Additionally, our ideal candidate will possess:Broad exposure to data analysis in multiple contexts with deep expertise in at least one.Experience with multiple database technologies (relational, EDW, NoSQL).Experience with geospatial and/or graph analytic databases.Experience with streaming APIs and SOA products.Experience with real-time analytics (e.g. mobile marketing).EDA and modeling tools.DBMS operations, security, administration and multi-tenancy.Business & contractual aspects of working with large data suppliers. A good cultural fit on our team is a professional and results-oriented individual that can initiate and complete tasks under tight deadlines and changing priorities. Flexibility with hours and workload is key! About SpaceCurve Our product is revolutionary. Many have said it, but seldom is it true.  SpaceCurve is a well-funded startup on our way to changing the economics, nature, usefulness and significance of Big Data across many market segments. The next ten years will bring explosive growth in mobility and location-based services, and increasing volumes of geospatial and sensor data will drive demand for real-time models of reality. SpaceCurve is uniquely positioned at the intersection of the growing geospatial and intelligent-location trends that are creating immense opportunities for the rapid implementation of its technologies.  We are smart, engaged and passionate about what we do. We believe world-class employees should be rewarded as such. Our employees are offered competitive wages, 401K, premium insurance benefits, flexible PTO, early stage stock options and more! Apply now or contact us for a confidential discussion!"}