{"jobID": "2820715297", "jobLocation": "San_Francisco_CA", "jobTitle": "Consumer Loan Officer", "companyRating": null, "companyInfo": {"Website": "www.sfpcu.org", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 1953", "Type": " Nonprofit Organization", "Industry": " Finance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Do you want to be a part of an organization that serves our local community?!SF Police Credit Union is a growing non-profit organization honored to serve the Bay Area's First Responders' since 1953. SFPCU is seeking self-starters who share our commitment to provide excellent service and education at every opportunity. We offer generous benefits, competitive compensation, and career development opportunities throughout our organization. Benefits include:•HMO, PPO Medical •Dental Plan including orthodontics•Vision Plan •401k (Employer Matching; Profit Sharing Contributions)•Group Life, Accidental, Short and Long Term Disability Insurance•Pre-Tax Commuter Benefits •Paid Time Off (PTO), holidays•Employee Loan Discount Program•Work/Life: Employee Appreciation Events, On-site Health & Wellness Fairs, Holiday Parties and Community Support Events•Educational and Tuition Reimbursement Programs•Professional Development Programs We are currently looking for a Consumer Loan Officer 1 who will provide the highest level of service, within established time frames, guidelines and procedures, performs work requiring the use of judgment and discretion in making credit decisions for members seeking consumer loans. Reviews loan applications to ensure completeness and accuracy of information. Informs members of loan requirements and matters affecting the granting of loans. Analyzes information to process loan applications such as verification of income and credit reports. Disburses loans ensuring that all forms and documents are e/signed and members understand debt responsibilities. Employees assigned to this level job will normally process a high level of routine loans with more complex matters referred to Supervisors /Underwriting. We are currently located in San Francisco but will be moving the location to our new corporate headquarters in San Bruno in January 2019Here is what you will be doing:• Intake and process all consumer loans received via online, phone, virtual distribution channels• Interview loan applicants, assessing their needs and providing clear and concise information related to all credit union products and services.• Reviews, analyzes and evaluates loan applicaitons for completeness of documents and compliance with Credit Union internal policies, as well as regulatory State and Federal compliance.• Evaluates loan recommendations and final decision; Approval, Counter Offer or Denial of request. Prepares and submits recommendations for Risk Assessment or Credit Manager loans outside of program guidelines.• Prepare notification to applications for all requests in accordance to Regulation B.• Package loan files in accordance to our OnBase scanning procedures.• Research member inquiries related to loan payments, account inquiries, assessed fees, insurance premiums, GAP, MBI, as needed.• Establish new membership, checking and sub accounts while seeking cross-sell/up-sell opportunities to meet member needs.• Process ATM/Debit card (new and re-issue), ensuring that the member is made aware of all procedures and regulations.• Assist members with payroll deductions, direct deposit, periodic payments and ACH services.• Consistently cross-sell all products, services and promotions offered including PaymentProtection, GAP & Member Financial Services, while obtaining production goals set forth by management.• Respond to member requests by mail, telephone, in person and email within department specified time frames.• Communicate effectively with other financial institutions and vehicle dealership personnel toensure efficient and accurate loan processing.• Demonstrate the ability to multi-task duties and projects assigned.• Pro-actively seek to improve and/or offer positive input regarding individual role, departmental or credit union processes.• Demonstrate problem resolution and form decisions based on sound and valid informationEducation:•High School diploma or equivalency required. What we are looking for: • Minimum of one year financial institution experience within a personal banker /loan officer or similar type role required• Knowledge of consumer lending regulatory compliance, interviewing practices and underwriting skills desired• Possess strong working knowledge of Microsoft Office Suite.• Excellent verbal and written communication skills.• Demonstrated skills in organization and strong attention to detail.• Quick learner and possess the ability to manage multiple priorities.• Work under pressure and meet strict deadlines.• Build and maintain effective relationships with members and staff• Ability to actively listen, interview to gather pertinent loan information• Ability to identify additional opportunities for products and services to build member loyalty• Critical thinking skills using logic and reasoning to identify strengths and weaknesses of alternative loan solutions• Ability to evaluate needs of member applicants and provide effective advice and guidancePhysical Requirements:•Regularly required to operate a computer and other office productivity machinery, such as a calculator, copy machine, and computer printer•Must be able to remain in a stationary position up to 50% of the time•Frequently required to position self and move about inside the office to access file cabinets, office machinery•Must be able to detect and exchange accurate information to and from appropriate parties•Must occasionally move, transport up to 10- 25 lbs.•Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions If you enjoy the challenge of a fast pace and an ever changing environment with endless opportunities for growth - come join our team!SFPCU is an Equal Opportunity Employer and hires are made without regard to any individual's race, age, color, national origin, ancestry, disability, veteran status, religion, marital status or domestic partnership; pregnancy, childbirth or related medical conditions; other medical conditions or genetic characteristic; sexual orientation, gender, gender identity or transgender status; or any other basis protected by state, federal or local law, regulation or ordinance. We will consider qualified candidates with criminal histories in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance.Visit us at www.sfpcu.org"}