{"jobID": "2810995015", "jobLocation": "New_York_NY", "jobTitle": "Per Diem Pharmacy Intern", "companyRating": null, "companyInfo": {"Website": "www.msmc.com", "Headquarters": "Miami Beach, FL", "Size": "1001 to 5000 employees", "Founded": " 1946", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Strength Through Diversity  Ground breaking science. Advancing medicine.Healing made personal.  Dept Name- PHARMACY INTERNS ANDRESIDENTS REQ #75159  JobTitle: PER DIEM PHARMACY INTERN Roles&Responsibilities;: A. Clinical/Technical/Service Demonstrates the ability to perform clinical/technical/service/administrative tasks:Audits the records of controlled substances, ensures compliance with hospital, state, and federal regulations as directed by a pharmacist, manager, or director; advises nursing and pharmacy managers of discrepancies; assists in discrepancy resolution; maintains the files of all completed controlled drug records; and ensures proper storage.· Issues controlled substances and prescription pads as per departmental policy under the direct supervision of a pharmacist. Processes controlled substances returns and receives product into inventory. Ensures appropriate inventory on hand at all times and maintains required balances. Assists in discrepancy resolution.Obtains appropriate signatures when issuing/delivering controlled substances and prescription pads.Maintains a file of all receipts for the 24 hour period prior to the return of the disposition records.Performs Kit-Check tray filling and tray exchange functions on an accurate and ongoing basis.Routinely checks for and removes expired medications from inventory.Returns re-useable medications to stock before the end of the shift.Prepares medication orders for review by a pharmacist.Assists in accurately filling med orders and performs statistical data collection/reporting as needed.Conducts all required deliveries and other patient care area rounds in a timely fashion.Repackages medications as per departmental policy.Prepares parenteral and extemporaneous products under the direct supervision of a pharmacist. Prepares labels and affixes to product as required.Maintains work environment in a clean, neat and orderly fashion.Required to enter specific data on departmental records [Temperature readings, expiration date checks, etc.]Completes all required documentation.Conducts nursing unit inspections.Places main pharmacy stock order. Places stock into inventory and maintains adequate inventory at all times, including Pyxis units.May be required toperform other duties as assigned or perform other duties when necessary.Requirements:Currently registered&attending; anaccredited PharmD program. English proficiency, oral and written.Previous pharmacy experience preferred.Valid NYS Pharmacy Intern Permit required.Must provide permit for display in workplace.. 9436 - PHARMACYINTERNS AND RESIDENTS StrengthThrough Diversity  The Mount Sinai HealthSystem believes that diversity is a driver for excellence. We share a commondevotion to delivering exceptional patient care. Yet we're as diverse as thecity we call home- culturally, ethically, in outlook and lifestyle. When youjoin us, you become a part of Mount Sinai's unrivaled record of achievement,education and advancement as we revolutionize medicine together.  We work hard to acquireand retain the best people, and to create a welcoming, nurturing workenvironment where you can develop professionally. We share the belief that allemployees, regardless of job title or expertise, can make an impact on qualitypatient care.  Explore more about thisopportunity and how you can help us write a new chapter in our story!  WhoWe Are  Over 38,000 employeesstrong, the mission of the Mount Sinai Health System is to providecompassionate patient care with seamless coordination and to advance medicinethrough unrivaled education, research, and outreach in the many diversecommunities we serve.  Formed in September2013, The Mount Sinai Health System combines the excellence of the Icahn Schoolof Medicine at Mount Sinai with seven premier hospital campuses, includingMount Sinai Beth Israel, Mount Sinai Beth Israel Brooklyn, The Mount SinaiHospital, Mount Sinai Queens, Mount Sinai West (formerly Mount Sinai Roosevelt),Mount Sinai St. Luke's, and New York Eye and Ear Infirmary of Mount Sinai.  The Mount Sinai HealthSystem is an equal opportunity employer. We promote recognition and respect forindividual and cultural differences, and we work to make our employees feelvalued and appreciated, whatever their race, gender, background, or sexualorientation.  EOEMinorities/Women/Disabled/Veterans"}