{"jobID": "2756816399", "jobLocation": "New_York_NY", "jobTitle": "Lead Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.ibm.com", "Headquarters": "Armonk, NY", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Public (IBM) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Accenture, Microsoft"}, "estimatedSalary": "115000", "jobDescription": "Job Description Discover what you can do at IBM.  Data Science is a critical team within the Marketing Analytics & Data organization. The team builds first-of-a-kind capabilities using advanced statistical modeling techniques that scale across all of IBMs business units and geographies. The teams ultimate mission is to create cutting-edge analytics that achieves measurable business outcomes for IBM.  The Marketing Data Scientist is an important, integral part of the IBM Marketing Analytics team. This position is responsible for uncovering meaningful data patterns and transforming them into actionable insights by leveraging predictive modeling, data mining, and machine learning algorithms. This includes customer segmentation and profiling, churn, Customer Lifetime Value, marketing mix modeling, propensity models, uplift models, and other methodologies. This individual will be responsible for developing scalable analytical solutions to provide data-driven and optimization insights to IBM Marketing and digital business. He/she should have vast experience in statistical and data mining algorithms and demonstrated ability to innovate and customize when necessary. He//she will be passionate about learning and deploying leading technologies in the analytics space specific to the business needs to drive results and identify opportunities. As a Marketing Data Scientist, he/she will drive business impact by solving unique problems through advanced analytics, continuous improvement methodologies, and change management in a fast-paced environment.  The Marketing Data Scientist is located in IBM offices in New York City or Armonk, NY.  Must have the ability to work in the US without current/future need for IBM sponsorship.  Do work that matters.  Discover your true potential.  Be yourself. MC18 Required Technical and Professional Expertise Masters degree in Statistics, Data Science, Mathematics, Computer Science, Operational Research, or closely related disciplines.5+ years of experience with advanced analytics techniques (e.g., decision tree, logistic regression, hierarchical regression, neural network, random forest, etc.)5+ years expert level SPSS, SAS, R, or Python analytics experience with a proven track record in advanced analytics as well as hands-on experience with digital and CRM data (structured and unstructured)4+ years of experience in analytics consultingProven ability to understand, cleanse, and integrate massive disparate data sets and demonstrated familiarity with data modeling workflowRecognized for analytical rigor and ability to identify actionable insights from ambiguous and sometimes limited informationStrong communication; ability to effectively connect/translate complex analytics findings to business insights and recommendations Preferred Tech and Prof Experience Ph.D. preferredFamiliarity with developing and industrializing scalable analytical solutions1+ years of experience with programmatic marketing1+ years of experience with latest content marketing/SEO strategy trendsAbility to gain consensusAbility to lead change and transformationPassionate about data science and self-motivated to stay abreast of advances in data science techniquesDesire to work in a team based dynamic and fast-paced business cultureBusiness Acumen EO Statement  IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status. "}