{"jobID": "2795476848", "jobLocation": "Boston_MA", "jobTitle": "Clinical Nutrition Specialist I - 32 hours General Outpatient", "companyRating": null, "companyInfo": {"Website": "www.childrenshospital.org", "Headquarters": "Boston, MA", "Size": "5001 to 10000 employees", "Founded": " 1869", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Title Clinical Nutrition Specialist I - 32 hours General Outpatient  30-May-2018 Department Patient Services-Clinical Nutrition AutoReqId47541BRStatus Full Time Standard Hours per Week32Shift Day, Weekend, Holiday Job Posting Description At Boston Children’s Hospital, success is measured in patients treated, parents comforted and teams taught. It’s in discoveries made, processes perfected, and technology advanced. In major medical breakthroughs and small acts of kindness. And in colleagues who have your back and patients who have your heart. As a teaching hospital of Harvard Medical School, our reach is global and our impact is profound. Join our acclaimed Nutrition Department and discover how your talents can change lives. Yours included. The Clinical Nutrition Specialist will be responsible for:Providing basic nutritional care to patients on assigned patient units and/or in outpatient clinics.Evaluating the medical, biochemical, and nutritional information and assesses patient needs in order to develop and implement the most appropriate nutrition care plans.Assisting in the supervision of the daily work of the dietetic technician.To qualify, you must have:Bachelor's degree in nutrition or a closely related field plus up to one year of post‑degree course work and/or an internship and preferably one to two years’ experience in pediatrics.Analytical skills to resolve complex problems requiring the use of scientific, mathematical, or technical principles and in‑depth, experienced‑based knowledge.Good communication skills to effectively deal with conflicting views or issues and mediate fair solutions, and well‑developed writing skills.Registration by the Academy of Nutrition and Dietetics as a dietitian is required as well as licensure by the Commonwealth of Massachusetts. This position is eligible for an Employee Referral Bonus.  Boston Children’s Hospital offers competitive compensation and unmatched benefits, including an affordable health, vision and dental insurance, generous levels of time off, 403(b) Retirement Savings plan, Pension, Tuition Reimbursement, and discounted rates on T-passes (50% off). Discover your best.  Boston Children’s Hospital is an Equal Opportunity / Affirmative Action Employer. Qualified applicants will receive consideration for employment without regard to their race, color, religion, national origin, sex, sexual orientation, gender identity, protected veteran status or disability. Office/Site Location Boston Boston Children's Hospital"}