{"jobID": "2756016184", "jobLocation": "San_Francisco_CA", "jobTitle": "Associate QA Analyst (Contract)", "companyRating": "4.0", "companyInfo": {"Website": "www.pocketgems.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": " Pocket Gems wants to build the greatest games and interactive entertainment in the world. Thats the mission our founders began in an apartment above a pizza shop back in 2009 and we continue it today.  Pocket Gems has grown to over 250 people in San Francisco. With $155 million in backing from Sequoia Capital and Tencent, were constantly breaking new ground with graphically rich mobile games, fun new genres of mobile entertainment, and innovative technologies like our mobile-first Mantis Engine.  Our products have been downloaded over 325 million times by players around the world. Most recently, weve launched Episode, a mobile storytelling network and platform, and War Dragons, a visually stunning 3D real-time strategy game. Episode partners with major studios and industry stars to create stories such as Mean Girls: Senior Year, Demi Lovato: Path to Fame, Clueless: Schools Out, Pitch Perfect In Deep Treble, and Pretty Little Liars. Over 8 million storytellers have also signed up to create their own stories, including award-winning screenwriters and published novelists. Episode has made the list of the Apples Top 10 iOS games of 2017!  As an Associate QA Analyst for Episode at Pocket Gems, youll be part of a team innovating the mobile storytelling platform. You will have a seat at the table when developing features and improving our games - we love great ideas and expect that our whole team contributes them! Youll also be tackling exciting challenges from releasing Episode original story content to helping create the best narrative experience on mobile. You will be relied upon to communicate between multiple functions to assess risks, coordinate offsite resources efficiently, and keep projects on track. Please note that this role would start off as a 6 month contract.What Youll Do:Create tests with a mastery of QA methodologiesWrite relevant, actionable, and reproducible bug reports that strengthen our development processBe a strong proponent of quality and process to the Episode teamCollaborate effectively with Engineers, Product Managers, and Designers to develop featuresManage features from the Episode team pod (2-3 per sprint) from concept to execution. This may include writing test cases, creating test plans, and triaging bugsRecognize test case deficiencies and propose improvementsLearn software development processesWhat You Bring to the QA Team:1-2 years of experience working in the software development industry as a tester, developer, or tech supportCritical thinking, excellent communication and leadership skillsA strong work ethicAn ability to create and enforce processesAbility to prioritize multiple tasks wellA love for creating delightful gaming experiences for millions of playersExtra Gems for:Prior mobile game testing experiencePocket Gems is an equal opportunity employer. We do not discriminate based on race, color, ethnicity, ancestry, national origin, religion, sex, gender, gender identity, gender expression, sexual orientation, age, disability, veteran status, genetic information, marital status or any legally protected status.Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records."}