{"jobID": "2735236953", "jobLocation": "Boston_MA", "jobTitle": "VP GGL Business Development Officer", "companyRating": null, "companyInfo": {"Website": "www.radiusbank.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 1987", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Return to Job ListPosition Summary: Originate SBA business for the bank. Gather applications, perform financial analysis of required cash flow, and present the package within credit policy requirements. Interact directly with, and manage client relationships. Essential Duties:Generate new SBA from small business clients in accordance with established annual goals and objectives.Identify main client groups and audiences, determine the best way to communicate information to them, and develop and implement a communication plan.Manage client relationship on originated loans through the closing. Make periodic site visits to clients within defined market region to assist Portfolio Management Group and to provide compliance with Annual Review Documentation from borrowers.Cross sell bank services to existing loan relationships and manage relationships.Gather complete underwriting packages, and present for acceptance. Assist with obtaining all necessary documentation needed to close the transaction. Follow up on any exceptions or account matters.Participate in community and business functions/groups to provide a positive image for the bank within the region’s marketplace. Establish referral contacts within the community. Maintain strong working relationships with referral contacts. Educate clients of advantages and create brand recognition in the market. Attend local SBA functions to establish Banks presence and cultivate CDC relationships.Perform other related duties as assigned.Education/Experience:An undergraduate degree in a related field or an equivalent combination of training and experience.A minimum of3 years related Marketing, sales, and business developmentA minimum of 1-3 years related Lending experienceOther Qualifications:Demonstrated prior business success in SBA Lending/SalesExcellent verbal, written, and interpersonal communication skillsA team player able to work effectively in a team fostered, multi-tasking environmentProficient in Microsoft Office suite, e.g. Excel, Word, OutlookStrong working knowledge of financial analysis including cash flow, balance sheet, industry analysis, audit, etc."}