{"jobID": "2656546461", "jobLocation": "Santa_Monica_CA", "jobTitle": "Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.edmunds.com", "Headquarters": "Santa Monica, CA", "Size": "501 to 1000 employees", "Founded": " 1966", "Type": " Company - Private", "Industry": " Media", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " TrueCar, Cars.com, Kelley Blue Book"}, "estimatedSalary": "128000", "jobDescription": " At Edmunds were driven to make car buying easier. Ever since we began publishing printed car guides in the 60s, the company has been in the business of trust, innovating ways to empower and support car shoppers. When Edmunds launched the car industrys first Internet site in 1994, we established a leadership position online and have never looked back. Now, as one of the most trusted review sites on the Internet, millions of visitors use our research, shopping and buying tools every month to make an easy and informed decision on their next car. For consumers, we bring peace of mind. For dealers, we make tools to help them solve their problems and sell more cars. How do we do it, you ask? The key ingredients are our enthusiastic employees, progressive company culture and cutting-edge technology. Want to join the team? Read on to find out how! What Youre Applying For: The Analytics team at Edmunds.com is seeking a Data Scientist who will play a crucial role in designing and optimizing tests, and help guide product initiatives for the Tier 1 Advertising business with our OEM partners. These initiatives will involve in-depth studies of Edmunds users and clients, as well as the automotive marketplace, to directly impact the revenue generated from the Tier 1 Advertising business. Each project will involve sound statistical models, carefully planned and executed experiments, creative uses of Edmunds vast data resources, thoughtful analysis and beautiful visualization of results.  We are looking for a person that is smart, creative, ambitious and able to work and communicate well with a variety of people from varying technical backgrounds. We especially want someone who is excited about engaging in data-driven analyses to strategically optimize Edmunds product offerings for our customers and clients. Edmunds is very much about helping its people growmeaningfully, effectively and prosperously. We care about what we do and we care about our people. A demonstrated passion for data and analytics will provide incredible growth opportunities and will make this the best job youve ever had. What Youll Do: Work with Data Scientists and Product Managers to design and implement in-depth studies of Edmunds users and clientsImplement and provide feedback on robusts tests that will provide meaningful resultsBuild statistical, machine learning, or optimization models to improve the Edmunds Tier 1 Advertising businessWrite production modeling code; collaborate with Software Engineers to implement algorithms when necessaryPrepare visualizations of data in order to explain and persuadeCommunicate results to stakeholders across the businessIdentify key areas for future researchWhat You Need: Bachelors degree in a quantitative field preferred AND An advanced degree + 1-2 years work experience in an analytics-related position OR3-4 years work experience in an analytics-related positionDeep understanding of data platforms in which youve previously workedAbility to work well in a teamProficiency in SQLStrong R and/or Python skills, experience with notebooks is a plusExperience building models, engineering features, and using data to optimize product performanceExcellent written and verbal communication skillsExperience performing analysis on raw event data in modern distributed system engineering stacksAbility to take findings and make simple/beautiful/easy-to-interpret data visualizationsWorking @ Edmunds.com: Employees think its a pretty great place to work and some pretty impressive publications think it is too: we have been recognized as one of the best places to work by the Fortune Magazine and Great Places to Work, LA Business Journal (for the last 6 years!), Computerworld, and Built in LA. We've also been identified as one of the best workplaces specifically in Technology and also for Diversity and Asian Americans. In fact, our CEO, Avi Steinlauf, was rated as one of Glassdoor's Highest Rated CEOs! If youre interested in learning more and joining our mission, wed love to hear from you! Edmunds will consider for employment qualified candidates with criminal histories in a manner consistent with the requirements of all applicable laws."}