{"jobID": "2825186566", "jobLocation": "Pasadena_CA", "jobTitle": "Senior Financial Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.kaiserpermanente.org", "Headquarters": "Oakland, CA", "Size": "10000+ employees", "Founded": " 1945", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " HCA Healthcare, Dignity Health, Sutter Health"}, "estimatedSalary": "75000", "jobDescription": " Develops, interprets and implements financial concepts for financial planning and control. Performs technical analysis to determine present and future financial performance. Gathers, analyzes, prepares and summarizes recommendations for financial plans, acquisition activity, trended future requirements and operating forecasts. Performs economic research and studies in the areas of return, depreciations, working capital requirements, investment opportunities, investment performance and impact of governmental requirements. Essential Functions: Prepares financial reports and conducts comprehensive analyses with written summaries to management.  May be accountable for the coordination, compilation and distribution of financial data.  Performs financial analysis upon identification of variances, and coordinates with junior analysts' variance analysis process as defined.  Participates in the planning and development of regional, departmental and/or functional budgets.  May be responsible for budget system completion and high level reviews.  Participates in and/or leads projects of moderate to complex scope as assigned. Basic Qualifications: Experience  Minimum five (5) years of financial analysis or related experience. Education Bachelor's degree in finance related field, OR four (4) years of experience in a directly related field.  High School Diploma or General Education Development (GED) required.  License, Certification, Registration  N/A Additional Requirements: Broad application of financial analysis principles, theories, and concepts in applicable discipline, plus working knowledge of other related fields.  Advanced proficiency in PC based word processing and spreadsheet applications, including advanced functions such as graphics, pivot tables, macros and database management.  Thorough knowledge of financial analysis policies, practices and systems.  Complete understanding and application of financial analysis principles, concepts, practices, and standards.  Highly developed knowledge of finance theories such as present values theory/cash flow analysis and accounting principles.  Able to formulate finance study designs and prepare and conduct professional presentations.  Must be able to work in a Labor/Management Partnership environment. Preferred Qualifications: N/A "}