{"jobID": "2804052355", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Intern, Bioinformatics", "companyRating": null, "companyInfo": {"Website": "www.secondgenome.com", "Headquarters": "South San Francisco, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Hi, we’re Second Genome. We are a fast-paced and innovative venture-backed biotechnology company developing tomorrow’s breakthrough therapeutics at the interface of complex microbial communities and their host environments. We are leaders in microbial ecology, metagenomics, and computer science. We love fresh approaches, we value process validation, and we welcome peer review. And we’re looking for a Bioinformatics Intern. We’re looking for an intern to help improve our ability to accurately identify bacterial strains from metagenomics datasets. Throughout this project, this intern will evaluate several approaches to strain identification, modify an existing codebase to implement new features, and continually test the code. The ideal candidate will have experience working with Illumina sequencing data and is proficient with Python and coding with a team. Please include a link to a git repo with code you’ve written and a brief description of a coding project you’re proud of in your CV or cover letter. Responsibilities and DutiesEvaluating tools for metagenomics sequencing classificationImplementing software into a production pipelineQualifications and SkillsExperience working in Python.Comfortable working in a Unix environment, including writing Bash scripts.Experience with version control, git prefered.Familiar with NGS data and taxonomic classification.Bonus QualificationsBackground in biologyFamiliar with BioBakery toolsComfortable working with AWSExperience with unit testingWhat’s it like to intern at Second Genome? In addition to our ground-breaking technology, we believe in embodying an authentically joyful workplace. Our Core Values: We are InnovatorsWe are Driven to ActionWe are Great ColleaguesWe Work SmartWe Respect the Data We understand and appreciate the hard work and emotional investment on the part of all our team members - it takes a lot to be a contributor at a startup that’s leading its industry. We make it a priority to mindfully design our work environment and employee offerings with our unique and dedicated team in mind. Fully stocked kitchen with sandwich materials, organic snacks, coffee (Peet’s or Stumptown - take your pick!) and beverages.Our WellBiome health and wellness program: open standing desks, and weekly boot camp and yoga classes on-site.Apple computer + all its fancy accessoriesFriendly and open office environment with great colleagues and an intentional culture that drives innovation, passion, collaboration, and fun!A picture is worth a thousand words. Check out our Instagram @secondgenomelife for a glimpse into our unique team culture. Second Genome provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Second Genome complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training."}