{"jobID": "2659286036", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst- Asset Management Technology Advisory", "companyRating": "3.3", "companyInfo": {"Website": "www.wsp.com", "Headquarters": "Montreal, Canada", "Size": "10000+ employees", "Founded": " 1959", "Type": " Company - Public (WSH) ", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " WorleyParsons, SNC-Lavalin"}, "estimatedSalary": "68000", "jobDescription": " Introduction  WSP’s US Advisory practice is dedicated to transforming the business of infrastructure across the transportation, buildings, energy, environment and power sectors. We guide our clients through solving some of their most complex infrastructure challenges by providing a unique combination of engineering principles, technology, and management consulting skills.  From aging assets and funding shortfalls to evolving government priorities and emerging disruptive technologies, today’s infrastructure owners and operators are facing a multitude of challenges. In response, clients are increasingly leveraging our multi-disciplined expertise, solutions-focused approach and ability to deliver to support them as they work to meet today’s needs and tomorrow’s challenges.  This environment has led to rapid growth for the US Advisory practice, as we’re now located in 30+ offices across the U.S. We plan to continue that growth and aim to expand our team by 25% this year. We are looking for motivated candidates who want to join our group of trusted advisors in delivering important, high-quality and high-value work to our clients and their stakeholders, while helping to shape the future growth of the nation’s built environment.  Plan, procure, develop, manage, finance, invest, and transform - come help us to change the future!  WSP is currently initiating a search for a Data Analyst with our Asset Management Technology Advisory team for our San Francisco office.  The Group - Advisory Services  Our US Advisory Services team is seeking a dynamic, self-motivated Data Analyst to both support and drive continued growth in our Asset Management Advisory practice. You will join an established team that is a leader in providing management consulting, finance, and business improvement services across the country and beyond.  We are looking for self-starters who can contribute to our success in the Asset Management service area - which focuses on working with clients to develop their capabilities - including process analysis, business transformation and process improvement, data and information analytics, providing guidance on management technology as well as asset technologies, and supporting development of asset strategies and plans.  It is preferred that the individual has experience in the core infrastructure sectors - transportation, water and power utilities - but we will consider applicants with experience and knowledge in both commercial, military, manufacturing, facilities and other sectors.  The Data Analyst will have experience establishing data structures, and working with applications including GIS, Excel and other modeling tools to support business decision making. Ideally the individual will have experience in establishing governance frameworks and will be able to advise clients on the improvement of data quality.  Additional information about WSP’s Advisory Services Group may be found at: http://www.wsp.com/en-GL/sectors/strategic-consulting  Primary Roles and Responsibilities Work directly with clients to analyze business processes and practices, and identify opportunities for improvement Business process re-engineering within large infrastructure organizations Can work within a multi-disciplinary team to support, and/or lead the delivery of complex consulting projects across sectors - with a focus on the infrastructure verticals Independently perform qualitative and quantitative analyses, document findings, present project outcomes and manage client relationships This role will be 50% assigned to the California High Speed Rail program - the first ever high speed rail system in the USA. Working with the Asset Management Office, the individual will assist with business process improvement initiatives, that drive the development of further technology improvement within the program. Support the professional growth of our junior consultants within the AMBA practice area Required AttributesProven experience in consulting or a comparable role in an organization where the individual has held a role responsible for managing data, information or the deployment of technologies to manage assets.A strong team player who can get things done, can provide leadership when needed or be led when required.A good understanding of infrastructure – particularly transportation and a working knowledge of how to structure data systems for effective use. asset management and the challenges organizations face with introducing business change to improve management practicesA good understanding of technologies used to support asset management (including EAM, GIS, CAD, BIM etc) and a good understanding of asset based technologies.Familiarity with national and international practices and standardsAn ability to share knowledge informally and formally and coach and support more junior consultantsRequirementsBachelor’s degree in relevant field, with graduate degree preferred7+ years’ experience in directly relevant endeavorsFamiliarity with one or more Enterprise Asset Management programs (e.g. Maximo, Infor)Strong written and oral communication skillsStrong interpersonal skills and high emotional IQMust have authorization to immediately work in the United StatesLocationThe asset management team works nationally and the candidate should be available to travel. The preferred home location for this posting is in the San Francisco area.About WSP USAWSP USA (formerly WSP | Parsons Brinckerhoff) is the U.S. operating company of one of the world's leading engineering and professional services firms—WSP. Dedicated to serving local communities, we are engineers, planners, technical experts, strategic advisors and construction management professionals. WSP USA designs lasting solutions in the transportation, buildings, energy, water and environment sectors. With nearly 7,000 people in 100 offices across the U.S., we partner with our clients to help communities prosper. www.wsp.com/usaWSP provides a progressive mix of benefits including medical, dental 401k and long term disability focused on a providing health and financial stability throughout the employee’s career.At WSP, we want to give our employees the challenges they seek to grow their careers and knowledge base. Your daily contributions to your team will be a key piece in our meeting client objectives, goals and challenges, are you ready to get started?WSP is an Equal Opportunity Employer.The selected candidate must have the ability to work in the United States immediately.EOE / Veteran/ Disability/ Gender/ Minority/ Female/ Gender Identity/ Sexual Orientation"}