{"jobID": "2794098573", "jobLocation": "New_York_NY", "jobTitle": "Small-Market Account Executive, Nonprofit", "companyRating": null, "companyInfo": {"Website": "www.salesforce.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1999", "Type": " Company - Public (CRM) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Oracle, SAP, Google"}, "estimatedSalary": null, "jobDescription": " Everyone who wants to change the world should have the tools and technology to do so. Technology is the most powerful equalizer of our time, providing access to data, knowledge, and--above all--connections. Salesforce.org gets our technology in the hands of nonprofits and educators so they can connect with others and do more good. As a social enterprise, the more missions our technology supports, the more we invest back into technology and communities, creating an endless circle of good. We’re here to help; visit us at Salesforce.org.Everyone who wants to change the world should have the tools and technology to do so. Technology is the most powerful equalizer of our time, providing access to data, knowledge, and--above all--connections. Salesforce.org gets our technology in the hands of nonprofits and educators so they can connect with others and do more good. As a social enterprise, the more missions our technology supports, the more we invest back into technology and communities, creating an endless circle of good. We’re here to help; visit us at Salesforce.org. The Account Executive is the “quarterback“ of the customer relationship, and we are looking for superstars to grow our team. We are seeking an experienced, quota carrying sales performer who is looking to focus their skills to drive the effective use of technology for social benefit. If you have a passion for technology and an interest in how it can facilitate positive social change, combined with large organization/enterprise technology sales experience, we want to talk with you. Responsibilities:Develop of sales plans to effectively and efficiently cover the accounts within an assigned geography.Manage lead qualification and conversion from interested non-profit accounts.Aggressively prospect and generate new contractual relationships with non-profit accounts.Manage the success, adoption and growth of existing customers.Consult with and advising large, strategic nonprofit customers resulting in increased adoption, success and expansion.Inside sales position with limited travel requirements (Required Skills/Experience:Track record of success (3+ year) in CRM or related business application sales.Detailed knowledge of SaaS applications (hands on experience with Salesforce, Force.com and AppExchange offerings preferred). Passion for helping advance the mission of non-profit organizations. Strong technical background.Strong interpersonal and presentationExceptional verbal and written communication skills.Extensive experience with web based conferencing tools such as Go-To-Meeting, WebEx, etc.Ability to work in a fast paced, team environment. Bachelors Degree strongly preferred.Please submit your resume in Word or PDF format only.*LI-YPosting StatementSalesforce.com and Salesforce.org are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Headhunters and recruitment agencies may not submit resumes/CVs through this Web site or directly to managers. Salesforce.com and Salesforce.org do not accept unsolicited headhunter and agency resumes. Salesforce.com and Salesforce.org will not pay fees to any third-party agency or company that does not have a signed agreement with Salesforce.com or Salesforce.org."}