{"jobID": "2520828276", "jobLocation": "Los_Angeles_CA", "jobTitle": "Associate Data Scientist", "companyRating": "4.2", "companyInfo": {"Website": "www.factual.com", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Foursquare"}, "estimatedSalary": "137000", "jobDescription": " Do you love data, technology, and problem solving? Join us at Factual, where were hard at work organizing and optimizing the worlds location information. Our team is focused on cleaning, structuring, and delivering our dataset of over 100 million places. To make our goals a reality, we end up taking on unusual problems with small, focused teams made up of highly motivated people.  Our Data team is seeking an Associate Data Scientist to help us ensure we deliver the highest quality Global Places product on the market. In this role, you will investigate and solve complex data quality and delivery problems. You will acquire new data sources and contribute to our data processing software. You will author specifications for new tools and help manage technical projects. In short, youll work on everything from experimental data science to wild west data wrangling.  At Factual, we cultivate multidisciplinary engineering teams. Everyone is comfortable with wrangling data, but we expect each individual contributor to bring a unique skill or expertise to the table. You should be a fast-working, highly-focused individual who pays strong attention to detail, shows great leadership and organizational skills, and gets things done.  About you: You are comfortable with data analysis, wrangling, and curationYou have a degree in a quantitative field with coursework in statistics (e.g. Math, Linguistics, Physics, Chemistry, Engineering)You feel at home on the command line and with text processingYou are eager to learn new technologies and skills in data processing and analysis Baseline Skills (these are required): 1+ years of full-time work experience or domain-relevant internshipsProficient with Unix commands and Ruby/Python scriptingFamiliar with regular expressions, DOM/CSS/HTML, parsing JSON, and information extractionExperience in reporting, analytics and databases Specialized Skills (you need expertise in at least one of the following): Experience with implementing machine learning pipelinesExperience with Spark or MapReduceExperience with SQL and/or querying MongoDB or Solr IndexesPleaseincludeacoverletter!"}