{"jobID": "2770364067", "jobLocation": "Middletown_NJ", "jobTitle": "Sales Associate", "companyRating": "3.8", "companyInfo": {"Website": "www.cdw.com", "Headquarters": "Lincolnshire, IL", "Size": "5001 to 10000 employees", "Founded": " 1984", "Type": " Company - Public (CDW) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "13", "jobDescription": "Are you passionate about starting or growing your sales career? Do you have a passion for technology? At CDW, we are “People Who Get IT.” Our entry level, inside sales Account Representatives begin their career at CDW with award winning, paid training so they can design customized, cost effective solutions for their customers. Account Representatives craft and build consultative, long-term relationships with businesses, government, education, and healthcare customers nationwide. If you are ambitious, money motivated and dedicated, look no further than CDW.Responsibilities:Outbound calling to potential and established customers everydayEstablishing and growing relationships with key executives and decision makersOvercoming customer objections to close sales and educate customers on the values of doing business with CDWPositioning CDW’s solutions as a strategic advantage to our customers’ long term needsMaintaining CDW’s values and Philosophies of SuccessQualificationsStrong sales drive and aspiration to winProficient with Microsoft Office in addition to basic computer knowledgeStrong organization and time management skillsAbility to multitask. We help you with this by providing dual monitor setupsEffective communication skills to aid in forming relationships with your customers and coworkerCDW Offers:Guaranteed base salary PLUS uncapped commission potentialAwesome partner incentives such as TVs, tablets, trips, sporting events and cashCareer advancement opportunities. Over 88% of Sales Managers were Account Representatives prior to their move into sales managementMedical, dental, and vision benefits. CDW invests in all aspects of your wellbeingCompany paid vacation and sick timeProfit sharing, 401K and coworker stock purchase programThinking of continuing your education? CDW provides tuition reimbursementWe give back with on-going community involvement opportunities and our charitable match programAbout CDW:CDW is a leading multi-brand technology solutions provider to business, government, education and healthcare organizations in the United States, Canada and the United Kingdom. A Fortune 500 company with multi-national capabilities, CDW was founded in 1984 and employs more than 8,700 coworkers. For the twelve months ended December 31, 2017, the company generated net sales of approximately $15 billion. For more information about CDW, please visit www.CDW.com.Awards and Recognitions:Ranked #189 on the Fortune 500 listRanked #137 on Forbes’ list of America’s Best EmployersRanked #81 on Glassdoor's Best Places to Work U.S. (2018)Ranked #41 on Top 100 Military Friendly Employers by G.I. JobsRanked #17 on Computerworld's \"Best Places to Work in IT\"Ranked #13 on 2017 Best for Vets: Employers list by Military TimesRanked #13 on Glassdoor’s list of the Top 25 Companies for Culture and ValuesRecognized as a Top 5 Chicago Performer by The Chicago Network Census for high number of women in executive rolesRecognized Thomas Richards on Glassdoor’s list of the highest-rated CEOs in 2017 (#23)Recognized Thomas Richards as one of the 25 most influential executives in 2017 by CRN (#17)Recognized on U.S. Veterans Magazine’s 2017 Best of the Best list"}