{"jobID": "2737462367", "jobLocation": "San_Francisco_CA", "jobTitle": "Research Analyst Intern", "companyRating": null, "companyInfo": {"Website": "www.idevinternational.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Duration: Four (4) Month Minimum with Option to Extend, 3-5 hours per week Focus: Tech, Impact Investing, Emerging Markets, International Development About I-DEV International I-DEV International (www.idevinternational.com) is a global strategy and investment advisory firm with offices in Lima (Peru), San Francisco (USA) and Nairobi (Kenya) committed to unlocking the unique insights, innovation and investment needed to build and scale high-impact businesses around the world. We advise on private sector strengthening initiatives and directly support SMEs (Small Medium Sized Enterprises) in their Seed through Series C rounds to become regional and international leaders. By building these leading businesses and a stronger private sector, we are creating jobs, bolstering local economies, and reducing stressors that drive conflict. I-DEV has worked in over 10 sectors to create game changing impact; however, core areas of expertise include Mobile/Internet Technology, Clean Energy, Sustainable Agriculture, and Emerging Markets Supply Chains.  Founded in 2009, I-DEV has become known as “a unique combination of grassroots development, hard-nosed business and savvy 2.0 smarts.” We have built a network of clients and partners that includes 100+ emerging market and impact investment funds (with over $10 billion in combined committed capital), Fortune 500 corporations, high impact SMEs, and leading foundations and development organizations. I-DEV Global Sample EngagementsAfricaSole-Sell Side Advisor for the largest Seed round in East Africa to date totaling $1.5M for Kenyan m-commerce enabled B2B distribution companyEast Africa market penetration and growth strategy for leading South African clean energy companyWorld Bank program review & strategy development on market-based interventions to bring clean energy and improved cooking solutions to low income areas in East AfricaLatin AmericaDue diligence and investment strategy for Conservation International Peru to support early stage conservation enterprises in the rainforest and prepare them for investmentStrategy & concept design for sustainable apparel brands Eileen Fisher & Indigenous Designs to build Secondary Benefits Programs, a new model that offers tiered benefits to smallholder producers along apparel and other raw inputs supply chainsGlobal supply chain and sourcing strategy for a leading European supplier of exotic fruits & vegetables that utilizes CSR and fair trade funds to strengthen supply chains and impact for their smallholder farmersGlobalResearch and development of regional reports on market trends and innovations in frontier markets across the globe, including East Africa and Latin AmericaPosition Description & Responsibilities As a Research Analyst Intern at I-DEV, you will: Conduct market research related to I-DEV’s work, e.g. in clean energy, sustainable agriculture, innovative financing models, tech, and BoP supply chainsAssist in the creation of content to share findings and promote I-DEV’s work, including thought leadership reports, Medium articles, etc.Support teams in managing global databases The ideal candidate is a current senior in college, recent graduate or masters student. Most work can be done remotely with video, ideally with bi-weekly in person check-ins with team.  This internship is a good opportunity to gain a broad understanding of the ecosystem, while building work experience with a leading international firm in the sector. Qualifications & Selection Criteria At I-DEV, we seek to hire and train the next emerging markets and global leaders focused on high-impact business solutions, and to share critical insights developed through our work. We seek world travelers, adventurers and game changers who believe anything is possible and that we can make it happen. Our teams are lean, yet not afraid to go above and beyond or get our hands dirty to uncover the best solutions for our clients. Core Qualifications for Interns:Strong research and critical thinking skillsStrong organizational and project management skillsStrong verbal and written communication skillsExperience in Word, PowerPoint, Excel, and Google DriveComfortable working independently and in an entrepreneurial, start up environmentYou may be a perfect fit, if these also describe you…Independent, proactive and comfortable asking the hard questionsCreative in identifying cost-effective solutions to any challengeAdventurous, open-minded and ready to learnHumble in collaboration and bold in ideas and brainstormsPassionate about problem solving and emerging markets developmentBelieve that businesses- social enterprise or not- can create powerful change in emerging markets, and that long-term financial stability and growth of any business is a critical first step to creating meaningful social and environmental impact"}