{"jobID": "2552764489", "jobLocation": "New_York_NY", "jobTitle": "Psychiatrist - Psych ER (CPEP)", "companyRating": null, "companyInfo": {"Website": "www.pagny.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Overview Physician Affiliate Group of New York (PAGNY) is comprised of nearly 4,000 physicians and healthcare professionals who provide services to NYC Health + Hospitals, the largest public health system in the United States. Our practitioners are highly skilled professionals with outstanding credentials who deliver the highest level of quality healthcare to patients throughout New York City. Equal Employment Opportunity Employer M/F/D/V. Jacobi Medical Center is a modern, state-of-the-art, Level 1 Trauma Center located in an attractive and safe residential Bronx neighborhood just 20 minutes north of Manhattan. It is a North Bronx Healthcare Network hospital affiliated with North Central Bronx Hospital and a teaching site and academic affiliate of the Albert Einstein College of Medicine. It offers a full continuum of Acute Care Inpatient and Outpatient Services in diverse Medical and Surgical Specialties, including Psychiatry. The Department of Psychiatry has 89 adult acute inpatient beds, a CPEP, a Consultation-Liaison Service, an Adult Ambulatory Practice, and a Community-Based Assertive Community Treatment Program. The department employs evidenced-based best practices in providing the highest quality care to its patients, in a patient-centered approach that is respectful of their individuality, culture, and community.  Our Comprehensive Psychiatric Emergency Program (CPEP) is a state of the art emergency psychiatry service. The CPEP provides a spectrum of multidisciplinary services designed to meet the needs of our diverse clientele in the most effective and least restrictive manner possible. Our new 11,000 square-foot, state of the art facility includes separate pediatric and adult waiting areas, patient interview rooms, a patient holding area, and six Extended Observation Beds. Responsibilities We are currently accepting applications for a full-time (40hr) Psychiatrist in our CPEP.The Attending Psychiatrist is responsible for the provision of cutting edge, comprehensiveevidence-based psychiatric care to patients who present to the CPEP.An academic appointment at Albert Einstein College of Medicine is offered.Supervision of nurses, social workers, physician’s assistants, students, and others participating in the care of patientsCompletion of comprehensive assessments and treatment plansInitiation of treatment for acute and chronic psychiatric and medical illnessesCoordination of disposition planning in conjunction with Social Work and Physician Assistant staffDocumentation of incidents in conjunction with other members of the treatment teamDistribution of work among physicians and other treatment team membersQualificationsEligible for medical licensure in the state of New YorkBoard certified in Adult Psychiatry (or Board Eligible if within 5 years of completing residency training)Ability to make sound and timely triage, treatment, and disposition decisionsAbility to coordinate with multiple disciplines in the evaluation and care of patientsPreferred Qualifications:Previous psychiatric ER or CPEP experienceSuperior clinical, diagnosis, crisis management, interpersonal/communication and team building skills."}