{"jobID": "2745472154", "jobLocation": "Waltham_MA", "jobTitle": "Mobile Software Engineer Intern", "companyRating": "3.5", "companyInfo": {"Website": "www.constantcontact.com", "Headquarters": "Waltham, MA", "Size": "Unknown", "Founded": " 1998", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Cimpress, Eventbrite, MailChimp"}, "estimatedSalary": "57000", "jobDescription": " As a part of our agile team, you'll be working with innovative tools, processes, and people to engineer mobile iOS and Android applications that are distributed and consumed on a massive scale. About Us We are a fun, collaborative, agile work team solving interesting engineering challenges involving scale and big data. Our organization puts an emphasis on learning and career growth with a commitment to a work/life balance and sustainable development. We work with state of the art technologies, methodologies, and processes and are able to offer very competitive salaries. About You You are open to change and eager to work with tools and technologies that may be outside your comfort zone. You enjoy working in an open and collaborative environment. You express your opinions, and have the facts to back them up, but are willing to compromise when necessary. You like to have fun while youre working, but understand when its time to get serious. You are a dedicated software craftsperson who cares deeply about best practices and what it takes to write and maintain great code. ResponsibilitiesAs part of a cross-functional, mobile scrum team, contribute to the development of features that allow our customers to create, schedule, and manage email marketing campaigns using mobile iOS and Android apps.Ensure high-quality standards are maintained throughout the codebase by being an active participant in code reviewsMaintain the health of the codebase through appropriate refactoring and improvement of existing functionalityTechnical SkillsWorking towards a B.S/M.S. in Computer Science or equivalent discipline.Experience with mobile iOS and Android app development using Xcode or Android Studio.Experience with Objective-C, Swift, Java, or Kotlin programming languages."}