{"jobID": "2827611433", "jobLocation": "Boston_MA", "jobTitle": "Senior Health Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.massgeneral.org", "Headquarters": "Boston, MA", "Size": "10000+ employees", "Founded": " 1811", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " CareGroup, Beth Israel Deaconess Medical Center, Boston Medical Center"}, "estimatedSalary": "75000", "jobDescription": " BACKGROUND GENERAL SUMMARY/ OVERVIEW STATEMENT: Massachusetts General Hospital , founded in 1811, is the original and largest teaching hospital of Harvard Medical School . MGH is a 960 bed hospital with Level I Trauma designation for adults and pediatrics as well as burn care. MGH was designated as the first Magnet Hospital in MA in 2003. MGH has five multidisciplinary care centers - known worldwide for innovations in cancer, digestive disorders, heart disease, transplantation and vascular medicine. MGH is proud of the care we provide to the community through our six licensed health centers. MGH sponsors Graduate Medical Education for 17 specialty areas and support training for nursing, pharmacy and the therapies. MGH is broadening its affiliations creating a broader network or family of facilities. The MGH conducts the largest hospital-based research program.  Established in 2007, The Edward P. Lawrence Center for Quality and Safety, MGH / MGPO drives the implementation of the Quality and Safety strategic plan. Broad responsibilities of the Center include management and oversight of Patient Safety, Quality Management, Patient Care Assessment, Quality Measurement and Analysis, Informatics, Reporting of Quality and Safety both to our internal and external constituents, Care Redesign, Q&S; research and Clinical Compliance and Process Improvement activities. Employing an interdisciplinary team of clinicians, data analysts, researchers, project managers and informatics professionals, CQS serves as an institutional resource to further the MGH's and MGPO's goal of leading the nation in quality and safety by creating the highest quality, safest care environment for our staff and patients. MGH ranks among the very top of U.S. News & World Report list of \" America 's Best Hospitals.\" Improving Quality and Safety at MGH remains one of the most important goals and institutional efforts are led by the Edward P. Lawrence Center for Quality and Safety.  PRINCIPAL RESPONSIBILITIES and REQUIRED SKILLS Under the general direction of the Director of Reporting & Analytics (the Director), the Senior Data Analyst (the Analyst) will provide analytic and project management support to high priority quality and safety initiatives throughout the institution. The position requires strong analytical skills, expertise in healthcare quality measurement, strong project management and organizational skills, and excellent interpersonal and communication skills. The Analyst will support the Director and other customers of the Center for Quality and Safety to measure, report, summarize and communicate MGH performance on key quality and safety indicators, including measure development.  A solid understanding of the content and methodology of healthcare quality measurement is a must (e.g. basics of risk adjustment, benchmarking, performance management). S/he must also possess strong analytical and technical skills in SQL/SPSS or SAS and competence in managing projects in partnership with healthcare providers. A willingness to learn and an ability to adapt to the rapidly changing quality reporting needs of the hospital is a must. The ideal candidate will have working knowledge of quality and safety improvement strategies and methods, such as Lean, Six Sigma or IHI.  A. Analytic SupportWorks in partnership with the Director and other Analysts to summarize and track performance for: o Public quality and safety measures  o Regulatory reporting  o Government, commercial, and internal incented (Pay for Performance) measures  o Internal measures, e.g. readmission by department, that support MGH's goals and/or strategy Assists in the design and production of several vehicles used to manage performance including but not limited to: o MGH Key Quality and Safety Indicators  o Annual Report on Healthcare Equity and Quality  o MGH Readmission Dashboards  o Care Redesign Value Dashboards (25 teams and growing)  o Department/Chiefs Dashboards  o Medication Safety Reporting  o Hospital Acquired Infection Reporting  o National Hospital Quality Measures/Core Measure Reporting  o Joint Commission/National Patient Safety Goal Reporting  o P4P performance  o MGH Q&S; website  o Ad-hoc reports and special requests from Clinical Departments Interprets and communicates performance data to clinical and executive audiences, including preparation of summaries and slide decks. Analyzes and critiques preview data, public data, payment reports, and/or rankings by organizations such as CMS, MassHealth, Leapfrog, US News, local media, etc. Receives and interprets requests for analyses and reports from internal customers and external entities at all levels. Works with stakeholders to define populations and metrics, conduct appropriate analysis, revise analysis based on stakeholder feedback and develops final presentation/report for customer. Utilizes appropriate analytical approach and business intelligence tool to produce reports most efficiently and effectively. Works collaboratively with customers to develop the right report using the right data with the right tool for the job (e.g. Excel, Access, Tableau). Presents data in a user-friendly, intuitive visual display, and designs reports that address the needs of the customer. Provides clearly written documentation of measure specifications and/or executive summary of report where appropriate. Participates in the development, validation, implementation, and maintenance of SQL queries for the successful extraction of appropriate data. Conducts careful quality assurance in a replicable and transparent manner. Ensures the accuracy of results to maintain the high quality and integrity of databases and CQS reports. Develops and maintains documentation and libraries on key processes. B. Project Management Provides project management for ongoing and new data analysis initiatives, coordinating logistics such as project timelines, agenda development, production and distribution of meeting minutes and documents, and preparation of reports on project status and activities to various audiences. May serve as liaison to selected improvement initiatives (e.g. Health Equity, Care Redesign), providing project management to multidisciplinary and often interdepartmental teams focusing on high-priority quality and safety initiatives. Provides superior customer service always. Understands and manages customer expectations. C. Support to Senior ManagementCoordinates agendas, project timelines and produces and distributes minutes as neededProvides ad hoc support to senior level committees as requested.Undertakes special projects as assigned by the Director. Key relationshipsEstablish strong working relationships with o Applied Informatics Team  o CQS Consulting/Process Improvement Team  o RN Chart Abstractors (for regulatory submission process)  o Care Redesign Management and Teams (25 teams and growing)  o Quality colleagues throughout the hospital  o Quality colleagues in Partners Quality, Safety, and Value Represent MGH on Partners Committees as requested SUPERVISORY RESPONSIBILITY Data Analysts lead specific reporting projects in collaboration with multiple CQS colleagues, clinical team leaders and senior administrators and without direct supervisory responsibility over team members. Qualifications QUALIFICATIONS Bachelor's Degree in Business, Health Policy, Public Health, or other related field required; Master's Degree strongly preferred . 3-5+ years healthcare experience. Knowledge of healthcare quality metrics, datasets and methodologies a must. 3-5 years demonstrated experience in: Data management and reporting tools such as MS Access, MS Excel, SAS or Stata SQL Server databases, with related tools such as Query Analyzer or SSMS Relational databases · Expertise in manipulating and interpreting data using clinical, hospital-based, ambulatory, and claims-based databases.  Ability to work independently in a dynamic, fast-paced environment and able to prioritize tasks. Excellent organizational skills, ability to manage multiple tasks and projects, meet deadlines and manage to schedule. Excellent communication skills, with a capacity for analyzing and presenting data. Ability to communicate complex reports to a non-technical, clinical audience. High degree of professionalism, discretion, and confidentiality. Ability to develop effective relationships with a broad array of people from diverse backgrounds. Experience with the following is desirable: EPIC Electronic Medical Record Tableau Data Visualization software WORKING CONDITIONS: The Analyst will be located with other members of the Analytics and Reporting Team and Applied Informatics Team, currently at 101 Merrimac. The current office space provides for 3 individuals per office.  The above is intended to describe the general contents and requirements of work being performed by people assigned to this classification. It is not intended to be construed as an exhaustive statement of all duties, responsibilities or skills of personnel so classified. EEO Statement Massachusetts General Hospital is an Equal Opportunity Employer. By embracing diverse skills, perspectives and ideas, we choose to lead. Applications from protected veterans and individuals with disabilities are strongly encouraged.  Partner's Healthcare is acting as an Employment Agency in relation to this vacancy."}