{"jobID": "2758448227", "jobLocation": "San_Francisco_CA", "jobTitle": "Product Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.climate.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2006", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "94000", "jobDescription": "Position Overview: The Climate Corporations mission is to help the worlds farmers sustainably increase their productivity with digital tools. The Data and Analytics team is focused on creating competitive advantage for Climate and our customers through novel data infrastructure, metrics, insights and data services. We are a small but rapidly growing analysis and engineering team that builds and leverages state-of-the-art analytics systems. Our work informs decisions and direction for our business, while also impacting our products.  Data Analysts are part of a core team that drives strategic decision making throughout the company. As a member of the team, your primary responsibility will be to work with department leaders to derive insights that improve business performance. This includes exploratory analysis of large data sets, metrics identification and report creation, and development and maintenance of analytic systems. This role will broadly influence the companys products, operational effectiveness and elevate the role of data as an asset to the business. We are looking for a candidate with a passion for data analysis and impact who has a demonstrated knowledge of SQL and strong communication and teamwork skills. What You Will Do:Partner with other departments to solve problems and identify trends and opportunitiesLead cross functional teams and be a catalyst for data driven decision makingPerform detailed data exploration and validation from a variety of sourcesBuild reports, dashboards, and metrics to monitor the performance of our companyDevelop new insights and analyses that inform decisions and help us continue to delight the people using our platformActively maintain the integrity and performance of analytics systemsProvide advice and education in the usage and interpretation of data to the business users.Data mining, statistical analysis and visualization of data to help understand how growers are interacting with our FieldView productEffectively present your findings to product partners and senior managementBasic Qualifications:BA/BS, MA/MS/MBA with a focus on business, economics, statistics, math, physics, or related quantitative discipline.3+ years of relevant experienceExpert in SQL: experience querying large, complex data sets to understand at a granular level whats happening in the businessProficiency with reporting tools like Looker, Tableau, Periscope, Microstrategy etc.Preferred Qualifications:Experience working as an analyst in a product, marketing or sales organization.Strong background in statistics is a plus (experience with R, Python, SAS, SPSS, Stata or similar)Familiarity with a high-level programming language.Ability to execute research projects, and generate practical results and recommendations.Enjoy working in both individual and team settings.Passion for data analysis.Excellent communication and collaborative skills.What We Offer: Our teams are composed of industry experts, top scientists, and talented engineers. The environment is extremely engaging and fast-paced, with dozens of specialties coming together to provide the best possible products and experiences for our customers.  We provide competitive salaries and some of the best perks in the industry, including: Superb medical, dental, vision, life, disability benefits, and a 401k matching programA stocked kitchen with a large assortment of snacks & drinks to get you through the dayEncouragement to get out of the office and into the field with agents and farmers to see first-hand how our products are being usedWe take part and offer various workshops, conferences, meet-up groups, tech-talks, and hackathons to encourage participation and growth in both community involvement and career development We also hinge our cultural DNA on these five values: Inspire one anotherInnovate in all we doLeave a mark on the worldFind the possible in the impossibleBe direct and transparent Learn more about our team and our mission:  The Climate Corporation - The Technology Behind Making A Difference  https://youtu.be/c5TgbpE9UBI or visit https://climate.com/careers  #LI-PP1"}