{"jobID": "1949398620", "jobLocation": "San_Jose_CA", "jobTitle": "Account Executive – Security Sales", "companyRating": null, "companyInfo": {"Website": "www.rfi.com", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Do you consider yourself: ConfidentIndependentCompetitivePersuasiveOutgoingDrivingFast-PacedIndependentUninhibited If this sounds like you, keep reading! Overview & Responsibilities: RFI Communication & Security Systems is looking for a confident Account Executive with excellent communication skills who is able to work in a fast paced environment. This position reports directly to Operations Manager. The duties of this position include: Building and maintaining strong sales pipelines and forecasts, performing site-walks with customers and direct reports to determine customer needs, preparing and facilitating presentations, system demonstrations and proposals, closing sales and finalizing agreements with customers, maintaining regular updates on sales activities including customer calls, appointments, presentations and project opportunities in SalesForce, provide management with regular sales activity and business development updates, and other duties as deemed necessary.  The successful candidate must be a proven self-starter, with five or more years’ of Sales experience, preferably in the Construction industry. A High School Diploma or GED are required. Proficiency in the following computer programs is desired: MS Excel, Access, Word, Outlook, PowerPoint, CAD, Mastermind, SalesForce, Microsoft Dynamics AX and Internet. Must be able to multi-task, complete projects efficiently and accurately in an organized manner, within guidelines established by senior management. About RFI RFI Communications & Security Systems is a privately-owned, diversified, multi-systems integrator that has been designing, installing, servicing and monitoring, technology-driven security and fire/life safety solutions for over thirty five years. Committed to our past and our future – RFI, established in 1979, is a large systems integrator doing business across the US with offices in California, Nevada, and Washington. Visit our company website at www.RFI.com to learn more about RFI. Benefits Include: Medical, Dental, Vision and Disability Plans, Flexible Spending Accounts, Health Reimbursement Accounts, Life Insurance, Employee Assistance Program (EAP), 401k Plan & 529c for college saving, paid time off and paid holidays.  In addition to all of the above benefits our employees enjoy company sponsored training, employee referral program, tuition reimbursement, and commuter benefits."}