{"jobID": "2806526003", "jobLocation": "New_York_NY", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.hyperscience.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "At HyperScience we bring AI to the enterprise. Our products help enterprises become more productive, efficient, and competitive by automating various types of office work and reducing bureaucratic burden both on businesses and their customers. We take a heterogeneous approach to AI, using a blend of what are traditionally considered different fields of ML: deep learning, computer vision, and NLP among others. We believe that delivering AI to the enterprise is the key to unlocking new applications of human potential, and we are excited to execute on our plan to do so.We are looking for our first data analyst to supercharge our ML teams by diving deep into the data and surfacing key insights to improve our models and drive better outcomes for our customers and the business.You not only love putting your technical skills to work to obtain quantitative answers, but you also obsess over clear communication of your findings enabled by your structured problem solving approach. You have experience working with product and engineering teams to uncover optimization opportunities and bring data-driven insight to simplify and clarify seemingly intractable problems. You have experience using a broad array of established analytical tools (Jupyter notebooks, pandas dataframes, and good ol SQL and Excel) and a sincere desire to personally develop by exploring burgeoning fields like interpretability for deep learned models.What You'll Achieve: Within the first 30 days:You will understand the product were building, why our customers need it, and where its headedYou will understand our model training and evaluation process and the accompanying analytical frameworks and toolsYou will spot opportunities for improvement and begin formulating ideas on how to start closing those gapsWithin the first 60 days:You will have shared the findings from your first analysis deep dive resulting in improvements to a model well release to our customersYou will have shipped an improvement to our evaluation tools to improve readability and/ or interpretabilityYou will have stepped outside the ML team and provided analytical assistance to help our Deployments team respond to an important problemWithin your first quarter and beyond:By digging into data, you will have formulated a data-driven recommendation for a new product featureYou will have identified an opportunity to improve our training set and found the dataset to plug the holeDesired Experience and Qualities:2-3 years of professional analytical experienceProficiency with Python and the scientific Python suite (numpy, pandas, Jupyter notebooks)Proficiency with SQLDemonstrated track record of taking unstructured problems and reaching actionable recommendations based on dataExperience working directly with a product development team including a Product Manager and software engineersStrong communication skills with local and remote teamsThe Nice-to-Have's:Familiarity with machine learning methods and technologiesInterest in new field of interpretability of Deep LearningBenefits:Competitive salaryComprehensive medical and health coverageMeaningful equity401k with company matchFlexible PTOChoice of hardwareGym membershipDaily lunchA variety of snacks and drinksThe ability to change the landscape of office workNote to Recruiters and Placement Agencies:HyperScience does not accept unsolicited agency resumes. Please do not forward resumes to any person or email address at HyperScience prior to obtaining a signed agreement from Recruiting/HR. HyperScience is not liable for and will not pay placement fees for candidates submitted by any agency other than its approved recruitment partners.HyperScience provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, HyperScience complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training."}