{"jobID": "2791121340", "jobLocation": "New_York_NY", "jobTitle": "FinTech Sales - Account Executive", "companyRating": null, "companyInfo": {"Website": "www.evestment.com", "Headquarters": "Atlanta, GA", "Size": "201 to 500 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " ABOUT THE ROLEWhat it is: Picture yourself aggressively contributing to eVestment’s bottom line by promoting and selling eVestment to the institutional investment marketplace. You’ll leverage your pipeline and your cold calling skills to uncover, qualify and close new opportunities with new clients, and this process will include understanding the business problems of your prospects and giving smart, polished demos of our solutions. By ruthlessly qualifying opportunities and creating new ones through need/benefit discussions with prospects, you’ll be able to clearly articulate buying rationale and close a ton of business. You’ll also be a Salesforce.com power user, providing transparency into your pipeline. What it isn’t: This role isn’t retail consumer sales, so your work experience must include B2B sales (preferably in the institutional investment technology space). It also isn’t mired in paper; if your technology skills (think PowerPoint, advanced Excel, WebEx, etc.) aren’t truly stellar, you’ll have a hard time keeping up. If speaking in front of strangers makes your neck splotchy and your palms sweaty, this role isn’t a fit for you. We need you to have a natural talent for presenting details with professional flair, including a fantastic speaking voice and assertive, confident demeanor (but no finger guns here). This role doesn’t function in a vacuum; if you’re uncomfortable with high levels of accountability via regular weekly conversations with leadership about your results and what’s in the queue, you might find this responsibility uncomfortable.ABOUT YOUWho you are: You’re an eager student of the investment management world who devours learning. You find it unbelievable that most of society can’t explain the difference between a stock and a bond. Maybe you’ve worked for 2-3 years at an investment management firm, an institutional consulting shop or with wealth management clients. You’re passionate about the industry but have figured out that you don’t see yourself as a career analyst. At the same time, you don’t want to be a financial advisor who hits up your friends and family for their retirement accounts. You hate to do things the old fashioned way, and always ask yourself: how will this work be done in ten years? What role will technology play?  You’re looking for a job where you can be creative and work independently, but enjoy the structure and accountability that being part of the team provides. You love to work with a broad group of team members involved in marketing, product innovation, client service, lead generation and legal. You also respect the details involved after the sale, including the sometimes tedious contract process and the Salesforce.com CRM data (but you realize how valuable this tool can be). Ultimately, you are passionately driven to achieve and be recognized for that achievement.  Your friends/colleagues would describe you as a great teacher—always able to communicate complicated concepts in clear terms with patience. You’re known for your dedicated work ethic— if you run out of things to do at work you find yourself doing other people’s jobs…better than they were doing them initially (but never gloating or belittling, because you’re better than that). You’re an initiator—you planned last week’s social outing with your friends/family, and you’ll probably plan the next one, too. You’re winsome and outgoing— even your dental hygienist loves you and remembers your last conversation from six months ago. You’re also protective of your reputation and prefer to be known by your integrity instead of your cunning.ABOUT USWho we are:We are eVestment, and we make smart money smarter. We are about giving institutional investors as much big data as they need to make smart investment decisions. BlackRock, UBS, Towers-Watson, Putnam and AON Hewitt are just a few of the clients who trust our cloud-based technology platforms. We are a Top Atlanta workplace, ranking #1 in the 2015 Atlanta Journal & Constitution “Top Atlanta Workplaces” list. Our environment is fun, smart, and collaborative. Casual dress, catered weekly lunches, unlimited PTO (because we trust our people), and regular teambuilding activities are part of what makes our environment awesome. We provide exceptional opportunities for development with a dedicated training budget, tuition reimbursement, and time for training and certification preparation. We’ve also ranked consistently on the Inc. 5000 fastest growing firms list every year since 2007, and we have over 350 amazing team members around the globe. #LI-KL1"}