{"jobID": "2684068041", "jobLocation": "San_Diego_CA", "jobTitle": "Tax Analyst Intern, San Diego, CA", "companyRating": "4.2", "companyInfo": {"Website": "www.intuit.com", "Headquarters": "Mountain View, CA", "Size": "5001 to 10000 employees", "Founded": " 1983", "Type": " Company - Public (INTU) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Square, PayPal, H&R Block"}, "estimatedSalary": "90000", "jobDescription": " DescriptionCome join the Consumer Tax  Group as a Tax Analyst Intern on our San Diego, CA campus!  During Intuit's summer internship program, interns will interact with our  senior leaders, learn directly from our business partners, and leverage our  processes all while taking on rigorous assignments. Our tax interns will have the opportunity to be  exposed to how the tax law is integrated with software  development . This may include interpreting tax compliance requirements, developing/testing  software, and influencing our user experience.  Through our summer internship program, university students  gain an understanding of how to instill confidence and enable business growth  with our products, customers, and internal processes while making meaningful  work contributions.  The primary objective of our summer internship program is to bring highly talented people into the organization. Our internship program is truly an 'early identification' program, focusing on identifying and investing in high potential university students graduating no sooner than December 2018, to encourage them to bring their talent back to Intuit after graduation.  Qualifications IntegrityDemonstrated interest and motivation to work  in accounting and taxStrong analytic and problem-solving skillsDemonstrated leadership and teamwork  capabilityEffective verbal and written communicationMS Office, Excel, Word, PowerPoint, AccessMust be actively enrolled in school during the  Intern program (Graduating no earlier than Fall 2018)Must reside in the Greater San Diego Area and  able to commute to our San Diego officeACCOUNTING MAJORS PREFERREDSelection Criteria:Academic performanceCase study performanceResearch and summer work experienceLeadership positions in group activities Location: San Diego, CA  Company Overview:  Imagine a career where your creative inspiration can fuel BIG innovation. Year-over-year, Intuit has been recognized as a best employer and is consistently ranked on Fortune's \"100 Best Companies To Work For\" and Fortune World's \"Most Admired Software Companies\" lists. Immerse yourself in our award winning culture while creating breakthrough solutions that simplify the lives of consumers and small businesses and their customers worldwide.  Intuit is expanding its social, mobile, and global footprint with a full suite of products and services that are revolutionizing the industry. Utilizing design for delight and lean startup methodologies, our entrepreneurial employees have brought more than 250 innovations to market – from QuickBooks® and TurboTax®, to GoPayment, Mint.com, big data, cloud (SaaS, PaaS) and mobile apps. The breadth and depth of these customer-driven innovations mean limitless opportunities for you to turn your ingenious ideas into reality at Intuit.  Discover what it's like to be part of a team that rewards taking risks and trying new things. It's time to love what you do! Check out all of our career opportunities at: careers.intuit.com. EOE AA M/F/Vet/Disability  Intuit will consider for employment qualified applicants with criminal histories in a manner consistent with requirements of local law."}