{"jobID": "2794223884", "jobLocation": "Wellesley_MA", "jobTitle": "Sr Data Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.aetna.com", "Headquarters": "Hartford, CT", "Size": "10000+ employees", "Founded": " 1853", "Type": " Company - Public (AET) ", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "137000", "jobDescription": " Sr Data Scientist  25-May-2018 Job DescriptionPOSITION SUMMARY Aetna's Consumer Health Services Customer Insights and Analytics Team creates cutting edge analytic tools to drive better and faster decision making within the organization. We are currently looking for an exceptional Sr Data Scientist - Healthcare to play a pivotal role in the creation and deployment of information products. The position is office based in our New York, NY location. Position Summary: This is a unique opportunity for someone passionate about innovation in data science, machine learning, and predictive modeling techniques. The team currently uses an industry leading scalable data platform and techniques in creating solutions to challenging business problems. This role will require frequent interaction with project stakeholders and business partners at all levels of the organization. This is a fast-paced, collaborative and iterative environment requiring quick learning, agility and flexibility. Fundamental Components: Develops and/or uses algorithms and statistical predictive models and determines analytical approaches and modeling techniques to evaluate scenarios and potential future outcomes  Performs analyses of structured and unstructured data to solve multiple and/or complex business problems utilizing advanced statistical techniques and mathematical analyses and broad knowledge of the organization and/or industry  Collaborates with business partners to understand their problems and goals, develop predictive modeling, statistical analysis, data reports and performance metrics  Develops and participates in presentations and consultations to existing and prospective constituents on analytics results and solutions  Interacts with internal and external peers and managers to exchange complex information related to areas of specialization  Use strong knowledge in algorithms and predictive models to investigate problems, detect patterns and recommend solutions  Use strong programming skills to explore, examine and interpret large volumes of data in various forms BACKGROUND/EXPERIENCE desired: 4+ years related experience with healthcare data analytics, statistical analysis, predictive modeling, machine learning techniques, and visualization tools.  Experience in healthcare analysis, preferably in provider analytics.  Comprehensive knowledge of healthcare insurance industry, products, systems, business strategies and products.  Experience in SAS or SQL programming languages.  Experience with big data technologies such as Python, R, Hadoop, Hive, and Tableau.  Demonstrated ability to effectively communicate and negotiate across the business and in the external health care environment.  Demonstrated ability to communicate technical ideas and results to non-technical clients in written and verbal form. EDUCATION The highest level of education desired for candidates in this position is a Master's degree. ADDITIONAL JOB INFORMATION Aetna is about more than just doing a job. This is our opportunity to re-shape healthcare for America and across the globe. We are developing solutions to improve the quality and affordability of healthcare. What we do will benefit generations to come.  We care about each other, our customers and our communities. We are inspired to make a difference, and we are committed to integrity and excellence.  Together we will empower people to live healthier lives.  Aetna is an equal opportunity & affirmative action employer. All qualified applicants will receive consideration for employment regardless of personal characteristics or status. We take affirmative action to recruit, select and develop women, people of color, veterans and individuals with disabilities.  We are a company built on excellence. We have a culture that values growth, achievement and diversity and a workplace where your voice can be heard.  Benefit eligibility may vary by position. Click here to review the benefits associated with this position.  Aetna takes our candidate's data privacy seriously. At no time will any Aetna recruiter or employee request any financial or personal information (Social Security Number, Credit card information for direct deposit, etc.) from you via e-mail. Any requests for information will be discussed prior and will be conducted through a secure website provided by the recruiter. Should you be asked for such information, please notify us immediately."}