{"jobID": "2817139112", "jobLocation": "Santa_Monica_CA", "jobTitle": "Data Science Intern - Performance Brands & Partners", "companyRating": null, "companyInfo": {"Website": "www.leafgroup.com", "Headquarters": "Santa Monica, CA", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Public (LFGR) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Like Python and NLP? Use both to build and categorize document corpora, generate labels for images and documents, and build prediction models for internet traffic.  We are looking for a Data Science Intern (Paid) to join our Performance Brands & Partners team at our Santa Monica office. Our goal is for you to become a self-sufficient team member. We will give you pragmatic practice of your technical computer science skills. In return, we expect reusable and tested code contributions.  Preference given to candidates with prior experience. Be sure to mention your community activity in Los Angeles. We attend Big Data Day LA and datascience.la meet-ups, you should too.  Leaf Group is a diversified Internet company that builds platforms to enable communities of creators to reach dedicated audiences in the ever-growing lifestyle categories.  A big vision calls for a big job. As we grow, our need for a Data Science Intern grows with us. Youll Report To: Sr. Director, Software EngineeringWhat You Have:You must be able to intern onsite from our Santa Monica Office for at least 20 hours/week.You must be able to commit to a 3-month internship.Excellent verbal and written communication.Not afraid to wear multiple hats - no job being too small or too large.We're casual and informal but we work hard and work responsibly. A pleasant and supportive demeanor goes a long way.Who We Are: We create experiences that celebrate the best of art, design, and technology. We want smart, curious people committed to putting people first, having fun while they work, a commitment to high quality service to make things better and a desire for constant growth. We work in a fun, hard-working collaborative environment that is diverse, adventurous, and open-minded. Check us out here: https://www.leafgroup.com/brands/ What We Have:Paid InternshipWinner of the 2017 Best Company Los Angeles award ComparablyCool office environment and culture (i.e., pet-friendly office, Thirsty Thursdays, Free Lunch Fridays, and all of the other fun activities we gather for)Employee discounts for Deny Designs, Saatchi Art, and Society6Free ParkingMost importantly, hands-on experience within a fast-moving and fun environment Leaf Group, Ltd. is an equal opportunity employer. Applicants for all job openings are welcome and will be considered without regard to race, color, religion, national origin, sex, age, sexual orientation, physical or mental disability, or any other basis protected by state, federal, or local law. It is the intent of the Company to comply with all applicable federal, state, and local legislation concerning equal opportunity in employment. Agency Disclosure: If the Leaf Group Talent Acquisition department, or any current company employee, receives an unsolicited resume from a third party recruiting agency and Leaf Group does not have a signed Agency Agreement active, Leaf Group will not be deemed liable to pay a placement fee. The unsolicited resume will be considered a gift and can be considered for our recruitment efforts."}