{"jobID": "2805310639", "jobLocation": "Seattle_WA", "jobTitle": "Data Scientist, Analytics - Brand Safety & Integrity Lead", "companyRating": "4.5", "companyInfo": {"Website": "www.facebook.com", "Headquarters": "Menlo Park, CA", "Size": "10000+ employees", "Founded": " 2004", "Type": " Company - Public (FB) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Google, Snap, Uber"}, "estimatedSalary": "159000", "jobDescription": " Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities we're just getting started.Protect the users and advertisers in the ecosystem by proactively identifying and enforcing against low-integrity behavior that ultimately creates poor user experiences, and to create a brand safe environment to increase advertiser trust and transparency.  One of the key roles of Facebook monetization team is to support creators that publish great content with monetization products that allow them to build sustainable businesses. As we grow rapidly and connect people, creators, and advertisers, our platform also bears the responsibility to protect all players on the ecosystem from undesirable behaviors. In particular, we want to prevent bad creators from monetizing harmful viral content, game the distribution + auction that crowd out good creators from reaching their audience and full monetization potential. At the same time, we must protect the creators from overly conservative policies that risk negatively impacting their livelihood and our relationship with partner communities. This role will focus on proactively identifying undesirable behaviors and building detections to identify them, and work closely with product, policy, and other integrity teams to implement actions that reduce risk. Responsibilities:"}