{"jobID": "2725035621", "jobLocation": "San_Francisco_CA", "jobTitle": "Lead Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.samba.tv", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "121000", "jobDescription": " Samba TV, recognized by Inc. Magazine as one of the fast-growing companies in the US and one of the \"most interesting ad-tech upstarts of the year\" by Business Insider.  We are changing how industry leaders and consumers think about TV, and we're looking for a Lead Data Analyst who is not afraid to challenge the status quo and would like to make a meaningful impact on our innovative products. As the Lead Data Analyst, you will explore TV data, tell stories, and help clients make better decisions.  Samba TV is uniquely positioned at the forefront of the TV revolution. The way people discover, watch, and engage with television has fundamentally changed, and we're connecting the dots to help better understand audience trends and viewership habits for marketers. Responsibilities:Innovate to add new features to our TV measurement products.Help the analyst team learn, grow, and deliver high-quality work efficiently.Analyze and interpret large amounts of data to identify user behavior trends, gaps, and inconsistencies.Produce data for assigned clients and prepare information for client presentation.Create new processes for data extraction and build automation tools for day-to-day analyses.Provide support to account team or clients by responding to ad-hoc data requests, answering questions, and providing basic technical support and analysis.Turn data into insight and communicate your findings effectively.Mentor, teach, and help enable the success of other analystsYou:Passionate about making a big impact turning data into insights in a data-driven company and industryExperienced in managing impactful data analytics projectsAble learn quickly, move fast, and to initiate and drive projects to completion with minimal guidanceThrive in a dynamic and fast-paced environmentHighly driven and stoked to work with cutting-edge technologyCommitted to teamwork, collaboration, and being a player/coachMinimum Qualifications:3+ years of industry experienceMentorship and/or management experienceBachelor's DegreeFluent in SQLExperience using PythonProficient using Microsoft Excel"}