{"jobID": "2670738489", "jobLocation": "Fremont_CA", "jobTitle": "VP Research & Development", "companyRating": null, "companyInfo": {"Website": "www.shockwavemedical.com", "Headquarters": "Fremont, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Shockwave Medical is revolutionizing the interventional treatment of advanced cardiovascular disease, creating new opportunities for patients and physicians by effectively targeting calcified plaque. Together, we are working to reshape interventional therapy with Lithoplasty® Technology for the treatment of calcified plaque.  Position Overview  Overall responsible for all product development activities for Generator and Catheters. Lead the research, technology development, and product design and development activities of the Company. Manage and lead a diverse set of projects and R&D; personnel with a focus on product quality, safety, and effectiveness.  Essential Job Functions Formulate research and product development plans and budgets for the Company, setting corporate and departmental goals and priorities related to R&D.;Responsible for ensuring that the R&D; organization achieves annual operating plan goals and budget targets.Development of patents and other intellectual property related to the Company products.Foster close cooperative relationships with all function in the Company. Work with Marketing and Senior Staff to develop new product plans and strategies; with manufacturing and quality assurance to ensure new products are of high quality and are readily manufactured; with clinical research to ensure products are safe and effective.Refine and enforce R&D; policies with particular emphasis on patient efficacy and good clinical outcomes, compliance to the Company’s Quality System and external regulatory standards including ISO 13485:2003 and FDA regulations.Recruit, hire and retain top talent for the R&D; organization.Work interactively with all functions of the Company and with Senior Staff to help achieve the Company’s vision.Other duties as assigned. These job requirements are not intended to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel.RequirementsNo medical conditions preventing access to a controlled environment room.Minimum of 12 years’ experience in R&D; or equivalent work experience.8 years of progressive management responsibility or equivalent work experience.5 years in the medical device industry; preferably with disposable medical products or minimally invasive surgery products or equivalent work experience.B.S. in engineering, bioengineering or an equivalent technical field, or equivalent work experience.M.S. or PhD. is highly desirable.Benefits Shockwave Medical offers competitive salary, equity and healthcare. If you have experience and initiative for this fast paced fun start-up, please apply.  EEO Employer"}