{"jobID": "2753251281", "jobLocation": "San_Francisco_CA", "jobTitle": "Head of Internal Communications", "companyRating": null, "companyInfo": {"Website": "www.fundingcircle.com", "Headquarters": "London, United Kingdom", "Size": "501 to 1000 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " LendingClub, OnDeck, Bond Street"}, "estimatedSalary": null, "jobDescription": "Background Are you a communications expert? Do you love finding the best way to communicate across all levels of an organization and make an impact on the culture and engagement of a company? Funding Circle’s Head of Internal Communications role may be the perfect role for you. We are looking for a senior communications team member to lead all global internal communications for Funding Circle’s offices in London, Amsterdam, Berlin, San Francisco and Denver. Reporting into the Director of Group Communications in London, this role will be a great mix of global and local responsibility for one of world’s leading FinTech companies. Strategic work will include:Responsible for leading the strategic internal communications and engagement for Funding Circlers across all geographies.Improve upon existing internal communications activity and channels and establish an internal communications strategy ensuring activities are measurable and aligned with business goals and strategy.Partner with leadership teams on best practices for communicating business information within and across departments and geographies.Work closely alongside the People function to support important initiatives for Circlers across the business.Build collaborative relationships with country (global) MDs and local communications leads.Day-to-day activitiesPlan, edit, write and design content for internal communications channels, such as regular email newsletters, video creation, projects, initiatives and events.Ensure internal messages are consistent across all channels, for different departments, and are consistent with external communication messages.Deliver engaging internal campaigns to support business and change initiatives.Ensure consistency and engagement with the Funding Circle vision, purpose, values and strategic priorities.Collaborate with network of internal culture team and activity clubs.Handle the internal communication response to any crisis situations which may affect perception and reputation.Develop regular measurement of channel and message effectiveness using analytics, surveys and focus groups.You’ve been there and done this…The ideal candidate will have 10-15 years’ communications experience ideally in a global matrix structure and a high-growth, fast-paced environment.A proven track record and compelling blend of operating at strategic level and converting comprehensive strategy to action.Strategic vision and creativity, matched with hands on operational / tactical approach.Proven experience of strategic internal communications delivery in an international environment.Ability to interact and influence at all levels of an organization.Experience of using different internal communications tools and processes.Experiences of working in financial services ideal.Excellent interpersonal skills.Excellent written and verbal skills.#LI-SC1"}