{"jobID": "2699360413", "jobLocation": "Boston_MA", "jobTitle": "Lead System Software Engineer", "companyRating": null, "companyInfo": {"Website": "www.klaviyo.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Engineering at KlaviyoKlaviyo is a Boston startup located right in the heart of downtown Boston. We craft software helping thousands of ecommerce companies to have engaging relationships with hundreds of millions of consumers. We love tackling tough engineering problems, and push each other to move out of our comfort zone, learn new technologies and work hard to ensure each day is better than the last. We seek out full stack engineers who specialize in certain areas but are passionate about building, owning & scaling new features end to end. We relish breaking through obstacles & technical challenges and moving continually faster.Klaviyo is looking for Lead System Software Engineer to take the ownership of a product area and lead a team of engineers in building and maintaining the product area.You Will Have the chance to wholly own a major product area that thousands of our customers rely on daily to reach 100,000,000+ of consumers to drive their business forward.Work on deep analytics system that provides insight into hundreds of terabytes of data.Lead a team of three to four engineers in collaboration with product managers and designers to build and maintain the product area.Bring clarity and focus to the team. Be able to drive team to deliver on company goals and self-initiated goals with a timeline.Lead your team by example, working with them to level up their code quality through code reviews and 1on1 mentorship, creating & vetting technical architectures, and writing code yourself that raises the bar for Klaviyo engineering.Be the liaison between team and stakeholders, including customers, other departments like customer support, sales, and marketing.Be empowered to own the mission, technical direction and operations of projects that have immediate impact.Help architect and design robust and high performance data processing and storage systems leveraging new databases to serve different internal and external use cases. Contribute to open source data processing technologies.Advance your technical skills in all facets ranging from new relational database technologies to machine learning and massively parallelized data pipelines.Contribute to the company as a subject matter expert in multiple areas, constantly pushing yourself to be a better engineer and to level up all of your peers within your team and within Klaviyo. You Have 5+ years of experience building products that matter and pushing yourself and your team to be better engineers and build a product with passionate advocates.Have proven that you can build & scale complex distributed systems including solving problems in sustainable ways, balancing pragmatic development with ideal architecture, breaking through technical obstacles with vigor, and leading teams through crises by working side by side with them in the trenches.Enjoy working with system software ranging from traditional databases to new data processing frameworks, and are particularly passionate and an expert in multiple stack areas. You show this by having strong and opinionated experience with various technologies and know how to pick the right tool for any job.Love digging into performance and scalability issues to drive breakthrough solutions.Are familiar with concurrent programming and have experience building distributed systems.Enjoy shipping code early & often in an agile fashion, pairing with product management to craft better software by soliciting feedback from thousands of end usersLike working on a small, autonomous agile teams. At Klaviyo, you will have ownership of features, but you'll collaborate with everyone to make sure we produce the right solution.Technologies We UseKlaviyo operates a real-time data platform coded in Python built for massive scale on Amazon Web Services (AWS). Engineers come to Klaviyo with experience in a variety of languages and from a number of disciplines. The core Klaviyo platform is comprised of the following components that all engineers are expected to become extremely proficient: Python, Django, Celery MySQL, Cassandra, RabbitMQ, Redis HTML, JavaScript, LESS, Backbone.js, React Amazon Web Services (EC2, RDS, Aurora, etc.) Terraform, Ansible, Packer, and other DevOps toolsLead Engineers are expected to bring to Klaviyo subject matter expertise and demonstrate adaptability by continuing to acquire and master new skills, level up all those around them, and research and prototype new technologies and solutions to help scale Klaviyos systems and product capabilities.Problems Were SolvingAs a high growth startup we look for candidates that can rise to any occasion and seek out new opportunities to make their mark on our product. The following are examples of exciting projects the engineering team is working on:Scaling our data processing systems to handle orders of magnitude more data and perform advanced analytics of billions of events in real time by innovating on event-driven data pipelines and building robust distributed data storesReliably integrating with 10s of thousands of remote API endpoints to process ecommerce data for historical and real-time syncsExtracting additional insight from our data sources using machine learning and other data science techniques to allow ecommerce marketers to more efficiently perform their jobs and grow their business, and build features into Klaviyo product to make it incredibly easy for marketers to follow best practicesAbout KlaviyoKlaviyo is a team of people who are crazy motivated by growth.Its what we help our customers do: grow their businesses by making it possible and easy for them to use their data to power better marketing.Its how we behave as individuals: were all deeply passionate about learning.Its how we manage our business: we have thousands of paying customers, were profitable, and were growing insanely fast.And its what our culture is all about. Working at Klaviyo means youll work on things you never imagined you would; youll grow in ways you didnt consider possible; and youll do the best work of your career with people who are just as motivated and talented as you are.Your curiosity has led you this far, so if this sounds like your ideal place to work, apply here."}