{"jobID": "2614293107", "jobLocation": "New_York_NY", "jobTitle": "Director, Customer Success, Multi-Touch Attribution", "companyRating": "3.7", "companyInfo": {"Website": "www.marketingevolution.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "130000", "jobDescription": "Company Overview Marketing Evolution has been recognized by Forrester as the industry leader in marketing optimization due to our big-data, person-centric, decision-making SaaS platform. This platform enables our customers to analyze the impact of their media, message and marketing mix while in-flight, and to optimize while in-flight, thereby driving demonstrably improved campaign performance. Our customers including many Fortune 500 brands choose Marketing Evolution because they recognize the value of moving beyond the aggregated and backward-looking limitations of marketing mix and attribution models. Due to very fast growth, we are hiring at all levels; but know that our preference is always to promote from within. Position Overview At Marketing Evolution, we are organized by pods that are aligned with specific customers; each pod has an Account Manager (responsible for revenue) and a Customer Success team. The Marketing Optimization Team sits at the nexus of big data, marketing, SaaS, and fact-based decision making to deliver an evolving stream of value for our customers. Our ideal candidates are jazzed about the art and science of marketing analytics, are superb at project management, are passionate about product development, are fascinated by the geeky details that go into person-centric, multi-touch attribution models, are top-notch communicators with an innate ability to convey complex concepts in simple terms, and thrive on the opportunity to directly impact competitive advantage for our customers. ResponsibiltiesExpertise: you will become an expert on our person-based optimization methodology;Project management: responsible for the many data inputs, analytics, and processes that support each customers engagement;SaaS: execute and interpret optimizations via our SaaS platform, and proactively drive customer usage and feature adoption to ensure the full benefit of our platform;Customer success: guide customers toward fact-based decisions that will improve campaign performance, encourage them to plan and execute test-and-learns, manage customer expectations, and help identify and prioritize their learning agenda;Process improvement: actively engage in ongoing process improvement to continually drive greater quality, consistency, efficiency, profitability, and ultimately customer satisfaction.Desired Experience and Qualifications Based on the number of boxes\" you can check below, you may be considered for a role as a Manager, as a Director, or as an Associate Vice President. Knowledge of traditional and digital media planning concepts and ecosystems;Minimum 5 years of experience for a Manager role; 5-10 years of experience for a Director role; and 7+ years of experience for an Associate Vice President:Considerable experience in at least one of: marketing mix modeling, attribution, and/or advertising effectiveness;Knowledgeable about marketing mix modeling, attribution, and/or advertising effectiveness (but you dont need to be a modeler or statistician);Intellectual curiosity and an analytical mind with strong problem solving and critical thinking skills;Relentless attention to detail and accuracy;Proven ability to identify customer needs and then to articulate those needs in an actionable manner to internal teams;The ability to simplify complexity and answer challenging questions with clarity;Excellent project management skills (experience with JIRA is ideal);A sense of urgency in executing work, sometimes under tight deadlines, and the ability to multi-task;Preference for a fast-paced, constantly changing, results-driven work environment;Understanding of SaaS value delivery and customer support;Ability to focus on what matters and not get lost in the weeds when looking at a lot of very interesting data;Strong Excel and PPT skillsBachelors degree, preferably in marketing, applied science, statistics, mathematics, economics, or related field; MBA is a plus.Metrics for Success All employees have annual career growth goals based on their position and core skills/development areas; team members receive performance reviews bi-annually.  Customer satisfaction and the ability to drive large efficiency gains are the most important measures of success. Marketing Evolution Cultural Values We seek candidates who are excited to work at a company with the following cultural values: Disrupt the norm: Cherish the opportunity to find better ways to do things, regardless of how disruptive or initially painful it might be.Dissent then execute: Raise issues and fixes in the planning stage, but when its time to execute, execute diligently and without reservation.Test and learn: When developing new processes or features, link it to a hypothesis, and evaluate that hypothesis without bias.Nothing is impossible: Imagine whats possible and then have the discipline to execute it. One without the other is not valuable.Defect is treasure: Every mistake is an opportunity for the organization to learn and make improvements.Share success: Given how hard it is to promote change in our industry, celebrate each success along the way."}