{"jobID": "2802905794", "jobLocation": "Boston_MA", "jobTitle": "Registered Nurse - PACU - Moakley Building - Per Diem - Mon-Fri, no nights, weekends, or holidays", "companyRating": "3.6", "companyInfo": {"Website": "www.bmc.org", "Headquarters": "Boston, MA", "Size": "1001 to 5000 employees", "Founded": " 1996", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "43", "jobDescription": " Boston Medical Center (BMC) is more than a hospital. It´s a network of support and care that touches the lives of hundreds of thousands of people in need each year. It is the largest and busiest provider of trauma and emergency services in New England. Emphasizing community-based care, BMC is committed to providing consistently excellent and accessible health services to alland is the largest safety-net hospital in New England. The hospital is also the primary teaching affiliate of the nationally ranked Boston University School of Medicine (BUSM) and a founding partner of Boston HealthNet an integrated health care delivery systems that includes many community health centers. BMC provides a full range of pediatric and adult care services, from primary to family medicine to advanced specialty care.  BMC is also committed to our employees, who are a very important piece to who we are. We pride ourselves in providing equal employment opportunity and non-discrimination for all employees and qualified applicants without regard to a person's race, color, gender, age, religion, national origin, ancestry, disability, veteran status, genetic information, sexual orientation or any characteristic protected under applicable law. BMC will make reasonable accommodations for qualified individuals with known disabilities, in accordance with applicable law.The registered nurse, adheres to the rules and regulations of the Massachusetts Board of Registration in Nursing. is primarily responsible for professional performance and direct patient care. The role encompasses nursing assessment, diagnosis, planning, intervention, evaluation, and coordination of care for patients and their families across the health care continuum. The registered nurse is accountable for clinical, educational, quality and fiscal patient care outcomes using the model of care designed by the nursing department and in accordance with established agency policies, procedures, protocols, guidelines and standards of practice.Minimum Qualifications:Graduate of an accredited school of nursing with an Associates degree or Baccalaureate degree in nursing, BSN preferred. Candidates who do not have a BSN must be enrolled in a Baccalaureate program within 6 months of hire and must complete their BSN within 36 months of hire.Registration and current RN licensure in the state of MA in good standing required.Current basic life support (BLS) certification required.Duties and Responsibilities: (these are a general summary and not all inclusive)Basic computer proficiency inclusive of ability to access, enters, and interpret computerized data/information.Effective interpersonal skills to facilitate communication with various members of the health care team, patients, and families.Organizational skills to set priorities and efficiently complete assigned work.  Multilingual skills (beyond that of English) in languages appropriate to the patient populations served by the medical center preferred.Relevant clinical experience and/or specialty, certification required for certain practice areas, e.g., enterstomal therapy, epidemiology, peri-operative areas.Analytical ability to solve clinical nursing issues and conduct quality improvement research utilization projects.Ability to effectively delegate appropriate patient care activities.Effective verbal and written communication skills appropriate to the patient populations served.  Physical ability to meet the core job responsibilities in accordance with practice setting demands for the patient populations regularly served.Ability to effectively manage stress due to critical issues related to patient care, changing organizational climate and personnel issues.An Equal Opportunity / Affirmative Action Employer. Females, minorities, veterans, and persons with disabilities are strongly encouraged to apply."}