{"jobID": "2811524881", "jobLocation": "New_York_NY", "jobTitle": "Sales Planner", "companyRating": "4.1", "companyInfo": {"Website": "www.teads.tv", "Headquarters": "Luxembourg, Luxembourg", "Size": "501 to 1000 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " YuMe, Virool"}, "estimatedSalary": "52000", "jobDescription": "Context of the role/team Teads.tv is looking for an eager and solutions-oriented Sales Planner to develop digital strategies for key advertisers. This role will provide direct support to Teads Sales team, as well as exposure to brand and media agency objectives. Your mission will be to :Review RFPs (Requests for Proposals) to understand brands digital media and consumer obstaclesStrategize media solutions to best meet and exceed client goals and expectationsDevelop media plans that effectively maximize client investment opportunitiesConfirm media availability and make inventory reservationsPropose Teads solutions in customized PPT decks that outline the response to the business opportunityBuild product demo links and other collateral to display the technology and functionality of Teads formatsIdentify and confirm campaign parameters working with internal Research, Ad Ops, and Publishing teamsProvide excellent client servicesUpdate Sales Force database throughout the processRequirements :1 year minimum experience in Digital Media planning, coordinating, or account management (video and mobile experience a plus)Degree in Media, Communications, Advertising, Marketing, or related fieldAbility to work in a fast-paced environment, managing multiple clients and meet deadlinesStrongly detail-orientedExceptional communication skillsProficient in Microsoft Office Suite===== ABOUT TEADS ====== Teads, founded in 2011, is the inventor of outstream video advertising and No. 1 video advertising marketplace in the world (source: comScore). Publishers work with Teads to create brand new video inventory, monetizing it through their own sales force, Teads sales force or programmatic buying.  Teads outstream video and display advertising solutions encompass a series of formats inserted deep into media content, like the inRead format, displayed inside articles. It has been changing the game within the advertising industry by creating unprecedented levels of premium video inventory, which did not exist before.  Brands and agencies can access this top-tier, premium inventory, available on the web and on mobile, through programmatic or managed services.  Teads has a team of over 670 employees, 120 of whom are on the innovation team, across 35 offices in 24 countries. We're committed to creating a dynamic work environment that values diversity and inclusion, and represents employees across a variety of skill sets. We embrace contributions from all ages, sexes, races, ethnicities, religions, sexual orientations and gender identities. #LI-RS1"}