{"jobID": "2684139384", "jobLocation": "New_York_NY", "jobTitle": "Clinical Research Associate II/ Clinical Site Manager II - Midwest", "companyRating": "3.3", "companyInfo": {"Website": "www.parexel.com", "Headquarters": "Waltham, MA", "Size": "10000+ employees", "Founded": " 1982", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Pharmaceutical Product Development, IQVIA, PRA Health Sciences"}, "estimatedSalary": "72000", "jobDescription": " PAREXEL has launched a new clinical operating model to drive effectiveness, reduce hand-offs and increase employee, client and site satisfaction. Within this model, the Clinical Site Manager (CSM), formerly the Clinical Research Associate (CRA), serves as the clinical sites direct point of contact. The CSM role offers the opportunity to go beyond the role of a typical clinical monitor. CSMs are accountable for using their expertise to build and maintain the site relationship and ensure they are set up for success. This includes addressing and resolving site issues and questions. You will also manage site quality and delivery from site identification through to close-out.  As a CSM, PAREXEL will offer you world class technology and training catered to your individual experience. You can anticipate less travel and a lower protocol load in comparison to industry peers. Your hard work will be rewarded through a bonus incentive program, the opportunity to work within multiple therapeutic areas, and an opportunity to advance your career in clinical research. If impact, flexibility, and career development appeal to you, please apply to learn more. Your Key Accountabilities:Act as PAREXELs sole contact with assigned clinical sitesUse your trial management expertise to oversee overall integrity of the study and problem-solving skills to promote positive working relationships with the site and staffConduct qualification visits (QV), site initiation visits (SIV) and monitoring visits (MV) at assigned clinical sites; generate visit/contact reportReview the performance of the trial at designated sites, ensuring the rights and well-being of human subjects are protected and are in accordance with protocolEvaluate the quality and integrity of the reported data, site efficacy, and drug accountabilityDevelop patient recruitment strategies in conjunction with the clinical site to meet enrollment timelines Ensure compliance with the approved standard operating procedures (SOPs), protocol/amendment(s), GCP, and the applicable regulatory requirement(s)Monitor completeness and quality of Regulatory Documentation and perform site document verificationQualifications"}