{"jobID": "2763540929", "jobLocation": "San_Francisco_CA", "jobTitle": "Research and Development Intern", "companyRating": "3.4", "companyInfo": {"Website": "www.metabiota.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "56000", "jobDescription": " R&D; Intern  Product Development - SAN FRANCISCO, CA - FULL TIME, 10 WEEKS  Your Work  Metabiota is seeking an exceptional Research & Development (R&D;) Intern to join its Product Development team. We develop new ways to measure epidemic and pandemic risk, and to understand its impact on societies and economies. Your work will have direct public health and business implications, and will help to conceptualize and shape risk transfer solutions and analytical tools.  Who you are  You are an energetic, outside the box thinker with experience in public health and/or public policy. The trickier the problem, the more excited you get. Youre an adept quantitative analyst, and have a good working knowledge of R, STATA or other statistical software packages. You love to innovate, transform, and build, and to apply your skills towards solving real world problems.  Your Responsibilities: Research, evaluate, structure and analyze data on public health capacity at the national and global levelDraw on scientific and public policy literature to analyze and develop indicators and metrics for public health system qualityWork with the other research staff to prepare research reports, presentations, manuscripts and other technical materials such as journal articles, research manuals, bibliographies, etc.Provide interpretation of results and explain methodology to team members You have: Degree in public health or social science related field (public policy, economics, political science, etc.)Experience in statistical computingAbility to work in a fast paced environmentSelf-motivated and able to work independentlyExcellent communication skills and good sense of humor Who We Are and What We Do:  Metabiota is the pioneer in comprehensive risk analytics that help to protect global health. We make the world more resilient to epidemics. Built on a strong foundation of scientific expertise, including a worldwide network of on-the-ground experts, Metabiota delivers actionable, data-driven analytics to help countries and corporations mitigate complex health, defense and preparedness issues. With a strategic global presence and sustained partnerships, Metabiotas agile approach helps identify, analyze and transfer the risk associated with biological threats. We are the first mover in a massively underserved market for quantifying epidemic risk. The companys international footprint includes operations and offices in the United States, Canada, Sierra Leone, Cameroon, Laos and the Democratic Republic of the Congo. For more information, visit http://www.metabiota.com or contact wrohrig@metabiota.com."}