{"jobID": "2830415833", "jobLocation": "San_Francisco_CA", "jobTitle": "Litigation Research Intern", "companyRating": null, "companyInfo": {"Website": "www.nrdc.org", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " 1970", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Natural Resources Defense Council (NRDC) is the nation’s most effective environmental action organization. We use law, science, and the support of more than three million members and activists to protect the planet’s wildlife and wild places and to ensure a safe and healthy environment for all living things. Founded in 1970, NRDC staff helped write some of America’s bedrock environmental laws. Today, our staff of more than 600 lawyers, scientists, economists, policy and communications experts, and others, works to protect and create environmental progress from offices in New York; Washington, DC; Chicago; Los Angeles; San Francisco; Bozeman, Montana; and Beijing.  Our Litigation team works on cases spanning a broad range of environmental issues, such as combating climate change, protecting public health, promoting environmental justice, curbing air and water pollution, preserving wildlife and wild places, and reducing overfishing. In recent years, members of the Litigation team in San Francisco have litigated to protect marine mammals from the U.S. Navy’s harmful sonar and explosives training, safeguard the health of Californians by limiting the presence of dangerous chemicals in food and water, and defend a state program which will contribute over one billion dollars to clean energy research.  NRDC is seeking current college students with strong grades, excellent writing and research skills, and the intelligence, confidence, and maturity to assume serious responsibility. Research Interns work with the Litigation team’s San Francisco-based attorneys and program assistants on factual research and analysis to support developing and active cases. They also support the team by occasionally performing legal administrative work. Interns are invited to participate in litigation planning and strategy meetings.  We ask that you seek academic credit for the internship if you are eligible. We can help with applications or any other materials needed to secure the credit (e.g. preparation of workplans and evaluations, meetings with academic advisors, etc.). If you are not eligible for academic credit for the internship, we offer a $15.00/hour stipend.  The Research Intern will join NRDC for the September-December 2018 term, with a minimum time commitment of two days per week in our San Francisco office. Start and end dates as well as scheduling details are negotiable.  NRDC is committed to workplace diversity and inclusion. We are equal opportunity employers and do not discriminate in hiring or employment on the basis of race, color, religion, national origin, gender identity and expression, marital status, sexual orientation, age, disability, veteran status, or any other characteristic protected by federal, state, or local law. We offer competitive salaries, excellent benefits, and a pleasant working environment. Salary is based on a nonprofit scale and commensurate with experience.  Pursuant to the San Francisco Fair Chance Ordinance, for positions based in San Francisco, CA we will consider for employment qualified applicants with arrest and conviction records.  To apply, please visit www.nrdc.org/careers and upload your resume, cover letter, transcript, and writing sample through our online portal. Please no phone calls, emails, faxes or in-person resume drop-offs. Please reference where you saw this posting. NRDC is an Equal Opportunity Employer.  If you are having technical difficulty while applying, please reach out to Customer Care by dialing 1-800-889-4422.  For further information about NRDC, please visit www.nrdc.org."}