{"jobID": "2760569695", "jobLocation": "Weehawken_NJ", "jobTitle": "Sales Planning Coordinator", "companyRating": null, "companyInfo": {"Website": "www.omegawatches.com", "Headquarters": "Weehawken, NJ", "Size": "201 to 500 employees", "Founded": " 1848", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Rolex, Cartier, Breitling"}, "estimatedSalary": null, "jobDescription": "Omega Sales Planning Coordinator (Wholesale)The Sales Planning Coordinator will be responsible for facilitating and executing the various projects and activities within the sales operations department. This position will include purchasing, returns, product set-ups, and supporting the sales team. This position reports to the Senior Sales Operations Manager, Wholesale.The candidate must possess operational experience with an emphasis on wholesale. This person should also work well in a team environment and possess strong communication skills as they will be in constant contact with the field and corporate management.This position will be located at Weehawken, NJResponsibilitiesAnalyze and Purchase Product weekly and as needed via LIROSManagement of incentives program*Product Creation and Maintenance (complete setup & component breakdown file)Create allocation sheets for incoming productSetup Box and certificates in SAPRequesting price increases/decreases where neededRun & review Liros comparison file to match HQProcess consignments and credit re-billsConsignment memos – scheduling pickup and drop off requests as neededReview and submit personal use-employee ordersProcess RA/s ensuring requests follow SGUS policy and proceduresReturns to HQCreate and maintain door locations on Omega website for the US, deleting closed doorsMonitor inventory in jobbing, requesting status on product needed to fill open orders (Weekly)Invoice coding and correcting price discrepanciesCreate Ship notes to allow the warehouse to receive in productAssist with special programs (Military & Astronaut Program)Point of contact for sales support and RSM’s & (availability/price checks & ETA’s)Manage and order price list for La Collection (annually)Other projects as assignedRequired Skills3+ years of corporate or wholesale operations.Strong written communication skills required.Experience working closely with senior level executives.Understanding of the reality of the Wholesale environment.Ability to perform well in a team environment and manage multiple deadline-driven projects.Must be flexible and solution-oriented with excellent time management and organizational skills and the ability to multitask.Excellent computer skills, including proficiency with Office (Word, PowerPoint and Excel) as well as flexibility with similar alternative programs (SAP).Ability to process a vast amount of information and understand and prioritize competing business needs.Strong personal work ethic.Flexible personality and quick learner who operates with a sense of urgency."}