{"jobID": "2555578323", "jobLocation": "New_York_NY", "jobTitle": "Director, Sales & Partnerships", "companyRating": null, "companyInfo": {"Website": "www.gethornet.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Hornet, the world's premier gay social network reaching 25 million global users, is seeking a seasoned digital salesperson to join our rapidly growing NY team.POSITION OVERVIEW:Based in NYC, this position reports to the SVP Global Sales and is charged with identifying, pitching and closing new advertisers based in the NY Tri-State and Midwest regions. The successful candidate brings a comprehensive skill set, versatile experience and demonstrated success in the digital, mobile and/or social sectors, which you have leveraged to create and execute head-of-class partnerships with top advertisers, and to foster and grow productive relationships with key client and agency decision makers which you bring to the role. Our NY-based Director of Sales & Partnerships is a strategic hunter with a passion for creative problem solving, seamless collaboration with colleages and leadership, and who thrives in a fast-paced technology start-up environment. We're looking for an A player who will shine as an exceptional individual performer, and as a team player who effectively interfaces with Hornet talent distributed across the US and the globe. KEY RESPONSIBILITIES:Be the most visible seller in your territory--the face of Hornet in the marketplace--and sing our song to any/all key client and agency decision makersClearly define and articulate Hornet's unique differentation in the marketplace and value to advertisers, in all communicationsBe the best listener your clients have ever met--become a student of their brand and a consultative solution provider who will earn their trustTake full ownership of your territory and oversee all aspects of the sales funnel from identifying to pitching to closing to executing to renewingSchedule, plan and run all outbound communications (meetings, calls, email outreach, etc.) to ensure awareness and top consideration for Hornet for any/all relevant advertisers and campaignsBuild, maintain and grow buyer relationships by regularly entertaining clients and agency contacts within the assigned territoryTravel as needed within the assigned territory to ensure full coverage and consideration by all relevant advertisers and campaigns; represent Hornet at key industry/trade events as warranted Accurately forecast business and create a clear strategy for exceeding assigned sales quotas on a monthly, quarterly and annual basisEffectively and efficiently collaborate with pre and post sale support staffers to ensure partnership success and renewalProvide regular/real-time reporting on business activity via CRM and other tools provided by Hornet DESIRED SKILLS AND EXPERIENCE:Bachelor's Degree required; focus/major in Marcomm or related area preferred but not requiredFluency in additional languages is welcomed but not required, especially French, Spanish and/or Portuguese5+ years of Digital/Mobile/Social media sales experience is required, as is your deep knowledge of marketing platforms, language, ideas and principles (experience covering the Midwest is preferred but not mandatory) \"CEO\" mindset and ruthless, self-policed accountability that drives you to run your territory like it's your very own companyAbility to manage multiple projects simultaneously, often including multiple stakeholders both internal and external, across multiple time zonesAbility to flex and thrive as a remote worker; a self-starter who can operate against strict deadlines and processes either in or out of an officeFearless and Friendly mindset--you're an outgoing people person equally \"in your element\" in a live meeting, video call, phone conversation or email exchangeAffinity for thinking creatively, taking risks, failing fast, and learning and growing on-the-goInfectious passion for the Hornet product, audience and vision that is immediately evident and effusive in every client interactionProficiency in the latest social, mobile and technology products and trends, as well as industry standard tools such as Google Docs, MS Office, CRM software (Insightly, Salesforce, etc.) and internal chat tools such as SlackIdeally, you bring direct understanding and experience with the gay dating landscape including being a Hornet userCompensation is comensurate with experirence and includes an agressive base salary + quarterly commissions.About Hornet Networks Hornet is the world's premier gay social network. Founded in 2011 with the mission to build the digital home for the gay community, Hornet has grown to 25 million users by utilizing cutting-edge technology for its dating platform and producing original editorial content to connect a community around common interests. Hornet provides a superior user experience and is number one in the key markets of France, Russia, Brazil, Turkey and Taiwan, and is consistently expanding its sizable user base in the United States. For more information, please visit: http://gethornet.com.Hornet, Where Guys Connect."}