{"jobID": "2806621196", "jobLocation": "Emeryville_CA", "jobTitle": "Healthcare QA Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.manifestmedex.org", "Headquarters": "Riverside, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Want to work in a mission-driven startup with huge reach and scale that is improving health in California? Come join our team.Manifest MedEx is on a mission to connect healthcare in California. We are the largest health information exchange in the state combining 11 million claims records, 5 million clinical records and 150 participating partners and strong partnerships with three leading California health plans. We are committed to improve patient experiences and reduce healthcare costs by making it easier for doctors, hospitals, health plans and other care providers to securely review, analyze and share health information.The Data Analyst, Quality Assurance will work with Manifest MedEx’s participants and the implementation team to support the integration of data to and from hospitals, providers and health plans. This includes communicating with the technical staff from MX participant organizations and helping them understand the data requirements. Responsibilities also include analyzing, validating and refining the data feeds these organizations provide. This position requires tight collaboration with the MX internal team to ensure that processing and ingesting data from our participants is built in a way to support high volume and high quality.Responsibilities: Communicate data requirements and specifications to the technical team(s) from MX participant organizationsAnalyze and evaluate data submissions provided by MX participants’ source systems (e.g. EHR, payer systems)Identify discrepancies and exceptions between MX participants’ data submissions and the MX requirements (e.g., missing required fields, formatting issues, terminologies that are non-standard and may need to be mapped) and work with participants to rectify issuesWork with the development team to define required mappings and transformations to coordinate and resolve participant-specific transaction characteristicsWork with the participant onboarding team to ensure comprehensive data validation and quality assurance activities are performedPerform technical quality assurance as well as data validation practices, tools and documentationPerform ongoing maintenance of our data submission guideline specifications to meet MX’s business and technical requirementsMeet or exceed established project timelines and productivity targets to achieve personal and MX overall business goalsThoroughly document work performed on project activities and track in Jira or applicable systemParticipate in design sessions and code reviews during development and implementation processSupport management in strategy and other planning activitiesServe as a MX ambassador with all participant interactionsQualifications:"}