{"jobID": "2307164877", "jobLocation": "Austin_TX", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.predictivescience.com", "Headquarters": "Austin, TX", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Spun out of Dell’s Digital Innovation Lab in 2013, Predictive Science has benefited from $40M in total R&D; investment to become one of the fastest growing tech startups in the United States. Predictive Science is helping companies such as Verizon, NFL, Neiman Marcus, Dell, VMware and many others unlock the power of their data by creating algorithms that are changing the world.Predictive Science is looking for a Data Scientist who can work with Fortune 1000 companies and other companies around the world to help them take on challenging data problems that can provide high impact results. This is a freelance data scientist position who will work with other senior data scientists to consult with executives and data scientists who are a part of the Predictive Science network.Desired ExperienceAdvanced Experience with programming scripts such as Python, Java, Scala, C++ in Linux/Unix, and R. Preference that you are highly knowledgeable in numerous languages.Experience in creating and implementing machine learning algorithms and advanced statistics such as: regression, clustering, decision trees, exploratory data analysis methodology, simulation, scenario analysis, modeling, and neural networks.Experience with web services such as AWS ,DigitalOcean, Redshift, S3, and Spark. Also the ability to connect data using web API, REST API, and web crawling techniques.Experience with SQL querying and knowledge of PostgreSQL, MySQL, MSSQL databases.Experience in analyzing data from business line data applications and data providers such as Google Analytics, Site Catalyst, Coremetrics, Adwords, Crimson Hexagon, Facebook Insights, Nielsen, Comscore, Simmons, MRI and etcExperience in visualizing data to stakeholders in a simple and concise manner through visualization software such as ggplot, D3,Tableau Qlinkview, Periscope, Business Objects, or other similar software.Ability to analyze data, draw insights, and prepare reports in a cohesive, intuitive, and simplistic manner to the client.Strong communication skillsExcellent organization and prioritization skillsAbout the OpportunityWork with our Data Science team to implement big data solutions for the clientMine massive amounts and perform large-scale data analysis to extract useful business insightsIdentify actionable insights, suggest recommendations, and influence the direction of the business by effectively communicating results to cross functional groupsJob PerksBeing part of Predictive Science means more than just working on challenging projects. There are other benefits you will receive as well.Free Conference Passes: Join data science experts from all around the world for amazing learning events. The events are free for Predictive Science network members.Special Offers and Free Products: Predictive Science partners provide special offers and free products for network members. Get your hands on early-release products and get the opportunity to be an influencer.Recruiting Services: Looking to take the next big step in your career? Predictive Science offers headhunting services to network members. You will receive career and resume feedback, and head hunters will help you get placed.Leadership Opportunities: Not getting the leadership experience you want from your current job? Trying to grow your leadership abilities? Predictive Science offers industry leadership opportunities for network members. Continue to expand your skills and build your resume.Network Opportunities: Build relationships with other data scientists, vendors, and company executives. Expand your network and opportunities as you partner with network members on projects.Training: Predictive Science helps you get hands-on experience as a data scientist while you get paid and sets you on a high-growth-trajectory path. Your skills will be challenged all along the way, and opportunities will be provided through conferences and online training to help you learn new skills that will make you more valuable.Time CommitmentPredictive Science gives you the flexibility of working remotely and picking what hours you want to work. Already have a job but want to earn more money? Predictive Science can be flexible to accommodate your situation. Want a lot of flexibility? Sign up for a project that pays you per task or per hour. If you want more dependability and a full time commitment, we can provide contractor or full-time position.We Want You to SucceedPredictive Science is committed to helping you grow your career and get the experience you need to become successful. Our goal is to build the largest network of data scientists and place them in the most successful positions. Your skills will be challenged all along the way, and opportunities will be provided through conferences and online training to help you learn new skills that will make you more valuable and get promoted. Additionally, to support your career growth, we have our own recruiting team that works hard for you to find a position either with Predictive Science or somewhere else. No other company cares more about your career progression than Predictive Science.About Predictive SciencePredictive Science is the fastest growing data science network focused on building the largest data science platform that can help businesses turn data into actionable results while significantly creating cost savings. Challenging data problems that were too expensive, risky, or resource limited to solve, can now be solved with the help of Predictive Science and its global network of data scientists. Predictive Science is helping companies such as Verizon, NFL, Neiman Marcus, Dell, VMware and many others unlock the power of their data by creating algorithms that are changing the world."}