{"jobID": "2728747131", "jobLocation": "Burlingame_CA", "jobTitle": "Intern, Internal Logistics", "companyRating": null, "companyInfo": {"Website": "www.proterra.com", "Headquarters": "Burlingame, CA", "Size": "201 to 500 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " New Flyer, Gillig, BYD"}, "estimatedSalary": null, "jobDescription": "The Role: The Internal Logistics Analyst Intern working on the Sourcing team will be responsible for designing, engineering, and implementing concepts related to Supply Chain Process excellence. These concepts and technologies will be planned and implemented at the Proterra Factory located in Burlingame, California. The primary objective Sourcing Group has two goal streams: tactical and strategical, both supported by a process. Key focus to these streams are assuring the best supply base on Delivery, cost and quality to our business. The tactical side is heavy on assuring that the ERP systems are working to meet and exceed our goals to procure parts on time as well as keeping the integrity of our sourcing data in order to drive execution to both our factories and be seamless to our supply base. Responsibilities (specific projects will vary based on technical aptitude):Design, develop, support, and implement solutions to improve our on time to source process.Design, develop, support, and implement solutions to improve our oracle system integrity related to costing and sourcing parameters.Working with the IT group on concept development, testing, design, integration and handoff for implementation to support the sourcing team.Support advanced trouble-shooting, updates and improvement of existing sourcing concepts.Design, develop/improve, support, and implement KPI’s dashboard for SourcingTargeted goals include: OTTS 99%System Integrity ( exceptional Cost process to track $400k BOM reductionDevelop and implement Supplier Performance Scorecard to track Cost, delivery and quality by PN, SupplierDevelop and implement NPI Scorecard, tools to track at ECO level and Pre ECO level new parts prior to release to BOMDevelop supplier capacity process and implementationMinimum Requirements:Bachelor’s degree in Industrial, Mechanical, Electrical Engineering, Automotive engineering or similar.Experience and/or knowledgeable in manufacturing, supply chain and/or distribution and logistics are desirable.Strong knowledge and/or experience with ERP Systems (ORACLE a must) dynamic manufacturing systems.Understanding of lean manufacturing concepts and continuous improvement.Strong analytical skillsNatural ability to speak and write effectively at all organizational levels.Ability to materialize concepts into a functional operational model working diligently with the supervisors and operators in the shop floor.Preferred Qualifications:Master’s Degree in Engineering, Business or related program preferred.Experience applying cost models and ERPStrong knowledge of material handling systems in a manufacturing or distribution system environment.Lean manufacturing principles implementation experience.Experience in project management"}