{"jobID": "2670188275", "jobLocation": "Beverly_MA", "jobTitle": "Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.osram-group.com", "Headquarters": "München, Germany", "Size": "10000+ employees", "Founded": " 1906", "Type": " Subsidiary or Business Segment", "Industry": " Manufacturing", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "107000", "jobDescription": "Title: Data Scientist OSRAM’s Corporate Innovation center is located in Beverly, Massachusetts, 25 miles North of Boston. This is our North America hub for research and innovation. The Data Scientist will be a key part of the Data Science and Analytics department within OSRAM.  You will develop, train, and implement models that significantly impacts the field of data analytics within OSRAM in areas such as supply chain optimization, forecasting, market intelligence, manufacturing, predictive maintenance, business strategy and more. You will have the ability to identify requirements, scope your research, develop prototypes, and deliver solutions that directly provide value to the business. Required Education and Experience:Candidates with a PhD in a technical (STEM) field are strongly preferreda Master’s Degree in a technical field like Math, Statistics, Computer Science, Data Science, Artificial Intelligence, Engineering, Operations Research, or Physics from a respected University requiredExperience with ETL process preferredat least 3 years of experience working within a corporation or consumer-focused environmentDeep, proven expertise in Data Science and Analytics, Probability Analysis, Pattern Recognition, and Mathematical ModelingAbility to develop, train, evaluate, and present on mathematical modelsAbility to collaborate with data scientists, software developers, business partners and other stakeholders and act as an evangelist for Data Science/Analytics principles and practicesAbility to lead projects independently and communicate effectively at a global levelExperience with agile methodology and project management highly desiredExperience in developing optimization models using heuristics and metaheuristicsA minimum of 3 years of experience in implementing machine learning solutions in Java, Scala, Python or similar languages.Hands-on experience working on database(s), SQL is requiredExperience with fast prototyping using open source technologies such as R and PythonVery strong mathematical backgroundExperience with data visualizationExperience with predictive methods and analysis of untapped, huge data poolsExperience with key software development processes such as testing and version controlWillingness to travel regionally and globally as needed"}