{"jobID": "2611551664", "jobLocation": "San_Jose_CA", "jobTitle": "R&D; Test Technician", "companyRating": "4.6", "companyInfo": {"Website": "www.outsetmedical.com", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " NxStage, Baxter, Intuitive Surgical"}, "estimatedSalary": "23", "jobDescription": "Position Overview The  R&D; Test Technician is responsible for assisting the product development team  in generating meaningful data from testing performed on bench, component/module  test fixtures and system level testing. He or She will also play a supporting  role in design and product development activities. The engineer will gain  experience from early stage rapid prototyping, all the way to transferring the  product into manufacturing. The  estimated duration for this position is 6 months in length and 40 hours  a week.Essential Job FunctionsWork under the direction of experienced engineers  and in collaboration with cross-functional teams to develop and build benchtop  test fixtures.Execute various experiments on test fixtures,  functional test beds, prototype machines and systems and generate/record data.Analyze data and present/report findings to their  manager or project leaders.Assist the engineering organization in troubleshooting  issues in Outset Medical’s products.Provide support to the  engineering organization during verification testing, whether it be writing,  executing, or releasing protocols and reports.Requirements/QualificationsRequired:High School degree with several experience as a Mechanical Technician, AA  degree in a mechanical/engineering field with 3 years of experience, or a BS in  Engineering with some of experience.Able to read blueprints and engineering diagrams.Able to troubleshoot basic issues and problem solve.Self-motivated, innovative, and able to work on multiple assignments with  differing priorities in a cross-functional fast paced environment.Excellent verbal and written communication with all levels of technical  and operating management.Preferred:Preferred experience in a technical field such as equipment or robotics  manufacturing, fluidics, and software.Experience in the Medical Device industry, specifically in capital  equipment development.Understanding of Design Control and navigating Medical Device Quality  Systems."}