{"jobID": "2671522275", "jobLocation": "Lawrence_MA", "jobTitle": "Science Teacher", "companyRating": "3.5", "companyInfo": {"Website": "www.phoenixcharteracademy.org", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " School / School District", "Industry": " Education", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "33000", "jobDescription": "**2018-2019 Positions Available in Lawrence**Job Title: Science TeacherPhilosophy Phoenix Charter Academy's mission is to challenge young people in our area with an academically rigorous and individually tailored curriculum. Phoenix scholars will have the support, resources and training needed to succeed academically in high school and college, and become economically secure in their future. Phoenix Charter Academy is named after a mythological figure of strength, healing and renewal. Phoenix schools challenge resilient, disconnected young people with rigorous academics and relentless supports, so they take ownership of their futures and succeed in high school, college, and as self-sufficient adults.Role Summary: Phoenix teachers do more than simply teach academic lessons; they serve integral roles as advisers and mentors for scholars. Phoenix teachers are responsible for preparing and delivering rigorous, high-quality instruction in their assigned content areas. They provide relentless support to benefit the socio-emotional needs of scholars, modeling and promoting the Phoenix mission by maintaining high expectations for scholars throughout their academic careers and performing additional duties - as necessary - in the fight for equity for the scholars and communities they serve. Commitments All staff acknowledge that we each seek – through formal and informal feedback – to dramatically improve our own progress and that of our scholars. Qualities of a Phoenix staff member:Unwavering Belief in Phoenix Scholars - Phoenix staff operate with the deeply held belief that all young people want to and can succeed even in the face of what can seem like insurmountable barriers and societal constraints.Ability to Put Scholars First - Phoenix staff go above and beyond to ensure mastery of the skills and development of positive self-identity that will ensure success for college, careers and beyond. Phoenix staff find every opportunity to engage in teaching and learning with scholars, using conflict to build supportive relationships with scholars and never taking things personally.Eager to Learn Under Pressure -Phoenix staff must be able to learn as they go in a fast paced, ever evolving, urgent environment. They have the desire to receive direct feedback and the ability to implement the feedback into practice quickly.Humility - Phoenix staff approach problem solving with curiosity and desire to understand the perspectives of others. They carry an internalized sense of “I can always learn more” from others, and know that adults at Phoenix must model the qualities of being open-minded and willing to make mistakes and learn from them.Experience with Low Income Communities - Staff have the proven ability to work across cultures and experience serving low-income communities and/or academically-disconnected adolescents.Ability to Find Inspiration In the Small Things - In the face of challenge and hard work, Phoenix staff must have the ability to find humor, inspiration, success and joy in the day to day interactions with scholars and the larger Phoenix Community.Personal Commitment to Cultural Proficiency and Ongoing Development - Phoenix staff are ongoing learners about diversity, equity and inclusion and seek to understand the ways that their self-identity and experiences impacts and interacts with their daily work, colleagues and scholars.Specific ResponsibilitiesCurriculum and Instructional Responsibilities:Teach four core-block classes, Monday through Friday.Teach 1 Advisory on Tuesday, Wednesday, and Thursday mornings from 9-9:15 AM.Tutor struggling scholars when necessary.Participate in 3 hours weekly of professional development on Fridays from 1:30– 4:30 PM.Participate in weekly department team meetings, supervision and meet or exceed the deliverables set by the department team, according to the school Accountability Plan.Create required curriculum supplements, weekly overviews, quarterly Scopes and Sequences, Final Assessments are aligned to frameworks; deadlines for all deliverables met.Upload and share all planning materials and planned lessons following Phoenix protocol.Collaborate with ESL and Academic Support staff in order to best reach all scholars.Actively participate in the data cycles process as a way to improve instruction and scholar learning/Participate in mid-year and end of year formal evaluations with Department Chair, Director of Curriculum and Instruction, or Head of School.Non-curricular Responsibilities:Internalize mission and make this central to all decisions and actions inside and outside of the classroom.Communicate with parents/adult supporters through phone calls, email correspondence, and/or in-person meetings at least 10 times per week.Commit to growing professionally through consistent and constant feedback and reflection; remain humble and relentless.Fulfill school support and coverage duties deemed necessary by the staff community and Head of School.Set high standards and goals for scholars; constantly use real data to measure growth towards these goals; assess scholars informally, formatively and summatively each quarter in each course; and meet or exceed goals set forth by Phoenix, department and individual classrooms.Publicly display evidence of great scholarship in and around your classroom.Seek to create personal, warm relationships with ALL scholars, sending a clear message that the academic work is important and that the teacher will not give up on them.Communicate scholar support needs with Director of School Culture and Social Worker whenever necessary.Qualifications:Bachelor’s degree required.1+ Year of direct scholar-serving (teaching, tutoring, academic support, etc.) experience preferred.Bilingual/Spanish-speaking candidates highly encouraged to apply. **It is understood that this Job Description is a summary of the primary duties and responsibilities of the position. It is not intended to be a complete and total description of each and every duty and responsibility. As such, this job description in no way states or implies that these are the only duties to be performed by this employee. He or she will be required to follow any other instructions and to perform any other duties requested by his or her supervisor.  It is also understood that the Network retains the right to modify this Job Description at any time, for any reason, at the Network’s sole discretion** We seek a diverse workforce. Phoenix Charter Academy is an Equal Opportunity Employer. As an Equal Opportunity Employer, Phoenix Charter Academy is committed to providing equal opportunity to staff and applicants in all areas of employment without regard to race, color, religion, sex, sexual orientation, national origin, age, disability, or veteran status, or any other area protected by federal, state or local law. Phoenix Charter Academy is committed to making any reasonable accommodation necessary to support an individual's employment."}