{"jobID": "2678082322", "jobLocation": "Cambridge_MA", "jobTitle": "Quantitative Data Analyst (Cogo Labs)", "companyRating": "4.0", "companyInfo": {"Website": "www.cogolabs.com", "Headquarters": "Cambridge, MA", "Size": "51 to 200 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "62000", "jobDescription": "At Cogo Labs, we build startup companies from scratch.We're not venture capitalists we're a collaborative team of engineers, analysts, and entrepreneurs using innovative tools, big data, and intellectual curiosity to build a platform that spins up successful online businesses, fast.As a Cogo Labs Quantitative Data Analyst, you'll run and grow business lines within our incubator. You'll design and implement marketing programs, analyze performance metrics, and use the insights you gain to drive growth in audience engagement and revenue. Your expertise, ideas, and hard work will have a direct and immediate impact on the success of your project.What to expect from Cogo:Near obsessive use of data to inform business decisions. We believe that efficient growth happens when we make every decision based on solid, well directed analysis.Unmatched opportunity. We believe in mentoring people to grow as quickly as they can. Today's new grad hires are tomorrow's leaders.Flexibility and novelty. Your role will define itself over time, as you identify the problems that you are uniquely capable of solving.A fun, supportive culture. Happy employees are the most successful. We take care of our own, and not just because it's good business.What we expect from you:A bachelor's degree in a field that requires deep analytical thinking and problem solving. Many of us have Math, Econ, Engineering, or Comp Sci backgrounds, but applications from all quantitative fields are welcome.Flexibility and self motivation. We value the willingness to wear many hats and the commitment to work on whatever needs to get done.The ability to make a strong (data driven) case when presenting findings and recommendations, while remaining curious and receptive to feedback.Demonstrated ability to work effectively as part of a team, and dedication to helping your teammates learn.Passions and interests outside of work you aren't just your resume.Bonus points if you've previously been responsible for a business unit's bottom line.About you:Bachelor's degree in a field that requires deep analytical thinking and problem solving. Many of us have Math, Econ, Finance, or Engineering backgrounds, but applications from all quantitative fields are welcome.You are:Aggressive: Driven; moves quickly and takes a forceful stand without being overly abrasiveAnalytically minded: Data-driven; believes in the value of making decisions on the basis of rigorous, empirical processesArticulate: Clearly states project missions, update, decisions, and rationales verbally and in writingEnthusiastic: Passionate about work; brings a can-do attitude to all activitiesEntrepreneurial: Track record of good decision-making and eager to take on a wide variety of analytical and business roles and responsibilitiesFlexible: Adjusts quickly to changing priorities and conditions; enjoys working in and thrives in a rapidly changing environmentFocused on results: biased for action; focused on specific goals and resistant to distractionOpen to Feedback: Actively asks for advice; eager to receive performance feedback and responds positively to suggestions and constructive criticismOwnership: What happens or doesn't happen within your project is your responsibilityProactive: Acts without being told what to do when appropriate; develops new ideas and self-guides within broader missionSelf-reflective: Considers work in the context of the entire organization; thinks about self-improvementSupportive: Actively helps fellow team members and treats them with respect and kindnessWork Ethic: Possesses a strong willingness to work hard and sometimes to work long hours to get the job doneWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law."}