{"jobID": "2808292065", "jobLocation": "San_Jose_CA", "jobTitle": "BCBA San Jose, CA", "companyRating": null, "companyInfo": {"Website": "www.centerforautism.com", "Headquarters": "Woodland Hills, CA", "Size": "1001 to 5000 employees", "Founded": " 1990", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Recruiter: LeeAnne Ford  Telephone: 818-345-2345 x 1052  Email: L.Ford@centerforautism.com CARD is now hiring Board Certified Behavior AnalystsOpenings for a BCBA in San Jose, CA The Center for Autism and Related Disorders (CARD) is seeking qualified Board Certified Behavior Analysts (BCBAs and BCBA-Ds) to design, supervise, and implement ABA treatment programs for children, teenagers, and adults diagnosed with autism spectrum disorder. Other responsibilities include, but are not limited to, data analysis, report writing, treatment plan development, and supervision of frontline technicians and assistant behavior analysts. CARD provides all autism-specific training.  With over 200 locations nationwide, CARD is among the world’s largest and oldest autism treatment providers. CARD provides services across all clinically appropriate settings, including in the center and the patient’s home, school, and community. CARD’s mission includes a social justice initiative to provide top-quality, evidence-based autism treatment across all populations, regardless of funding, geographic, cultural, or linguistic variables. As such, BCBAs will gain experience in the supervision and delivery of ABA-based autism treatment across a wide variety of funding sources and treatment locations. Newly hired BCBAs benefit from senior CARD BCBAs who act as mentors to familiarize new clinicians with CARD policies and procedures. CARD provides all necessary training. Applicants should have a BCBA and be in good standing with the BACB, or they should be actively pursuing a BCBA through current placement in an appropriate graduate program and/or enrollment in specific graduate-level courses. Additional benefits available for CARD BCBAs include: Education assistanceAccess to free CEUsCompetitive salary and benefitsComprehensive health benefits, including dental & vision coverageCareer advancement opportunities in a growing companyParticipation in groundbreaking autism researchAttendance at professional conferencesOpportunity to open new locations Required education: Master's Required license or certification: BCBA or actively pursuing a BCBA education and training requirements This position is a salaried, exempt, full-time position"}