{"jobID": "2655513802", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist - Algorithms, Pricing", "companyRating": "4.1", "companyInfo": {"Website": "www.airbnb.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "142000", "jobDescription": " Airbnb has become a global marketplace that connects travelers and hosts from over 34,000 cities. As such, it has collected a diverse set of data which our Data Science team mines for insights that will propel our community and product forward. Prices play a huge role in determining Airbnb’s growth and how the value it generates is divided between guests and hosts. Airbnb’s Pricing team is actively building products for guests and hosts to optimize our marketplace through smarter prices and better pricing communication.  As an Algorithms Data Scientist on the Pricing team, you will conceptualize and build innovative algorithms leveraging techniques from machine learning, revenue management, forecasting and statistics in a marketplace with high degrees of: product heterogeneity, seasonality and growth. Some problems we work on the team include: Applying dynamic programming and reinforcement learning to dynamic pricing.Modeling hosts objectives through unsupervised learning and embedding models.Designing and building pricing strategies to optimize hosts profits subject to various constraints.Developing innovative methods to predict and evaluate pricing elasticity for listing supply with heterogeneity in high dimensional feature space. Here are some qualifications we look for: 5+ years industry experience developing machine learning and/or predictive models at scale from inception to business impact.Domain experience in pricing or optimization is a must.Experience developing data driven objective functions to optimize complex business needs from the ground up.PhD degree in machine learning, operational research, statistics, mathematics, or a related field.Outstanding problem solving skills, leveraging data and creative thinking.Strong programming skills (Python, R, or Scala preferred). Experience productionizing machine learning model is a plus.Experience with pricing, ads, or two-sided marketplace domain is a plus.BenefitsStock$2,000 yearly employee travel couponCompetitive salaryPaid time offMedical, dental, & vision insuranceLife & disability coverage401KFlexbile Spending AccountsApple equipmentDaily breakfast, lunch, and dinner"}