{"jobID": "2816766525", "jobLocation": "San_Jose_CA", "jobTitle": "Engineer - Customer Firmware", "companyRating": null, "companyInfo": {"Website": "www.samsung.com/global/business/semiconductor", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 1983", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "JOB TITLE Customer Firmware EngineerRequisition ID DSAOVERVIEWWe are looking for a dynamic, self-motivated engineer to develop and support our cutting edge NVMe or SAS SSD products.JOB RESPONSIBILITIESAnalyze, debug, and resolve firmware issues observed at domestic and international customer sites as well as at local and overseas development centers.Triage and root cause system, driver, and device interoperability issues at customer sites.Spec gap analysis, firmware customization; collaborate with other engineering teams to analyze debug information and implement and deploy firmware patches.Frequent travel and stay at domestic and international customer sites as well as overseas development centers for extended periods of time (can be up to multiple weeks at a time).Assist customers by running or inspecting their tests at onsite locations.REQUIRED SKILLSBS in Computer/Electrical/Electronic Engineering or Computer Science, and 3 years of relevant experience in software or firmware or a MS in Computer/Electrical/Electronic Engineering or Computer Science is required.Have hands on experience with drivers or firmware in a storage technology such as NVMe, PCIe, SAS/SATA, SCSI, or Fibre Channel for candidates with working experiences · Demonstrated ability to work as a team player, as part of a local and globally distributed team, for candidates with working experiences  · Open to frequent and possible extended domestic and/or international travel.PREFERRED SKILLSFamiliar with one of the storage protocols, such as NVMe, SAS or SATA is a plus.Hands on experience with UART/JTAG/ICE debuggers, firmware debugging and protocol analyzers, is preferred.Strong experience in C/C++ for embedded systems is a plus. · Good oral and written skills for communication and documentation of technical information  · Is comfortable working in a multinational environment and understands how to leverage cultural diversity.  · Ability to work well with internal and external customers  IND2016 (if needed)***********************************************************************************************************************  Samsung Semiconductor Inc (SSI), an equal opportunity employer, is a world leader in Memory, System LSI, and LCD technologies. Headquartered in San Jose, California, SSI is a wholly-owned U.S. subsidiary of Samsung Electronics Co., Ltd.- the second largest semiconductor manufacturer in the world and the industry's volume and technology leader in DRAM, NAND Flash, SSDs, mobile DRAM and graphics memory. It is one of the largest providers of system logic, imaging and LED lighting solutions, as well as providing advanced process design and manufacturing for fabless companies. Samsung Semiconductor, Inc. also has a research and innovation center with numerous labs providing product design and research in: logic, memory, image sensors, displays and mobile technologies. In addition, the company supports Samsung Display Company, the largest producer of LCD and OLED displays. **********************************************************************************************************************A day in the life Samsung Video: http://bit.ly/1saHOGu  Click here to visit our Samsung Semiconductor Career Page "}