{"jobID": "2808582750", "jobLocation": "Foster_City_CA", "jobTitle": "Sustainability Intern - City Manager's Department", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " San Francisco/Peninsula  Job Type  Internship  Close Date  Until filled  Salary  $15.00-$30.00 Hourly  Additional Questionnaires  None  About Foster City  Driven by the idea of a planned community on the San Francisco peninsula, T. Jack Foster placed a $200,000 bet on Brewer's Island to build a thriving new city in 1958. The rest is history, and the City of Foster City is now home to 32,000 citizens and a wide array of industry--including some of the bay area's elite businesses. Conveniently located between San Francisco and San Jose, the City of Foster City prides itself on its well-planned neighborhoods, shopping centers, and most importantly a supreme quality of life.  The home of so many great careers.  To fulfill public services for our community, the City of Foster City is continually seeking qualified candidates to join our staff--currently 220 employees covering 76 job classifications. We offer a wide range of positions, including police and fire, with potential for growth and advancement. We also offer highly competitive benefits, including alternative work schedules (9/80), a retirement plan, and generous vacation and paid holidays.  View all openings  Share  Apply for Job Interested  Location  610 Foster City Blvd. Foster City, 94404  Description  SUSTAINABILITY INTERN - City Manger's Department  Sustainable Foster City Plan - Climate Action Plan - Economic Development Strategic Plan  $15 - $30 per hour Depending on Qualifications POSITION IS PART-TIME / NO BENEFITS Limited Term - July 1, 2018 to June 30, 2019  This is an ideal position for an undergraduate or preferably a graduate college student in environmental studies or public policy. The intern will assist the City in a providing more effective management and coordination of sustainability activities and gain valuable experience in public service.  Responsibilities include the administrative implementation of the Sustainable Foster City Plan including, but not limited to programs and initiatives in the Economic Development Strategic and the Climate Action Plans, respectively.  THE POSITION: The position is part-time with flexible scheduling up to a maximum of 960 hours per fiscal year and no benefits are provided. This is a 12-month, limited term position. The Sustainability Intern receives direction and guidance from the Management Analyst in the City Manager's office.  DUTIES: Under the supervision of the Management Analyst, the intern would support the efforts of the City's Environmental Sustainability programs and initiatives in the Economic Development Strategic and the Climate Action Plans and perform related projects. Work assignments:Preparing agendas, public notices and materials for meetings, public notices and materials for meetings, attending meetings with the Assistant City Manager and/or Management Analyst, and preparing minutes.Maintaining Sustainable Foster City ideas and proposals and writing reports. • Researching best practices and what other communities are doing in the area of Environmental Sustainability.Gathering data and information regarding City Sustainable efforts, including environmental, economic and transportation initiatives.Completing other related environmental sustainability work. QUALIFICATIONS: College-level education; people skills; communication skills; research and computer skills; and a knowledge of and interest in environmental sustainability would be highly desirable.  SCHEDULE AND HOURS - Schedule can be flexible, but will include attendance at night meetings. For student, it can be part-time during the school year and full-time in the summer or during school vacations. Total hours will be less than 1,000 annually.  RATE OF PAY - Intern pay rate of $15-$30 per hour or $15,000-$30,000 annually  HOW TO APPLY: A City/District application is required for consideration and recruitment is open until filled (apply now). Submit applications online at www.calopps.org or at the Human Resources Department, City of Foster City, 610 Foster City Blvd., Foster City, CA 94404.  SELECTION PROCESS: The City Manager's Department will contact the most qualified candidates for an interview. The candidate selected for this position must complete a fingerprint background check before starting employment.  Ideal Candidate  This is an ideal position for an undergraduate or preferably a graduate college student in environmental studies or public policy. The intern will assist the City in a providing more effective management and coordination of sustainability activities and gain valuable experience in public service.  Responsibilities include the administrative implementation of the Sustainable Foster City Plan including, but not limited to programs and initiatives in the Economic Development Strategic and the Climate Action Plans, respectively. Benefits The position is part-time and eligible for State mandated part-time sick leave accural. No other benetits are provided."}