{"jobID": "2733329477", "jobLocation": "Needham_MA", "jobTitle": "Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.ptc.com", "Headquarters": "Needham, MA", "Size": "5001 to 10000 employees", "Founded": " 1985", "Type": " Company - Public (PTC) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Dassault Systemes, Autodesk, Siemens PLM Software"}, "estimatedSalary": "108000", "jobDescription": "PTC Company Description PTC (Nasdaq: PTC) is a $1B+ global provider of technology platforms and enterprise applications for smart and connected products, operations, and systems. Our enterprise applications serve manufacturers and other businesses that create, operate and service products. Our award-winning ThingWorx technology platforms help companies achieve a “new reality” in smart, connected things and systems - deriving new value emerging from the “Internet of Things” market. An early pioneer in Computer Aided Design (CAD) software, PTC today employs more than 6,000 professionals serving more than 28,000 businesses worldwide. We are headquartered in Needham, MA. Region The Americas Subregion North America Country-City USA-Needham Business Title Data Scientist PTC Org CSS - Customer Success Job Description for Advertising Purposes As a member of PTC’s Customer Success DIGITAL Operations team, you will play a crucial role in transforming our customers’ digital experience through intelligent automation and personalization of our online services. Expect daily collaboration, plenty of innovation, and a strong culture of continuous improvement. Responsibilities:You will help in building proof of concepts, prototypes and production applications.You will also apply your skills to build internal systems and models, allowing the Customer Success organization to make data-driven decisions and automate its internal processes.Your focus will be on building prediction and recommendation models as well as text processing and analytics.You will monitor the evolution of the industry and the technology to help shape how our technology, skills, best practices and processes must evolve to stay on the leading edge.Skills and knowledge required: You will join us with a full-stack data science philosophy including data understanding, data source integration, feature engineering, model building, model evaluation, continuous deployment, and data visualization.  In addition to the above, you will: Bring your curiosity and leadership to help the team improve: challenge our current practices, bring new ideas and technology, identify problems and collaborate with the rest of the team to solve them.Have the communication skills to evangelize your concepts and ideas with the rest of the team and our non-technical internal customers.Master common programming languages and tools for data analysis and modeling R, Python (NumPy, Pandas, Keras, Tensorflow etc.)Java (Deeplearning4J, etc)NLP, ChatbotsBasic Qualifications Master’s degree Specialism in Artificial Intelligence as part of degree or previous work experience Job Req Number 28766BR Why Join Us and Benefits Summary PTC is a great place to work. Our culture is one of excellence, innovation, empowerment, and caring about our customers, communities, and employees. We have built an action oriented culture of integrity and trust, creating a sense of team spirit at both the departmental and company-wide level. At PTC, we have great employees and know that they are critical to the company’s success.  The Core Values we live by to achieve our success are: Customer SuccessExcellenceInnovation & EmpowermentIntegrity & ProfessionalismSocial Responsibility through Shared ValueTeamworkWinning We are looking to add strong candidates that uphold the PTC Core Values and are eager to grow and develop their careers with us. If you share these values and enjoy a work environment that is fast paced, hands on, and results oriented, then PTC is the place for you.  PTC benefits are among the most competitive in the industry. While your salary is the major component of your compensation, you also receive a competitive benefits package including: Retirement Savings Plan with Company MatchHealthcare and Dental insurancePaid Time Off and Sick TimeBirthday Day-offTuition Reimbursement (Canada, India, Israel, US)Holiday PayEmployee Referral ProgramManagement and Employee Training DevelopmentOther Regional-specific Benefits All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status. Apply!"}