{"jobID": "2775935617", "jobLocation": "Austin_TX", "jobTitle": "Principal Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.cubic.com", "Headquarters": "San Diego, CA", "Size": "5001 to 10000 employees", "Founded": " 1951", "Type": " Company - Public (CUB) ", "Industry": " Aerospace & Defense", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Accenture, Northrop Grumman, Xerox"}, "estimatedSalary": "121000", "jobDescription": "Business Unit:Cubic Global DefenseCompany Details: Intific is a software developer with the majority of its production development occurring in its Austin, TX studio and business development occurring in the DC area. We've been developing software in Austin since 2007 and in spring of 2014, we merged with Cubic Corporation (CUB) and are now a part of their Global Defense segment, which is a market leader in innovative live, virtual, and game based training solutions.  We value the work-life balance of our employees and have received top workplace honors in the past. Our employees regularly rate their relationships with their co-workers as one of the best aspects of working here and one of the main reasons they stay. Our role within Cubic is to be an innovative force; therefore we want forward thinking, high energy collaborators to join our team. We offer competitive compensation, top tier benefits, and extreme workplace perks (on-site massages, fully stocked kitchen, casual dress environment, to name but a few).  Mission: INTIFIC BUILD WHAT'S NEXT  Intific empowers people who understand how innovative software can drive revolutionary change. Our world-class team of engineers, developers, scientists, and thinkers embrace visions of the future and collaborate with our customers to bring them to life today. Through the creative disruption of traditional thinking, we inspire and deliver new products that produce significant value. Intific - we build what's next.Job Details:  We a looking for a [Data Scientist] with a broad analytics background and proven track record of finding impactful insights from data. You'll be working as part of our high profile Analytics group solving hard problems for our customers. This group is responsible for evaluating and validating \"big data\" sources and developing analytics solutions and predictive models for our customers. You'll partner with product managers, engineers, SMEs and other stakeholders to validate and implement your ideas. DESIRED EXPERIENCEAdvanced Experience with programming scripts such as Python, Scala, SAS, Matlab, and R in a Linux environment.Experience using exploratory data analysis methodology in creating and implementing machine learning algorithms and advanced statistics such as: regression, clustering, decision trees, markov chains, monte carlo, kalman filters, scenario analysis and neural networks.Experience in analyzing data from web and mobile application with data providers such as Google Analytics, Adobe Analytics, IBM Digital Analytics, Salesforce Analytics, Adwords and Facebook InsightsExperience with cloud services including AWS, Azure, Google Cloud Platform and Bluemix. Ability to collect data using XML and REST APIs.Experience with SQL querying and knowledge of PostgreSQL, MySQL, MSSQL databases.Experience in visualizing data to stakeholders in a simple and concise manner through visualization software such as Tableau, Domo, ggplot, D3, Qlikview, Leaflet, etc.Experience with distributed source control, Git or MercurialADDITIONAL QUALIFICATIONSExperience with Semantic Web, including RDF or OWL and SPARQLExperience with graph databases and algorithmsExperience producing analytics using MapReduce, Pig, SQL, or SparkSQLWorker Type: EmployeeSDL2017"}