{"jobID": "2660677589", "jobLocation": "New_York_NY", "jobTitle": "Consulting Senior Associate - NetSuite Advanced Revenue Management Consultant", "companyRating": "3.5", "companyInfo": {"Website": "www.rsmus.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1926", "Type": " Private Practice / Firm", "Industry": " Accounting & Legal", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "84000", "jobDescription": " As a consultant with a focus on ASC 606 transition projects, our Consultants work directly with Project Leads/Managers, Technical Accounting, and Senior Client Financial Team members to design, implement, verify, and transition our clients to the new accounting standards using the firm's project methodology.  This client-facing Consultant will manage multiple client projects from the initiate through post-deployment and support phases. The successful candidate must demonstrate willingness to go the extra mile for the team's success. They will be a problem solver, creative thinker, fast learner, be detail-oriented, and interested in learning their clients' business.Ability to translate technical accounting and business requirements to creatively solve client business/application issues. Ensure completion of tasks, milestones, and components including but not limited to functional specifications, design specifications, configurations, quality assurance, implementations, and project reviewsWork with the implementation team to design and document changes to existing systems and integrate new systems into client's infrastructureWork alongside the project lead to implement process improvements with systematic solutionsTrain end users on how to effectively use financial systems features and applicationsDevelop customized saved searches for shared business user usage and to support integration needsBuild customized reporting in use for data integrity and validationTake a hands-on approach to troubleshootingApplies critical thinking and problem solving skills on a daily basisBasic Qualifications:Bachelors degree in Accounting, Computer Science, Information Systems or related field required3+ years of functional experience with NetSuite Financials core functionality especially with the Order to Cash and Revenue processesStrong verbal and written communication skills, with an ability to express complex technical concepts in business termsStrong conceptual, analytical and problem solving skillsAbility to learn new business processes or applications very quickly with a concentration in the new accounting standard as it relates to our clients needsAbility to work under pressure, meet deadlines, and work on multiple projects simultaneouslyAbility to travel 10 - 30%Preferred Qualifications:Maintain at least one NetSuite CertificationPrior experience with NetSuite Advanced Revenue Management (ARM), legacy Revenue Recognition Modules, and/or Multi-Book AccountingPrior work experience in the accounting field and knowledge of general accounting principles preferred, but not requiredKnowledgeable in relational database architecture and methods including hands-on experience in developing advanced NetSuite Saved SearchesMust be a team player and be able to effectively interact with staff at all levels of the firmExcellent client skills and customer relationship management skillsSolid understanding of business and information technology processesEvaluated as exceptional performer in current position You want your next step to be the right one. You've worked hard to get where you are today. And now you're ready to use your unique skills, talents and personality to achieve great things. RSM is a place where you are valued as an individual, mentored as a future leader, and recognized for your accomplishments and potential. Working directly with clients, key decision makers and business owners across various industries and geographies, you'll move quickly along the learning curve and our clients will benefit from your fresh perspective.  Experience RSM US. Experience the power of being understood.  RSM is an equal opportunity/affirmative action employer. Minorities/Females/Disabled/Veterans. "}