{"jobID": "2795381799", "jobLocation": "Iselin_NJ", "jobTitle": "Construction Loan Administrator", "companyRating": null, "companyInfo": {"Website": "www.provident.bank", "Headquarters": "Iselin, NJ", "Size": "501 to 1000 employees", "Founded": " 1839", "Type": " Subsidiary or Business Segment", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Investors Bank, Valley National Bancorp, M&T Bank"}, "estimatedSalary": null, "jobDescription": " Iselin, NJ  Provident Bank, a multi-billion dollar NJ bank with branches in NJ and eastern PA is seeking an experienced Construction Loan Administrator. Qualified candidates must have at least five years administering a construction loan portfolio, have excellent customer service skills and be detail oriented. POSITION SUMMARY The position’s role is responsible for accurately administering a portfolio of construction loans and maintaining a courteous and beneficial liaison between customers, Relationship Managers and other outside professionals. Job performance is evaluated on accuracy, timeliness, productivity and customer satisfaction. The candidate selected will be expected to be work independently and will escalate situations as appropriate to Management. In addition to administering construction loans experience in closing loans would be beneficial. MAJOR JOB RESPONSIBILITIESPrepares and reviews pre-closing documentation for commercial lending and/or commercial real estate construction and permanent loans. Reviews loan approval documents, construction loan agreements and engineer’s plan & cost report to ensure proper loan administration. Reviews borrower’s monthly requisition for accuracy and compliance with approved loan and funding budgets with the Relationship Manager to coordinate monthly advances with borrower, inspecting engineer and title company. Is responsible for loan set-up including completion of boarding sheets, calculation of required escrows, reserves and prepaid interest, preparation of general ledger debit and credit entries and initiating wire transfers.  30%Establishes individual loan spread sheets with approved budgets, funding criteria, loan allocations and re-allocations; review permitted release provisions within the loan documents. Maintains loan spread sheets on a regular basis reflecting each funding, principal pay down and release consideration payment; follows up for written inspection reports and first lien certificate. Updates related monthly construction loan report(s)  30%Is responsible for confirming loan was properly established on the Bank’s system by Loan Operations, creates disbursement files and follows up for any post closing construction related documents. Knowledge of Horizon would be beneficial although not required.  15%Coordinates and funds construction loan advances including participated and syndicated loans Confirms monthly interest payments, insurance and tax payments are all current and in good standing.  10%Analyzes and Reconciles Construction Loan Report on a monthly basis. Works with loan officers to obtain and keep track of any updates pertaining to each construction loan.  10%Responds to customer inquiries. Updates department reports, including pipeline and closing reports.  5%SUPERVISORY RESPONSIBILITIES None. SKILLS AND TRAINING Extensive knowledge of Construction Mortgage Loan Administration requirements and ability to apply such knowledge.  Strong verbal, communicative and written skills.  Ability to manage heavy workflow, resolve problems with modest supervision, attend to detail and perform arithmetic calculations.  Proficient with Excel and Word.  Knowledge of Horizon Loan System helpful but not required. EDUCATION Bachelor’s degree preferred WORK EXPERIENCE 5 or more years in construction loan administration LICENSES AND/OR CERTIFICATESLicenses and CertificationsExpiration Date None WORKING CONDITIONS Work is mainly performed in a normal office environment. Noise levels are usually moderate. HAZARDS The hazards are mainly those present in a normal office setting. This job description may not be all-inclusive. Employees are expected to perform other duties as assigned and directed by management. Job descriptions and duties may be modified when deemed appropriate by management.We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.LI-POST*"}