{"jobID": "2698589893", "jobLocation": "Jersey_City_NJ", "jobTitle": "Operation Supervisor", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Operation Supervisor Jersey City, NJ 07306Join the rapidly growing world of ecommerce groceries! Job Summary Ahold eCommerce Sales Company is in search of 1st and 2nd Shift Operation Supervisors that are enthusiastic, detail-oriented and results driven to manage safety in this highly automated distribution center. The ideal candidate will be excited by the challenge of being in a high growth environment that is going through rapid evolution as the entire landscape of the internet business continues to change. Job Responsibilities Direct daily operations of the Receiving and Putaway area. Performs quality inspections and provides feedback to front line associates as needed.Direct daily operation which includes assigning, directing, and monitoring the work of front line associates.Supervise the receiving, storing, packing, and shipping of merchandise or materials while maintaining stock records and schedules.Facilitate the timely departure of trucks by focusing on productivity and efficiency of their department.Weekly planning and scheduling of associates.Design and implements work methods and procedures to increase productivity and improve service within an assigned department.Coordinate the scheduling and arrival of vendors.Motivate associates to ensure that predetermined productivity, cost, and quality standards are achieved or exceeded.Maintain and ensures a safe and clean work environment.Facilitate the tracking of absences and tardiness and provides feedback/coaching to the associates.Conduct associate performance appraisals and provides recognition and/or progressive discipline as needed.Communicate issues that need addressing to their work group.Troubleshoot system and mechanical issues as they arise. Escalates complex problems to either maintenance or IT.Job Requirements Bachelor preferred or equivalent work experience.2+ years supervisory experience in logistics, warehousing, and/or transportation.Management style that promotes an atmosphere of high performance, superior customer service and innovation without compromising integrity a must.Strong sense of urgency with the ability to work within tight deadlines a must.Excellent written and verbal communication skills a must.WMS knowledge, Microsoft office (Word, Excel) a plus.Experience with a retail organization a plus.Food Safety Certification a plus.Who are we? Ahold eCommerce Sales Company, a wholly-owned subsidiary of Ahold Delhaize - the world-leading food retailer, is an innovative and rapidly expanding eCommerce Food Technology company. AES is headquartered in Jersey City, NJ. The distribution center supplies groceries and goods through Peapod, the biggest online grocer service in the U.S. We service customers in the greater New Jersey and New York areas.Why choose AES? We are a Company that Delivers! We deliver food and opportunity. To work your way up. To work for more than just a paycheck. To work for something big, something important and have fun while doing it! We’ve got a lot of hardworking thinkers and doers over here. Great people deserve great benefits and we go above and beyond!www.AES4Peapod.com"}