{"jobID": "2830896829", "jobLocation": "New_York_NY", "jobTitle": "Unit Receptionist", "companyRating": "3.1", "companyInfo": {"Website": "www.guckenheimer.com", "Headquarters": "San Mateo, CA", "Size": "1001 to 5000 employees", "Founded": " 1965", "Type": " Company - Private", "Industry": " Restaurants, Bars & Food Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "14", "jobDescription": " Guckenheimer, is a national foodservice management company that pioneered restaurant style, healthful dining in the workplace.  Guckenheimer is a fast growing high quality foodservice management company that is orientated to Health and Wellness for our employees and clients, is recognized by Training Magazine as a Training 125 Company, 2015 & 2016, in 37 states nationwide, and embraces many more attributes for innovative practices for our industry.  With new growth in the area, we have incredible employment opportunities for: Receptionist/Assistant Events Coordinator The candidate must be extremely polished, articulate and detail oriented. In addition to reception duties this person must also have computer skills, be able to multitask, and have good communication skills. He/She will assist in organizing events and work with the internal event planning team. He/She will also liaise with the offices of clients senior management. The position would be for between 55 and 60 a week - Monday to Friday. Hourly position with OT - $19 an hour Job details: This person will sit at a reception desk and greet all of Barclays client’s as they come to meet their Barclays business partners. -greet guests, check coats and bags, and show guests to their meeting rooms -confirm reservations -create event orders -answer phones -make reservations in our reservation system -create reports in Excel -maintain presentation of reception area -double check reservation details are correct Guckenheimer Embraces Equal Opportunity Employment Guckenheimer participates in the E-Verify Program, as required by law"}