{"jobID": "2645523346", "jobLocation": "Boston_MA", "jobTitle": "Research Psychology", "companyRating": null, "companyInfo": {"Website": "www.navy.com", "Headquarters": "San Diego, CA", "Size": "1001 to 5000 employees", "Founded": " 1775", "Type": " Government", "Industry": " Government", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " \"About This JobThere are many possible career paths as a Navy Research Psychologist. Early positions often involve submarine, diving and medical research in laboratory and field settings, on a wide variety of variables affecting numerous aspects of human performance in military systems.Navy Research Psychologists also manage large research and development efforts in laboratories and provide staff assistance related to human performance, training and personnel issues.As a Research Psychologist and Officer in the Medical Service Corps, you will be among approximately two dozen research psychologists who deliver operational products, systems and procedures that dramatically impact the health, safety and performance of servicemembers.Areas of specialty include cognitive, experimental, social, industrial/organizational, human factors, engineering, personnel, neuroscience, and physiological.Navy Health Care Specialists may serve at any one of more than 250 Navy and medical facilities around the globe, from Hawaii to Japan, Germany to Guam, and Washington, D.C., to Washington state.As a Research Psychologist, you may conduct research in the field on a submarine or ship. You could also serve at the Naval Research Laboratory in Washington, D.C., the Naval Submarine Medical Research Laboratory in Groton, Conn., the Naval Health Research Center in San Diego, Calif., or at Navy Personnel Research, Studies and Technology in Millington, Tenn.Upon graduation from graduate school, those pursuing a Research Psychologist position are required to attend Officer Development School (ODS) in Newport, R.I. ODS is a five-week program that provides a comprehensive and intense introduction to the responsibilities of Navy Staff Corps Officers. Here they learn about the military structure of the U.S. Navy, its rich history of traditions and customs, leadership development and military etiquette.Promotion opportunities are regularly available but competitive and based on performance. As a Research Psychologist, you may become eligible for positions involving policy development, research management and oversight, as well as program evaluation. You may also take advantage of opportunities for medical department leadership positions, including command of Navy Medical Research Centers and Development Laboratories.\""}