{"jobID": "2794824392", "jobLocation": "Los_Angeles_CA", "jobTitle": "FAF Software Intern", "companyRating": null, "companyInfo": {"Website": "www.bellefairejcb.org", "Headquarters": "Shaker Heights, OH", "Size": "201 to 500 employees", "Founded": " 1868", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "FAF Software InternPOSITION DESCRIPTION: Children’s Bureau’s Social Enterprise, FAF Software, is a true testament to its commitment to innovation and discovery through research. The FAF is a state-of-the-art, web-based assessment tool used to help hard working child welfare professionals and organizations better serve vulnerable children and their families. The FAF intern will assist with all core aspects of the business including, but not limited to sales and marketing. COMMITMENT: Winter 2018, 15 – 20 hours per week REPORTS TO: Sales and Marketing Coordinator PREFERRED QUALIFICATIONS:Exceptional oral and written communication skills, to include face-to-face and telephone contactExceptional organizational skills with attention to detailStrong computer skills (e.g. Microsoft Word, Excel, Outlook)Ability to work in fast-paced environment and multi-taskFamiliarity with Hootsuite and Canva a plusDUTIES AND RESPONSIBILITIES:Research and create marketing content for social media channels targeting both current and potential clientsCreate ways to attract more engagement and followers on our social media channelsUpdate, track and report on Google Ads accountAssist in maintenance of an accurate and up-to-date CRM database and Constant Contacts listsResearch and help find potential clients through research of competitors and children and family program funding opportunitiesBecome familiar with the FAF Software, FAF website and current marketing materials to help continually think about news ways to market the FAF SoftwareGENERAL:Maintain confidentiality in matters of agency operations, personnel and clients.Maintains positive communications with all agency staff, clients and visitors.Exercise good judgment in performance of duties and responsibilities.Support existing agency policies principles and mission.Ability to work in a multi-cultural environment.CONTACT: Kaya Okuniewski, Social Enterprise Manager  Children’s Bureau  kayaokuniewski@all4kids.org  213-342-0145  Melissa Townley, Sales and Marketing Coordinator  Children’s Bureau  melissatownley@all4kids.org  213-342-0100 x1271"}