{"jobID": "2798365840", "jobLocation": "San_Jose_CA", "jobTitle": "QA Software Engineer", "companyRating": "4.0", "companyInfo": {"Website": "www.lookingglasscyber.com", "Headquarters": "Reston, VA", "Size": "201 to 500 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " FireEye"}, "estimatedSalary": "128000", "jobDescription": "LOOKINGGLASS CYBER SOLUTIONS is hiring for a dynamic and technically versed QA Software Engineer to work in our Threat Mitigation engineering organization located in San Jose. The ideal candidate will be responsible for creation, implementation and execution of manual and automated tests.  A successful QA engineer will be required to work closely with software engineers in an Agile Scrum development environment, embedded in the scrum process as a team member, developing acceptance test cases and tests.  The QA Software Engineer position requires applicants to be self-driven in support of assuring compliance to specifications in the release to market of complex solutions. Strong collaboration skills are a must. OVERVIEW OF POSITION:Responsible for manual and automated Functional, Migration, Security, and Regression testing of features scheduled for release;Monitor project/feature implementation with an eye toward improving security;Responsible for finding, isolating, documenting, tracking, and regressing defects through the QA process utilizing a bug tracking tool effectively;Analyze requirements and implement testing strategies that maximize test coverage and improve system reliability and performance;Self-Motivated, proactive and willingness to work efficiently in a faced paced environment;Willingness to learn new technologies and provide feedback on how to improve QA processes and activities; QUALIFYING REQUIREMENTS:Bachelor’s degree in Computer Science or Computer Engineering;5-7 years’ industry experience developing complex system solutions;Experience developing software test code on a Linux environment including writing test plans, test cases and test reports;Demonstrate attention to detail and analytical thinking;Solid understanding of QA tools and testing environments (Selenium, Jenkins, scripting environments, etc.);Experience in developing end-to-end tests for complex solutions for large-scale enterprise systems;Estimate, prioritize, plan and coordinate testing activities;Excellent written and verbal communication and presentation skills;Strong collaboration skills are a must;DESIRED SKILL SET:Background in security and network products a plus;Experience working in an Agile Scrum development environment strongly desired;Understanding of web technologies (JQuery, HTML5, CSS, or similar technologies);Experience in penetration and vulnerability assessment and tests a plus. EOE/AA/M/F/Vet/Disability Employer"}