{"jobID": "2788326105", "jobLocation": "Weehawken_NJ", "jobTitle": "Head of CCAR Strategy & Regulatory Coordination", "companyRating": null, "companyInfo": {"Website": "www.ubs.com", "Headquarters": "Zurich, Switzerland", "Size": "10000+ employees", "Founded": " 1862", "Type": " Company - Public (UBS) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Deutsche Bank, Credit Suisse, Morgan Stanley"}, "estimatedSalary": null, "jobDescription": "Your RoleAre you solid as a rock when things are getting tight, time is running out and quick solutions are needed?  Do you have in depth experience in managing communication fit for the highest levels of senior management? Are you interested in being \"the voice\" of one of the key transformational efforts financial institutions go through as a response to regulatory requirements? That means we are looking for you, to: Create and lead the Strategy and Regulatory Coordination team that supports CCARAct as the chief architect of the framework, documentation and presentation standards and approach to support recurring internal and external communications – e.g. FRB responses, exam support, disclosures, internal management committeesPartner with Finance, Risk Management, Technology and Regulatory Reporting and the business and serve as the senior bridge to support and educate on regulatory messagingAct as the key CCAR representative of program messaging to senior management, regulators and other key stakeholdersAct as key liaison with Regulatory RelationsProvide on-site leadership of the Strategy and Regulatory Coordination Team (5 FTE)Preferred Qualifications•in depth experience in managing executive level communication preferably over large scale, cross functional implementation projects or critical functions (e.g. Finance, Investor Relations)good understanding of the regulatory environment of financial institutions (especially CCAR) and hands-on regulatory previous experience with a major regulator, regulatory consulting practice or within the banking sectorworking experience in Finance or Risk Management is desired, particularly in the areas of regulatory reporting, or financial planning and budgetingability to work in a constantly evolving environment and collaborate across multiple areasBachelor’s degree in business management, accounting or financeStrong analytical skillsYour teamYou’ll be working in the central CCAR team within the Finance organization which is driven out of the Weehawken office. The functional owner of this project is Finance but many other functions are involved - the Risk function in particular. The Strategy and Regulatory Coordination team will consist of one direct report supported by three staff.Your experience and skillsYou have: – in depth experience in managing executive level communication preferably over large scale, cross functional implementation projects or critical functions (e.g. Finance, Investor Relations)  – a good understanding of the regulatory environment of financial institutions (especially CCAR) and hands-on regulatory previous experience with a major regulator, regulatory consulting practice or within the banking sector  – strong leadership skills  – experience in an environment where no two days are the same  – strong ability to understand and business and technical issues (previous line experience is a plus) and translate technical concepts into key messages You are: – a strong written, verbal and visual communicator, comfortable interacting with colleagues at all levels  – flexible with proven ability to conform to shifting priorities, demands and timelines through analytical and problem-solving capabilitiesWhat we offer"}