{"jobID": "2690419559", "jobLocation": "Los_Angeles_CA", "jobTitle": "Sr. Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.connexity.com", "Headquarters": "Los Angeles, CA", "Size": "201 to 500 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Rocket Fuel, Conversant, ForeSee"}, "estimatedSalary": "141000", "jobDescription": " Description Position at ConnexityIn the Connexity Audience Solutions Data Science Group, we build and maintain the analytic machinery (pipelines and processes) that generates and optimizes audiences for our clients. We ingest big data (~100Bs of records) and use machine learning methods to guarantee that the right consumers see the right advertisements. We’re a small team, focused on creating big value across Connexity’s audience products.  We’re looking for a Senior Data Scientist - a magical hybrid of quant and engineering disciplines, to join us in advancing the development of new and existing analytic audience products. If you are passionate about data and solving business challenges with math and software development…if you want to move the needle by building, owning, and maintaining the production systems that directly drive revenue…if you’ve got the multidisciplinary chops for this business value-oriented role…then we should talk. ResponsibilitiesTranslate business challenges into analytic frameworks and apply data operations and machine learning methods to massive data sets to create business value.Rapidly architect, research, design, prototype, and implement scalable, efficient, analytic solutions.Design and implement measurement instrumentation for method evaluation, monitoring, and optimization.Work independently, but also collaborate within Data Science team and with other engineers and stakeholders.QualificationsMS degree (or equivalent) in a quantitative discipline (e.g., statistics, operations research, bioinformatics, economics, computational biology, computer science, mathematics, physics, electrical engineering, industrial engineering, social sciences)Minimum of 3 years relevant analytic work experience (e.g., as a statistician / computational biologist / bioinformatician / data scientist), including deep expertise and experience with statistical data analysis such as linear models, multivariate analysis, stochastic models, sampling methods, etc.Knowledge of theory and application of {machine learning, data mining, and statistics} methods for large, complex data sets.Experience owning the complete modeling life cycle from data exploration, feature management, model building, and evaluation.Experience with big data tools (Map/Reduce, Hadoop, Hive, Spark, etc.).Fluency with one or more high-level programming languages (Python, R, Scala, Java, C, C++)Ability to build quick prototypes to demonstrate value – and then improve them.Proficiency in Linux (shell tools, scripting, and basic admin).Ability to communicate complex ideas in data science to relevant stakeholders.Excellent organization skills and attention to detail.Collaborative, positive attitude with desire to work in a demanding, fast-paced, and dynamic work environment.Strong problem-solving skills with focus on business value creationSelf-sufficiency to understand problems and frame/execute their solutions.Leadership, passion, and curiosity.Prior experience with market research methods and survey data is a plus"}