{"jobID": "2739018181", "jobLocation": "New_York_NY", "jobTitle": "Intern - Summer 2018 - Undergraduate - Twentieth", "companyRating": null, "companyInfo": {"Website": "www.foxmovies.com", "Headquarters": "Los Angeles, CA", "Size": "1001 to 5000 employees", "Founded": " 1904", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OVERVIEW OF THE COMPANY  20th Century Fox  One of the world's largest producers and distributors of motion pictures, 20th Century Fox Film (TCFF) produces, acquires and distributes motion pictures throughout the world. These motion pictures are produced or acquired by the following units of 20th Century Fox Film: Twentieth Century Fox, Fox 2000 Pictures, Fox Searchlight Pictures, Fox International Productions, and Twentieth Century Fox Animation. During fiscal 2017, TCFF placed 25 motion pictures in general release in the United States. The motion pictures produced and/or distributed by TCFF in the United States and international territories in fiscal 2017 included Hidden Figures, Logan, Jackie, and The Boss Baby. TCFF has released or currently plans to release approximately 23 motion pictures in the United States in fiscal 2018. JOB DESCRIPTION Fox is proud to support a culture of creativity, entrepreneurial spirit and community that attracts the industrys brightest talent. The Fox Internship Program offers an exciting opportunity for you to gain practical experience while interning for one of the biggest media and entertainment companies in the world. You will have the opportunity to participate in real-world projects, which provides valuable work experience and leadership skills.  The Fox Internship Program provides mentoring and learning opportunities to help you develop your skills, network with Fox employees, and learn more about what its like to work in the entertainment industry.  Twentieth (20th) Century Fox Film Corporation is one of the major American movie studios, located in the Century City area of Los Angeles, California, USA, just west of Beverly Hills. The studio is a subsidiary of News Corporation, the media conglomerate controlled by Rupert Murdoch. Some notable films include: Star Wars series, Minority Report, Walk the Line, Ice Age series, X-men series, The Devil Wears Prada, The Simpsons, Live Free or Die Hard, and Borat. This is an internship where you will have the opportunity to see the inner workings of a publicity team and gain real industry experience in our New York office. Projects/Tasks:  Daily / weekly breaks (newspaper / magazine clippings)  Creating and updating field screening charts and promotional initiative charts  Answering telephones  Preparing and working at screenings, premieres, junkets, promotional stunts  Running errands  Assisting with projects from publicists and press coordinators Learning Objectives:  An understanding of the function of national and field publicity  Excellent administrative and organizational skills  Experience preparing for and working at various publicity events Qualifications:  Preferred majors include Film Studies, Marketing, Public Relations or other similar course of study.  Prior internship experience in film, publicity, marketing or other related fields preferred.  Excellent administrative and internet research skills.  Ability to multi-task and work independently.  Hardworking, friendly and enthusiastic  To participate in Foxs Internship program you must meet the following criteria:  Applicants must be enrolled full-time in an undergraduate program at an accredited university and be sophomore status or above.  Be eligible to work in the United States without sponsorship by the Company.  Housing is not provided, so please have a housing option guaranteed before applying. Application Process:  Please submit a resume and a cover letter detailing your qualifications.  We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, gender identity, disability, protected veteran status, or any other characteristic protected by law. We will consider for employment qualified applicants with criminal histories consistent with applicable law."}