{"jobID": "2830683868", "jobLocation": "Sunnyvale_CA", "jobTitle": "Travel Registered Nurse RN Case Management", "companyRating": "4.0", "companyInfo": {"Website": "www.onestaffmedical.com", "Headquarters": "Omaha, NE", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "68", "jobDescription": " JOB DESCRIPTIONTravel Registered Nurse RN Case ManagementLocation: SUNNYVALE,  California Shift: Days: 8:30am-5pm (Schedule can be flexible based on patient's availability.) Weekends: One per month Start Date: 7/1/2018 Speciality: RN - CASE MANAGEMENT Occupation Category: 29-1141.00 Registered NursesDesctiption: We. Are. OneStaff. Medical. An independently-owned, nationally-recognized and amazingly awesome staffing firm ready to work for you!  A work ethic forged in the Midwest, we’re here to stand by your side and help you find your dream assignment anywhere in this great country.  We want the same like-minded, awesome candidates to travel with us. Be bold. Enjoy work again. Let us help.  Now back to what you’re here for; we’re looking for a Travel Registered Nurse RN Case Management to join our family, and well, that’s you! So check this out…  Case Management Nurses coordinate long-term care for their patients. Their goal is to treat their patients at optimal times to keep them healthy and out of the hospital. As a Case Management Nurse, you’ll likely work with specific groups of patients. You can choose to specialize in treating people with diseases like HIV/AIDS or cancer, or you can work with patients of certain age groups like geriatrics or pediatrics. You’ll also research the latest treatment and procedures, and work with insurance companies to help your patients receive the best possible care in the most cost-effective way. Experience Requirements:Minimum 1 year of current work experience in Travel Registered Nurse RN Case ManagementCalifornia state Healthcare Provider license or willing to obtainThis position may require one or more of these certifications: BLS  & possibly othersBenefits: Are you in? Do we need to further convince you why OneStaff Medical is your ideal travel partner? How about: A dedicated expert (our recruiter) to be by your side 24/7; every step of the process, and to ensure you get exactly what you are looking for!All the good stuff like; Medical/Dental/Vision Insurance & 401KDream assignments all across the country; from sunny California, down to sun-kissed Florida, we got ‘em!Travel reimbursement as part of your weekly pay!Licensure and certification reimbursement to our return travelers, when needed for new assignments!Some hot-hot-hot referral bonuses! (uh hum, so travel w/ an amigo(a) and get paid $500!)  …and FREE super soft premium scrubs through our partners, FIGs scrubs, to all of our loyal return nurses! Are you in? Do you love to travel, and this sounds like an ideal fit? Stop thinking. Do it. Let’s dance! Apply now.  If you have any questions or would like to discuss a particular position please feel free to call a recruiter at 1-877-783-1483 or email  info@onestaffmedical.com  Date Posted: 6/28/2018Contract"}