{"jobID": "2606003108", "jobLocation": "Mountain_View_CA", "jobTitle": "Sr. Software Engineer - Data", "companyRating": "3.6", "companyInfo": {"Website": "www.egnyte.com", "Headquarters": "Mountain View, CA", "Size": "201 to 500 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Dropbox, Box, Hightail"}, "estimatedSalary": "154000", "jobDescription": " Sr. Software Engineer - Data (Mountain View, CA - USA)  About Egnyte:  Egnyte a leader in the Gartner Magic Quadrant for Enterprise File Share and Synchronization, allows organizations to connect, protect, and unlock value from all their content. Our Content Intelligence platform delivers smart  content collaboration and governance in the cloud or on-premises to thousands of businesses around the world in even the most regulated industries. Founded in 2007, Egnyte is privately held and headquartered in Mountain View, CA. Investors  include venture capital firms, such as Google Ventures and Kleiner Perkins Caufield & Byers, as well as technology partners, such as CenturyLink and Seagate Technology. Position Description: We are looking for a senior software engineer to help implement innovative, primarily learning based product features. Egnyte applications host large unstructured datasets for Fortune 1000 customers, with connectors to a wide array of other  on-premises and SaaS document repositories. We are continually seeking ways to allow our users to navigate datasets using intelligent features that harness content and associated organizational context. These features leverage various techniques  such as recommendation engines and classification models. Specific Responsibilities will include:Work closely within a distributed team to prototype and implement innovative solutions to large unstructured data sets. Solutions encompass various methods from rule-based systems to deep learning, as appropriate for the problem.Partner with product owners to realize solutions in production.Communicate your approach and results to a wider audience through presentations.Egnyte offers a unique opportunity to take a data science solution from modeling all the way to deployment in a span of days.The successful candidate will need:Demonstrated success with Software Engineering in a SaaS or Cloud environment, preferably with hands–on knowledge of deploying data science solutions in production at scale.Fluency in Java, Python. Competency in other programming languages a plus.Experience with Non–SQL and Graph databases a plus.Experience with large data sets and distributed computing (Hive/Hadoop) a plus.BA/BS in Computer Science, Engineering, Statistics or other technical field. Advanced degrees preferred. Please send your resume to jobs_engineering@egnyte.com add \"Sr. Software Engineer - Data\" in the subject line."}