{"jobID": "2755009424", "jobLocation": "San_Jose_CA", "jobTitle": "Software Manager, AI Solutions Platform", "companyRating": null, "companyInfo": {"Website": "www.xilinx.com", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 1984", "Type": " Company - Public (XLNX) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Qualcomm, Intel Corporation, AMD"}, "estimatedSalary": null, "jobDescription": "Description Xilinx is the leading provider of All Programmable FPGAs, SoCs, MPSoCs and 3DICs. Xilinx's all-programmable devices are designed into tens of thousands of products that improve the quality of the everyday lives of billions of people worldwide. For over 30 years, Xilinx has been behind some of the greatest advancements in technology and science - from the industry's first fabless semiconductor model to the NASA Curiosity Mars Rover, to today's autonomous vehicles and hyperscale data centers. Xilinx uniquely enables applications that are both software-defined, yet hardware optimized - enabling smart, connected and differentiated applications across technology's biggest megatrends, including Machine Learning, 5G Wireless, Embedded Vision, Industrial IoT and Cloud Computing and more.  If you are a passionate, innovative and an out-of-the-box thinker that enjoys challenging projects, Xilinx is the right place for you. Our global team is growing and we are looking for bold, collaborative, and creative people to help deliver groundbreaking technologies that enable our customers to differentiate. Come do your best work and live your best life through collaboration, wellness and giving back to your community as a member of the ONEXILINX team.Xilinx is looking for an energetic, motivated and seasoned software manager to join a growing and innovative team at our San Jose headquarters. You will primarily be providing technical and project leadership to a bright team of engineers developing software solutions using AI frameworks and Linux kernel for heterogeneous Multi-processor systems designed for Xilinx next-generation SoCs.  Responsibilities: Lead a team responsible for :Contributing to the architecture and design of the overall AI solutions platform.Optimizing the AI solutions developed for performance and designing them for scalability.Developing Bare Metal and/or Linux drivers for AI acceleration engines using Xilinx SOCs.Developing Heterogeneous memory Management solutions for Asynchronous Multi-processing platforms.Evaluating AI solutions developed by Xilinx and performing comparative analysis against other industry solutions.Developing debug and performance analysis tools and infrastructure for AI solution development.Work with different teams to identify problems and create solutionsDelivering software solutions in line with product roadmap on time with high quality.Lead cross function interaction and engagement with various key player and stakeholders in the organization.Responsible for all the phases of software development, from requirement gathering, analysis, design, development, testing and final release to customers.Provide executive level status and communication on the project execution and deliverables.Responsible for working with customers and internal support teams for resolving critical customer escalations.Project planning activities – creating project plans/schedule, resource allocation, tracking, risk analysis and mitigation, customer deliveryTeam coaching to motivate team to deliver high quality products and on-time deliveriesDo hands-on work as neededProficient in the design, implementation, documentation and testing of software code implementing product features and requirementsProficient in skills, tools and methods to advance the quality, consistency, and timeliness of Xilinx software products"}