{"jobID": "2827194329", "jobLocation": "Boston_MA", "jobTitle": "Business Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.customerportfolios.com", "Headquarters": "Boston, MA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "60000", "jobDescription": "What we do Customer Portfolios is a marketing technology leader that empowers its global retail clients to maximize the value of each customer. The company’s marketing platform offers a single digital solution that brings together all customer data to enable analysis, insight, strategy, and execution. Who we are The Customer Portfolios team of analytical and marketing experts help companies like Johnston & Murphy, Vera Bradley, Journeys, Frye, Tourneau, and many more consistently drive revenue growth and increased customer lifetime value. Visit www.customerportfolios.com, read our blog and follow us on Twitter and LinkedIn. Who you areLove Databases and Data Visualizations – You enjoy writing SQL to gather your data points and making them come alive through Tableau data visualizationCompelling Storyteller – As an analyst, you know that the beauty is in the details, but you also understand how each piece of the analytics puzzle fits together to form actionable recommendations that will knock your clients’ socks offCurious – You want to know why a program performs well or doesn’t and don’t mind getting your hands dirty when tackling the underlying dataInnovator – You take pride in building things and seeing your ideas through to the end-product, whether it’s a Tableau dashboard, an Excel output, or an elegant SQL code solutionAdaptable – You are flexible and understand that clients’ needs can change mid-task. You enjoy wearing many hats and working on multiple projects at the same time.Team Player – You like working closely with others and thrive in team settingsWhat you’ll doStrategically own client projects from beginning to end as the expert analyst on the teamDevelop quantitative analysis, dashboards, and ad hoc reporting to demonstrate performance of key business initiatives and define areas for optimizationSynthesize complex analytics into compelling top level findings for presentations to senior marketing executivesWork with data engineers and solution architects to source new data, resolve system issues that impede data extraction, and design structures which will best support analytical effortsWork with internal and client-marketing teams to define and execute A/B and multivariate tests to optimize the customer experience and maximize customer valueComfortable sharing expertise with other team members and leading new analytical initiativesYour Experience3+ years of experience in marketing analytics, with proven success in designing analytical approaches to understand key business behaviors that drive acquisition, retention, and engagementProficiency in SQL– on the job experience collaborating with architects on table design to support Tableau reporting and ad hoc requests. The bulk of our work is done in SQL.Proficiency in Tableau – on the job experience with creating dynamic Tableau dashboards"}