{"jobID": "2662836192", "jobLocation": "San_Francisco_CA", "jobTitle": "Lead Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.verisk.com", "Headquarters": "Jersey City, NJ", "Size": "5001 to 10000 employees", "Founded": " 1971", "Type": " Company - Public (VRSK) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " CoreLogic, MSB, LexisNexis Risk Solutions"}, "estimatedSalary": "137000", "jobDescription": " Job ID: 20180212-10872-YD  Company Name: Verisk Insurance SolutionsDescription: If you’re looking for a career that transforms, inspires, challenges, and rewards you, then come join us! Verisk Analytics is a global supplier of risk assessment services and decision analytics for customers in a variety of markets, including insurance, healthcare, financial services, supply chain, and others. We’re a thriving public company with solid revenue growth and earnings and offices worldwide. And we’re continually looking for ways to augment our existing markets and expand into new markets with excellent growth potential. At Verisk, you’ll be part of an organization that’s committed to serving the long-term interests of our stakeholders, including the communities where we operate. Position Summary Our Claims Analytics business is seeking an experienced Lead Data Scientist to serve as a technical resource in the conception and development of new predictive modeling initiatives. *Candidates could work out of either Jersey City, NJ, Lehi, UT, or San Francisco office.  ResponsibilitiesServe as the lead technical resource in the conception and development of new predictive modeling initiatives. Mentor and train junior level analystsSupport the organizational strategy and manage projects or innovation streamsSuggest and develop innovative analytic methods that result in a technically superior product and/or create a competitive advantage, as well as meet design requirements and project timelineLead research, evaluation, and recommendation of internal and external data sources and coordinate with data resourcesServe as the senior technical expert for leadership on data cleansing, variable creation, variable transformation, etc., as well as best-practices in the creation of analytic datasetsServe as the consummate technical expert in model development and validation analyses - from driving pragmatic practice of methods to devising novel solutions and diagnostic measures, to coaching and mentoring junior staffAct as senior technical expert in development and execution of methods to address needed business diagnostics; review, and aid productization and deploymentProvide significant input to senior leadership team and Product Management on process improvement, implementation specifications and production testingAct as senior technical expert to develop process and metrics to monitor model performanceReview reports and make recommendations for needed model refits / enhancementsProvide input to Senior Management Team and Product Management on implementation specifications and production testingResearch literature to stay current on technical methods to solve specific problemsRequirementsGraduate degree (M.S. required, Ph.D. preferred) in a quantitative discipline4+ years professional experience building predictive and descriptive modelsExposure to the property & casualty industry is highly desirable, and experience with medical, clinical, fraud & abuse and pharmacy data analytics is a plusPrior people management experience is a plusAbility to lead complex projects from model design to deploymentExtensive experience working with large datasetsKnowledge, experience, and expertise in diverse statistical and data mining techniques (e.g. - image mining, IoT analytics,GLM/Regression, Boosting, Random Forest, Trees, Clustering, PCA, SVM, text mining, social network analysis etc.)Ability to program and review code in Python, Spark, Scala, R, or SAS is highly desirableExperience with Big Data technologies like Hadoop, Spark, Hive, NoSQL, etc., and Cloud technologies (AWS, Azure, etc.) is highly desirable We offer an excellent compensation package. Our benefits package is competitive and includes full healthcare options, a 401(k) plan, and a generous Paid-Time-Off program.  All members of the Verisk Analytics Family of Companies are equal opportunity employers. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other legally protected classification.  #LI-YD1Requirements: Expertise Scientific Education Masters (or equivalent work experience) Job Type Full Time Location NJ-Jersey City, CA-San Francisco, UT-Lehi Years of Experience 5-8 Years"}