{"jobID": "2749335010", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist Manager, Customer Analytics", "companyRating": "2.9", "companyInfo": {"Website": "www.gymboree.com", "Headquarters": "San Francisco, CA", "Size": "5001 to 10000 employees", "Founded": " 1976", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " The Children's Place, Carter's, Gap Inc."}, "estimatedSalary": "161000", "jobDescription": "   Gymboree Group, Inc. is a portfolio of children's brands operating specialty retail stores with high-quality clothes and accessories. Our family of brands includes Gymboree, Janie and Jack, and Crazy 8. Since our start in 1976, we have grown from offering mom-and-baby classes in the San Francisco Bay Area to currently operating hundreds of retail stores throughout the United States, Canada, and Puerto Rico, along with franchises around the world. We believe that respect for the customer, respect for the brand, and respect for each other are at the core of everything we do.  The Data Scientist, Customer Analytics will provide leadership in the development and execution of Customer Analytics to support decision-making for Gymboree, Janie & Jack and Crazy 8 brands. He/she will be accountable for consulting with the cross-functional businesses to assess and address information needs, and for managing, analyzing and synthesizing analytics and insights to influence decisions and action planning. He/she will lead analytic efforts related to customer segmentation, direct marketing, lifecycle marketing, digital marketing optimization, cross-brand modeling, product affinity modeling, and various other areas to help drive our businesses. This individual will help drive the organization's strategic advantage through more in-depth analysis of structured and unstructured data. He/she will have an inherent passion for data and data driven thinking, adept at extracting patterns from volumes of data to drive strategy and operational efficiencies.     Key Responsibilities: Develop best in class advanced analytics practice and drive analytic culturePerform ongoing analytic projects in support of brand strategies and tactics. Topics will include, but are not limited to cross-channel segmentation, direct marketing optimization, email segmentation, digital marketing optimization, incorporation of unstructured information, and ROI analysisDevelop and optimize revenue-driving campaigns targeted at specific segmentsDrive and monitor A/B and multivariate tests to optimize conversion and other key performance metricsIdentify key metrics necessary to establish customer-focused and results-oriented campaign strategiesPrioritize opportunities for improvement; generate data-driven hypotheses for campaigns Job Requirements5+ years of experience in analyticsBA/BS required (Masters preferred)Experience with large volumes of dataExperience with CRM data structures, Salesforce/Heroku a plusDeep expertise in complex modeling and analytical methodologyHighly analytical, motivated, decisive thought leaderStrong understanding of retail and apparel best practices and trendsAdvanced proficiency in SQLExperience designing and implementing A/B and multivariate testsStrong communication skills that is able to educate and influence through written and verbal communicationAbility to simplify highly complex analyses and output into terms that are easily accessible and impactful in both written and verbal formatsDemonstrated ability to provide high attention to detail in a fast-paced work environment with shifting priorities   Gymboree Group, Inc. is unable to provide relocation assistance for this position.Principals Only. EOE. No phone calls please."}