{"jobID": "2805410453", "jobLocation": "Seattle_WA", "jobTitle": "Senior Data Scientist - Predictive Enterprise Group", "companyRating": "3.5", "companyInfo": {"Website": "www.neudesic.com", "Headquarters": "Irvine, CA", "Size": "201 to 500 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "130000", "jobDescription": " Neudesic is currently seeking a Senior Data Scientists for all major markets. This role requires the perfect mix of being a brilliant technologist and also a deep appreciation for how technology drives business value. You will have broad and deep technology knowledge and the ability to architect solutions by mapping client business problems to end-to-end technology solutions. Demonstrated ability to engage senior level technology decision makers in data management, real-time analytics, predictive analytics and data visualization is a must. If you have experience with AI, including building ML or DL models on the AWS and/or Azure cloud platforms, we are interested in speaking with you.  To be successful, you must exhibit strong leadership qualities necessary for building trust with clients and our technologists, with the ability to deliver ML/DL projects to successful completion. You will partner with solution architects to drive client success by providing practical guidance based on your years of experience in data management and visualization solutions. You will partner with a diverse sales unit to professionally represent Neudesic experience and ability to drive business results. In addition, you will assist in creating sales assets that clearly communicate our value proposition to technical decision makers. Critical Success Factors for the Role:Deep technical understanding of all things dataAbility to get hands on and not just talk and draw picturesAbility to proactively engage in complex sales pursuits with sales team membersAbility to paint a technology vision and communicate its value to clients and Neudesic teammatesA passion for technology and digital transformationAn innovative mind that is creative and doesn’t follow cookie cutter ideasA disciplined approach to your work life and your craftRequirements:A Bachelor or Masters Degree in a highly quantitative field (Computer Science, Machine Learning, Statistics, Mathematics, etc.) or equivalent experience5+ years of industry experience in predictive modeling, data science and analysisAWS Certified Big Data – Specialty or Microsoft Machine Learning (MSCA) Certification preferredPrevious experience in a ML or data scientist role and a track record of building ML or DL modelsExperience using Python and/or RKnowledge of SparkMLAble to write production level code, which is well-written and explainableExperience with Deep Learning frameworks like MXNet, Caffe 2, Tensorflow, Theano, CNTK, and KerasExperience handling terabyte size datasetsKnowledge and experience of writing and tuning SQLExperience giving data presentationsExcellent written and verbal communication skillsAbility to travel up to 30%.More about our Predictive Enterprise Service Line: The digital business uses data as a competitive differentiator. The explosion of big data, machine learning and cloud computing power creates an opportunity to make a quantum leap forward in business understanding and customer engagement. The availability of massive amounts of information, massive computing power and advancements in artificial intelligence allow the digital business to more accurately predict, plan for and capture opportunity unlike ever before. The predictive enterprise service line the evolution from using data strictly as a reporting mechanism of what’s happened to leveraging the latest in advanced analytics to predict and prescribe future business action. Our services include: Data Management Solutions: We build architectures, policies, practices and procedures that manage the full data lifecycle of an enterprise. We bring internal and exogenous datasets together to formulate new perspectives and drive to data-thinking.Self-Service Data Solutions: We create classic self-service and modern data-blending solutions that enable end-users to enrich pre-authored analytic reports by blending them with additional data sources.Real-Time Analytic Solutions: We build real-time analytics solutions on data-in-motion that eliminate the dependency on stale and static data sets resulting in the ability to immediately query and analyze diverse data sets.Machine Learning Solutions: We build machine-learning solutions that support the most complex decision support systemsNeudesic is an Equal Employment Opportunity Employer All employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law.Apply Now"}