{"jobID": "2801619508", "jobLocation": "Boston_MA", "jobTitle": "Principal Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.mass.gov", "Headquarters": "Boston, MA", "Size": "10000+ employees", "Founded": " 1780", "Type": " Government", "Industry": " Government", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "118000", "jobDescription": " We are looking for a Principal Data Scientist to help us discover the information hidden in Commonwealth’s vast treasure trove of data. As a Principle Data Scientist you will be tasked to use the state’s data to deliver effective and efficient government services and to help us make smarter data-drive public policy decisions, improving the quality of life for all Massachusetts residents. Your primary focus will be to apply data mining techniques, conduct statistical analysis, and build high quality predictive systems that can be integrated throughout the Commonwealth. You will have clear understanding of how your work helps improve the lives of Massachusetts residents, businesses and institutions. At the forefront of big public data analytics and public policy, you’ll find interesting and new challenges every day.  Responsibilities:  The Principal Data Scientist reports to the Data Director to accomplish the following:  • Lead the development of a strategy to solve complex problems across secretariats by applying advanced data-driven solutions composed of predictive modeling, statistical methods and cognitive computing components  • In collaboration with the Data Director, manage team priorities and work plans around automation and business intelligence deliverables  • Enhance data collection procedures to include information relevant to the construction of analytic systems  • Provide expertise and consult on all major data-related or data-intensive initiatives  • Collaborate with research groups within the Commonwealth’s agencies, local government as well as academic institutions.  • Analyze and mine high volumes of complex public data from a variety of data sources (clinical, administrative, social, device, and etc.)  • Supervise and manage team members.  Qualifications  Preferred Knowledge, Skills & Abilities:  • Minimum of six years’ experience with machine learning techniques and algorithms, signal processing, clustering, NPL, sentiment analysis, queuing and MapReduce.  • Minimum of six years’ experience with common data science tools, such as R, Python, Rapidminer, etc.  • Minimum of three years’ experience with data visualization tools, such as D3.js, Tableau, GGplot, Shiny, etc.  • Minimum of eight years’ experience with common data formats, such as SQL, Oracle, XML, JSON, Postgres, CouchDB, etc  • Proficiency in using query languages such as SQL, Hive, Spark, etc.  • Good applied statistics skills, such as distributions, statistical testing, regression, etc.  • Good scripting and programming skills  • Great communication skills  • Data-oriented personality who is intellectually curious and a critical thinker"}