{"jobID": "2816082361", "jobLocation": "Boston_MA", "jobTitle": "Audit & Assurance Intern-Boston-Winter", "companyRating": null, "companyInfo": {"Website": "www.deloitte.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1850", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $10+ billion (USD) per year", "Competitors": " EY, PwC, McKinsey & Company"}, "estimatedSalary": null, "jobDescription": " Position summaryThe internship program provides an introduction to audit. As an intern in Deloitte’s Audit practice, you'll experience the auditing profession from a real-world perspective. You’ll get in-depth exposure to the auditing profession and learn more about the day-to-day responsibilities of an auditor. You’ll receive guidance and work closely with experienced audit professionals, as well as have the opportunity to participate in networking activities. You’ll have exposure to issues shaping and affecting the profession today as well as topics related to your own career development. Your counselor will serve as a vital source of information and advice, offering timely, constructive feedback on your performance.Work you’ll doDuring your internship, you’ll sharpen your analytical skills as you audit client financials, transactions and internal control processes. You’ll work with audit team members and learn how to apply concepts of risk assessment and how to design and perform audit procedures responsive to those risks. You will execute these audit procedures using our cutting-edge audit tools and technologies that use artificial intelligence, advanced analytics, data visualizations and process flow automation to perform data interrogation and analysis of client data.The teamOur team culture is collaborative and encourages team members to take initiative and seek on-the-job learning opportunities. Our audit professionals are committed to excellence and to enhancing the trust of the investing public and capital markets. Quality is our top priority, and by focusing on innovation, we continue to raise the bar on quality and deliver greater value to our clients. Learn more about Deloitte Audit.QualificationsRequired:Pursuing a Bachelor of Science/Business Administration of Science degree in Accounting or related fieldDefinitive plans for meeting minimum requirements for CPA eligibilityStrong academic track record (minimum GPA of 3.0)Demonstrated effective verbal and written communication skillsProven leadership skills demonstrating strong judgment, problem-solving, and decision-making abilitiesProven experience working independently and managing multiple assignments in a dynamic environmentUp to 80% travel requiredPreferred:Master of Science in Accounting or related fieldHow you’ll growOur audit intern learning program provides a view both into the technical skills as well as critical professional behaviors, standards, and mindsets required to make the most of your internship. The program includes a variety of team-based, hands-on exercises and activities, and concludes with building an action plan to apply your learning on your engagement. Beyond the formal learning, you’ll also gain hands-on experience that goes beyond classroom theory. You’ll work with audit team members, get meaningful development feedback, and experience what it’s like to work in the audit profession. Interns will also be invited to participate in an Audit Internship Conference hosted during the summer at Deloitte University. Explore Deloitte University, The Leadership Center.Deloitte’s cultureWe take pride in our culture and celebrate individuals by recognizing their uniqueness. As a commitment to our people, we offer well-being programs and provide our professionals opportunities for support and flexibility to make daily choices that can help them to be healthy, centered, confident, and aware. This supportive culture helps enable our people to do their best work every day. Learn more about Life at Deloitte.Corporate citizenshipDeloitte is led by a purpose: to make an impact that matters. This purpose defines who we are and extends to relationships with our clients, our people and our communities. We drive impact through our signature national programs: education and veterans, and through pro bono and other key programs such as board service opportunities and Impact Day. Learn more about Deloitte’s impact on the world.Recruiter tipsAt Deloitte, we’re about people. To help you feel more prepared and confident, we’ve created a series of articles on different topics such as \"Putting your best foot forward in an interview\", \"What we look for when first meeting candidates\" and \"Forward-thinking questions to pose during your interview\". Check out recruiting tips from Deloitte professionals.As used in this document, “Deloitte” means Deloitte LLP and its subsidiaries. Please see www.deloitte.com/us/about for a detailed description of the legal structure of Deloitte LLP and its subsidiaries. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability or protected veteran status, or any other legally protected basis, in accordance with applicable law. Requisition code: S19BOSAI19JANLM-AU"}