{"jobID": "2830932643", "jobLocation": "Sunnyvale_CA", "jobTitle": "Automation Engineer", "companyRating": "2.9", "companyInfo": {"Website": "www.microfocus.com", "Headquarters": "Newbury, United Kingdom", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (MCRO) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " SAP, EMC, Oracle"}, "estimatedSalary": "100000", "jobDescription": " At Micro Focus, everything we do is based on a simple idea: The fastest way to get results is to build on what you have. Our software solutions enable organizations to do just that. Secure and scalable, with analytics built in, they bridge the gap between existing and emerging ITfast-tracking digital transformations across DevOps, Hybrid IT, Security, and Predictive Analytics. In the race to innovate, Micro Focus customers have the clear advantage.  Our portfolio spans the following areas: DevOps | IT Operations| Cloud | Security | Info Governance | Big Data, Machine Learning, & Analytics Take charge of your future and join our dynamic Digital Center of Excellence as we go to market with a best-in-class portfolio that will help shape the worlds software landscape About the Role The Automation Engineer sets and maintains quality standards for company products through the use of systematic processes. Develops, modifies, and executes software test strategies, plans and suites. Analyzes and writes test standards and procedures. Maintains documentation of test results to assist in debugging and modification of software. Analyzes test results to ensure existing functionality and recommends corrective action. May develop tools and environments to automate test execution. Consults with development engineers in resolution of problems. The Automation EngineerDesigns quality assurance and test processes for portions and subsystems of end-user applications, systems software, and firmware running on hardware, local, networked, and Internet- based platforms.Analyzes design and determines test scripts, coding, automation, and integration activities required based on general objectives and knowledge of overall architecture of product or solution.Writes and executes complete testing plans, protocols, and documentation for assigned portion of application; identifies and debugs, and creates solutions for issues with code and integration into software and firmware architecture.Leads a project team of other software quality assurance engineers and internal and outsourced development partners to develop reliable and cost- effective testing and quality assurance solutions for assigned applications portion or subsystem.Collaborates and communicates with management, internal, and outsourced development partners regarding test status, project progress, and issue resolution.Represents the software quality assurance team for all phases of larger and more-complex development projects.Provides guidance and mentoring to less- experienced staff members.Education and Experience Required:Bachelor's or Master's degree in Computer Science, Information Systems, or equivalent.Typically 4-6 years experienceKnowledge and Skills:Using software quality assurance tools and processes.Software testing methodology, including writing and execution of test plans, debugging, and testing scripts and tools.Strong analytical and problem solving skills.Experience with design for software and firmware running on multiple platform types.Excellent written and verbal communication skills; mastery in English and local language.Ability to effectively communicate product architectures, design proposals and negotiate options at management levels. If you want to be part of what's next and find out more about our available opportunities, visit Micro Focus Careers.  #LI-SD1"}