{"jobID": "2813978354", "jobLocation": "Bronx_NY", "jobTitle": "Deputy Chief Medical Officer (Physician)", "companyRating": null, "companyInfo": {"Website": "www.vacareers.va.gov", "Headquarters": "Washington, DC", "Size": "10000+ employees", "Founded": " 1930", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Deputy Chief Medical Officer (Physician) - NY/NJ VA Health Care Network (VISN 2) consists of 10 Veterans Affairs Medical Centers: Albany, Bath, Bronx, Canandaigua, Northport, Syracuse, VA Hudson Valley Health Care System, VA New Jersey Health Care System, VA New York Harbor Health Care System and the Western New York Health Care System (Buffalo and Batavia) and 59 community based outpatient clinics (CBOCs). VISN 2 serves more than 500,000 veterans in 76 counties in New York, New Jersey and Pennsylvania offering a wide range of comprehensive inpatient and outpatient medical services. Services include primary and specialty care, nursing home care, mental health and rehabilitation services, and domiciliary care. VISN 2 medical centers are affiliated with numerous colleges and universities in New York and New Jersey.VISN 2 is seeking a full time Deputy Chief Medical Officer who will direct VA initiatives and imperatives in Primary Care and Specialty Care across the VA New York New Jersey Health Care Network. The incumbent will, among other responsibilities: · Apply solid health care administration skills and innovation in planning, designing, integrating, networking, implementing, modifying, and facilitating complex clinical and administrative activities to support a High Reliability Network. · Advise the Chief Medical Officer and Network Director on appropriate interventions and challenges. · Identify and analyze situations that cross multiple sites and programs and the full continuum of care to improve coordination of care and insure timely & appropriate access to medical care. · Provide direct support to clinicians in all health care facilities and programs within the VISN in evaluating care delivery models, establishing primary care and community care networks, and implementing evidence-based clinical care practices. · Ensure regulatory compliance and successfully manage allocation of resources.Candidate must meet the requirements for appointment as a physician in VHA. The ideal candidate for this position should be Board Certified and have at least 10 years of successful professional practice, preferable in ambulatory care, five of which have been in positions with progressively more complex leadership assignments. We offer a competitive salary and excellent benefits package.U.S. Citizenship is required. The VA is an EOE M/F/V/HE-mail cover letter and resumes to Fadill.Hodge@va.govPhone (718) 741-4102"}