{"jobID": "2617827854", "jobLocation": "San_Jose_CA", "jobTitle": "Restaurant Manager - San Jose, CA - BA", "companyRating": "3.5", "companyInfo": {"Website": "www.pandacareers.com", "Headquarters": "Rosemead, CA", "Size": "10000+ employees", "Founded": " 1983", "Type": " Company - Private", "Industry": " Restaurants, Bars & Food Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "56000", "jobDescription": "Are you Craving a Career? Ready for Growth? COME SEE WHY PANDA MIGHT BE THE RIGHT PLACE!At Panda, we all share a common mission: \"Deliver exceptional Asian dining experiences by building an organization where people are inspired to better their lives.\" We invest in our people because great people run great operations that will exceed our guests' expectations. Talk to any of our associates and you will experience a culture dedicated to its mission and our five fundamental values- Proactive, Respect/Win-Win, Growth, Great Operations, and Giving. Panda Restaurant Group includes the original Panda Inn fine dining restaurants, Panda Express, our Gourmet Chinese food concept served in a fast casual environment, and Hibachi San, our Japanese grill concept. The family owned and operated company is still run by founders Andrew and Peggy Cherng. Panda offers competitive benefits and rewarding opportunities, from entry-level positions to management. We have restaurant positions available nationwide and support center positions in Rosemead, CA. Come join the nation's largest and fastest growing Asian restaurant company.Our continued growth in this location has created new career opportunities for Management, Crew Members, and Kitchen Team Members!!! Come join us!Restaurant Management Team responsibilities:Lead all or some People aspects of a Panda Express restaurant including hiring, training, coaching, and development Ensure the safety of our Guests and Associates through training and execution of food safety and restaurant safety standards and guidelines Lead all or some Guest components of a Panda Express restaurant including excellent food quality, guest service, associate friendliness, and restaurant cleanliness through your team using proven systems and routines Lead all or some financial areas of a Panda Express restaurant including sales growth, cost management, and profit growth Applies thorough knowledge of all policies, procedures and practices utilized within unit managed Understands ways in which unit relates to and impacts PRG Demonstrates knowledge of PRG operations and objectives Seeks information regarding trends affecting food service industryWe offer our Full-Time Management Team:Progressive Compensation Package and Excellent Bonus Opportunity 5 or more Weeks of Comprehensive Training to prepare you for success On-Going Career & Leadership Development Medical, Dental, and Vision Insurance 401 K with Company Match Paid Time Off and Paid Holidays Associate Discounts (Panda Express, Hibachi San, Panda Inn plus Theme Parks) and free meals when you work Lucrative Associate Referral Bonus Pre-Tax Dependent Care Flexible Spending Account College degree or equivalent experience preferredHigh school or GED requiredAdditional expectations of our Management Team are:Excellent leaders with great people skills Proactive – Sees life as choices and chooses to make a positive impact. People Oriented – enjoys working with our guests and associates, possess good communication and interpersonal skills. Growth Oriented – knows that learning and growth are keys to personal and professional success and is willing and able to share learning with others. Results Oriented – focuses on getting results without compromising guest, people, and financial areas. ADA Statement: While performing duties, counter areas are often hot with steam from steam table and food vapors. Work space is restricted and employees are expected to remain standing for long periods of time. Employees must prepare hot and cold foods, use Chinese cook knife and other kitchen equipment and work quickly without losing accuracy. Employees may be required to lift up to 50 lbs., stand up to four hours and reach across counter tops measured at 36 inches to serve customers. Kitchens are hot and noise levels are usually high; storage space is limited and shelving is high.Panda Restaurant Group, Inc is an Equal Opportunity Employer."}