{"jobID": "2695900892", "jobLocation": "Waltham_MA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "A bit about us:Devoted Health is a new health care company looking to improve the lives of seniors in America. We are guided by a deep belief that every senior should be treated like we would treat a member of our own family: with loving care and a profound commitment to their health and well-being. With aging demographics and rising health costs, this is an industry and problem space that needs todays best talent working on solutions with high integrity and a long term view. We will improve the lives of seniors by helping them navigate the health care system, by utilizing world-class technology and data to enable a simplified experience, by partnering with top providers for better health outcomes. We are building a stellar team to drive towards our starting point goal to launch a Medicare Advantage plan and clinical services in 2019.Why Devoted:Make a difference... a big difference. You will have the opportunity, in a unique and dynamic culture, to be a part of something incredibly meaningful. Were a disruptive startup with an inspiring mission. Learn and grow alongside our world-class team of health care, technology, and data leaders, dedicated to building a health plan and clinical services that care for everyone like they were our own mothers or fathers. Our team and board members have decades of experience in health care entrepreneurship, data, technology, services, and policy. With their support, we look forward to building a health plan and clinical services that will give seniors easy access to the high-quality care they deserve.A bit more about this role:In our mission to take care of every member like they were our own mom or dad, we believe that data is a super power to deliver great service and clinical care. Unleashing the potential in data requires us to responsibly collect data and turn it into actionable insights and data products. The data sources are widely varying and messy. Youll be the data scientist jumping in to unlock the potential and to pave the way for others to do more with data by building ETL processes, technology, tooling, and most of all insights. We strongly believe that data science is a team sport and youll be working collaboratively with teammates across the entire company.We want data science-owners with the judgment to simultaneously solve for short and long-term business value. Were looking for folks who have worked in complex domains and systems, and come through it with some wisdom but most importantly humility. We want people who are passionate about building great technology to solve problems for usersour members, our colleagues, and ourselves.Whether you have a health care background or not, we are excited to learn from and share knowledge with you. Our leadership team includes seasoned alumni of health care and technology organizations spanning the public and private sector. Our co-founders deeply understand and care about good technology: Todd Park co-founded Athenahealth, a multi-billion-dollar health care technology company, and served as CTO of the U.S.; Ed Park was Athenahealth's founding engineer and served as its CTO, COO, and President of Services.Responsibilities will include: Identifying, structuring, and integrating internal and external datasets and processes to unlock the potential of the dataDeveloping tooling and analytical insights to support the effective delivery of health care services and improve outcomes for our membersProposing, scoping, and most of all, *building* innovative new data products that serve our mission to treat every member like familyAttributes to success:Youre a roll up your sleeves and jump right in kind of personYou believe that data science is a team sportYoure fast hands on keys in finding clever solutions to problems and iterating from thereYoure deeply curious about the nuances of a data set and what what you can unlock from the dataDesired skills and experience:Experience working with diverse and messy data sets. These data sets involve text, GIS, clinical data, and other typesExperience working with python, open source packages, Amazon Redshift (and/or Postgresql), and ways to visualize data through open source technologiesExperience with the full data science stack, from standing up infrastructure and building pipelines to generating insights and telling a story from dataComfort with communicating about data and technical analyses to non-technical audiencesIf you love running towards complex challenges and transforming them into solutions, if you want to make a potentially huge impact on many lives, and if you are looking for a disruptive startup with an inspiring and talented team, Devoted Health may be the place for you."}