{"jobID": "2823134544", "jobLocation": "New_York_NY", "jobTitle": "Compensation Specialist", "companyRating": null, "companyInfo": {"Website": "www.gny.com", "Headquarters": "New York, NY", "Size": "201 to 500 employees", "Founded": " 1914", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Travelers, Chubb, Crum & Forster"}, "estimatedSalary": null, "jobDescription": "Job DetailsLevel ExperiencedJob Location New York (Home Office) - New York, NYPosition Type ContractorEducation Level 4 Year DegreeJob Shift DayJob Category Human ResourcesDescriptionGreater New York Mutual Insurance Company (\"GNY\") is an A+ rated, financially stable and growing property casualty insurance company with locations throughout the Northeast. We are currently seeking a driven and diligent compensation professional for a long term project. In this role, he or she will implement salary grades and bonus plan structures.  Key Duties and Responsibilities: Serves as a strategic partner in providing analysis, expertise, and consultative services to human resources as well as managers in developing job analysis, job descriptions, and determining appropriate compensation (salary/bonus) for positions.Develops compensation programs and solutions that align with corporate values, goals, objectives, initiatives, and strategy.Evaluates present programs through market research, surveys/benchmarking, and analysis of trends to ensure plans are competitive and current.Monitors compensation trends and pro-actively identifies and addresses compensation issues.Ensures integrity of salary grading systems, including job descriptions, pay bands, and incentive plans.Manages the design, development and communication of approved variable pay plans.Educates managers on compensation-related topics including job evaluation processes and tools.Prepares proposals and recommendations for revisions and improvements to current practices.Leverages technological capabilities as it relates to compensation systems and processes.Performs other duties as required.QualificationsBachelor's degree6+ years of progressive Compensation experience or relevant general HR experienceCertified Compensation Professional (CCP) A+Expert skills in Excel with writing complex formulas and creating graphsExperience with HRIS systems (reporting, maintenance, etc.)Detailed oriented with strong analytical skills with the ability to analyze data and create meaningful, understandable models, reports and metricsAbility to develop concise presentations to illustrate and communicate related informationDemonstrated ability to work independently and within a team, conduct research, formulate conclusions and present conclusions regarding business issuesStrong communication skills with a customer service approachKnowledge of HR laws (i.e. FLSA) and business acumen Apply Now!"}