{"jobID": "2829219535", "jobLocation": "Los_Angeles_CA", "jobTitle": "Media Analytics Intern", "companyRating": null, "companyInfo": {"Website": "www.hylinkgroup.com", "Headquarters": "Beijing, China", "Size": "1001 to 5000 employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Be part of a rapidly-expanding advertising agency with a global reach!Hylink is the largest, independently owned digital advertising and media agency in China.As a Media Analyst intern, you will use your analytical mindset and knowledge of the industry to provide insights and promote client satisfaction through the media networks. As an analyst, you will study trends in social media, research popular media platforms, study emerging media tools and observe how often those platforms and tools are used. You will help boost the online presence of our clients by interpreting media performance and optimizing media strategies.You will evangelize new Hylink products and technologies throughout the agency, and develop and manage strong relationships with internal agency influencers and decision-makers, driving scalable product adoption and growth across the broader portfolio of accounts.You will learn the skills necessary to succeed in advertising, as well as understand emerging business models as they happen. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grows. You will be involved with a team of fast-paced, multitasking high-achievers. Covering training across programmatic, digital, industry analysis, and client service, you will develop influential, relationship-building skills, learn to provide Hylink-caliber client service, and fully grasp research and market analysis.You will anticipate how decisions are made, and persistently explore and uncover the business needs of Hylink's key partners and objectives. Your responsibilities include, but are not limited to:Responsibilities Coordinate day-to-day, as well as long-term schedules of key agency managementAssist in compiling weekly, monthly, and quarterly reports for clientsAnalyze data performance and articulate findings to Account ManagersUse reporting tools to extract data and consistently monitor/evaluate performanceQualificationsMust currently be involved in a Bachelors, Masters, or Associates degree program, preferably focused on Business Administration, Analytics, Computer Science, Statistics, or related fields.Excellent communication, organization, and problem-solving skills.Must be able to work independently and on a team.Advanced Proficiency in Microsoft ExcelKnowledge of Google Analytics, Adwords, and other reporting tools and softwareStrong presentation and analytical skillsAt Hylink, we believe that smart thinking equals endless possibilities. Over the past two decades, we have grown to a team of 2,400 digitally minded-professionals worldwide, earning our reputation as the number one media buyer in China. Our objective is simple: to leverage our decades of experience to help brands navigate the intricate spectrum of Chinese advertising.Hylink is called upon by industry leaders across tech, beauty, travel, and FMCG to provide an insiders perspective into digital China, consistently staying ahead of industry trends to deploy innovative strategies within a crowded market. We pride ourselves on pooling together the talents of a highly diverse workforce; our team is comprised of professionals from every corner of the earth, with experience within dozens of sectors."}