{"jobID": "2702138316", "jobLocation": "Seattle_WA", "jobTitle": "Senior Data Scientist, Machine Learning", "companyRating": "3.9", "companyInfo": {"Website": "www.extrahop.com", "Headquarters": "Seattle, WA", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Riverbed Technology, CA Technologies, Compuware"}, "estimatedSalary": "137000", "jobDescription": " The ExtraHop platform is a novel approach to processing vast amounts of wire data in real-time. Want to join a collaborative team that builds solutions which provide deep performance insights, behavioral security analyses, and drive business analytics? Keep reading. Big Data, the cloud, elastic computing, SaaS, AWS, BYOD, HPC, SDNwe do it all. The solutions we build at ExtraHop are transforming the IT industry. From retail websites and point-of-sale systems to financial services and the healthcare industry, ExtraHop helps modern businesses handle the growing demands on their applications and infrastructures.  Were growing fast and were looking for people who love to build things: products, companies, markets, and their careers! Come contribute and build with one of the best teams in the industry.  This role will work on our Analytics team and with ExtraHops Atlas service, which monitors over 600,000 devices that process over 2.7 petabytes a day. The Analytics team will drive projects to increase value of our real-time application performance metrics. This team will partner with the Product and Operations teams to identify actionable insights into network issues, application performance, and business analytics. Were looking for passionate engineers that want to build the next-generation analytics feature at ExtraHop. Duties & ResponsibilitiesWork in across-functional team to research and build rich analytics into the ExtraHop system: investigate customer operation challenges, frame and structure questions, collect and analyze data, as well as summarize and present key insights in support of decision-makingDemonstrate and share your passion and understanding of data scienceBuild analytics tools to develop actionable insights using the ExtraHop systemContribute in all phases of development starting from the design proof of concept to laying down the scalable production codeRequired Skills & ExperienceA degree in Statistics, Computer Science, Physical Sciences or a related technical fieldA strong track record of performing data analysis using Python (numpy, pandas, scikit-learn, etc.) or equivalent language and SQLAt least 5 years experience using statistics and analytics to solve complex problemsVersatility and willingness to learn new technologies on the jobAbility to write production-quality code utilizing knowledge of data structures and algorithms with Python or related programming languagesDesired Skills & ExperienceUnderstanding of common software development practices around design, coding, and testing a large codebase About ExtraHop"}