{"jobID": "2808159068", "jobLocation": "New_York_NY", "jobTitle": "Senior Software Developer - PHP & PostgreSQL framework", "companyRating": null, "companyInfo": {"Website": "www.networkninja.com", "Headquarters": "Chicago, IL", "Size": "1 to 50 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Fully remote software firm seeks motivated, experienced nerd to join our crew of Object-Oriented PHP developers.You've got OOP PHP skills with RDBMS (we use PostgreSQL) experience, a background working with open-source frameworks in a team environment, and experience deploying applications on Linux systems. You're enthusiastic about software development, and would love to immerse yourself in a mature, custom PHP architecture.As a Senior Software Developer, you'll work from your own remote office with a tight team of coders spread across the country, leveraging your deep PHP knowledge to improve and extend our case management framework. Along the way, your talented, friendly, and eager-to-help colleagues will teach you a lot - and would love to learn from you as well.You'll join a dynamic team that's into things like running marathons, biking up mountains, rock climbing, brewing beer, traveling obsessively, playing video games, and of course, building great software. Network Ninja is a place you can be yourself and let your talents shine.RequirementsExperience working on sophisticated software implementations.Minimum 4 years dev experience, 2 years of PHP Object-Oriented Programming experience. OOP experience on a large site/application is required.Diverse knowledge of RDBMS (PostgreSQL, MySQL, etc.).Experience developing code through multiple Linux lifecycle environments (Development, Staging, Production sites).Working knowledge of HTML, CSS, JavaScript and AJAX.Experience with a version control system (preferably Subversion and/or Git).Previous experience working on a development team.Great written, verbal, and interpersonal skills.Strong organizational skills.Bonus PointsAWS (ec2, rds, s3, and really really great if you have experience with auto-scaling!).An eye for UX."}