{"jobID": "2795138118", "jobLocation": "San_Francisco_CA", "jobTitle": "Drug Discovery Data Scientist (NCI)", "companyRating": "3.3", "companyInfo": {"Website": "www.leidos.com", "Headquarters": "Reston, VA", "Size": "10000+ employees", "Founded": " 1969", "Type": " Company - Public (LDOS) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "126000", "jobDescription": "Description:PROGRAM DESCRIPTION The mission of the Biomedical Informatics and Data Science Directorate (BIDS) is to leverage leading-edge data science and information technology skills and capabilities to provide the best tools and services to accelerate translation of biomedical data to scientific discoveries, medical treatments, and diagnostic and prevention tools for cancer and AIDS patients.  The BIDS Strategic and Data Science Initiatives Group has a focus to establish new collaborations in computing and data science to address cancer challenges and accelerate cancer research. The groups efforts include developing the capacity within the NCI intramural research community to increasingly employ high-performance computing, as well as establishing a longer-term direction and path forward for broader NCI, academic, government, and private industry participation in predictive oncology.  The Accelerating Therapeutics for Opportunities in Medicine (ATOM) Consortium is a public-private partnership with the mission of transforming drug discovery by accelerating the development of more effective therapies for patients. ATOM founding members are GSK, Lawrence Livermore National Laboratory, Frederick National Laboratory, and the University of California, San Francisco. The ATOM consortium members will develop, test, and validate a multidisciplinary approach to drug discovery in which modern science, technology and engineering, supercomputing simulations, data science, and artificial intelligence are highly integrated into a single drug-discovery platform that can ultimately be shared with the drug development community at large. Frederick National Laboratory is hiring a Senior Drug Discovery Data Scientist to work in computationally-driven cancer drug discovery as part of the ATOM Consortium. This position is based in San Francisco, California.KEY ROLES/RESPONSIBILITIESDrug Discovery Data Scientist will:Use and/or develop machine learning packages to train, deploy and interpret various algorithms such as random forests and deep neural networksDevelop and implement methods to assess the predictivity and uncertainty of such modelsBe able to work independently as part of a multi-disciplinary team to support the ATOM Consortium scientific and technical goalsCreate and maintain strong professional relationships with all ATOM stakeholdersFoster and nurture collaborative work environmentQualifications:BASIC QUALIFICATIONSTo be considered for this position, you must minimally meet the knowledge, skills, and abilities listed below:Possession of a Masters degree in a related discipline from an accredited college or university according to the Council for Higher Education Accreditation. (Additional qualifying experience may be substituted for the required education). Foreign degrees must be evaluated for U.S. equivalency.In addition to the educational requirements, a minimum of eight (8) years of progressively responsible job-related experience including three (3) years of experience in a leadership capacityExperience in data-driven modeling requiredFamiliarity with large datasets, handling of biomedical datasets and understanding of data analysis workflows is requiredProficiency with Python or similar programming language(s)Must be able to obtain and maintain a security clearancePREFERRED QUALIFICATIONSCandidates with these desired skills will be given preferential consideration:Experience with Tensor Flow, Keras or similar deep learning packagesExperience with active learningExperience with complex chemical and/or biological data setsExperience with collaborative programming projectsFamiliarity with drug discovery and/or cancer biologyExpected Competencies:Analytical approach to defining scientific questions/design of scientifically testable hypothesesMust be detail-oriented and possess strong organizational and analytical skills with the ability to prioritize multiple tasks/projectsExceptional written and oral communication skillsLeidos Overview: Leidos is a global science and technology solutions leader working to solve the worlds toughest challenges in the defense, intelligence, homeland security, civil, and health markets. The companys 33,000 employees support vital missions for government and commercial customers. Headquartered in Reston, Virginia, Leidos reported pro forma annual revenues of approximately $10 billion for the fiscal year ended January 1, 2016 after giving effect to the recently completed combination of Leidos with Lockheed Martin's Information Systems & Global Solutions business (IS&GS;). For more information, visit www.Leidos.com. The companys diverse employees support vital missions for government and commercial customers. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status. Leidos will consider qualified applicants with criminal histories for employment in accordance with relevant Laws. Leidos is an equal opportunity employer/disability/vet."}