{"jobID": "2719850805", "jobLocation": "New_York_NY", "jobTitle": "Delivery Lead", "companyRating": null, "companyInfo": {"Website": "www.asynchrony.com", "Headquarters": "Saint Louis, MO", "Size": "201 to 500 employees", "Founded": " 1999", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Requirements/Job Duties:WWT Asynchrony Labs has an opportunity available for a Delivery Lead. Delivery Lead is a leadership role working with Asynchrony software delivery teams that is focused on delivery assurance. This role is responsible for managing customer expectations, the flow of work to customers, assuring delivery of value, and ensuring wide open lines of communication with the customer. We are looking for a person who can provide coordination and customer engagement in a way that respects our self-organized culture while at the same time ensuring consistent delivery and a high functioning team.Qualifications:Responsibilities:Lead and coordinate single and multiple team engagements sometimes engaging with multiple delivery leadsEnsure fast, smooth delivery of value through the value streamApproach projects with the strategic goals as a focus of the deliveryActively and purposefully engage the customer throughout the delivery lifecycleGather meaningful and effective feedbackServe as the main point of contact for the customerManage budgets and forecastsManage customer expectationsManage team's fitness for purpose and health, and recommend staffing changesHelp teams organize themselves for optimal delivery outcomesFoster a culture of continuous improvementFacilitate our \"idea to outcome\" approach while creating a fun environmentRequired Background:Experience working with servant-leading Agile delivery teams and a commitment to servant leadership and self-organizationEstablished background in successfully leading Agile software development teams in consistent, effective delivery of projectsExperience at Manager/Director level in an Agile software delivery environmentUnderstanding and commitment to Agile values, principles, and practicesDemonstrated ability in helping Agile teams quantifiably improve toward fitness for purpose World Wide Technology, Inc. offers excellent benefits and competitive compensation. Visit our company web page at www.wwt.com for more information.  Equal Opportunity Employer Minorities/Women/Veterans/Disabled"}