{"jobID": "1623207802", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.talkdesk.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "53000", "jobDescription": " Together at Talkdesk, were building a future of brilliant customer interactions. We have the cleverness, curiosity, and grit to make us a team of customer heroes: thinkers, achievers, and dreamers who believe that our world-class SaaS platform can influence a new kind of customer interaction.  Talkdesk started from a hackathon win and within five years has become one of the fastest growing companies in the world, a Forbes Next Billion Dollar Startup, and has enabled 100,000,000+ customer interactions using our platform. With backing from DFJ, Salesforce Ventures, and Storm Ventures, and supported by the successes of our 1,200+ customers from DoorDash, Box, Betterment to Shopify, Talkdesk is disrupting a $22 billion stagnant market.  Were now looking for the new members of the Talkdesk family - those ambitious, driven, and collaborative individuals who thrive in a fast-paced environment and will push us to do even greater things together. If you are a world-class Data Analyst and would like to help us shape the future of Talkdesk, come along with us on our journey - your dream job is waiting! ResponsibilitiesChampion the use and application of data and analytics across the companyPartner with different departments (e.g. Sales, Success, Marketing, Business Operations, Product, etc.) to produce insights as an internal data consultantIdentify strategic opportunities, areas of improvement, and best practices within the team and across the organizationDesign clever data models that balance the diverse, specific needs of various business stakeholders with general principles of flexibility and extensibilityCollaborate with Engineering to collect and process data, develop business tools, and enable new insightsEstablish data governance by setting standards for the consistent definition and application of metricsRequirements2 or more years of experience in a Data Insights, Data Analytics, Data Science or Business Analytics roleProficiency in SQL (Postgres preferred, but not required)Formidable Excel or R skillsExperience with business intelligence tools (e.g. Looker, Tableau)Expertise with statistical analyses and concepts (e.g. regressions, experiment design, etc.)Background in handling very large (1TB+) data sets (optional, but highly preferred)Strategically-minded yet detail-orientedExcellent interpersonal communication and presentation skillsBA/BS degree in a related field (Computer Science, Math, Statistics, Engineering)The Talkdesk story hinges on empathy and acceptance. It is the shared goal among all Talkdeskers to empower a new kind of customer hero through our innovative software solution, and we firmly believe that the best path to success for our mission is inclusivity, diversity, and genuine acceptance. To that end, we will hire, promote, work along, cheer for, bond with, and warmly welcome into the Talkdesk family all persons without regard to ethnic and racial identity, indigenous heritage, national origin, religion, gender, gender identity, gender expression, sexual orientation, age, disability, marital status, veteran status, genetic information, or any other legally protected status."}