{"jobID": "2677952756", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist, Marketing", "companyRating": "3.5", "companyInfo": {"Website": "www.rallyhealth.com", "Headquarters": "Washington, DC", "Size": "201 to 500 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "168000", "jobDescription": "Data Scientist- Marketing The Marketing Data Scientist will collaborate with Rally marketing and the leadership teams to drive useful insights and improve marketing effectiveness through KPI development, experimentation, exploratory research, day-to-day data support, and acting as a data subject matter expert in marketing domain. The data scientist will also empower the marketing team to improve and develop machine learning driven customized communications in partnership with other data scientists and engineering teams. You:Passionate about marketingHave a demonstrated track record of solving business problems with a wide variety of data science tools in a fast-paced, agile environmentAble to QA and then vouch for the integrity of our data outputGreat at translating business requirements to minimal viable data action plans with clearly defined goals and success criteriaGreat at communicating insights to non-technical colleaguesRequirements:2+ years direct work experience as a data scientist or analyst in marketingDemonstrated experience with marketing analytics skills (campaign measurement, forecast and attribution, A/B/Multivariate testing, etc.); you know when a bar chart is good enough and when it’s notStrong SQL skill. Intermediate knowledge in Python or RExperience with email campaign operations is strongly preferredUnderstand web analytics best practices. Proficient in at least one web analytics tool, e.g. Google AnalyticsNice to Have:Proficient in TableauExperience with Salesforce and ExactTargetExperience using machine learning techniques to solve business problemsExperience in big data environment, like Hadoop or SparkAdvanced degrees in marketing or a quantitative fieldHealthcare or wellness specific business knowledgeRally Health is committed to ensuring that its workforce reflects America’s diverse population. Rally Health knows that such diversity will enrich us with the talent, energy, perspective and inspiration it needs to achieve its mission. Rally Health believes in a policy of equal employment and opportunity for all people based on merit and commitment to the principles of diversity. It is our policy to recruit, hire, train, and promote individuals in all job titles, and administer all programs, without regard to race, color, religion, national origin or ancestry, citizenship, sex, age, marital status, pregnancy, child birth or related medical conditions, personal appearance, sexual orientation, gender identity or expression, family responsibilities, genetic information, disability, matriculation, political affiliation, veteran status, union affiliation, or any other category protected by applicable federal, state or local laws.  Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records"}