{"jobID": "2810303803", "jobLocation": "Oakland_CA", "jobTitle": "Research Intern - Education", "companyRating": null, "companyInfo": {"Website": "www.impaqint.com", "Headquarters": "Columbia, MD", "Size": "201 to 500 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Careers Center | Research Intern - Education  Welcome page  Returning Candidate?  Log back in! Research Intern - Education Job Location: US-DC | US-CA-Oakland ID 2038 Overview  The Student Research Intern will support the education division research team to conduct proposal writing and project work through literature searches, evaluation design, measurement selection and development, quantitative and qualitative analyses, and document preparation.  Applicants must be currently authorized to work in the U.S. on a full-time basis. Employment-based visa sponsorship (including H-1B sponsorship) is not available for this position. ResponsibilitiesAssist with finding, writing, and editing proposals.Prepare presentation-quality charts and tables to include in project reports.Conduct qualitative and quantitative data cleaning and data analysis.Review professional publications from various sources to extract and summarize information relevant to assigned project and proposal work.Qualifications Education, Knowledge and Experience Grant- or contract-funded research/program evaluation experience requiredExpertise with Microsoft Office Suite requiredExperience with research/evaluation proposal preparation preferredEducation content knowledge preferredKnowledge of quantitative data analysis using SAS, STATA, and/or database applications preferredKnowledge of qualitative data analysis with NVivo preferredSkillsExcellent oral and written communication skillsStrong organizational skillAble to learn quickly, take direction, and work independentlyUse creative, collaborative, and consultative approaches to resolve issues Options  Apply  Share  Refer this job to a friendRefer  Sorry the Share function is not working properly at this moment. Please refresh the page and try again later.  Share on your newsfeed  Connect With Us!  Not ready to apply? Connect with us for general consideration.  Please note, your application will not be submitted for this position if you close your browser before completing each section  Application FAQs  Software Powered by iCIMS ************"}