{"jobID": "2767552775", "jobLocation": "Santa_Clara_CA", "jobTitle": "Technical VP for IaaS", "companyRating": "3.3", "companyInfo": {"Website": "www.huawei.com", "Headquarters": "Shenzhen, China", "Size": "10000+ employees", "Founded": " 1987", "Type": " Company - Private", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " Ericsson-Worldwide, Cisco Systems, Apple"}, "estimatedSalary": "204000", "jobDescription": "Huawei is a leading global information and communications technology (ICT) solutions provider. Through our dedication to customer-centric innovation and strong partnerships, we have established end-to-end advantages in telecom networks, devices and cloud computing. We are committed to creating maximum value for telecom operators, enterprises and consumers by providing competitive solutions and services. Our products and solutions have been deployed in over 170 countries, serving more than one third of the world’s population. Huawei has over 180,000 employees, approximately 80,000 of which are engaged in Research & development. Huawei operates a global network of 12 regional headquarters, 14 R&D; Centers, 36 Innovation Centers jointly operated with customers, and 45 Training Centers. Huawei is leading the way by rethinking the future. From devices to telecom infrastructure to cloud computing and convergence solutions, we are rethinking every link in the chain with ICT based innovation to deliver a better future...faster. Technical VP for IaaS Location: Santa Clara, CA (R&D;) Req #: 9496 # of Openings: 1 DescriptionJob Responsibilities Architect the end to end IaaS for Huawei, including key services and features, and operation and maintenance tools and so on.  Develop the technology plan of IaaS service which covers 5 to 10 years, especially identify the key technology, related technology and/or platform roadmap to support the business and product strategy. The technology plan is used to assure Huawei Cloud related solution to keep the continuously industry-leading competitiveness, and used to guide the R&D; team research and development strategy.  Mentor engineering teams and infrastructure team through formal and informal discussions, design reviews, technical presentations, or as a consultant on projects.  Communicate with global customers about Huawei-defined concepts and the unique value of Huawei's cloud IaaS services. Job Qualifications Mandatory:  At least 10 years' experience in designing and developing IaaS-related products or services.  Possessing a unique insight into cloud IaaS service markets and technology evolution  Proven track-record of leading the design and development of IaaS services for data centers  Quick learner with an in-depth knowledge of technology planning, system analysis, and system design  Desired:  Self-motivated, able to quickly and accurately ascertain risks and form responses, as well as an ability to think proactively, work under pressure, and solve problems independently  Great team player with good written and oral communication skillsHuawei Inc. is proud to be an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Why work for us?In 2017, Huawei's revenue reached CNY600 billion (US$92 billion based on the year-end exchange rate), an increase of 15% (YOY)We invest in engineering and innovation - 80,000+ of our 180,000+ global employees work in R&D;, and we invest roughly 10% of our annual revenue in to R&D.; U.S. R&D; efforts are carried out by Futurewei Technologies, Inc.Futurewei’s commitment to R&D; is a major reason why Huawei holds one of the largest patent portfolio’s in the world: Since 2008, Huawei has been a top five international patent filer, per the World Intellectual Property Organization.We support green energy - Lowered CO2 emissions by 13,000 tons via Huawei’s green packaging solutionsFuturewei works with leading universities to further R&D; efforts, investing more than $10million USD each year to support programs at Harvard, MIT, Stanford and Yale, among others. Are you a returning applicant?Previous Applicants:Email:Password: If you do not remember your password click here. Back to Search Results New SearchCopyright © Huawei Technologies Co., Ltd. 1998-2017. All rights reserved."}