{"jobID": "2823778993", "jobLocation": "Seattle_WA", "jobTitle": "Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.charliesproduce.com", "Headquarters": "Seattle, WA", "Size": "1001 to 5000 employees", "Founded": " 1978", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Duck Delivery Produce, Sysco, Pacific Coast Fruit Company"}, "estimatedSalary": "68000", "jobDescription": " Charlie's Produce is a privately owned wholesale produce company. We are the largest privately owned produce wholesaler on the West Coast, with distribution centers in Seattle, Spokane, Portland, Anchorage, Los Angeles and Boise.  The secret to our 35 + years of success in this industry is PEOPLE! We strive to hire the best and we reward them with a working environment that fosters loyalty, stability, innovation, and growth. Charlie's provides a healthy employee stock ownership program, competitive Medical/Dental/Vision and Life Insurance plans. And our newest benefit offers Pre-Paid Fully Funded College Tuition to our employees and the dependent children of our employees!  The data analyst will integrate data from numerous sources and make sense of it by conducting data manipulation, cleaning it and analyzing it. The analysis and reccomendations will enable internal departments, managerment and cross-functional leaders to make decisions that optimize product quality and mitigate food safety risk across the value chain. The position will be a member of the corporate Operations team, and will collaborate IT, Sales, Operations, Finance and Purchasing. Essential Duties:Extracts data from various databases; performs exploratory data analysis, cleanses, massages, and aggregates dataParticipates in discussions with business partners to define business question and to consultPromotes and advocates for value of analytics and data among peersCommunicates recommendations to team and project managers. Contributes to cross-functional team discussions. Assists in creating and developing structured presentations which detail project scope, analyses and recommendations.Creates robust and detailed modeling with minimal guidance. Accesses creative information sources to gather data.Manages individual workload for assigned portion of projects, meeting expectations for quality and timelinesEducation: BA/BS with concentration in quantitative discipline Data Analytics, Statistics, Math, Comp Science, Informatics preferredStrong attention to detailExposure and business-applicable experience in several Modeling & Machine Learning Techniques (regression, tree models, survival analysis, cluster analysis, forecasting, anomaly detection, association rules, etc.)Exposure and business-applicable experience in several data ETL (Teradata, Oracle, SQL, Python, Java, Ruby, Pig)Exposure and business-applicable experience in several analytic languages (R, SAS, SPSS, Stata)Advanced skills in data visualization technology (Tableau and Power BI)Advanced skills in Microsoft Excel and PowerPointAbility to positively contribute in a cross-functional team environment"}