{"jobID": "2629081159", "jobLocation": "San_Francisco_CA", "jobTitle": "Superintendent- Concrete Division", "companyRating": null, "companyInfo": {"Website": "www.webcor.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 1971", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Pankow Builders, Hathaway Dinwiddie Construction"}, "estimatedSalary": null, "jobDescription": " Superintendent- Concrete Division Location  CA-San Francisco Department  118-No CA Concrete Proj & Est Employment Duration  Full timeApply NowWho We Are: Webcor employs people of integrity and passion to build diverse, high-profile, and innovative structures for our clients. Webcor was founded in San Francisco in 1971. We are still headquartered in San Francisco and are committed to growing throughout California (and beyond). Through career development and employee-specific rotation plans, we foster collaboration across our construction management divisions (Core & Shell and Special Projects) and self-perform groups (Concrete, Interior Construction Group, and Paramount Drywall). We provide craft professionals, experienced professionals, and new graduates with financial, health, and wellness benefits that encourage and reward individual contribution. Why Join Us?We love to build for both public and private owners. We don’t shy away from what we have never done before.We are deeply connected to continuous improvement. We welcome better ways of doing things.The U.S. GREEN BUILDING COUNCIL has recognized us with multiple LEED PLATINUM awards for our commitment to sustainable design, communities, and construction.Career tracks are clear and we encourage employee mobility and development.We pay an average of over 85% of the cost of medical benefits for employees and their families. We cover the total cost of dental, vision, life, and disability insurance. We offer a generous 401(k) match. And we offer a range of other benefits, from a wellness program to legal assistance.What You’ll Do: As a Superintendent, you’ll work with a team of skilled, innovative thinkers and doers you can trust, rely on, and enjoy being around. You will: Manage the day-to-day field operations of assigned project(s) including planning, coordinating, and sequencing work’ materials procurement; and supervising subcontractors and vendors to ensure work is completed on time and within budget while adhering to Webcor’s high quality standards.Promote safety and site cleanliness on the jobsite and implement, enforce, and effectively manage Webcor’s safety policy and procedures.Manage and publish subcontractors’ schedule on a weekly basis and review at the subcontractor meeting. Effectively measure quality and craftsmanship.Ensure required inspections are scheduled, coordinated, performed, tracked, and closed out.What You Need to Succeed:Bachelor’s degree (preferably in Construction Management) or equivalent experience.Minimum eight years of increasingly responsible construction experience in a trade or trades, to include at least two years as a foreman or four years as an assistant superintendent.Ability to effectively manage problem prevention strategies to limit reactionary practices.You love communicating! You are also a born leader and enjoy creative problem-solving.You are authentic and are known for going above and beyond what is asked of you.Intermediate to advanced computer skills with the ability to use MS Office with proficiency (Word, Excel, Outlook, Project, and PowerPoint).The Legal Stuff: Webcor is AN EQUAL OPPORTUNITY EMPLOYER. Performance of the required duties will require physical ability to climb permanent and temporary stairs, passenger use of construction personnel hoists, ability to climb ladders and negotiate work areas under construction. Specific vision abilities required by this job include close vision, peripheral vision, depth perception, and the ability to adjust focus. Performing this job requires use of hands to finger, handle, or feel objects, tools or controls, sit, talk, hear, stand, climb, balance, stoop, kneel, crouch, or crawl. While performing the duties of this job, the employee regularly works on-site at the construction work site where the employee is exposed to moving mechanical parts; high precarious places; fumes or airborne particles; outside weather conditions; and risk of electrical shock. The noise in these work environments is usually moderate to very loud.  #Priority"}