{"jobID": "2699453943", "jobLocation": "New_York_NY", "jobTitle": "Senior Analyst, Business Analytics", "companyRating": null, "companyInfo": {"Website": "www.vnsny.org", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1893", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Overview Visiting Nurse Service of New York (VNSNY) is the nations largest not-for-profit community-based health system. VNSNY provides a comprehensive array of home- and community-based programs, including health plans, tailored to the needs of high-risk, vulnerable New Yorkers, improving their quality of life. Each day,more than 18,000 VNSNY employees including nurses, rehabilitation therapists, social workers, dieticians, other allied professionals, and paraprofessionals deliver compassionate care, unparalleled medical expertise, and 24/7 solutions and resources tomore than35,000 patients, helping them to live the best lives possible. Responsibilities Produces analytics dashboards, and other reporting and data analyses for VNSNY Hospice. Collaborates with various internal teams to understand and document requirements for analytics, interpret data, standardize definitions for reported metrics, and produce narratives on major insights from data. Activities include, but are not limited to, designing analytical approaches, developing new measures, data collection and analysis, report writing and production, tracking project activities and tasks, and helping to ensure the overall success of the program. Works under general supervision. Education: Bachelor's Degree in Computer Science, Information Systems, Clinical Informatics, Mathematics, Statistics or related discipline required. Masters or SAS Certification a plus. Experience: Minimum of three years of progressive experience in business intelligence, analytics, or financial analysis required. Fluency with advanced Excel functions, including lookups, sumifs, pivot tables and macros, required. Advanced SQL skills required. Demonstrated understanding of statistics and hypothesis testing with solid statistical programming skills (SAS, R, and Excel) required. Hands-on experience with Business Intelligence tools such as SAS, Tableau, Hyperion Smart View etc. required. Exceptional critical thinking, creative problem solving, communication and client service skills required. Proficiency using all MS Office applications, including PowerPoint, Excel and Visio required. CA2018"}