{"jobID": "2821185249", "jobLocation": "Redwood_City_CA", "jobTitle": "Branch Manager - Float (Peninsula)", "companyRating": "4.1", "companyInfo": {"Website": "www.providentcu.org", "Headquarters": "Redwood City, CA", "Size": "201 to 500 employees", "Founded": " 1950", "Type": " Nonprofit Organization", "Industry": " Finance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Patelco Credit Union, Golden 1 Credit Union, San Mateo Credit Union"}, "estimatedSalary": "65000", "jobDescription": "Are you ready to take the next step in your banking career? Do you like being on the go and meeting new people? We invite you to join our talented team of branch operations and service leaders while filling in at locations throughout the Peninsula Bay Area.  What is a Floating Branch Manager (BM)? We’re glad you asked! Our floating BMs are full-time managers (receiving our generous and full benefits package) who have the opportunity to be introduced to the many locations and communities Provident serves. They travel to branches to pitch in and lead where and when needed. They may be called upon to handle cash, interact with members (we have members, not customers because we are a credit union, not a bank!), manage operations or coach and share their sales and service knowledge with staff. It could all be in a day’s work. This position is the first step in your management career with Provident. It is also an ideal way to take us for a test drive and determine a branch fit for you. If you welcome the opportunity to be in a different place every few days, weeks or months (at least during your initial time period with us), Provident could be the perfect fit for you as you progress in your banking career!  This float position will primarily provide coverage for the Peninsula (San Francisco to Los Gatos) branches, but may cover other branches on occasion.  We have 18 Bay Area branches from San Francisco (two locations) to San Jose (two locations) and points in between on the Peninsula (Daly City, Millbrae, San Mateo, Belmont, Redwood Shores, Palo Alto, Sunnyvale, Los Gatos) and in the East Bay (Hayward, Oakland, San Ramon, Dublin, Alameda and Walnut Creek). Of course we will do our best to match our needs with where you reside whenever we can. We’ll talk to you more about how it would work when we meet! To be successful you will:Have a laser-like focus on sales, service and revenue goalsExcel at finding new ways to bring in deposits and loansBe a hands-on manager that knows how to keep branch operations running smoothlyEnjoy sharing your knowledge and sales and service skills with your teamKnow when things don’t look right and how to minimize branch risk exposureKnow the rules and ensure compliance with regulations and policiesMotivate and help build an energized, successful branch teamHere’s what you will bring:College degree or equivalent financial services experienceAt least one year of management and/or supervisory experienceNotary license or the ability to obtain a Notary license within 90 days of hire dateAbility to travel to any of the 17 Bay Area branchesThe position demands maturity, flexibility, prior banking experience and someone ready to contribute at a high level -- and the rewards come with it.Fully paid health insurance premiumsQuality medical, dental and vision care coverage401(k) retirement plan with matching employer contributionsStrong commitment to investing in your career and educational advancement by offering up to 100% tuition reimbursement for approved coursesIncentive planGenerous paid time off and paid holidaysFlexible spending accountsShort and long-term disability coverageLife and AD&D; insuranceProvident membershipRate discount on home and auto loansIn-house trainingAnd much more! If this sounds like you, apply now! We want to meet you! Provident is an Equal Opportunity Employer We are a winner of the Bay Area News Group Top Workplace in 2017. Check us out on Glassdoor "}