{"jobID": "2693209689", "jobLocation": "New_York_NY", "jobTitle": "Analytics Intern", "companyRating": "3.5", "companyInfo": {"Website": "www.fortressinv.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1998", "Type": " Company - Public (FIG) ", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "91000", "jobDescription": " Fortress Investment Group LLC is a leading, highly diversified global investment manager with approximately $43.6 billion (1,2) of assets under management as December 31, 2017. Founded in 1998, Fortress manages assets on behalf of over 1,750 institutional clients and private investors worldwide across a range of credit and real estate, private equity and permanent capital investment strategies.  Investment performance is our cornerstone - we strive to generate strong risk adjusted returns for our investors over the long term.  As of December 31, 2017, we had 953 asset management employees, including 216 investment professionals, at our headquarters in New York and our affiliate offices around the globe.  New Residential Investment Corp. (NYSE: NRZ) is a publicly traded real estate investment trust (“REIT”) that focuses on investing in, and actively managing, investments primarily related to residential real estate, specifically excess MSRs, servicer advances, non-agency RMBS & associated call rights and other securitized products related investments.  New Residential is externally managed and advised by an affiliate of Fortress Investment Group LLC a highly diversified global alternative investment manager with $70.2 billion of assets under management as of March 31, 2017.  NRZ is seeking an Analytics Intern who will be responsible for:  · Supporting and enhancing existing cashflow generators for residential mortgage bonds (RMBS) and servicing rights (MSR)  · Working with quantitative modeling team to implement new models (Python/R/SQL/C#) and analytics for mortgage bonds, MSRs and residential loans  · Building ad-hoc reports based off of mortgage market datasets hosted in AWS Redshift  What you’ll bring:  · Master’s degree in a quantitative discipline (financial engineering, computer science, math) preferred  · Solid quantitative and coding skills (VBA, Python, R, C++/C# and database skills)  · Capable to explain and communicate model implementation and technical aspects clearly  What you’ll learn:  · Opportunity to work with New Residential quant and portfolio management teams  · Opportunity to review default and prepayment models covering asset classes of RMBS, MSR, whole loans"}