{"jobID": "2821257886", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist - Mozilla Marketing Analytics", "companyRating": "3.3", "companyInfo": {"Website": "www.mozilla.org", "Headquarters": "Mountain View, CA", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Nonprofit Organization", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Apple, Microsoft, Google"}, "estimatedSalary": "139000", "jobDescription": " On Mozilla’s Marketing team, data is the primary mechanism for making decisions. Analytics and experimentation are the core of our business. Our team is committed to answering the question - how do we build and maintain the internet as a public resource? We are collecting and processing terabytes of data a day from hundreds of millions of users to help us figure out how. We could use your help.  You are an inquisitive thinker who is keen to practice full-stack data science, with experience ranging from designing and engineering data extraction processes to finding patterns and anomalies in data through analytical techniques. You have strong interest in honing your technical skills further on a wide variety of real-world data. You believe that data science can lead to insights that can guide the future of Mozilla’s marketing. You will apply your expertise in quantitative analysis, statistical modeling, and data visualization to see beyond the numbers and understand how our worldwide community experiences our products.  As a Data Scientist in Mozilla’s Marketing team, you will be:You'll be working with a talented group of data analysts and engineers, both paid and volunteer, to make the Web a better place, and impact the everyday lives of hundreds of millions of users. You will help design and analyze experiments to optimize user acquisition and retentionYou build key data sets to empower operational and exploratory analysisYou advocate for strong analytical standard methodologies across the organizationYou are responsible for the definition, evaluation and reporting of key product metricsYou sit at the intersection between marketing, product, engineering, and leadership to inform, influence, support, and execute our product decisionsYou will help foster a culture of experimentation to improve the way we take Mozilla products to marketGeneral Requirements:A Master’s or higher degree from computer, mathematical, physical, life, or social science is desirableBackground in applied statistical modeling on large experimental or observational data setsExperience extracting data from a variety of sources, and a desire to expand those skills (working knowledge SQL is required, Spark is a plus)Proficiency with one or more of the programming languages: Python/R preferredExperience working in a distributed, open-source oriented culture is a plusA global perspective in how to conduct research and understanding of cultural nuancesAbility to interpret large amounts of data, multi-task, and produce results independently or collaboratively in a team environmentAbility to work collaboratively with a distributed team.Ability to write and speak English well. Other Skills/Experience:Our team requires skills in a variety of domains. You should ideally be familiar with one (or more) of the areas listed below, and be interested in learning new things. Extensive experience with Spark (or similar) ecosystem (MapReduce, Yarn, HDFS, Hive, Hadoop, Presto, Pig, HBase, Parquet)Experience in at least one of the SQL languages (MySQL, PostgreSQL, SqlServer, Oracle)Strong skills in scripting language (Python, Ruby, Perl, Bash)Experience with workflow management tools (JIRA, Aha!, Taiga)Experience with third party reporting tools/platforms (Google Data Studio, Tableau, Pentaho)Highly scalable distributed systems hosted on cloud providers (e.g. AWS)Basic working knowledge of web development technologies (HTML, Javascript, CSS, HTTP) If you have different experiences and skills from the ones listed above and have something else to bring to the table, please reach out to us and let us know.  Mozilla is a global organization, and this role is available in our offices in the U.S., Canada, and Europe or home-based in those countries. You must have work authorization in one of these countries. We support flexible work hours, paid professional development, and have a wellness program that includes child care assistance.About MozillaMozilla exists to build the Internet as a public resource accessible to all because we believe open and free is better than closed and controlled. Join us to work on products that promote choice and transparency and give people more control over their lives online. Mozilla is committed to Equal Employment Opportunity throughout our recruiting and hiring process and is dedicated to increasing diversity in our workplace."}