{"jobID": "2829266242", "jobLocation": "New_York_NY", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.tapestry.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Make a Lasting Impression. Join Tapestry, the first New York-based house of modern luxury lifestyle brands. A successful career at Tapestry is built on hard work, determination and a genuine passion for what you do. At Tapestry, you are part of a global house of brands that is built around our shared values of optimism, innovation and inclusivity. We believe anyone from anywhere can have the best idea, and with creativity and perseverance, anything is possible.  Whether it be Coach, Stuart Weitzman or Kate Spade, each of our great brands around the world helps people express themselves in their own unique ways. Purpose: Retail as an industry is changing. With an increasing amount of shopping done online, traditional retailers must innovate to stay relevant. The Global Strategy and Data Labs Team at Tapestry is tackling these challenges by leveraging our deep data assets to provide a best in class, worldwide capability to drive actionable customer understanding. We are looking for individuals with a passion for discovery, innovation, and the power of advanced analytics to drive financial results and improve customer experiences. We work collaboratively with business partners across the organization to define the questions to ask, pursue the best opportunities, share insights, and develop practical business recommendations. What you’ll do…Build statistical analyses and machine learning models using rich, multi-brand, longitudinal data sets covering over 106 million customers globallyCommunicate with our cross-functional business partners to find the right questions, the right data, and the right approaches needed to reach our goalsBe willing to work at all levels of a multi-billion dollar fashion retailer (design, marketing, customer retention and acquisition, pricing, inventory, logistics, ecommerce, wherever we can make an impact)Collaborate with our data engineers to innovate in the sourcing, management, and use of dataSpend each day in a collaborative, friendly, challenging environment with the brightest, most driven people in retail in a brand new building at Hudson Yards with amazing views of ManhattanWhat you’ll need…A quantitative/technical/analytics education (Masters/PhD in a quantitative discipline preferred)Proficiency in applying statistical/machine learning methods in the real world where the highest AUC isn’t always the best solutionContemporary data engineering / data science technical skills (e.g. SQL, R, Python) and a desire to try out the cutting edgeNo retail experience required. We’ll teach you retail. We’ll teach you fashion. Just bring your curiosity. Tapestry, Inc. is an equal opportunity and affirmative action employer and we pride ourselves on hiring and developing the best people. All employment decisions (including recruitment, hiring, promotion, compensation, transfer, training, discipline and termination) are based on the applicant’s or employee’s qualifications as they relate to the requirements of the position under consideration. These decisions are made without regard to age, sex, sexual orientation, gender identity, genetic characteristics, race, color, creed, religion, ethnicity, national origin, alienage, citizenship, disability, marital status, military status, pregnancy, or any other legally-recognized protected basis prohibited by applicable law. *LI-JW1 Visit Tapestry, Inc. at http://www.tapestry.com/"}