{"jobID": "2794635982", "jobLocation": "San_Francisco_CA", "jobTitle": "Sustainability Legal Intern", "companyRating": null, "companyInfo": {"Website": "www.digitalrealty.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2004", "Type": " Company - Public (DLR) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Equinix, Global Switch, QTS"}, "estimatedSalary": null, "jobDescription": " Tracking Code  1633  Job DescriptionPOSITION: Sustainability Legal InternOpportunity Snapshot Digital Realty takes pride in being a leader in environmental stewardship in the data center industry, and is excited to announce this opportunity to join our sustainability team as a Sustainability Intern. We are seeking a progressive, detail- oriented and forward- thinking candidate who desires to gain experience in sustainability at a real estate company while making significant, measurable improvements to Digital Realty’s corporate environmental impact. This position will report to the Senior Director of Sustainability and will collaborate with key aspects of the business. The individual must be highly motivated and have strong attention to detail and an ability to execute defined projects efficiently and in a timely manner. Exceptional organizational, analytical, written & verbal skills are required, as well as proficiency with MS Office software The RequirementsPossess the ability to work independently to meet deadlines and produce on-time, high-quality deliverablesEnjoy solving problems, and be comfortable with uncertainty and imperfect informationBe an effective collaborator with colleagues in other areas of the business and have a friendly, “can-do”, customer-service-oriented attitudeHave a strong interest in real estate and data centers, with an understanding of relevant green building and sustainability mattersBe flexible to adapt to changing priorities and program needsPossess strong Excel, analytical and data management skillsBe able to present analysis and recommendations in a clear and concise mannerPossess strong interpersonal skills and be a proactive communicatorRecognize when it’s best to reach someone via call, email, text, or in-personBe detail oriented and work efficiently to meet deadlinesMinimum Qualifications Education: Progress toward a Master’s degree in a relevant field such as engineering, energy, business administration, finance, environmental studies, or similar.  Experience: Prior experience working in a professional office setting. The Role The Position supports targeted sustainability and renewable energy projects for a leading global data center company. Value is placed on the candidate’s ability to efficiently and accurately execute projects and report on results in a clear and concise manner, coordinate with coworkers and vendors on key projects, manage assigned task and projects to completion, and other duties assigned by Manager. As Sustainability Intern you will:Manage assigned sustainability projects within Digital Realty’s data center portfolioCollaborate and engage with internal business functions to advance sustainability projects, collect and analyze data, and support corporate sustainability reportingSupport Energy Star Portfolio Manager portfolio benchmarking and certificationWork with internal and third-party data platforms to analyze and report relevant dataNote: this description is intended to give you a general overview of the position and is not an exhaustive listing of duties and responsibilities.Digital Realty: Where the cloud lives and business thrives We built the global standard for technical real estate, developing a unique capability to acquire, manage, and scale data center campuses. Now, Digital Realty is building a unique ecosystem of open solutions that power customer growth through exceptional service on a foundation of unrivaled data center expertise. The new Digital Realty combines unparalleled data center services, carrier-dense interconnection, real estate acumen, and financial strength to create unique power of choice and value when and where our customers need it. Our Mission To provide our customers with the trusted foundation for the digital world Our Vision To build a network of connected campuses and internet gateways that become the heart of the internet and cloud, powering growth and prosperity for customers, employees and shareholders. Our Values Guide our decisions and actions every day—above all else, we value customers, excellence, talent, teamwork and success. About Digital Realty Digital Realty Trust, Inc. supports the data center and colocation strategies of more than 2,000 firms across its secure, network-rich portfolio of data centers located throughout North America, Europe, Asia and Australia. Digital Realty's clients include companies of all sizes, ranging from financial services, cloud and information technology services, to manufacturing, energy, gaming, life sciences and consumer products  Digital Realty is a publicly traded company (NYSE: DLR) with investment grade ratings from all three major ratings agencies.  Digital Realty offers a highly competitive compensation package, excellent benefits, and an environment that recognizes and rewards your contributions.  Digital Realty is an equal opportunity employer. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.  Please do not forward unsolicited resumes to any employee of Digital Realty and its subsidiaries. Digital Realty is not responsible for any fees related to unsolicited referrals.Job Location  San Francisco, California, United States  Position Type  Intern"}