{"jobID": "2791843846", "jobLocation": "New_York_NY", "jobTitle": "Customer Success Manager - Enterprise", "companyRating": "4.9", "companyInfo": {"Website": "www.salesloft.com", "Headquarters": "Atlanta, GA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "72000", "jobDescription": "Customer Success Manager - Enterprise Be the go-to resource of success for the most important people in our world: Customers. The SalesLoft customer base has grown rapidly and weve redefined our Custom Success team to supercharge our customer experience. Simply put, we need more amazing CSMs! If youre passionate about providing a world class customer experience and motivated by achieving exceptional retention targets this is the career path for you!  In our dedicated model youll serve exclusively managing 30-40 accounts. You are the main POC for your customers; daily youll focus on driving customer adoption through strategy calls with users and customize business reviews with the executive level in each of your accounts. Remember, you are the quarterback of the customer experience. If you can accomplish these things you will be wildly successful:Become a SalesLoft product expert and advocate modern sales thought leadership and sales development best practices. Our product team moves quickly to innovate for customers, youll have to learn and pivot with them.Staying up to date on industry trends and practices is a must, a hunger for knowledge in this role is key!Drive Health & Adoption in your book of business: Serve as the dedicated POC for your accounts, books range between 30-40 accounts, your goal is to achieve their desired result and guide on best practices for their specific use case.Youll report on an adoption metrics weekly, monthly and quarterly.Daily account monitoring to ensure youre in the know on usage trends, support tickets and their overall success.Youll be responsible for preparing and running business views with each customer.It's your job to ensure all end-users are on-boarded successfully and are seeing the value of the platform.R&R; takes on a whole new meaning at SalesLoft, think Renewals & Retention! Each quarter youre responsible for hitting a renewal goal in your book of business.Work with your direct manager on strategic account changes and partner with Sales representatives on expansion opportunities.Experience and Interview Requirements:Experience2+ Years of Salesforce experience.2 - 4 Years in a SaaS environment, must possess one or both below:2+ years of Customer Success.2+ Years Account Exec or Account Manager experience.1+ Years experience of running business reviews or ROI analysis.1+ Year experience working and closing customer renewals.Interview During the interview process you need to be able to demonstrate and provide: Performance metrics and retention targets achieved.Three customer and three professional references.What does our CSM Ramp entail? We help you train like a Pro! There is a 8 week ramp period, youll need to: Shadow & Learn:SalesLoft | Our company, team, culture and mission.Sales | Shadow SDRs & AEs to learn how prospected become customers.Implement & Train | Learn how to implement SalesLoft and train customers.Customer Success | Understand the customer journey, customer talk tracks and key points on interaction.Own a deep knowledge on the SalesLoft Solution.Understand what Modern Sales is and how the Sales the industry has evolved."}