{"jobID": "2791285887", "jobLocation": "Cambridge_MA", "jobTitle": "Immuno-Oncology Data Scientist, Bioinformatics Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.sanofi.com", "Headquarters": "Paris, France", "Size": "10000+ employees", "Founded": " 1973", "Type": " Company - Public (SNY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Pfizer, GlaxoSmithKline"}, "estimatedSalary": "106000", "jobDescription": " Immuno-Oncology Data Scientist  The Oncology Research Therapeutic Area seeks an experienced computational biologist / data scientist to join us in the fight to stop cancer.  In this exciting role the Data Scientist is an integrated part of Discovery teams and will design experiments, manage data, and use advanced statistical, machine learning, as well as computational techniques to discover new targets either to stop the growth of cancer or re-awaken the immune system to eradicate the cancer. Furthermore, the Data Scientist will collaborate with Early Development teams to guide the development of molecules against those targets with data-driven biomarker plans. Summary of Key Responsibilities:Proactively engage with project teams to define crisp scientific questions that can be addressed with an appropriately powered experimental designsSupply any computational, statistical, machine learning or modeling capability needed to synthesize from this design actionable recommendations relative to the teams questionIn collaboration with project teams propose analysis strategies for target discovery, using methods based for instance on differential expression, co-regulation, correlated amplification, recurrent alterations, etc.; in so doing, also help devise statistical metrics for deciding significance, and ranking schemes for integrating data from many sourcesIdentify targets and biological contexts (e.g., T or B-cell repertoire, immune phenotypes, copy number, mutational, or expression signatures) in which therapies are likely to be beneficial by mining immune, genetic, genomic or screening dataIdentify from patient and model system databases the epidemiology of these biological contexts and targetsDevelop biomarker plans (e.g., selection, PD, efficacy) in collaboration with project teamsManage and develop group of one or more associates and/ or contractorsEssential Qualifications:Ph.D. in a computational, statistical, biophysics, or bioinformatics related fields.A minimum of 8+years project-based work in computational application to biology related fieldsPreferred Qualifications: An ideal candidate will be collaborative, self-directed and possess A positive, proactive can-do mindsetStrong interest in biology and immunological diseasesStatistical programming skills like SAS/S-plus, R/bioconductor and pipeline pilot or equivalentsExcellent understanding of immunology and hands-on research experience investigating complex lymphoid and/or myeloid cell subsetsFirst-hand multi-parametric data mining experience for target identification and biomarker discovery. For example, multivariate analysis; dimensionality reduction methods; parametric and non-parametric statistical methods; Bayesian statistics; pattern recognition or classification methods.First-hand experience at integrating publicly or commercially available genetic, genomic, and immune datasets with novel experimental data to identify testable hypothesesDeveloped communication and presentation skills and a successful track record of collaborating with cross-functional project teamsExcellent interpersonal and team skillsDemonstrated ability to lead projects of moderate scope, mapping-out critical path, milestones and timelines, as well as manage customer expectations with minimal supervision Sanofi Inc. and its U.S. affiliates are Equal Opportunity and Affirmative Action employers committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race; color; creed; religion; national origin; age; ancestry; nationality; marital, domestic partnership or civil union status; sex, gender, gender identity or expression; affectional or sexual orientation; disability; veteran or military status or liability for military status; domestic violence victim status; atypical cellular or blood trait; genetic information (including the refusal to submit to genetic testing) or any other characteristic protected by law.  #GD-SA  #LI-SA  Sanofi is dedicated to supporting people through their health challenges. We are a global biopharmaceutical company focused on human health. We prevent illness with vaccines, provide innovative treatments to fight pain and ease suffering. We stand by the few who suffer from rare diseases and the millions with long-term chronic conditions.  With more than 100,000 people in 100 countries, Sanofi is transforming scientific innovation into healthcare solutions around the globe.  Sanofi, Empowering Life"}