{"jobID": "2657461528", "jobLocation": "Redwood_City_CA", "jobTitle": "Family Office Staff Accountant", "companyRating": "3.8", "companyInfo": {"Website": "www.seiler.com", "Headquarters": "Redwood City, CA", "Size": "201 to 500 employees", "Founded": " 1957", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": "For more than 50 years, Seiler LLP has provided advisory, tax and accounting services to some of the world’s most affluent individuals, families, privately-held businesses and non-profit organizations. Our clients include prominent business, community and philanthropic leaders, as well as high-net-worth multi-generational families and successful entrepreneurs. Based in Silicon Valley and San Francisco, we deliver the sophisticated solutions, innovative thinking, global capabilities and highly personalized service our clients require to navigate the complexities of their financial worlds, not only for today but for many years to come. Our goal is to exceed our clients’ expectations in every way.  Recognition: San Francisco Business Times’ and Silicon Valley Business Journal’s “Best Places to Work 2017”INSIDE Public Accounting’s “Fastest-Growing Firms” of 2016INSIDE Public Accounting’s “Best of the Best Accounting Firms” in the United States for 12 yearsINSIDE Public Accounting’s “Top 100 Firm” for 12 yearsAccounting Today’s “Top 100 Firm” for 10 years Overview & ResponsibilitiesThe Family Office group provides accounting and consulting services to ultra-high net worth individuals and family clients. The services provided range from partnership accounting, financial reporting, cash management, and bill payment, to advising on complex intergenerational wealth strategies.  The Staff Accountant will be an integral part of the Family Office group providing diversified administrative and day-to-day financial support to the Family Office Management Team in the service of our clients.Our ideal candidate will possess: An understanding of professional services and client serviceStrong interpersonal skills with an approachable and professional demeanorOutstanding organization skillsExcellent verbal and written communication skillsThe ability to handle and respond to multiple client and department demands in a timely mannerThe ability to prioritize assignments and effectively manage their timeThe ability to thrive in a fast paced and dynamic environmentThe ability to be a team player but be able to work independently. DutiesResponsible for providing multiple clients with a variety of accounting and administrative services, including but not limited to: Accounts payable processingResearching and resolving issues or discrepancies with clients’ accounts, bill pay or invoicesResponding to client requests and inquiriesManaging vendor relationships, requests, and paymentsMonitoring accounts to ensure payments are up to datePerforming monthly reconciliations of client credit cards and providing reports as neededProviding accurate documentation in accordance with records retention policies and proceduresAssisting with year-end reporting of 1099sManaging charitable contribution letters for annual tax packagesHandling special projects as needed Requirements Bachelor’s degree in Business, Accounting, or FinanceCPA eligible preferred0 to 3 years of accounting, accounts payable or bookkeeping experienceFamiliar with Microsoft Office; QuickBooks experience preferredHigh attention to detail, problem solver & intellectually curiousAdhere to the highest level of confidentiality Applicants must be able to pass a background check and must be currently authorized to work in the United States on a full-time basis.  All qualified candidates should submit their resumes and salary requirements (please reference “Family Office Staff Accountant” and either Redwood City or San Francisco in the subject line) to resumes@seiler.com for immediate consideration."}