{"jobID": "2811258200", "jobLocation": "San_Jose_CA", "jobTitle": "Operations Manager at San Jose Intl Airport", "companyRating": "2.4", "companyInfo": {"Website": "www.hudsongroup.com", "Headquarters": "Basel, Switzerland", "Size": "5001 to 10000 employees", "Founded": " 1987", "Type": " Company - Public", "Industry": " Retail", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "67000", "jobDescription": " Position: Operations Manager Location: San José International Airport (Mineta)GROWWithUS!Hudson Group is North America's largest specialty travel retailer. For 30 years Hudson Group has led the way and prides itself in knowing what matters in travel retail. As airports and transportation terminals have evolved, so has Hudson Group, striving to bring sophistication and convenience to today's traveler.Job Summary:Responsible for managing the Dufry shops within an operation, consistent with the short and long term interests of the company, its employees and its customers, and ensuring the highest level of customer service possible. Job Responsibilities: Customers Promote quality of customer service among staff through training and by acting as a positive role modelCreate “seamless customer service” by making every effort to find merchandise for customers even if an item is not in stock People Hire people who are passionate about our products and philosophy and maintain employee attitude and morale by recognizing outstanding performance and service and by motivating and developing staffMaintain staff levels that allow for the best possible customer serviceExecute performance evaluations and goal assessmentsPrepare the work schedule to ensure that the store goals will be met through appropriate planning and organization of staff and manage absences and health management with HRProvide an “open door” policy where employees are free to express their concerns and feelings without fear of retribution or ill willHold weekly staff meetings and submit notes to Area Retail Manager Operations Ensure that company policy & procedures are communicated in a timely manner & adhered to accordinglyWork with other departments on developing plans, and implement themEnsure that the store is in compliance with all Airport, State and Federal employment lawsMonitor a loss prevention program to protect the company’s inventory and assets Finance In conjunction with the Area Retail Manager, formulate the fiscal revenue, expense and profit goals, as well as the inventory levels for the storeEnsure that goals will be met through appropriate planning and organization of staff, inventory, and expenses and making staff aware of sales goalsReview the store’s progress on a monthly basis with the Area Retail ManagerKnowledge, Skill and Ability:Strong leadership skills demonstrated ability to build effective teams and motivate employeesKnowledge of effective merchandise presentation standardsUnderstanding of basic retail conceptsGood problem solving skillsFluent English and additional languages as applicable for operationEducation and Experience:5 years of retail experience with at least 3 years of experience in a management / supervisory roleHudson Group is always on the lookout for top quality people who want to be a part of a winning retail team. With many stores and concepts across the country and throughout the world, we have the ability to help you find the job that is right for you. We recognize that our employees are a driving force behind our success! Our dedicated team enjoys an exciting and friendly environment! We invite you to learn more about our …Competitive Salaries,Medical, Dental & Vision Insurance,Company Paid Life Insurance,Paid Vacation,Paid Sick Time,Employee Recognition Programs,Advancement and Growth Opportunities,On-going Training & Development. Qualified candidates should submit their resume for immediate consideration.The job that’s right for you!  awarrington@hudsongroup.com Apply NowApply"}