{"jobID": "1727211808", "jobLocation": "Boston_MA", "jobTitle": "Business Development Intern", "companyRating": null, "companyInfo": {"Website": "www.earthwatch.org", "Headquarters": "Boston, MA", "Size": "1 to 50 employees", "Founded": " 1971", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Location: Boston, MA, United StatesPosition Type: Intern (unpaid) Department: Field Research Expeditions POSITION SUMMARY: Earthwatch Institute is an international non-profit organization that supports field research worldwide in ocean health, cultural heritage, climate change, and wildlife and ecosystems. Earthwatch supports field research that utilizes highly motivated non-specialist volunteers, also called citizen scientists, to collect data. As an intern in the Field Research Expeditions department you would assist with a variety of tasks relating to recruiting volunteers to participate on citizen science expeditions. Applicants accepted on a rolling basis. RESPONSIBILITIES:Internships offer training in a variety of tasks and provide individuals an opportunity to be part of an exciting and dynamic team. This position focuses on key sales strategies including lead prospecting and market research. Internship responsibilities may shift with seasonal needs of the Field Research Expeditions department. Responsibilities may include:Identify new and innovative opportunities to expand brand awarenessIdentify schools, clubs, and organizations for the potential recruitment of volunteersIdentify, plan and coordinate volunteer outreach events (e.g. conferences, talks at clubs and businesses)Research and update stewarding best practicesWrite communications pieces for prospective volunteers in collaboration with the marketing departmentResearching industry best practices for volunteer outreach and recruitmentSupport team with data finds through learning how to navigate a CRM databaseREQUIREMENTS:Interest in sales, business development, or volunteer outreach and coordination (experience preferred)Interest in biology/ecology/environmental scienceProficiency in Microsoft ExcelExperience writing, creativity a plusDemonstrated flexibility, initiative, resourcefulness, and collaboration skillsAbility to multitask while staying organizedDetail-oriented and a team playerSense of humor!Earthwatch interns can take part in the Intern Credit Program in which they receive credits to use towards a qualified Earthwatch expedition and are invited to participate in all Earthwatch activities. Although three or more months are preferred, we require a minimum commitment of one month and 120 hours. We also encourage use of the internship for academic credit, thesis, or practicum work towards degree or certificate programs.We are only able to accept-Massachusetts based applicants into the program, or those with a confirmed place to stay within commuting distance to Boston. Applicants must currently be eligible to work in the United States. All interns are required to have individual health insurance. Placement will be subject to qualifications and availability.To apply, please submit all of the following items. Incomplete applications will not be considered.A Cover Letter illustrating your qualifications, why you are interested in this internship, and what you are looking to gain from this internship.A current resume, detailing relevant field and/or office experience.Your availability (days per week, and months of availability).A recent writing sample excerpt."}