{"jobID": "2755594715", "jobLocation": "New_York_NY", "jobTitle": "Operations Manager", "companyRating": "3.0", "companyInfo": {"Website": "jobs.spectrum.com", "Headquarters": "Stamford, CT", "Size": "Unknown", "Founded": " 2016", "Type": " Subsidiary or Business Segment", "Industry": " Telecommunications", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "102000", "jobDescription": "JOB SUMMARY Responsible for the oversight of day to day operations within all Studio, Master Control and Production Control environments. Collaborates with technical and editorial leadership and personnel, in developing and executing a production strategy for the assigned News and/or Sports channel. MAJOR DUTIES AND RESPONSIBILITIES Schedule operations personnel in multiple departments (Master Control, Production Control, Media Management) for prospective shifts as production needs and on-air requires.  Troubleshoot processes and equipment, and recommend appropriate solutions.  Structure Operational/Production procedures in all areas.  Manage operations/production personnel including: coaching, training, critiquing, hiring and scheduling.  Fosters and maintains a positive work atmosphere and training environment.  Maintain up to date knowledge on system operation and environment.  Oversee day to day management of broadcast automation systems.  Develop and maintain standard operating procedures in all operational/production areas.  Maintain training documentation and operational training.  Create, review, and respond to issues submitted by users and staff.  Execute cross-training opportunities.  Analyze Operational workflow.  Organize, coordinate and schedule studio and control room resources.  Resolve vendor tickets, technical issues and assist engineering/IT with troubleshooting where applicable.  Assist personnel with production related issues while demonstrating professional behavior, including strong customer service skills.  Manage expense and overtime budget.  Implement and maintain quality production values.  Perform other duties as assigned. REQUIRED QUALIFICATIONS Skills/Abilities and Knowledge  Ability to read, write, speak and understand English.  Ability to adapt to rapidly changing circumstances and solve complex problems while demonstrating a positive attitude and positive approach.  Ability to provide leadership, management in a customer support environment.  Ability to read, analyze and interpret most complex documents.  Ability to understand engineering documentation including AutoCAD drawings and system designs.  Operate and maintain working knowledge of production equipment.  Must be able to relay complex technical information in easy to access form for non-technical audience.  Knowledge of broadcast automation systems, such as Dalet Galaxy news environment.  Ability to delegate  Excellent Project Management skills.  Ability to make effective and persuasive presentations on a variety of complex topics to leadership team, public groups, or staff.  Maintain and grow technical job knowledge. Education Bachelor’s Degree in Television Production, Broadcast Engineering preferred or equivalent work experience.  Related Work Experience Number of Years  Experience in Television or News/Sports Production 5  Management experience 2  Working Conditions  Normal office environment  Must be able and willing to work various shifts, longer shifts, weekends and holidays, and be flexible with schedule changes due to \"breaking news\", and/or severe weather emergencies.  Ability to lift and carry up to 50 pounds. "}