{"jobID": "2637730578", "jobLocation": "Austin_TX", "jobTitle": "Senior Data Scientist -Security & Malware -DeepArmor", "companyRating": "4.6", "companyInfo": {"Website": "www.sparkcognition.com", "Headquarters": "Austin, TX", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "116000", "jobDescription": " SparkCognition is an AI leader that offers business-critical solutions for customers in energy, oil and gas, manufacturing, finance, aerospace, defense, and security. A highly awarded company recognized for cutting-edge technology, SparkCognition develops AI-powered cyber-physical software for the safety, security, reliability, and optimization of IT, OT, and the Industrial IoT.  SparkCognition is seeking an innovative data scientist to join the DeepArmor team. Attackers have been easily evading signature-based antivirus solutions for years, which is why 95% of cyber breaches originate at the endpoint. SparkCognitions DeepArmor has redefined endpoint security by leveraging the power of artificial intelligence to both detect and prevent threats at machine scale. The right candidate will immerse yourself in cutting-edge research and work with the latest technologies to deliver value in the detection of malware and other security threats across multiple environments.  Responsibilities  Building models to solve specific problems. This includes, but is not limited to:  Processing, cleansing, and verifying the integrity of data used for analysis  Feature engineering using various techniques for the enhancement of data  Performing feature selection on original and generated data  Using machine learning tools to develop and train models  Performing efficacy testing of the models  Building automated tools that enable data scientists to more effectively perform tasks such as data cleaning, feature generation, feature selection, or model building  Performing ad-hoc analysis and presenting results in a clear manner  Working with a team to help solve new, never-before-solved challenges in malware and threat detection  Skills and qualifications  Understanding and experience using machine learning techniques and algorithms, including but not limited to: Linear Models, Neural Networks, Decision Trees, Bayesian Techniques, Clustering, Anomaly Detection, and more  Experience with data science languages, such as Python, R, MatLab, etc  Experience with machine learning frameworks, such as PyTorch, TensorFlow, Theano, Keras, etc  Familiarity with operating systems internals (e.g. Windows, macOS, Android, Linux, iOS, etc.), including but not limited to:  Memory management  Process layout and executable file formats  System calls, linker/loader, libraries  Familiarity with threat vectors contained in documents, images, and macros  Familiarity with malware and threat detection  Experience managing large volumes of data (terabytes or more)  Great communication skills  Good scripting and programming skills, especially Python  Graduate degree (or equivalent industry experience), Ph.D. preferred, in Computer Science or a related scientific discipline  Desirable skills and qualifications  Experience with security incident response and IDS or HIDS signature development  Experience with developing an application on a full stack of HTTP, JSON, REST, React, Java/C#, SQL, and no-SQL databases. SparkCognition is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity and/or expression, national origin, protected veteran status, disability, genetics, or citizenship status (when otherwise legally authorized to work) and will not be discriminated against on the basis of such characteristics or any other status protected by the laws or regulations in the locations where we operate. If you need assistance or an accommodation due to a disability, you may contact us at accommodations@sparkcognition.com"}