{"jobID": "2767424169", "jobLocation": "San_Francisco_CA", "jobTitle": "IT Portfolio Senior Manager -Digital", "companyRating": "3.2", "companyInfo": {"Website": "www.blueshieldca.com", "Headquarters": "San Francisco, CA", "Size": "5001 to 10000 employees", "Founded": " 1939", "Type": " Nonprofit Organization", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "142000", "jobDescription": "Summary:The Program Delivery organization is seeking a dynamic Senior Manager for the Digital portfolio to drive strategic and operational project initiatives. The Digital portfolio supports the Digital Customer Experience (DCE) and Information Technology (IT) Application Services business units. Teams are focused on delivering innovative, compelling, and personalized digital experiences that are simple, human, and intelligent. ​ Project initiatives deliver on Blue Shield’s digital assets including the organization’s portal websites and mobile applications. Projects are typically iterative, highly complex with people, process, and technology impacts and multiple root causes/driving factors. Responsibilities:The Senior Manager acts as a technical project driver partnering with the Digital Customer Experience business drivers to execute the Digital portfolio including schedule, scope, IT resource management, financials, benefit tracking, and issue/risk management to ensure successful completion of projects, programs, and operational initiatives. Single point of accountability for project status for the Digital portfolio. Partners with the Digital Customer Experience and IT delivery teams to influence and improve project-based activities to achieve operational efficiencies.The Senior Manager provides oversight and leadership direction on projects within the Digital portfolio (schedule, issues/risks, budget, and resources). Defines project governance and project structure. Develops the Digital portfolio projects roadmap and tracks projects and enhancement releases against major milestones and business targets. Defines, implements, and facilitates change management. Actively manages project budgets including actuals reviews and monthly forecasting. Leads and facilitates executive and senior leadership meetings. The Senior Manager directly manages senior project managers, lead project managers, and scrum masters for the Digital portfolio. Recruits and staffs assignments with internal and external resources. Works with resource managers across multiple IT teams to forecast and secure resource demands. Monitors team work and completion progress. Performs supervisory management and learning development for staff.Requirements:8 years combined experience:project/portfolio management with increasing scope and schedule complexity and budget accountability. Managing agile/scrum cross-functional teams and implementing agile methodologies within an IT organizationInformation technology/technical background experienceExperience managing direct reports Demonstrated leadership on large-scale enterprise-wide projectsProficiency in Microsoft Project, Planview, or similar project management tools Proficiency with JIRA or similar epic, story, and defect tracking management systemsExperience driving or delivering digital customer interfacing platforms (i.e., portal websites, mobile applications) utilizing multiple software delivery methodologies (i.e., waterfall, hybrid, agile)Knowledge of Blue Shield of California (BSC) or prior healthcare payer experience preferredEducation:Bachelor’s Degree required. Masters Degree preferred.Scrum Master certification required. Scrum Alliance Certified Scrum Professional (CSP) preferred.Project Management Institute (PMI) Project Management Professional (PMP) required. PMI Agile Certified Practitioner (PMI-ACP) preferred.This position may require 10\" - 15\" travel to our El Dorado Hills location. Telecommute may be an option depending on assignment. The position will be based in San Francisco. "}