{"jobID": "2815741217", "jobLocation": "Seattle_WA", "jobTitle": "Jr. Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.jetclosing.com", "Headquarters": "Seattle, WA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About JetClosing: We started with the knowledge and insight of a veteran title and escrow team, paired them with tech industry leaders, and gave them a clean slate to build what title and escrow should be. We invented sophisticated back-office technology to streamline our closing process, and ensure every customer receives the same high level of service, every time. Then we created real-time views into that system with our mobile apps and desktop portal, so theres no guesswork or uncertainty.  Our approach is simple. Title and escrow has transaction data, documents, and contacts. We know the transaction status. Why not share them, in real time, so were all on the same page? The results speak for themselves our customers are our biggest fans. Job Description: We are looking for a detail oriented Junior Data Analyst in our Seattle Office. The successful candidate will support the company growth by keeping our data pristine and organized in our various operating systems that connect to our cloud. You will be responsible for maintaining existing data and cleaning new data to ensure it is accurate, current, reliable, and complete. In addition, you will assist in entering new lead information for our sales team, quality control for order accuracy, and escalating sync anomalies for enhancement development. Experience in a data hierarchy model with complex parent/child data relationships is preferred. Responsibility:Data de-duplication.Data cleansing and QC.Hierarchy management.Updating records as clients contact and employment information changes.Verifying existing data for accuracy.Logging sales leads.Researching client information that is missing from high target lead records.Uploading client headshots into our CRM.Skills and Qualifications: Undergraduate degree or higher with a high GPA with proficiency in English (both verbal and written). Familiarity with database usage, Excel, overall high level of computer literacy, and the ability to learn new software quickly. Desire to see data anomalies and concern for accuracy, quality, and attention to details. Thrives in a fast-paced, dynamic and collaborative environment with an open plan work environment.  JetClosing is an Equal Opportunity Employer. Individuals seeking employment at JetClosing are considered without regard to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, or sexual orientation."}