{"jobID": "2786554811", "jobLocation": "San_Jose_CA", "jobTitle": "VP Brand Design & Activation", "companyRating": null, "companyInfo": {"Website": "www.flex.com", "Headquarters": "San Jose, CA", "Size": "10000+ employees", "Founded": " 1969", "Type": " Company - Public (FLEX) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job DescriptionThe Vice President, Brand Design & Activation will be based in San Jose, CA and will report to the Vice President, Global Marketing & Sustainability. This role will be responsible for the Flex  masterbrand – design, creative extension and execution. We are seeking someone that thinks both strategically and creatively and that can evolve the creative vision for the brand to influence all global marketing touchpoints. We are looking for someone who demonstrates:Intense collaborationPassionate customer focusThoughtful, fast, disciplined executionTenacious commitment and desire for continuous improvement – raising the barStrategic and creative problem solvingHere is a glimpse of what you’ll do:Collaborate extensively across Brand Marketing, Customer Engagement & Events, Marketing Communications, Sustainability and other internal teamsLead the evolution and codification of the Flex look & feel including base guidelines, asset development and guidelines, do’s & don’ts, etc.Provide creative leadership and ownership of all company-wide branded content across channels and modalitiesProvide leadership and direction for business group branded material strategy (creative and design)Drive design thinking and the Flex design ethos to inform the Customer Experience Center overhaulElevate storytelling across mediums (digital, social, events, experiences) and through asset types (i.e. UX/UI, video, illustration, imagery, etc.)Work alongside head of Brand Marketing to conceptualize, storyboard and ideate strategies aligned with goals for branding, thought leadership and other marketing executionsBring integrated campaigns to life through collaboration with content and digital teamsOwn and improve the branded merchandise programManage the creative process across multiple program and project typesCreate and implement design best practicesEducate and empower practitioners and agency partnersContinue to develop the team and talentWork with current and source agency partnersEvaluate and make recommendations for global production partners; evaluate for quality; identify opportunities to drive efficiency; establish an approved roster of global partnersLead and manage a global team of 9; partner with and support local site marketing effortsOwn and manage team budgetEstablish and maintain a strong understanding of industry trends – both the industries Flex operates across, as well as creative and design trendsHere is some of what you’ll need (required):Bachelor’s degree in Fine Arts, Graphic Design, Visual Communications or related field15-20 years’ experience in design including creative leadershipExperience collaborating with and counseling senior executives (c-suite, site leaders, etc)B2B identity system developmentAbility to successfully navigate in a matrixed organizationDeep knowledge and use of creative suite tools and platformsKnowledge and experience with emerging mediaExperience working in-house for a professional services firm or agencyPassion for great design!Here is some of our preferred experiences:MFA or equivalentExperience with branded environments and architectureSome retail environments experienceHere are a few examples of what you’ll get for the great work you provide:Full range of medical benefits, dental, visionLife InsuranceQuarterly Bonus EligibilityMatching 401kTracking Free AttendanceTuition ReimbursementEmployee discounts at local retailersJob CategorySales - Marketing - Account MgmtFlex does not accept unsolicited resumes from headhunters, recruitment agencies or fee based recruitment services. Flex is an Equal Opportunity Employer and employment selection decisions are based on merit, qualifications, and abilities. Flex does not discriminate in employment opportunities or practices on the basis of: age, race, religion, color, sex, national origin, marital status, sexual orientation, gender identity, veteran status, disability, pregnancy status or any other status protected by law. Flex provides reasonable accommodation so that qualified applicants with a disability may participate in the selection process. Please advise us of any accommodations you request in order to express interest in a position by e-mailing: accesibility@flextronics.com. Please state your request for assistance in your message. Only reasonable accommodation requests related to applying for a specific position within Flex will be reviewed at the e-mail address. Flex will contact you if it is determined that your background is a match to the required skills required for this position. Thank you for considering a career with Flex.The information we collect:We may collect personal information that you choose to submit to us through the Website or otherwise provide to us. This may include your contact details; information provided in online questionnaires, feedback forms, or applications for employment; and information you provide such as CV/Resume. We will use your information for legitimate business purposes such as responding to comments or queries or answering questions; progressing applications for employment; allowing you to choose to share web content with others or; where you represent one of our customers or suppliers, administering the business relationship with that customer or supplier."}