{"jobID": "2802505726", "jobLocation": "Waltham_MA", "jobTitle": "Donation Coordinator (ICU RN, Critical Care Nurse)", "companyRating": "3.9", "companyInfo": {"Website": "www.neds.org", "Headquarters": "Waltham, MA", "Size": "201 to 500 employees", "Founded": " 1968", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "32", "jobDescription": " Company DescriptionNew England Donor Services (NEDS) is seeking experienced, dedicated and enthusiastic people to join our team. Saving and enhancing lives through organ and tissue donation is the mission uniting our 250 employees and drives the work we do. NEDS has been at the forefront of advances in transplant medicine through our work with 14 of the nations leading transplant centers. Come join us and make a difference in the lives of others every day.Job DescriptionAre you a compassionate individual that enjoys meaningful work, being part of a team, working through challenges and making a positive difference in peoples lives? Join our exciting, professional and dynamic team whose mission is to save and enhance lives!  New England Donor Services is seeking an experienced ICU RN, Critical Care RN, Trauma Nurse or Nurse Practitioner to join our team. As a Donation Coordinator you will respond on-site to organ donor referrals to provide clinical expertise in donor evaluation, donor management, organ allocation and organ recovery. You will blend high level clinical and people skills to educate hospital staff on the donation process, work with donor families to obtain consent for donation and work with multiple surgical teams and critical care staff to optimize organs and tissues for transplantation. Success in this role requires a self-assured professional who has keen clinical assessment skills, the ability to be flexible and remain calm and effective in highly charged and clinically complex situations. Schedule •Orientation: 24 hour on-call shifts. Average 13 shifts per month + training&apos;s + meetings. Significant travel with personal vehicle throughout all of New England is expected. Mileage and other reimbursements available.  •Independent: 24 hour on-call shifts. Expect 10 shifts per month + 2 hospital development days + training&apos;s + meetings. Significant travel with personal vehicle throughout all of New England is expected. Mileage and other reimbursements available.Qualifications•Optimal candidates have critical care or trauma experience with medical/clinical credentials including experience managing complicated clinical events  •Must have reliable transportation  •Must have valid drivers license and insurance (extensive driving throughout New England is required)  •Must have critical thinking skills and keen clinical assessment skills  •Must have ability to work long hours (could be out over 24 hours)  •Must be compassionate and have conflict resolution skills  •Must be able to sit, stand or bend for extended period of time  •Must have great work ethic and be forward thinking  Education and Experience  •3-5 years clinical experience/critical care experience and a Bachelors Degree preferred  •CPTC Certification a plus  • Ideal candidates live in near Boston, MAAdditional InformationWhen you join New England Donor Services you can expect competitive salaries and a great benefit package. Benefits include a generous paid time off program, BCBS Health and Dental Insurance, Healthcare Reimbursement Account, 2x Annual Salary Life Insurance, Pet Insurance, Flexible Spending Account (FSA), Short-Term and Long-Term Disability Coverage, 403(b) Retirement Contribution, Tuition Reimbursement, Employee Assistance Program and Discounts through Working Advantage.  New England Donor Services is an equal opportunity employer and encourages diverse candidates to apply to meet the needs of the multicultural and multilingual communities we serve.  Hear from some of our employees at www.neds.org/careers"}