{"jobID": "2788949960", "jobLocation": "Quincy_MA", "jobTitle": "AVP, Service Delivery Management – Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.statestreet.com", "Headquarters": "Boston, MA", "Size": "10000+ employees", "Founded": " 1792", "Type": " Company - Public (STT) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " J.P. Morgan, BNY Mellon, Northern Trust"}, "estimatedSalary": null, "jobDescription": " State Street Global Technology Operations (GTO) – Process Excellence Office (PXO) is seeking a skilled and proven AVP, Service Delivery Management – Data Scientist. The individual contributor in this role will design and develop multiple solutions within the PXO. The candidate will be required to have a proven track record of delivery of technically advanced solutions in support of multiple, simultaneous initiatives within the PXO which span multiple disciplines and business lines. The candidate will help our clients solve their business problems by providing deep, meaningful, and interpretable business insights using advanced analytics and machine learning techniques. It is intended that these business insights will directly aid our clients in their decision-making process to solve pressing business challenges and problems related to operations, finance, and IT. Specifically, the candidate will: Understand and define business problems, research analytical solutions, and determine the data to be used in providing needed business insightQuery, assemble, clean, normalize, and transform datasets in preparation for analysisAnalyze data using a variety of advanced analytics and machine learning techniques in order to build an initial proof of conceptBuild high-quality prototypes and implement the solution in a scalable framework like SparkTrain, test, and validate the analytical models to ensure that the model achieves and/or exceeds the expected accuracy levelsCommunicate findings to product owner and a broader audience of technical and non-technical colleaguesLead projects, contribute to teams, and mentor junior analysts/data scientistsInnovate and continue to improve the accuracy of the models using a variety of techniquesCollaborate with other data scientists to innovate and continuously improve the accuracy of models using a variety of techniques• Leverage industry best practices; shares the same with team Minimum QualificationsA Bachelor’s degree plus 4 years of experience as a Data Scientist or a Master’s degree plus 3+ years of experience in a related field.Experience with statistics, mathematical modeling, and/or machine learning, and experience implementing such methods to tackle business problems.Experience in process improvement and or business process reengineering including Six Sigma is a definite plus for this position.Experience with Programming in Python/Spark is a mustHands on experience with supervised as well as unsupervised machine learning techniques to solve business problems.Preferred QualificationsMaster’s degree in Business/Data Analytics is a definite plus for this positionKnowledge of big data tools and frameworks, such as Spark, Hadoop, Sqoop, and KafkaExperience in the banking and financial services industryExperience working in an Agile environmentStrong communication and collaboration skills with the ability to work in a team environment (including a global work model) and to interact and influence peers, managers and senior leadersDemonstrated experience working in an environment managing multiple, concurrent deliverables with shifting priorities, demands, and timelinesResults oriented ownership mentality"}