{"jobID": "2792046204", "jobLocation": "Cambridge_MA", "jobTitle": "Computational Biologist \\/ Bioinformatics Data Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.novartis.com", "Headquarters": "Basel, Switzerland", "Size": "10000+ employees", "Founded": " 1996", "Type": " Company - Public (NVS) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "101000", "jobDescription": "Posting TitleComputational Biologist / Bioinformatics Data Scientist25-May-2018Job ID242203BRJob DescriptionThe successful candidate will work at the cutting edge of science to solve important challenges in biomedical research. S/he will work in an interdisciplinary environment assessing, integrating, curating, and mining complex data to drive biological insights. S/he will develop and employ novel approaches to derive and evaluate inferences across diverse data types. S/he will work closely with biologists, chemists, and computational scientists to identify novel drug targets, biomarkers, and therapeutic mechanisms. The position requires combining an understanding of biological sciences with computational techniques in statistics and mathematics to contribute to solving unmet medical needs. Nimble analytic skills, independent motivation, excellent communication, continuous education, and a team-oriented focus are critical to thrive in this dynamic environment. We seek a creative and collaborative data scientist to evaluate, develop, and apply statistical inference and machine learning algorithms to promote early stage drug discovery. Minimum requirements•A PhD in the physical sciences or mathematics, with a strong scientific and computational background.•Familiar with fundamental concepts in molecular biology, chemical biology, statistics, and bioinformatics.•Demonstrated ability to formulate, articulate, and critically evaluate hypotheses.•Proficient in Python, SQL, and R, with experience scripting in a Unix/Linux environment.•Excellent written and oral English; any additional language a plus.•High-learning capacity and curiosity, with a solution-based approach to problem-solving.Additional desirable attributes include, but are not limited to:•Experience working in a biological laboratory environment is preferred.•Knowledge of transcriptional regulation, epigenetics, signal transduction, and/or cellular communication.•Experience analyzing and integrating genomic, transcriptomic, proteomic, and phenotypic molecular profiling data.•Applied use of generalized linear models, dimensionality reduction, ensemble methods, or graph theory to biological questions.•Exposure to deep learning architectures and libraries (especially pytorch or tensorflow).•Familiar with cluster computing frameworks (Spark, UGE, AWS) is desirable.•Familiar with web-based deployment of models and results (rest, flask, js, plotly, or shiny) is a bonus.Job TypeFull TimeCountryUSA Work LocationCambridge, MA Functional AreaResearch & Development DivisionNIBR Business UnitCBT - NIBR Employment TypeRegular Company/Legal EntityNIBRIEEO StatementThe Novartis Group of Companies are Equal Opportunity Employers and take pride in maintaining a diverse environment. We do not discriminate in recruitment, hiring, training, promotion or any other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, marital or veteran status, disability, or any other legally protected status."}