{"jobID": "2817355583", "jobLocation": "Boston_MA", "jobTitle": "Senior Credit Analyst - Officer", "companyRating": "3.4", "companyInfo": {"Website": "www.radiusbank.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 1987", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "64000", "jobDescription": " Return to Job ListPOSITION TITLE:  Senior Credit AnalystREPORTS TO:  Senior Credit OfficerDEPARTMENT:  CreditGeneral Responsibilities Under the general supervision of the Senior Vice President Credit Team Leader or his/her designee, provides independent credit analysis of new and existing commercial & industrial, and commercial real estate loan relationships. Develops critical written analysis of new loan opportunities and review/renewal of existing portfolio credit relationships as a member of the Credit Analysis Group. Such duties include performing due diligence of new credit opportunities, ensuring loan requests comply with loan policies and procedures, financial statement spreading, reviewing and analyzing financial information and Borrower/Guarantor credit trends, developing detailed written analysis that is comprehensive yet concise, forming an independent judgment-based risk rating opinion, and assisting the relationship manager in presenting the credits for loan approval. Requires use of independent judgment and decision making. Essential Functions:Prepares financial statements spread sheets and independent credit analyses on the Bank’s existing or potential commercial customers. Performs historical trend and ratio analysis and properly assesses cash flow, collateral, industry risks, guarantor strength and all other major risks to the Bank in lending to these customers.Interacts with commercial lending officers to gather information relative to a customer being analyzed or to discuss issues with the creditOccasionally attends joint calls with the commercial loan officer and his/her customer to gather more information about the customers.Performs additional duties such as ensuring proper credit approval has been received prior to funding a loan.Assists with special projects assigned by the Senior Credit Officer.Non-Essential Functions:Plan and organize workload with appropriate priorities.Must be flexible for work scheduling as required.Attend job-related meetings, seminars, and training sessions as required.Qualifications:Four-year Undergraduate Degree with a field of study preference in Business administration, finance, accounting and/or economicsMinimum of two years of commercial banking experience which may include business banking, middle market, and/or specialty commercial banking, and commercial credit/risk oversight.Excellent oral and written communication skill, as well as math skillsExperience working with bank core systems.Sound knowledge of Bank loan policy, compliance, and loan operations.Advanced knowledge of Microsoft Office Suite.Excellent customer service orientation.Ability to organize and prioritize work and the ability to work with minimal supervision.Attention to detail and ability to multi-task.Ability to use sound judgment.CompetenciesEmbraces ChangeCustomer FocusIntegrity/TrustResults and Quality FocusDecision Making/JudgmentQuality/Attention to DetailQuick Learner/AdaptabilityTechnical Skills"}