{"jobID": "2823114578", "jobLocation": "San_Jose_CA", "jobTitle": "IT Field Technology Supervisor", "companyRating": "3.8", "companyInfo": {"Website": "www.calwatergroup.com", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 1926", "Type": " Company - Public (CWT) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "111000", "jobDescription": "California Water Service (Cal Water) invites you to pursue a career with the largest investor-owned American water utility west of the Mississippi River and the third-largest publicly traded water utility in the country. Formed in 1926, the San Jose-based company was named one of the Bay Area Top Workplaces several years in a row. Cal Water employees pride themselves on sharing a commitment to being the leader in providing its customers and communities with traditional and innovative utility services.  Cal Water offers a generous total compensation package. We have competitive salaries and match a portion of employees' contributions to their Company 401(k). In addition, we provide a Company-funded pension plan, great healthcare benefits that provide coverage to employees and dependents, and generous tuition reimbursement. In addition, employees receive 11 paid holidays and three floating holidays per year, and two weeks of sick leave and vacation.  We are committed to hiring the best candidates, developing current employees, and promoting from within. Continuous improvement and employee development opportunities allow employees to acquire the knowledge and skills necessary to progress and reach your career goals. SUMMARY: The Field Technology Supervisor is responsible for implementing and supporting enterprise level customer service systems, specifically Oracle’s Customer Care and Billing (CCB) and related sub-systems such as meter reading, customer self-service and payment processing. This position works closely with business partners to develop processes, related tools and special initiatives in order to optimize system resources. This position is located in San Jose, California. ESSENTIAL FUNCTIONS:Supervises staff, including prioritizing and assigning work, conducting performance reviews, and oversee the development of staffSupervises and coordinates activities with IT, analysts, super users, subject matter experts, and other support personnel for the maintenance of CCB application softwareLeads CCB Triage teams to review and prioritize incidents and change ordersProvides oversight of CCB Developer Change Management process to ensure product break fix and change items are well communicated, prioritized, and progressed through the Change Management process in a timely mannerAssists in the planning of unit, system integration, performance, regression, and user acceptance testingProvides input into annual budget planning for the continued advancement of support related initiativesComplies with Sarbanes-Oxley (SOX) requirements to ensure controls are adhered toOversees the progress of projects assigned and ensures system improvements are successfully implementedReviews and recommends changes to documented business processes and proceduresCollaborates with Senior Database Administrators the Senior Network Administrators to install software and ensure proper backup procedures are followed and to implement needed security measuresComplies with IT Sarbanes-Oxley (SOX) and security requirementsParticipates in and supports the Company’s Continuous Improvement program and projectsPerform other duties as assigned to fulfill business operational needs and objectivesAttend meetings and training's as directed by California Water ServiceMINIMUM QUALIFICATIONS:Bachelor’s degree in Information Systems or related field and/or equivalent relevant experienceTwo years of project management or management experienceFive years of experience working in IT managing, implementing, and supporting enterprise level software applicationsProficient in the use of Microsoft Office applicationsValid California Driver LicenseAdvanced knowledge of complex IT security protocols, policies, and proceduresKnowledge and ability to comply with IT SOX controlsKnowledge and ability to evaluate, assess, and implement IT risk mitigation processes and proceduresKnowledge of network, server, mobile devices, application, and database security principles for risk identification and analysisKnowledge and ability to use Microsoft Office applications to create spreadsheets, presentations, and Word documentsKnowledge and ability to implement Company policies, procedures, and processesAdvanced project management skillsKnowledge and ability to budget resources and labor effectivelyKnowledge and ability to communicate both verbally and in writing with all levels of employees and managementKnowledge and ability to work effectively with auditors, customers, consultants, employees, and vendorsDemonstrated analytical and problem solving skillsDemonstrated time management and organizational skillsDemonstrated ability to lead, manage, and motivate groups of employeesDemonstrated commitment to providing outstanding customer serviceFlexible and able to prioritize workDeadline to submit resume is Thursday, July 5, 2018 The Equal Opportunity Policy of the Company is based upon the philosophy that all people should be treated fairly and with dignity. California Water Service, Hawaii Water Service, New Mexico Water Service and Washington Water Service do not discriminate against any applicant or employee because of race, color, religion, sex, national origin, or any other protected class. The Company makes all employment decisions in a non-discriminatory manner. EOE, VET, DISABILITIES"}