{"jobID": "2787576316", "jobLocation": "San_Jose_CA", "jobTitle": "Manager, SSD Technical Marketing", "companyRating": "3.4", "companyInfo": {"Website": "www.skhynix.com", "Headquarters": "Icheongeo-ri, South Korea", "Size": "10000+ employees", "Founded": " 1983", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "113000", "jobDescription": "Responsibilities:Lead technical activities with customers to define future storage trend and requirements.Own relationship with industry partners in promoting and aligning SK hynix SSD productsGenerate technical collaterals (presentations, technical papers, reports) for internal and external useSamples SSD products to and tracks their progress within partners for evaluation, validation or qualification for future reference designs.Initiates technical leadership and support to sales staff and customers. Develops technical information and insights for sales training.Researches, analyzes, and recommends new product specs, product pricing, etc.Conducts competitive and comparative analyses of substitutionary or complementary products in the present and future market.Documents, reports, and communicates to internal peers & management leadership the status, progress, and conclusions of technical marketing activities.Represent SK hynix in attending or presenting in industry related seminars or conferencesRequirements:Minimum of a bachelor’s degree in Electrical Engineering or Equivalent. Master’s degree preferred. MBA, a plus.Minimum of 5+ years experience in technical marketing, product marketing and/or engineering in storage or semiconductor industryPossesses strong technical fundamentals in SSD technologies (SATA, SAS or PCIe NVMe)In-depth knowledge of server and storage industry, systems trends and market sensing, and application ecosystemsServer or storage system level architecture knowledge is a plusStrong communication, collaboration, coaching, negotiation and presentation skillsInternational and domestic travel required SK hynix America"}