{"jobID": "2747046564", "jobLocation": "Waltham_MA", "jobTitle": "Data Scientist - Geospatial", "companyRating": "4.2", "companyInfo": {"Website": "www.mckinsey.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1926", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Boston Consulting Group, Bain & Company, Strategy&"}, "estimatedSalary": "122000", "jobDescription": " You will work in a fast-paced team environment devising and conducting specialized and distinctive analytics using large and complex data of different types to solve client problems.  These problems may include decoding spatial and temporal patterns in customer behaviors, analyzing the drivers of performance to inform customer relationship management, developing an optimal distribution network configuration model for a global supply chain, or geographically optimizing a field sales force.     Your work will be project-oriented. You will often be responsible for the entire analytical process from outlining the best solution to implementing the results. You will interpret results for colleagues, consultants, and clients, and you will often create plans for transferring capabilities to the client, and you'll perform these roles through a mix of remote and on-site work.     Working on projects and exchanging experiences with your colleagues means you will face new intellectual challenges on a daily basis, while continuously building your methodological knowledge and skills. You are expected to develop and contribute to such knowledge base on analytic methods and techniques, as well as relevant data and information sources used in geospatial analytics.     While your work will be primarily in Waltham, you will be a member of the Global Geospatial Analytics team with other locations in Sao Paulo, Brazil, and San Jose, Costa Rica, and Shanghai, China. You will interact daily with your colleagues from other locations as well as travel occasionally to serve clients internationally. In addition, you will benefit from all development and training opportunities that we have developed for our analytics colleagues worldwide as well as those designed specifically for knowledge professionals in our Waltham office.   "}