{"jobID": "2796541891", "jobLocation": "San_Jose_CA", "jobTitle": "Project Manager", "companyRating": "3.5", "companyInfo": {"Website": "www.fishercareers.com", "Headquarters": "Camas, WA", "Size": "1001 to 5000 employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "80000", "jobDescription": " OverviewProject Manager is a critical role that independently manages a full range of projects, including the larger and more complex corporate or departmental projects and implementations. They organize, plan and execute projects, ensure adherence to deadlines, manage project budgets, help define the project’s objectives and oversee quality control. Duties also include coordinating the efforts of team members and third-party contractors or consultants in order to deliver projects according to plan. Responsibilities:•Manage all phases of individual projects to ensure they are completed efficiently and meet the customer’s requirements. Projects may be multi-year, multi-million dollar efforts involving the replacement of core business systems and involve process changes to multiple business units.•Lead and motivate teams and ensure projects are delivered with a high degree of quality.•Effectively manage the project scope, budget, and timeline. Evaluate the impact to the project if changes are made to these constraints.•Identify and manage potential risks or issues. Proactively develop contingency and mitigation plans.•Utilize analytical and problem-solving skills, as well as project management and technical knowledge, to assess and resolve project-related obstacles. •Effectively communicate relevant project information to project team members, internal customers, and the management team. Communicate difficult and sensitive information tactfully.•Influence decision-making, obtain buy-in, and negotiate resources, scope, and timelines with Project Sponsors, key stakeholders, and project team members.•Work with impacted departments to identify needs and obtain project resources.•Manage contract and consulting resources and ensure compliance with the project budget and Statement of Work.•Analyze and assess project requirements and processes and provide recommendations for improvement.  Qualifications:•Bachelor’s degree and 5+ years of project management experience required; or equivalent combination of education/experience•Demonstrated experience leading collaborative project teams on technical projects of varying size and complexity•Ability to establish and maintain effective relationships with management , project team members, internal clients, and consultants•Strong ability to persuade at all levels of the organization.•Ability to work independently, handle multiple priorities, and solve complex problems•Excellent oral and written communication skills•Knowledge of waterfall and agile methodologies and tools, and experience managing projects in both•Ability to identify and provide solutions for improving current practices Who is Fisher Investments? We’re a privately-held investment management firm that manages assets within its Institutional, Private Client, International Group, and 401(k) Solutions Groups. We promote a performance-based culture with potential for significant career advancement. We want to invest in you. We've worked hard to create a culture where we can help accelerate the careers of exceptional people. We entrust our team members with high levels of responsibility, give them resources needed to succeed, and recognize and reward them for their successes. We make significant investments in our employees in their career, through formal and informal training, offering extensive training opportunities designed to build both breadth and depth in each of our team members. We are pleased to provide a combination of classroom teaching, on-the-job training and ongoing mentoring to set our employees on the path to a successful, lifelong career.  We’re proud to provide a competitive compensation plan, which includes complete coverage of monthly medical, dental, and vision premiums (less deductibles), paid time off, as well as an exceptional 50% match on 401(k) contributions up to the maximum amount allowed by the IRS. Ready to join our team and make an impact? Apply now!  FISHER INVESTMENTS IS AN EQUAL OPPORTUNITY EMPLOYER"}