{"jobID": "2513525902", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist, Marketplace Optimization", "companyRating": "4.3", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "141000", "jobDescription": " About Uber Were changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now were a part of the logistical fabric of more than 600 cities around the world. Whether its a ride, a sandwich, or a package, we use technology to give people what they want, when they want it. For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer. And thats just what were doing today. Were thinking about the future, too. With teams working on autonomous trucking and self-driving cars, were in for the long haul. Were reimagining how people and things move from one place to the next. About the role In Marketplace youll be at at the center of Ubers business, where riders and drivers come together at extraordinary scale. As a data scientist, youll combine clear product vision, deep technical skills and powerful data analysis to improve the algorithms that run Ubers vast worldwide marketplace every minute of the day. Were looking for you to produce elegant solutions that are practical, effective and can work at Uber scale. Our team tackles problems such as optimizing Ubers short and long term pricing systems; efficiently matching incoming trip requests in Ubers dispatch system; developing innovative incentive schemes that reward riders and drivers for choosing our network; and providing optimal routes and accurate turn-by-turn navigation to save time for everybody. We also forecast, monitor and evaluate all aspects of our marketplace using both large scale observational data and thoughtful experimentation.If you are passionate about original ideas, and take pride in seeing those thoughts come to life in a high impact setting, then youll be at home in our team where creative exploration and iterative experimentation are at the heart of what we do. As part of Marketplace, you will work side-by-side with Uber's engineering team to scale your ideas across Uber's real-time production systems, and then strive to gain insights from the real world outcomes we see. What were looking for Our team attracts people from a wide range of backgrounds, from areas with a focus on empirical modeling (Machine Learning and Statistics), to those that emphasize marketplace efficiency (Economics, Operations Research and Operations Management), to those with a tradition of utilizing rich geospatial data to better understand mobility (Transportation Engineering). We also highly value candidates from a Computer Science background who have a strong interest in these problem spaces. We love hearing from talented applicants who are enthusiastic about tackling our business problems. Here are some guidelines for what we look for in a candidate: Strong quantitative background. MS or PhD preferred, but waived for candidates with considerable practical work experience in data science or engineering out of school.Ability to think creatively and insightfully. Weve got plenty of hard problems and nowhere to look up the answers.Data-driven perspective. The truth is out there: we just need to measure it.Open mindedness. We favor flexibility in our technical approaches and value the ability to see things from a driver or riders perspective.End-to-end ownership. Youll dive into the data to understand the whole context, passionately advocate for your ideas, help out with implementation where needed, and always take responsibility for ensuring that riders and drivers have a great experience on our network.Familiarity with common technical tools for data analysis - Python (with Pandas, etc.), R, SQL a plus Programming chops. A solid understanding of algorithms and data structures. Python skills and/or experience in developing high performance production quality code in C, C++, Java, etc a plus."}