{"jobID": "2787071454", "jobLocation": "Mountain_View_CA", "jobTitle": "Business Data Analyst", "companyRating": "2.7", "companyInfo": {"Website": "www.intelliprogroup.com", "Headquarters": "Santa Clara, CA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "67000", "jobDescription": "Description The Business Data Analyst role reports into the Product Cost Management Team. This team is responsible for managing and tracking all product COGS & OCOGS in order to make sure that margin targets are being achieved. Additionally, this team is responsible for having a deep knowledge and understanding of all cost trends and KPIs as it relates to our client consumer hardware business. Job Summary The Data Analyst will be a key player involved in making sure that all details related to Bill of Materials, costs, and other key data attributes are being properly curated and recorded. Top 3 Daily Responsibilities:This person will develop a deep understanding of cost data, structure, dependencies, relationships.The Data Analyst will be responsible for maintaining the reliability and cleanliness of the data, sourcing new data attributes, organizing data and reporting into intuitive and insightful formats, and helping to develop analytics and KPIs to measure performance of the costing teamThis person will work closely with the other PCM team members to ensure that the team has the tools and insights necessary to make informed strategic cost decisions with the ultimate goal of achieving margin targets. Required Qualifications:Bachelor degree Finance, Accounting, or related fieldA minimum of 1-3 years of FP&A; experienceAttention to detail, organizational skills, and ability to meet firm deadlines is a mustStrong proficiency with Excel (advanced functions).Experience with one or more of these functional areas: PLM, ERP, supply chain management,Product Cost Management.Presentation experience (building presentations, not necessarily presenting)Strong Communication skillsExperience with Tableau/other data visualization tools"}