{"jobID": "2814080352", "jobLocation": "New_York_NY", "jobTitle": "Data Analyst", "companyRating": "4.2", "companyInfo": {"Website": "www.nyu.edu/about/working-at-nyu.html", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1831", "Type": " College / University", "Industry": " Education", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "53000", "jobDescription": "Posting Number 2018-4654 Location US-NY-New York Posted Date 2018-06-11 Union N/A School/Division Student Affairs (WS1705) Department Name : Wasserman Center for Career Development FT/PT Full-Time Position Summary The position will play a pivotal role supporting two university units: the NYU Wasserman Center and the NYU Leadership Initiative, which both share a commitment to preparing students for meaningful lives and careers. The position will report to the Director of Operations at the Wasserman Center and the Program Director at the Leadership Initiative. The position will implement data collection, analysis, and reporting for discreet projects for both offices. Ultimately, this position will make recommendations for integrating best practices, shared processes, and resources between the Wasserman Center and the Leadership Initiative. Please note this is a twelve-month fixed-term position, which may be renewable. QualificationsRequired Education: Bachelor's Degree Required Experience: 2+ years' of relevant experience working with data and analytics. Preferred Experience: Experience with CRM system configuration and administration, Tableau reporting software, performing mass uploads, collecting, coding and integrating data from several sources using MS Excel or equivalent, coordinating data integrity and clean-up efforts, reviewing functionality and making recommendations. Use of survey tools such as Qualtrics. Required Skills, Knowledge and Abilities: Strong analytical skills and knowledge of data best practices and software. Demonstrated attention to detail. Strong communication skills, verbal and written. Understanding of CRM software. Knowledge and skillset to build data dashboards and/or reports. Ability to participate in collaborative workflow processes with Wasserman and Leadership Initiative staff. Ability to creatively solve system-related problems and effectively juggle multiple projects. Strong team player. Ability to work in multifaceted high-paced environment. Additional Information EOE/AA/Minorities/Females/Vet/Disabled/Sexual Orientation/Gender IdentityPI102898651"}