{"jobID": "2639079051", "jobLocation": "New_York_NY", "jobTitle": "Business Operations Coordinator", "companyRating": "2.5", "companyInfo": {"Website": "www.screenvisionmedia.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": "Company Overview Screenvision is a national leader in cinema advertising, offering on-screen advertising, in-lobby promotions and integrated marketing programs to national, regional and local advertisers and providing comprehensive cinema advertising representation services for its theatrical exhibitor partners. The Screenvision cinema advertising network is comprised of 14,400 screens in 2,400 theater locations across all 50 states and 94% of DMAs nationwide.  Come help us meet the demand and be part of one of the advertising industry’s fastest growing segments! Business Operations CoordinatorPosition Summary The Business Operations Coordinator will assist the Vice President of Business Operations in the development and execution of processes and strategies that help our sales teams run effectively and efficiently. This includes managing sales tools and resources, maintaining our CRM database system, forecasting and analyzing our current business, maintaining various trend reports, and representing the needs of sales across Screenvision Media. ResponsibilitiesUpdate the weekly sales report which tracks sales activity and booked revenue.Maintain and enter information within Screenvision’s CRM system.Assist with establishing sales metrics, revenue forecasting, and budgets.Research new leads and prospects for the sales team.Analyze trends in our current businessAssist with the creation of management presentationsAnswer ad hoc requests from the sales team involving historical sales, category trends, etc.Serve as the liaison between the sales team and other departments such as finance, marketing, IT, and operations for any requests and services needed.Qualifications:1+ years of experience preferred – in media, research, business, or salesBachelor’s Degree required.Extremely Proficient with Microsoft Office (especially in Excel).Ability to diagnose and utilize sales data effectivelyAbility to demonstrate excellent time management skills and prioritizing projects.Must have extreme attention to detail.Must demonstrate ability to comfortably work in a fast paced environment.Work Environment: This job operates in a professional office environment. This role routinely uses standard office equipment such as computers, lap tops, phones, mobile devices, photocopiers, filing cabinets and fax machines. Physical Demands: The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  While performing the duties of this job, the employee is regularly required to do the following: sit, stand, walk, talk and hear. The employee is occasionally required to; reach with hands and arms; stoop, kneel. Screenvision does not discriminate in hiring or employment on the basis of race, color, religious creed, national origin, sex, ancestry, age, employment status, disability or veteran status or any other basis prohibited by federal, state or local laws. AA/EOE Apply"}