{"jobID": "2813172793", "jobLocation": "New_York_NY", "jobTitle": "IT Enterprise Architect (f/m/d) - Frankfurt or New York IT", "companyRating": "3.9", "companyInfo": {"Website": "www.allianzgi.com", "Headquarters": "London, United Kingdom", "Size": "1001 to 5000 employees", "Founded": " 2012", "Type": " Subsidiary or Business Segment", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "172000", "jobDescription": "Position Summary:The IT Enterprise Architecture team is an integral part of AllianzGI’s global IT organization and responsible for defining and enforcing a sound architecture across IT. To complete this team we are looking for an experienced professional as IT Enterprise Architect Practice Lead (f/m/d) who is willing to take responsibility in an interesting and dynamic international environment.Job ID: EXT-IT-180682832Function: ITRoles and Responsibilities:Lead continuous enhancements of Architecture Repository, including management of functional and data model related change requests in line with stakeholder expectationsEnsure that the underlying meta model is covering and supporting current and future architecture relevant use cases including project executionLead Enterprise Architecture dependency management and documentationDevelop Enterprise Architecture reports, diagrams and visualization deliverablesOwn the life-cycle process of Architecture Repository with a strong focus on ensuring that the Application and Technology elements are up to dateLead creation, support, execution and continuous enhancements of IT Enterprise Architecture Governance Process in-line with EA Team and stakeholder expectations and ensure that all related change initiatives, projects or programs within Allianz Global Investors are covered accordinglyPrepare weekly RAG-status management reports about compliance of governed projects to architectureEstablish relationship and influence EA Team and IT stakeholders to ensure high information qualityQualification and Skills:Required :Several years of working experience in Information Technology and in IT Architecture in a financial services environmentDiploma in Business Administration, Business Informatics or similarStrong technology and business administration backgroundExcellent oral and written communication skills, fluent in EnglishExcellent data modeling and analytics skillsExpert Visio and PowerPoint skillsKnowledge of project planning/management including scope, time and resource managementExcellent leadership, communication, and relationship management skillsStrong analytical and conceptual skills; ability to create original concepts/theories for a variety of stakeholdersUnderstanding of EA frameworks such as The Open Group Architecture Framework (TOGAF) or Zachman Framework for Enterprise ArchitectureKnowledge of Enterprise Architecture Tools (such as System Architect, Alfabet Planning IT, Troux, Mega, Archimate, Sparx)Preferred :International work experience, MBA or PHD would be a plusAdditional Hiring Criteria:Closing Date: Sunday, 30 September 2018  Read LessWe offer an attractive, performance-related compensation package and cultivate a productive and enjoyable atmosphere which is pervaded by team spirit. Your personal development is of particular importance for us. Did we spark your interest? If so, we look forward to receiving your application.  We are an Equal Opportunity Employer Apply Now"}