{"jobID": "2796618615", "jobLocation": "New_York_NY", "jobTitle": "Solutions Consultant", "companyRating": null, "companyInfo": {"Website": "www.usertesting.com", "Headquarters": "Mountain View, CA", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Company DescriptionUserTesting enables companies to put their customers at the center of every business decision by leveraging the power of human insights. The most advanced on-demand customer insights platform, UserTesting enables product managers, UX researchers and designers, marketers, and digital executives to connect with their exact target customer in a matter of hours and uncover actionable insights that drive ROI. More than 35,000 companies have adopted UserTesting to make smarter business decisions throughout the design and development of their digital experiences as well as in their marketing messaging and competitive positioning.Job DescriptionWhat makes the difference between a product that&apos;s engaging, compelling, and easy to use and one that&apos;s frustrating, broken, and complicated? The answer is user experience. Here at UserTesting, our mission is to create great experiences.  As a Solutions Consultant, you&apos;ll be an integral part of our sales organization, being a thought-leader throughout the sales process by articulating and demonstrating how UserTestings solution solves business challenges and delivers positive business outcomes.  This position can be located in the Boston, MA area or the New York City, NY area. What you&apos;ll be doing:Collaborate with Enterprise Regional Sales Directors, Account Executives, and Customer Success Managers to identify customers business goals and initiatives, and uncover unmet needs and challengesConsult and partner with various stakeholders from C-Suite Executives to Researchers to maximize the quality and value of the insights they will gather from UserTestings solutionDevelop strategic solutions that map to customers business goals and initiativesProvide recommendations and best practices on how UserTesting can address business goals and initiatives, unmet needs, and challengesDeliver relevant and impactful product demonstrations that impress the value of UserTestings solution in relation to customers goals & initiativesDevelop a deep familiarity of the UserTesting platform via hands-on training leveraging relevant use casesDemonstrate understanding and value of customer experience research methodologies conducted via the UserTesting platformLead and/or consult on Proof-of-Concepts (POCs) to ensure results address and impact a strategic business goal or initiativePartner with the Research and Marketing teams to develop collateral, content and training to enable the Sales teamCommunicate effectively with Sales team regarding sales activities and strategiesInform the Product teams of trends, use cases, and business impact of how specific capabilities are delivering / undelivering against customers business goals & objectivesEngage in thought leadership and marketing related efforts, such as blogs, webinars, and public speakingQualificationsBachelors or Masters Degree in relevant field3+ years within a customer-facing or consultative firm; preferably as a Solutions Consultant or Solutions Engineer5+ years within a client-side environment leading research initiativesDeep understanding of both qualitative and quantitative methodologiesExcellent written, oral, interpersonal, and presentation skillsExcellent analytical and problem solving skillsAbility to manage multiple projects simultaneously and be results orientedStrong passion for CX practices, research, and technologyExperience with our product a plus! Additional InformationBesides a great work environment and the opportunity to change the world, we offer competitive salary, benefits, plenty of perks, as well as stock options. We value diversity, and were proud to be an inclusive, equal opportunity workplace.  Learn more about what its like to work at UserTesting at: https://www.usertesting.com/about-us/jobs"}