{"jobID": "2831230109", "jobLocation": "Seattle_WA", "jobTitle": "Data Analyst II - SQL, Excel", "companyRating": "3.9", "companyInfo": {"Website": "www.excell.com", "Headquarters": "Bellevue, WA", "Size": "201 to 500 employees", "Founded": " 2001", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Kforce, TEKsystems, Robert Half"}, "estimatedSalary": "66000", "jobDescription": " Youre covered with eXcell. We offer our temporary employees full benefits. Always have. Always will. Join us!  The Data Analyst is responsible for ensuring the efficiency of the 3D device cross-functional product safety team, tracking field reports, identifying areas for improvement, and building both long term and ad hoc solutions. The ideal candidate will have a strong technical, analytical, and operational background. Overview:Create and iterate on solutions and dashboards to empower operational and exploratory analysisEnforce best practices and alignment with research, analytics, and engineering teamsEffectively communicate with external clients and internal teams to deliver solutions in a timely fashionRespond to (or triage) any and all requests related to customer report data with minimal guidance or oversightDocument requirements with stakeholders, and partner with Legal and Safety teams on broader changes to core dashboards and solutions * * * Local Candidates Only * * * Non-Local candidates will be rejected without consideration. Relocation assistance is not on offer. Preferred Qualifications:SQL and Tableau proficiency preferred2+ years experience with SQL (or similar language aimed at querying relational databases)2+ years of experience working with data visualization toolsKnowledge of Excel (conditional formulas and formatting, charting, etc.)Experience with data management, specifically with validating and auditing data and reports from multiple systemsExperience manipulating large data sets through statistical software or other methodsExperience initiating and driving projects to completion with minimal guidanceExperience processing and analyzing data sets, interpreting them for making business decisionsExperience communicating the results of analyses with product and leadership teams to influence the overall strategy of the productExperience working in a customer service or support organization as well as handling sensitive dataAbility to have effective conversations with cross-functional teams about their support needs and requirementsEnjoys working primarily onsite in a team-oriented environment and highly motivated to provide a positive user experienceStrong project management skillsBA / BS in a field that emphasizes data analysis and visualization (e. g., computer science, social sciences, physical sciences, math, engineering, or statistics), or equivalent work experience W2 only, no Corp to Corp. We are unable to sponsor H1B visas at this time. **eXcell Supports Equal Employment Opportunity** eXcell, a division of CompuCom® Systems, Inc., a global company headquartered in Bellevue, Washington, provides IT staffing services and solutions to Fortune 1000 companies as well as small and medium business. For more information, visit www.excell.com."}