{"jobID": "2469786180", "jobLocation": "New_York_NY", "jobTitle": "Primary Care Physician", "companyRating": null, "companyInfo": {"Website": "www.pagny.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OverviewPhysician Affiliate Group of New York (PAGNY) is comprised of nearly 4,000 physicians and healthcare professionals who provide services to NYC Health and Hospitals Corporation (HHC), the largest public health system in the United States. Our practitioners are highly skilled professionals with outstanding credentials who deliver the highest level of quality healthcare to patients throughout New York City. Equal Employment Opportunity Employer M/F/D/V Morrisania Diagnostic Treatment Center delivers patient-centered, effective and cost-efficient health services. As part of our patient care, we appoint a personal healthcare provider for each patient. The healthcare provider serves as a care coordinator, working with the primary care physicians, nursing staff, social workers and nutritionists to ensure that we meet your medical, psychological and emotional needs. Your healthcare team is always available for you, and you can reach us at any time of day or night. Morrisania is currently seeking a full time and part-time Primary Care Physician to join their dynamic team! Qualified candidate will be certified in either Internal Medicine or Family Medicine.This position offers an excellent salary with benefits, Loan repayment eligibility, fully covered malpractice and much more! ResponsibilitiesPlans, coordinates, delivers and manages comprehensive healthcare services for individuals requiring primary care case management, including but not limited to those enrolled in the NYS Medicaid Managed Care Program: ensures patient/provider continuity and access to timely and appropriate levels of care.  Qualifications Graduation from an approved Medical SchoolLicensed to practice in New York StateCompletion of an approved residency in the specialty and Board Certified or Eligible (if Eligible, must obtain certification within five years of eligibility)Must meet the criteria for credentialing and privileging in the department as defined by the Medical Staff By-Laws of both the facility employing the Physician and the back-up hospital, if these are differentMust meet all NYS Medicaid Managed Care requirements"}