{"jobID": "2814915836", "jobLocation": "Menlo_Park_CA", "jobTitle": "Creative Lead", "companyRating": null, "companyInfo": {"Website": "www.brainrider.com", "Headquarters": "Toronto, Canada", "Size": "1 to 50 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Company DescriptionBrainrider is a marketing services agency with teams in San Francisco, New York, and Toronto helping our clients plan, build, run, and measure beautiful, effective marketing programs.  Our team is the key to our success: a tenacious group of problem solvers who need and want to understand why. We are driven to find better solutions to pipeline marketing challenges and hurdles. We embrace accountability, celebrate passion, and despise good enough.  We work in an open-concept space designed for team collaboration, filled with creativity, productivity, experimentation, and learning. Whether were brainstorming better marketing ideas for our clients or pushing hard to meet a tight deadline, it all happens with teamwork, adaptability, and optimism.Job DescriptionThis is a one-of-a-kind role.  Our client in Menlo Park is one of the most innovative companies on the planet, and we are helping them establish a new in-house creative studio to work with their New Products team.  This new creative studio will be tasked with understanding and communicating the impact of new technologies on how people around the world communicate.  As the Creative Lead, you&apos;ll be working side-by-side with the ECD to build, shape, and manage an A-Team of art directors, copywriters, and project managers that will conceive, create, and execute a vast array of brand and marcom projects for the New Products team.  You have an affinity for new technologies, you are probably an early adopter, your leadership skills naturally attract and bring out the best from those you work with, and you have an eye for top shelf creative talent and great work.  You&apos;re also eager to get your hands dirty, working on conceptual design projects alongside the team. You don&apos;t want your own office, and you don&apos;t want to spend all of your time in management meetings. You want to be in the studio, hands-on, helping make magic happen.QualificationsYou&apos;re a good fit for this role if the following describe you: You look through Behance and Dribbble designer profiles for fun, and you could immediate share 5-10 great ones you&apos;ve seen this month.Your previous teams will have great things to say about your leadership and mentorship, and probably have already posted such recommendations on your LinkedIn profile.Your design portfolio showcases a range of conceptual b2b brand development, illustration, motion, print, and digital work with an emphasis on whatever your creative superpower is.You have the ability to extract the key elements of a story from a client conversation or brief, then tell that story creatively in a simple, compelling, persuasive way. Additional InformationCompensation: annual salary plus 3 weeks PTO, paid stat holidays, medical, dental, vision, 401(k), and a variety of perks including food and transportation.  Impressive candidates selected to advance through our rigorous evaluation and hiring process will be contacted."}