{"jobID": "2808981998", "jobLocation": "Seattle_WA", "jobTitle": "Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.expeditors.com", "Headquarters": "Seattle, WA", "Size": "10000+ employees", "Founded": " 1979", "Type": " Company - Public (EXPD) ", "Industry": " Transportation & Logistics", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " C.H. Robinson, Kühne + Nagel, Deutsche Post DHL"}, "estimatedSalary": "53000", "jobDescription": " Company DescriptionWere not in the shipping business; were in the information business -Peter Rose, Expeditors Founder  Global supply chain management is what we do, but at the heart of Expeditors you will find professionalism, leadership, and a friendly environment, all of which foster an innovative, customer service-based approach to logistics. 15,000 trained professionals250+ locations worldwideFortune 500Globally unified systemsOUR GROUP Global Business Operations vision is to inspire a culture of efficiency throughout the network, empowering us to move together as one, enabling growth and delivering consistent world class service.Job DescriptionPerform rigorous data analysis using advanced technical skills in order to develop insights into our data enabling the company to make better decisions, strengthen customer service, and increase profits. Continually strive to expand the utilization of our data, grow analysis techniques and broaden our application for both ourselves and our customers.  RESPONSIBILITIES Guide broader strategy using advanced analytic knowledge and techniquesEnsure all data projects are performed using the highest standards for qualityIdentify, analyze and interpret trends or patterns in complex data sets to drive global business decisionsWork closely with business stakeholders to translate requirements into intricate data models used to lead global solutionsUnderstand the processes and standards in place to effectively and accurately cleanse data for each project.Locate and define new process improvement opportunities through independent researchPresent findings in a clear and concise manner to broad and diverse audiencesQualificationsMaster Degree (preferred) or Bachelor Degree in the areas of Information Management, Computer Science, Statistics, or related fieldExperience with database design, navigation, and data extraction in SQL server, DB2 DBMS or similarExperience using data visualization platforms such as Power BI, Tableau, or similarExperience using Python or R for data cleansing and analysis.Strong analytical skills with the ability to collect, organize, analyze and disseminate significant amounts of information with attention to detail and accuracyExperience working with Process Mining technology a plus Additional InformationExpeditors offers excellent benefits Paid Vacation, Holiday, Sick TimeHealth Plan: Medical, Prescription Drug, Dental and VisionLife and Long Term Disability Insurance401(k) Retirement Savings PlanEmployee Stock Purchase PlanTraining and Personnel Development Program All your information will be kept confidential according to EEO guidelines.  Position is based in Seattle, Washington USA. Relocation is not offered."}