{"jobID": "2823181947", "jobLocation": "Berkeley_CA", "jobTitle": "Campus Injury Data Intern- Intercollegiate Athletics (5171U", "companyRating": null, "companyInfo": {"Website": "www.universityofcalifornia.edu", "Headquarters": "Oakland, CA", "Size": "10000+ employees", "Founded": " 1868", "Type": " College / University", "Industry": " Education", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The University of California, Berkeley, is one of the world's most iconic teaching and research institutions. Since 1868, Berkeley has fueled a perpetual renaissance, generating unparalleled intellectual, economic and social value in California, the United States and the world. Berkeley's culture of openness, freedom and acceptanceacademic and artistic, political and culturalmake it a very special place for students, faculty and staff.  Berkeley is committed to hiring and developing staff who want to work in a high performing culture that supports the outstanding work of our faculty and students. In deciding whether to apply for a staff position at Berkeley, candidates are strongly encouraged to consider the alignment of the Berkeley Workplace Culture with their potential for success at http://jobs.berkeley.edu/why-berkeley.html.  Application Review Date  The First Review Date for this job is: April 16, 2018  Departmental Overview  The Department of Intercollegiate Athletics consists of more than 275 staff members and coaches and sponsors 30 varsity sports programs. These 30 programs include more than 850 student-athletes who participate in the various sports programs annually within the National Collegiate Athletics Association (NCAA). We are currently seeking a Campus Injury Data Intern who will work within the department's Sports Medicine unit.  The purpose of this positions it to assist in training on data collection for Cal's participation in Pac 12 research and data collection, including but not limited to the Pac 12 Sports Injury Registry Management and Analytics Program (SIRMAP) and the SyncThink Concussion Program. This work will be performed under the supervision of the Associate AD for Performance, Health and Welfare (or designee) and will comply with all University regulations and IRB rules, as well as medical privacy laws and concerns.  Additionally, the positon will review data for quality control, submit data after approval is given, and work with the Pac 12 and their designees in designing training for staff and data submission. Management of data is vital to the Pac 12's ability to make decisions related to injury provision. And, campus contacts and collaborations benefit the Pac 12 Conference as well as Cal Athletics, in terms of future funding and initiatives. ResponsibilitiesAs part of the Pac 12 Sports Injury Registry Management and Analytics Program (SIRMAP) and Pac 12 Sync-Think project, this position is responsible for the data collection process, review of data and submission of approved data set.Provide quality control review of all sports injury data entered by Department staff each day.Learn protocols from Pac 12 and vendor to be able to enter information and train staff in data entry in to agree upon program/format.Train Sports Medicine and department staff on the SIRMAP and Sync Think systems for data entry.Complete campus outreach to other campus units to assist in finding areas for collaboration.Other duties as assigned. Required Qualifications Acquires specialized knowledge of program activity and best practices.Problem-solving skills; multi-task, work with frequent interruptions, and effective listener.Basic verbal and written communication skills in the English language.Must be proficient in the use of basic computer applications.Ability to feedback and interpret data to staff a professional format.Strong organizational and interpersonal skills.Ability to maintain strict confidentiality.Self-motivated to work effectively and efficiently.Ability to deal with a diverse department and work collaboratively with everyone.Strong interpersonal skills, analytical skills, service orientation, active listening, critical thinking, attention to detail, ability to multi-task in a high volume environment, organizational skills, effective verbal and written communication skills, sound judgment and decision-making. Salary&Benefits;  For information on the comprehensive benefits package offered by the University visit:  http://ucnet.universityofcalifornia.edu/compensation-and-benefits/index.html  How to Apply  Please submit your cover letter and resume as a single attachment when applying.  Conviction History Background  This is a designated position requiring fingerprinting and a background check due to the nature of the job responsibilities. Berkeley does hire people with conviction histories and reviews information received in the context of the job responsibilities. The University reserves the right to make employment contingent upon successful completion of the background check.  Mandated Reporter  This position has been identified as a Mandated Reporter required to report the observed or suspected abuse or neglect of children, dependent adults, or elders to designated law enforcement or social service agencies. We reserve the right to make employment contingent upon completion of signed statements acknowledging the responsibilities of a Mandated Reporter.  Equal Employment Opportunity  The University of California is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status. For more information about your rights as an applicant see: http://www.eeoc.gov/employers/upload/poster_screen_reader_optimized.pdf  For the complete University of California nondiscrimination and affirmative action policy see:  http://policy.ucop.edu/doc/4000376/NondiscrimAffirmAct"}