{"jobID": "2767359352", "jobLocation": "San_Jose_CA", "jobTitle": "Behavior Technician", "companyRating": null, "companyInfo": {"Website": "www.centerforautism.com", "Headquarters": "Woodland Hills, CA", "Size": "1001 to 5000 employees", "Founded": " 1990", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Behavior Technician Job- San Jose, CA  Apply Now  BackWhy You’ll Love this Job!  Are you compassionate, a great listener, and looking for a way to make a real difference in the world? Would you enjoy having a position where your people skills would be appreciated and put to good use? Does the opportunity for advancement, bonuses and rewards sound appealing? If so, you are the right fit for our part-time, entry level Behavior Technician role!  As a Behavior Technician with our company, you would help others succeed in life as you work one-on-one with people of all ages who have autism and related disorders. Not interested in being stuck in an office? Your work would take you out into various community settings, such as homes and schools.  With no experience necessary, this is the perfect opportunity to get your foot in the door with a company that will fully train you for success. Apply today!Perks & BenefitsCompetitive hourly rate commensurate with experience and geographic regionComprehensive paid initial and ongoing trainingTravel time pay and mileage reimbursementPaid Sick Time & opportunities for Paid HolidaysAccess to Mentorship ManagerSponsorship to earn credentials to advance your career Board Certified Autism Technician (BCAT)Registered Behavior Technician (RBT) Free Continuing Education to maintain your credentialPotential opportunities for quarterly bonuses and rewards incentive programFlexible part-time schedulesAnnual performance reviews with potential for wage increasesMonthly socials, trainings & awardsPaid Clinic timesOpportunities for career advancement with increased compensation and benefits at each levelEducational Assistance Program, Master’s in psychology program, and Board Certified Behavior Analyst (BCBA) preparation program Free supervision and training for maintaining credentialsOpportunities for paid internshipsTherapist Rewards ProgramEmployee discounts for cell phone service, restaurants, retail stores, travel, recreation, and more Training Opportunities Registered Behavior Technician (RBT) CredentialBoard Certified Autism Technician (BCAT) CredentialBoard Certified assistant Behavior Analyst (BCaBA) coaching and supervisionBoard Certified Behavior Analyst (BCBA) supervision and guidance, and more!QualificationsEager, energetic and passionate demeanorHigh School Diploma or EquivalentYour own vehicle with proof of auto insurance or another reliable means of transportationMust pass TB test and criminal background checkAvailability to work 3 weekday afternoon or evening shifts (2-8pm) and 1 weekend day shift (9am-5pm)About CARD The Center for Autism and Related Disorders (CARD) is among the world’s oldest and largest autism treatment providers. Founded in 1990, CARD now has more than 100 locations throughout the U.S. and internationally. As CARD continues to add new locations, we are always hiring both entry level and experienced individuals. If you are interested in working with individuals affected by autism spectrum disorder, we invite you to explore CARD’s job postings with the knowledge that CARD provides all training, including extensive initial and ongoing training and support.  With locations open seven days a week, CARD offers both traditional and flexible workdays and hours, and a clear career path with tuition assistance for employees who qualify. Find out more about the rewarding job of working with individuals affected by autism and the opportunities for advancement and travel.  CARD is an Equal Opportunity Employer (EOE).Interviewing and hiring immediately for multiple Behavior Technician job openings near you.Apply now!Apply Now  Back  Type: Part Time (Hourly)  Date Posted: Mon, 30 Apr 2018 00:26:10 GMTJob Number: 11402"}