{"jobID": "2645534340", "jobLocation": "Boston_MA", "jobTitle": "Cryptologic Technician", "companyRating": null, "companyInfo": {"Website": "www.navy.com", "Headquarters": "San Diego, CA", "Size": "1001 to 5000 employees", "Founded": " 1775", "Type": " Government", "Industry": " Government", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " \"About This JobAnalyzing encrypted electronic communications. Jamming enemy radar signals. Deciphering information in foreign languages. Maintaining the state-of-the-art equipment and networks used to generate top secret intel. This is the highly specialized work of the Enlisted Sailors in the Navy Cryptology community.Their responsibilities include: Collecting, analyzing and reporting on communication signals Utilizing computers, specialized computer-assisted communications equipment and video display terminals Serving as an important part of the Information Dominance Corps in its mission to gain a deep understanding of the inner workings of adversaries and develop unmatched knowledge of the battlespace during wartimeWithin Navy Cryptology, there are distinct focus areas that have their own training paths and job descriptions. Each CT role works under the oversight of Cryptologic Warfare Officers (four-year degree required) or Cyber Warfare Engineers (four-year degree required) and potentially both.Cryptologic Technician Interpretive (CTI) CTIs serve as experts in linguistics (including Arabic, Chinese, Korean, Persian-Farsi, Russian and Spanish) and deciphering information in other languages. Their responsibilities include: Collecting, analyzing and exploiting foreign language communications of interest Transcribing, translating and interpreting foreign language materials Providing cultural and regional guidance in support of Navy, Joint Force, national and multinational needsCryptologic Technician Technical (CTT) CTTs serve as experts in airborne, shipborne and land-based radar signals. Their responsibilities include: Operating electronic intelligence-receiving and direction-finding systems, digital recording devices, analysis terminals, and associated computer equipment Operating systems that produce high-power jamming signals used to deceive electronic sensors and defeat radar-guided weapons systems Providing technical and tactical guidance in support of surface, subsurface, air and special warfare operationsCryptologic Technician Networks (CTN) CTNs serve as experts in communication network defense and forensics. Their responsibilities include: Monitoring, identifying, collecting and analyzing information Providing computer network risk mitigation and network vulnerability assessments and incident response/reconstruction Providing network target access tool development Conducting computer network operations worldwide in support of Navy and Department of Defense missionsCryptologic Technician Maintenance (CTM) CTMs serve as experts in the preventive and corrective maintenance of sophisticated cryptologic equipment, networks and systems. Their responsibilities include: Installing, testing, troubleshooting, repairing or replacing cryptologic networks, physical security systems, electronic equipment, antennas, personal computers, auxiliary equipment, digital and optical interfaces, and data systems Configuring, monitoring and evaluating Information Operations (IO), Information Warfare (IW) systems and Information Assurance (IA) operationsCryptologic Technician Collection (CTR) CTRs serve as experts in intercepting signals. Their responsibilities include: Analyzing and reporting on communication signals using computers, specialized computer-assisted communications equipment, video display terminals and electronic/magnetic tape recorders Exploiting signals of interest to identify, locate and report worldwide threats Providing tactical and strategic signals intelligence, technical guidance, and information warfare support to surface, subsurface, air and special warfare units.\""}