{"jobID": "2821226216", "jobLocation": "San_Jose_CA", "jobTitle": "Senior Claims Examiner, Workers' Compensation", "companyRating": "3.7", "companyInfo": {"Website": "www.keenan.com", "Headquarters": "Torrance, CA", "Size": "501 to 1000 employees", "Founded": " 1972", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "81000", "jobDescription": " Keenan & Associates is a successful insurance brokerage and consulting firm meeting the insurance needs of hospitals, public entities and California school districts. Keenan specializes in providing consulting services for employee benefits, workers' compensation, loss control services, Keenan Financial Services, and property & liability to school districts and hospitals throughout California. We have seen continuous progress and expansion, making us the 22nd largest consulting firm in the United States. This growth positions us to continue to lead the industry into the 21st century.  We currently have an exciting, career opportunity for a Sr. Claims Examiner, located in our San Jose, CA office. The Sr. Claims Examiner will be responsible for administration and management of work comp claims. The successful candidate will be tasked with handling complex legal issues, litigation prevention and control, negotiation of settlements, lien resolutions and cost containment.  Description of duties & responsibilities: Incept all new Indemnity claims for the designated client, including initial contacts, investigation and compensability determination. Set all appropriate reserves. Administer all applicable indemnity and medical benefits pursuant to the California labor code. Maintain client/claimant satisfaction. Identify, prevent and mitigate potential penalties. Manage all cases pursuant to client service instructions and applicable California law. Monitor and proactively direct litigation. Report SIU/Fraud and identify and pursue subrogation. Report excess files to the Reinsurance Manager in a timely manner.  Essential Skills and Knowledge: Candidates should have five years of California claims examiner experience and a Self-Insurance Certificate, or the ability to pass Self-Insurance Test within one year of hire. WCCP a plus. Experience in handling school district claims is a plus. Effective in oral and written communication. Will work with all levels of Client, Vendor, and Keenan employees  Special Skills Preferred: * SIP Certificate * Experienced Adjuster Designation  Software: Microsoft Outlook, Word and Excel  Keenan provides a competitive compensation package. We encourage teamwork and employee initiative - people working together is what makes Keenan a success. We invite you to share in the commitment of preserving our warm tradition, reputation and dedication to our clients. After all…What you do makes a difference!  Please submit your resume to msun@keenan.com . For more information, visit our website at www.keenan.com  Keenan provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, creed, sex, sexual orientation, gender identity, national origin, age, disability, veteran, marital, or domestic partner status. Keenan is committed to a diverse workforce and is an affirmative action employer."}