{"jobID": "2816511436", "jobLocation": "Austin_TX", "jobTitle": "Hadoop Developer - Data Scientist Remote", "companyRating": "2.6", "companyInfo": {"Website": "www.windstreamtalent.com", "Headquarters": "Little Rock, AR", "Size": "10000+ employees", "Founded": " 2006", "Type": " Company - Public (WIN) ", "Industry": " Telecommunications", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "101000", "jobDescription": " The Hadoop Developer position in Network Business Intelligence - Engineering Applications (NBI-Apps) will be working in a fun, challenging, fast-paced environment using Agile methodologies to develop solutions in a Hadoop cluster. This is an opportunity to be involved from the ground up on an entirely new Hortonworks Hadoop installation. Projects are in support of the Windstream Engineering organization and include ingestion, manipulation, and analysis of a variety of data types including: equipment and circuit inventory, Element Management System content, equipment alarms, performance metrics, and equipment utilization statistics. This system will impact data quality initiatives, capacity management decisions, network spares tracking, automated network provisioning, and network fault prediction; among other Windstream efforts.  We are looking for a Hadoop Developer responsible for implementing the ingestion strategies, data transformations, and analytic processes necessary to supply our Business Intelligence team with prepared insights. Your primary focus will be development of Nifi and Sqoop processes for data ingestion, Spark jobs and Hive tables for data transformation, and consulting on adoption or incorporation of all new Hadoop ecosystem software. Additionally; skills and experience with SQL scripting, Python scripting, general data science, Linux command line tools, and graph solutions will be necessary to implement planned Hadoop projects. The position demands a self-starter who is comfortable engaging other developers to achieve goals and working across functional groups. Job Responsibilities: · Development of data preparation and data analytics solutions in a Hadoop environment.  · Building reusable code and libraries for future use.  · Manage projects to completion through coordination of cross-functional groups.  · Manage work through Agile tools/methodology, collaborative repositories, issue tracking platforms, and wikis. Essential Skills: · Extensive experience in software development and planning.  · Strong experience with Hadoop technologies including but not limited to: Nifi, Sqoop, Hive, Pig, Spark, and HBase.  · Proficiency in SQL, Python, and Linux command line tools.  · Drive to succeed and improve personally to add value to the role, team, and company.  · Self-starter, relentlessly curious, resourceful, collaborative, and inventive.  · Good team player and communicator.  · Highly organized and meticulous.  · Positivity, and the desire to solve problems in elegant and creative ways. Desired Skills: · Experience with a variety of Relational databases including: Oracle, MySQL, Postgres, MS SQL Server  · Background in JanusGraph, Apache Ranger, Apache Atlas, and graph-based solutions.  · Networking understanding  · Proficiency in Linux server administration  · Experience and/or familiarity with various functional areas pertaining to telecommunications networks.  o Circuit design  o Traffic engineering  o Network system design  o Equipment planning  o IP/Transport/Access planning/engineering  · Proficient understanding of code versioning tools, such as Git.  · Ensuring the quality of applications through unit testing.  · Experience with use of and/or development against some or all the following platforms.  o JIRA  o Confluence  o Fisheye  · MS Visio(or comparable).  · Agile Planning understanding.  · Experience working with large, disparate data sets. Position can be based in any US location.Minimum Requirements forEducation and Experience for II:College degree and 2-4 years related experience or 6 years equivalent related Engineering/Technical experience or a combination of education and related Engineering/Technical experience required.Desired Qualifications: Ability to stay current with the economical and technological developments in the industry.Minimum Requirements for III:College degree in a Technical or related field and 3-5 years professional level experience with 0-1 year supervisory experience for roles with supervision; or 7 years professional level related Technical experience with 0-1 year supervisory experience for roles with supervision; or an equivalent combination of education and professional level related Technical experience required."}