{"jobID": "2827629927", "jobLocation": "San_Jose_CA", "jobTitle": "General Dentist, Pediatrics", "companyRating": "3.2", "companyInfo": {"Website": "www.westerndental.com", "Headquarters": "Orange, CA", "Size": "5001 to 10000 employees", "Founded": " 1903", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " InterDent"}, "estimatedSalary": "164000", "jobDescription": " Requisition Number 18-1974 Title General Dentist, Pediatrics City San Jose State CA Zip Code 95122 Description**Earning Potential of $150k-$250k (based on experience)** Must have a current dental license for the state in which you wish to practice - New Grads Welcome!  We are seeking a full-time general dentist who loves to ONLY treat children for our office in San Jose. This is a fantastic opportunity for the right dentist who has experience in pediatric dentistry or would like to be trained in pediatric dentistry. Join a team of quality-focused professionals that you will be proud to be affiliated  with. We provide excellent trained support staff in a fun and friendly professional work environment.  At The Children's Dental Group you will enjoy working in a fully-equipped dental facility where all of the tools and supplies you need to be successful will be ready and waiting for you. Your days will be productive and you will enjoy not having to worry  about organizing your office, ordering supplies, managing staffing needs, and dealing with insurance billing issues. We also provide solid administrative and technological support backed by outstanding management systems. Together, our office can deliver a  high level of care that will create patients for life. Our Dentists are expected to: • Provide high quality Pediatric dental care to your patients  • Educate patients and parents on their Pediatric treatment including preoperative and postoperative care  • Communicate and build a foundation of trust and respect between you and the patient  • Partner with other specialists and general dentists to provide the best optimal dental care  • Be able to travel to various dental practices in your area  We offer Immigration Sponsoring Programs including: OPT, H-1B, TN, and Green Card in select regions. We are a Military Friendly Employer. With over 200 offices throughout California, Arizona, Nevada, and Texas, consider us as a place to practice dentistry on your off-duty days or choose us as your post-service employer. Let us help you with a smooth  transition. We can help you navigate the required dental credentials you will need to practice. Opportunities available for Active Military, Military Veterans, and Military Spouses. RequirementsWe'll need you to provide: • Must have a current dental license for the state in which you wish to practice - New Grads Welcome!  • Nitrous Sedation Certificate per State requirement  • Current CPR Card  • NPI Number  • DEA Certificate  To apply please email: kwiginton@westerndental.com"}