{"jobID": "2796919720", "jobLocation": "New_York_NY", "jobTitle": "National Retail eCommerce Account Manager, Sr", "companyRating": null, "companyInfo": {"Website": "www.sage.com", "Headquarters": "NEWCASTLE-UPON-TYNE, United Kingdom", "Size": "10000+ employees", "Founded": " 1981", "Type": " Company - Public (SGE.L) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Salesforce, Intuit, Microsoft"}, "estimatedSalary": null, "jobDescription": " Job Title National Retail eCommerce Account Manager, Sr Advert Sage energizes the success of businesses and their communities around the world through the use of smart technology and the imagination of our People. Sage has reimagined business and brings energy, experience and technology to inspire our customers to fulfil their dreams. We work with a thriving community to entrepreneurs, business owners, tradespeople, accountants, partners and developers who drive the global economy. Sage is a FTSE 100 company with 14,000 employees in 24 countries.  Sage is committed to Equal Employment Opportunity and providing reasonable accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment and need special assistance or an accommodation to use our website to apply for a position, please contact us at recruitingna@sage.com. We evaluate requests for reasonable accommodation on a case-by-case basis.  All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, color, age, religion, sex, sexual orientation, gender information, gender identity, national origin, protected disability or veteran status.  EOE AA/M/F/Vet/Disability  Sage Software is an Equal Opportunity Employer. We comply with the laws set forth in the EEO is the law poster: http://bit.ly/2l9bz7h Job Description Responsible for online sales of Sage products within one or more of our top retailers and Sage eStore. Represent Sage to the eCommerce decision makers at the retailers, and the eCommerce side of retailers to the company, in all sales and marketing activities. Retention and growth of the account(s) will have a strategically significant impact on the success and growth of the company. Must utilize strategic thinking to create joint business plans, influence internal stakeholders, and partner with retailers to develop merchandising and promotional plans to drive revenues and brand awareness. Key Responsibilities Key accountabilities and decision ownership: Effectively communicate online specific programs and objectives to both internal and external stakeholdersManage and maintain contractual agreements with retailer(s) by engaging appropriate stakeholdersMaintain cross-functional internal and external relationshipsHold external quarterly ecommerce business meetingsPartner with online retailers and Sage brick and mortar retailer sales teams on category management and joint business planning, leveraging joint multifunctional teamsDemonstrate strong strategic sales and negotiation skillsUtilize strong communication with all stakeholders regarding customer, channel andindustry insights and competitive trendsCreate Annual Operating Plan (AOP), measured by growth of Key Performance Indicators (KPIs)Effectively manage promotional and digital marketing dollarsSkills, know-how and experience:6 years of relevant experienceProven track record of eCommerce /omnichannel sales and marketingDemonstrated leadership skills, exhibiting a high degree of drive and energy and the ability to consistently produce results.Innovative and creative thinker and problem solver who can manage the details without losing sight of the strategic goal.Highly analytical, proficient in Excel, MS Access, etc...Demonstrated success in launching and selling products to retail customers. Preferred Prefer experience in “Fortune 500” company, or in the online software sales related industries.Technical / professional qualifications:Master’s degree or equivalent work/education experience (minimum 6 years experience online marketing management and/or National Retail Marketing and analytics)"}