{"jobID": "2682447120", "jobLocation": "Boston_MA", "jobTitle": "Staff Data Analyst, Data Science", "companyRating": "3.8", "companyInfo": {"Website": "www.tivo.com", "Headquarters": "San Carlos, CA", "Size": "1001 to 5000 employees", "Founded": " 1997", "Type": " Company - Public (TIVO) ", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Apple, Cisco Systems, Roku"}, "estimatedSalary": "78000", "jobDescription": " Hi. We’re TiVo. At our core, we’re innovators who continuously seek to fuel the ultimate entertainment experience. We touch the lives of binge-watching, music-loving, entertainment fanatics every day by inventing and delivering beautiful user experiences and enable the world’s leading media and entertainment providers to nurture more meaningful relationships with their audiences.  The Staff Data Analyst, Data Science will research; analyze; design; program; debug; author custom research, data validation, and develop data pipelines; and create products to be implemented into production. This person will lead the development of custom research, proof-of-concept data pipelines, exploratory data mining, and new product creation working in both transactional and data warehouses cross-functionally with a team of Data Scientists and Big Data engineers to extract actionable insights. This person will design, implement and tune tables, queries, and develop scripts. This role requires an ability to work in an agile scrum-driven environment delivering new and innovative products, communicating and distilling results to technical and non-technical audiences of internal and external customers for Analytics products, and keeping up-to-date with relevant technology in order to maintain and improve functionality for authored research. Required Professional Experience:8+ years of progressive experience as a Data Engineer, Data Analyst, Data Scientist or related occupationMust have at least 5 years of prior work experience in the following:Demonstrable programming skills in large-scale data analysis with complex SQL and Python or R.Excellent leadership and communication skills to influence and lead teams promoting Data Science and Data Analysis across an organization.Ability to quickly understand data patterns within large quantities of data and reference key characteristics using visualization techniques.Leverage strong math skills and statistical knowledge for data mining and data analysis related to describing audience behavior and consumption of digital media.Proven experience working autonomously leading teams to shape new and highly critical business opportunities to monetize big data research.Ability to provide consultative guidance across organization’s business units on how best to utilize data for decision making and building organizational capabilities needed to furthering data as an asset.Worked with large data volumes, including processing, transforming and transporting large-scale data using a big data stack: M/R, HiveQL, Spark, Presto, PostgreSQL, etc.Experience with analytic architecture implementation on a major RDBMS including at least one of the following: Oracle, MySQL, and/or SQLServer.Amazon Web Services, including at least one of the following: on-demand computing, S3, and/or equivalent cloud computing approach.Building custom data pipelines using a scripting language such as Python.Extensive experience performing data validation to ensure accuracy and integrity throughout big data stack.Experience with big data stack of technologies, including Hadoop, HDFS, Hive, and HBase.Excellent troubleshooting and analytical skills.Required Education:Bachelor’s degree or foreign equivalent in Engineering, Computer Science, Mathematics, Physics, or related field. Advanced degree strongly preferred.Benefits & Perks Our employees and their families are important to us and our comprehensive pay, stocks and benefits programs reflect that. TiVo supports personal well-being, builds financial security, and enables employees to share in the success of TiVo. Rewards include: Competitive compensation (salary, equity, and bonuses) and comprehensive benefits designed to foster work-life balance, care for your health, protect your finances, and help you save and invest for the future.Generous paid time away from work including vacation, holidays, sick time, and 2 days of paid time off each year to serve and learn through TiVo Community Outreach.Great perks, which vary by location and can include: employee discounts, transportation reimbursements, subsidized cafes and fitness facilities, conveniences such as dry cleaning and car washes, and recycling programs. See more at https://www.tivo.com/jobs/culture/benefits-at-tivo  TiVo Corporation is an Equal Employment Opportunity Employer"}