{"jobID": "2820729479", "jobLocation": "Boston_MA", "jobTitle": "Marketing Data Analyst II", "companyRating": "3.5", "companyInfo": {"Website": "www.prac.com", "Headquarters": "Boston, MA", "Size": "1001 to 5000 employees", "Founded": " 1982", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Arbella Insurance, Safety Insurance"}, "estimatedSalary": "65000", "jobDescription": "The Data Analyst II is responsible for developing, publishing, understanding, improving, reconciling and maintaining reports and data sets for the department. The analyst will be an expert resource on all marketing related data and reporting. The role is also responsible for producing ad hoc analysis on a wide variety of insurance and marketing topics as necessary. He/she also serves as a liaison between the data team and various other teams. Responsibilities:Develop data sets to be used by other members of the department and other teams.Maintain programs to automate reporting processes, update documentation and publish results within deadlines.Reviews existing weekly, monthly, quarterly and annual reporting for accuracy.Creates new reports or elements in response to ad hoc data analysis.Updates data sets on a timely basis, analyzing actual data to improve processes.Troubleshoots as necessary when the automated processes fail or reports show inconsistencies.Answers complex data-related inquires and provides data to internal customers as requested.Other job-related responsibilities as required.Attend meetings and act as the subject matter expert for marketing data and analytical needs of the marketing department.Requirements:Expertise researching raw data and using that data to build analytical data sets.Expertise using relational database products, including writing data queries in SQL, building, updating and maintaining data sets in SQL.Expertise manipulating data in Excel at an advanced level.Proficient with ETL tools. Experience with MS SQL Server and SSIS preferred.Proficient in TableauUnderstands concepts in insurance and marketing analytics such as sales funnels, close ratio’s, quote data, and other online metrics.Ability to communicate complex ideas and analysis in a clear and concise manner in both verbal and written forms.Education & Experience:Creative problem solving experience gained through related coursework and work experience.3 or more years of experience with relational database tools and concepts.BA/BS degree in quantitative field of study; advanced degree preferred.Property and Casualty Insurance experience preferred.About Plymouth Rock Plymouth Rock is a leading auto insurance provider serving more than 650,000 customers across Connecticut, Massachusetts, New Jersey and New Hampshire. Tapping into its 30+ years of industry experience, Plymouth Rock has pioneered a new way to do car insurance for consumers. Combining the local knowledge and expertise of independent agents, with the power and ease of doing business online, Plymouth Rock has changed the insurance lifecycle by giving consumers choice – to do business the way they want.   Plymouth Rock is headquartered across from South Station in Downtown Boston, with offices across New England and New Jersey. With more than $1 billion in premiums underwritten and serviced, the Plymouth Rock Group employs over 1,500 people and writes insurance through 800+ independent agents. Plymouth Rock Assurance Corporation holds an A.M. Best rating of “A-/Excellent.”"}