{"jobID": "2660052365", "jobLocation": "Boston_MA", "jobTitle": "Cloud Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.statestreet.com", "Headquarters": "Boston, MA", "Size": "10000+ employees", "Founded": " 1792", "Type": " Company - Public (STT) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " J.P. Morgan, BNY Mellon, Northern Trust"}, "estimatedSalary": "55000", "jobDescription": "In January 2018, we launched one of the industry’s largest technical transformation projects, in effect building a new bank from the ground up. We’re using the same technologies that Silicon Valley giants are using: aggressive use of multiple public clouds, building our own private cloud to achieve even better performance, pushing out microservices into what will be one of the largest Kubernetes installations in the world, leveraging immutable storage to process and store hundreds of terabytes of data a day, transforming our industry through application of distributed ledger technology and cognitive computing, aggressively participating in open source communities driving our systems.This isn’t a traditional banking role. This is a chance to push your technical skills with people more comfortable in a technology firm than an investment bank, but solving real problems that affect anyone with any form of savings worldwide . We don’t expect you to wear a suit, we don’t expect you to not be able to tell your friends what you’re working on, we don’t expect you to sit in meetings 5 hours a day.Who we areWe are a ‘change the bank’ challenge team, working with internal and external partners to develop advanced, digitally enabled solutions that drive significant value to our clients and operating business lines.Core to these efforts are the engineering, build and operation of State Street's multi public cloud technology infrastructure. In short, we are assembling a team of cloud experts to provide global solutions for our internal groups as well as other financial giants.What you will doAs a Cloud Data Analyst, we’ll look for you to utilize your domain expertise to tackle the complexities of building and integrating data-centric applications. These applications will transform and enrich digital exhaust emanating from business applications and the infrastructure services supporting them into a collection of insights tailored to address operational and resiliency imperatives. You will be responsible for synthesizing machine generated data (platform and infrastructure metrics) to understand operational performance, identify key trends and initiate proactive alerts. Given State Street’s global footprint and warehouse computing, this role will be instrumental in the use of machine learning and big data analytics to enable operational resiliency of our next generation platforms and applications. You will develop custom algorithms to aid in data sanitization, correlation and insight generation using open source machine learning packages, statistical routines and mathematics libraries Prototype data models and potential enrichment data sources to address high level IT operational requirements and metricsYou will write specifications based on prototyping outcomes for large scale data centric applications that operate in a real-time mannerYou will build and maintain data driven infrastructure services, focused optimization models, cost forecasting algorithms and sizing guidelinesYou will create reporting templates using business intelligence tools to track and monitor key performance metrics / indicatorsMaintain knowledge of developments / trends in use of data for operational management of large platforms utilizing public cloud provider servicesWho you areYou have strong data wrangling / data transformation abilities across large, complex non-relational datasets using languages such as R, Python and SQL.You have prior data mining / analytics experience using packages such as NumPy, SciPy, pandas, scikit-learn, dplyr, ggplot2.You have strong analytical skills with the ability to collect, organize, analyze and report on significant amounts of information. Attention to detail and numerical accuracy is a must for this role.You have proficiency using big data platforms such as Spark, HBase, Flink and Kafka.You have a good understanding of interconnections between complex systems, large scale web architectures and have general knowledge of agile software development concepts and processes.Ideally, you have 5 yrs of experience, of which 2 has been in a role leveraging AWS, Azure or GCP.State Street appreciates the value diversity (in all its forms) brings to our firm.SSTGTS18"}