{"jobID": "2514367040", "jobLocation": "Mountain_View_CA", "jobTitle": "Sr. Compensation Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.purestorage.com", "Headquarters": "Mountain View, CA", "Size": "1001 to 5000 employees", "Founded": " 2009", "Type": " Company - Public (PSTG) ", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " EMC, NetApp, 3PAR"}, "estimatedSalary": "136000", "jobDescription": "About Us Our ambitious goal of helping innovators build a better world with data started in 2009. Today, we are one of the fastest growing enterprise companies in history, surpassing $1B in revenue at the end of 2017.  The world is experiencing a technological revolution driven by AI, machine learning, virtual reality, quantum computing and self-driving cars -- all of which require large amounts of data and put Pures technology literally in the drivers seat. Our solutions deliver real-time, secure data to power mission-critical production, DevOps, and modern analytics in multi-cloud environments. With a Satmetrix NPS score in the top 1% of B2B companies worldwide, our customer-first culture and commitment to innovation create a thriving company that employees, customers, partners, and investors love. For more information on our business, check out the corporate fact sheet here. The Compensation Team at Pure Puritans come from various backgrounds and we thrive off of challenging the norm. This cross pollination of backgrounds led to numerous ground breaking ideas and has helped us build one of the most reliable and easy to use storage systems in the industry. We aim to hire the best and brightest people, who excel in a cutting edge, fast paced, collective and open environment. We are seeking enthusiastic individuals to solve real world problems while having fun along the way. What You Will Be DoingServe as the analytical point of contact for Total Rewards programs such as compensation reviews, market analysis, role classification, workforce classification projects, rewards-related surveys, financial reporting on compensation expenses, and special projectsIdentify and present insights on Total Rewards programs to leaders at PureCollaborate with HR Operations and HR Business Partners to ensure world-class and seamless rewards outcomes for PuritansSupport Compensation Committee work as needed in support of improvements to existing programs and detailed proposals for new global rewards offeringsWork collaboratively with cross-functional stakeholders which includes: Finance, IT, HRIT, Legal at corporate and local levels to ensure world-class and seamless rewards outcomes for PuritansGuide managers and other decision-makers through complex compensation decisionsBuild and refine tools for supporting Total Rewards programs and operationsWhatYouBringtotheTeamBS or BA in Economics, Business Administration or another field that uses quantitative analysis8+ years of experience in related compensation analyst/consultant role with some benefits experience or exposure to result in expertise in any/all of the compensation disciplines: salary and incentive plan design and administration, sales compensation, international compensation, equity compensation, executive payDemonstrable partnership, influencing skills, executive-to-employee level communication skillsA passion and belief in customer-first mindset, what (who) are we solving for...Ability to lead communications, training and development to upskill manager capabilities in leveraging compensation philosophy, platform and toolsExperience working with employee engagement survey and people analyticsExperience in one or more of the following compensation disciplines: salary and incentive plan design and administration, sales compensation, international compensation, equity compensation, executive payExperience with global HRIS Systems and applications integrationsExperience working across disciplines in HRExperience with employment law and practicesMust be willing and able to work in an open office, team environment.No Storage? No Problem. We look for talent and culture first, specific technologies second, so once you decide Pure is the right place for you, we will match you with the right project to start with. Plus, we like people to have the ability to do different things and be constantly learning, so we encourage our engineers to move around to different teams and project across the company. Pure creates opportunities for individual development and career growth. We offer a six-month leadership development program for current employees looking to advance within the company, as well as sales and technical training programs for interns and recent graduates. We also host monthly workshops and panels that focus on a variety of topics ranging from honing the skills needed for career advancement to learning how to choose a mentor. Popular Perks Pure offers an unlimited vacation policy, free lunches, meditation rooms, free yoga classes and employee resource groups to encourage all of our employees to maintain mind and body wellness. Through our Pure Good Foundation, we also offer numerous volunteer opportunities for employees to give back not only to the Bay Area, but across the globe. Pure is Committed to Equality Pure is proud to be an equal opportunity and affirmative action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or any other characteristic legally protected by the laws of the jurisdiction in which you are being considered for hire. If you need assistance or an accommodation due to a disability, you may contact us at recruitingops@purestorage.com.  #LI-POST"}