{"jobID": "2824452397", "jobLocation": "New_York_NY", "jobTitle": "Data Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.daugherty.com", "Headquarters": "Saint Louis, MO", "Size": "1001 to 5000 employees", "Founded": " 1985", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "131000", "jobDescription": " Team Daugherty is looking for an experienced Data Scientist to join our team in the New York Area!  The professional in this role will be responsible for mentoring Data Engineers, Information Analysts and Information Architects as they learn more about the tools, techniques, and business outcomes that data science can enable. The ability to effectively manage talent and create an engaged, high-performing team environment is extremely important to achieving success in this role at Daugherty.  As a Data Scientist, you will be responsible for the following: Keeping up with new theories, strategies and best practices.Thinking beyond current knowledge and existing assumptions to develop new solutions and strategies.Understanding and effectively utilizing analytics systems, databases and tools.Ensuring alignment of the Data & Analytics Line of Service's strategies, initiatives and priorities with the enterprise strategies.Collaborating with multiple areas within the capability (e.g., insights strategy and execution, research, analytics, etc.) to gain an expert understanding of the company's current and future customers.Applying knowledge and insights to customer trends and taking action to ensure the highest levels of customer satisfaction and competitive advantage for theOwning development of a clear, relevant, actionable, measurable, trusted view of the customer through consumer research to support decisions and actions that drive growth of the global enterprise.Data mining using state-of-the-art methods.Processing, cleansing and verifying the integrity of data used for analysis. We are looking for someone with: A degree in Computer Science, MIS, Mathematics or Statistics.8+ years of progressive experience in data science methods and analytics consulting, or 15+ years of experience in data warehousing, data architecture and information management projects involving analytics.Demonstrated ability to deliver data science solutions for clients (end-to-end design and delivery of a significant data science project).Professional experience applying advanced analytics and data mining techniques to enable decision support systems and customer strategies.Proven data engineering or data visualization experience with large and/or complex data environments.Advanced understanding of machine learning techniques and algorithms, such as k-NN, Naive Bayes, SVM, Decision Forests and Neural Networks.Experience with commonly used data science toolkits, such as Python, SAS, R, Weka, NumPy or MatLab.Experience working with data visualization tools, such as D3.js and GGplot.Proficient skills using query languages, such as MongoDB, Cassandra and HBase.Strong applied statistics skills.High intellectual curiosity with the desire to identify potential use cases for predictive analytics.Experience creating impactful models and algorithms for multiple functional areas (e.g., risk management, customer insights, real-time decision support, etc.).Expert understanding of industry trends for consumer insights analytics.Ability to understand and apply trends in research and analytics, and to apply learning, insights and recommendations to drive critical objectives. We offer members of Team Daugherty: Excellent health, dental and vision insurance.Revenue sharing and a 401(k) retirement savings plan.Life, disability and long-term care insurance.Little to no travel.Robust career development and training. At Daugherty Business Solutions, we believe that a fusion of insight, talent and technology makes companies run better. If you think that you would be a good fit for Team Daugherty, then apply today!"}