{"jobID": "2737437551", "jobLocation": "San_Jose_CA", "jobTitle": "Financial Advisor - San Jose, Req", "companyRating": null, "companyInfo": {"Website": "www.meriwest.com", "Headquarters": "San Jose, CA", "Size": "201 to 500 employees", "Founded": " 1961", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Financial AdvisorMeriwest Wealth AdvisorsMeriwest Credit Union Position SummaryAs a Financial Advisor, you will acquire and deepen relationships with members through comprehensive needs based marketing and promotion of investment products with the branch environment. You will work with the branch team to identify client needs, analyze customer information, define investment goals, build plans and make recommendations for client to achieve their investment goals and objectives through individual investment strategies while meeting your asset and revenue targets. A successful Financial Advisor will be able to advise clients with complex investment relationships on asset allocation and portfolio construction for strategic and tactical decisions as well as market and implement investment solutions in accordance with the client's asset allocation. Financial Advisors are expected to collaborate with Branch Managers and Financial Services Representatives on recommendations and educate them on our investment products and services. This position requires you to conform to legal and regulatory requirements and guidelines associated with state insurance and securities regulators, FINRA, SEC, Cetera Advisors LLC and Meriwest Wealth Advisors. You will also be required to demonstrate technical expertise, strong revenue results and asset growth in investments and fiduciary products, and strong interpersonal skills as well as provide exceptional client service.Essential Duties and ResponsibilitiesResponsible for promoting, selling and servicing non-depository financial products. Assist in developing direct mail solicitations.Follow broker/dealer and insurance company policies and procedures. Maintain blotter, advertising, client, and correspondence files. Accurately complete client profile for all new clients.Has daily account responsibility for various transactions. Conduct financial planning seminars. Visit branches to meet clients and train branch staff.Maintain required individual insurance and securities licenses, including continuing education requirements. Remains cognizant of and adheres to company policies and procedures, and regulations pertaining to the Bank Secrecy Act.Must comply with all company policies and procedures, applicable laws and regulations, including but not limited to the Bank Secrecy Act, the Patriot Act, and the Office of Foreign Assets Control.Performs other duties as assigned. Minimum QualificationsBachelor's degree preferred.At least two years of customer-facing investment, insurance and financial profiling experience as well as sales experience (phone-based sales a plus).Investment, insurance and financial planning experience required.The following license groups are required: 7, 63 and 65 series; alternatively 7 & 66 series required in addition to meeting FINRA continuing education requirements and the appropriate state Group 1 - Life and Variable Annuity License required.Excellent communication and organizational skills.Ability to create and foster strong partnerships with the branch employees and business partners.High achiever with entrepreneurial spirit.Track record that demonstrates exceptional ability to grow revenue, assets and client base.Do you want to be valued as an employee?Employees are Meriwest’s most valuable resource. We provide competitive wages and a supportive environment that promotes career advancement. We also offer an excellent, fully comprehensive benefits program, including: Medical/Dental/Vision on the first day of employment for full-time employeesFree Long Term Care Insurance for employeesEducation AssistancePension Plan/401KBonus and incentive potentialGenerous Paid Time Off (PTO)/Holiday programCareer growth support and planning programsIn-house fitness centerDiscounts on new Mortgage after 6 months of employmentWe are an EOE. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of disability or veteran status.To apply please reference Req. #3165 "}