{"jobID": "2819740638", "jobLocation": "Boston_MA", "jobTitle": "Data Analyst Division of Quality Improvement", "companyRating": null, "companyInfo": {"Website": "www.mass.gov", "Headquarters": "Chelsea, MA", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Government", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Massachusetts Department of Public Health is seeking a qualified individual dedicated to public health, quality of life and safety to provide guidance for analytical and evaluation activities; conduct epidemiological and statistical analyses of data to determine trends; recommend standards for, and conduct, data quality assurance and control; and provide epidemiological criteria for generation of unsolicited reports to providers for purposes of quality improvement.  Duties and Responsibilities (these duties are a general summary and not all inclusive): Maintains the Department's Nursing Home Survey Performance Tool. Performs updates and creates database extracts as needed.Provides guidance for Division of Quality Improvement data analysis, research, evaluation, and quality improvement activities.Conducts epidemiological and statistical analyses of state and federal databases to determine trends, incidence and prevalence of medical and non-medical topics.Assists in overseeing federally required and supplied nursing home resident and home health agency client quality dataset, Minimum Data Set and OASIS systems, including maintaining operation of equipment and monitoring for system failures or problems with the program. Works with providers regarding transfer of facility resident health data assessments.Assists Bureau of Health Care Safety and Quality sponsored advisory committees with research, analysis and design of data analysis tools that provides health care information to committees, and helps inform guidelines and/or regulations to ensure high quality of care.Recommends standards for, and assists in conducting, data quality assurance and control.Prepares and presents descriptive, statistical and epidemiological reports to internal and external audiences.Conducts computer-based data analysis using SAS, R, Access, and Excel.Location:This is a Boston-based position reporting to 99 Chauncy Street.Preferred Qualifications:Knowledge of the utilization of computer hardware and software.Ability to analyze and determine applicability of epidemiological data, to draw conclusions and make appropriate recommendations.Ability to make effective oral presentations.Ability to prepare statistical reports.Knowledge of federal and state laws and regulations governing licensed healthcare entities.Knowledge of the principles and practice of research methodologies.Knowledge of the principles and techniques of data quality assurance and control.Knowledge of the principles and techniques of auditing of data transactions.Ability to assess data quality.Ability to write effective technical reports for medical, scientific and lay audiences.Extensive experience in surveillance and research in public health.Extensive experience in data analysis (using SAS/R) and in applying analysis and research to policy development in public health.Masters or doctorate in public health, epidemiology, economics, health sector management or related field.Agency Mission: The mission of the Massachusetts Department of Public Health (DPH) is to prevent illness, injury, and premature death, to assure access to high quality public health and health care services, and to promote wellness and health equity for all people in the Commonwealth.  We envision a Commonwealth in which all people enjoy optimal health. Massachusetts ranks among the healthiest of states according to comparative analyses, but we face numerous challenges, including chronic and infectious disease, substance abuse, violence, preventable hospitalizations, and health disparities.  DPH coordinates programs and policies to address specific diseases and conditions and offer services to address the needs of vulnerable populations. We also develop, implement, promote, and enforce regulations and policies to assure that the conditions under which people live are most conducive to health and enable people to make healthy choices for themselves and their families. We license health professionals, healthcare facilities and a variety of businesses that impact public health. We operate the state laboratory and four public health hospitals. We monitor health status and manage vital records including births, marriages and deaths. We educate people about public health issues and work closely with local boards of health and community partners to identify and solve public health problems. Total Compensation: As an employee of the Commonwealth of Massachusetts you are offered a great career opportunity influencing a wide-spectrum of services to the diverse populations we serve - but it's more than a paycheck. The State's total compensation package features an outstanding set of employee benefits which you should consider towards your overall compensation, including: 75% state paid medical insurance premiumReasonable Dental and Vision PlansFlexible Spending Account and Dependent Care Assistance programsLow cost basic and optional life insuranceRetirement Savings: State Employees' Pension and a Deferred Compensation 457(b) plan11 paid holidays per year and competitive Sick, Vacation and Personal TimeTuition Remission for employee and spouse at state colleges and universitiesShort-Term Disability and Extended Illness program participation optionsIncentive-based Wellness ProgramsProfessional Development and Continuing Education opportunitiesQualified Employer for Public Service Student Loan Forgiveness ProgramPre-Offer Process: A criminal background check will be completed on the recommended candidate as required by the regulations set forth by the Executive Office of Health and Human Services prior to the candidate being hired. For more information, please visit http://www.mass.gov/hhs/cori  Education, licensure and certifications will be verified in accordance with the Human Resources Division's Hiring Guidelines.  Education and license/certification information provided by the selected candidate(s) is subject to the Massachusetts Public Records Law and may be published on the Commonwealth's website.  For questions, please contact Health Human Resources at 1-800-850-6968.  First consideration will be given to those applicants that apply within the first 14 days.  Applicants must have at least (A) five (5) years of full-time or equivalent part-time professional or technical experience in epidemiology, biology, biostatistics, toxicology, environmental science, environmental health, ecology, public health, chemistry, virology, immunology, bacteriology, microbiology, or statistics and (B) of which at least two (2) years must have been in a professional capacity or (C) any equivalent combination of the required experience and the substitutions listed below. Substitutions: I. A Bachelor's degree with a major in epidemiology, biology, biostatistics, toxicology, environmental science, environmental health, ecology, public health, chemistry, virology, immunology, bacteriology, microbiology, statistics, or other health-related field may be substituted for a maximum of two (2) years of the required (A) experience.*  II. A Master's degree or higher with a major in epidemiology, biology, biostatistics, toxicology, environmental science, environmental health, ecology, public health, chemistry, virology, immunology, bacteriology, microbiology, statistics, or other health-related field may be substituted for a maximum of three (3) years of the required (A) experience and one (1) year of the required (B) experience.* Education toward such a degree will be prorated on the basis of the proportion of the requirements actually completed. NOTE: Educational substitution will only be permitted for a maximum of one (1) year of the (B) experience.  An Equal Opportunity/Affirmative Action Employer. Females, minorities, veterans, and persons with disabilities are strongly encouraged to apply.SDL2017"}