{"jobID": "2803906821", "jobLocation": "Bellevue_WA", "jobTitle": "Natural Language Processing, Senior Data Scientist", "companyRating": "3.9", "companyInfo": {"Website": "www.lifeatexpedia.com", "Headquarters": "Bellevue, WA", "Size": "10000+ employees", "Founded": " 1996", "Type": " Company - Public (EXPE) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Priceline.com, Booking.com, Kayak.com"}, "estimatedSalary": "151000", "jobDescription": " ExpediaThis is an exciting opportunity to join Expedias Analytics group as a Senior Data Scientist focused on contributing to content generation and optimization software using Natural Language Processing techniques. We are looking for a self-motivated, driven and independent individual who will have end to end ownership over driving impact to Expedias largest Marketing channels. We accept Expedias toughest challenges in content optimization & customer personalization and deliver innovative solutions using big data mining and statistical methods that maximize value. With ample access to the latest technology this could be an exciting position for someone who loves to explore and deeply understand applications of data science.  RESPONSIBILITIES: Implement machine learning models, computational frameworks to process massive volumes of data, and engineer prototypes in a programming language (Python, Java, R).  - Build, debug, and enhance content software for Marketing teams.  - Discover and define your own work Research and develop new content (Text & Computer Vision) opportunities with large business impact.  - Natural Language Processing: Produce content that drives improvement in core marketing outcomes.  - Use a variety of testing methods (A/B, multi-variate, factorial design) to measure the impact of ongoing campaigns and new initiatives.  - Build positive relationships, drive decisions and progress with various Data Science, Marketing, and Engineering teams, and communicate findings to executives and partners.  - Contribute to team success; collaborate with other data sciences teams in Expedia.  REQUIRED:Strong working knowledge in SQL and at least one programming language associate with data science (Python, Java, R)  - Working knowledge in machine learning techniques such as Bayesian Methods, Clustering, Decision Trees, Latent Dirichlet Allocation, Linear and Non-Linear Programming, NER, Random Forests, SVM, and etc  - Experience in applying data science techniques (Preferably NLP) at work and generating large business value  - You have managed large datasets, both structured and unstructured, via API, scraping, and other sources  - Critical thinker, determined problem solver in a fast-paced environment  PREFERRED:Working knowledge of NLP and image processing techniques  - Familiarity with AWS  - Familiarity with Search Marketing  - Strong business analytics skills (MVT, Attribution & Measurement)  WORK EXPERIENCE AND EDUCATION GUIDELINES:Degree in computer science or a quantitative field, MS / PhD preferred  - Proven track-record of professional experience  - Experience with big data environments  - Accustomed to collaborative, fun work environments  ABOUT US: Our mission is to revolutionize travel through the power of technology. Collectively, the Expedia Group brands cover virtually every aspect of researching, planning, and booking travel, from choosing the best airplane seat, to reading personal travel reviews of hotels, to planning what to do in a destination once you arrive. The Expedia, Inc. portfolio serves both leisure and business travelers with tastes and budgets ranging from modest to luxury. Expedia delivers consumer travel demand from nearly every continent to thousands of hotels and vacation rentals, hundreds of airlines, thousands of activities, and dozens of car rental companies and cruise lines.  Expedia is committed to creating a versatile work environment with a diverse workforce. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.  This employer participates in E-Verify. The employer will provide the Social Security Administration (SSA) and, if necessary, the Department of Homeland Security (DHS) with information from each new employee's I-9 to confirm work authorization.  *LI-CW1  LPS-ARM-NAExpedia is committed to creating an inclusive work environment with a diverse workforce. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. This employer participates in E-Verify. The employer will provide the Social Security Administration (SSA) and, if necessary, the Department of Homeland Security (DHS) with information from each new employee's I-9 to confirm work authorization."}