{"jobID": "2781968398", "jobLocation": "San_Jose_CA", "jobTitle": "Service Technician - Maserati and Alfa Romeo of Stevens Creek", "companyRating": "2.9", "companyInfo": {"Website": "www.autonation.com", "Headquarters": "Fort Lauderdale, FL", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public (AN) ", "Industry": " Retail", "Revenue": " $10+ billion (USD) per year", "Competitors": " Sonic Automotive, CarMax, Asbury Automotive"}, "estimatedSalary": "18", "jobDescription": " Job Details  Connect With Us  Apply Now Job ID 2018-91035 Date posted 05/17/2018 Job Location San Jose, California Job Type Regular Full-TimePosition Overview The Service Technician performs vehicle repair and maintenance as assigned in accordance with dealer and factory standards and builds Customer loyalty by developing trust and ensuring confidence in AutoNation as a care-giver for their vehicle safety and reliability.  Who Would I Interact With? This position interacts daily with Customers, Service Advisors, other Technicians, Parts Associates, Cashiers, Sales Associates and Managers, just to name a few.  What are the day-to-day responsibilities? Performing vehicle repair and/or maintenance work as outlined on repair order with efficiency and accuracy, in accordance with dealership and factory standards to drive Customer loyalty.Communicating with Parts Department and Service Advisors regularly to effectively manage production and Customer communication.Diagnosing the cause of any malfunction and perform repair, if authorized by the Customer.Conducting multi-point inspections to make appropriate recommendations to ensure safety and reliability of Customer vehicles.Documenting work performed on each vehicle on the repair order.Maintaining an inventory of normal Technician’s tools not normally inventoried by the Service department as “special tools.”Keeping abreast of factory technical bulletins and participating in factory-sponsored training classes as appropriate.Providing an exceptional customer experience to drive loyaltyHow will I know if I am successful?The performance of a Service Technician is measured by achieving:Targeted productionTargeted salesTargeted Customer Satisfaction IndexWhat are the requirements for this jobHigh School diploma or equivalent2+ years experience as an automotive technicianAutomotive technical training (varies based on store needs)Attention to detailOrganization and follow-up skillsValid in-state driver’s license and have and maintain an acceptable, safe driving recordWhat are the opportunities for career growth?Our Associates have many choices for career growth and development after success in a Service Technician role. Opportunities may include:Master-Certified TechnicianService AdvisorService ManagementAutoNation is an equal opportunity employer and a drug-free workplace."}