{"jobID": "2830014365", "jobLocation": "Palo_Alto_CA", "jobTitle": "Audio Visual Technician", "companyRating": null, "companyInfo": {"Website": "www.outsource.net", "Headquarters": "El Segundo, CA", "Size": "201 to 500 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Audio / Visual Technician  We are currently hiring Audio/Visual Technicians with 1-5 years of experience in a commercial setting. Candidates are encouraged to apply ASAP as we have an immediate need in the Bay Area. Qualified candidates are encouraged to send an updated resume for consideration. Interviews are currently underway.  Please send your resume to jasmine.s@outsource.net for consideration. Job: · Installation, service, testing, troubleshooting, or programming of numerous Audio Visual Systems including: Crestron, Extron, AMX, Smartboards, etc.  · Operation of test equipment: Volt Meter, Ohm Meter, Oscilloscope, Spectrum Analyzer, Multi-Meter, and Impendence Meter  · Working in teams or independently to integrate various low voltage systems and complete commercial installation and service projects Qualifications: · Your own basic hand tools  · Working knowledge of audio, video, control, and communications systems is required  · Strong background in electronics and low voltage integration or solid job history/tenure working for an established A/V contractor  · Audio, video conferencing, or control equipment manufacturer certifications is a plus (Polycom, AMX, Crestron, NEC, Bi-AMP, etc.)  · Must consent to a pre-employment background and drug screen Compensation: · Option to enroll in Medical, Dental, Vision, and Life Insurance  · Starting pay $18-$35/hr or depending on experience  · Weekly Pay  · Referral Bonuses of up to $250 for referrals that result in a placement (Ask for details!)  Please send your resume to jasmine.s@outsource.net for consideration. About Outsource: Outsource is the Nations leading providers of A/V technicians. We work EXCLUSIVELY in building wiring, and we have been placing technicians of all levels with the right companies since 1998 so we know a thing or two about making a good match."}