{"jobID": "2819832690", "jobLocation": "New_York_NY", "jobTitle": "State Regulatory Compliance Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.metroplus.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1985", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "60000", "jobDescription": " State Regulatory Compliance AnalystJob Ref: 38403 Category: Professional Department: NON PSRO UTILIZATION REVIEW Location: New York, NY Job Type: Regular Employment Type: Full-Time Hire In Rate: $65,000.00 Salary Range: $65,000.00 - $75,000.00Marketing StatementMetroPlus Health Plan provides the highest quality healthcare services to residents of Bronx, Brooklyn, Manhattan, Queens and Staten Island through a comprehensive list of products, including, but not limited to, New York State Medicaid Managed Care, Medicare, Child Health Plus, Exchange, Partnership in Care, MetroPlus Gold, Essential Plan, etc. As a wholly-owned subsidiary of NYC Health + Hospitals, the largest public health system in the United States, MetroPlus’ network includes over 27,000 primary care providers, specialists and participating clinics. For more than 30 years, MetroPlus has been committed to building strong relationships with its members and providers to enable New Yorkers to live their healthiest life. Position Overview Under the direction of the Regulatory Compliance Deputy Director, the State Regulatory Compliance Analyst will monitor and ensure compliance with state regulatory requirements by building and maintaining a compliance infrastructure (including creating and updating of databases and tracking logs). The State Regulatory Compliance Analyst is responsible for reviewing, requesting and gathering of information needed for Fair Hearing requests. Assist in the oversight and monitoring of corrective actions due to non-compliance discovered internally or as the result of a State survey.Job DescriptionAssist in the preparation, review and filing of regulatory documentsEnsure timely response to all State regulator requests (scheduled and ad hoc)Conduct legal research in response to ad hoc requests from all lines of businessReview Plan policies and procedures to ensure compliance with all regulatory and contractual requirementsReview and summarize State guidance documents on new regulatory requirements for dissemination to the State Regulatory/Compliance TeamTrack business unit progress during development of new products/implementation of new benefits to assess compliance with all applicable regulatory and reporting requirementsCompile data and convene Plan staff in preparation for State audits and surveysAssist the Deputy Director in conducting preliminary audits and reviews of Plan documentation in preparation for State audits and surveysTrack progress of documentation submitted to the State for review and approvalTrack fair hearing requests, schedules and dispositions and follow-up on information requests to ensure timely receiptAssist the Deputy Director with preparation and review of fair hearing waiver packets for submission to the Office of Temporary and Disability Assistance and requesting legal representatives (if applicable)Track changes in regulations/case law specific to the fair hearing process – summarize accordinglyReview fair hearing decisions and disseminate to appropriate parties for complianceTrack and monitor post-fair hearing compliance orders from the State to ensure timely responseTrack and monitor Independent Consumer Advocacy Network complaints to ensure timely responseMinimum QualificationsRequired Education, Training & Professional ExperienceBachelor’s Degree, required.Paralegal experience a plus.3-5 year experience in Health Care AdministrationProficient in Microsoft Word, Excel, Powerpoint, SharepointProfessional CompetenciesIntegrity and TrustCustomer FocusFunctional/Technical skillsWritten/Oral CommunicationHow To ApplyIf you wish to apply for this position, please apply online by clicking the \"Apply Now\" button or forward your resume, noting the above Job ID #, to:  MetroPlus Health Plan  Human Resources Department  160 Water Street 8th Floor  New York, NY 10038  Attn: Recruitment UnitThis is position is classified as a managerial title, in addition to a variety options for Health Benefits through MetroPlus, managerial employees receive vision, dental, gym reimbursement and life insurance benefits through the Management Benefits fund of the City of New York. Please view the benefits page for more detailed information."}