{"jobID": "2682445269", "jobLocation": "Newark_CA", "jobTitle": "Sr. Software Engineer", "companyRating": "3.3", "companyInfo": {"Website": "www.rms.com", "Headquarters": "Newark, CA", "Size": "1001 to 5000 employees", "Founded": " 1988", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " AIR Worldwide, EQECAT, Verisk Analytics"}, "estimatedSalary": "129000", "jobDescription": "Sr. Software Engineer RMS is the world leader in catastrophe risk modeling. From earthquakes and hurricanes to terrorism and infectious disease, our models provide critical risk management solutions to hundreds of financial institutions around the world. After over 20 years in the industry, innovation remains our hallmark. We created an entirely new category of analytic technology that launched the catastrophe modeling industry. Now, we usher in the new risk management paradigm. RMS(one) delivers open, real-time risk management on a cloud platform, bringing a new level of resolution, fidelity, and speed only feasible with supercomputing in the cloud. Innovation and insight are no longer compromised by technical constraints.  RMS is seeking a Senior Software Engineer to join Enterprise Applications team reporting to the Director, Software Development. This position offers the opportunity to drive the design, development, and manage complex integration solutions in Enterprise, SaaS and BI environments. Candidates must be passionate about innovative software development, eager to learn about new technologies, and have proven ability to deliver quality software ResponsibilitiesDesign, Develop and operate integration Solutions, modules and related configurations using Mulesoft on SQL platforms.Drive and participate in feature requirements, architecture, and design specification reviews.Collaborate with the Business Engagement and Engineering teams to design and implement product features in a fast-­paced environment following agile development methodology.Work with the management to understand user requirements and design elegant solutions to problems at hand.Participate in planning, estimating and scheduling activities as required.Qualifications and ExperienceBachelor's degree in Science or Engineering. Computer Science degree preferred.Minimum 3 years of experience in Mulesoft development and integration platform operations.5-8 years of overall software development, integrations, and sustaining applications.Experience in RDMS like MS SQL Server, Postgres, and related modules.Solid understanding of API modules, REST and messaging protocols.Ability to apply the development, sustenance, and project management best practices with minimum supervision.Excellent communication skills with ability to grasp complex concepts and ability to communicate internally with all stakeholdersStrong problem solving and analytical skillsAbility to effectively interact with stakeholders and cross-functional departments"}