{"jobID": "2710931359", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.everlane.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "79000", "jobDescription": "Everlane is seeking a Data Analyst to join our Data and Analytics team, where you’ll help scale our analytics capabilities by developing data science tooling, increasing the sophistication of our data platform, and overall build a better understanding of our customers and product.Our team is tasked with extracting actionable insights from our data, building predictive data products, and creating self-service analytical tools for teams throughout the company. We use a full-stack set of methodologies and tools to achieve this, taking a data science problem from the initial open ended business question, to the eventual business implementation of a model.The subject areas that you will impact span the entire company, from helping our digital product team evaluate new opportunities of improvement on our website, to building models around the purchase preferences of our customers. The Job Work with business stakeholders to create metrics and self service reporting around key questionsScale the Everlane data platform with smarter and more sophisticated data pipelinesBuild tooling and frameworks that enable quicker iteration on data science problemsDeploy predictive data products that our customers will interact with, including product recommendations, size predictions, and better search functionalityCreate custom models to understand customer behavior, marketing analytics, inventory patterns, etc.Design and analyze rigorous experiments aimed at understanding customer behavior. The Qualifications BA/BS degree in a quantitative or computing focused degree2+ years of experience wrangling and analyzing large datasets to solve open ended business problemsExpertise in R, Python, or another data science suitable language, with experience writing production quality code for data applicationsExpertise in SQL extending to knowledge of database design and warehousing conceptsExperience working on data problems in a distributed framework, i.e. Spark, HadoopStrong fundamentals in statistics and probability, including formal statistical modeling and experimental designAt Everlane, we’re rethinking the way retail works. We have no middlemen taking their cut and no brand markups. Instead, we design our own luxury basics and sell them exclusively at a fraction of the traditional retail price. Since launching in November 2011, Everlane has attracted over 1,300,000 members and has been featured in The New York Times, New York Magazine, The Economist, Elle, and GQ.Please note before submitting an application: as a company, we take hiring very seriously. Interviewing with Everlane may include video and phone interviews, written projects, and/or on-site interviews. Although we are unable to follow-up with each and every applicant, we do our best to run a thorough process for candidates with whom we identify a potential fit.Everlane provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, genetics, sexual orientation, gender identity or gender expression."}