{"jobID": "2827615609", "jobLocation": "Boston_MA", "jobTitle": "Data Scientist — Applied Research", "companyRating": "4.0", "companyInfo": {"Website": "www.twitter.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2006", "Type": " Company - Public (TWTR) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Facebook, Google, Pinterest"}, "estimatedSalary": "122000", "jobDescription": " Data Scientist — Applied Research Boston, MAWho We Are: Twitter users generate many terabytes of data every single day; Twitter engineers run hundreds of experiments; Twitter data scientists craft increasingly sophisticated models of users and content.  The Applied Research team at Twitter works to measure and understand the satisfaction and motivations of our users. Applied Research is part of the larger Analytics team at Twitter. From modeling individual user behavior to characterizing user populations, our work powers core systems at Twitter and helps inform product strategy. To develop a deep understanding of our users, we use machine learning, statistical modeling, data mining, time series modeling, and many other analytical techniques; we build prototypes; and we perform experiments — all applied at the scale of Twitter. What You’ll Do: You will be a key member of the Applied Research team working closely with our partners in engineering, product, design, and user research. Your work will directly influence the exciting new product areas that Twitter is building.  As such, you will: Conduct analyses to learn from our vast amount of data, including exploratory data analysis, investigating A/B test results, observational and network data analysis, etc.Apply advanced statistical and machine learning techniques to model user behavior, identify causal impact and attribution, and build and benchmark metricsUse tools for interacting with large datasets such as Hadoop, Spark, and PrestoUse Python or R (or similar) to conduct complex data analysesUse data visualization tools (e.g. Tableau or Zeppelin)Communicate findings to executives and cross-functional product teamsWho You Are:You communicate your findings clearly and empathetically to a wide audience of relevant partners and are capable of building meaningful presentations and analyses that tell a “story”.You’re capable of collaborating with our business, engineering, and research colleagues to discover new opportunities that benefit Twitter.You’re a pragmatic problem solver with a strong quantitative background and passion for deriving insights from data.You’re a self-starter who takes initiative and is capable of learning on the job.You have experience owning complex projects from start to finish.You’re excited to learn and apply new data analysis techniques and tools.Requirements:Masters or Ph.D dealing with quantitative analysis or commensurate work experienceStrong proficiency with at least one programming language such as Python, R, Java, ScalaExperience using quantitative data analysis to solve problems and answer questions We are committed to an inclusive and diverse Twitter. Twitter is an equal opportunity employer.  We do not discriminate based on race, color, ethnicity, ancestry, national origin, religion, sex, gender, gender identity, gender expression, sexual orientation, age, disability, veteran status, genetic information, marital status or any legally protected status.  San Francisco applicants: Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.  Engineering"}