{"jobID": "2758232498", "jobLocation": "Mountain_View_CA", "jobTitle": "BI Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.astreya.com", "Headquarters": "San Jose, CA", "Size": "501 to 1000 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Milestone Technologies, Taos, GDH Consulting"}, "estimatedSalary": null, "jobDescription": "Company Astreya Partners are at the cusp of the new way of working. We provide IT services and Managed Performance to some of the most exciting companies on the planet. Our delivery model helps our clients be Positively productive by matching exceptional people to on-site teams delivering world class IT service. With engineers in over 30 countries and 70 cities around the world we are a truly global company working with truly global clients. Your Main Duties and Responsibilities:Using Tableau and SQL drive data exploration to identify opportunities, understand the behavior of the internal community, and provide actionable insightsMaintain existing legacy code, including design, development, maintenance, ETL data migration, data mart, dashboards/views, and reportingWork with business analysts, software engineers and business systems integrators and program managers to determine functional & technical requirements.Develop code changes based on functional requirements defined via business requirement documents (BRDs), functional Specification design documents (FSDs),Technical Design Documents (TDDs) written descriptions in bugs and verbally.Own tasks through the entire software development life cycle from concept to release to production including: gathering business requirements, documenting development approach, implementing code changes, testing, and migrating code.Provide support for existing legacy systemsYour Experience5+years of work experience in analytics, data science or related fieldExperience working with large data sets and translating data insight to impactTools/Language: SQL, Google Apps scripts, Google Suite Apps, Big Query, Tableau and other data visualization tools.Capable of working in a high pressure environment; delivering results under short timelines with a willingness to be flexibleFocused on results, a self-starter and must have excellent critical thinking skillsExcellent communication skills (written and verbal)Available for on call support including nights and weekends What can Astreya offer you?Working with some of the biggest firms in the world as part of the Astreya delivery networkEmployment in the fast growing IT space providing you with brilliant career options for years to comeIntroduction to the new ways of working and awesome technologiesCareer paths to help you establish where you want to goA company-wide mentoring program to advise you along the wayOnline training courses through CBT-nuggets to upskill youPerformance management system to provide you with meaningful, actionable feedbackDedicated management to provide you with a point of leadership and careInternal promotion focus. We love to build people from within.Numerous on-the-job perksPeer RecognitionMarket competitive rates and benefits"}