{"jobID": "2787576330", "jobLocation": "San_Jose_CA", "jobTitle": "SSD Application Engineer", "companyRating": "3.4", "companyInfo": {"Website": "www.skhynix.com", "Headquarters": "Icheongeo-ri, South Korea", "Size": "10000+ employees", "Founded": " 1983", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "111000", "jobDescription": "Responsibilities:Demonstrate technical leadership in owning SSD enabling programs and delivering to commits on execution milestones. Be the technical focal point (SME) for FAEs, Product Planning, Technical Marketing team members for new product related questions and enquiries.Coordination with Product Design and Validation Engineering to develop and manage material for reviews such as concept, design, validation meetings with customer and get customer’s feedback.Execute detailed customer gap analysis and review with Development team(s). Work with internal teams (FAEs, Technical Marketing, Product Planning, and development) to resolve the gaps.Support the customer’s early/pre-validation testing requirements including performance testing.Work with customer to understand the customer compatibility test plans and ensure that internal validation aligns with customer testing plan.Provide leadership and guidance to the FAEs, as product SME, coach them on specific product items when required, both in terms of technical details and process.Maintain the customer facing local lab for pre-validation, customer issue re-production and FA.Work with FAEs to provide deeper level technical customer support including on-site FA. Conduct FA on customer reported issues and work with internal development teams to resolve the issue and provide FAR to FAE to share with customer.Work with Marketing to identify key press SSD promotion/reviewers, ensure good benchmark performance by prior understanding of test strategy and workloads, and ensure that data is reviewed internally, for acceptance, prior to publication.Requirements:Minimum of bachelor's Degree or equivalent in an engineering or computer-related field. Master degree is preferred.10+ years of relevant experience in SSD hardware/firmware, Storage or system engineering.Requires a broad-based understanding of the storage industry with a focus on PCIe NVMe & SATA SSD products and deep understanding of their specifications.Detailed technical knowledge of the server & storage industry, SSD preferred. Possesses a technical knowledge of storage market and interfaces (SAS, SATA, PCIe, etc.). Deep understanding of the integration of SSDs into client and enterprise system applications.Experience in system and drive performance evaluation methodologies, metrics, and benchmarking suites such IOmeter, fio tools.Hand-on experience working with FA & validation tools such as Scope, Protocol analyzers (SATA/SAS/PCIe), DriveMaster, and industry standard toolbox.Ability to understand FW code and write automation script using programming language such as Python required.Deep understanding of Operating Systems (Windows, Linux, VMware installment and configuration), Kernel, and Device Drives.Excellent communication skills, and exceptional presentation skills. Ability to present technical information in writing, through emails and reports, or orally, to management, technical and non-technical audiences, and functional teams.International and domestic travel required. SK hynix America"}