{"jobID": "2722942966", "jobLocation": "New_York_NY", "jobTitle": "Junior Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.newsela.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Achieve3000, Schoology, Clever"}, "estimatedSalary": "127000", "jobDescription": " Newsela is an Instructional Content Platform that brings together engaging, accessible content with integrated assessments and insights to supercharge reading engagement and learning in every subject. We are dedicated to our mission to unlock the written word for everyone. More than three years since our launch, Newsela is already in 75% of schools, across all 50 U.S. states, in addition to being in over 180 countries. The result has been more engaged readers and engaged readers are better learners.  As Newselas usage in classrooms all over the world has grown, so has our focus on using data-driven analysis and results across every area of our business in order to make us more efficient and effective in helping students learn to read. Were looking to drive unprecedented gains in student literacy and are hiring a junior data scientist to get us there. ResponsibilitiesAssist the Sales Team in identifying the next big opportunitiesHelping the Content Team deliver the most appropriate material to our students and teachersCreating dashboards for the Community Team.Supporting the senior members of the Data Team in their effort to provide expert analysis to the company.Writing SQL queries to extract data, cleaning and analyzing data in Python or R, and preparing presentations.The Ideal CandidateBachelor's degree in a quantitative field, including but not limited to mathematics, engineering, computer science, or economics.2+ years in a highly analytical role, including but not limited to business analyst, data analyst, or data scientist.1+ years of professional experience using SQL.1+ years of professional experience using a scripting language, including but not limited to Python or R.Demonstrated experience retrieving data, cleaning and preparing data for analysis, performing data analysis, and presenting and defending analysis.Demonstrated experience using and tuning machine learning algorithms.Demonstrated experience visualizing analysis (plus for working with high-dimensional data).Demonstrated experience explaining technical material to non-technical audiences.Some PlusesMasters degree in quantitative field.Strong statistical and mathematical background.Experience developing machine learning algorithms.Experience with any business intelligence tool. (e.g. Looker, Chartio, Tableau, etc.)Presenting or visualizing insights involving high dimensional.Extremely detailed oriented.Newsela is strongly committed to the principle of equal opportunity for all individuals. Newsela will make all employment decisions without unlawful discrimination on the basis of race, color, religion, sex, sexual orientation, national origin, age, disability, veteran status, or any other status protected by law."}