{"jobID": "2732221230", "jobLocation": "New_York_NY", "jobTitle": "1089 Senior Project Manager/Mechanical Engineer - Healthcare", "companyRating": null, "companyInfo": {"Website": "www.akfgroup.com", "Headquarters": "New York, NY", "Size": "201 to 500 employees", "Founded": " 1989", "Type": " Company - Public", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "General:Plans, develops, coordinates, and directs projects from inception to conclusion. Works closely with Partner-in-Charge (PIC) to ensure client satisfaction, communicates objectives to Senior Project Engineer and Engineers and supervises project teams. This role will be part of the Healthcare division of the Campus Sector. Responsibilities:•Familiarize and understand business development objectives•Achieve business development objectives by contributing information and recommendations to strategic plans•Serve as primary client contact, pursue new clients and projects•Respond to RFP’s, prepare proposals, implement production, ensure productivity, quality and client service standards•Resolve issues and is responsible for overall client satisfaction•Meet the firm’s financial objectives by forecasting current and future requirements•Manage contract scope and fee, prepare and monitor project plans, schedule resources and expenditures and prepare budgets•Manage data for invoicing, resolve accounts receivable issues, analyze variances and initiate corrective actions•Supervise multi-disciplinary technical teams, including consultants, and act as the primary liaison with the client and architect•Responsible for meeting the client’s project goals and objectives while adhering to the firm’s QA/QC process •Assist in business development by pursuing new work including participation in client presentations•Assisting in the firm’s human resource efforts through training and mentoring junior firm members •Enhances the firm’s reputation by accepting ownership for accomplishing internal and external client requests•Demonstrates core values and serves as a role model/mentor to all firm members•Represent the company in a professional manner in all dealings with owners, architects, vendors, other design professionals and contractors•Updates job knowledge and technical expertise by participating in educational opportunities, reading professional publications, participating in technical organizations and obtaining certifications in area of expertise and participating in the firm’s Technical Committee as requested•Perform other duties as assignedSkills/Qualifications:•Bachelor’s degree from an accredited engineering program•Minimum 10 years of experience in a consulting engineer firm•Comprehensive understanding of the architectural, engineering and construction industry and knowledge of code compliance requirements and industry standards •Ability to consistently set goals and meet deadlines and adapt to flexible responsibilities •Proficient understanding of project financial parameters •Advanced knowledge of contracts and project legal issues•Strong organizational, prioritization, decision making and analytical skills•Possess strong verbal, written, analytical, persuasive and interpersonal skills•Effective business development skills•Proficient in MS Office (Word, Excel, PowerPoint and Outlook)•Experience with Deltek Vision or Project Resource Management software is desired•Ability to meet and exceed client expectations•Knowledge of AutoCAD/Revit•Proficient understanding of CSI or MF04 specification format and contentRequired/Preferred Credentials:•PE license is required•LEED Certification is preferred•Certifications on areas of expertise are preferredJob Classification and Scheduled work hours:•Full Time Salaried Exempt Employee. Exempt employees are ineligible for Overtime Pay. •Standard workweek is Monday-Friday•Minimum 8 working hours/day (40 hours/week Monday-Friday) within the firm’s hours of operation of 7:00a.m.-6:00p.m. •You may be required to work extra hours in order to meet client’s demands and project delivery target dates.•Travel to client meetings and worksites may be required on occasion"}