{"jobID": "2731004030", "jobLocation": "San_Jose_CA", "jobTitle": "Transfers Specialist", "companyRating": null, "companyInfo": {"Website": "www.loringward.com", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 1990", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Buckingham Strategic Wealth, Symmetry Partners, Dimensional Fund Advisors"}, "estimatedSalary": null, "jobDescription": "Job Purpose Loring Ward is a financial services company dedicated to helping independent financial advisors run better practices. The Advisor Services group works to enhance the experience of financial advisors by providing clients with error-free operations and superior customer service.  The Transfer Specialist is responsible for processing and ensuring transfers are completed in a timely and accurate manner. Duties may fluctuate with seasonal volumes, so flexibility, the ability to work under pressure and within tight deadlines will be critical. Duties and ResponsibilitiesReview and process ACAT, non-ACAT, and rollover distributionsResearch and resolve transfer issues with financial advisors, custodial partners, and contra firms to obtain the best possible outcome.Follow up and reconcile incoming asset transfers with our custodian partnersPrioritize work to meet deadlines and proactively communicate the status of transfersProvide superior, friendly and knowledgeable service by telephone and e-mail with financial advisors Other duties will be assigned as needed  QualificationsExperienceMust have at least 1-2 years of financial services experience, including telephone customer service experience.Series 7 and 63 or 66 a plus.Experience working with RIAs and Independent Financial Advisors a plus.  Education/TrainingCollege degree preferred. Two years experience in financial services may be used in lieu of a college degree.Experience processing transfers at Pershing, Charles Schwab, Fidelity, or TD Ameritrade a plus.  Knowledge, Skills, and AbilitiesDesire to take ownership and provide the best customer service in the industryEnergetic self-starter with an extremely positive, can-do attitudeKnowledge of financial termsStrong organization skills with exceptional attention to detailPro-active with ability to think ahead and act independentlyMust work well in a team environment, supporting others and filling in as necessaryMust be able to prioritize and switch tasks as neededComfortable with web-based applications  Working ConditionsThere is occasional weekend and late night work required, specifically around high volume times such as the end of a quarter and tax season. This is a fast-paced environment requiring quick thinking and a constant desire to do our very best for the financial advisor.   "}