{"jobID": "2788329412", "jobLocation": "San_Francisco_CA", "jobTitle": "Sr. Data Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Company Description: Our client is a stealth mode start up which has raised a total of $15MM in funding. They are a a machine intelligence company that’s combining novel unsupervised machine learning techniques with natural language generation and doing this with internet scale data. One-liner: This role is for a data scientist looking to contribute to core product features and key business decisions, on a team building distinctive commercial applications driven by unique machine learning algorithms. Responsibilities:Help customers reach their goals (very product-oriented) by working with product managersWork with Machine Learning to build core ML models, which will be reused across productsCollaborate with Platform Engineering to build out shared infrastructure and user interface elements, and help with deployment and scalingConstant learning (and teaching!) and a good sense of humorWhat We Offer:Collaborative environment with abundant cross-team interactions and learningOpportunity to tackle previously unsolved problems in Natural Language Processing, Natural Language Generation, and other fieldsExposure to very interesting data (e.g. news, scientific publications, financial documents, communications and other long form content)Products motivated directly by current clients with analysts in high-impact rolesThe satisfaction of taking products and new features through from their initial genesis to incorporation in a deployed productRapidly growing company, with opportunities for growth into either further technical leadership or team management positionsFun, puzzle-loving office in the SF Financial District.What You Have:MSc. or PhD. in computer science, statistics, computational linguistics, or other quantitative fields3-7+ years of professional experience in the areas of developing and deploying quantitative models, machine learning and NLP based-solutionsChinese speakerStrong programming skills, including in Python, with at least 3 years experience in a production engineering teamExperience with NLP problems such as part-of-speech tagging, topic modeling, named entity recognition, and summarizationSkills in data exploration, visualization, and cleaningExperience in using one or more of the following: NumPy, SciPy, Matplotlib, Scikit-Learn, NLTK, SpaCy, TensorFlow, KerasExperience taking ambiguous problem statements through to delivered productsCuriosity and enthusiasm, and a love for teaching and learningBonus Points:Experience with information retrieval and search technologies (especially Elasticsearch)Experience with Chinese NLP in an industry setting"}