{"jobID": "2816212001", "jobLocation": "Seattle_WA", "jobTitle": "Data Scientist, Machine Learning Platform", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "151000", "jobDescription": "Data Scientist, Machine Learning Platform Job Number: 113427422Seattle, Washington, United StatesPosted: Jun. 14, 2018Weekly Hours: 40.00 Job SummaryWe are looking for engineers with a real passion for using machine learning to build intelligent applications. In this highly accomplished, deeply technical and close-knit team of data scientists and machine learning engineers, you will build tools that are used by millions of people. You will design and implement new machine learning algorithms and techniques and collaborate with the most innovative product development teams in the world.  Our team builds the platform that enables teams across Apple to develop machine-learning solutions that power amazingly intelligent user experiences. We are looking for new high-energy members to join our ML Applications team that collaborates with product teams on a variety of projects. In this role, you will have the opportunity to engage with every cool project around Apple, and use your data science, machine learning and artificial intelligence skills to solve some of the most challenging technical problems in the next generation of products that will delight millions of people.Key Qualifications Minimum of 3 years experience applying machine learning techniques to build models that power products & experiencesExperienced user of machine learning and statistical-analysis libraries, such as GraphLab Create, scikit-learn, scipy, R, NetworkX, Spacy, and NLTKExperience with deep learning frameworks, such as mxnet, Torch, Caffe, and TensorFlowStrength in one of the following domains: deep learning, NLP, computer vision, recommenders, physical sensors/IOT, signal processingStrong software development skills with proficiency in Python preferredExperience with Hadoop ecosystem tools is a plusAbility to explain and present analyses and machine learning concepts to a broad technical audienceCreative, collaborative, & product focused DescriptionAs a member of the ML Applications team, you will engage directly with data scientists and engineers in Apple product teams to co-develop machine learning solutions for a variety of tasks and projects using a variety of tools and techniques. You will also be a trusted advisor for best practice machine learning development. Your responsibilities include: Co-developing machine learning solutions with data scientists and engineers on product teams  Developing proof-of-concept apps that use machine learning to demonstrate product feature feasibility  Providing technical guidance to product teams on the choice of machine learning approaches appropriate for a task  Providing architectural guidance on transitioning prototypes to high-performance production models  Providing feedback on tools and new features needed back to platform development teamsEducationPhD in Machine learning, Statistics, Computer Science, Physics, or related field or related field with 5+ years of machine learning research experience  or MS in related field with 7+ years building machine learning models in industry"}