{"jobID": "2732522688", "jobLocation": "Westford_MA", "jobTitle": "Sr. Data Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.utcaerospacesystems.com", "Headquarters": "Charlotte, NC", "Size": "10000+ employees", "Founded": " 1870", "Type": " Subsidiary or Business Segment", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "129000", "jobDescription": " We at ISR & Space Systems are world leaders in high altitude electro-optical sensors, employed by the U.S. and foreign military in time critical intelligence, surveillance and reconnaissance operations. Our passion for supporting the Warfighters and their mission demands excellence in everything we do, from the talent we recruit to the highly-engineered systems we deliver. We value people, integrity, ideas and performance.  The Information and Intelligence Engineering group is looking for a Data Scientist to work on Machine Learning as it applies to Intelligence, Surveillance and Reconnaissance (ISR) systems. This position offers an exciting opportunity to grow technically and broaden capabilities while proudly contributing to unique state of the art solutions that truly make a difference. Integrate various machine learning-based tools into an overall data processing architectureEvaluate alternative methods, analytics and models in a scientific mannerCollaborate on multi-disciplinary teams to devise robust solutionsWork with higher order mathematics, data structures and databasesApply statistical and predictive modeling skills to challenging problemsQualification:At least 5 years of experience with a Bachelors of ScienceAt least 3 years of experience with a graduate degree Required Skills Experience with Machine learning / Deep learning, such as Tensorflow, Caffe, Keras, Torch, etc.Experience with common languages used in machine learning, such as Python, Matlab, R, etcExperience with data analytics Preferred Skills Experience with Computer Vision, Automated Target Recognition (ATRs) and Target TrackingExperience with autonomous systemsExperience with software, such as C/C++Experience with image processingDOD experience Competencies Excellent writing and verbal skillsAbility to positively contribute in a team environmentDue to projects/programs, candidates must be a US Citizen-Ability to obtain a US Government clearance10% or less travel.Education:BS in a technical field such as Mathematics, Physics, Electrical Engineering, Image Science, Computer Engineering, Computer Science or related field United Technologies Corporation is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class."}