{"jobID": "2826773117", "jobLocation": "Milpitas_CA", "jobTitle": "IT Operations Engineer Advisor", "companyRating": "3.4", "companyInfo": {"Website": "www.sonicwall.com", "Headquarters": "Milpitas, CA", "Size": "1001 to 5000 employees", "Founded": " 1991", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " WatchGuard Technologies, Fortinet, Check Point Software Technologies"}, "estimatedSalary": "101000", "jobDescription": " IT Operations Engineer  SonicWall is commencing a new chapter in history with an exciting lineup of network security products, and we want the best people to be part of our team. We are in a dynamic phase operating as an independent private company after Francisco Partners, a leading global private equity firm, acquired SonicWall from Dell. The senior ITOPS position provides challenging opportunities with a cohesive world-class team in our fast-paced, dynamic and fulfilling work environment! The position is located in Milipitas, CA.  Primary Responsibilities Learn and grow with the team of IT Operations engineers.Work collaboratively and cross functionally to support datacenter and lab operations.Persistent attention to detail and execute with high level of comfort working in a dynamic environment.Work cross-functionally to develop solutions to support the daily needs of a rapidly growing business. Minimum Requirements Min 2+ years experience working as system administratorExperience in Linux/Windows administration.Experience and knowledge in networking: firewalls, routers, switches.Experience working with VMWareStrong experience in programming languages such as bashStrong written and verbal communication, team oriented while being able to work independently, self-starter and motivated. SonicWall is an Equal Opportunity Employer committed to the principle of equal employment opportunity for all employees. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally protected characteristics."}