{"jobID": "2753251798", "jobLocation": "Austin_TX", "jobTitle": "Summer Intern", "companyRating": null, "companyInfo": {"Website": "www.mitel.com", "Headquarters": "Ottawa, Canada", "Size": "1001 to 5000 employees", "Founded": " 1972", "Type": " Company - Public (MITL) ", "Industry": " Telecommunications", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " 8x8, Cisco Systems, RingCentral"}, "estimatedSalary": null, "jobDescription": "Mitel recognizes that today’s students are tomorrow’s superstars and we value the opportunity to benefit from your fresh perspective. Mitel is looking for talented Bachelor’s, or Master’s students to fill Internship positions within our Engineering organization. If you are an overachiever and want to contribute to a team that will truly appreciate your dedication and hard work, then consider a career at Mitel. You can dramatically shape everything from our daily operations to our global presence. Please take a minute to learn more about Mitel and apply today!  As a Mitel software engineer you will create end-user experiences and back-end infrastructure for cloud-based service delivery. This work requires finding solutions to a wide range of tough technical problems. You will be working on a variety of applications including server, client (user- interface) and web (portal for system configuration) software. We are looking for students that have interest in any of these areas.  In a small engineering team environment, your work with other Engineers, QA, and Product Management offers excellent exposure to industry best-practices in a fast-moving, highly successful company.  Requirements: Knowledge of object-oriented and scripting languages.Good understanding of computer science fundamentals, data structures, database concepts and algorithmsGood problem-solving skillsAn interest and aptitude for delivering reliable, high-performance products in distributed systems with imperfect networks Nice-to-have: Solid object-oriented programming and architectural skillsExperience with API design and implementationExperience with full-stack web application developmentFamiliarity with Microsoft development stack Education: BS/MS Degree in Computer Science, Computer Engineering, Software Engineering, Electric Engineering or related field6500 River Place Blvd Suite 200., Austin, TX 78730 USA"}