{"jobID": "2751119443", "jobLocation": "Bellevue_WA", "jobTitle": "Artificial Intelligence Intern", "companyRating": null, "companyInfo": {"Website": "www.huawei.com", "Headquarters": "Shenzhen, China", "Size": "10000+ employees", "Founded": " 1987", "Type": " Company - Private", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " Ericsson-Worldwide, Cisco Systems, Apple"}, "estimatedSalary": null, "jobDescription": "Huawei is a leading global information and communications technology (ICT) solutions provider. Through our dedication to customer-centric innovation and strong partnerships, we have established end-to-end advantages in telecom networks, devices and cloud computing. We are committed to creating maximum value for telecom operators, enterprises and consumers by providing competitive solutions and services. Our products and solutions have been deployed in over 170 countries, serving more than one third of the world’s population. Huawei has over 180,000 employees, approximately 80,000 of which are engaged in Research & development. Huawei operates a global network of 12 regional headquarters, 14 R&D; Centers, 36 Innovation Centers jointly operated with customers, and 45 Training Centers. Huawei is leading the way by rethinking the future. From devices to telecom infrastructure to cloud computing and convergence solutions, we are rethinking every link in the chain with ICT based innovation to deliver a better future...faster. Artificial Intelligence Intern Location: Bellevue, WA (R&D;) Req #: 9460 # of Openings: 1 DescriptionFuturewei Technologies, a subsidiary of Huawei, is looking for highly motivated and qualified students or recent graduates for internships within the Cloud R&D; center located in Bellevue, WA, just a few minutes from Seattle. This position offers the Intern the opportunity to work on our Enterprise Intelligence (EI) team as we innovate and build our next generation cloud computing platform.  The EI team are leading researchers and engineers from worldwide to create competitive AI services on Huawei’s Cloud for enterprise applications, such as those in e-commerce, integrated supply chain, video surveillance, mobile computing, etc. This position enables one to work with our team members with backgrounds in analytics, graph computing, distributed systems, high performance algorithms, GPU/FPGA, etc., as well as collaborating with external partners in academia and industry. We encourage interns to actively create software/systems for solving real-world problems, delivering innovative AI solutions, contributing to open-source communities, and publishing high-quality patents. Job Responsibilities:This position will work closely with members from partner teams in Seattle and in Huawei’s HQ in China.Design and architect AI cloud platform services and application services with user-friendly workflow and interface (HCI).Develop key techniques for Cloud AI in domains such as NLP, computer vision, etc.Optimize service performance and usability for NLP, deep learning, large scale graph computing, and machine learning, such as generic/domain-specific visualization and key algorithm accelerationWork with other teams and to provide technical assistanceProfile and optimize the performance of existing AI platforms and applicationsQualifications:Graduate student in Computer Science, ECE, or related field with solid background in computer algorithms.Experience working with C/C++/Java/JavaScript/PythonExperience in graph computing, or machine learning, or deep learning, or reinforcement learningExperience working with knowledge graph, or computer vision, or natural language processing, or computer visualizationKnowledge of open source big data ecosystem is a plus.Experience working on HPC or GPU software development is a plusExperience working on a multi-disciplinary team tasked with solving difficult problems is a plus.Self-motivated, inquisitive, and team oriented individual.Must be able to clearly articulate ideas and concepts to fellow engineers and management.Huawei Inc. is proud to be an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Why work for us?In 2017, Huawei's revenue reached CNY600 billion (US$92 billion based on the year-end exchange rate), an increase of 15% (YOY)We invest in engineering and innovation - 80,000+ of our 180,000+ global employees work in R&D;, and we invest roughly 10% of our annual revenue in to R&D.; U.S. R&D; efforts are carried out by Futurewei Technologies, Inc.Futurewei’s commitment to R&D; is a major reason why Huawei holds one of the largest patent portfolio’s in the world: Since 2008, Huawei has been a top five international patent filer, per the World Intellectual Property Organization.We support green energy - Lowered CO2 emissions by 13,000 tons via Huawei’s green packaging solutionsFuturewei works with leading universities to further R&D; efforts, investing more than $10million USD each year to support programs at Harvard, MIT, Stanford and Yale, among others. Are you a returning applicant?Previous Applicants:Email:Password: If you do not remember your password click here. Back to Search Results New SearchCopyright © Huawei Technologies Co., Ltd. 1998-2017. All rights reserved."}