{"jobID": "2746177892", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": "4.8", "companyInfo": {"Website": "www.plaid.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "121000", "jobDescription": "Plaids data science team is building technologies that improve how millions of users understand and grow their financial lives. We're looking for data scientists with experience applying state-of-the-art machine learning and data science techniques toward any area, including natural language processing, security, anomaly detection, optimization, and time series forecasting. We value not only technological know-how, but also creativity, user empathy, and teamwork.At Plaid, you will have access to unparalleled collections of transactions, accounts, and financial data. You will be empowered by this data and by our team to build products generating compelling insights and recommendations for our users.What excites you Utilizing features of billions of transactions to help borrowers access capital for personal and small-business loans and mortgagesModeling the nuanced language of financial statements to extract useful information from their unstructured data (see https://blog.plaid.com/making-sense-of-messy-data/)Exploring new ways we can better equip users and clients with insights about spending, saving, and investingChampioning a data-first approach toward decision-making across the entire organizationWhat excites us:At least 2 years of production data science experiencePreferably (but not required) a graduate degree in machine learning, computational statistics, or similar fieldsStrong collaborative mindset and experience working with external clients to translate their needs into effective engineering solutionsWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}