{"jobID": "2673459309", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Business Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.rodanandfields.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "121000", "jobDescription": "Senior Business Data Analyst  The Opportunity:  Rodan and Fields is looking for a highly motivated and dedicated team member to join the Business Intelligence (BI) Team and drive business strategy through actionable insights in our organization. Potential analyses include segmentation, benchmarking, A/B testing, and customer acquisition/retention optimization. This area presents the opportunity to work in an exciting and dynamic area, with huge learning opportunities.  You’ll work closely with members of Marketing, Sales, Operations, Data Services and Engineering teams. You’ll define and report on key metrics, analyze customer behaviors and optimize our market expansion programs. Excellent technical and communication skills are critical to access information from various data sources for structured and non-structured data. Most importantly, this role involves uncovering insights hidden within the data and explaining its relevance to non-technical business partners in a way that is actionable and comprehensible to them. The ideal candidate understands and loves business, analytics, and technology and likes having fun!  Key Responsibilities Identify critical business problems and translates them into structured analyses, by partnering closely with business partners and other internal teams.Provide leadership on new analytics projects by identifying scope and key assumptions. Document high level requirements using diagrams and structured requirements so that stakeholders understand the scope of the work required both technically, and operationally.Synthesize data from multiple sources to provide analysis findings and recommendations on driving optimization strategies and tactics to increase marketing, operations, and market expansion ROI.Present timely, compelling, fact based analyses, reports, and dashboards that explain the business “story” behind the data detailing what happened and why.Collaborate with other BI team members to proactively identify opportunities to improve company KPIs.Constantly look for improvements in tools, data sources, data quality, and analytic techniques to improve various aspects of marketing analytical and business needs. Basic Requirements 3+ years of experience analyzing very large datasets with SQL, R, SAS or other statistical package.5+ years of experience in user behavior and/or product analysis for a CPG, eCommerce or Direct Selling company.Advanced expertise in Excel (pivot tables, vlookups, advanced formulas).Experience with enterprise reporting and dashboard tools like Tableau, MicroStrategy, or Business Objects.Strong written and verbal communication skills; ability to present data and its implications in a clear, concise manner to senior executives.Extremely detail-oriented, but still able to see the big picture.Strong analytical mindset.Team player with excellent interpersonal skills, self-motivated, energetic, \"can-do\" attitude in a fast-moving environment.Ability to deal with change and ambiguity.Bias for action.Travel between San Francisco and San Ramon offices required. Bonus Points MBA or Masters/PhD in Computer Science, Operation Research, Applied Mathematics, Economics, Statistics or a quantitative discipline.Experience in marketing analytics, sales analytics, or operation & logistics analytics.Prior experience in a subscription based business or peer-to-peer selling business.Secretly wishes that there were bands named Depeche Median and Depeche Mean. The Company  Looking for a job? Dream big. We did. What if you could work for a revolutionary skincare company—one that gives people the best looking skin of their lives? Rodan + Fields® provides dermatologist-inspired, clinically tested products that work and makes them available to those who can’t get to a dermatologist. We’re all about offering life-changing skincare. And life-changing opportunities.  We’re all about offering life-changing skincare. And life-changing opportunities.  Results Matter. Founded by Dr. Katie Rodan and Dr. Kathy Fields, world-renowned Stanford-trained dermatologists who invented Proactiv®, the clinical results our customers have from using our Multi-Med® Therapy Regimens and products has made Rodan + Fields the #1 premium anti-aging brand in the U.S. Rodan + Fields is the #1 premium acne brand in the US. Rodan + Fields is the #1 fastest growing skincare brand in the United States over the past 5 years. Rodan + Fields is the #2 premium skincare company in the U.S. in 2015 and we aspire to be the #1 premium skincare brand in every geographic market we serve. It’s clear—we deliver and we delight.  Be Revolutionary. Rodan + Fields is redefining an entrepreneurial sales model in the direct selling channel which allows Independent Consultants to establish their own businesses with products they use and love and be rewarded for their volume of Customer sales. The goal of every corporate employee is to use their power to empower our Independent Consultants and support their Customers. We make it happen and that’s no small feat. It takes a community of smart, passionate, forward-thinking, creative employees from a multitude of discipline, who are better together to drive record growth this fast.  Do Good. We do more than create life-changing jobs. We show gratitude through contributions from our non-profit entity, Prescription for Change®, the heart of Rodan + Fields. We help thousands of underserved high school kids have the opportunity to use their power to help others and in doing so, make life-changing differences in their own lives—and around the world.  Celebrate Your Greatness. Make an impact. If you work at Rodan + Fields, you have the chance to innovate. In fact, we expect it. You’ll become part of a positive, passionate movement that celebrates greatness and encourages employees to be catalysts for change, play as a team and say no to the status quo. So what if you made a life-changing decision for your career? Why not?  See you at the top."}