{"jobID": "2804489661", "jobLocation": "Cambridge_MA", "jobTitle": "Business/Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.digitalibiz.com", "Headquarters": "Rockville, MD", "Size": "51 to 200 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": " Company Overview DIGITALiBiz, Inc. (iBiz) is an information technology (IT) and business consulting small business providing next-generation solutions to federal government customers. Our mission is to maximize the use of IT systems, business process engineering, research and analysis, and customer-focused best practices to implement Vision & Innovation That Works. Our experience developing effective, scalable, and usable IT and program management solutions helps solve our customers’ real-world business problems. Founded in 2002, iBiz is headquartered in Rockville, MD and has been recognized as a Washington Post 2015 and 2016 Top Workplace. If you enjoy the challenge of a fast-paced environment with friendly people who are truly driven to achieve superior results, iBiz is for you! Responsibilities The Data/Business Analyst will support the Volpe National Transportation Systems Center performing research and analyses on transportation and logistics issues. Support will require general and specialized analytical techniques, data and business process research, expertise in database management systems, and understanding of the transportation industry (public and private), transportation operations, and/or transportation/logistics issues. Additionally, the Data/Business Analyst will be expected to perform studies, evaluations, assessments, and documentation on transportation and logistics issues requiring techniques associated with the disciplines of economics, psychology, operations research, and mathematics/statistics.Responsibilities include:Implement tools, scripts, queries, or applications for accessing and analyzing data and associated metadataProfile data to measure quality and integrity of the data collectedDevelop systems specifications based on business rules, specifications, and process flowsDevelop business-oriented data dictionariesDevelop data flow, application, and technical specifications Required Skills, Education, Certifications and Experience Bachelor’s degree in Statistics, Information Systems, Economics, or related field (new graduates encouraged to apply)Experience using and querying Relational Database Management Systems (RDBMS)Excellent understanding of organization goals and objectivesHighly self-motivated, keen attention to detail, and ability to effectively prioritize and execute tasks in a high-pressure environmentProven analytical, evaluative, and problem-solving abilitiesExtensive experience working in a team-oriented, collaborative environmentExceptionally customer service-orientedGood understanding of project management principlesExperience with data modeling toolsStatistical analysis skillsExcellent written and oral communication skillsAbility to conduct and direct research into IT issues and products as requiredPreferred:Master’s degree in Statistics, Information Systems, Economics, or related field1-3 years of relevant experience Experience with OracleExperience working with R, STATA, and Python Physical requirements for this position Sedintary in nature DIGITALiBIZ, Inc. is an Equal Opportunity Employer All applicants will receive consideration for employment without regard to race, color, age, sex, creed, national origin or ancestry, religious persuasion, marital status, political belief, disability, genetic information, pregnancy, status as a veteran, or any other consideration made unlawful by federal, state, or local laws (collectively any “Protected Basis”). Reasonable Accommodations If you are in need of Reasonable Accommodations, please Contact Diane Reed at (240) 252-2955 dreed@digitalibiz.com. She will be able to address this need."}