{"jobID": "2750732004", "jobLocation": "Long_Island_City_NY", "jobTitle": "Sales Supervisor", "companyRating": null, "companyInfo": {"Website": "www.rcn.com", "Headquarters": "Princeton, NJ", "Size": "1001 to 5000 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Telecommunications", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Requisition Number 18-0139 Post Date 4/27/2018 Title Sales Supervisor City Long Island City State NY Description Residential Sales Supervisor Essential Duties and Responsibilities:General Summary:Supervise a team of Direct Sales Representatives (DSRs).Essential Duties and Responsibilities:Supervise a staff of DSRs and participate in hiring, training, coaching and performance management.Accountable for the DSR team's achievement of bi-weekly/monthly sales goals.Responsible for ensuring that the DSRs are knowledgeable of and comply with company policies, procedures and practices.Maintain a thorough knowledge of the Company’s services and pricing structures and ensure that the DSRs have a working knowledge of the same.Provide sales coaching and training on an individual basis and through regular team meetings to improve sales results and drive targeted profitable growth. Activities may include “ride-along” with sales personnel to provide training and coaching, as well  as going on customer appointments. Meet regularly with sales personnel and management to review sales activity, customer retention and relationship activities, competitive challenges, review sales performance compared to goal, and identify and/or address training needs.Knowledge, Skills and Abilities:Excel, Basic Computer SkillsOther Job Specific Skills:Candidates with telecommunications sales backgrounds are likely to be successful. Minimum travel required, Strong organizational skills are required but must be able to work a flexible schedule which includes evenings and weekends. We are proud to be an EEO/AA employer M/F/D/V. We maintain a drug-free workplace and perform pre-employment substance abuse testing."}