{"jobID": "2631863348", "jobLocation": "Seattle_WA", "jobTitle": "Sr. Data Scientist - Automation Platform", "companyRating": "4.3", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "166000", "jobDescription": " About Uber Were changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now were a part of the logistical fabric of more than 600 cities around the world. Whether its a ride, a sandwich, or a package, we use technology to give people what they want, when they want it. For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer. And thats just what were doing today. Were thinking about the future, too. With teams working on autonomous trucking and self-driving cars, were in for the long haul. Were reimagining how people and things move from one place to the next. Automation Platform: Sr. Data Scientist / Sr. Data Analyst Seattle - Data Science We are looking for a Senior Data Scientist on the Automation Platform team, whose mission is to provide a unified platform to automate, manage, and analyze Ubers business processes. Youll be helping marketing managers run experiments to determine what kinds of emails lead to more user sign ups, product teams determine which promotions lead to higher rider loyalty and retention, and engineering teams find out how to optimize their systems in order to save money on hardware and computational efficiency. What youll be doing:Work on a cross-functional team including Data Scientists, Data Analysts, Product Managers, Engineers, and Operations leads across the globe.Define key business metrics in collaboration with leadership. Create and maintain data pipelines, dashboards, and data models around our business rule ecosystem. Identify and own data latency and data quality issues.Build reports and reporting / monitoring tools that operations and product teams across the globe use to help them make key decisions every day.Pull data and conduct product analysis to discover and suggest new product functionality and optimize existing services and systems.Prototyping new features and building new ideas by writing code in Python or R.Implement new approaches in collaboration with software engineers in production (Go, Java, or Python).Develop algorithms and experiments to optimize customer satisfaction and engagement.Here are the kinds of skills we're looking for:A graduate degree or equivalent in applied statistics, computer science or a quantitative domain.5+ years working experience delivering, scaling, and owning highly successful and innovative analytics and data science products.Experience with data science technologies like Hadoop, Hive, Spark, and SQL (Postgres, HiveQL, Vertica SQL)Experience with a variety of relevant data manipulation languages (Python, R, Go).Great communication skills.The ability to create structure from ambiguity. The opportunity for Uber in the communications space is massive but nascent - we are looking for somebody interested in building a new foundation and scaling from there. Here are the kinds of skills we're looking for:Demonstrable domain expertise in communications, product metric identification, experimentation design, machine learning and execution.A degree in computer science or a quantitative domain plus hands-on data science experience. Technical understanding must go from the highest abstractions down to the metal.5+ years experience delivering, scaling, and owning highly successful and innovative data science products with your fingerprints all over them - youre extremely proud of what youve accomplished.An ability to connect the deep domain expertise of the researcher with the pragmatism and scrappiness of the entrepreneur - youre a true generalist.A high bar across the board - from your own contributions to the people you work with to the products you work on.A driver personality - biased toward action, great collaborator and master disambiguator / simplifier - constantly pushing toward clarity and delivery.Demonstrable proficiency in producing production level code (Python, Go, Spark preferred) and programming concepts, combined with the enthusiasm and passion to build. PerksEmployees are given Uber credits every month.The rare opportunity to change the way the world moves. We're not just another social web app, we're moving real people and assets and reinventing transportation and logistics globally.Smart, engaged co-workers.Benefits401(k) plan, gym reimbursement, nine paid company holidays.Full medical/dental/vision package to fit your needs.Unlimited vacation policy; take time when you need it.Be sure to check out the Uber Engineering Blog to learn more about the team.Uber is an equal opportunity employer and enthusiastically encourages people from a wide variety of backgrounds and experiences to apply. Uber does not discriminate on the basis of race, color, religion, sex (including pregnancy), gender, national origin, citizenship, age, mental or physical disability, veteran status, marital status, sexual orientation or any other basis prohibited by law."}