{"jobID": "2806225622", "jobLocation": "Los_Angeles_CA", "jobTitle": "Student Trainee (Premier College Intern Program)", "companyRating": null, "companyInfo": {"Website": "www.dia.mil", "Headquarters": "Washington, DC", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Duties Help Duties Summary  The Air Force Civilian Service is pleased to announce the Air Force College Premier Summer Intern Program. Graduate students who have completed at least one year of a full-time graduate program will be able to apply for a full-time paid summer internship lasting 10-12 weeks during the summer session prior to their second year of their graduate program. Any individual who meets the following may apply for the DHA Post-Secondary Student Program:  (1) Currently enrolled, and in good academic standing in a full-time program, at a public or other non-profit institution of higher education; AND  (2) Making satisfactory progress toward receipt of a graduate level degree AND  (3) Completed at least one year of the degree program  You may be non-competitively converted to a permanent appointment within the PALACE Acquire (PAQ)/Copper Cap (COP) or a similar Program. The target grade of the conversion could be above GS-11. However, it is important to remember that eligibility for conversion does not guarantee you will be offered a permanent position.  General Schedule Salary Table for \"Rest of US\" (RUS) was used, salaries may vary dependent upon location selected. Please refer to the Salary Tables link for more information: https://www.opm.gov/policy-data-oversight/pay-leave/salaries-wages/salary-tables/pdf/2018/RUS.pdf  Learn more about this agency Responsibilities This is a Direct-Hire Public Notice: These positions are being filled under the Department of Defense DHA for Post-Secondary Students and are managed by the Force Renewal Program and centrally funded by the Air Force's Central Salary Account. This opportunity offers valuable work experience closely related to your academic field of study.  This is a TERM position Not to Exceed 18 months; the individual selected for this position may be extended without further competition.  The individual series are listed below for your reference and information to include the link to the applicable qualification standard.  0299 - Human Resources Management Student Trainee  0399 - Administration and Office Support Student Trainee Series  0599 - Financial Management Student Trainee Series  1899 - Investigation Student Trainee Series  2099 - Supply Student Trainee Series  2299 - Information Technology Management Student Trainee  https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/#GS-CLER  0199 - Social Science Student Trainee Series  0499 - Biological Science Student Trainee Series  0899 - Engineering and Architectural Student Trainee Series  1199 - Business and Industry Student Trainee  1399 - Physical Science Student Trainee Series  1599 - Mathematics and Statistics Student Trainee Series  1799 - Education Student Trainee Series  https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/#GS-TECH=&url;=GS-PROF  Travel Required  Occasional travel - You may be expected to travel for this position.  Supervisory status  No Job family (Series) 0099 General Student Trainee Requirements Help Requirements Conditions of Employment Please read this Public Notice in its entirety prior to submitting your application for consideration.U.S. Citizenship is requiredMales must be registered for Selective Service, see www.sss.govTotal salary varies depending on location of positionPCS expenses if authorized will be paid IAW JTR and Air Force RegulationsRecruitment incentives may be authorizedThis posn is subject to provisions of the DoD Priority Placement ProgramPosition may be subject to random drug testingEmployee may be required to work other than normal duty hours, to include evenings, weekends and/or holidaysShift work and emergency overtime may be requiredDisclosure of Political AppointmentsQualifications The Premier College Intern Program targets individuals who are seeking a dynamic career with the Air Force Civilian Service in a variety of career fields by gaining real-world experience. You will be given the opportunity to gain the knowledge, skills and abilities needed to pursue a successful career with the Air Force Civilian Service.  Upon graduation and program requirement completion, a Premier College Intern may be converted to a career, career-conditional appointment into the Air Force Palace Acquire/Copper Cap or similar developmental training program without further competition.  Please note: This is not a developmental opportunity, this position will be filled at the GS-07 grade level.  To qualify for a GS-07: Completion of one full year of graduate level education OR superior academic achievement and currently enrolled in a graduate level program. Must have completed one year of the program.  https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/#GS-TECH=&url;=GS-ADMIN  https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/#GS-TECH=&url;=GS-PROF  You must be a student currently enrolled in an accredited public or other non-profit college or university: Enrolled in an approved programPursing a Graduate DegreeEnrollment must be in a full-time programHave a good academic standingMeet the qualification standards of the positionMust be at least 16 years of ageA U.S. citizen or a nationalMust sign a Participant Agreement Applicants must meet requirements by the date they enter on duty. Other Significant Facts:) Some positions may be deemed drug testing designated positions and require participation in random drug testing.) Incumbent may be subject to pre-employment drug testing as a condition of employment, and participation in random drug testing.) Appointment may be contingent upon passing a physical examination.) Incumbent may be required to obtain and maintain appropriate background investigation or security clearance.) Employment under this announcement will be full-time during the student's summer session, approximately 10-12 weeks. Note: There may be additional conditions and/or requirements as determined by the position being filled.  DHA Post-Secondary Students may work full-time schedules during the student's summer session/break.  DHA Post-Secondary Students may be considered for noncompetitive conversion to a permanent appointment within 120 days of completion of degree requirements, if they meet the following: Successfully complete academic requirements for a graduate degreeMeet the OPM Qualification requirements for the target position to which the DHA Post-Secondary Student may be converted.Maintain acceptable performance It is important to remember that eligibility for conversion to permanent employment is neither automatic nor guaranteed.  You must upload/submit all required documents in order to be considered, i.e., Resume, All transcripts (we will accept unofficial), DD 214, Veterans Award Letter and SF 15 (if applicable).  PART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.  VOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience. Education IF USING EDUCATION TO QUALIFY: You MUST provide transcripts to support your educational claims. Education must be accredited by an accrediting institution recognized by the U.S. Department of Education.  FOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying."}