{"jobID": "2756892502", "jobLocation": "Boston_MA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.ciee.org.br", "Headquarters": "SAO PAULO, Brazil", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " School / School District", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " A nonprofit, non-governmental organization, CIEE is the world leader in international education and exchange. For over 70 years CIEE has been committed to bringing the world together through meaningful international exchange programs to help humanize international relations all students, all nations. Driven by this purpose, CIEE has helped thousands of people gain the knowledge and skills necessary to live and work in a globally interdependent and culturally diverse world by offering the most comprehensive, relevant, and valuable exchange programs available. Serving over 400 U.S. College and University consortium members, CIEE operates sixty-five study centers in forty-five countries that support study abroad programs for over 10,000 students annually. In addition, as the largest sponsor for U.S. Department of State J-1 Visa programs, CIEE helps nearly 30,000 international students participate in U.S. based exchange programs annually. CIEE programs and services span study abroad, teach abroad, international faculty development seminars, and inbound exchange study, work, and internship programs for today's high school and university students, professionals, and educators. Summary of Position: The Data Analyst, Global Enrollment will be a collaborative team player who is responsible for processing, storing, analyzing, and preparing data for output, and providing technical support to internal and external audiences. The Data Analyst's responsibilities include conducting full lifecycle analysis of the recruitment, admissions, marketing and enrollments processes to aid in data-driven decision making and planning. The position will develop analysis and reporting capabilities for the Global Enrollment (Study) area, while also developing quality control plans to identify improvements and data governance. The Data Analyst will collaborate with data stakeholders across CIEE to optimize workflow and work directly with staff members with data analysis responsibilities across Study. In this role, the Data Analyst:Interprets data, analyzes results using statistical techniques and provides ongoing reports.Collects and analyzes large datasets from internal stakeholders and external vendors that can be used to contribute to the student recruitment strategy.Develops and implements data sets, data collection systems, data analytics and other strategies that optimize statistical efficiency and quality.Extracts data from Salesforce and other platforms to create visual dashboards in DOMO as needed.Identifies potential trends or patterns in complex data sets.Filters and \"cleans\" data by reviewing reports and results to locate and correct code problems.Establishes data governance best practices for Global EnrollmentWorks with management to prioritize business and information needs.Locates and defines new process improvement opportunities.Creates, updates, and maintains student and organization records; manages and processes change requests related to the integrity of data and the database.Tests and authenticates changes to the data sets, reports or other technical functions as required.Collaborate with team leads on survey building, design and execution as well as focus groupsRequirementsKnowledge of and technical expertise regarding data reporting, data models, database design development, data mining and segmentation techniques.Knowledge of Salesforce (or other CRM's, SIS's), DOMO, Marketo, Excel, Access, SQL for writing queries for extracting information out of databasesKnowledge of statistics and experience using statistical packages for analyzing datasets (such as Excel, SPSS, AMOS, SAS, etc)Ability to use strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracySkill in writing queries, report writing, and presenting findingsAbility to handle all activities and highly confidential information with patience, discretion, tact and a keen eye for detail while working with people from a wide variety of backgroundsAbility to prioritize, organize and work independently, or as part of a project team, to complete multiple tasksAbility to identify potential process and workflow improvementsAbility to derive insight from large amounts of data from diverse sourcesAbility to quickly learn new applications and equipmentAbility to train staff on best practices of data analysis in admissions systems (i.e., training on query and report building)Strong communications skills and ability to make effective presentationsSkilled in handling stressful situations and resolving conflictTalent for organizing and prioritizing multiple tasks and projects in fast-paced environment, including excellent follow-upHigh level of enthusiasm, energy, and flexibilityExcellent organizational skillsStudy abroad or overseas experience preferred"}