{"jobID": "2630537395", "jobLocation": "Sunnyvale_CA", "jobTitle": "Customer Support Program Manager (TEMP)", "companyRating": null, "companyInfo": {"Website": "www.infinera.com", "Headquarters": "Sunnyvale, CA", "Size": "1001 to 5000 employees", "Founded": " 2001", "Type": " Company - Public (INFN) ", "Industry": " Telecommunications", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Ciena"}, "estimatedSalary": null, "jobDescription": "Your Key Responsibilities Would Include: This is a key position in Infinera Service Lifecycle System team. The Trials and Demo Program Manager provides leadership to drive, proactively and consistently track trials and demos across multi-product, multi-release environment of cutting edge technology and innovation. Tangible results will be measured through improved cross-functional team planning, coordination and the implementation of processes and tools to deliver world-class trials with rapid time-to-market and with minimal surprises. The role demands excellent teamwork with the various partner organizations including Global Customer Support / Technical Support (GCSTS), Manufacturing, Sales Operations, Systems Engineering (HW, SW, ASIC), Product Line Marketing (PLM) and Marketing. This position will involve managing and driving cross-functional teams to ensure successful trials.  Works closely and acts as a key interface and central driving and coordination point with Marketing, PLM, Manufacturing, Engineering (HW/SW), Test and Technical Support teams to ensure that full product team deliverables, issues, schedules from various groups are driven, coordinated, tracked, communicated cross functional team and decisions driven and consensus built  Keep and communicate plan of record to Trial Core Team.  Analyze situations or issues that require an in-depth knowledge of organizational objectives, as well as, an understanding of company intricacies. Help implement policies when selecting methods, techniques and evaluation criteria for obtaining results.  Establish and assure adherence to schedules, work plans and performance requirements while meeting high quality standards.  Escalate key issues quickly and effectively and help drive to resolution. When challenges arise, show leadership in pulling cross-functional teams together to address critical issues.  Schedule and document meetings, meeting notes, actions and prepare presentations. Maintain and communicate team status on Intranet  Ability to provide succinct, compressive reports and updates Education & Experience Necessary For Success: Bachelor Degree required. BS in Business Administration, CS, EE, Engineering or ME strongly preferred.  Ideally have 3+ years experience in program or project management in cross functional program management (HW/SW/Test/Manufacturing).  PMP certification or Project Management related certification is a plus.  Possess great initiative, flexibility, superior judgment and have excellent leadership skills.  Must have a superior knowledge of business process and product life cycle management. Must be able to quickly learn and apply the company’s business process to make an immediate impact.  Must understand the interdependencies between cross functional groups mentioned above.  Possess the drive to work in a fast-paced environment. An independent worker, self-starter that has experience to act on issues with appropriate urgency and with little guidance and understand implied tasks is a must.  Must possess superb communication skills with efficient use of the standard communication tools, including superior presentation skills. Must be articulate enough to convey technical ideas to non-technical team members.  Has the ability to multi-task within a single project or across multiple programs simultaneously.  Must possess excellent organizational and project management skills and excellent attention to detail and processes.  Advanced skills using Microsoft Office Suite particularly Microsoft Project, Excel, PowerPoint, Word, Visio and SharePoint. #LI-KS1Infinera is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, age, status as a protected veteran, or status as a qualified individual with disability. EEO Employer/Vet/Disabled."}