{"jobID": "2761881287", "jobLocation": "San_Diego_CA", "jobTitle": "Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.miteksystems.com", "Headquarters": "San Diego, CA", "Size": "201 to 500 employees", "Founded": " 1987", "Type": " Company - Public (MITK) ", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "67000", "jobDescription": "What Youll Do (Role Description)Mitek is looking for a Data Analyst to join our global technology department. This person will be a core member of a newly-formed cross-functional data team responsible to drive best-in-class machine learning algorithms and global coverage of our solutions for digital identity (ID) verification. To do this, the analyst will partner across the technical functions (R&D;, Engineering, QA, and Product) to collect and process data, provide analysis, as well as summarize and visualize data.Mitek delivers a large-scale, globally-distributed cloud platform that relies on advanced analytics capabilities to derive analytic insights that drive all aspects of our business. For this reason, we need someone who is technically sharp, a creative problem solver, productive working independently or collaboratively, and a successful analyst.Essential Duties and Responsibilities include:Design data collection methods, evaluate large amounts of data, decompose high level information into details, abstract up from low-level information to a general understanding, analyze trends, and distinguish appropriate requirementsReview product results from field or test usage to determine functional gaps or inconsistenciesRun data through test tools to create reports and identify product success patternsConsult with members of the product and technology teams to develop analyses that lead to actionable insights that accelerate profitable growthProvide additional support as necessary to create and modify product templates, label data, and manipulate data for product improvement purposesPerform random tests of customer transactions, collecting statistics, and identifying patterns / issues to be addressed Who You Are (Soft Skills, Attributes) Ability to summarize complex issues simply and effectivelyExcellent verbal and written communication skillsMust be a self-starter, with relentless curiosity and attention to detailAnalytical, creative, and innovative approach to solving problemsPositive, people-oriented, and energetic attitudeDemonstrated ability to work with ambiguous requirements, adapt, and learnMeticulous attention to detail and excellent problem solving/troubleshooting skills What You Need (Skills/Experience) BA / BS degree with strong academic record, ideally in Mathematics, Statistics, or Computer ScienceExperience using Tableau as a tool for the development of data analytics and decision support tooling2-4 years in positions providng data analysis and managing small to medium projectsExpert level Excel (pivot tables, VLOOKUP, etc) skillsExperience creating dashboards and effective data visualizationExperience using data visualization tools such as Kibana, D3.js, Tableau, Domo, or QuicksightMS Office SuiteTraining and experience in statistics, data manipulation, visualization, and analysisSuccessful history of providing documentation to convey information and drive decision making What Would be Nice (Preferred Skills/Experience) 2-4 years of experience in a quantitative roleExperience with the open source Elastic Stack (Elastic Search, Logstash, Kibana)Amazon Web Services Image processing and image manipulation libraries and associated technologiesExposure to Big Data platforms and technologies such as Amazon EMR and HadoopExposure to SQL and NoSQL databases and document stores such as SQL Server, MongoDB, RavenDBKnowledge in data mining, machine learning, natural language processing, or information retrievalExperience processing large amounts of structured and unstructured dataAdditional data analysis tools such as SPSS, SAS, and/or Microsoft SSAS or AccessPrior experience in secure practices of handling sensitive data and PIIAbout Mitek\"Accelerating the digital transformation of business through intelligent mobile capture.\"Mitek (NASDAQ: MITK) is an innovator in Artificial Intelligence and Machine Learning that simplify everyday tasks.We are a global leader in mobile capture and digital identity verification software solutions. Miteks ID verification allows an enterprise to verify a users identity during a mobile transaction, enabling financial institutions, payments companies and other businesses operating in highly regulated markets to transact business safely while increasing revenue from the mobile channel. Mitek also reduces the friction in the mobile users experience with advanced data prefill. These innovative mobile solutions are embedded into the apps of more than 6,100 organizations and used by tens of millions of consumers for mobile check deposit, new account opening, insurance quoting, and more.We have a track record of breakthrough achievements that have helped to transform mobile banking and the identity authentication markets. As a result, we have grown globally with offices in the UK, the Netherlands and Spain.Were looking for team members that live our core values of Delivering, Learning and Caring."}