{"jobID": "2782824576", "jobLocation": "Boston_MA", "jobTitle": "Civil Engineering Technology Consultant - Intern", "companyRating": "3.5", "companyInfo": {"Website": "www.microdesk.com", "Headquarters": "Nashua, NH", "Size": "201 to 500 employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "39000", "jobDescription": "Civil Engineering Technology Consultant – Intern Nashua, New Hampshire  Boston, Massachusetts Position at Microdesk Do you have a passion for learning about evolving technologies coupled with strong problem solving, communication and customer service skills? Then keep reading…  Microdesk combines technology and business process consulting to help firms successfully plan, design, build and operate land and buildings. With Microdesk, you are part of a company that supports the life-cycle of the design process from planning through operating and managing.  As an Intern at Microdesk, you will work closely with the existing Civil Consulting Team and Project Managers on many aspects of service opportunities like the following, but not limited to: Assist with Delivering Professional Services to our clients with the Existing Civil TeamAssist with Leading transactional solo engagements (one-person team) with the Existing Civil TeamAssist with creating pre-sales demonstrations on an as-needed basis with the Existing Civil TeamAssist with Contributing to Marketing based activities with the Existing Civil TeamAssist with Contributing to Technical Support with the Existing Civil TeamAssist with the creation of Civil 3D Standards with the Existing Civil TeamAssist with Civil 3D Production Work Hours: Full Time Monday through Friday, 8am to 5pm. What We Require: Experience using AutoCAD Civil 3DPursuing a degree in Civil engineering or related industryInterest in AEC technologiesDetail-oriented and strong ability to multitaskStrong interpersonal skillsExcellent organizational skillsPositive attitude and a desire to contribute and learn About Microdesk:  Microdesk is a design technology consultancy with 12 offices nationwide that provides the architecture, engineering, construction, and manufacturing industries with premiere consulting, implementation, support, and training solutions using today’s leading technology products from Autodesk, IBM, Modelstream, Panzura and Bluebeam. We are dedicated to fostering the professional growth and development of our employees.  Microdesk, Inc. is an Equal Opportunity Employer."}