{"jobID": "2830929943", "jobLocation": "New_York_NY", "jobTitle": "gTEAM Editor, Customer Service, Fluent in English and French (Montreal, Canada)", "companyRating": null, "companyInfo": {"Website": "www.forcebrands.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About The PositionOverview Glossier's gTEAM (customer experience team) is looking for enthusiastic, thoughtful, and highly motivated problem solvers who are passionate about creating an innovative customer experience and building strong relationships with our customers. This position plays a crucial part in the overall online customer experience the company offers.  In this entry-level role, you will be the first point of contact for our customers and engage with them on email, social media, and chat. Our editors answer a variety of questions from returns, exchanges, lost packages, to questions surrounding our products and company. Our editors are strong representations of Glossier's mission, values, and voice. As a gTEAM editor, you'll have the opportunity to work both independently and as part of a larger support team.  Instead of a traditional cover letter, we'd like for you to tell us (in 500 words or less) why you want to work in customer service and what role you think customer service plays at a company like Glossier. ResponsibilitiesProvide \"above and beyond\" customer service in all interactions with customers and think creatively about ways to optimize each customer's experienceTackle an array of problems, questions, or comments from our customers and tailor solutions accordinglyMaster our internal management system in order to efficiently and effectively help our customersBecome an expert on the Glossier policies, products, and brand, including details on our ingredients and packagingQualificationsCustomer service or hospitality experienceFluent in French and EnglishExceptional communication skillsComfortable working across multiple communication channelsHighly detail oriented with exceptional writing skillsTechnically proficientSelf-reliant and adaptableComfortable with repetitionAn approachable style with a personal touch and a \"no such thing as a stupid question\" attitudePassion for the Glossier mission & love for Glossier productsAble to work an assigned schedule that falls within our operating hours and a flexibility around weekends and holidaysAbout the gTEAM The gTEAM drives customer loyalty, engagement and value by providing exceptional customer experiences across all channels and touch-points. About Glossier Glossier is a beauty company that lives in NYC, is sold on the internet, and promotes a skincare-first philosophy that celebrates beauty in real life. "}