{"jobID": "2730008233", "jobLocation": "Santa_Clara_CA", "jobTitle": "Research Intern-Healthcare", "companyRating": null, "companyInfo": {"Website": "www.frost.com", "Headquarters": "San Antonio, TX", "Size": "1001 to 5000 employees", "Founded": " 1962", "Type": " Company - Private", "Industry": " Media", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Research Associate - Part-time Intern in Santa Carla, CA Frost & Sullivan is seeking a Research Associate for a part time intern position for our research unit with the Healthcare team. As a research intern, you can investigate the hottest trends in evolving industries such as healthcare and information technology, and explore companies impacting markets.  The principal responsibility is to conduct secondary research, determining unique product and service offerings of top companies by gathering critical information through web-based research and supporting in-depth phone interviews—talking to leading company executives! The investigational research will result in the development of a detailed research deliverable. Ideal candidates will have the propensity towards an analytical mindset, research abilities, organizational skills to track individual progress toward output goals and timelines, and display marketable PowerPoint skills.  Today, more than ever before, companies must innovate, not only to survive, but thrive in the future. We’ve spent more than 50 years guiding our clients toward transformational growth strategies by focusing on innovation opportunities driven by disruptive technologies, mega trends, emerging markets and new business models. This is your opportunity to be part of a revolutionary global team that truly inspires positive global changes. Learn more about Frost & Sullivan: http://tinyurl.com/Frost-Sullivan-overview Responsibilities:Work strategically with the Transformational Health team to bolster research effortsAccess and collate relevant secondary research information to support the project research process and objectivesProvide support in outreach to set up and conduct phone interviews with relevant organizationsReference interview notes and secondary research to form deliverable output slides in PowerPoint that address research objectivesAssist Frost & Sullivan industry analysts with collecting and reviewing both primary and secondary data about the market, regulatory and competitive landscapeMeet individual and team deadlines and monthly performance measuresQualifications:BA or BS degree is preferredProficiency in Microsoft Office Suite (Word, Excel, and PPT)Previous experience with Internet-based researchPrevious experience with primary research interviewing preferredBenefits:Part time intern position/approximately 16-24 hours per weekBusiness casual dress attire (blue jeans on Fridays)Internship experience is for the benefit of the intern Frost & Sullivan, the Growth Partnership Company, works in collaboration with clients to leverage visionary innovation that addresses the global challenges and related transformational growth opportunities that will make or break today's market participants. For more than 50 years, we have developed growth strategies for the global 1000, emerging businesses, the public sector and the investment community. Our “Growth Partnership” supports clients by addressing these opportunities and constructs the foundation upon which visionary innovation becomes possible. This includes our 360 degree research, comprehensive industry coverage, strategy, vision, innovation and implementation.  Frost & Sullivan is committed to a work environment free of all forms of discrimination. Frost & Sullivan recruits and hires without regard to race, color, religion, sex, marital status, age, disability, national origin, veteran status, or sexual orientation. If you want to find out more about Frost & Sullivan, visit our website www.frost.com  Apply online today and include a copy of your CV/resume and any relevant certifications, writing samples, social media links, or other pertinent documentation: https://tinyurl.com/yav65hak"}