{"jobID": "2657562256", "jobLocation": "Mountain_View_CA", "jobTitle": "Ph.D. Research Intern (Computer Vision)", "companyRating": null, "companyInfo": {"Website": "www.jd.com", "Headquarters": "Beijing, China", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Public (JD) ", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Research Intern for Ph.D. students (Computer Vision) You will work on the algorithm research and development to provide the best user experience for our e-commerce customers. To support the core business of JD.COM, Platform Product R&D; team at JDs Silicon Valley R&D; center is striving to take advantage of the most advanced algorithms and use them to improve JDs retail business. Your work will have a direct impact on the brand new e-commerce user experience using cutting-edge technologies.  Responsibilities  - Participation in the research and implementation of algorithms in one of the following fields: Computer Vision//Machine Learning.  - Work closely with other R&D; team members and product team to apply the result to our e-commerce product.  - Participate in Intellectual Property generation and academic publications. Qualifications - Ph.D. student in Computer Vision/Image Processing/Machine Learning field  - Have experience of one of the following topics: image recognition; 3D reconstruction, SLAM, Augmented Reality, visual search  - Fluent in at least one of the following languages: C/C++/Python  - Previous internship experience is a plus About JD-PPD The goal of the Silicon Valley PPD team is to build critical components of the next generation online retail platform by researching and developing intelligent algorithms in the areas of Computer Vision (Image Recognition, 3D Reconstruction, VR/AR), Computer Graphics (Simulation and Rendering) and Natural Language Processing (Natural Language Generation, Topic Segmentation, Sentiment Analysis). As a result of the innovations driven by PPD, online shopping experiences will no longer be limited to flat text, a few static pictures or short video clips. Instead, our platform will bring the online shopping experience to life, offering deeply personalized and highly tailored user content, with 3D information delivered in VR/AR, powered by an AI-based cloud system and experienced with fully-connected smart devices. Millions of our users will be inspired and enriched every day by the work of the PPD team in Silicon Valley. JD.com is an Equal Opportunity Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class."}