{"jobID": "2768477705", "jobLocation": "San_Jose_CA", "jobTitle": "Route Delivery Driver", "companyRating": "4.1", "companyInfo": {"Website": "www.farmfreshtoyou.com", "Headquarters": "West Sacramento, CA", "Size": "501 to 1000 employees", "Founded": " 1976", "Type": " Company - Private", "Industry": " Agriculture & Forestry", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "17", "jobDescription": "Farm Fresh To You is an innovative Community Supported Agriculture (CSA) home and office delivery business that provides fresh, local, organic produce and whole farm products to consumers’ doorsteps. Farm Fresh To You makes it easy for consumers to eat produce as part of a healthy lifestyle by offering several different box types and sizes delivered on a frequency that fits their needs. We’re growing fast, working hard and looking for exceptional people to join our team. ABOUT THE POSITION: We are looking for a Route Delivery Driver that can deliver products or render services. This is a full-time, non-exempt, graveyard shift position located in San Jose. ESSENTIAL DUTIES AND RESPONSIBILITIES:Drives a delivery van to deliver specialty foods to customer’s home or place of business.Uses GPS and maps to maximize efficient use of time.Follows customer instructions.Records deliveries on daily delivery record and reports any questions, issues, or deliver concerns.Listens to and resolves service complaints.Regular and predictable attendance is required.Must adhere at all times to good driving practices in the use of the vehicle.QUALIFICATIONS:Delivery experience a plus.Must have current California Driver’s License (Class C) and proof of insurance or insurability.Must have a clean DMV record (1 point or less in the last 3 years).Must be available to work a full-time graveyard schedule. The position is a 4-day, 10 hour shift (typically Mon-Thurs, 7pm-5am).Must be willing to deliver in adverse conditions ie. rain, cold as well as in the dark.High school diploma or general education degree (GED).Must be able to pass a background screening."}