{"jobID": "2801526218", "jobLocation": "New_York_NY", "jobTitle": "Orion - Assistant Negotiator, National Activation", "companyRating": null, "companyInfo": {"Website": "www.orionworldwide.com", "Headquarters": "New York, NY", "Size": "201 to 500 employees", "Founded": " 1996", "Type": " Company - Public (IPG) ", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Company Overview Work hard. Be nice. For over 20 years, that has been our mantra at Orion Worldwide, a global media agency part of Interpublic Group. Join a growing business best described as an agency at the intersection of media buying, barter and direct response advertising. We guide marketers to find the most effective media saving solutions for their business needs.  At Orion, we know our employees are our most important asset. We are devoted to building a team with diversity of thought, background and experience. Our goal is to drive a vibrant culture of creativity and collaboration, which we encourage through regular team building experiences and flexible office design.  Watch Orionites describe what makes this place special: https://www.orionworldwide.com/our-story/  Creating the Orion experience, together: Focus on your development: training sessions, career mapping, and workshops.Empowered to make a difference with employee-led initiatives:COSMOS – dedicated to Diversity and InclusionFun events planned by the C.O.O.L. CommitteeWe’re going to be plastic free in 2018 thanks to the Eco CommitteeWell-being at work: Keep moving with our walking track, treadmill desks and standing desksFree snacks and drinks: Breakfast every morning, iced coffee on tap, beer/wine in the fridgeTake a break with a co-worker: Game Room and Ping PongDiscretionary Time Off – there’s no cap on vacation days!Position Summary Orion has an entry-level role for an Assistant Negotiator on the National Activation team. The primary responsibility of this role is to assist in the day-to-day stewarding of media activity, General Market and Direct Response, on assigned clients for the integrated team. The Assistant is required to update client documents and assist in the development and negotiation of media plans. Additionally, he/she is required to learn and know the procedures and processes of the day to day stewardship of the assigned accounts Essential FunctionsDevelop an understanding of clients’ goals and strategiesDevelop effective negotiation skillsAssist in inputting and tracking media buysAnalyze and negotiate makegoods/changes to schedulesHandle ad-hoc client requestsBecome a media partner expert; sharing marketplace knowledgeManage the posting process by analyzing and monitoring network schedules and performancesReview billing discrepancies with buyers and resolve in a timely mannerCompile research data to advise recommendationsDevelop audience estimates for programmingEstablish a positive and professional working relationship with all Orion staff, media vendors, partner agencies and clientsRecommend new ways of more efficiently managing and maintaining clients’ schedules and processesQualifications Education: Bachelor degree in related field Work Experience: Previous internship in related field strongly preferred Skills: Knowledge and passion for media/advertisingExcellent written and oral communication skillsExceptional attention to detail, organization skills, and multi-tasking capabilitiesStrong quantitative skills, including analytical abilitiesProficiency at Microsoft Office: Excel, Word, PowerPointAbility to be flexible and be a team playerEnergetic self-starter with a strong work ethic and integrityStrong interpersonal skillsAbout Us Orion is a global agency group that serves advertisers. We help our clients save money on their planned media expenditures while also offering the ability to optimize asset returns. Established in 1996, the company has more than 400 employees in offices across Asia Pacific, Europe, Latin America and North America. Orion is a business unit within IPG Mediabrands, a division of Interpublic Group (NYSE:IPG)."}