{"jobID": "2813328912", "jobLocation": "New_York_NY", "jobTitle": "AML KYC Remediation Consultant - Contractor Role (Projects 3 -12 months at Multiple levels)", "companyRating": null, "companyInfo": {"Website": "www.sia-partners.com", "Headquarters": "Paris, France", "Size": "501 to 1000 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Company DescriptionSia Partners is a unique global management consulting firm composed of 950+ passionate consultants who drive business changes among our customers. Through unparalleled industry expertise, we deliver superior value and tangible results to our clients in over 21 sectors and service teams.  Sia Partners has been present in the US since 2012 through an acquisition of a well-established consulting firm specialized in Financial Services, Oil & Gas and Energy. It has enjoyed continuous growth since: the US is now its second biggest market.  Sia Partners is hiring! Thanks to Sia Partners international footprint, the Financial Services and Gas Oil & Energy practices are strategically located in all major financial and energy hubs (New York, Charlotte, Houston, UK, Europe, and Asia Pacific) and our integrated model allows teams from different countries to easily partner, when appropriate.Job DescriptionWe are currently searching for a Sub Contractor/ Contractor for our AML, KYC Remediation team at a Global Bank. The project will be about 3 -12 months. This individual will work on-site at our Financial Service clients and assist the banks in performing KYC Remediation for their customers accounts. (The title of this position will be based on experience)This individual will be responsible for performing KYC Remediation of our clients customers accounts by drafting procedures, describing the process of remediating their accounts, and then executing this approach.Collaboration with internal and external bank stakeholders.Understand the US and Global Regulations to perform KYC remediation.Analyze existing AML/KYC policies, guidelines and procedures and create new AML/KYC policies, guidelines and procedures that are consistent with the US Global Regulations.Perform GAP Assessment of the required information that will be needed for customer accounts.Identify and implement new regulatory rules.Enhance and centralize the banks onboarding policies, guidelines and procedures. This includes: preparing information requests to relationship managers, retrieve missing documentation from their customers, screen and transaction monitoring of the accounts, and compile the final KYC packages to complete the remediation.Prepare information requests for relationship managers, and retrieve missing documentation from their customers.Screen and transaction monitoring of the accounts, and compile final KYC packaged to complete the remediation.QualificationsStrong academic background (e.g. Business, Mathematics, Economics, Engineering).At least 2 years in management consulting experience or Financial Services.Outstanding team player, autonomous, dynamic, result oriented, rigorous and committed.Excellent communication skills (verbal and written) and able to communicate complex ideas to all areas of the business.Flexibility, able to execute against tight deadlines, work with minimum supervision, exercise independent judgment and prioritize work.Assist clients with onboarding their new client relationships and remediation of active clients by working with multiple the business lines. Includes US KYC / AML, Dodd Frank, FATCA and other regulations that impact their business.Knowledge of AML, KYC Sanctions, screening and on boarding, Due Diligence compliance framework, i.e. USA Patriot Act, BSA, OFAC, etc.Collect, upload and investigate client documents.Process modelling: Analyze current business process to understand the business needs and to determine how to best fulfill those needs.Strong knowledge of Client On-Boarding process/lifecycle and experience of such projects within a top tier Financial Institution or Management Consulting firm.No Relocation or Travel Stipend. Additional InformationAll your information will be kept confidential according to EEO guidelines.  Sia Partners is an equal opportunity employer. At Sia Partners, we are committed to treating all Applicants and Associates fairly based on their abilities, achievements, and experience without regard to race, national origin, sex, age, disability, veteran status, sexual orientation, gender identity, or any other classification protected by law."}