{"jobID": "2811521308", "jobLocation": "San_Ramon_CA", "jobTitle": "Corporate Strategy Intern - 4 Month Fall Term", "companyRating": null, "companyInfo": {"Website": "www.blackberry.com", "Headquarters": "Waterloo, Canada", "Size": "1001 to 5000 employees", "Founded": " 1984", "Type": " Company - Public (BBRY) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Worker Sub-Type:Student (Fixed Term) Job Description:POSITION SUMMARY As students of BlackBerry, you will play an important role in the success of our business. BlackBerry provides you the opportunity to be amazing! We offer a dynamic work environment where you are encouraged to achieve your highest potential. Each of our opportunities offers meaningful, hands-on experience working alongside industry experts.  Working in Blackberry’s Corporate Development and Strategic Partnership Team, the successful candidate will assist a team focused on developing and executing on the global corporate strategy. The successful candidate will assist the team in assessing opportunities within and adjacent to the existing product development roadmaps and provide analysis of options to close those opportunities including internal development, partnering and acquisition.  Location: San Ramon. CA  Length of Term: 4 Months RESPONSIBILITIESThe Corporate Strategy Associate is responsible for assisting the Corporate Development & Strategic Partnerships team in implementing corporate level strategies for mergers and acquisitions and strategic alliances Job responsibilities include:Supporting Corporate Strategy team objectives on market, strategic and company specific analysesDeveloping market intelligence and insight on key industry trends (technology, IP, competitors, consumers, regulatory, etc.) and their strategic implications to BlackBerryCollecting and organizing market data for various technology sectors/products by working with industry and research analysts and preparing market and technology summary overview materials as well as strategic landscape analysisPreparing presentation materials and financial modelsTracking company specific news and information and generating summary reportsSKILLS AND QUALIFICATIONSCurrently enrolled in a post-secondary education in Engineering/Computer Science/Business Bachelor’s Degree/MBA, or related field of studyDemonstrate familiarity and knowledge of emerging technologies with an innate passion and curiosity for technologyEnthusiastic, hard-working, humble and intellectually curiousPractical knowledge of financeStrong analytical abilityHighly organized and detail orientedAbility to develop opinions and articulate them clearlyADDITIONAL ASSETSHigh ethical standardsInherent love of technologyCurious attitude and self-starter with strong interpersonal skillsFamiliar with trends in Enterprise Software, IoT, Connected Cars, and related technology market segmentsJob Family Group Name:Business Practices & OperationsScheduled Weekly Hours:40"}