{"jobID": "1976056324", "jobLocation": "New_York_NY", "jobTitle": "Licensed Dispensing Optician Position", "companyRating": "4.1", "companyInfo": {"Website": "www.qspex.com", "Headquarters": "Alpharetta, GA", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "14", "jobDescription": " Licensed Dispensing Optician Position  Location: New York, NY Department: OSC Bronx New York Description QSpex Technologies, Inc.Job DescriptionPosition Title: Licensed Dispensing Technician (LDO)Reports To: Optical Service Center ManagerDepartment: Optical Service CenterFLSA: Non-Exempt Location: Optical Service Center in respective DMAJob Summary:Responsible for making prescription eyeglasses according to specifications provided by ECPs, as well as edging and inserting lenses into frames to produce finished glasses. Essential Functions:Adjust lenses and frames to correct alignment.Mount, secure, and align finished lenses in frames or optical assemblies using precision hand tools.Clean finished lenses and eyeglasses, using cloths and solvents.Measure mounted or unmounted lenses after completion to verify alignment and conformance to specifications, using precision instruments.Ability to work independently and as part of a teamAbility to communicate effectively to both technical & non-technical audiencesMinimum Qualifications:Bachelor’s degree preferredLicensed OpticianClean driving recordAt least 3 years prior experience as a Retail or Bench Optical Technician preferred.Working EnvironmentWhile performing the duties of this job employees are regularly required to stand, walk, use hands and fingers, reach with hands and arms, talk or hear, kneel, bend, crouch, climb or balance. Regular physical activity may be required, and comfortably lifting items weighing from 5 to 25 lbs and up to 50 lbs on occasion. This position description does not constitute an employment agreement between QSpex and employee and is subject to change by the Company as the needs and requirements of the position change. The position description is intended to describe the general nature and level of work being performed by people assigned to this classification, and should not to be construed as an exhaustive list of all responsibilities, duties and skills required of personnel so classified. All personnel may be required to perform duties outside of their normal responsibilities from time to time, as needed."}