{"jobID": "2749044090", "jobLocation": "Waltham_MA", "jobTitle": "QA Intern", "companyRating": "3.0", "companyInfo": {"Website": "www.barracudanetworks.com", "Headquarters": "Campbell, CA", "Size": "1001 to 5000 employees", "Founded": " 2004", "Type": " Company - Public (CUDA) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Symantec, McAfee, SonicWall"}, "estimatedSalary": "67000", "jobDescription": " Are you a technology MacGyver? Do you like breaking things and making them do things they’re not intended to do? Do you like not just writing code, but exploring the technologies and the cloud infrastructures that empower it?  Do you want to learn what running hosted software applications, 24/7, ‘on the cloud’ REALLY means? If so, join us at Barracuda this summer.  Our application is live 24/7 - managing petabytes of information, and processing millions of items a day for thousands of customers who utilize a full set of features for interacting with the data. A business application working at a massive data scale - what could be more challenging?  The broad experience you’ll get working with our QA, automation and Development teams is invaluable if you aspire to someday build successful web applications yourself.  As a part of our QA team, you’ll work closely with Developers to develop test automation and tooling for a highly distributed cloud-based web application. We are looking for developers who are interested in working at all layers of the application (frontend/backend), and who will leverage their passion for customer experience in all they do at Barracuda.  So if you want to write software, hone your programming skills, develop ‘full stack’ / ‘cloud’ capabilities and learn how to to be a system-level thinker - all in service to providing our customers with high quality software - come join our team! The ideal candidate:Is a coder with an intuitive grasp of technology and passion for codingIs not afraid to learn and figure things out for themselvesHas an entrepreneurial zeal for getting things done and delighting customersMay have familiarity withRuby or similar programming languagethe agile development process and continuous integration/deploymentweb application developmentLinux command line and server-side software engineering practicesIs interested in stretching and learning new things. Our tech stack makes use of Git, Chef, Jenkins CI - and we develop our app using Clojure, Javascript/React/etc., Ruby/Rails Elasticsearch, PostgreSQL and other technologies. Our QA automation framework is comprised of Watir/Selenium, Ruby, and Cucumber.On our team, you’ll:Gain exposure and leverage your experience with modern javascript frameworks and web technologies, as well as distributed backend systems at scale.Be on a team that values code quality, innovative thinking, good communication tools, sound testing practices and diverse opportunities for mentoring.Get hands-on with your work directly impacting the product live in ProductionPerks include:Macbook Pro for useBeing on the cutting edge of cloud computing innovationDiverse and engaging engineering culture"}