{"jobID": "2825440064", "jobLocation": "Boston_MA", "jobTitle": "Director-Data Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.aig.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1919", "Type": " Company - Public (AIG) ", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "171000", "jobDescription": "Functional Area: FA - Finance  Estimated Travel Percentage (%): Up to 25%  Relocation Provided: No  National Union Fire Insurance Co of Pittsburgh, PA Responsibility: 1. Lead a project team of data scientists, actuaries and business analysts to advance technical pricing capabilities  2. Lead the project to deliver robust pricing models consistent with planned technical pricing milestones and capabilities as agreed with business leadership and other parties.  3. Partner with global pricing team, local underwriting, claims, operations, IT and other stakeholder groups to develop the best framework to progress on pricing related data gathering, model building, usage tracking and governance frameworks  4. Play a pivotal role in designing, structuring, executing and implementing new predictive pricing models and raters  5. Work with pricing governance, reserving, ERM, regulators and other related groups to meet regulatory and compliance requirements for pricing including documentation, model risk assessments and model validation  Qualification  1. BA/BS degree or equivalent from a quantitative area (Math, economics, finance, computer science, operation research, insurance and risk management, etc.), advanced degree is preferred  2. Thorough, hands-on understanding of advanced modeling methods such as GAMs, GBMs, GLMs, GLMMs, GMMs, decision trees, regularization techniques, SVMs, and random forest etc.  3. Expert level P&C; insurance domain knowledge, evidenced by FCAS/ACAS designation or equivalent knowledge basis.  4. 5+ commercial insurance pricing experience, management experience a plus  5. Advanced SQL skills and excellent programming skills in at least one of the quantitative analysis software packages/languages such as VBA, R, SAS and Python  6. Demonstrated ability to effectively interpret data and modeling results, distill actionable insights and present them to stakeholders  7. Knowledge of an additional general purpose programming language such as C++ or Java.  8. Excellent communication skills both in written and verbal  9. Organized, self-motivated, results-oriented and resourceful  It has been and will continue to be the policy of American International Group, Inc., its subsidiaries and affiliates to be an Equal Opportunity Employer. We provide equal opportunity to all qualified individuals regardless of race, color, religion, age, gender, gender expression, national origin, veteran status, disability or any other legally protected categories.  At AIG, we believe that diversity and inclusion are critical to our future and our mission - creating a foundation for a creative workplace that leads to innovation, growth, and profitability. Through a wide variety of programs and initiatives, we invest in each employee, seeking to ensure that our people are not only respected as individuals, but also truly valued for their unique perspectives.  Requisition #: JR1809233"}