{"jobID": "2767946517", "jobLocation": "New_York_NY", "jobTitle": "Technical Account Manager", "companyRating": "4.2", "companyInfo": {"Website": "www.turbonomic.com", "Headquarters": "Boston, MA", "Size": "201 to 500 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": "Are you a technical account manager seeking an exciting opportunity at a Forbes Cloud 100 company? If so, you might be perfect for Turbonomic!As one of our Technical Account Managers (TAM), you will be responsible for building and maintaining post-sales relationships with Turbonomics largest and most complex customers. You will serve as a TAM to ensure successful implementations and to ensure that the customers serve as a positive reference and continue their operationalization of Turbonomic technology, documenting Turbonomic value and ROI realization.Additionally, you will become the customers single point of contact into all things, Turbonomic. As such, your technical abilities are critical in identifying solutions, troubleshooting issues, and answering technical questions as they arise. Come support the only Hybrid Cloud Management platform and help make customers successful.What you'll be doing: Provide project leadership for the customers major Turbonomic initiatives. This would include project management functions and solutions architecting functionsAssist the customer in defining, capturing, documenting and sharing the actual financial value provided by Turbonomic and establish the ROIDesign and develop innovative solutions to customer requirements , with assistance from our internal engineering group and product managementMaintain current functional and technical knowledge of the Turbonomic, virtualization, converged infrastructure and storage networksGather and maintain current information on the customers virtualization infrastructureProvide clear and constructive product feedback to Turbonomic Product Management teams based on customer requirementsHelp to document best practices in developing and deploying Turbonomic solutionsFunction as a front-line technical resource for best practice and informal customer questions and act as liaison between customers and both the Engineering and Product Management officesWhat you'll bring:5 years experience minimum in customer-facing positions as a technical account manager, client manager, professional services consultant or sales engineerBachelor's Degree in Math, CS, Economics, Engineering or related field or equivalent experienceUnderstanding of hardware and software architecture, and infrastructure design and developmentStrong technical background, with previous experience in Linux system administration and Virtualization managementStrong analytical skills regarding technical and project management issuesStrong professional documentation skills and willingness to create professional documented deliverables for customersStrong understanding of strategic sales processStrong organizational skills with an ability to manage competing client demandsExcellent communications and interpersonal skillsAbility to travel approx. 25% percent of the timeSoftware Development experience a plusCandidates that live and work in the greater tri-state area will be consideredBenefits & Perks:Health, dental and vision coverage health is a #1 priority here also, eat your fruit!Career advancement jump in, make an impact and shape your careerUnlimited Paid Time Off visit mom, see a doctor or travel the world must take picturesPre-tax benefits: Medical, Dependent Care, Commuter, 401kAccess to executives no doors are closed, go bug them and make friendsBeer Fridays, unlimited snacks, cold brew coffee physiological needs, check.Game rooms play a round of billiards, ping pong or game on some XboxTurbonomic delivers enterprise organizations with automation software that enables on-premises and public cloud to self-manage in real-time, thereby assuring performance while lowering cost and maintaining compliance with business policies. The Turbonomic platform matches workload demand to infrastructure supply, helping customers maintain a continuous state of application health. Serving customers since 2010, Boston-based Turbonomic is one of the fastest growing technology companies, trusted by thousands of enterprise organizations to activate their hybrid cloud journey. Turbonomic was name a 2017 Tech Innovator by CRN and Forbes Cloud 100 company, positioning us as the leaders of hybrid cloud transformation. Come be part of the transformation."}