{"jobID": "2820347513", "jobLocation": "New_York_NY", "jobTitle": "Sr. Art Director", "companyRating": "3.3", "companyInfo": {"Website": "www.tmp.com", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Jibe, Phenom People, SmashFly Technologies"}, "estimatedSalary": "68000", "jobDescription": " Unbridled creativity. Wicked smarts. Positive vibes. Thats what we expect from a Sr. Art Director at TMP. Here, you'll be part of an integrated creative department charged with creating soup-to-nuts solutions that are transforming the way employers and job seekers connect. That means building powerful, authentic employer brands. Conceptualizing and executing robust recruitment campaigns. And creating smart, striking and targeted designs across a wide variety of digital and traditional media. All this in an environment that constantly challenges you to push beyond boundaries and enhance your expertisewith the support of a global team of industry experts. We want to see concepts that make us go all goose-fleshy. We want to see artwork and layouts that move us to quiet tears. And we want your next idea to be even better. Sound like your bag? Read on.  As a Sr. Art Director, you need to be well versed in digital trends and will be able to lead teams in social, mobile and online concepts and executions, as well as traditional offline platforms. You will work in tandem with incredible teams of copywriters, and Creative Directors on a diverse range of Fortune 1000 clients, while executing the creative departments award winning visual design work across digital, traditional and social advertising, marketing and promotional material. What does a great Sr. Art Director do?Works with creative directors, digital strategists, producers and account service team members to help define client challenges and goals and to develop strategic and creative solutions that meet those goals.Work directly with client contacts to help establish the creative/marketing objectives, strategies, tactics and final, required creative executionsIn partnership with Copywriters and CDs, participates (and at times leads) creative concepting sessions in an effort to deliver industry-defining work across all media.Translates concepts into fresh, cutting-edge and effective visual designs for digital, social, mobile and traditional media channels while leveraging existing assets and/or creating/sourcing new ones.Continually grow, learn and experiment with new and innovative ways in which to solve client problems, and how to turn those solutions into innovative, dynamic creative executions.Presents concepts internally to CDs and account/sales teams and actively participates in client calls and meetings with an eye toward building and strengthening relationships.Conducts ongoing research to help formulate ideas and drive effective creative while staying ahead of best practices, trends and new innovations in design, content generation/development and technology.Requirements for considerationBA degree from four-year college or university (preferably in Graphic Design, Digital Design, Advertising or a related field).Graphic design experience incorporating both print and digital projects (agency experience preferred) a plus.Strong visual sense with ability to execute to vision in Adobe InDesign, Photoshop, Illustrator, InDesign and Keynote/PowerPoint on the Mac platform.Solid understanding of web design principles, including responsive/adaptive design, user experience & accessibility, as well as traditional prepress and production.Knowledge of web animation, CSS, HTML, JavaScript or other programming skills are an asset, but not required.Experience with video editing, animation or rendering packages a plus.Excellent listening and communications skills with the ability to pay strict attention to detail while juggling several complex projects is a must.Strong interpersonal skills, with a focus on relationship building and customer service.Please include design samples or a link to your portfolio.We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.#GDCreative"}