{"jobID": "2828400362", "jobLocation": "San_Jose_CA", "jobTitle": "Teller", "companyRating": "3.5", "companyInfo": {"Website": "www.wellsfargo.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1852", "Type": " Company - Public (WFC) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "13", "jobDescription": "Job DescriptionAt Wells Fargo, we want to satisfy our customers financial needs and help them succeed financially. Were looking for talented people who will put our customers at the center of everything we do. Join our diverse and inclusive team where youll feel valued and inspired to contribute your unique skills and experience.  Help us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you.  Community Banking operates one of the most extensive banking franchises in the country, serving customers through approximately 6,000 branches and 13,000 ATMs in 39 states and the District of Columbia. Our group includes Business Strategy and Administration; Customer and Branch Experience; Customer Remediation Office; Distribution Strategy Group; Regional Banking; Regional Services; and Customer Segments, and serves mass market, affluent, and small business customers. Our focus is on delivering an exceptional experience for our customers and providing the products and services that will help them realize their financial hopes and dreams.  A teller provides exceptional customer service and spends almost all of his/her time working with Wells Fargos most important asset, our customers. Tellers are responsible for a variety of tasks including providing excellent customer service, processing account transactions effectively, helping resolve customer concerns in a timely fashion, following proper procedures to minimize errors and reduce fraud, and sharing the benefit our customers may receive when meeting with a banker, when appropriate. Tellers are expected to always balance their cash drawers, build great rapport with people, and be strong team players who take pride in performing well and enjoy helping others.  Important Note: During the application process, ensure your contact information (email and phone number) is up to date and upload your current resume prior to submitting your application for consideration. If you are a Wells Fargo Team Member, in your Jobs Profile ensure that your email address is valid and updated to an address that can receive external emails outside of the banking network and is a different email address than the one you originally used when you joined WF. Initial contact with you will be made via e-mail. Please check your e-mail regularly for updates.  Position requires full-time training for 3 weeks.Required Qualifications1+ year of experience interacting with people or customersDesired QualificationsAbility to navigate multiple computer systems, applications, and utilize search tools to find informationBasic Microsoft Office skillsCash handling experienceCustomer service focus with the ability to stay positive in interactions with customers and team membersExperience offering products and servicesExperience working in a fast-paced environmentGood communication skills including speaking clearly, succinctly, and accurately while using a pleasant tone and common conversational courtesiesAbility to meet or exceed performance objectivesRelevant military experience including working with military protocol and instructions, enlisted evaluations, officer/leadership reportingRelevant military experience including working in personnel benefits management, processing military personnel orders or transitions, wartime readiness operations, human resources or military recruitingOther Desired QualificationsMultilingual speakers are encouraged to applyJob ExpectationsAbility to stand for extended periods of timeAbility to work weekends and holidays as needed or scheduledStreet AddressCA-San Jose: 1006 Blossom Hill Rd - San Jose, CADisclaimerAll offers for employment with Wells Fargo are contingent upon the candidate having successfully completed a criminal background check. Wells Fargo will consider qualified candidates with criminal histories in a manner consistent with the requirements of applicable local, state and Federal law, including Section 19 of the Federal Deposit Insurance Act.  Relevant military experience is considered for veterans and transitioning service men and women.  Wells Fargo is an Affirmative Action and Equal Opportunity Employer, Minority/Female/Disabled/Veteran/Gender Identity/Sexual Orientation."}