{"jobID": "2825399156", "jobLocation": "Boston_MA", "jobTitle": "High Level Data Scientist - Boston, MA (REMOTE) - $170K", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Senior Data Scientist - Boston, MA (Remote) - $170K My client is looking for a talented Data Scientist to join their Boston pracitce. They need a candidate with the experience to be hands on with coding, algorithms, predictive models, data mining, and analytics. Likewsie, they need someone with the communication and functional abilities to be a mentor and leader to their team of Data Scientists. There will be a lot of cross functiona teamwork and an understanding of the full lifecycle development of a project is a must. Senior Data Scientist - Boston, MA (Remote) - $170KRequired Experience & Qualifications:Natural Language ProcessingDeep LearningAWS Big Data - S3, EMR, EC2Computer VisionImage ProcessingMachine Learning PipelinesEnterprise Size DataPython, R, ETLRole & Responsibilities:Drawing key insights to drive critical decision makingConducting data mining and building predictive modelsCollaborating with peers and managers to consistently exceed client expectationsParticipating in the full cycle of strategic client analysis projects from client facing kick-off to code delivery or implementationBenefits & BonusCompetitive base and bonusFull medical/healthOpportunity to work with the newest technology in the industryCompany Match 401k programRemote workExciting company culture If you or someone you know is interested in this position, please send your resume directly to [Click Here to Email Your Resumé] or call 212-731-8282. My client is looking to start the interview process as soon as possible.  FRG Consulting is a leader in Niche IT Recruitment with a focus on cloud technologies including Azure & AWS, as well as Big Data, Data Science and BI. We deal with both Microsoft Partners, AWS partners & End Users throughout North America. We have open positions and relationships with some of the top partners and end users throughout the US and offer some excellent opportunities in the BI, Big data space.  I understand the need for discretion and would welcome the opportunity to speak to any Big Data and cloud analytics candidates that are considering a new career or job either now or in the future. Confidentiality is of the upmost importance. For more information on available BI jobs, as well as the Business Intelligence, Big data and cloud market, I can be contacted at 212-731-8282. Please see www.frgconsulting.com for more information.  Big Data / Data Science / Hadoop / Microsoft Business Intelligence / BI / Business Intelligence / SSRS / SSAS / SSIS / SQL / T-SQL / MDX / Azure / Cloud / AWS / Data Warehouse / ETL / Power BI / Architect / Big Data / Hadoop / Scala / Python / Apache / Hive / Spark / Data Science / Analytics / Predictive Modelling /Big Data / Data Science / Hadoop / Microsoft Business Intelligence / BI / Business Intelligence / SSRS / SSAS / SSIS / SQL / T-SQL / MDX / Azure / Cloud / AWS / Data Warehouse / ETL / Power BI / Architect / Big Data / Hadoop / Scala / Python / Apache / Hive / Spark"}