{"jobID": "2745356297", "jobLocation": "Boston_MA", "jobTitle": "Sr. Salesforce Developer", "companyRating": "4.4", "companyInfo": {"Website": "www.incapsulate.com", "Headquarters": "Washington, DC", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Acumen Solutions, Slalom, Accenture"}, "estimatedSalary": "81000", "jobDescription": "Who we are: Incapsulate provides services from conception to delivery. We are a team of developers, designers, and analysts who are committed to helping businesses solve problems using state-of-the-art technology. We believe that the best results are achieved by people who are passionate about what they do and continually strive to be better - those are the people we hire.  Who We Are Looking For:  Incapsulate is searching for a Sr. Salesforce Developer to join our team in Boston, MA of skilled and passionate individuals working on a variety of interesting and challenging projects.  Were looking for people who have a strong passion for the Salesforce platform and though still maintain an interest in a variety of other technologies. As a Sr. Developer, youve experienced a lot; but you still love it and wouldnt want to do anything else.  Responsibilities:  The Sr. Salesforce Developer will design and implement key technical components of Salesforce solutions and help direct other technical resources to develop and deliver various project deliverables. They will help reduce the overall project technical risk by uncovering design issues early in the project life-cycle, share implementation best practices, and recommend solution alternatives. This is a hands-on role that requires significant technical experience and abilities with Salesforce.com and related cloud technologies.Responsibilities:- Hands-on design and development of custom solutions on the Force.com platform including significant work in Apex, VisualForce and application integration patterns.  - Judges the tradeoffs with technology and feasibility and makes choices that fit the constraints of the project.  - Serves as the technical expert on projects focused on Salesforce.com - Sales Cloud, Service Cloud, and the Force.com platform.  - Designs and implements business technology solutions focused on cloud-based business applications, specifically, Salesforce.com.  - Direct involvement and/or oversight of developing business requirements, specifications, process flows, application design, application configuration and testing, administration  - Release and Environment Management including sandbox usage planning, metadata and data migration, environment comparisons and version control.  - Works directly with business partners to lead projects, facilitates business process analysis sessions, develops and delivers key components of technology solution.  - Take a leadership role in helping advance and support our Salesforce Practice.  - Assist in training and mentoring of Jr. Developers and growing the current SalesForce team.  - Assist with client presentations and proposal creation as required.  - Assist in writing technical approach and design documentation.  - Help create integration and development project plans and designs.  Required Skills:  - 8+ years as a software developer.  - 5+ years experience with Salesforce.com and 4+ years as a Salesforce.com developer.  - 4+ years VisualForce and Sites page development.  - 5+ years Enterprise and Partner WSDL, and REST integration development.  - 7+ years experience with technologies integral to Salesforce.com including: HTML/XHTML, jQuery, Javascript, AJAX, SQL, SOAP, REST, JSON, Apex, SOQL.  - 7+ years understanding of data structures, data modeling and DB schema.  - 5+ years experience with enterprise integration tools and ETL tools.  - 4+ years knowledge of Salesforce Integration Patterns.  - 4+ years multiple Salesforce project deployments including 2+ years with release and environment management on enterprise level deployments.  - 3+ years Salesforce.com Communities, Partner/Customer Portal implementation.  - 3+ years Data modeling using Force.com Platform standard and custom objects.  - 3+ years experience with Salesforce.com security model and sharing rules.  - 2+ years experience with modern JS frameworks like Angular.js and repositories such as SVN and GitHub.  - 2+ years experience building AppExchange Apps to pass Salesforce.com security review.  - Experience with Lightning Design System and creating components.  - Salesforce Platform Dev I certification is required as a minimum. Other Salesforce certifications expected.  - Excellent written and verbal communication skills.  Education:  - Bachelors Degree in Engineering, Computer Science, Mathematics or equivalent work experience.  What we bring to the table:  - Flexible, fun environment with tremendous growth potential, and the opportunity to make significant contributions.  - Innovative environment that encourages learning and adoption of the latest tools and technologies.  - Freedom to explore and challenge yourself in a variety of ways.  - Competitive compensation package.  - 100% Company paid benefits (health, dental, vision, life insurance) for all employees.  - Monthly and annual cell phone benefits.  Please connect with us on LinkedIn at: https://www.linkedin.com/company-beta/987663/  *Incapsulate is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender, identity, national origin, disability or veteran status."}