{"jobID": "2817438350", "jobLocation": "San_Jose_CA", "jobTitle": "RF Design Engineer", "companyRating": "3.4", "companyInfo": {"Website": "www.skyworksinc.com", "Headquarters": "Woburn, MA", "Size": "5001 to 10000 employees", "Founded": " 1962", "Type": " Company - Public (SWKS) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "113000", "jobDescription": "    If you are looking for a challenging and exciting career in the world of technology, then look no further. Skyworks is an innovator of high performance analog semiconductors whose solutions are powering the wireless networking revolution. At Skyworks, you will find a fast-paced environment with a strong focus on global collaboration, minimal layers of management and the freedom to make meaningful contributions in a setting that encourages creativity and out-of-the-box thinking. Our work culture values diversity, social responsibility, open communication, mutual trust and respect. We are excited about the opportunity to work with you and glad you want to be part of a team of talented individuals who together can change the way the world communicates.  Requisition ID: 47689   In this impactful role, you will be leading development of PA and front-end modules for the fast paced and highly competitive cellular handset market. Candidates will provide technical leadership in all phase of the product development, including product definition, architecture, system, transistor-level circuit design, MCM design, layout/layout supervision, lab debug and production support. Job RequirementsStrong experiences in PA, multi-chip module (MCM) and RF front end design and product developmentsStrong RF fundamentals such as impedance matching, distributed systems, passive RLC and resonant circuits, noise, linearity, bandwidth and stabilityStrong circuit simulation skills utilizing Agilent ADS/GoldenGate/spectreRF and 2.5/3D EM tools such as Momentum or HFSSExperience on RF switch and/or RFIC/analog circuit design highly desirableStrong problem solving and lab debugging skills. Hands on experience in RF tuning and using RF instrumentsGood understanding of cellular RF systemsExperience with leading a projectAbility to work with cross function teams, including test engineers, product engineers, application engineers, program managers and marketing     REQUIREMENTS:Bachelers of Science (BS) degreeEight (8) years of direct relevant experienceStrong experience in PA and RF module designStrong problem solving and lab debugging skills. Hands on experience in RF tuning and using RF instruments.Strong RF fundamentals such as impedance matching, distributed systems, passive RLC and resonant circuits, noise, linearity, bandwidth and stability.Experience on RF switch and/or RFIC/analog circuit design highly desirable.Good understanding of cellular RF front end systems and specs.   Open Market Platforms (OMP) The Open Market Platforms team at Skyworks develops industry-leading, front-end solutions targeting mass market devices deployed by smartphone manufacturers worldwide. Our design engineers have diverse expertise and utilize a broad range of technologies (SOI, silicon CMOS, GaAs, IPD, TC-SAW, and pHEMT) to create differentiated products that meet the intersection of performance and cost requirements for LTE RF front ends. These solutions include high-efficiency power amplifiers, multi-gain LNAs, multi-throw switches, controllers, acoustic filters and integrated modules. Skyworks’ OMP team is an ideal place for motivated engineers who enjoy collaboration in a dynamic environment and designing for performance, cost and quality in the fastest growing segment in mobile.     #LI-DD1                 Skyworks is proud to be an equal opportunity employer supporting diversity in the workplace."}