{"jobID": "2782647577", "jobLocation": "El_Segundo_CA", "jobTitle": "Advanced EO Systems Junior Level EO Target Tracking and Data Analyst - Secret", "companyRating": "3.7", "companyInfo": {"Website": "www.raytheon.com", "Headquarters": "Waltham, MA", "Size": "10000+ employees", "Founded": " 1922", "Type": " Company - Public (RTN) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "45000", "jobDescription": "Job Description:Raytheon Space and Airborne Systems (SAS) is the leading provider of advanced EO systems. We provide war fighters the most accurate and timely information available for the network-centric battlefield. This position is specifically for a Systems Engineer to provide algorithm systems engineering as part of the Advanced EO Department. This department provides the full range of systems design and analysis-related activities in support of SAS EO programs.These activities include:Development of mathematical algorithms for EO signal processing and calibrationDevelopment of mathematical algorithms for target tracking and data fusionDevelopment and maintenance of system requirements and system architectures, to include leading and/or participation in requirements trade studiesComputer modeling and simulation of sensor physics and phenomenologyPerformance predictions and analysis of data received from sensors on various platformsTechnical presentations to both internal and external customersTechnical team leadership participating in technical peer reviews throughout the product lifecycle of design, development, integration and test, and flight test requirements verificationInterface with their team lead, team members, and other teams (SW and HW) on a daily basisConduct or participate in customer and/or program technical review presentations, and provide task progress status updates and work products to the team lead.Required Skills: Minimum 6 years of related work experience developing original mathematical algorithms or quantitative analysis techniques OR 2+ years of related work experience with Advanced degreeExperience with MATLAB, C/C++, or related languagesDemonstrated mathematical problem solving ability and data analysis experienceKnowledge of data association and track filtering techniques (e.g., Kalman Filtering, Multi-Hypothesis Tracking)Demonstrated interpersonal communication, presentation skills, verbal and written communication skillsStrong desire to learn, take initiative and contribute in a team-oriented environmentU.S. Citizenship status is required as this position needs an active U.S. Security Clearance as of day one of employment.Must have an active DoD Secret security clearance prior to commencing workU.S. Citizenship and ability to access to US only data systems as separate requirements within the basic qualifications/required skills list.Desired Skills: Able to effectively perform multiple tasks and priority actionsWork experience in requirements and system architecture development and maintenanceExperience in developing algorithms, in particular target tracking algorithms for surveillance radar and EO applications.Experience in radar and EO data analysisExperience in target tracking for surveillance radar applicationsExpertise in Matlab, C/C++ preferred.Knowledge of or experience with DOORSCustomer focus and collaboration skillsDemonstrated team leadership experienceExperience working on a technical team of Systems Engineers and AnalystsGraduate level coursework in and/or work experience in digital filtering, linear algebra, stochastic processes, estimation theory, and detection theoryRequired Education: BS in Engineering, Physics, Math or related discipline;Desired Education: Advanced degree(s) in Engineering, Physics, Math, System Engineering or related disciplineThis position requires a U.S. person or the ability to obtain an Export Authorization from the appropriate government agency for non-U.S. persons.U.S. Citizenship status is required as this position needs an active U.S. Security Clearance as of day one of employment. 115698Raytheon is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, sex, sexual orientation, gender identity, national origin, disability, or protected Veteran status."}