{"jobID": "2799556881", "jobLocation": "Redwood_City_CA", "jobTitle": "Intern: Associate Business Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.equinix.com", "Headquarters": "Redwood City, CA", "Size": "5001 to 10000 employees", "Founded": " 1998", "Type": " Company - Public (EQIX) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "85000", "jobDescription": " Intern: Associate Business AnalystAbout Equinix Equinix (Nasdaq: EQIX) is the leading global interconnection platform and the world’s largest data center provider. With more than 145 data centers on five continents and $3+ billion in annual revenue, we dream big and hire people who want to help us build a historically significant company.  We are looking for bright and enthusiastic college students who love to learn and want to make an impact on the world. Join the Equinix team and shape the future of cloud computing and enterprise connectivity at one of the Fastest Growing Technology Companies in America (Forbes). Opportunities The Equinix Internship Program offers wide-ranging opportunities in Information Technology, Engineering, Human Resources, Finance and more. Spend your time gaining practical work experience and learning from some of the sharpest minds in the industry. Work in a culture that thrives on innovation and delivering results, while building solid relationships with industry leaders, and fellow students from around the country. ProjectsSecurity Ecosytem Mapping: As part of the Business Development and team, take a list of security companies, determine if those companies are current customers, and for those companies that are customers, contact them and learn and document what their service offerings are at Equinix. Obtain permission from those companies to advertise their services located on the Equinix Platform.Responsibilities/TasksResearch list of security companies within CRM toolWork with Equinix account managers and Global Solutions Architects (GSAs) to understand what service(s) customer is offering at EquinixFind and work with representatives of customers to undertand what service(s) customer is offering at Equinix.Document and categorize customer offerings.Obtain permission from customers to advertise them in Equinix’s security ecosystem.QualificationsStrong customer networking and interaction skills with the ability to find the right personnel within an organization to speak with Equinix, communicate with those customers over the phone, understand their offerings, and how those offerings impact EquinixCurrently pursuing Bachelor’s DegreeIntellectually curious, resourceful, self-motivated, & customer-focusedStrong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracyStrong technical aptitude. Proficiency in Microsoft Office software applications, such as Word, Excel, Access, Project and PowerPoint."}