{"jobID": "2648322781", "jobLocation": "Beverly_Hills_CA", "jobTitle": "Strategy and Analytics Intern", "companyRating": null, "companyInfo": {"Website": "www.livenationentertainment.com", "Headquarters": "Beverly Hills, CA", "Size": "10000+ employees", "Founded": " 2005", "Type": " Company - Public (LYV) ", "Industry": " Media", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " AEG, StubHub"}, "estimatedSalary": null, "jobDescription": " Job Summary: Title:Strategy and Analytics InternLocation: Beverly Hills, CAWho are we? Live Nation Entertainment is the world’s leading live entertainment company comprised of global market leaders: Ticketmaster, Live Nation Concerts, Live Nation Media & Sponsorship and Artist Nation Management. Ticketmaster is the global event ticketing leader with over 465 million tickets sold and more than 12,500 clients in 22 countries. Live Nation Concerts has become the single largest provider of live entertainment in the world producing over 25,500 shows annually for over 3,300 artists in 37 countries. Artist Nation Management is one of the world’s leading artist management companies, representing more than 350 artists. These businesses power Live Nation Media & Sponsorship to deliver music marketing programs across 900 brands enabling advertisers to tap into the 63 million fans Live Nation Entertainment delivers annually through its live event and digital platforms. For additional information, visit www.livenationentertainment.com. Who are you? Passionate and motivated. Driven, with an entrepreneurial spirit. Resourceful, innovative, forward thinking and committed. At Live Nation Entertainment, our people embrace these qualities, so if this sounds like you then please read on! The Role: Are you a marketing and analytical technologist? Do you aspire to be one? Maybe you haven't heard that term before, but the sound of it stirs your curiosity — a job at the intersection of marketing and product strategy? Then this might be the opportunity you've been hoping for.  We're seeking people with a special blend of analytical and technical passion for cool marketing experiences on the web — to join our team of marketing technologists. Break into the exciting and rapidly growing field of Conversion Rate Optimization!  We are looking for a design and analytical oriented thinker to join our quickly growing conversion rate optimization team.  You will learn a systematic and repeatable process for increasing conversion rates and consequently revenue through discovering and testing design and copy variations on websites. You will learn how to identify what drives people's action on a website and how to plan new web-page designs for maximum conversions. This is a highly valuable skill set that is in a new and growing field. Learning ObjectivesOptimize both qualitative data (research insights like survey responses) and quantitative data (hard numbers like site analytics)Reading results and creating digestible reports for customers to understandQualifications:Must be currently enrolled in an accredited college and receive college creditMust be available 20 hour per week internshipIdeal for analysts, design thinkers, and marketersAny amount of experience with the following is a plus: Photoshop and other design tools, Design projects (please provide examples!), A/B testing, Google Analytics, Market Research, Testing, Customer Insights Research, Tableau, Microsoft ExcelA thirst for learning and ambitions to be able to manage clients directly If the above description sounds like you and fits your background, apply online at www.livenation.com/careers to join the Live Nation Entertainment team today!  Applicants for employment in the U.S. must possess work authorization which does not require sponsorship by the employer for a visa. EQUAL EMPLOYMENT OPPORTUNITY Live Nation Entertainment strongly supports equal employment opportunity for all applicants regardless of race, color, religion, sex, gender identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, sexual orientation, genetic information, or any other characteristic protected by state or federal law. HIRING PRACTICES The preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.  Live Nation Entertainment recruitment policies are designed to place the most highly qualified persons available in a timely and efficient manner. Live Nation Entertainment may pursue all avenues available, including promotion from within, employee referrals, outside advertising, employment agencies, Internet recruiting, job fairs, college recruiting and search firms."}