{"jobID": "2737601850", "jobLocation": "Cambridge_MA", "jobTitle": "Data Analyst, Business Development", "companyRating": "4.3", "companyInfo": {"Website": "www.cargurus.com", "Headquarters": "Cambridge, MA", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Public (CARG) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "77000", "jobDescription": " Meet CarGurus—the #1 visited car shopping website in the US. At CarGurus, we’re building the world’s most trusted and transparent automotive marketplace where it’s easy to find great deals from top-rated dealers.  CarGurus is a technology company with a passion for data and its power to simplify every aspect of the car shopping experience. Using proprietary technology, search algorithms and innovative data analytics, we provide unbiased validation on pricing, dealer reputation and vehicle history.  The Business Development team owns strategic partnerships and initiatives that are essential to CarGurus strategy. The team is looking for a Data Analyst with strong technical skills to spearhead analysis that will help guide the business strategy, execution and partnering activities. This candidate will be excited to work with business intelligence tools, a variety of analytics techniques and complex data to arrive at insightful conclusions. The Data Analyst will have an opportunity to influence key business decisions, reporting directly to the Director of Business Development and working hand in hand with our Analytics Guild.  The candidate must be comfortable multi-tasking and working cross-functionally to solve shared business problems. A successful candidate will possess an outstanding analytical skillset, drive and strong communication qualities. What You’ll Do:Conduct ad hoc data mining and analysis to support exploration of hypothesesProvide complex reporting from diverse data sets sourced from various partnersPresent clear data analysis, visualizations, and insights to key stakeholdersParticipate in partnership development and due diligence activitiesSupport and maintain data and other integrations with strategic partnersOwn the tracking of existing and prospective partnershipsBuild influential presentations and models that communicate key insights and recommendationsWho You Are:Bachelor’s degree or equivalent required; in a related field preferred (e.g. Economics, Math, Statistics, or Computer Science)1 to 3 years of experience in data analysisKnowledge of SQL and data structuresWorking knowledge of various data analysis and reporting tools and comfort in getting up to speed on new tools (e.g. Looker, Tableau, or similar business intelligence tools)Self-motivated, well-organized and detail-orientedStrong communication and presentation-building skillsHigh degree of professional and personal integrityAble to thrive in a dynamic environmentAbility to work independently and in a cross-functional settingExcellent verbal and written communication skillsExpert in Microsoft Office suiteKnowledge and background in online advertising or related industry a plusCarGurus Culture: At the core of our company culture is a spirit of innovation, curiosity and collaboration. True to our start-up roots, we’re nimble, flexible and hardworking. We have a great respect for testing and learning and a healthy aversion to scheduling meetings to discuss meetings. Lunch is catered daily. Gym membership is free. Foosball and ping pong are played often. Now a publicly-traded company, we’re as committed as ever to cultivating the culture that got us here.  In addition to the US, CarGurus operates sites in Canada, the UK and Germany with other markets on the horizon. Our offices are located in Cambridge, MA, Detroit, MI and Dublin, Ireland. If you’d like to learn more, please visit our careers page."}