{"jobID": "2787146341", "jobLocation": "Newark_NJ", "jobTitle": "Onsite Recruiter", "companyRating": "2.5", "companyInfo": {"Website": "www.conduent.com", "Headquarters": "Florham Park, NJ", "Size": "10000+ employees", "Founded": " 2017", "Type": " Company - Public (CNDT) ", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "45000", "jobDescription": "Description Conduent is the world's largest provider of diversified business process services with leading capabilities in transaction processing, automation, analytics and constituent experience. We work with both government and commercial customers in assisting them to deliver quality services to the people they serve.  We manage interactions with patients and the insured for a significant portion of the U.S. healthcare industry. We are the customer interface for large segments of the technology industry and the operational and processing partner of choice for public transportation systems around the world.  Whether it's digital payments, claims processing, benefit administration, automated tolling, customer care or distributed learning - Conduent manages and modernizes these interactions to create value for both our clients and their constituents. Learn more at www.conduent.com.  Purpose:  •Responsible for development and administration of staffing/employment/recruiting programs.  •Responsible for developing and implementing more complex recruiting strategies for assigned business segment or geography. May support multiple clients, technology recruiting and/or executive level recruiting.  Scope:  General:  •Builds knowledge of the organization, processes and customers  •Requires knowledge and experience in own discipline; still acquiring higher level knowledge and skills  •Receives a moderate level of guidance and direction  •Moderate decision making authority guided by policies, procedures, and business operations protocol  Primary Responsibilities:  •Assesses applicants credentials and determines if skills meet the needs of the hiring manager  •Utilizes job fairs, college contacts, temporary agencies, search firms and internet tool to meet recruiting needs  •May function as technical or executive specialist sourcing, recruiting and identifying candidates for highly specialized and executive level positions  •All other duties as assigned Conduent is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, creed, religion, ancestry, national origin, age, gender identity, gender expression, sex/gender, marital status, sexual orientation, physical or mental disability, medical condition, use of a guide dog or service animal, military/veteran status, citizenship status, basis of genetic information, or any other group protected by law. People with disabilities who need a reasonable accommodation to apply for or compete for employment with Conduent may request such accommodation(s) by clicking on the following link, completing the accommodation request form, and submitting the request by using the \"Submit\" button at the bottom of the form. For those using Google Chrome or Mozilla Firefox please download the form first: click here to access or download the form."}