{"jobID": "2719489496", "jobLocation": "Boston_MA", "jobTitle": "Minimally Invasive Manager", "companyRating": null, "companyInfo": {"Website": "www.atricure.com", "Headquarters": "Mason, OH", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Public (ATRC) ", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Medtronic, St. Jude Medical, Boston Scientific"}, "estimatedSalary": null, "jobDescription": "AtriCure, Inc. provides innovative technologies for the treatment of Atrial Fibrillation (Afib) and related conditions. Afib affects more than 33 million people worldwide. Electrophysiologists and cardiothoracic surgeons around the globe use AtriCure technologies for the treatment of Afib and reduction of Afib related complications. AtriCure’s Isolator® Synergy™ Ablation System is the first and only medical device to receive FDA approval for the treatment of persistent Afib. AtriCure’s AtriClip Left Atrial Appendage (LAA) Exclusion System products are the most widely sold LAA management devices worldwide, with more than 100,000 implanted to date. For more information, visit AtriCure.com or follow us on Twitter @AtriCure. Position Summary: The Minimally Invasive Manager will be focused on the adoption of AtriCure’s ablation technologies during cardiac surgical procedures via a minimally invasive approach. The Minimally Invasive Manager is responsible for prospecting, qualifying, and closing direct business sales in the cardiothoracic operating room, EP Cath Lab, Interventional Cath Lab and related departments within the hospitals. This role must be able to work with sales teams and individuals within designated geography to develop, train and support physicians’ and their staff in various procedures and utilization of AtriCure technologies. Establish meetings and make presentations to top hospital administration to educate important stake holders on AtriCure’s products and key initiatives. This position requires excellent organization, relationship management, team work and strategic planning with their designated teams. ROLES AND RESPONSIBILITIES:Develop, implement and execute a strategic sales plan for designated territory to achieve assigned targetsSchedule and meet with top hospital administration to present tools and initiatives highlighting AtriCure products, and clinical approaches.Promote, establish and support Centers of Excellence for appropriate hospital facilities.Continually identify new customers, contacts and opportunitiesWork closely with the Area Director & V.P. of Minimally Invasive Surgery to implement and execute strategies to achieve corporate sales goalsWork with marketing to share industry news and trends and receive feedback of the sameAttend industry trade shows and events as neededManage your territory and track customer activityResponsible for understanding and satisfying the requirements for obtaining access to a hospital, healthcare system, or other client siteBASIC QUALIFICATIONS:Bachelor’s degree or relevant experienceSpecific knowledge and selling experience related to cardiac surgical ablation systems highly preferredMust have successful track record with sales quota achievementMust have strong clinical and technical aptitudeExcellent interpersonal skills. The candidate must enjoy and excel at personal relationship building.Problem-solving / trouble-shooting skillsMust be confident, goal oriented, self-motivated and a team playerMust have strong and proven relationship building skillsComputer experience with Microsoft programs such as PowerPoint, Outlook, Excel, and WordAbility to travel 25-80% depending on territory size, location and maturityPREFERRED QUALIFICATIONS:Experience selling in the medical device industrySuccessful sales history and experience in EP market and call point is preferredESSENTIAL JOB FUNCTIONS (Physical or mental qualification requirement – i.e. walk, sit, stand, bend, push/pull, lift (how much), travel %; O=Occasional, R=Regularly, N=Never):Regularly walk, sit, and standOccasionally bend and push/pullRegularly lift up to 25 pounds, occasionally lift over 25 pounds25-80% travel possibilityPosition dependent upon candidate passing pre-employment physical/drug screen All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, protected veteran status, status as an individual with disability, sexual orientation or gender identity."}