{"jobID": "2802810654", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist - Applied Machine Learning", "companyRating": "4.3", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "141000", "jobDescription": " About Uber Were changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now were a part of the logistical fabric of more than 600 cities around the world. Whether its a ride, a sandwich, or a package, we use technology to give people what they want, when they want it. For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer. And thats just what were doing today. Were thinking about the future, too. With teams working on autonomous trucking and self-driving cars, were in for the long haul. Were reimagining how people and things move from one place to the next. About AMLUber is a technology company that is changing the way the world thinks about transportation. We are building technology people use everyday. Whether it's heading home from work, getting a meal delivered from a favorite restaurant, or a way to earn extra income, Uber is becoming part of the fabric of daily life. The Applied Machine Learning team is bringing ML to all parts of the company. As part of the central Machine Learning org, we act as internal consultants who embed with other teams and advance the state of automation and intelligence at Uber. We partner with Data Science and Engineering teams to work on the highest impact projects to ensure we deliver value for Uber and our users. Our team is looking for ML enthusiasts with expertise in NLP, speech, deep learning, and other skills to grow our diversity of skills.Example Projects:Horserace deep learning architectures (e.g., CNN, LSTM, GRU) to develop the most accurate NLP models for labeling and routing support ticketsDevelop computer vision solutions to augment our OCR technologyPrototype real-time updating models for improving the accuracy of our ETAsResearch both supervised and unsupervised methods (e.g., GBTs, 1-class SVM, LSTMs) for detecting fraudVisualize and simplify Ubers communication strategy by using topic modeling (e.g., LDA, LSI, & word2vec)Train deep learning models to replicate the SMS patterns of our driver support agents Skills:MS or PhD in computer science, statistics, or a quantitative domain3+ years professional experience (post-graduation) delivering, scaling, and managing highly successful and innovative machine learning productsDemonstrable proficiency in coding (Python, Spark, and R preferred) and programming conceptsKnow core ML concepts (i.e. feature discovery and engineering, model validation, retraining strategies) like the back of your hand You bring substantial depth in at least 1-2 ML specialities (i.e. NLP, deep learning, recommender systems) where you can teach/develop othersA commitment to learning - We want someone who seeks to deliver impact, but also invests in themselves and others.A strong communicator who can partner with others to set a vision and then collaborate to deliver impactful results that are well explainedBenefits401(k) plan, gym reimbursement, nine paid company holidays.Full medical/dental/vision package to fit your needs.Unlimited vacation policy; take time when you need it.Employees are given Uber credits every month.Uber is an equal opportunity employer and enthusiastically encourages people from a wide variety of backgrounds and experiences to apply. Uber does not discriminate on the basis of race, color, religion, sex (including pregnancy)."}