{"jobID": "2822713710", "jobLocation": "Westwood_MA", "jobTitle": "Data Analyst, Digital Strategy", "companyRating": "4.0", "companyInfo": {"Website": "www.eversource.com", "Headquarters": "Hartford, CT", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Public (ES) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " Unknown / Non-Applicable", "Competitors": " National Grid USA, The United Illuminating Company, Southern Connecticut Gas"}, "estimatedSalary": "88000", "jobDescription": "Job Description Summary: Working with the Digital Strategy team, partner with Analytics Expert to transform data into strategic and operational insights designed to deliver value to the organization. The Senior Data Expert must be a master story teller, being able to see the data, interpret what it is telling, and present the story/findings, while able to pivot and adapt the message to the wide array of audiences. Core skills in mathematics and data analysis are critical in this role to utilize information gathered to resolve complex issues, weigh benefits and detriments of alternative solutions to convey for final decisions. The Sr. Data expert will be able to follow leads and identify paths to gather data leading to improvement in key areas of the Eversource customer digital and omni-channel experience.  Qualifications: Technical Knowledge/Skill/Education/Licenses/Certifications: Technical Knowledge/Skill: High degree of proficiency in ExcelProven experience presenting solutions to internal and external stakeholdersHands-on experience with digital analytics tools such as Google Analytics/Adobe Analytics.Significant exposure to SQL and relational databasesStrong analysis, data manipulation, and problem-solving skillsAbility to develop strong relationships across diverse teams (including statistical, technical, and marketing resources)Ability to manage through ambiguous and subjective situations Preferred: Experience with text analytics and machine learningExperience in airline operations or familiarity with operational dataExposure to R, Python, and D3Familiarity with Visualization tools like tableau, Power BI or Domo Education: BA or Master’s Degree in Computer Science, Statistics, Applied Math or related field  Experience: At least two years of recent experience as Data Analyst, Business Intelligence Developer, or a related analytical role Please submit a resume with your application. Worker Type:RegularNumber of Openings:1SEO Category:Finance/Accounting JobsEEO Statement Eversource Energy is an Equal Opportunity and Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to age, race, color, sex, sexual orientation, gender identity, national origin, religion, disability status, or protected veteran status.  VEVRRA Federal Contractor"}