{"jobID": "2762668997", "jobLocation": "New_York_NY", "jobTitle": "Analyst - Consumer Brand Insights", "companyRating": "2.9", "companyInfo": {"Website": "www.hallandpartners.com", "Headquarters": "London, United Kingdom", "Size": "201 to 500 employees", "Founded": " 1991", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Kelton, Ipsos, Millward Brown"}, "estimatedSalary": "62000", "jobDescription": "Who we are We help our clients build brand relationships that matter, that are commercially and emotionally rewarding. We do this by understanding people and closing the relationship gap between businesses and people.  Our positioning is as a strategic brand consultancy, powered by data and insight. We work with some of the world’s biggest companies shaping their brand relationships for them.  We do this through disciplined strategic thinking. This then acts as a driving force to extract hidden insights from further research investigation and data analytics. Role We have an exciting opportunity for an Analyst to join our team. You’ll work on a range of projects and client accounts, analyzing and interpreting data and providing engaging, actionable insights for our clients.  We’d love someone with a passion for communications and a keen interest to expand their skills in all types of research techniques and solutions including qual and quant techniques as well as mobile, digital and social media.  You’ll need to be proactive and have excellent organizational skills to respond to a wide range of requests and challenges. This role will be perfect for someone who loves getting under the skin of brands to passionately and confidently deliver the latest insight stories for our clients.  We are open to a variety of backgrounds including people with a passion for marketing, digital, analytics, social media, mobile, semiotics, human behaviour and psychology. Core responsibilities Supports the team in managing positive day to day client relationships.  Develops an awareness of the client’s business, including press coverage, their media laydown and digital strategy and previous projects, research and campaigns.  Understands our strategy and embraces new products, technologies and methodologies in client work.  Takes opportunities to present at internal meetings or training sessions to develop skills.  Develops a strong understanding of different research methods.  Develops key research skills including drafting and managing the execution of complex surveys; presenting data clearly and accurately; planning and undertaking analysis; interpreting data and preparing summaries.  Manages and optimizes timelines for research projects, collaborating with experts as needed. Ensures accuracy and attention to detail in all phases of a project.  Writes clear and inspiring insight stories for clients.  Shows a passion for the digital media landscape, actively applying our Digital Dos and using tools to analyze social data, developing bespoke reports for clients. Capable of gathering and analyzing data from different sources.  Stays up to date with developments in our industry and beyond with particular attention to trends, social media, consumer behavior and data/analytics.  Helps identify ways in which to improve efficiencies on client accounts and develop automated solutions. What we offer you We’ve been told that our culture is unique, it’s a difficult thing to put into words but it’s all about being challenging yet treating each other with respect. We are naturally curious and we love to learn and discover new things.  We nurture opinions and really respect people who have a point of view and aren’t afraid to share their thinking. We work as teams and responsibilities sit with everyone in that team, whatever their job title. A can-do attitude goes a long way in our business and we don't tolerate egos!  We are passionate about helping our people to learn, stretch and grow. We want this to be a place where people feel challenged, as well as guided and supported.  We have a Learn calendar packed with opportunities to attend interactive training sessions. From “OutsideIn” sessions with industry experts to “15 minutes of Fame” sessions with colleagues to share the amazing work we do, there are lots of ways to build your skills for the future. Benefits We want our people to feel rewarded for the great work they do. Here are some of the benefits we offer.  Comprehensive benefits program (including medical, dental and vision coverage)  401k program  Group life insurance  Generous vacation policy  Discretionary summer Friday bonus days  Employee Discount programs  To find out more about Hall & Partners click here to check us out online. Hall & Partners is an equal opportunity employer and are strongly committed to promoting equal opportunity. We maintain an Equal Opportunities, Diversity and Anti-Harassment Policy to inform, guide and encourage equal opportunities practices within the Company. We are also part of the Omnicom group and together we promote and embrace equality and diversity through anumber of initiatives such as Omniwomen, ADCOLOR and Open Pride. You can read more about our commitment to do equalityand diversity here: http://www.omnicomgroup.com/culture/diversity/."}