{"jobID": "2821316385", "jobLocation": "Santa_Clara_CA", "jobTitle": "Contact Center Representative II", "companyRating": null, "companyInfo": {"Website": "www.keypointcu.com", "Headquarters": "Santa Clara, CA", "Size": "51 to 200 employees", "Founded": " 1979", "Type": " Nonprofit Organization", "Industry": " Finance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Summary: The Contact Center Representative II provides accurate and timely information to members through various service delivery channels, including telephone, email, chat, secure messaging within online banking and social media. The representative is expected to deliver an exceptional service experience with every interaction and drive strong member engagement by providing solutions that deliver value and enrich our members? lives.  The representative must collaborate effectively within the Contact Center and cross-functionally across KeyPoint to troubleshoot and resolve member inquiries. The representative participates in and contributes to the development of and maintenance of procedures to ensure consistent high quality member service. Responsibilities:The representative is expected to be knowledgeable and ensure members and potential members receive the highest level of service.The representative performs to high service standards established for the department. This includes high answer rates, low ?time to answer,? low abandonment ratios and strong member satisfaction scores. The representative participates in the Contact Center?s member engagement [sales] goals.S/he is expected to be professional, positive, genuine and friendly in approach at every member interaction and in working with colleagues and KeyPoint vendors.The representative uses information systems to analyze every interaction and deliver accurate detailed results.S/he displays empathy and offers solutions that are in the best interest of members and KeyPoint.The representative handles frustrated and abusive members with professionalism and escalates to the Contact Center Manager as necessary to effectively manage the interaction.S/he suggests improvements to further refine best practices for process and procedures.The representative is expected to work efficiently both independently and as a member of the Contact Center team.The representative provides support to other departments in projects and occasionally at member company events or KeyPoint sponsored events as needed.The representative participates in special projects, such as annual outbound call campaigns to perspective Dormant/Escheated accounts as needed.The representative complies with best practices, applicable laws and regulations.Tests DNA system updates.Updates Knowledgebase.Makes recommendations to departmental processes.Physical Requirements and Work Environment: This position does not require any physically strenuous effort. This is an indoor assignment. The incumbent will spend approximately 95% of the time sitting at a desk and using a telephone and PC to perform most of the work duties. An additional 5% of the time will be walking into work areas. The employee must occasionally lift and/or move up to 25 pounds. High school diploma or equivalent, college degree a plus.The following is a list of minimum and preferred experience: A minimum of 1 – 3 years of previous financial industry experience.A minimum of 1 – 3 years sales experience.A minimum of 1 – 3 years’ experience in customer service preferred.A minimum of 1 – 3 years call center experience preferred.Consumer lending experience preferred.Experience with Fiserv Open Solutions’ DNA System preferred.Basic cognitive math, writing, reading skills. Proven verbal and written communication skills.Strong computer competency skills.Must be flexible and dependable with work schedule based on business needs.Ability to achieve goals as assigned to position.Ability to organize, prioritize and multi-task. Ability to follow verbal and written instructions"}