{"jobID": "2824709986", "jobLocation": "New_York_NY", "jobTitle": "Account Manager - Latin America", "companyRating": null, "companyInfo": {"Website": "www.culvercareers.com", "Headquarters": "San Diego, CA", "Size": "51 to 200 employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Description We are currently seeking a personable, engaging, results oriented individual with Spanish proficiency and/or fluency for our Sales Associate role in lower Manhattan. The position has a vast range of responsibilities within the division including sales to existing and new clients. In this role, you will inherit an existing book of business that you will have the opportunity to grow. You ll be responsible for building business by identifying and selling prospects within your assigned territory. You will leverage your expert knowledge and professional demeanor to effectively build and maintain key client relationships while capitalizing on opportunities. Some travel will be required. Sales Associate Duties and Responsibilities Identify business opportunities with existing and prospective clients, evaluate their position in the industry, research and analyze sales options  Maximize revenue growth in assigned territory, including meeting or exceeding quota levels based on Altrum standards and plan expectations  Successfully conduct discovery/needs analysis with investment banking firms, managing directors, marketing directors, HR directors, SVPs within your given territory/accounts to evangelize Altrum s business solutions and acquire new business  Open new projects and work with the Account Management team to relay key project information  Maintain relationships with clients both in person and remotely through the distribution of marketing materials and by providing support, information, and guidance on our products and procedures  Prepare and deliver presentations to current prospective client groups; set up and host client meetings and training sessions  Contact Management enter and maintain client data in HubSpot system; leverage the system to generate additional contacts and sales  Identify product improvements or new products by remaining current on industry trends, market activities, and competitors.  Maintain professional and technical knowledge by attending educational workshops and reviewing professional publications; establish personal networks and participate in professional societies. IND123"}