{"jobID": "2831364549", "jobLocation": "Sunnyvale_CA", "jobTitle": "Financial Accountant Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.globant.com", "Headquarters": "Buenos Aires, Argentina", "Size": "5001 to 10000 employees", "Founded": " 2003", "Type": " Company - Public (GLOB) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "98000", "jobDescription": "At Globant, we dream and build Digital Journeys that matter to millions of users. We do that by leveraging engineering, design and innovation with our own industry-leading practices, like our Agile PODs and specialized Studios.  We want you to join us in creating these journeys for the biggest clients in tech, retail, travel, banking, ecommerce and media, revolutionizing and growing their core businesses while helping them (and you!) stay ahead of the curve.  WHAT ARE WE LOOKING FOR?  As a Financial Accountant Data Analyst, you will use your SQL skills to help the accountability department to fulfill their needs for monitoring tools in billing and financial target metrics. You will also be responsible to provide support on the setup of those dashboards and reports with the required integration with other department's datasources. So strong experience technical profile and competencies with be required.  YOU'LL GET THE CHANCE TO: Partner with Accountants and Finance Analysts to define and build new dashboards for global key indicators for the company.Explore, analyze and model billing and financial data using SQL tools.Analyze problems and data anomalies.Understand business processes and detect gaps across departments to propose improvements for a better data quality.Collaborate in the automation of data transformations and reports generation within the company infrastructure. WHAT WILL HELP YOU SUCCEED: Bachelor's degree in Accounting or Finance5+ years of proven experience in financial data analysis using database, reporting and/or business intelligence toolsStrong SQL skills for reports and data transformation.Experience handling and analyzing data quality, checking for anomalies, and exposing analysis results.MDM tools or similar are a bonus We are interested in hard-working, fast-learning talents and we have the know-how and scale to help you make your own career path. If you seek an entrepreneurial, flexible and team-oriented culture, come join us. We are ready."}