{"jobID": "2803550801", "jobLocation": "Burlingame_CA", "jobTitle": "Senior Data Scientist", "companyRating": "4.9", "companyInfo": {"Website": "www.color.com", "Headquarters": "Burlingame, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "183000", "jobDescription": " As Color grows, we are expanding our data science team to drive improvements across the company in product, growth, and laboratory operations. Our data science team tackles a range of challenges, such as helping Color reach a broader market, developing data-driven insights that guide our product roadmap, and using machine learning to drive operational efficiency in our state-of-the-art next generation sequencing laboratory.  Some topics you’ll be working on include:  Laboratory and process optimization to reduce turnaround time and lower costs, including partnering with our laboratory scientists to optimize assay design as we expand our report offering.  Analytics across our business channels (consumer, provider, employer, research) to help us understand our users and key challenges.  Designing experiments to improve our lab operations and product experience.  Working with Engineering to build infrastructure for data science and modeling.  Who we are looking for  We are looking for a motivated and proactive senior data scientist who will have a strong impact in each of these areas. Youll have opportunities to contribute both high-impact tactical analysis and exploratory data science that helps shape our future direction.  Youre well versed in the tools of the data science trade and a fast learner whos excited to dive into solving interesting problems in genetics and healthcare (or perhaps you already know a thing or two about these fields!). Youll take a proactive approach to leveraging data to help us grow and want to partner closely with engineering, product, laboratory, and business colleagues to build a data-driven culture across the company.  Requirements  A strong desire to work at the intersection of genomics, healthcare, and technology.  MS or PhD in a quantitative or computational field.  Industry experience using data science to drive business growth and operational efficiency.  Experience mentoring peers and prioritizing workflows from across the company.  A knack for converting data-driven insights into actionable next steps.  Strong communication and presentation skills.  Domain experience in genetics/NGS or healthcare analytics is a plus.  Significant experience working with large data sets in Python or R and familiarity with core statistical concepts.  Solid programming skills, good familiarity with Python and Git."}