{"jobID": "2693291465", "jobLocation": "Sunnyvale_CA", "jobTitle": "Data Analyst Intern", "companyRating": "3.8", "companyInfo": {"Website": "www.agilone.com", "Headquarters": "Sunnyvale, CA", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Adobe, IBM"}, "estimatedSalary": "79000", "jobDescription": "AgilOne is looking for a Data Analyst Intern to join our team. One will be responsible for designing, building and deploying complex technical custom projects. In order to succeed in this position, you should be autonomous, analytical, a self-starter and organized. You are adaptable and thrive on working with minimal structure and guidance. You are flexible and ready to work with AgilOne teams based in California.We work hard to maintain our fast-paced, friendly culture and help us maintain our leadership position in the retail industry and beyond.Internship Description:This is an opportunity for(a) a gap year internship of one year (no 6 months internships)OR(b) an end-of-studies internship of one year followed by a potential job offer based on performanceYou would be joining AgilOne in our Engineering department starting summer 2018 in one of our offices in California (Sunnyvale/San Francisco).As a Data Analyst Intern, you will:  Develop a deep expertise of AgilOnes platform architecture, data layers and capabilitiesDesign, build, and deploy elegant custom solutions and extensions to the platform in particular around data structures, data integrations, data analytics and data modelsWrite production-quality code and technical documentationTroubleshoot product and data anomalies and ensure absolute integrity of deliverablesUse project, delivery and reporting tools including Salesforce and MavenlinkQualifications:Bachelor's Degree in Engineering, Information Technology, Computer Science, Mathematics or similar technical/analytical degreeExperience in a data analytics positionSolid programming skills in SQL, TSql, PL/SQL or similar database programming languageIntellectual curiosity, along with excellent problem-solving and quantitative skills, including the ability to disaggregate issues, identify root causes and recommend solutionsSelf-motivated and good sense of ownership - comfortable working with limited directionNice to have:Experience with ETL tools (e.g SQL Server Integration Services)Understanding and experience of integrating with APIs. Knowledge of standards such as REST, JSON, XML, SOAP and OAuthThis position does not fit your skillset or your career plans?! Please check all our internship offers :Data Scientist InternSolutions Consultant InternJava Engineer InternThe AgilOne Story:AgilOne, the Customer Data and Engagement Hub, provides enterprise consumer marketers the power to integrate customer data across digital, physical, and mobile channels, deliver customer analytics with predictive insights and 360-degree profiles, and engage customers at every touch point in order to maximize lifetime value. Currently, the AgilOne solution supports more than 150 brands worldwide.We leverage the latest technologies in big data, machine learning and data quality management to deliver an enterprise-grade, scalable and high performance tool for customers such as Tumi, Lululemon, Lilly Pulitzer and Davids Tea.AgilOne is funded by the best in the Valley - Sequoia Capital, Tenaya, and Mayfield."}