{"jobID": "2830856215", "jobLocation": "Austin_TX", "jobTitle": "Intern- Member of Technical Staff- Cloud Services", "companyRating": "4.2", "companyInfo": {"Website": "www.vmware.com", "Headquarters": "Palo Alto, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (VMW) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "136000", "jobDescription": " VMware is a global leader in cloud infrastructure and business mobility. VMware accelerates customers digital transformation journey by enabling enterprises to master a software-defined approach to business and IT. With VMware solutions, organizations are creating exceptional experiences by mobilizing everything, responding faster to opportunities with modern data and apps hosted across hybrid clouds, and safeguarding customer trust with a defense-in-depth approach to cybersecurity.  At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Do you dare to do the stuff youve always dreamed about? Dare to explore at http://careers.vmware.com.  VMwares Cloud Services R&D; team is responsible for building innovative infrastructure services in the cloud. As an intern on this team, you will:  • Deliver enterprise-class services in the form of a SaaS offering on top of VMware core virtualization products such as ESX and vCenter. And also will be instrumental in delivering VMware Cloud on AWS.  • Participate through all phases of the service development lifecycle, based on an agile scrum development methodology.  • Participate in the SaaS operations based on a devops model.  Desired Skills: Distributed systems, Scalable Web systems design experience or projectsPrior internships in developing Cloud Services or APIsStrong background in distributed systems, cloud services, protocols or Web Services & API developmentStrong CS Fundamentals, Data Structures, Algorithms and Coding skills in Java/C/C++Pursuing Bachelors, Masters Degree in Computer Science or equivalent"}