{"jobID": "2830535693", "jobLocation": "Seattle_WA", "jobTitle": "Research Intern - Machine Learning", "companyRating": "3.1", "companyInfo": {"Website": "www.parametricportfolio.com", "Headquarters": "Seattle, WA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "65000", "jobDescription": " At Parametric, we offer competitive salaries, generous benefits and opportunities for growth and development. We invite you to explore our available job opportunities listed below and look forward to having you become a part of our continued success!  General Description  A Research Intern is responsible for providing analysis and quantitative modeling to support Parametric’s investment products and new product development.  Primary Responsibilities Support research team in creating Machine Learning models to use in portfolio management process.Work with the research and portfolio management teams to test and improve the ML models.Research and explore opportunities to use ML algorithms in Parametric’s investment process. Job Requirements Current Master’s or PhD studentStrong knowledge of Data Science, Machine Learning, portfolio theory, investments, and financeExperience with quantitative modeling, equity portfolio management, and portfolio construction preferredProficiency in Excel, Python or R, and/or statistical tools that allow for quantitative modeling and analysisThe ability to work on a team and to work autonomously on projectsThe ability to work with large data sets Parametric is an equal opportunity employer and is committed to providing a work environment that is free of discrimination and harassment. It does not discriminate against applicants or employees with respect to any terms or conditions of employment on account of race, color, religion, creed, national origin, ancestry, sex, sexual orientation, age, pregnancy, parenthood, physical or mental disability (actual or perceived), medical condition including genetic characteristics, marital status, citizenship status, military service, gender, gender identity, registered domestic partner status, domestic violence victim status, status with regard to public assistance, or any other characteristic protected by applicable federal, state or local laws. Parametric also prohibits discrimination based on the perception that a person has any of those characteristics or is associated with a person who has or is perceived as having any of those characteristics. This commitment applies to all persons involved in the operations of Parametric, and prohibits unlawful discrimination by any employee of Parametric, including supervisors and co-workers. All employment decisions shall be consistent with the principles of equal employment opportunity.  The information on this website is for U.S. residents only and does not constitute an offer to sell, or a solicitation of an offer to purchase, securities in any jurisdiction to any person to whom it is not lawful to make such an offer. Investing entails risks and there can be no assurance that Parametric (and its affiliates) will achieve profits or avoid incurring losses. All investments are subject to potential loss of principal. Parametric does not provide tax or legal advice. Prospective investors should consult with a tax or legal advisor before making any investment decision. Please refer to the disclosure page for important information about investments and risks."}