{"jobID": "2779111644", "jobLocation": "Cupertino_CA", "jobTitle": "Operations Data Analyst", "companyRating": "2.9", "companyInfo": {"Website": "www.seagate.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1979", "Type": " Company - Public (STX) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Western Digital, Fujitsu, HGST"}, "estimatedSalary": "108000", "jobDescription": " 181267 Operations Data Analyst (Open)The Seagate Cloud Systems Operations Team is seeking a highly motivated, resourceful and data-driven Operations Data Analyst in Longmont, CO. This role will play a key role in Business Operations Analytics activities. We are looking for an organized and detail-oriented person with a passion for analytics.  This position will provide a highly motivated, engaged professional the opportunity to gain experience in developing analytical tools. The ideal candidate is someone who is a fast learner, innovative, wants a challenge, and is eager to make an impact. Excellent analytical skills, teamwork, and determination are the foundations of this role. A day in the life:Performing data validation to ensure integrity, accuracy and consistency, identifying the root cause of data inconsistencies and process defects, troubleshooting potential issues with new and existing data sources, implementing timely corrective actions, and driving closure with subject matter experts.Designing, developing, and documenting inventory reports and analysis to support S&OP; processes. Multiple and often complex data sources will require a high degree of skill to recognize and understand relationships, organize data and deliver insightful analysis.Regular communication with global team members to understand requirements, recommend and make improvements, informal cross-functional leadership.About you:Bachelor’s degree with 8 plus years of experience or Master’s degree with 5 plus years of experience in an Information Science, Analytics, Information Systems or related fieldProven proficiency with Alteryx DesignerProven proficiency with Tableau DeveloperExperience gathering data from large scale data warehouses/data marts, understanding of relational database structure and conceptsProject management experiencePossess the ability to handle multiple projects in parallel and deliver them on timeStrong organizational and time management skills, and attention to detailProven expertise with MS Office Excel including pivot tables and macrosPossess excellent written and verbal communication skillsPreferred Skills:Proven proficiency with Business ObjectsExperience with Oracle applications is a plusKnowledge of supply chain processes in a manufacturing environment is a plusOur culture is focused on our Corporate Values --People, Customer Success, Excellence, Innovation, Teamwork, Openness, Social Responsibility and Sustained Profitability. Join a worldwide team of talented, collaborative, innovative people who thrive in a work environment where people can share knowledge and learn from one another. You won’t find a more exciting place to build your career and challenge yourself. Accept the challenge and Go where innovation leads…Join Seagate. Apply now! Seagate Technology is committed to equal opportunity in employment and welcomes applications from all sections of the community, irrespective of sex, marital status, religious affiliation, age, disability, veteran status, or ethnic origin.Job Family: Professional"}