{"jobID": "2540873660", "jobLocation": "Boston_MA", "jobTitle": "Customer Data Scientist / Solution Architect", "companyRating": null, "companyInfo": {"Website": "www.h2o.ai", "Headquarters": "Mountain View, CA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About H2O.ai At H2O.ai we see a world where all software will incorporate AI, and were focused on bringing AI to business through software. H2O.ai is the maker behind H2O, the leading open source deep learning platform for smarter applications and data products. H2O operationalizes data science by developing and deploying algorithms and models for R, Python and the Sparkling Water API for Spark. Some of H2Os mission critical applications include predictive maintenance, operational intelligence, security, fraud, auditing, churn, credit scoring, user based insurance, predicting sepsis, ICU monitoring and more in over 10,000 organizations. H2O is brewing a grassroots culture of data transformation in its customer communities. Customers include Capital One, Progressive Insurance, Zurich North America, Transamerica, Comcast, Nielsen Catalina Solutions, Macys, Kaiser Permanente and many more Job DescriptionCan you learn demonstrations (demos) built with R and/or Python? If you think of a cool demo and it doesn't exist, will you raise your hand to get it built?Can you sling code proficiently in at least one language used by data scientists and/or data engineers, and does it excite you to learn more?Are you a strong learner capable of coming up to speed quickly with new technologies?Do you view communication skills just as important as technical ones? Can you listen to the needs of your peers and customers? Can you write a technical proposal?Have a competitive drive to be the best you can be?Can you finish what you start? Can you own assignments given to you? If the answer is \"yes\" to these questions, you potentially could be an excellent fit to join the team of customer engineering makers at H2O.ai. We deliver world-class solution experiences for our customers and drive revenue for our organization. Some of the technical projects you will work on include: training advanced machine learning models at scale in distributed environments, influencing next generation data science tools and data products, and pioneering ideas and products in new areas, such as GPU machine learning, machine learning interpretability, automatic machine learning, model management, & deployment pipelines. Responsibilities As a solutions architect / customer data scientist, you will work closely with sales directors to: Be the technical expert and data scientist leader for sales cyclesOwn account-related technical itemsTranslate business use cases and requirement into technical onesProblem solve and assess technical problems, determine solutions, and work with internal and customer teams to resolve themArchitect machine learning workflows and systemsCreate, design, and deliver compelling presentations on complex & technical conceptsCraft statement of work, responses for proposals/information, and all written communication required to engage customers.Demonstrate product solutions with engaging storytelling and technical accuracyCommunicate effectively with internal and externally to a diverse audience, including: engineers, business people, and executives. Audiences will be large and small, and interactions will be in-person and online.Drive field feedback back into product developmentBe hands-on for all technical activities throughout the sales cycleFocused on customer experience and sales objectivesTravel up to 50% (primarily domestic, occasionally international)QualificationsEducation and ExperienceBachelor's degree in engineering, computer science, mathematics or related field. Graduate degree is a plus.2+ years experience with performing customer facing activities as part of a pre-sales team or professional services team2+ years experience with machine learning and data mining2+ years using R or Python for data analytics2+ year working with data in Hadoop and /or Spark ecosystemDesirable: Maker mindset, strong learner and coachableDesirable: Fearless problem solver, strong technical abilities, accountable team playerWork location: Multiple locations across the United States  H2O.ai is an equal opportunity employer. We welcome and encourage diversity in the workplace regardless of race, gender, sexual orientation, gender identity, disability or veteran status."}