{"jobID": "2770774494", "jobLocation": "San_Jose_CA", "jobTitle": "Case Manager - RN", "companyRating": "2.6", "companyInfo": {"Website": "www.regionalmedicalsanjose.com", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 1965", "Type": " Hospital", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "144000", "jobDescription": "Regional Medical Center of San Jose is an acute care  hospital with a Level II Trauma Center. The hospital provides a host of  technologically-advanced services including Cardiovascular,  Neuro, Orthopedic,  Bariatric and General Surgery, Interventional Pulmonology  and services for Women. Regional holds Joint Commission  advanced certification as a Comprehensive Stroke Center and  a Get with the Guidelines- Stroke Gold Plus Performance  Achievement Award from the American Heart Association/American Stroke  Association. It is a certified Chest Pain Center,  county-designated STEMI (heart attack) Receiving Center, designated Lung Cancer  Screening Center, a member of Extracorporeal Life Support  Organization (ECMO) and is certified by The Joint Commission in  Sepsis care.The Case Management teams are  dedicated, healthcare providers with excellent services for patients at  Regional Medical Center of San Jose. Interested in joining this team?  Apply online now.Schedule: 0.4 (16 hours a week) Shift: 8 hr days, weekends onlyPOSITION SUMMARY: The Case Manager will be responsible for the utilization  management and coordination of discharge planning for patients as  assigned. They will be responsible for  the coordination of the activities and resources necessary and appropriate for  the achievement of maximal clinical and financial patient outcomes. KNOWLEDGE/SKILLS:Minimum: Working  understanding of acute level of care vs., lower levels of care (subacute,  skilled nursing, home with assistance); ability to work independently and  exercise good judgment; ability to provide leadership in a professional manner;  ability to develop positive professional relationships; ability to multi-task Preferred:  Knowledge of Utilization Management standards of practices, of available  community resources, of discharge planning requirements per hospital policy and  regulatory agencies LICENSE/CERTIFICATION REQUIREMENTS:Minimum: California RN license, BCLS EXPERIENCE  REQUIREMENTS: Minimum: Two years acute hospital experience or equivalent Preferred: Acute  hospital case management experience or equivalent (discharge planning,  utilization management EDUCATION  REQUIREMENTS:Minimum: AA or  Nursing School Diploma Preferred: BSN"}