{"jobID": "2621989284", "jobLocation": "Cambridge_MA", "jobTitle": "SQL Programmer / Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.roisolutions.com", "Headquarters": "Cambridge, MA", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " SQL Programmer / Data Analyst  About the Position:ROI is looking for programmers with an ability to manage highly specialized work efficiently, confidently and competently at a somewhat faster-than-average pace. This position is based in our Cambridge, MA office.  Specifically, we’re looking for a motivated SQL programmer with experience in the Nonprofit industry to perform data extracts, uploads and special programming for clients. As a member of our team of Client Service professionals, you’ll be proactive and communicate regularly with peers regarding client technical requests and requirements. If you take pride in meeting deadlines while maintaining a high standard of accuracy, this may be a great fit for you. Nonprofit database experience is required.  ROI provides a stable and secure work environment with the ability to plan for, focus on, and complete projects with outstanding direction, training and support. Specific Tasks:Use Oracle SQL to program custom scripts to extract and deliver client data.Provide quality control to peer programmers.Program custom SQL scripts to evaluate, manipulate and encode client data.Upload and transform client data from flat files into Client Data Schema.Proactively communicate with client team on any issues related to client programming requests.Skills and Experience Preferred:Strong familiarity with Oracle RDMS.Experience working with nonprofit databases.Strong written and verbal communication skills.How to apply: If you’re looking to take responsibility, make a difference, stretch your skills and learn new things, please send a letter of interest and resume to: roi.hr.2018@roisolutions.com"}