{"jobID": "2552680377", "jobLocation": "Los_Angeles_CA", "jobTitle": "Analyst Intern", "companyRating": "4.0", "companyInfo": {"Website": "www.spencerstuart.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1956", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "45000", "jobDescription": "ANALYST INTERN- WEST COAST OFFICES Duration: January through June 2018  Location: Los Angeles  Start Date: Flexible  Hours: Part-time up to 29 hours per week  Application Deadline: 10/13/2017 Organization Profile Spencer Stuart is the leading privately held, global executive search consultancy. We are the advisor of choice among top companies seeking guidance and counsel on senior leadership needs, including executive recruiting, succession planning, organizational design and corporate governance. Our clients range across industries, from the world's largest companies to medium-sized businesses, not-for-profits and entrepreneurial start-ups. We operate out of 56 offices in 30 countries. Last year alone, Spencer Stuart conducted over 4,000 assignments around the world placing top corporate executives and board members of leading Fortune 500 companies. The Spencer Stuart Internship Spencer Stuart offers analyst interns a fast-paced, intellectually engaging, entrepreneurial environment working with a diverse group of energetic professionals who are former business leaders and management consultants. Interns have a unique opportunity to gain broad exposure to a variety of industries and functions and to learn about the careers of leading executives around the world. Interns also participate in trainings designed to broaden their skill set and familiarity with executive search. Position Description The LA intern will work on strategic projects with the Medical Technology Consultants and Associates in Southern California. Responsibilities include:  Coordinating and completing business analysis on multi-faceted business development projects; Bringing creative solutions to search assignments and new business issues. Providing research and analysis support to management and participating in special projects. Analyst interns will work simultaneously on a variety of projects that vary greatly in size and complexity. Some projects target a narrowly defined business problem, while other projects address much larger strategic needs which may result in the creation of a presentation, report, or intellectual capital piece (i.e. article). Interns will be asked to present an overview of their work to their office at the conclusion of their internship. Qualification ProfileJuniors or Seniors only. A solid academic record is required (all majors welcome); 3.5 GPA is strongly encouraged. Broad extracurricular involvement and leadership experience. Strong analytical, communication and writing skills. Proficiency with MS Office applications such as Excel, PowerPoint, and Word is required. Previous experience in a research capacity (either through coursework or previous internships) is a plus. Spencer Stuart is an equal opportunity and affirmative action employer F/M/Disability/Vet/Sexual Orientation/Gender Identity"}