{"jobID": "2829032606", "jobLocation": "Los_Angeles_CA", "jobTitle": "Research Intern -- DiDi Labs (Los Angeles)", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Research Intern -- DiDi Labs (Los Angeles) Our team in Los Angeles is currently focused on Natural Language Processing. We are excited about the future of communication, transportation, and artificial intelligence. Smart cars should speak and understand human language, and people should be able to order services and solve their problems by speaking. Furthermore, people who speak different languages should be able to communicate with one another.  Research Interns make key contributions to our overall mission by helping to pioneer new research directions. Interns work with Dr. Kevin Knight and other PhD scientists at DiDi Labs on novel, challenging problems. Previous interns working with Dr. Knight have published articles in the field's top venues.  Sample publications include: \"Recurrent Neural Networks as Weighted Language Recognizers\" (Y. Chen, S. Gilroy, A. Maletti, J. May, and K. Knight), Proceedings of NAACL 2018. (Outstanding Paper Award).\"Multi-Source Neural Translation\" (B. Zoph and K. Knight), Proceedings of NAACL 2016.\"Cipher Type Detection\" (Malte Nuhn and Kevin Knight), Proceedings of EMNLP 2014.\"Parsing Graphs with Hyperedge Replacement Grammars\" (D. Chiang, J. Andreas, D. Bauer, K.-M. Hermann, B. Jones and K. Knight), Proceedings of ACL 2013.\"Semantics-Based Machine Translation with Hyperedge Replacement Grammars\" (B. Jones, J. Andreas, D. Bauer, K.-M. Hermann, K. Knight), Proceedings of COLING 2012.\"Automatic Analysis of Rhythmic Poetry with Applications to Generation and Translation\" (E. Greene, T. Bodrumlu, K. Knight), Proceedings of EMNLP 2010.\"Unsupervised Syntactic Alignment with Inversion Transduction Grammars\" (A. Pauls, D. Klein, D. Chiang, K. Knight), Proceedings of NAACL 2010.\"Bayesian Inference for Finite-State Transducers\" (D. Chiang, J. Graehl, K. Knight, A. Pauls, S. Ravi), Proceedings of NAACL 2010.\"Fast Consensus Decoding over Translation Forests\" (J. DeNero, D. Chiang, and K. Knight). Proceedings of ACL 2009.Responsibilities:Build AI-based prototypes to solve novel, challenging problems.Understand the state-of-the-art in Natural Language Processing, and how to evaluate success.Work with scientists in DiDi's Los Angeles office to further the scientific frontier.Qualifications:Currently enrolled in an undergraduate or graduate program in Computer Science.Proficiency in large-scale programming in C++, python, or related systems.Good communication skills.Preferred Qualifications:Experience with artificial intelligence and machine learning algorithms.Facility with neural network programming tools."}