{"jobID": "2670354934", "jobLocation": "Northridge_CA", "jobTitle": "Data Analyst Neuroscience", "companyRating": "3.7", "companyInfo": {"Website": "www.dignityhealth.org", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Sutter Health, Kaiser Permanente, Tenet Healthcare"}, "estimatedSalary": "73000", "jobDescription": " OverviewFounded in 1955, Dignity Health – Northridge Hospital Medical Center is a 394-bed, acute care, nonprofit community hospital located in Northridge, California. The hospital offers a full complement of award winning services, including the Leavey Cancer Center, a cardiovascular center, stroke center, the Center for Assault Treatment Services, a pediatric medical center, and the only pediatric trauma center in the San Fernando Valley. As a leading provider of compassionate, high-quality and affordable patient-centered care, we share a rich legacy with Dignity Health, one of the nation’s five largest health care systems. We are part of a 21-state network of nearly 9,000 physicians, 62,000 employees and more than 400 care centers. Visit dignityhealth.org/northridgehospital for more information.ResponsibilitiesThe Neuroscience Data Analyst is responsible for providing support to the Neuroscience program leadership.  This position is responsible for data management for the stroke program.  He/she assists with a wide variety of tasks for the program including, but not limited to data gathering and input, assistance with staff and patient education, community education, and marketing.QualificationsEducation: Bachelor’s degree in health science, business, informatics or any other related field. Extensive experience in data analysis will be considered if candidate is not Baccalaureate prepared. Graduate of an accredited RN School of nursing preferred. Experience: Minimum three years clinical experience, with prior experience in data analyses of stroke patients preferred. Work experience in data collection, medical records, quality management or related field preferred  Must have excellent communication, interpersonal, organization, and prioritization skills. Ability to work effectively with all levels of staff and management. Ability to work with detailed information and minimal direction and supervision.  Bilingual in Spanish preferred"}