{"jobID": "2695550038", "jobLocation": "New_York_NY", "jobTitle": "Clinical Account Specialist, Key Accounts", "companyRating": "4.0", "companyInfo": {"Website": "www.jnj.com", "Headquarters": "New Brunswick, NJ", "Size": "10000+ employees", "Founded": " 1887", "Type": " Company - Public (JNJ) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Abbott Labs, Novartis, Covidien"}, "estimatedSalary": "71000", "jobDescription": "Johnson & Johnsons Cardiovascular & Specialty Solutions (CSS) Group within Medical Devices is recruiting for a Clinical Account Specialist Key Accounts, for Biosense Webster, Inc. for New York City. The CSS Group consists of six diverse businesses including Acclarent, Advanced Sterilization Products (ASP), Biosense Webster (BWI), Codman Neuro, Mentor, and Sterilmed. The CSS Group serves a diverse base of customers in Ear, Nose and Throat (ENT), Infection Prevention, Cardiovascular and Electrophysiology (EP), Neurovascular and Neurosurgery, Surgical and Non-Surgical Aesthetics, and Reprocessing. Biosense Webster is the global leader in the science of diagnosing and treating heart rhythm disorders and one of the fastest-growing businesses within Johnson & Johnson. Learn more at Biosense Webster at www.biosensewebster.com.  The Clinical Account Specialist, Key Accounts (KA CAS) will:Provide expert clinical product and technical assistance and training to physicians and EP Lab Staff on the effective use of BWIs systems and catheter equipment (e.g., The CARTO® System and associated software modules and RF generator) during case procedures within an assigned geography, and in a manner that leads to meeting and exceeding business goalsEducate customers on all BWI products to optimize effective usage by providing technical and clinical information and in-service trainingsCollaborate with peers to share best practices to increase value for customersUse consultative selling techniques to identify potential sales opportunities within the accountCreate awareness of BWI solutions and facilitate Territory Sales Manager (TM) contact with the key decision makers to drive incremental businessMaximize customer case support capability through proper planning and scheduling techniquesDrive collaboration and maintain consistent, open lines of communication across the assigned responsibilities with the local team/Pod (i.e. TM and other CAS), as well as the support team (i.e. Ultrasound CAS, FSE, RBD) and other internal and external partnersDevelop and share best practices with US Field Sales and Service colleagues and internal partnersDevelop and grow mutually beneficial customer relationships within and beyond the EP lab, including, but not limited to physicians, nurses and technicians, clinical and hospital administrators and staffStay current on company products instructions for use (IFU), best practices and technical troubleshooting, as well as relevant scientific clinical literature and new product informationPrioritize and appropriately respond to requests in a high-stress environmentMaintain composure and problem solving focus during stressful interactionsEngage in diagnostic dialogue with multiple internal and external business partners and stakeholders, and formulate solutions based on dialogue and input gained during sessionProvide mentoring for new BWI commercial team members as requestedRespond daily to requests by email and voicemail from customers, practitioners and partnersAdditional duties include performing administrative work, including managing account documentation, compliance training requirements, expense reporting, and Company system inputMaintaining Safe Fleet standards according to Company guidelinesResponsible for communicating business related issues or opportunities to next management levelResponsible for ensuring subordinates follow all Company guidelines related to Health, Safety and Environmental practices and that all resources needed to do so are available and in good conditionResponsible for ensuring personal and Company compliance with all Federal, State, local and Company regulations, policies, and proceduresPerforms other duties assigned as neededQualificationsRequired:A minimum of a Bachelors degree, or 4 years of relevant professional work/military experienceA minimum of 2 years of clinical or technical work experience in a patient care or hospital environment, or completion of the Companys ACAS programA valid Drivers LicenseMaintain advanced clinical knowledge of cardiac ablation and cardio imaging, technical knowledge of EP technology, advancements, and the business landscapeMaintain clinical knowledge of healthcare industry, disease states, and therapeutic and institutional trendsThe ability to travel related to this role is required. Must be willing and able to travel up to 40% overnight locally, regionally, and nationally, sometimes on short noticeSitting for extended periods of time, working in a hospital laboratory setting, attending live patient cases, and wearing protective gear (i.e. lead aprons), and willing to work variable hours to meet patient needsMay be required to lift up to 60 lbsStrongly Preferred:Electrophysiology/Cath Lab or EP/Cardiovascular Device Industry experienceMaintaining at least one of the following industry certifications CEPS (IBHRE), RCES/RCISExperience working with highly complex technical systems and/or working in a critical patient care settingEffective and timely communicator with co-workers and all levels of patient care teamSelf-starter who performs well with autonomy and can be flexible in a dynamic work environmentProblem solver who can think critically in high pressure environmentsReceptive to constructive feedback and collaborates and works well in team environmentAble to take large amounts of data and translate information into actionable insightsHunger for learning and building new skills Johnson & Johnson Companies are equal opportunity employers.Primary Location United States-New York-New York Organization Biosense Webster Inc. (6010) Job Function Selling MD&D; Requisition ID6211180315"}