{"jobID": "2591868612", "jobLocation": "New_York_NY", "jobTitle": "Producer-PBC", "companyRating": "3.4", "companyInfo": {"Website": "www.hubinternational.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": " We are currently seeking a highly motivated individual to be part of a team managing all aspects of our clients insurance programs.  Duties include:  Contacts decision making individuals of prospective personal insurance clients or prospective clients directly to secure their interest in our services. Reviews our services with prospect to anticipate present and future needs. Develops and/or coordinates the actual presentation to the prospect, acting in a prudent business manner to ensure maximum efficiency and profitability of the account. Provides for the smooth transition of new business to support staff to maintain appropriate level of service. Remain actively involved with clients to: (a) develop additional business, (b) assist with renewals when necessary, and (c) act as troubleshooter to maintain accounts. Location: United States, New York, New York Required Education: High school or equivalent Required Experience: 5-7 years Required Travel: Up to 50% Date published: 20-Nov-2017 Department: Sales Ref#: 103827_20170902  HUB International Limited is an equal opportunity and affirmative action employer that does not discriminate on the basis of race/ethnicity, national origin, religion, age, color, sex, sexual orientation, gender identity, disability or veteran's status, or any other characteristic protected by local, state or federal laws, rules or regulations. The EEO is the Law poster and its supplement is available here at http://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm .  We endeavor to make this website accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact the US Recruiting Team toll-free at (844) 300-9193 or USRecruiting@hubinternational.com . This contact information is for accommodation requests only; do not use this contact information to inquire about the status of applications."}