{"jobID": "2741643899", "jobLocation": "San_Jose_CA", "jobTitle": "Account Manager", "companyRating": null, "companyInfo": {"Website": "www.loringward.com", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 1990", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Buckingham Strategic Wealth, Symmetry Partners, Dimensional Fund Advisors"}, "estimatedSalary": null, "jobDescription": "Job Purpose Loring Ward is a financial services company dedicated to helping independent financial advisors run better practices. The Advisor Services group works to enhance the experience of financial advisors by providing clients with error-free operations and superior customer service.  The Account Manager is the primary Service contact for assigned advisors, ensuring that superior service is delivered through dedication and a commitment to excellence. The candidate is responsible for understanding the nuances of the advisor and tailoring the servicing accordingly. The candidate works on a team to manage the servicing of all Loring Ward advisors. Duties may fluctuate with market volatility, seasonal volumes, and team coverage, so flexibility, the ability to work under pressure and within tight deadlines will be critical. Strong communication, attention to detail, and successful problem solving is essential to be successful in this role. Duties and ResponsibilitiesDeliver exceptional service to financial advisors as it relates to Operations and ServiceDevelop a thorough understanding of Operations processes and the Loring Ward offeringResearch and resolve complex escalated issuesWork collaboratively with Operations, Advisor Relations, and the Portfolio Strategy Teams to provide top-notch service Act as the primary liaison and facilitate all Operations and Service requests Proactive, high level of follow up with advisorsEducate advisors on Loring Ward, custodian, and industry best practicesAdvocate the advisor’s needs with internal departments and our custodian partnersTrain new advisors on effectively working with Loring WardProvide superior, friendly and knowledgeable service by telephone and e-mail with financial advisorsManage heavy inbound phone contact Effectively prioritize work to meet deadlines and service level agreementsOther duties will be assigned as neededQualificationsExperienceMust have at least 2-3 years of financial services experience, including telephone customer service experience.Series 7 and 63 or 66 required. Series 24 a plus.Experience working with RIAs and Independent Financial Advisors a plus.Education/TrainingCollege degree required. Five years’ experience in financial services may be used in lieu of a college degree.Experience and familiarity with Pershing, Charles Schwab Institutional, Fidelity Institutional, or TD Ameritrade Institutional a plus.Knowledge, Skills, and AbilitiesDesire to take ownership and provide the best service in the industryEnergetic self-starter with an extremely positive, can-do attitudeMust work well in a fast-paced team environment, supporting others and filling in as necessaryExperience with effective problem solvingIs accountable and takes responsibility for the workExcellent verbal and written communication skillsStrong organization and time management skills with exceptional attention to detailPro-active with ability to think ahead and act independentlyMust be able to effectively prioritize multiple tasksIs good at building and maintaining relationshipsAble to follow direction and work with minimal supervisionComfortable with web-based applicationsWorking ConditionsThere is occasional weekend and late night work required, specifically around high volume times such as the end of a quarter and tax season. This is a fast-paced environment requiring quick thinking and a constant desire to do our very best for the financial advisor.  "}