{"jobID": "2767239615", "jobLocation": "Boston_MA", "jobTitle": "Intern, Data Center & Cloud Services", "companyRating": "3.6", "companyInfo": {"Website": "www.bostonproperties.com", "Headquarters": "Boston, MA", "Size": "501 to 1000 employees", "Founded": " 1970", "Type": " Company - Public (BXP) ", "Industry": " Real Estate", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "42000", "jobDescription": " Job DescriptionIntern - Data Center & Cloud ServicesPrimary Purpose of Position: Perform support and project responsibilities in support of data center and cloud services at Boston Properties. The position will partner with System Engineers to support, maintain and implement technologies including VMWare, Microsoft cloud services (Office 365/Azure), Cisco UCS servers, Dell EMC (SAN/NAS/Avamar) and Windows Active Directory. Essential Functions: Systems Engineering/Administration Support Assist in health checks and audits of operating systems, hardware and software applications.Perform administration in support of Microsoft Office 365/Azure/Active Directory.Implement and/or configure hardware and software including project tasks related to updates and upgrades.Respond to requests for assistance; document and escalate all issues and requests as appropriate.Create and maintain documentation.Non-Essential Functions:Special projects as assigned.Requirements and Qualifications:Currently performing course work in Computer Sciences or a related field.Possess a service orientation and attitude in working with others.Be detail-oriented and methodical in solving problems and managing multiple projects.Possess an aptitude toward learning technical concepts. Be results-oriented and a quick learner in supporting new products and technologies.Capable of sharing ideas and providing insightful observations with engineers and management.Ability to conceptualize how each system impacts performance, scalability, security and recovery.Physical Requirements:Involves work of a technical nature usually performed sitting such as operation of a computer.Involves work of a technical nature usually performed standing such as racking a server/switch or running Ethernet cable.Involves movement between departments to facilitate work.Involves lifting to installing and relocate computers and monitors. Must be able to lift 30Ibs."}