{"jobID": "2830929339", "jobLocation": "San_Francisco_CA", "jobTitle": "Export Director", "companyRating": null, "companyInfo": {"Website": "www.forcebrands.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About The Position The role of Export Director is a critical role for the growth of Anchor Brewing Company. We continue to bring our locally brewed beer to the global community. There is considerable potential to grow our current market share worldwide with both new and existing customer accounts. This growth will come both from geographical expansion and from developing our sales networks in existing markets.  The Export Director will be responsible for maximizing our sales revenue through a network of international sales agents, as well as, developing direct customer accounts with existing and new customers. The position will involve a high degree of international travel. The role is suited to a confident, and organized, sales professional, who has worked in a similar role for a beverage / brewing company. The territories within Europe are the primary focus- with priorities in the United Kingdom, Sweden, France and Spain; and then followed by territories in Latin American and Asia. Management of key chain accounts to include: Tesco, Carrefour, Marks & Spencer, Asda, Sainsbury's, Albert Heijn, and Mitchells and Butlers. Duties:Identify new business opportunities by tapping potential customers from different countries.Plan, design, develop and implement different sales activities by researching the customer's needs and requirements.Ensure that existing clients are retained and maintained while developing the new customers.Verify and confirm that sales and marketing activities are carried out within the agreed budgets, volume, sales, and within the given time scales.Maintain efforts and initiative to develop constructive and effective solutions to any issues that slow down or hamper the export procedures and activities.Continually review distributor's performance and monitor their work, so that relevant information can be provided to management.Manage a regular schedule of Skype calls with non-European importers to keep focus on annual business plan, benchmark progress, and identify hurdles.Routinely travel to and meet with accounts with the goal of increasing development and growth.Be able toCarry out market research, conduct surveys and study the competitors in order to develop marketing and sales strategies.Be able to liaise with supply chain to improve efficiencies and find outside the box solutions.Maintain presence at trade shows and exhibitions.Qualifications:A bachelor's degree in Business and/or Marketing or an equivalent combination of education and experience.5 years of marketing and or sales experience,3 + years' experience operating in an export marketing, sales or business development role in international markets.Be able to export San Francisco ethos and Anchor Brewing legacy and authenticity.Exceptional organization and attention to detail. Loves customer service and supporting key stakeholders.High tolerance for multi-tasking, flexible and thrives in a dynamic, fast-paced executional environment.Broad time commitment including some nights. Travel up to 60-75% of the time and may be on short notice.We will consider candidates who reside in California, New York or the United Kingdom.Preferred Skills:Growth mindset; excellent interpersonal communication skills.Embrace technology and find uses to improve operations.Proficient in Excel, Outlook, PowerPoint and Word.Second relevant language skills would be highly advantageous, especially Spanish, French or German.ABOUT ANCHOR BREWING COMPANY: Located in San Francisco, California, Anchor Brewing Company (ABC) was established in 1896. Anchor produces a wide variety of beer types that are sold within the United States as well as internationally. We are proud to do so in a traditional way that emphasizes the quality of our products and reflects the passion of our historical creators. www.anchorbrewing.com "}