{"jobID": "2787900086", "jobLocation": "San_Francisco_CA", "jobTitle": "Research Data Analyst III", "companyRating": "3.9", "companyInfo": {"Website": "www.ucsf.edu", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1864", "Type": " College / University", "Industry": " Unknown", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "89000", "jobDescription": " Research Data Analyst III  22-May-2018 Job Code and Payroll Title 6257 Research Data Analyst III Job SummaryJOB OVERVIEW The Research Data Analyst will be responsible for managing and analyzing data from clinical and translational studies for the research group within the UCSF Nephrology Division, focusing on clinical studies in transplant, cohort establishment, and data gathering. The goal of our research is to understand risk factors for kidney disease progression, improve the living donor evaluation process, and understand barriers to access to kidney transplantation, and improve outcomes in end-stage renal disease.  Job responsibilities will include managing, extracting and cleaning datasets; designing, conducting, and interpreting advanced statistical analysis; preparation of summary reports, charts, tables, and figures; and contributions to publications and presentations of this data. In addition, the job will include independent performance of complicated statistical analysis, including mixed modeling, linear regression, latent class analysis, ROC analysis, model calibration, unbiased hierarchical clustering in addition to more common statistics such as Fisher’s exact test, Students T test, long rang analysis and Kaplan Meier plots. The applicant will present the data to the Principal Investigator (PI) and make additional analyses or adjustments after review of the results. The Research Data Analyst will be expected to have significant experience to generate tabulated tables summarizing the results so that they are suitable for publication, and to be able to extract cohorts of interest, determine appropriate inclusion and exclusion criteria, deal with missing data using techniques such as multiple imputation, identify outliers in the data, and select the appropriate statistical technique for the completion of the project. NEPHROLOGY DIVISION The UCSF Nephrology Division performs cutting edge research illuminating chronic kidney disease and end-stage renal disease biology and pathophysiology, trains clinicians and scientists to become future leaders of these fields. ABOUT UCSF The University of California, San Francisco (UCSF) is a leading university dedicated to promoting health worldwide through advanced biomedical research, graduate-level education in the life sciences and health professions, and excellence in patient care. It is the only campus in the 10-campus UC system dedicated exclusively to the health sciences. Organization Campus Req Number49601BRLocation UCSF Parnassus Job Title Research Data Analyst Percentage 50% variable Shift Length Other Shift Days Work Days Monday - Friday, 8:00 AM - 5:00 PM, variable Required QualificationsBachelor's degree in related area and / or equivalent experience / trainingTwo or more years of experience with data cleaning and data quality controlTwo or more years of experience in data analyses using a variety of statistical modeling techniques, including linear, logistic and Poisson regression models, time-updated analyses, mixed effect modeling, and Cox proportional hazard models in STATA or SASProficiency in SAS or STATA programsProficiency in Microsoft AccessAbility to provide custom-designed reports and graphical presentation of data using STATA, SAS, Excel, Power pointTwo years of professional statistical experienceStrong interpersonal and organizational skillsAbility to work both independently and as part of a diverse teamAbility to set priorities, meet deadlines, and manage multiple tasks simultaneously Note: Fingerprinting and background check required.Preferred QualificationsMaster degree in Public Health, Statistics, Epidemiology, or a related field - strongly preferredFamiliarity with medical terminology and epidemiology researchFamiliarity with electronic medical records (e.g. EPIC)Experience using latent class models and/or machine learning approaches such as random forests, LASSO regressionExperience with working with Veterans Affairs dataLicense/Certification n/a Position Type Part Time Department Name Nephrology Equal Employment Opportunity The University of California San Francisco is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, protected veteran or disabled status, or genetic information. "}