{"jobID": "2831031595", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.discordapp.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Media", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " -Help us answer humanity's most burning questions, such as \"How many Reapers does it take to kill McCree?\" or \"How do you lane with Spectre?\". Jk, no, but seriously how DO you lane with Spectre?? Join our small-but-growing data team as one of the first members and help us build Discord into the top gaming communications tool. Work closely with our product, marketing and engineering teams to help us understand user behaviour and ultimately design the best possible experience for our customers.  -What you'll be doing  -- Partner with our awesome Data, Product and Marketing teams to answer high-priority strategic questions. Here's a few examples: Given all our crazy ideas, what should we build next? Which features will have the highest impact and help us accomplish our goals more quickly?Deep dive on core product funnel usability and growth. Where can we improve the most?Where should we spend our partnership and marketing efforts? What are the most promising opportunities (international, mobile, etc.) for growing our brand?Define our user segments and identify areas where we can impact the business. Who are our most engaged users, and how can we acquire and retain more of them?Define KPIs for the company and build automated dashboards, reports, and models to enable teams at Discord to make better decisionsWork with Product & Engineering to implement, validate, and monitor our logging and metricsFind actionable strategic insights through funnels, cohort analyses, user segmentation, regression models and moreRun multivariate product experiments to help us drive growth, improve existing features, and identify new areas of opportunity What you should have  -- BA/BS in Computer Science, Math, Economics, Statistics, or other quantitative fields 4+ years work experience doing quantitative analysis (preferably in the tech industry) and proven track record of impacting business or product decisionsPro-level ability to synthesize and communicate complex concepts and analyses in simple, easy-to-understand waysA solid grasp of common statistical methods and applications (A/B testing, probability, regression) along with a healthy dose of skepticismFluency in SQL. Extensive experience pulling highly dimensional and complex data, as well as modeling scenarios and sensitivity analysis using ExcelAwesome attitude and a healthy dose of natural curiosity. Questions have to be answered and our data isn't just going to analyze itself. (We're working on that.) Bonus Points  -- A love of gaming and familiarity with the games industry Understanding of machine learning, data science and/or at least one statistics package (i.e. SciPy, Matlab, Stata, SAS).Development experience using programming languages such as R, Python or ScalaExperience working with very large data sets and distributed computing (Hive/Hadoop)Familiarity with technologies such as Airflow, AWS Redshift, and/or BigQuery to build and optimize production data pipelines"}