{"jobID": "2830902053", "jobLocation": "Seattle_WA", "jobTitle": "Senior Data Scientist - Decision Science", "companyRating": "4.2", "companyInfo": {"Website": "www.zillow.com", "Headquarters": "Seattle, WA", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Public (Z) ", "Industry": " Real Estate", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Realtor.com, RentPath, Redfin"}, "estimatedSalary": "160000", "jobDescription": " Dive into Zillows internal and third party data (think Hive, Presto, SQL Server, Redshift, Python, Mode Analytics, Tableau, R) to make strategic recommendations (e.g., personalized user flows, segmented marketing audiences, more accurate pricing forecasts).  Lead analytical efforts to develop scalable and methodologically rigorous approaches to performance measurement (e.g., AB testing, incrementality testing), forecasting, and other applications of advanced analytics.  Serve as a mentor to other Data Scientists on the team and Analysts across the company by leading learning academies and serving as an available resource for all things related to analytics.  Develop a common language and approach to analyzing and communicating information and insights across teams.  Tell stories that describe analytical results and insights in meetings of all sizes with diverse audiences.  Provide analytics-oriented thought leadership across a variety of technical and non-technical audiences to ensure that all levels of Zillow Group make data-driven decisions.  Who you are  You will not shy away from complexity or uncertainty. You will develop a deep understanding of our mission, business models, and personas. We want you to use that intuition youve developed (both in business and real life) to find opportunities for growth and cultivate insights from our massive data sets. Were looking for a seasoned data scientist who has:  An undergraduate or Masters degree in a quantitative field (e.g. science, engineering, economics, finance, statistics, or similar).  6+ years of work experience involving quantitative data analysis and complex problem solving (preferably focused on consumer-facing internet products).  Complete command of SQL, Excel, and either Python or R, along with some experience with Tableau and/or Mode.  Extensive experience directly querying multi-terabyte-sized data sets (with Hive and Presto) including clickstream data (like Google Analytics), third party data (like Facebook) and raw data ingested from non-standard platforms.  A strong understanding of concepts, terminology, and measurement issues related to web analytics along with a history of applying advanced analytical approaches to derive insights from the data.  Strong written, verbal, and visual communication skills to concisely communicate in a way that provides context, offers insights, and minimizes misinterpretation.  The skills to work cross-functionally and push business partners to focus on realistic goals and projects."}