{"jobID": "2570535415", "jobLocation": "San_Jose_CA", "jobTitle": "B2B Sales Payroll Executive", "companyRating": null, "companyInfo": {"Website": "www.heartland.us", "Headquarters": "Edmond, OK", "Size": "1001 to 5000 employees", "Founded": " 1997", "Type": " Subsidiary or Business Segment", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Summary:The Senior Product Advisor is responsible for the sale of the organization's payroll and related products offered in a specified region or major geographical area. The Senior Product Advisor will be assigned to a sales team within a geographic area to train, aid and assist in helping the Relationship Manager and Territory Manager to sell our product either on their own or by way of referral so that the Senior Product Advisor (SPA) can sell it to the end user directly. The compensation is highly leveraged with the opportunity for creating passive income.Job Details:Overview The Senior Product Advisor is responsible for the sale of the organization's payroll and related products offered in a specified region or major geographical area. The Senior Product Advisor will be assigned to a sales team within a geographic area to train, aid and assist in helping the Relationship Manager and Territory Manager to sell our product either on their own or by way of referral so that the Senior Product Advisor (SPA) can sell it to the end user directly. The compensation is highly leveraged with the opportunity for creating passive income. Role Your role as a Senior Product Advisor is to close sales of our payroll solutions with merchants throughout the area. As a Senior Product Advisor with Heartland, you will work closely with your local Division or Payroll Territory Manager to set appointments with business owners over the phone, face-to-face, through your network, and via referral partnerships that you build. You will then run scheduled appointments, uncover needs, and present Heartland solutions to close sales in our target vertical markets (restaurants, retail, medical, lodging, auto repair, salons, etc.). A Senior Product Advisor reports to a Division Manager and receives coaching from a Payroll Territory Manager.  During the training/ramp-up period, your local manager will accompany you on your initial appointments to train you on our short-cycle sales process using Atlas, our groundbreaking tablet-based CRM platform for lead generation, sales presentations, on the spot client financial analysis, and paperless contract processing. You will then have the freedom to set your own work schedule while working primarily from a home office and maximizing the upside of residuals and vesting opportunities.  What makes a great Senior Product Advisor? Drive for ResultsConfidenceCommitmentCoachableStrategic ThinkingEmpathyLikeabilityIndependencePositivityAssertivenessIntegrityResilience Does this describe you? Career PathAdvancement within Heartland organization in as little as 3 monthsResponsibilities of the Senior Product Advisor include:Prospecting for and running dynamic sales presentationsExplaining our value proposition to clients via Atlas CRM on your iPad or tabletClosing sales of our Payroll / HR Outsourcing solutions (Referring deals in Card Processing, Lending, Loyalty Marketing)Educating merchants and business owners on the payment processing industryUpselling current clients on our gift marketing, payroll and other products and servicesMaintaining regular communication with your Territory / Division ManagerJob RequirementsExcellent prospecting, communication, presentation and networking skillsWorks well independently and as part of a teamIncentive-driven sales “hunter”Professional demeanor and impeccable integrityHigh sense of urgency and innate sales talentMust enjoy cold-calling and speaking with people face to faceExperience dealing directly with small to mid-sized, local business owners and decision makersExperience closing in a fast sales cycle: 5 - 10 sales per monthExperience in a performance based compensation modelPrevious Top Performer status in an outside sales positionProven track record of pipeline development and closing salesAbility to pass a background checkValid driver’s license and auto insuranceComputer literacyMembership in a business or merchant association or a networking group a plusBilingual skills a plus Benefits:  Compensation - Benefits  W2  401K with company match  Benefits: Medical, Dental, Life, & Disability  Apply to learn more  We are an EOE F/M/D/V.  Global Payments, Inc. provides equal employment opportunities to all employees and applicants for employment without regard to race, color creed, religion, sex, national origin, age, citizenship, disability, veteran status or any other protected status. Those applicants requiring reasonable accommodation to the application and/or interview process should notify a representative of the Human Resources Department. Disclaimer: The above statements are intended to describe the general nature and level of work being performed. They are not intended to be an exhaustive list of responsibilities, duties and skills required."}