{"jobID": "2825152251", "jobLocation": "Seattle_WA", "jobTitle": "Data Scientist I", "companyRating": "3.2", "companyInfo": {"Website": "www.westonsolutions.com", "Headquarters": "West Chester, PA", "Size": "1001 to 5000 employees", "Founded": " 1957", "Type": " Company - Private", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "120000", "jobDescription": " Job ID 11637  Type Regular Full-Time  Company Fred Hutchinson Cancer Research Center  Location US-WA-Seattle  Category Biostatistics, Bioinformatics and Computational Biology  Overview  Cures Start Here. At Fred Hutchinson Cancer Research Center, home to three Nobel laureates, interdisciplinary teams of world-renowned scientists seek new and innovative ways to prevent, diagnose and treat cancer, HIV/AIDS and other life-threatening diseases. Fred Hutch's pioneering work in bone marrow transplantation led to the development of immunotherapy, which harnesses the power of the immune system to treat cancer. An independent, nonprofit research institute based in Seattle, Fred Hutch houses the nation's first cancer prevention research program, as well as the clinical coordinating center of the Women's Health Initiative and the international headquarters of the HIV Vaccine Trials Network. Careers Start Here.  HVTN is an international collaboration of scientists and educators searching for an effective and safe HIV vaccine. The HVTN's mission is to fully characterize the safety, immunogenicity, and efficacy of HIV vaccine candidates with the goal of developing a safe, effective vaccine as rapidly as possible for prevention of HIV infections globally. The HVTN Statistical and Data Management Center (SDMC) provides statistical and bioinformatics leadership in protocol design and data management/analysis. In addition, SDMC faculty and staff lead and contribute to analyses related to the development and implementation of innovative statistical and bioinformatics approaches to improve the scientific understanding of immunology, vaccinology, HIV biology, and how the these components influence HIV vaccine candidates. Responsibilities The Biostatistics, Bioinformatics and Epidemiology (BBE) program in the Vaccine & Infectious Disease Division (VIDD) is seeking a Data Scientist to provide programming and analytic support to our research team. The Data Scientist will collaborate with BBE faculty and external collaborators evaluating vaccines to prevent HIV, Tuberculosis and other infectious diseases.  The Data Scientist will apply knowledge of laboratory and data science to: Process and analyze laboratory data for research projects including assay development/validatiaon.Develop and/or implement data standards and data management best practices.Define requirements for quality control, processing, storage, and versioning of laboratory data.Identify opportunities for process improvement; anticipate changes to data properties based on ongoing development of assay and analysis methods.Document data management and analysis procedures.Provide subject matter expertise to research collaborators in the form of training, consultation, and other assistance as required.Maintain up-to-date knowledge of laboratory and data science research methods and technologies.Collaborate with internal and external partners on projects in support of the goals described above.Supervise students, data managers, and/or programmers in support of the goals described above.Perform other tasks related to data management and analysis as required.QualificationsMasters or Ph.D. in Systems Biology, Bioinformatics, Statistics, Biostatistics, Mathematics, Computer Science, or equivalent required, with minimum two years of related experience working in a multidisciplinary team environment with statisticians, computational biologists, programmers, epidemiologists, and/or laboratory investigatorsKnowledge of immunology laboratory methods (e.g., immunoassays, flow cytometry) and resulting data outputs required. Preference will be given to candidates who have experience working with vaccine immunogenicity assay dataProficiency in R or Python and version control (Git, GitHub, etc.) requiredStrong communication skills (both oral and written), and critical thinking skills are essentialExperience with programming in support of laboratory data management and analysis, clinical trials, or statistical programming in a clinical research setting strongly preferred Our Commitment to Diversity  We are committed to cultivating a workplace in which diverse perspectives and experiences are welcomed and respected. We are proud to be an Equal Opportunity and VEVRAA Employer. We do not discriminate on the basis of race, color, religion, creed, ancestry, national origin, sex, age, disability, marital or veteran status, sexual orientation, gender identity, political ideology, or membership in any other legally protected class. We are an Affirmative Action employer. We encourage individuals with diverse backgrounds to apply and desire priority referrals of protected veterans. If due to a disability you need assistance/and or a reasonable accommodation during the application or recruiting process, please send a request to our Employee Services Center at ********************* or by calling ************."}