{"jobID": "2796571648", "jobLocation": "Santa_Clara_CA", "jobTitle": "Senior Systems Software Engineer", "companyRating": "4.3", "companyInfo": {"Website": "www.nvidia.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1993", "Type": " Company - Public (NVDA) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "146000", "jobDescription": " NVIDIA’s invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined modern computer graphics, and revolutionized parallel computing. More recently, GPU deep learning ignited modern AI — the next era of computing — with the GPU acting as the brain of computers, robots, and self-driving cars that can perceive and understand the world.  The Core Virtualization Team within Automotive Software plays a critical role in NVIDIA's expansion into the world of artificial intelligence and autonomous vehicles. In order to fully utilize the power of NVIDIA processors, many applications, written by different companies and suppliers, on top of different operating systems, with different real-time, safety, and security requirements, run concurrently. Our jobs is to facilitate the sharing and separation of system resources while achieving these requirements.  Do you love writing precision code, reasoning through challenging requirements that span safety and security domains, and clearly communicating your ideas with others? Are you driven to achieve your best? Would you enjoy working to improve the future?  We are building a team that will truly change the world, and we would love for you to join us. We are hiring now for the position of Senior System Software / Hypervisor Engineer. Whatyou’llbedoing:Develop Core Virtualization software for Tegra platforms, enhancing its functionality, safety, security, and performance.Work on a variety of operating systems such as Linux, Android, QNX, embedded RTOSes and develop virtualization drivers for them.Apply your deep understanding of the design and interactions of our entire ecosystem of software stacks to creatively tackle challenging and meaningful problems.Improve our operating systems architecture, while getting exposed to the next generation of NVIDIA Graphics and Tegra hardware.Whatweneedtosee:Bachelor's degree and 6-8 years of experienceProficiency in C, Embedded SystemsPast work on Linux or other OS or RTOS kernelsClear, concise communication skillsWaystostandoutfromthecrowd:Past projects demonstrating complex design and programming skills in C.Strong understanding of multi-core hardware, operating systems design, concurrency, virtual memory, caching, interrupts, device drivers, real-time considerations, assembler programmingExperience on ARM 64-bit architecture and/or virtualized device drivers.Experience developing hypervisors and virtualized environments, ideally in the embedded space. NVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most brilliant and talented people in the world working for us. If you're creative and autonomous, we want to hear from you!NVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression , sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law."}