{"jobID": "2824770820", "jobLocation": "Seattle_WA", "jobTitle": "Senior Game Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.bigfishgames.com", "Headquarters": "Seattle, WA", "Size": "501 to 1000 employees", "Founded": " 2002", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Zynga, DoubleDown Interactive, King"}, "estimatedSalary": "75000", "jobDescription": " Come Play  SkyRocket Studios creates casual and midcore mobile games to entertain vibrant communities of players every day! Through a combination of internal-development and second-party partnerships, we have released hit free-to-play games which run the gamut of genres from puzzle favorites like Cascade and Fairway Solitaire, to the fan-favorite RPG, Dungeon Boss. We are committed to innovating \"games as services\" for mobile devices. Through the use of solid technologies and rapid iteration, we use focus our creative energy on creating fun and engaging games for large and growing groups of loyal fans. At SkyRocket, we work every single day to delight our customers.  SkyRocket Studios is an integrated part of the Big Fish community (AKA \"The Pond\"). Located in Seattle, our headquarters is conveniently situated on the beautiful Puget Sound, just outside the hustle-and-bustle of Downtown. Need commuting options? We're right along multiple bus routes for the transit-takers, the Elliott Bay trail for cyclists, and have a secure on-site garage for four-wheeled commuters. Our facilities are built around work and play, with state of the art tools and software to get the job done, and amenities that make work fun!  The Mission  We are looking for an experienced Senior Game Data Analyst to support our studio. Are you are passionate about working with data, and driven to produce actionable insights from detailed reporting and analysis? Are you able to apply a breadth of data extraction, manipulation, and analysis techniques to provide guidance and meet business need? We're looking for a teammate who can answer a wide range of business questions rapidly and accurately, and effectively communicate technical reports to non-technical audiences, both at the detail level and at a senior executive view. Additionally, you will help those same audiences turn business needs into technical specifications for the reports and analysis helping engineers and designers find the \"fun\" in games, while developing new metrics for our executives. Your responsibilities will include data integrity and verification, reporting, business analysis, and data visualization development.  Also included You will work closely with business and product leads, driving investigations and reporting to support timely and accurate decisionsYou will apply statistical analysis for ad hoc projects to enable deep dives into game data and player insightsYou will develop insights from your analysis to make recommendations on key business strategiesYou will write advanced SQL to translate arithmetic solutions/statistical models to implementable codeYou will utilize SQL for exploratory analysis, and use visualization techniques to communicate insights and recommendations to the businessYou will maintain and improve analytic reports to answer business questionsYou will serve as an advocate for ensuring team goals align with business goals and needsYou will build and maintain strong and effective working relationships with Studio constituents, centralized BI resources, IT, and Operations You Are Able to consume and understand data from dimensional modelsAble to change direction quickly based on data analysis resultsExperienced using descriptive and inferential statistics to analyze and present findings (Python, R, SPSS, SAS, etc.)Familiar with using visualization techniques for presenting data and analysisCompetent in at least one programming language for moving and parsing data sets Required Experience and Skills Bachelor's degree or equivalent work experience in a quantitative field (such as Statistics, Economics, Mathematics, Computer Science, etc.)5+ years of analytical work experience2+ years of product focused work experience5+ years of SQL experience Preferred Experience and Skills Data visualization (Tableau, Power BI, R Shiny, etc.)HiveQLStatisticsData MiningPython"}