{"jobID": "2824715203", "jobLocation": "Tacoma_WA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.trueblue.com", "Headquarters": "Tacoma, WA", "Size": "5001 to 10000 employees", "Founded": " 1989", "Type": " Company - Public (TBI) ", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Adecco, Kelly Services, Manpower"}, "estimatedSalary": null, "jobDescription": "TrueBlue has a Data Analyst position open on our Business Intelligence team. This position will be located in our Corporate office in downtown Tacoma.  The Reporting Data Analyst is responsible for partnering with the business and helping provide data / analysis for ongoing business needs. The candidate needs to have excellent data analysis, SQL writing / tuning skills for this role. This position requires extensive customer relations skills and ability to multi-task on various requests. The support provided includes problem solving, reporting, resolution and/or escalation. Additional duties include documentation and incident tracking.  TrueBlue, Inc. is the nation's leading provider of industrial staffing and outsourced workforce solutions. Publicly traded since 1995, the company provides work opportunities to over half million people through service lines such as: PeopleReady, People Management and PeopleScout. PRIMARY RESPONSIBILITIES: Proficient in writing SQL and tuning it.Ability to liaise with business and translate business needs to technical requirements to pull data.Develop complex queries and reports to meet customer requests.Demonstrate expertise in Information Technology disciplines.SSIS scripting, stored procedure, T-SQL for adhoc reporting.Extensive data analysis to determine data integrity.Project organization to interpret customer requirements and convert into technical solutions. Gather customer requirements and identify reporting needs.Assist the team with helping build the Data Lake Solution and assist with the creation of the metadata layer to enable business for self-service.Partner with the BI team to provide feedback on essential metrics / features that are often requested by the business teams.Apply change control processes and procedures to ensure business and regulatory compliance.Provide timely, accurate and proactive communications.Escalate critical issues for appropriate/timely resolution as needed.REQUIREMENTSAssociate's degree or higher (or equivalent work experience).Advanced SQL database and T-SQL knowledge and hands-on experience.Excellent knowledge of Microsoft stack - SQL Server, SSIS etc.SQL 2012 Management Studio knowledge and hands-on experience (SQL2014/2016) a plus).Solid understanding of relational database design, including actual design experience.Excellent analytical, technical and diagnostic skills.Knowledge of data integration from development to test to production.Ability to track and ensure the success of multiple simultaneous projects.Demonstrated ability to identify process improvement opportunities.Experience in SAS based solutions is desirable. Salesforce, Oracle Fusion, etc.Ability to adapt quickly to constantly changing business priorities.Demonstrated ability to exercise initiative, independent judgment and be a self-starter.Strong PC-based business software skills including MS Project, MS Office suite, and Visio (or other process design software) as well as a solid Windows operating system background. TrueBlue provides an excellent benefits package, which includes: 401(k), Employee Stock Purchase Program, Tuition Reimbursement and comprehensive Health and Welfare coverage including Medical/Dental/Vision and prescription drug benefits. We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law."}