{"jobID": "2817713147", "jobLocation": "Boston_MA", "jobTitle": "Analytics, Data Scientist with strong Marketing - Sr. Manage...", "companyRating": "3.6", "companyInfo": {"Website": "www.avanade.com", "Headquarters": "Seattle, WA", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Slalom, Cognizant Technology Solutions, Deloitte"}, "estimatedSalary": "137000", "jobDescription": " SunIRef:Pharma2:title  Analytics, Data Scientist with strong Marketing - Sr. Manager  Avanade 183 reviews - Boston, MA  Marketing Analytics Data Scientist  Job level - Group/Sr. Manager  Job Location - Open to any US Location / remote  This Role requires specific Marketing Analytics experience. About the role: The Group Manager, Marketing Analytics and Insights role oversees and manages the global marketing data and analytics function and is responsible for setting and deploying the marketing data and analytics strategy, managing marketing measurement, reporting and analytics processes, maintaining and managing existing data sources, and generating insights to ensure optimal efficiency, effectiveness and ROI of all marketing campaigns and activities. The role is also engaged in marketing planning, marketing analytics best practice creation, staying abreast of thought leadership in the field and knowledge sharing among the global marketing community. Day-to-day, you will: Marketing Data and Analytics Strategy  Oversee and manage the global marketing data and analytics function with the aim of running a best-in-class function that facilitates data and insights based decision making  Define and deploy the global marketing data and analytics strategy to help move the organization from siloed to integrated data collection and reporting with deeper analysis and actionable insights generating capabilities.  Stay abreast of and ensure adherence to industry thought leadership and best practices in marketing analytics and facilitate knowledge sharing and training among the global marketing community  Work with Digital Marketing Platforms lead to ensure we have the right marketing technology stack  Work with Avanade legal team to ensure we are compliant with internal and external policies, GDPR in particular  Measurement, Reporting and Insights Generation  Manage the end-to-end marketing measurement and reporting framework enabling results reporting, marketing business reviews and analytics and insights generation  Manage the monthly and quarterly marketing reporting process and leadership reviews and accountable for the compilation, preparation and translation of complicated data into simple high level information for leadership to communicate marketing results  Work closely with Field, Area and Corporate marketing teams to collect and analyze data and identify key insights to enable data driven decision making  Establish a new and improved reporting platform on Power BI (working with ITS) and transfer all existing Marketing scorecards to new platform Analyze existing data from Marketing data sources and provide insights to the business stakeholders to make informed business decisions  Maintain and manage data sources, develop data strategy and governance and oversee the Marketing Data and Analytics Specialist  Educate and train our \"customers\" in data interpretation and analysis making them increasingly self-serviced Marketing Planning: Work closely with Digital & Marketing Effectiveness lead to manage and execute the global marketing annual planning process and ensure appropriate integration and operational alignment with the overall global Avanade planning cadence  Manage annual target setting process (aligning plans with measurement and reporting framework)  Train and support Field, Area and Corporate marketing functions in development of annual marketing plans and target setting, ensuring plans align with business and marketing goals  Facilitate intergroup communication within marketing teams and with other groups (e.g., Sales, IT) for alignment of plans ensuring adherence to objectives and standards  Support in development of annual Global Marketing Business Plan  About Avanade  At Avanade, our vision is to be the leading digital innovator, realizing results for our clients and their customers through the power of people and the Microsoft ecosystem.  Through thousands of projects, we've transformed businesses for the digital world. We've helped them create compelling experiences for their customers and employees. We've reduced costs, increased productivity, enabled collaboration and enhanced agility - and ultimately improved performance.  Avanade, which is majority owned by Accenture, was founded in 2000 by Accenture LLP and Microsoft Corporation and has 29,000 professionals in more than 20 countries. Additional information can be found at *************** Qualifications Likely years' experience  6+ years of experience in marketing analytics/marketing data science, reporting and data management in a technology industry B2B environment.  Advanced analytical skills and ability to conduct analysis and create reports, dashboards in Excel, Google Analytics and Power BI (Marketo and MS Dynamics CRM a plus)  Outstanding organizational skills and attention to detail with ability to multi-task, prioritize and manage time effectively  Excellent communication skills both written and verbal  Flexibility and ability to thrive in a global, virtual and fast-paced environment and must be able to work with minimal supervision and direction and willing to work remotely  Strong ability to interact with all levels of management in a professional manner  Excellent and advanced Microsoft Word, Excel and PowerPoint skills as well as familiarity with Microsoft collaboration tools such as Microsoft Teams, Visual Studio etc.  Your education likely  Bachelor's degree minimum, preferred MS or MBA  About Avanade  Is An Equal Opportunity Employer. Avanade promotes equal employment opportunity to all employees and applicants and does not discriminate on the basis of race, religion, color, creed, national origin, sex, age, sexual orientation, status as a protected disabled or Vietnam Era Veteran, disability, or any other legally protected status.  Requisition ID - 50657  Avanade is the leading provider of innovative digital and cloud-enabling services, business solutions and design-led experiences, delivered through the power of people and the Microsoft ecosystem. Majority owned by Accenture, Avanade was founded in 2000 by Accenture LLP and Microsoft Corporation and has 30,000 professionals in 24 countries. Visit us at ***************.  5 days ago original job On Company Site"}