{"jobID": "2802099544", "jobLocation": "Los_Angeles_CA", "jobTitle": "Sr. Data Scientist needed in Westwood (120K 150K DOE)", "companyRating": null, "companyInfo": {"Website": "www.careermovement.com", "Headquarters": "El Segundo, CA", "Size": "1 to 50 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " One of the first Internet companies to call Los Angeles home, over the past 15 years our client has grown from a tiny LA start-up into the worlds leading small cell company, publicly traded on NASDAQ (WIFI). They are a market leader in technologies that fuel todays connected lifestyle. Their Wi-Fi and cellular networks reach more than a billion people each year at airports like LAX, JFK, London and Dubai, in stadiums and universities like Soldier Field and the University of Arizona, throughout complexes like the World Trade Center, and on military bases worldwide. ResponsibilitiesDevelop professional grade models to optimize advertising outcomes, employing statistical modeling, machine learning and data mining techniques. Process and analyze large data sets to discern meaningful trends and relationships. Partner with Data Analysts, Product and Engineering teams to operationalize/scale solutions. Eventually build out and lead a full data science department. RequirementsAt least 2 years of professional experience as a data scientist. Strong understanding of machine learning techniques and statistical data analysis. Fluency with query languages (e.g. SQL) across MySQL and NoSQL databases. Experience in at least one high-level statistical language such as Python or R. Ability to clearly explain technical concepts to non-technical audiences. Bachelors in a quantitative field (e.g. Statistics, Mathematics, Finance, Computer Science, or Engineering).  Pluses A Masters or PHD in a quantitative field (e.g. Statistics, Mathematics, Finance, Computer Science, or Engineering). Experience in Ad Tech or Mobile Gaming.  Salary Competitive salary (120K - 150K) PerksPotential for equity, positive and fun work environment, healthcare coverage (medical, dental, vision), paid time off, company outings (Happy Hours, Holiday parties, etc.). Apply"}