{"jobID": "2823589335", "jobLocation": "New_York_NY", "jobTitle": "Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.annalect.com", "Headquarters": "New York, NY", "Size": "201 to 500 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "86000", "jobDescription": " As every CMO knows,  employing technology, data and analytics to business challenges is the cost of  entry, not a nice to have. Unlocking the value of consumer data can deliver  growth, revenue and ROI, and create differentiation to stay on top. Real-time  action is instrumental in driving results within a highly fragmented  marketplace. Annalect’s data solutions are built to deliver insightful results  with speed, accuracy and a single version of the truth. In leveraging the DNA  of a marketing agency with a talent pool of developers, data scientists and Ph.Ds,  we hold a unique position in the increasingly crowded ad tech and consulting  space.  Join our dynamic and  diverse team at Annalect – data solutions for marketers, by marketers.Position OverviewExploration and experimentation with large number of datasets to  draw insights and search for storiesModeling and building algorithms on top of our vast number of  datasetsAssist in designing tech infrastructure and data pipelines (ETL,  data automation, data querying, etc.)Building tools to process, visualize and analyze dataDesigning and building data-driven software products Deploying scalable solutions to cloud-based infrastructure Required SkillsExperience with predictive modeling, databases, computational  simulation, clustering, machine learning, and remote computing, e.g., Amazon  AWS3 years experience with Python (numpy, scikit, matplotlib, and  pandas packages), SQL, bash, R, and other similar statistical computating  environmentsExposure to Javascript, HTML/CSS, XML, Hadoop, and parallel  processingVery strong written and verbal communication skills; thrive in a  rapidly-evolving environment Education &  Experience Advanced degree in a quantitative discipline preferred or  equivalent work experiencePerks of Working @ Annalect:"}