{"jobID": "2796050624", "jobLocation": "New_York_NY", "jobTitle": "Science Teacher", "companyRating": null, "companyInfo": {"Website": "www.zetaschools.org", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Unknown", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "BACKGROUNDThe mission of Zeta Charter Schools is to build and sustain high-performing schools that forge thriving communities of lifelong learners, problem solvers, and innovators. Zeta will launch in NYC with two public charter schools in the 2018-2019 school year, with plans to grow to ten schools serving PreK-12th grades. Zeta Schools are committed to:Academically Rigorous Education for a Modern Workforce. Zeta will combine the best of an academically rigorous education, focused on critical thinking and problem solving, with cutting edge technology and tools. Students will excel academically and work to solve the problems of the future, creating and inventing in innovation laboratories and developing coding fluency. Zeta will invest in serving the particular needs of at-risk, high-needs, English Language Learner, and advanced populations, with an aim to diversify the approach in order to mine their unique and highest potential.Mindfulness and Wellness. Zeta Schools will promote an environment of mindfulness for students, staff, and families. Mindfulness will foster kindness and serve as the foundation for a respectful school community. It will further teach students the value of treating others in a manner they would want to be treated and to learn self-regulation. Students will engage in invigorating daily physical activity and learn healthy habits, and all members of the community will be encouraged to practice and model healthy habits to maximize their own well being.High-Performance, People-First Culture. We are focused on hiring and developing great people and maintaining high expectations to enable team members to grow personally and professionally. Zeta cultivates a high-performance culture that fosters extraordinary outcomes, innovation, efficiency, and productivity, while practicing a sustainable people-first culture. With over 300 hours of professional development every year, we put our efforts where we think the biggest returns are: our people. The people-first culture extends to our community as wellwe will embrace family involvement in order to best serve the needs of individual children.OPPORTUNITYAs a Science Teacher, you will receive extensive support and professional development from experienced teachers and talented school leaders to ensure your success, build deep relationships with students, parents, and communities, work in an innovative environment with high standards for children and adults alike, and join a community of leaders committed to transforming public education in New York City and beyond.KEY RESPONSIBILITIESBuilding a classroom culture in which students love sciencePlanning, preparing, and delivering excellent instruction to all students in the class according to their educational needsPromoting a classroom environment where students fully internalize the scientific method, can clearly explain what they have learned, and develop an innovative approach to problem solving by applying what they know to new challengesTeaching Life, Physical, and Earth Science through an inquiry-based, rigorous curriculum that inspires intellectual curiosity and enables all students to thriveWorking with the school team to create a world-class cross-curricular innovation laboratoryDeveloping strong relationships with parents and students to create investment in school culture and academicsDriving academic outcomes by analyzing data, studying student work, and implementing high-leverage instructional moves to ensure dramatic gains for all studentsHolding yourself accountable for excellent student outcomesBringing a passion for innovation and optimizing technology in the classroomAssessing, recording, and reporting on student progress, achievement, and behaviorTraining with colleagues and school leaders to receive targeted, in-the-moment feedback on instruction, as well as unparalleled support and professional developmentREQUIRED QUALIFICATIONSDemonstrated passion for the mission, vision, and core values of Zeta SchoolsLead teaching experience with a proven record of propelling student growth and achievementHigh moral characterFlexible and open to feedbackDemonstrating grit and perseveranceInterested in working in a collaborative environmentPassion for learning, driving innovation, disrupting the status quo, trying new approaches, and tackling problems from many angles and with creative solutionsBachelors degree required with an outstanding record of academic achievement and leadershipCOMPENSATIONCompensation is commensurate with experience. Zeta Schools offers a competitive compensation package.START DATEZeta Schools is seeking candidates who can start July 2, 2018.Work authorization required (candidate must have permanent authorization to work in the U.S.). Zeta Schools is an equal opportunity employer and has a strong commitment to diversity. Candidates of all backgrounds are encouraged to apply."}