{"jobID": "2767233935", "jobLocation": "Billerica_MA", "jobTitle": "UX Research Intern", "companyRating": "3.3", "companyInfo": {"Website": "www.insulet.com", "Headquarters": "Billerica, MA", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Public (PODD) ", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "91000", "jobDescription": " Are you passionate about user experience research? Do you crave trying to understand how people think and what is important to them?  Do you want to be part of the revolutionary diabetes management solution space, focused on children and adults alike?  If so, we at Insulet Corporation want you to work with you. We are a highly experienced User Experience Design and Research group tackling the world’s growing pediatric and adult diabetes problem space with the easy to use and successful Omnipod product and other related solutions.  Insulet Corporation, located in Billerica, MA, is seeking a User Experience Research Intern to join our growing team in the suburb of Boston (Billerica, MA). You will be working with our very experienced researchers and designers to assist with usability studies and participate in formative user interviews, contextual inquiry, and other research activities. You will work on all aspects of user research programs - assisting with participant recruiting, preparing study materials, moderating research studies, leading human factors and usability analysis and report generation as part of the generative and evaluative nature of product design development.  We’re looking for someone who wants to use their curiosity and creativity to change the face of diabetes; someone to not only execute user research activities, but actively assist with the dissemination of research findings throughout the organization and provide actionable insights to drive product designs. Collaborate with researchers to plan and execute research studies. This may involve: preparation of study documentation, coordinating consent forms, note-taking, and study moderation, etc.Collaborate with user experience designers to validate and test design prototypes.Assist with analysis of study findings, create actionable recommendations, and help disseminate results throughout the organization.Perform other duties as required.Minimum Requirements: At least some completed courses in a UX-related Bachelor’s or Master’s degree and/or working towards completion of HCI, Cognitive Science, Behavioral Science, Human Factors, Psychology, or other related business fields. Preferred Skills and Competencies:Excellent verbal and written communication skills.Concise documentation and presentation skills.Creativity and analytical skills.Possess strong user-observation skills, ability to understand and apply user-centered design best practices and techniques.Portfolio, case studies, or examples of conducted research with resulting conclusions and recommendations.Attention to detail, ability to communicate well on paper and verbally to a variety of stakeholders.Flexibility, independence and positive attitude.Experience with mobile usability testing a plus.Experience working on enterprise and IoT connected devices a plus.Embody the work ethic and personality that thrives in a fast-paced culture with tight deadlines, shifting priorities, and working with super-smart colleagues from numerous departments and locations.Physical Requirements (if applicable):Role is located in Billerica, MA."}