{"jobID": "2661917292", "jobLocation": "Newton_MA", "jobTitle": "Marketing Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.russianschool.com", "Headquarters": "Newton, MA", "Size": "501 to 1000 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "46000", "jobDescription": " RSM’s unique approach develops critical thinking and has built excellence in math since 1997. Recently featured on TED, NPR, and the Atlantic magazine as one of the players in the “Math Revolution” and ranked one of the best schools in the world by the Johns Hopkins Center for Talented Youth, RSM helps children of all levels build a solid math foundation and develop their critical-thinking and problem-solving skills.  The Russian School of Mathematics is looking for a Sr. Data Analyst to empower our marketing department in devising strategy for continued growth. We are looking to grow awareness about our brand across the country, and need to understand which channels to invest in, how much to spend, and how to identify target markets. You would be instrumental in and partner closely with the marketing director in finding these solutions, and driving decisions that are key to the overall marketing strategy.  We're looking for a team player who gets excited about tough business problems but isn't afraid to roll up their sleeves and get deep into the data. This is the perfect role for someone who wants to continue to grow their technical data skills as well as the strategic thinking and communication skills required to drive meaningful impact through data.  Job Responsibilities/ Essential Functions:  Be a thought partner to impact strategy: Partner closely with the marketing director and others on the marketing team to identify key KPI's necessary for successful execution and measurement of the marketing strategy (i.e., what does ROI look like for each marketing channel?)Create and plan well-designed hypotheses and experimentation, and report results on key campaigns and optimization experimentsTee up recommendations based on data and insights to senior leader stakeholders Continually Improve Our Data Infrastructure Introduce the instrumentation to be able to measure and monitor marketing KPI's, for both paid and organic channels, online and offline; develop methodology for cross-channel attributionConstruct and refine analysis of the potential customer, from acquisition to usage to retentionBuild and publish access to the tools and data the marketing team needs, so that every decision they make is backed up with solid data and analysis Help Instill a 'data Driven'/'data Informed' Culture Be the voice of data within the organizationFind creative and insightful ways to publish and promote how we're performing on key metricsEnsure there is strong analytics input into the evaluation and prioritization of new opportunitiesHelp set the goals and define the evaluation methodology for each initiative Minimum Required Experience & Education 5+ years’ experience in data science or analytics (or related role), supporting a marketing functionExperience with Hubspot preferred but not requiredExperience working with third party marketing vendors and ingesting/triangulating imperfect data from a variety of sourcesAbility to think strategically (interfacing with senior leaders), while also enjoying being hands-on with the dataStrong statistical foundationsA knack for asking the right questions, then answering them with sound data and analysisAbility to dive deep into the data weeds, and then synthesize data into strategic business insightsRSM embraces diversity and is committed to attracting qualified candidates who also embrace and value diversity and inclusivity. RSM is an Equal Opportunity/Affirmative Action Employer"}