{"jobID": "2724128675", "jobLocation": "Brooklyn_NY", "jobTitle": "RN, Care Management, FIDA", "companyRating": "3.1", "companyInfo": {"Website": "www.vnsny.org", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1893", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "41", "jobDescription": " Overview Created in 1998, VNSNY CHOICE is the managed care affiliate of the Visiting Nurse Service of New York and shares its mission of compassion and care for the poor, the chronically ill and elderly. Our guiding principle is to help the most vulnerable among us live safely and independently for as long as possible in their own homes and communities. VNSNY CHOICE has 700 employees, including 227 care management staff. On any given day, VNSNY CHOICE coordinates care for more than 40,000 members through its array of Medicare and Medicaid health plans, including Medicaid Long Term Care, Medicare Advantage, and a HIV/Special Needs Plan. With offices in Manhattan, Brooklyn and upstate New York, VNSNY CHOICE health plans are available in the New York City metropolitan area as well as on a plan basis in selected counties throughout New York State. Responsibilities Leads the Inter-Disciplinary Team (IDT) which provides each participant with an individualized, comprehensive care plan designed to maximize and maintain individual&rsquot;s functional potential and quality of life. Authorizes and manages the clinical and customer service decisions relating to the case management and services provided to FIDA participants. Provides telephonic medical case management to members. Ensures all services provided are in compliance with VNSNY CHOICE FIDA policies and procedures as well as applicable state and federal regulations, while at the same time balancing clinical and customer service concerns. Works under general supervision. Licensure: License and current registration to practice as a registered professional nurse in New York State required. Education: Bachelor's Degree in Nursing (BSN) from an approved program preferred. Certification in Case Management preferred. Experience: Minimum of three years of experience in a managed care organization working with Medicare and Medicaid guidelines, including familiarity with Medicare Part A, B, and D, required. Prior experience working with regulators, medical, behavioral health and social service providers and all levels of staff to care manage and coordinate services required. Demonstrated understanding of a fully capitated program from a regulatory perspective for care management and the ability to apply capitation to care management practice required. Working knowledge of FIDA model of care required. Familiarity with NY State assessment tools preferred. Experience in utilization review with strong cost containment/case management background required. Excellent organizational and time management skills, interpersonal skills, verbal and written communication skills required. Must have experience and qualifications reflective of needs of the FIDA Population (i.e., communication, cognitive, or other barriers); and knowledge of physical health, aging and loss, appropriate support services in the community, frequently used medications and their potential negative side-effects, depression, challenging behaviors, Alzheimer&rsquot;s disease and other disease-related dementias, behavioral health and issues related to accessing and using durable medical equipment, as appropriate. CA2018"}