{"jobID": "2768317831", "jobLocation": "Los_Angeles_CA", "jobTitle": "Summer Intern, Software Development", "companyRating": null, "companyInfo": {"Website": "www.hia.ai", "Headquarters": "Los Angeles, CA (US), CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " RESPONSIBILITIES  The Summer Intern will join our engineering team to participate in application of Artificial Intelligence (AI) in an exciting field, offering exceptional learning opportunities.  We are looking for candidates who can be challenged and are innovative, who can think outside the box and be able think from an end-user perspective. Your responsibilities will include supporting software development in building our virtual human product, with a focus on game development, web development and AI. You will get to interact with and learn from experienced software architects and developers while contributing individually and/or work in a team of other engineers and interns on assigned projects.  REQUIREMENTS Solid understanding of C#Strong experience with UnityExperience with web development, e.g. restful services, websockets, javascript, asp.net, etc.Experience with AI, machine learning, natural language processing, computer vision, speech recognition a plusExperience with cloud platforms by Google, Amazon, and Microsoft a plusExperience with UI/UX a plusExperience with database technology, e.g. T-SQL, NoSQL, MySQL, etc. COMPENSATION & BENEFITS  This is a paid internship position.  THE COMPANY  HIA is founded with the mission to empower businesses to converse with their customers and employees intelligently, efficiently, and at lowest cost. Using our tools, businesses will be able to conduct complex conversations online via a realistic and intelligent virtual human agent that can ask and answer questions, and extract actionable data.  HIA's management team includes two tech & media veterans David Goldman and Vacit Arat; two senior members of USCs Institute of Creative Technologies: Arno Hartholt, who managed the Integrated Virtual Humans project there for the last 10 years; and Skip Rizzo PhD, who used the technology extensively in healthcare applications; Rick King, renowned expert and influencer in Unity, VR, AR and AI; and Steve LaValle PhD, the former Chief Science Officer of Huawei, co-founder & ex-Chief Science Officer of Oculus (Facebook) and Professor at University of Illinois Urbana-Champaign.  The Advisory Board includes Danny Lange PhD, currently the VP of AI and Machine Learning at Unity Technologies, ex-head of machine learning at Uber, ex-General Manager of Amazon Machine Learning;  Todd Carlisle PhD, currently the Chief People Officer of Etsy; ex-VP of HR at Twitter, and ex-Director of Recruiting at Google; and Ted Schilowitz, the Futurist of Paramount Pictures, and a founder of RED Digital Cinema. "}