{"jobID": "2701213297", "jobLocation": "Bellevue_WA", "jobTitle": "Senior Data Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.egencia.com", "Headquarters": "Bellevue, WA", "Size": "1001 to 5000 employees", "Founded": " 2002", "Type": " Subsidiary or Business Segment", "Industry": " Travel & Tourism", "Revenue": " Unknown / Non-Applicable", "Competitors": " Priceline.com, Booking.com"}, "estimatedSalary": "114000", "jobDescription": " EgenciaIn this role, you will join a new, small and versatile team, tasked with building the foundations of data science at Egencia, and providing the insights that will shape our future.  This dynamic position would suit an enthusiastic data science visionary who is looking for an impactful, multi-faceted role in our Bellevue office. Does this sound like you?  We (Egencia) may be known as the corporate business travel arm of the Expedia Group, but behind the scenes, life couldnt be less corporate.  We are a diverse, motivated, global family who enjoy the benefits of flexible working hours, travel allowances, wellness reimbursements, health insurance plans and so much more. Its no surprise that we consistently receive Best place to work awards.  Do the words machine learning, algorithm development, segmentation recommendations, data pipelines and analytics make you smile?  Are you ready to dive into the data of the entire tech stack of the worlds fourth largest travel management company, powered by the worlds largest online travel platform? (thats some big data!)  Yes? Then we would like to hear from you. What you will do:Improve the product offerings of Egencia, enhancing business, product and our clients own analyticsShape your own role, helping to establish the direction of the team and Egencias data science roles in generalBuild strong relationships with the technology, product and business teams within EgenciaWhat you will bring:A passion for problem-solving and a gift for finding patterns and insights within structured and unstructured data5+ years experience working with real data: cleaning, modeling, integrating in a similar positionA BA/BS in a related field e.g. statistics, computer programming, mathematicsStrong knowledge of set based languages e.g. SQL and proficiency in at least one of Java, Python, Scala, RThe ability to work in a cross-functional team alongside developers, statisticians and other data scientistsThe ability to explain complex areas in simple terms and communicate with various business stakeholders to gather information and relate topicsBeing well-versed with cloud solutions (AWS, Azure), distributed computing (Spark, Hadoop) and Omniture/Google Analytics would be advantageous in this roleExperience with machine learning techniques such as Bayesian methods, clustering, decision trees, random forests etc. would be a plusWho We Are:We believe in being Different. We seek new ideas, different ways of thinking, diverse backgrounds and approaches, because averages can lie and sameness is dangerous.We are Transparent. We communicate openly and honestly, at all levels, upwards, sideways and downwards. We surface difficult issues quickly, we act, we learn.We organize for Speed. We seek to capture data as fast as possible, and move. Speed allows us to make mistakes and constantly improve.We believe in the Scientific Method. Everyones ideas are equal in the face of hard data. We use data to guide but not define our actions.We Lead Humbly. Our leaders serve their teams. None of us has all of the answers, but we are curious, and we are always looking to learn.We act as One Team. We look to optimize for the greater good, not just our own, or even our own teams' interests. We are actively interested in the success of others. *LI-ES1Expedia is committed to creating an inclusive work environment with a diverse workforce. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. This employer participates in E-Verify. The employer will provide the Social Security Administration (SSA) and, if necessary, the Department of Homeland Security (DHS) with information from each new employee's I-9 to confirm work authorization."}