{"jobID": "2794683644", "jobLocation": "San_Jose_CA", "jobTitle": "Director, New Product Introduction (NPI) World Wide Client Business Unit", "companyRating": "3.6", "companyInfo": {"Website": "www.flex.com", "Headquarters": "San Jose, CA", "Size": "10000+ employees", "Founded": " 1969", "Type": " Company - Public (FLEX) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "177000", "jobDescription": "Job DescriptionThe Director, New Product Introduction (NPI) Worldwide Client Business Unit will be based in San Jose, CA (or Austin, TX, or Guadalajara, MX). The Director will interface with Client to understand their direction with Single/virtual NPI, and to turn these into actionable strategies within the Flex NPI to production processes, support process, and innovation/automation/digitization initiatives to achieve Client’s product design requirements, in line with quality, cost, time to market, and competitive market growth strategies, at a fair rate of return for Flex. The Director will also be accountable for the successful launch and/or implementation of new products, platforms, processes, controls, to meet and exceed Client NPI, product launch and sustaining requirements We are looking for someone who demonstrates...Intense collaborationPassionate customer focusThoughtful, fast, disciplined executionTenacious commitment to continuous improvementRelentless drive to winHere is a glimpse of what you'll do...Lead the NPI team and Sites in the guidance of clients by developing strategic plans, goals, timelines, and measures of success for introducing new products/platforms, processes, controls, and/or services. When it´s about New Products, technologies and/or transfers act as the primary point of contact between the business and its clients.Promotes, takes the lead, motivates, encourages and demands to all teams to behave and execute driving excellence principles and results.Coordinate with the client and Flex operations to determine NPI data requirements, production schedule, materials and deliverables as required.Ensure effective communication of strategy as required with cross functional teams/Sites to ensure project / product or service has a smooth and timely introduction or transition through all phases of development processes.Work with the PM Director and Management team with regard to coordination of team members to secure key metrics and goals are achieved in support of all customer satisfaction requirements.Escalation point for all internal and external NPI related issuesCollaborate and steer business development activities to win replacement and growth business.Implement appropriate HR strategies and actions to recruit and retain a qualified and motivated NPI workforce.Oversight across all sites providing Client NPI services (traditional EMS and emerging JDM models)Drive standardized NPI operations and business procedures and practices across NPI site network, including PFMEA, QCP, Sustaining-to-NPI continuous improvement, Phase Gate, STD’s library (DFM, DFAA, etc)Joint development of advanced technology roadmaps to meet Client product requirements, assessment, alignment and standardization across NPI site networkLead the Client-Flex factory innovation strategy including automation, digitization/analyticsHere is some of what you’ll need (required)...A Bachelor’s degree in engineering8+ years of progressively advancing NPI, Program Management and/or Business Development experience, experience in JDM and/or sketch-to-scale preferredHere are a few of our preferred experiences...Master's degreeDesign for assembly automationDigital tools for advanced and predictive analytics ​​Job CategoryDesign & TechnologyFlex does not accept unsolicited resumes from headhunters, recruitment agencies or fee based recruitment services. Flex is an Equal Opportunity Employer and employment selection decisions are based on merit, qualifications, and abilities. Flex does not discriminate in employment opportunities or practices on the basis of: age, race, religion, color, sex, national origin, marital status, sexual orientation, gender identity, veteran status, disability, pregnancy status or any other status protected by law. Flex provides reasonable accommodation so that qualified applicants with a disability may participate in the selection process. Please advise us of any accommodations you request in order to express interest in a position by e-mailing: accesibility@flextronics.com. Please state your request for assistance in your message. Only reasonable accommodation requests related to applying for a specific position within Flex will be reviewed at the e-mail address. Flex will contact you if it is determined that your background is a match to the required skills required for this position. Thank you for considering a career with Flex.The information we collect:We may collect personal information that you choose to submit to us through the Website or otherwise provide to us. This may include your contact details; information provided in online questionnaires, feedback forms, or applications for employment; and information you provide such as CV/Resume. We will use your information for legitimate business purposes such as responding to comments or queries or answering questions; progressing applications for employment; allowing you to choose to share web content with others or; where you represent one of our customers or suppliers, administering the business relationship with that customer or supplier."}