{"jobID": "2693101228", "jobLocation": "San_Francisco_CA", "jobTitle": "Operations, Senior Data Analyst", "companyRating": "4.2", "companyInfo": {"Website": "www.collectivehealth.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "160000", "jobDescription": " Collective Health is transforming the way self-funded employers approach their employee healthcare offering and improving the way members experience and interact with their healthcare benefits. The Partner Operations and Collective Care teams are on the frontlines of this transformation and improvement and are looking for a technical analyst to inform and qualify their decisions with data in order to drive sustainable growth.  The Senior Analyst will work on projects that include business intelligence and visualization, trend analysis, program and partner data products and anything else our teams need to scale as rapidly and successfully as possible. The Senior Analyst will be resourceful and passionate; someone who isnt afraid to jump in to figure out the business and operational problems and who has the technical and data skills to find or build a better solution. The Senior Analyst will also work closely with our Analytics and Product teams, influencing our reporting capabilities and insights direction across the company.  To be successful as a Senior Analyst, you must possess and be able to execute on the following: Advanced Analytic SkillsDemonstrated ability to structure ambiguous datasets, analyze and interpret data, and to translate it into meaningful insights and actionable recommendationsMust have advanced Excel proficiency and fundamental understanding of SQL and data systemsApproach internal and external stakeholders with coherent, actionable recommendations appropriate to their business needsContinually provide analytic and business insights to address stakeholder gaps and/or opportunities, and to create valueProactively identify data-driven issues and opportunities, and use the appropriate level analytic support to drive solutionsCommunicationDemonstrate strong interpersonal communication and presentation skillsDevelop best practice for templates and deliverables around the data used to deliver internal and external stakeholder analytic informationCreate compelling dashboards and presentation materials that help to deliver each data-driven storyEducate internal and external stakeholders on analytic methods, shape their thinking and influence decision-makingDemonstrate a flexible approach to communication; adapt messages quickly to the appropriate level or function with poise and polishRequirements:Advanced Excel proficiencyFundamental SQL and Looker understanding preferredData analytics expertise3-5 years experience in a complex, fast-paced, quantitative environment with a high bar for attention to detail and quality of workManagement and/or mentorship experience preferredPrevious experience with healthcare, health insurance, and healthcare systems is a bonusExcellent verbal and written communication skillsFast learner and takes initiativeStrong passion for changing healthcareAbove all, you are self-sufficient, intellectually curious and take ownership for everything you doCollective Health is a technology company working to create the healthcare experience we all deserve. Founded in 2013, our team of engineers, designers, product managers, and actuaries are redefining the $1 trillion market of employer-sponsored health benefits with data-driven and people-focused products. Our complete health benefits solution helps great companies like Activision Blizzard, Palantir, Restoration Hardware, and Pinterest take care of their people by harnessing the power of design and technology. Based in San Francisco, CA, were backed by some of the best investors in Silicon Valley including Google Ventures, Founders Fund, NEA, and Redpoint Ventures. For more information, visit us at https://www.collectivehealth.com.We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.Collective Health"}