{"jobID": "2828378026", "jobLocation": "Sunnyvale_CA", "jobTitle": "Procurement Analyst Intern", "companyRating": "3.2", "companyInfo": {"Website": "www.offthegridsf.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Restaurants, Bars & Food Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "46000", "jobDescription": "Procurement Analyst Intern - CubertAbout Us:Cubert is an Off the Grid product & invention. Easier to transport than a shipping container and less fussy than a tent, Cubert invites the outdoor community inwards with its iconic industrial-artisan design. Cubert gives you the flexibility to create unique mobile experiences in the most unexpected places, setting the stage for limitless possibilities.Off the Grid is a placemaking platform that transforms temporary event spaces into powerful community experiences through its products and services. Our experiences create moments of connection and discovery for our Guests and Hosts that are scalable, modular and authentic to their own visions. We set the stage for discovery, offering public markets in 15 Bay Area locations with over 60 events routinely serving more than 100,000 people each week, as well as turn-key event production, catering, and scaleable employee dining experiences.Position Summary The Procurement Analyst Intern is a part-time position, which drives purchasing and routine data processing to ensure timely & accurate material procurement and cost data availability. The Procurement Analyst intern directly reports into the Cubert Director of Manufacturing Engineering.  The Procurement Analyst is responsible for reviewing and categorizing transactions, fulfilling purchase orders, maintaining cost control systems, building cost models, and ad-hoc reporting. The ideal candidate is diligent; extremely detail oriented, and has an interest in seeking new ways to improve financial processes within a dynamic organization.  We're a growing company that operates seven days a week. Cubert is a work hard play hard office filled with energetic, smart, awesome people looking for the same. This internship is a paid, part-time, non-exempt role which operates out of our Sunnyvale office.Key Responsibilities This position will be responsible for, but not limited to the following:For assigned product lines:Manage order fulfillment process, including inbound order issues, returns and supplier recalls. Working with warehouse operations, manage loads prioritization.Establish and maintain relationships between Cubert and suppliers/contractors.Work cross functionally with internal teams & support staff to communicate status of orders and any issues with suppliers/contractors.Manage requests for and create quotes, following up with associated workflow.Maintain cost control systems and assist with building cost models.Manage inventory levels with specific metric accountability.Engage in team meetings to communicate and coordinate on company initiatives status and execution.Data Analysis using system tools & ad hoc reporting as determined by business needs."}