{"jobID": "2209252665", "jobLocation": "Boston_MA", "jobTitle": "Principal Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.quantumblack.com", "Headquarters": "London, United Kingdom", "Size": "201 to 500 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " QuantumBlack helps companies use data to drive decisions. We combine business experience, expertise in large-scale data analysis and visualization, and advanced software engineering know-how to deliver results. From aerospace to finance to Formula One, we help companies prototype, develop, and deploy bespoke data science and data visualisation solutions to make better decisions. Your Experience You will bring an exceptional academic background in a technical field combined with experience in developing and applying data science methods in a business context. You share our curiosity for new methods and technologies, and our enthusiasm for data science challenges. You have a proven track record in building and leading teams of high-caliber data scientists. What You'll DoHelp to drive the analytical scope and method for projects, including formulating and shaping the modelsUse Math, Stats and Machine learning to derive key insights across various industry sectors including sports, pharma, automotive and high-tech.Lead the data science aspect of multiple engagements at the same timeWork on complex data sets from some of the world’s largest organizationsWork in a multi-disciplinary environment mixing highly skilled people in data science, data engineering and designBuild strong links with the academic world and constantly share ideas and stay ahead of the curve on the latest methodsHelp grow and shape an elite team of world-class data scientistsRequirementsDeep experience in statistical modelling, machine learning and deep learning techniques/frameworksProven record of applying data science methods to business problemsStrong presentation and communication skills, with a knack for explaining complex analytical concepts to people from other disciplinesProgramming experience in at least 2 of the following language: R, Python, ScalaEducated to an MSc or PhD level (preferred) in the field of Computer Science, Machine Learning, Applied Statistics or MathematicsTeam leadership, mentoring and project management skills"}