{"jobID": "2802906744", "jobLocation": "Boston_MA", "jobTitle": "RN Care Manager-Care Management Dept-Boston Medical Center-Per Diem (SEIU)", "companyRating": "3.6", "companyInfo": {"Website": "www.bmc.org", "Headquarters": "Boston, MA", "Size": "1001 to 5000 employees", "Founded": " 1996", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "55", "jobDescription": " Boston Medical Center (BMC) is more than a hospital. It´s a network of support and care that touches the lives of hundreds of thousands of people in need each year. It is the largest and busiest provider of trauma and emergency services in New England. Emphasizing community-based care, BMC is committed to providing consistently excellent and accessible health services to alland is the largest safety-net hospital in New England. The hospital is also the primary teaching affiliate of the nationally ranked Boston University School of Medicine (BUSM) and a founding partner of Boston HealthNet an integrated health care delivery systems that includes many community health centers. BMC provides a full range of pediatric and adult care services, from primary to family medicine to advanced specialty care.  BMC is also committed to our employees, who are a very important piece to who we are. We pride ourselves in providing equal employment opportunity and non-discrimination for all employees and qualified applicants without regard to a person's race, color, gender, age, religion, national origin, ancestry, disability, veteran status, genetic information, sexual orientation or any characteristic protected under applicable law. BMC will make reasonable accommodations for qualified individuals with known disabilities, in accordance with applicable law.RN Care Manager Boston Medical Center  Per Diem  Utilizing a collaborative process, the RN Care Manager will assess, plan, implement, monitor, and evaluate the options and services required to meet an individuals health needs, using communication and available resources to promote quality, cost-effective outcomes. The Care Manager helps identify appropriate providers and facilities throughout the continuum of services while ensuring that available resources are being used in a timely and cost-effective manner in order to obtain optimum value for both the patient and the reimbursement source. The RN Care Manager is dedicated to handle the increased volume and to support the overall care management process and the department.Minimum Qualifications:Graduate from an accredited Associates or Bachelors of Science in Nursing degree program required; BSN preferred.Licensed to practice professional nursing as a Registered Nurse in the Commonwealth of Massachusetts.A minimum of 3-5 years recent clinical experience required, and 1-3 years of recent acute, Inpatient Care Management experience required.Duties and Responsibilities: (these are a general summary and not all inclusive)Ability to understand confidentiality and the legal and ethical issues pertaining to patient health; understand medical terminology, how to obtain an accurate history; establish treatment goals; establish working relationships with referral sources; develop treatment plans.Knowledge and understanding of methods for assessing an individual's level of physical/mental impairment; understand the physical and psychological characteristics of illness; ability to assist individuals with the development of short- and long-term health goals.Ability to understand the requirements for prior approval by payer; be able to evaluate the quality of necessary medical services; be able to acquire and analyze the cost of care; understand the various health care delivery systems and payer plan contracts; be able to demonstrate cost savings.Ability to understand case management philosophy and principles; apply problem solving techniques to the care management process; document care management services; understand liability issues for care management activities.Knowledgeable on how to access and evaluate the available resources to meet a client's needs; able to develop new resources.Excellent interpersonal, verbal, and written communication and negotiation skillsStrong analytical, data management and PC skills.Current working knowledge of discharge planning, utilization management, case management, performance improvement, and managed care reimbursement.Understanding of pre-acute and post-acute venues of care and post-acute community resources.Strong organizational and time management skills, as evidenced by a capacity to prioritize multiple tasks and role components.Ability to work independently and exercise sound judgment in interactions with physicians, payers, and patients and their families.An Equal Opportunity / Affirmative Action Employer. Females, minorities, veterans, and persons with disabilities are strongly encouraged to apply."}