{"jobID": "2794776073", "jobLocation": "San_Mateo_CA", "jobTitle": "Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.ipsy.com", "Headquarters": "San Mateo, CA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "80000", "jobDescription": " ipsy is looking for an enthusiastic Data Analyst to join our Analytics team. Candidates should have strong intellectual curiosity with the desire to go deep and understand the core drivers of customer behavior. Key Responsibilities:Report to Director of Analytics and support stakeholders in business verticals with high quality analysis and actionable recommendations.Effectively present analysis that gets to the heart of the most important business questions facing ipsy.Build and manage models to forecast key company metrics and to better understand the underlying drivers of their performance.Design and analyze A/B tests to drive KPI improvements.Develop dashboards to inform business decisions with an emphasis on automation and scalability.Partner with Engineering to optimize data tracking/quality and drive data warehouse improvements.Qualifications:Minimum 2 years of experience performing analysis for an ecommerce or internet company. Experience analyzing paid acquisition preferred.Great communicator with strong business acumen and interpersonal skills.Bachelors or Masters in Math, Engineering, Statistics or other quantitative field, with track record of academic excellence.History of deriving actionable insights from complex datasets.Solid understanding of Statistics with ability to explain statistical concepts to non-technical audiences.Excellent SQL and data warehouse skills. Experience writing complex queries on large data sets.Expertise with data visualization and dashboard tools such as Tableau, Looker, or equivalent.Experience with predictive modeling and scripting languages a plus.About us: ipsy was founded with one singular mission: to inspire individuals around the world to express their unique beauty. Thats how the ipsy Glam Bag came to life. With five products personalized for youplus articles, videos, and more on ipsy.comyoure free to try new things and express who you are. ipsy Shopper takes our mission to the next level by making beauty more accessible, rewarding, and liberating than ever before. And with ipsy Gen Beauty, Open Studios, and all the creator content that we post each day, our intention has remained the same: to give every individual the tools to form their own definition of beauty. With over 3M members and 8K digital content creators in our community, and generating over half a billion monthly content views, were just getting started.  ipsy is headquartered in the Bay Area with an office in New York City and a studio production and editing facility in Los Angeles. The company achieved profitability in its first year and raised a series B round of $100M with Sherpa Capital and TPG in 2015. We owe all of our success to our inspiring, energizing employees who make exceptional things happen every single dayfearless thinking, tenacity, and a pioneering spirit push us forward. From marketing and media to engineering and operations, we are united in our goal to democratize beauty, making it accessible and affordable for everyone and fearlessly representing individuality and inclusivity. We dream. We empower. We create. And we have great fun doing it together.  Take a look at careers.ipsy.com for some exciting opportunities to join our team. And check us out at ipsy.com, @ipsyofficial on Snapchat, and @ipsy on Facebook, Instagram, YouTube, and Twitter."}