{"jobID": "2827486806", "jobLocation": "Belmont_CA", "jobTitle": "Store Manager II", "companyRating": "3.6", "companyInfo": {"Website": "www.td.com", "Headquarters": "Toronto, Canada", "Size": "10000+ employees", "Founded": " 1855", "Type": " Company - Public (TD) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Chase, BB&T, SunTrust"}, "estimatedSalary": "76000", "jobDescription": "The Store Manager II develops and manages an account portfolio including: deposits, loans, fees and expenses (commercial, small business and consumer). The Store Manager II leads, coaches, and motivates Store team to deliver legendary Employee and Customer Experience while achieving shareholder value through sales management.  This job coaches and develops store team ensuring on-going training, performance management, and talent development and is responsible for overall performance of the store through all Store Sales, Service and Supervisory Personnel. The Store Manager II promote TD brand through active leadership within the community. This job is SAFE Act Certified and takes residential mortgage loan applications AND offers or negotiates terms of residential mortgage loans for compensation or gain.  At the discretion of the leadership of the Market, this position may be asked to manage more than one location within close proximity to one another. Job Requirements Generally manages a mid-size Store, according to the Bank’s criteria, whose transactions and Customer needs vary in complexity.Can identify the need to negotiate and influence within the business line and recommend solutions. May require assistance in consistent, broader implementation within the Store, Business Partners and Region. Identifies when change may be needed; may require assistance in planning, strategizing and in executing change. Has credibility within the Store, with Business Partners and to some extent, across the Region. Builds strong Business Partner relationships through routine contract and review of expected business results.Holds high standards for self and others.Identifies when action is needed; may need assistance in implementing actions items.Leads sales strategy and planning efforts and creates sales and promotional initiatives to reach performance goals.Schedules regular informal and formal coaching sessions with team members. Coaches team members on identifying sales opportunities. Qualifications 4 year degree or equivalent experience.3-5 years related experience required.Strong supervisory or leadership experience.Excellent verbal and written communication skills.Demonstrated sales management ability.Successful Certification as a Consumer Lender required and Small Business lending experience preferred.Demonstrated ability to manage competing priorities, strategically aligning efforts and activities to meet Store goals and objectives.Demonstrated knowledge of Bank product lines and services as well as an understanding of Store operations and security.Demonstrated presentation, analytical, interpersonal and collaborative skills with all-level internal and external Customers.Knowledge of Microsoft Office Suite.Notary License (Preferred).Proven business development skills, including ability to conceptualize and implement strategies. Hours Flexible Travel % Not Applicable InclusivenessAt TD, we are committed to fostering an inclusive, accessible environment, where all employees and customers feel valued, respected and supported. We are dedicated to building a workforce that reflects the diversity of our customers and communities in which we live in and serve, and creating an environment where every employee has the opportunity to reach her/his potential.  If you are a candidate with a disability and need an accommodation to complete the application process, email the TD Bank US Workplace Accommodations Program at USWAPTDO@td.com . Include your full name, best way to reach you, and the accommodation needed to assist you with the application process.  EOE/Minorities/Females/Veterans/Individuals with Disabilities/Sexual Orientation/Gender Identity.*Province/State (Primary) Massachusetts City (Primary) BelmontAdditional Cities in Primary State Belmont"}