{"jobID": "2707757396", "jobLocation": "San_Jose_CA", "jobTitle": "Account Manager/Purchasing Trainee", "companyRating": "3.5", "companyInfo": {"Website": "www.malabs.com", "Headquarters": "San Jose, CA", "Size": "501 to 1000 employees", "Founded": " 1983", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " SYNNEX, Ingram Micro, Foxconn Technology"}, "estimatedSalary": "50000", "jobDescription": "As we are setting our goals for the continuous growth of the company, we have needs for goal-orientated and highly motivated people to join our company for the success! We have the immediate openings for those who are willing to start from the sales field but have strong interests in the supply chain field. The position is based at our Headquarter San Jose, California office. As an Account Manager/ Purchasing Trainee you will be a total solution provider. Responsibilities:New business prospecting and development; including develop new customers on domestic or international basis.Generating new customer and sales leads, setting-up accounts and controlling credit limits;Developing relationships and maintaining continuous contact with existing customers, getting existing customers’ feedbacks and assisting with resolution of customer issues or complains;Making the discretion judgment, suggesting and promoting products to customers, working with manufacturers and Product Mangers to promote PC components and systems, and to improve the market share and generate the large amount of the business, as well as participate in the trade shows for promoting new products;Quoting and negotiating price with customers, negotiate price through PM with manufacturers, and cooperate with purchasing and marketing departments to set up promotional programs or bundles sales programs to meet customer needs;Participating in inventory allocation for products, coordinating with customers on payment, delivery schedule, RMA and related issues by phone or emails etc;business operation to stay abreast of company products and system solutions as well as make the frequent independent judgment.Receiving company periodical sales training and special technical training to attain sound product knowledge, technical knowledge, and the deep understanding of the competitors; Getting ready to have the further development in the purchasing/supply chain tracks. Successful Account Manager/ Purchasing Trainee are goal-oriented, highly motivated, analytical and effective communicators. Qualifications:A minimum of a Bachelor’s degreeAbility to multi-taskGreat time management skills and attention to detailGoal orientatedQuick learner and great working attitudeExcellent communication skills and negotiation skillsRequire the deep knowledge of the competitors’ business operation and PC related knowledge or technical knowledgeBe able to make the frequent independent judgmentBilingual is a big plus"}