{"jobID": "2807259484", "jobLocation": "Emeryville_CA", "jobTitle": "Research Intern - Fall", "companyRating": null, "companyInfo": {"Website": "www.pixar.com", "Headquarters": "Emeryville, CA", "Size": "501 to 1000 employees", "Founded": " 1986", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " DreamWorks Animation, Blue Sky Studios, Sony Pictures Entertainment"}, "estimatedSalary": null, "jobDescription": " Pixar’s Research Department is hiring Spring/Summer interns for our Emeryville, CA studio where you will assist in the creation, implementation and transfer of new technology related to computer graphics filmmaking.As a Research Intern, you will either be asked to work on a solution for an unknown problem or to implement an existing paper or technique that we’ve already developed.  Positions are available in the following areas: Machine LearningRendering (Physically Based and Stylized)Physical Simulation (flesh, cloth, fluids, etc.)Geometry ProcessingRESPONSIBILITIES:Assist in the development, prototyping, and testing of new computer graphics algorithmsParticipation in transfer of new technology to rest of the studioRapidly implement and test new algorithmsQUALIFICATIONS:1+ years of research experience desirableExcellent problem solving skillsDeep understanding of mathematical algorithms and computer graphicsOutstanding communication skills and ability to work well with a wide range of personality typesSolid software engineering skills with expertise in C, C++, and PythonPrior experience in or knowledge of one of the following areas preferred: Maya plugin development, GPU programming, machine learning, physical simulation, or geometry processingELIGIBILITY:Must be at least a junior in college working towards a Bachelor’s, Master’s or PhD; Recent grads who are within one year of graduation are also eligible to applyMust provide a short personal statement (200 words or less) clarifying which area is of interest to you -- Machine Learning, Rendering, Physical Simulation or Geometry Processing -- and your preference to research a problem or implement a technique during your time as a Research Intern at PixarMust be available to work from September 24, 2018 - December 14, 2018SUBMISSION PROCESS AND APPLICATION MATERIALS:Apply online at pixar.com – no submissions will be accepted via mail or in personAttach a single .PDF file containing your cover letter, resume, personal statement clarifying your preference in doing research or implementationDue to the large number of submissions, we are unable to respond to requests for updates. You will receive notification of our receipt of your application and when the hiring process is completedAPPLICATION DEADLINE: Sunday, July 22, 2018  Pixar is an Equal Opportunity Employer. | Follow us on Twitter @PixarRecruiting."}