{"jobID": "2820990748", "jobLocation": "Redmond_WA", "jobTitle": "Data Scientist (R, Sas/ Python)", "companyRating": "3.6", "companyInfo": {"Website": "www.tcs.com", "Headquarters": "Mumbai, India", "Size": "10000+ employees", "Founded": " 1968", "Type": " Company - Public (TCSN) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Accenture, IBM, Infosys"}, "estimatedSalary": "112000", "jobDescription": " Data Scientist (R, SAS/ Python)  Detail of Requirement  RoleData Scientist (R, SAS/ Python)  Mandatory Technical Skills• Hands on experience with analytical data models, predictive analytics, propensity model and statistical tools. Must have working experience either in R, SAS or PythonStrong experience in Exploratory Data Analysis&Insights; GenerationStrong data and web analytical skills and working experience in sameStrong analytical skills with the ability to collect, organize and analyze information with attention to detail and accuracyWorking experience with data preparation, aggregation&transformation; for in-depth analyisShould have Experience in Cosmos and ScopeGood SQL&Excel; skills to troubleshoot data mismatches and comparisonMust have experience in Big data environmentExperience with PowerBI is a plusShould have experience with Agile and scrum methodologies Desirable Technical Skills• Experience with Adobe SiteCatalyst, DAX (Digital Analytix) or similar enterprise analytics system is a plus Experience with forecasting models in a big data environment is a big plus Mandatory Functional Skills• Excellent Communication skills Excellent Presentation SkillsStrong analytical skillsExcellent troubleshooting and problem solving skillsAbility to work in a fast-paced, agile environmentExperience&Willing; to be working within a geographically-dispersed teamExperience working across multiple groups and teamsHeavy customer facing experience. Should be able to work in agile manner with the customer&stakeholders;Strong Business Accumen Desirable Functional Skills• Previous experience working with Microsoft. Passion to drive improvement in the overall customer experienceCustomer focusedBe self-critical and have an accountable work approach Total Experience Required7+ years"}