{"jobID": "2745831878", "jobLocation": "Medford_MA", "jobTitle": "Administrative Coordinator - Student Services Center, School of Arts and Sciences", "companyRating": "3.8", "companyInfo": {"Website": "www.tufts.edu", "Headquarters": "Medford, MA", "Size": "1001 to 5000 employees", "Founded": " 1852", "Type": " College / University", "Industry": " Education", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "51000", "jobDescription": " The Dean of Student Affairs Office supports dynamic co-curricular engagement for all undergraduate and graduate students within the Schools of Arts & Science and Engineering at Tufts. As part of the larger Division of Student Affairs (Fraternity and Sorority Life, the Group of Six, Residential Life and Student Life, Health and Wellness, Student Accessibility Services, Student Success and Advising) the dean’s office coordinates support and resources for individual students, facilitates community engagement, promotes and upholds standards of conduct, supports programs and activities to advance student leadership, and works cooperatively with members of the faculty and senior leadership to ensure the successful achievement of institutional and divisional goals, vision, and values.  Reporting to the Senior Associate Dean of Student Affairs for the Schools of Arts and Sciences, Engineering, and Museum of Fine Arts, the Administrative Coordinator provides comprehensive administrative support for the Dean of Student Affairs Office. The Coordinator will handle complex and confidential situations and requests and serve as a highly visible front-line resource for students, families, faculty, and other campus departments around issues and concerns involving individual students, student groups, and the larger campus community. They will oversee the daily operation of the Dean of Student Affairs Office, evaluate workflow and productivity, manage the activity of the front desk and several graduate interns, and provide the Dean of Student Affairs and Senior Associate Dean of Student Affairs with advanced administrative support related to scheduling, correspondence, and expenditures. The Administrative Coordinator will also help manage the calendars and schedules of other members of the Dean of Student Affairs Office, coordinate meetings and events, and oversee the annual planning calendar for the Division of Student Affairs.  They Administrative Coordinator will provide administrative support for the major processes and committees in Student Affairs, including updating the records for conduct cases and hearings, and managing the personal and medical leave and re-entry processes, the appropriate maintenance of student records under FERPA, and standing committees within and beyond the Division of Student Affairs. The Administrative Coordinator will also coordinate budgets for the Division of Student Affairs in coordination with the Dean and will carefully monitor accounts, track expenditures, and troubleshoot problems for the Dean of Student Affairs Office. They will gather data, conduct research, and draft departmental reports related to budgets and expenses as needed. Basic Requirements:Bachelor’s degree and 3 years of experience in administrative support required OR an Associate’s degree and 5 years of experience in administrative support required.Advanced knowledge of Microsoft Office suite, including word processing, editing and graphics functions, spreadsheet and database knowledge.Bookkeeping or basic accounting knowledge.2 years experience in using/managing electronic databases/records.Superior organizational skills and problem-solving skills.Excellent oral and written communication skills.Demonstrated ability to manage multiple projects/tasks with a high level of accuracy, confidentiality, and attention to detail.The successful candidate will possess a good sense of humor, strong interpersonal skills and a dynamic professional presence.Preferred Qualifications:Experience working in a busy, high traffic office environment is preferred.Interest and experience in digital media communications preferred.Experience working with Maxient or similar electronic record keeping software a plus. An employee in this position must complete all appropriate background checks at the time of hire, promotion, or transfer. Equal Opportunity Employer – minority/females/veterans/disability/sexual orientation/gender identity. "}