{"jobID": "2808791403", "jobLocation": "San_Jose_CA", "jobTitle": "Intern for R&D; Science at ProteinSimple", "companyRating": null, "companyInfo": {"Website": "www.bio-techne.com", "Headquarters": "Minneapolis, MN", "Size": "1001 to 5000 employees", "Founded": " 1976", "Type": " Company - Public (TECH) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job Details  Job Location: San Jose - San Jose, CA  Salary Range: Undisclosed  Description General Description: The R&D-Science; team at ProteinSimple is fast-paced and innovative, with a focus on developing unique, pioneering tools for advancements in protein science. This position is for an internship in the R&D; Science group during the summer and he/she will gain experience working in a biotechnology environment that develops new technologies for protein analysis. This is a great opportunity to acquire hands-on experience in product development and combines exposure to scientific and engineering development activities. This person will also collaborate with the broader Product Development team at ProteinSimple on other projects as designated by the supervisor. Key responsibilities:Perform experiments and in-depth data analysis using novel protein analysis platformsDesign and execute experimental plans with guidance from supervisorObserve and meticulously record all details related to projectsPresent findings in a group settingAttend weekly meetings with R&D; Science teamQualifications Work requirements Strong technical skills, including troubleshooting, diagnosing failures, and problem solvingAttention to detail and data analysis skills are requiredFollow procedures precisely and generate analytical data consistentlySelf-motivated individual with ability to work independently and collaborativelyAbility to quickly learn and apply new skills and proceduresExcellent organizational and communication skills, both verbally and in writingProficiency in Excel and PowerpointEducation Requirements: High School Diploma or equivalent.  Work requirements Strong technical skills, including troubleshooting, diagnosing failures, and problem solvingAttention to detail and data analysis skills are requiredFollow procedures precisely and generate analytical data consistentlySelf-motivated individual with ability to work independently and collaborativelyAbility to quickly learn and apply new skills and proceduresExcellent organizational and communication skills, both verbally and in writingProficiency in Excel and PowerpointEducation Requirements: High School Diploma or equivalent."}