{"jobID": "2737969589", "jobLocation": "San_Jose_CA", "jobTitle": "Sr Manager Marketing", "companyRating": "3.4", "companyInfo": {"Website": "www.tomtom.com", "Headquarters": "Amsterdam, Netherlands", "Size": "1001 to 5000 employees", "Founded": " 1991", "Type": " Company - Public (TOM2) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Garmin, Nokia, Google"}, "estimatedSalary": "133000", "jobDescription": "Regional Marketing Communications Manager North America TomTomAbout TomTom TomTom created the easy-to-use navigation device, one of the most influential inventions of all time. Since then, we have grown from a start-up, into a global technology company.  Our software and navigation technologies power over hundreds of millions of applications across the globe. This includes industry-leading location-based products and mapmaking technologies, embedded automotive navigation solutions; innovative personal navigation devices and apps, and advanced telematics fleet management and connected car services.  We continue to shape the future, leading the way with autonomous driving, smart mobility and smarter cities. Job Brief There’s never been a more exciting time to join TomTom. That’s because we are transforming fast, and so is our story. That’s why we’re looking for an experienced marketing communications professional to join our energetic and ambitious team.  The Marketing Communications Manager, North America role will will coordinate all marketing communications activities, reporting to the VP Corporate Communications at our head office in Amsterdam. The Netherlands, and with her team of experts around the globe, to tell the TomTom story across external channels.  We’re part of the TomTom global marketing organization – a diverse group of experts working towards a shared goal: to service our business and people, clearly communicating one TomTom brand across all our marketing activities. Key ResponsibilitiesWork closely together with Marketing Communications teams and the Marketing lead by business to align on activities and budgets, as well as with Marketing Operations for process, overall calendar and traffic/workload alignmentPartner with the local businesses and provide input and feedback to Marketing Leads for the marketing plan and calendar, as well as providing market insights to the organizationProject-manage North America marketing communications activities whereby all activities/deliverables need to reflect the ONE TomTom Brand, and being consistent across all local touchpointsMeasure the performance of the communications, campaigns and events to improve quality i.e. create a post event status reports/PR coverage to determine lessons learnedBeing the local voice, representing regional, culture etc to ensure the strategy and messaging resonates in the regionPR-specific responsibilities: Press releases, media relations, PR agency management, secure speaking opportunities, internal communications, networking events, and social media North America communications: Translate the global communications strategy into local market activities to ensure the message resonates in the market. Brief the local PR agency to develop and execute the PR strategy for the regionMedia/PR: Manage local media, in close collaboration with Corporate Communications and the local PR agency. Interact, develop and nurture press relationships to effectively promote TomTom brand identity and awarenessInternal communication: Coordinate and provide corporate information to employees in North America, including all-hands meetingsCommunications-specific responsibilities: Manage digital advertising campaigns, social media, campaign landing pages, collateral and External and internal events, such as exhibitions, trade shows, seminars, Tech Days, marketing demos (e.g. VR demo), hackathons Communication: Lead, communicate, and collaborate across external partners and internal staff - be a guardian of the event brand to ensure seamless delivery of the overall experience, event vision, and objectivesEvent management: Working closely with the head of Events in Amsterdam, successfully organize events within budget execution in order to support the TomTom marketing objectives. Actively control and follow-up on events, based on participants feed-back and actual expenditureSupplier management: Manage all internal and external resources/parties to guarantee successful execution the eventsRequirementsRelevant PR and marcoms experienceStrong technology background (gained from working for a tech company)Experience working with tech mediaSelf-starterExcellent writing skillsA global view – and the cultural sensitivity that goes with itThe ability to work fast, and adapt fast, under pressureBachelor’s degree in marketing, PR or a related field preferred"}