{"jobID": "2831241675", "jobLocation": "Brooklyn_NY", "jobTitle": "Montessori Primary (3-6) Lead Teacher", "companyRating": null, "companyInfo": {"Website": "www.montessoribrooklyn.com", "Headquarters": "Brooklyn, NY (US), NY", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "C'E Montessori is a private Montessori Preschool located on South 3rd street and Bedford Avenue in Williamsburg. We are in search of two amazing teachers to fill two available spots for the coming year. Please send a resume and cover letter if you think you are right for the position, we look forward to hearing from you. Let us know which of the two positions you want to be considered for.  At C'e Montessori we are working to create a school environment that is inclusive, child driven, technologically advanced and exudes positive community culture. We want our applicants to be excited to join a new and eager team that is ready to make a mark on the students that we teach and the educational community in Brooklyn. This job offers huge opportunities for personal and professional growth, a voice in shaping the team and school and access to school administration.  Lead Primary Montessori Teacher (3-6)  The ideal candidate for this position is Montessori trained and has experience in the Primary Montessori classroom. They are comfortable teaching any lesson in the environment, can work positively with a co-lead and help train the assistants as they become more experienced in Montessori and our particular school setting. This position can be part time, but we wold prefer to hire a full-time Montessori teacher.  Education & Experience  A minimum of a Bachelor's Degree  AMI/AMS Credential in Early Childhood  Extensive knowledge of the Montessori Method  3-5 years experience in preschool environments, Montessori environment is a plus  Great organizational, computer, and administrative skills  Bi-lingual Spanish is preferred."}