{"jobID": "2796022033", "jobLocation": "Waltham_MA", "jobTitle": "Business Services and Outsourcing Senior Accountant", "companyRating": null, "companyInfo": {"Website": "www.rodmancpa.com", "Headquarters": "Waltham, MA", "Size": "1 to 50 employees", "Founded": " 1961", "Type": " Company - Public", "Industry": " Accounting & Legal", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " PURPOSE:The business services and outsourcing senior accountant role is responsible for applying their technical skills, organizing and managing client assignments while meeting client's expectations. This professional will run multiple clients engagements at any one time, and will perform duties such as Controller-to-go services which includes, maintaining the full general ledger, journal entries, budgets, client consulting. Also, the professional will perform QuickBooks implementations, providing ongoing QuickBooks support, assist clients with developing and maintaining internal procedures/processes and prepare and present on-going QuickBooks classes/webinars etc. This role is also responsible for overseeing and reviewing staff work on engagements.RESPONSIBILITIES:• Know and understand the reason for the firm's policies and procedures• Assist our professional team in performing accounting services for our clients• Assist our professional team in preparing workpapers, trial balances, depreciation schedules, entering data for computer applications, and preparing engagement correspondence• Establish effective work schedules• Build and nurture strong working relationships with clients• Work as an effective team member to complete project components and assignment tasks• Perform duties at a senior level for clients on a on-going basis.• Keeps abreast of accounting software (including Quickbooks), trends, new features to be able to train internal team and external clients.• Complies with federal, state and company policies, procedures and regulationsJOB QUALIFICATIONS:• Minimum 5 years relevant experience, preferably at a public accounting firm• Bachelor's degree in relevant field, required.• Strong understanding of accounting concepts and business acumen, required.• Strong attention to detail and organizational skills required• Proficient in QuickBooks• Team player with a positive approach• Pursuing or passed CPA certification preferred• Tax experience, preferred.• Creative problem-solving ability• Strong interpersonal and relationship building skills• Strong verbal and written communication skills"}