{"jobID": "2794940316", "jobLocation": "New_York_NY", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.ribbon.co", "Headquarters": "Long Island City, 061", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Media", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Our MissionOur mission is to level the playing field for buyers, sellers and realtors, and deliver experiences worthy of the magnitude of the transaction itself.Our SolutionRibbon was carefully designed to level the playing field and to create a predictable path for buyers, sellers and realtors. The Ribbon platform utilizes technology, intuitive software and access to capital to equip consumers and realtors with the power of a guaranteed home transaction. For the first-time, theres now a platform to remove financing, appraisal, inspection and home sale contingencies to make the transaction certain. Everything known upfront and designed for the user.About RibbonRibbon was started in 2017 by a group of passionate technologists, consumer-centric financial innovators and real estate experts. The team has built market leading companies and overseen the purchase and sale of over 10,000 homes throughout their careers. We come from notable brands such as: LendingClub, Twitter, Spotify and Invitation Homes. Ribbon raised a seed financing round from top tier venture capitalist firms including: Greylock, NFX, Bain Capital Ventures and NYCA -- investors behind incredible brands such as Trulia, Airbnb, LinkedIn and DocuSign.The Company has also secured real estate capital to enable over $2 billion in transactions in 2018. Ribbon is based and built in New York, NY. We just launched our first market in Charlotte, NC, which is one of the fastest growing real estate markets in the country. We have an ambitious plan to scale to several new markets in the very near-term. Learn more here: www.ribbonhome.comYour Focus Build production grade models on large-scale datasets to optimize marketing performance by utilizing advanced statistical modeling, machine learning, or data mining techniquesLeverage models to address key growth challenges such as cross-channel spend allocation, response modeling, customized contentDevelop internal and external data sources to be used in propensity modeling and predictive analyticsConceptualize, design and build data-fueled insights to help improve analytics for prospects and customersWork closely with other team members and the business to further develop metrics, KPIs, and insight that provides performance improvement Your Skills Deep understanding of numbers and a strong business sense for growth driversTechnical competence to perform more advanced analyticsCoding skills (such as Python) are a plusAnalytics tools experience (such as Pandas, R or SQL)Experience in performing analysis with large datasetsExperience in collaborating closely with research to design novel analytical approaches in response to loosely defined problemsExperience in driving real world product or feature decisions based on your analysisYour ValuesResourceful: you cleverly look for solutions and you do more with less because youre capableIntegrity: you know that doing the right thing is not always the easiest or most rewardingBe an owner: you look to solve for inefficiencies and youre willing to figure things out yourselfBreak things: you learn by doing with speed and precision and sometimes you mess upOpen: you welcome alternative and creative views with an open mind and heartNo I in team: you believe that no one person is greater than the sum of all parts to a teamWhat We OfferCompetitive compensation: we offer competitive compensation for our talented teamGenerous equity: you deserve a fair share for the value you put into building the companyFlexible vacation: take the right balance of personal days off so you can always be fully onHealthcare coverage: were on the hook for most of your medical, dental, and vision insuranceTeam off-sites: we like to spend quality time together to continue to learn and celebrateTeam lunches: a healthy team is a well fed teamEducation subsidies: there is no such thing as too much learningLearn more here: www.ribbonhome.comRibbon is an equal opportunity employer. We welcome and consider all applicants without regards to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, sexual orientation, gender identity or other protected status under all applicable laws, regulations, and ordinances."}