{"jobID": "2447693105", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Analyst Manager", "companyRating": null, "companyInfo": {"Website": "www.oakwoodsearch.com", "Headquarters": "Denver, CO", "Size": "1 to 50 employees", "Founded": " 2013", "Type": " Private Practice / Firm", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "OUR CLIENT Headquartered in Los Angeles, our client has more than 30 years of history serving multi-ethnic customers across the United States. It has over $13 billion in total assets. It operates more than 60 full-service branches in California, Washington, Texas, Illinois, New York, New Jersey, Virginia, Georgia and Alabama. They specialize in business banking products for small and medium-sized businesses, with an emphasis in commercial real estate and commercial lending, SBA lending and international trade financing. They have grown alongside their customers and take pride in fostering growth within their communities. ROLE The right person for this role will be able to build and lead the Data Analysis team. Their overall responsibility will be to learn, investigate and gain mastery of the data needed for model development, model risk management and reporting. This will come through an excellent ability to ask insightful questions and work effectively with many lines of business throughout the bank. Some of the day to day responsibilities will include: Replicate every step of ETL (extracting, transforming and loading) of the data process in the model developmentInvestigate data quality and integrityDraft technical report of findingsImprove data quality and assure data integrityAssist the Model Validation team in all aspects of dataImprove understanding of data in the Department of Model Risk ManagementSKILLS AND EXPERIENCEBachelor or Master’s degree in computer science, database management, or related equivalent experience.Experience in working with data in a bankExperience working in a bank with assets between $10B and $30BExperience managing and training junior staffHighly organized, does not let things slip through the cracks www.oakwoodsearch.com"}