{"jobID": "2766469659", "jobLocation": "San_Diego_CA", "jobTitle": "Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.encorecapital.com", "Headquarters": "San Diego, CA", "Size": "5001 to 10000 employees", "Founded": " 1953", "Type": " Company - Public (ECPG) ", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " GC Services, Asset Acceptance Capital"}, "estimatedSalary": "58000", "jobDescription": "Job DescriptionJob Description: The Data Analyst is primarily responsible for utilizing tools such as SAS, Excel, Access, and SQL Server to perform in-depth analysis on portfolios to be valued. The analyst will load portfolios into our database and preserve its data integrity. By spearheading innovative projects, the analyst will develop new processes that drive business objectives and increase operational efficiencies. ​ Responsibilities:Verify, extract, transform, append, and standardize data from disparate data types and sources to meet system/business requirementsCreate and monitor reports to determine data quality and completeness, identify critical issues, trends, opportunities.Follow up on all open issues with the appropriate parties (banks, technical support)Pinpoint and analyze relevant data to support business initiatives (e.g. profitability, performance and variance analysis).Communicate key findings with other team members through oral or written presentations.Design, develop, and maintain process improvements to automate current and future processesAssist with development of new data warehousing architecture and analyze proposed design changes to ease future data migrationQualifications:Education: Required: Bachelor; Quantitative field Work Experience: Required: 0 - 2 years’ experience in an ​analytical / quantitative role, or equivalent education and experience. Preferred Skills: Technical — Proficiency with MS Office including Excel and Access ; ability to write, analyze, and develop SQL and SAS code. Experience working with large relational databases.Critical thinking – An analyst must be able to derive insights and conclusions from the data and the trends within the data.Communication – Data analysts collaborate with a variety of audiences with a wide range of technical backgrounds. An analyst must be able to effectively communicateCollaboration – A data analyst is often called on to work with an array of different teams and departments. Analysts must be flexible and dynamic in their approachPosition TitleData AnalystLocationCA - Mission ValleyCategoryOperations Decision SciencePosition StatusFull time"}