{"jobID": "2818469487", "jobLocation": "Teterboro_NJ", "jobTitle": "CL601 Captain", "companyRating": null, "companyInfo": {"Website": "www.worldwidejet.com", "Headquarters": "Phoenix, AZ", "Size": "51 to 200 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Transportation & Logistics", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "WORLDWIDE JET CHARTER (CL601 Captain (Salary $121,500) - No Relocation Required)22601 N. 17th Ave., Suite 220 Phoenix, AZ 85027Tel: NO PHONE CALLSFax: noneEmail: hr@worldwidejet.comONLY QUALIFIED AND EXPERIENCED CAPTAINS NEEDED (3 Opern Positions) We are transitioning from 3 pilots per airplane to 4 pilots per airplane and we are immediately seeking three qualified CL601 Captains to join out team.SCHEDULE: 15/13 hard schedule (Home basing for commuters) $121,500 base salaryCrews keep all hotel and airline miles/points Work over pay if not back home by 0300 after the end of day 15 100% company-paid Health, Dental, Vision insurance plans for employees 401(k) company matching PerdiemWWJ pilots average 500 hours a year. WWJ hires pilots that can handle pressure, manage high workloads, work efficiently and maintain a positive attitude. Our pilots want to be a part of the mission, requiring pilots to put the needs of customers front and center. WWJ provides a workplace that promotes from within, valuing hard work and dedication to the mission. REQUIREMENTS:ATP license with CL600 typeMust meet ARGUS, Wyvern, EJM, and Sentient PIC times.4000hrs TT, 3000hrs PIC, 3000hrs ME, 2000hrs ME PIC, 250+ hrs on Type.FAA First Class MedicalValid US PassportExcellent customer relations skillsVerifiable professional references No significant accidents, incidents or enforcement action in the last 3 yearsProficient in computer operations and software (internet, email, ipads, etc.) Strong communication skills, both verbal and writtenAbility to perform service operations outside and in extreme temperatures and inclement weatherAble to managing rest, performing red-eye flights & ASAP flights when needed and rested Ability to perform medium to heavy liftingTravel extensively and sit for extended periods of timeEducation and training to obtain required license and certificatesCommunicate clearly and timely up and down the chain of command.One year training agreement (one-time) for recurrent type training. Two year training agreement (one-time) for initial type rating. Must be able to pass a CL-600 initial/recurrent courseMust be able to pass pre-employment drug screeningPRIA background check (to include any incidents/accidents)Credit checkDMV check with valid driver's licenseEmployment verificationCriminal history and fingerprint checkCPR/AED/First Aid Certification (during indoc) BENEFITS:Medical insurance 100% Employer-sponsored premium for Employee on select medical plan, Dental insurance, Life and Accidental Death & Dismemberment insurance 100% Employer-sponsored premium for Employee's for 50K and the option to add additional life and AD&D; up to $500K or five times your basic annual earnings, 401 (K) Retirement Savings Plan, Monthly Phone Allowance, Monthly Uniform Allowance, Daily Per diem, work over pay bonuses, and end of year performance bonuses. DISCLAIMER: The requirements and specifications listed above are intended to describe the general function and level of personnel assigned to this classification. It is not intended to limit any additional responsibilities, duties and/or skills that may be required of the candidate. "}