{"jobID": "2656365705", "jobLocation": "New_York_NY", "jobTitle": "Assessment Nurse", "companyRating": null, "companyInfo": {"Website": "www.metroplus.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1985", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Assessment NurseJob Ref: 38175 Category: Utilization Review and Case Management Department: MANAGED LONG TERM CARE Location: New York, NY Job Type: Regular Employment Type: Full-Time Hire In Rate: $90,000.00 Salary Range: $90,000.00 - $90,000.00Marketing StatementMetroPlus Health Plan provides the highest quality healthcare services to residents of Bronx, Brooklyn, Manhattan, Queens and Staten Island through a comprehensive list of products, including, but not limited to, New York State Medicaid Managed Care, Medicare, Child Health Plus, Exchange, Partnership in Care, MetroPlus Gold, Essential Plan, etc. As a wholly-owned subsidiary of NYC Health + Hospitals, the largest public health system in the United States, MetroPlus’ network includes over 27,000 primary care providers, specialists and participating clinics. For more than 30 years, MetroPlus has been committed to building strong relationships with its members and providers to enable New Yorkers to live their healthiest life. Position Overview The Assessment Nurse if the first person that the potential member/member and family meet from the MLTC & FIDA programs. The Assessment Nurse conducts the UAS assessment to determine the level of care needed to support applicants/members in the own homes. The incumbent will complete the UAS assessment tools and makes the determination if an applicant is appropriate for the MetroPlus MLTC program. The Assessment Nurse also completes the UAS assessment tool on members already enrolled in the MLTC & FIDA programs upon program enrollment, semi-annually and when there is a significant change in condition.Job DescriptionMeets with applicant, family and caregiver to determine if MLTC program applicants meet the clinical qualifications for enrollment. (i.e.; UAS score 5 or greater, needing 120 days of care, safe in home environment).Meet with member, family and caregiver to conduct the UAS tool for MLTC & FIDA program enrollees.Conducts all assessment needed based on UAS tool.Scores the Attendant Care Worker tasking tool and shares potential hours and daycare services with applicant and family.Discusses other for applicants that do not meet the clinical qualifications for the MLTCP.Review handbook and enrollment documents with applicants who meet the criteria for enrollment in the MLTCP. Responds to questions and obtains signature on all necessary documents.Reviews findings of assessments and interviews with applicant and family with Care Manager.Conducts reassessments of member pursuant to schedule and in cases when Care Manager requests re-assessment due to change in condition of the member.Participates in MetroPlus quality management activities related to MLTC & FIDA as needed.Provides information to the MLTC & FIDA management teams.Performs other tasks assigned by the MLTC & FIDA management teams.Minimum QualificationsBachelor’s Degree (BSN) preferredTwo (2) to three (3) years clinical experience in certified home health agency (CHHA), Lombardi program and/or MLTCLicensure and/or Certification RequiredRegistered Nurse, Currently New York State licenseUAS Certified RNProfessional CompetenciesIntegrity and TrustCustomer Service FocusFunctional/Technical skillsWritten/Oral CommunicationsHow To ApplyIf you wish to apply for this position, please apply online by clicking the \"Apply Now\" button or forward your resume, noting the above Job ID #, to:  MetroPlus Health Plan  Human Resources Department  160 Water Street 8th Floor  New York, NY 10038  Attn: Recruitment UnitThis is position is classified as a managerial title, in addition to a variety options for Health Benefits through MetroPlus, managerial employees receive vision, dental, gym reimbursement and life insurance benefits through the Management Benefits fund of the City of New York. Please view the benefits page for more detailed information."}