{"jobID": "2824097480", "jobLocation": "New_York_NY", "jobTitle": "ETL Data Analyst/Engineer", "companyRating": "3.7", "companyInfo": {"Website": "www.bloomberg.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1981", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Google, Goldman Sachs, Thomson Reuters"}, "estimatedSalary": "68000", "jobDescription": " Bloomberg's Global Data division, our technology drives our business. The tools we create and the software we design will allow us to meet the evolving data needs of our clients and enable us to drive our products.  We are looking for talented individuals that possess a unique combination of business acumen, technical skills, domain knowledge, and interpersonal skills that will analyze business needs and utilize technology for increasing automation, improving data quality, and reducing time to market.  Through process analysis they will discover opportunities, define requirements, and implement new technology components. In the ETL Data Analyst/Engineer role you will collaborate with other data teams, core business managers and engineers to develop and deliver these cross-cutting technical solutions. We'll trust you to:Develop, implement, and support code to improve on existing ETL processes or create new ones; optimally extract, transform, and load data between various sourcesAnalyze data from these and other processes to measure quality and accuracy, identify improvements, and benchmark the progress of solutions that have been implementedWork across teams and departments to find opportunities for automation, product creation, quality improvements, and/or reducing time to marketBuild other robust solutions that not only address immediate project needs, but can also be easily repurposed for use by other teams and departmentsEffectively communicate findings from analyses, project progress, other metrics, and successful outcomes to stakeholders in compelling, creative, and accessible waysYou'll need to have:Undergraduate degree in business, economics, mathematics, statistics, or related field, minor in computer science preferred3-5 years of proven professional experience in data engineering or data analysisDemonstrated project/work experience using Python and popular relevant packagesExperience working with high volume data exchange and transaction processing systems, preferably in a customized software development environmentExperience with various data formats (e.g. CSV, HTML, XML, JSON)Working knowledge of ETL and other areas including data mining, data modeling, data visualization, process engineering, software designAbility to build partnerships across an organization and facilitate interactions with engineering and business counterpartsWe'd love to see:Experience in at least one other programming language (e.g. JavaScript, VBA, etc.)Experience working with text dataWorking knowledge of web technologies and web dataKnowledge of modern database technologiesPassion for/interest in areas such as automation, web technology, machine learning/AI, and/or strong desire to learn more We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.  Apply Now  ETL Data Analyst/EngineerNew York  Posted Jan 8, 2018 - Requisition No. 64261  Apply Now  Bloomberg's Global Data division, our technology drives our business. The tools we create and the software we design will allow us to meet the evolving data needs of our clients and enable us to drive our products.  We are looking for talented individuals that possess a unique combination of business acumen, technical skills, domain knowledge, and interpersonal skills that will analyze business needs and utilize technology for increasing automation, improving data quality, and reducing time to market.  Through process analysis they will discover opportunities, define requirements, and implement new technology components. In the ETL Data Analyst/Engineer role you will collaborate with other data teams, core business managers and engineers to develop and deliver these cross-cutting technical solutions. We'll trust you to:Develop, implement, and support code to improve on existing ETL processes or create new ones; optimally extract, transform, and load data between various sourcesAnalyze data from these and other processes to measure quality and accuracy, identify improvements, and benchmark the progress of solutions that have been implementedWork across teams and departments to find opportunities for automation, product creation, quality improvements, and/or reducing time to marketBuild other robust solutions that not only address immediate project needs, but can also be easily repurposed for use by other teams and departmentsEffectively communicate findings from analyses, project progress, other metrics, and successful outcomes to stakeholders in compelling, creative, and accessible waysYou'll need to have:Undergraduate degree in business, economics, mathematics, statistics, or related field, minor in computer science preferred3-5 years of proven professional experience in data engineering or data analysisDemonstrated project/work experience using Python and popular relevant packagesExperience working with high volume data exchange and transaction processing systems, preferably in a customized software development environmentExperience with various data formats (e.g. CSV, HTML, XML, JSON)Working knowledge of ETL and other areas including data mining, data modeling, data visualization, process engineering, software designAbility to build partnerships across an organization and facilitate interactions with engineering and business counterpartsWe'd love to see:Experience in at least one other programming language (e.g. JavaScript, VBA, etc.)Experience working with text dataWorking knowledge of web technologies and web dataKnowledge of modern database technologiesPassion for/interest in areas such as automation, web technology, machine learning/AI, and/or strong desire to learn more We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}