{"jobID": "2796338313", "jobLocation": "San_Jose_CA", "jobTitle": "Intern - Software Engineering", "companyRating": "3.2", "companyInfo": {"Website": "www.itron.com", "Headquarters": "Liberty Lake, WA", "Size": "5001 to 10000 employees", "Founded": " 1977", "Type": " Company - Public (ITRI) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Landis+Gyr, Silver Spring Networks"}, "estimatedSalary": "67000", "jobDescription": "Nestled in the heart of the Silicon Valley, Itron San Jose is our engineering and R&D; center for networking solutions. With an extremely innovative, collaborative workforce and a start-up mentality—but with the backing of an established leader in the utility and smart city industries—Itron San Jose is focused on developing and deploying multi-application networks that connect devices, data and people in some of the harshest environments imaginable. Our network solutions are helping transform and digitize the utility business model, connecting smart cities and citizens to critical services, and enhancing the safety, reliability and resiliency of energy and water delivery for customers around the globe. Itron Network Solutions (INS) is looking for a Software Engineering Intern to join our team in San Jose, CA. In this role, you will work side-by-side with Silicon Valley engineers to deliver products that enable network connectivity and security for utilities and other Internet of Things networks. This is the ideal position for someone in Computer Science or an allied major who has achieved junior standing with strong Java programming skills.Maintaining and extending build quality by troubleshooting and extending test automation.Investigating and fixing customer-reported software problems.Validating and remediating security issues discovered by penetration testers.Coding feature enhancements for future software releases.Reviewing and commenting on draft technical documentation.Strong computer science fundamentals (data structures and algorithms)Understand concepts around Software Delivery Life Cycle (SDLC), such as Agile, and tools/processes to support these concepts, like version control and continuous integration systems.Knowledge of Java programmingInterest in designing and implementing enterprise scale, high volume, high availability systemsFamiliar with Linux commands for deploying and configuring softwareStrong written and verbal communication skillsPreferrably have achieved Junior status in Computer Science or a related fieldFamiliar with IPv4 networking and IPv6 networking preferredFamiliar with J2EE architecture concepts such as MVCDatabase programming in Java including SQL and JDBCExperience: This position requires a minimum of 0-1 year of related experienceEducation: Currently enrolled in an accredited university or college program in Computer Science or Engineering or a related fieldPhysical Demands: This is a typical office job, with no special physical requirements or unusual work environment.#DICEItron is an Equal Opportunity, Affirmative Action Employer. Qualified applicants are considered without regard to race, color, religion, sex, age, national origin, citizenship, sexual orientation, marital status, pregnancy, medical condition, veteran status, disability, genetic information, gender identity or other characteristics protected by law. If you require an accommodation in order to apply to this position, please contact your local recruiting representative at 1-800-635-5461 or email Accessibility@itron.com. #LI-MK1"}