{"jobID": "2803739364", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Data Scientist - Marketing Analytics and Strategy", "companyRating": "3.8", "companyInfo": {"Website": "www.roche.com/de", "Headquarters": "Basel, Switzerland", "Size": "10000+ employees", "Founded": " 1896", "Type": " Company - Public (RHHBY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Novartis, AstraZeneca"}, "estimatedSalary": "145000", "jobDescription": " Data Scientist - Marketing Analytics and StrategyGenentech is hiring a data scientist to help shape the future of data science in US commercial strategy & operations. The ideal candidate will have experience building analytical products & solutions that support data-driven decision-making across the commercial, medical and govt. affairs organizations.  You are a results oriented self-starter with demonstrable hands-on success in data science and advanced analytics projects. As a Data Scientist, you will be responsible for providing strategic sales and marketing insights with minimal guidance & supervision by leveraging your capabilities as a highly analytical entrepreneurial problem-solver to: Develop strategic analyses and deliverables to drive business impact across the organizationCollaborate with partners to define use cases and deliver results in a timely mannerDrive the project roadmap for a diverse team of doers, thinkers and problem-solvers As a Data Scientist, you will join our team of highly driven data scientists and marketing analytics professionals to conduct high impact analyses, build tools, platforms and processes that enable nimble decision making and strategy development across the commercial organization. You will report directly to the Group Manager or Principal Manager, MA&S; Portfolio Analytics. MAJOR RESPONSIBILITIES Work with Group Managers and Associate Directors to understand business needs and priorities, as well as immediate scope of work Identify and develop innovative programs and projects that enhance Genentech’s abilities to accurately target and measure the effectiveness and ROI of its market promotionsAutomate analyses and develop interactive, employee-facing tools, platforms, and systems that inform, support, and enable business decisions across Genentech by delivering insights in a speedy and efficient mannerDevelop, implement, and evolve the role of data science, machine learning, and AI capabilities across the US Commercial, Medical and Government organizationTranslate business needs into data modeling initiativesTake an enterprise mindset, linking individual responsibilities with broader organization; focus on outcomes that provide most business valueMaximize the likelihood that innovation will continue to thrive at GenentechInterface with Market Analysis & Strategy teams, cross functional partners, and brand stakeholders to advance projects and strategic deliverables for the US Commercial, Medical and Government organizationLead cross-functional teams to integrate data, derive insights and automate processes. Successful execution will not only entail technical feasibility for advanced informatic capabilities, but will also drive substantial business value for the US Commercial organizationOpenly share perspective and insights to elevate team thinking and drive a balanced, holistic point of view; effectively weigh and communicate trade-off considerations.Look for opportunities for continuous improvement; engage managers and peer group regularly for coaching, assistance, and advocacyPREFERRED QUALIFICATIONSAt least 3 to 5 years of relevant work experienceMaster's or PhD in Economics, Statistics, Mathematics, or related field is required.Strong knowledge of / experience working with analytical tools is required (e.g., SAS, Python, R, SQL). Experience with other Big Data technology such as Hadoop, Teradata etc. is a plusExperience creating API-driven apps preferredExperience working with relational databases, as well as with large and heterogeneous data sets from different sources; experience with medical (claims, EMR) and payer data is a plusExperience developing shared code (e.g., version control, programming patterns, libraries/packages) and creating data pipelinesAbility to prioritize multiple stakeholders and tasks, and manage work time efficientlyExcellent verbal and written business communication skills, including the ability to present highly technical subject matter to non-technical audiencesExperience leading workshops to share best practices with colleaguesExperience developing shared code (e.g., version control, programming patterns, libraries/packages) and creating data pipelinesExperience and expertise with statistical analyses (descriptive, inferential, bayesian etc.) is preferred At Roche, 94,000 people across 100 countries are pushing back the frontiers of healthcare. Working together, we’ve become one of the world’s leading research-focused healthcare groups. Our success is built on innovation, curiosity and diversity Roche is an equal opportunity employer.Sales & Marketing, Sales & Marketing > MarketingSouth San Francisco"}