{"jobID": "2639795616", "jobLocation": "New_York_NY", "jobTitle": "New Grad RN / LPN", "companyRating": null, "companyInfo": {"Website": "www.whiteglovecare.com", "Headquarters": "Brooklyn, NY", "Size": "1001 to 5000 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "White Glove Community Care is an action oriented homecare agency. We embrace the community with health in the comfort of our patients’ home. Our Nurses are considered a great asset to our team and we are looking forward to YOUR application in our urgent search for New Grad RN / LPNs. We currently have available Full-Time, Part-Time & Per Diem assignments! Embark YOUR Nursing career at the right address, only through White Glove!Our patients range from adult, adolescent, and pediatrics in variety of conditions. We believe that every patient and their family deserve home health care delivered with empathy, superiority and consistency.New Grad RN / LPNs provide home health nursing care for patients who are sick, injured, convalescent, or disabled. Additionally, the New Grad RN / LPNs responsibilities will include:prepare and give injections and enemas, monitor catheters, dress wounds, and provide skin care.feed patients who need help eating.measure and record patients’ vital signs such as height, weight, temperature, blood pressure, pulse and respiration.clean and monitor medical equipment - we specialize in Vent, Trach, and G-Tube care monitor their patients and report adverse reactions to medications or treatments.Are YOU a qualified New Grad RN / LPN? We would love to hear from YOU! Sign up today to our Preceptor Education Program which brings your career to the next level.Yes, White Glove offers top perks to our New Grad RN / LPNs which include:Salary YOU deserveDirect Deposit – for your convenienceDaily/Weekly PayrollReferral Bonuses for referring your nurse friends24 Hour support by our caring teamFree Health InsuranceFlexible scheduleContinuous cases in New York, New Jersey and moreSatisfaction alwaysPaid Sick DaysAnd Much More!New Grad RN / LPN qualifications:NYS Registered Nurse RN or Licensed Practical Nurse LPN LicenseEligibility to work in United StatesCompassionate and friendly demeanorAbout Us:White Glove Community Care is an exclusive homecare agency serving the community throughout New York, New Jersey and more. Our dedication with care comes from a strong background of proficiency, education, and knowledge. We strive to keep our patients and their families safe, secure and content. We take pride from our valued Nurses, RNs and LPNs, who are carefully selected to meet our standards. Today, White Glove Community Care has earned an unmatched reputation which is known by all. Our patients and their families are always our priority."}