{"jobID": "2751075392", "jobLocation": "San_Jose_CA", "jobTitle": "Director, Field Based Sales for Enterprise Management", "companyRating": null, "companyInfo": {"Website": "www.sage.com", "Headquarters": "NEWCASTLE-UPON-TYNE, United Kingdom", "Size": "10000+ employees", "Founded": " 1981", "Type": " Company - Public (SGE.L) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Salesforce, Intuit, Microsoft"}, "estimatedSalary": null, "jobDescription": " Job Title Director, Field Based Sales for Enterprise Management (Central Region) Advert Sage energizes the success of businesses and their communities around the world through the use of smart technology and the imagination of our People. Sage has reimagined business and brings energy, experience and technology to inspire our customers to fulfil their dreams. We work with a thriving community to entrepreneurs, business owners, tradespeople, accountants, partners and developers who drive the global economy. Sage is a FTSE 100 company with 14,000 employees in 24 countries.  EOE AA/M/F/Vet/Disability  Sage Software is an Equal Opportunity Employer. We comply with the laws set forth in the EEO is the law poster:  http://bit.ly/2l9bz7h Job Description The Director, Field Based Sales leads a team of Strategic Account Manager for our Enterprise Management product (formerly Sage X3) and works closely with Senior Staff to develop long term strategic plans for team and long term product revenue growth. Success in this role is dependent upon a successful track record within and managing an ERP field sales teams.Key Responsibilities Essential Functions:Develops and implements plans and strategies to consistently achieve short and long term product revenue growth.Keeps executive-level management informed of departmental progress and problems.Works with supervisors/field-based staff to execute on tactical plans.Works with field-based team to develop plans and tools to help drive revenue growth. Works to remove any operational/organizational barriers that may impede success of the team.Works with other departments coordinating efforts to increase revenue growth and partner/customer loyalty.Works with departments across functional areas and business units to identify best practices.Responsible for the management of remote representatives with heavy travel requirements. Coaches and mentors direct reports.May be responsible for revenue forecasting and reporting. Ensures budgets and schedules meet corporate requirements.Protect company proprietary and confidential informationOther duties as assignedBachelor’s degree preferredTypically has 12+ years of related experience to include at least 5 years in sales leadership.Heavy travel may be required for this role."}