{"jobID": "2776164940", "jobLocation": "San_Francisco_CA", "jobTitle": "Business Systems Analyst - Intern", "companyRating": "5.0", "companyInfo": {"Website": "www.leanplum.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Kahuna, Appboy, Urban Airship"}, "estimatedSalary": "48000", "jobDescription": "About Leanplum Leanplum is the mobile marketing platform built for engagement. Brands rely on Leanplum to help them orchestrate multi-channel campaigns from messaging to the in-app experience all from a single, integrated platform. Global brands such as Tinder, Grab, Tesco, and Zynga turn to Leanplum to accelerate growth and build long-term customer relationships. Founded in 2012, Leanplum is based in San Francisco, with offices across North America, Europe, and Asia. Leanplum has received more than $93 million in funding from Norwest Venture Partners, Canaan Partners, Kleiner Perkins Caufield & Byers, and Shasta Ventures. Leanplum has been named to Business Insider's Most Valuable Enterprise Startups and SF Business Times Best Places to Work. Learn more at www.leanplum.com. Our Culture Inside the walls of Leanplum (just kidding, our space is open), youll meet employees from 22 countries and counting. We house a world champion air guitarist, three medalists from programming competitions, and six loyal office dogs who greet you at the door with tails wagging. Past perks have included company vacations to Mexico and Tahoe, Alfred Hitchcock movie nights, and costume parties. But most of all, we believe in gratitude, collaboration, and karma.  Want the opportunity to work with some of the leaders in mobile? Want to learn about the industry trends and cutting-edge applications? We're looking for a Business Systems Analyst Intern to join our growing team in San Francisco! About the Role Leanplum is looking for a Business System Analyst Intern for our San Francisco Headquarter office. The Business System Analyst Intern will support key stakeholders and cross-functional team members to gather business requirements and drive system projects from initiation to deployment. This is a fantastic opportunity for someone who wants to learn various business applications, project management and software development lifecycle in areas related to Sales, Marketing, Finance, Customer Success, IT and Product. The successful candidate will be a self-starter who is willing to roll-up their sleeves, take coaching advice and effectively contribute in a team-oriented work environment. About YouAcademic background in Management Information Systems, Computer Science, Computer Engineering or similar majorExperience gathering business requirements and process documentationAnalytical inquisitiveness in gathering data to define functional and technical requirementsStrong quantitative and problem-solving skills with some conceptual understanding of different types of business applications that support Finance, IT, Sales, Marketing, Customer Success and/or EngineeringSome experience managing technical or system-related projects learned through previous internships, work experience or university-level projectsAbility to handle multiple projects simultaneously and take ownership in delivering project milestonesStrong written and verbal communication skills with professional demeanorSelf-reliant and team playerAbility to build relationships with key stakeholders and cross-functional team membersDetail and task orientedFamiliarity with project management methodology and software development lifecycleResponsibilitiesPartner up with Business Applications, IT and business stakeholders to gather functional and technical requirementsAnalyze functional requirements and drive consensus among stakeholdersCreate Business Requirement document (BRD) and assist in technical designGain proficiency of the companys internal business systems to act as subject-matter support among different functional business stakeholdersPerform project management tasks for business application enhancement requests and software implementationPerform system unit testing and assist in user-acceptance testing (UAT)Identify areas of improvements and drive initiatives to promote operational efficiencyBenefitsPeer bonusesDelicious and healthy lunches and dinnersPing pong, darts, and foosballPuppies galore"}