{"jobID": "2794570266", "jobLocation": "New_York_NY", "jobTitle": "Financial Analyst", "companyRating": null, "companyInfo": {"Website": "www.engineshopagency.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "ENGINE SHOP IS NOT YOUR TYPICAL AGENCY. We are looking for great people who are passionate about what they do. People who understand the value of hard work, are willing to get their hands dirty and enjoy the process as much as the result. People who love working on a team. People with a make it happen and get it done attitude. People who, no matter what the level, are leaders. No two gears are the same but they all fit together to make an unstoppable machine here at Engine Shop. Our people are why Engine Shop has been consistently named a \"Best Place To Work\" by Ad Age and Event Marketer.WHAT’S OUR STORY We are an engagement marketing agency with deep roots across sports, entertainment and lifestyle. We integrate live experiences, digital engagement and content to help our clients connect with their consumers. To best serve our clients, all roles come with the expectation of meeting Engine Shop’s standard of excellence.  But that’s not our only focus. Our culture is a part of everything we do – from our casual work environments to our creative benefits and our acclaimed annual retreat. It’s a part of how we treat one another, how we have each other’s backs and how we welcome people who are different.  We are looking for a Financial Analyst who has strong financial modeling skills, analytical skills and communication skills. Someone who continuously seeks optimum performance by acting with tenacity and looks to achieves objectives set within a defined timeframe. A Financial Analyst who can identify and present key information and who gives his/her point of view by structuring and summing up all useful elements. ESSENTIAL FUNCTIONS + RESPONSIBILITIESAct as financial and compliance specialist for client programs as noted below: Manage administrative tasks with clients, including, but not limited to, team member credentials, background checks and vendor approval, manage program reports + work with teams to balance budgetsManaging invoice process – processing invoices, sending to client sMain point of contact for checking invoices, adding accounting codes and validating check runs.Weekly budget review + main conduit to finance department to be proactive in locating issues + managing them effectivelySupport the team on making sure all clients, vendors and employees maintain policies and proceduresAssist with the closing of the books on a monthly/quarterly/yearly basisOversee and manage timesheet approvals, including training new hires + timesheet approversCalculate and analyze Utilization for all employeesMaintain commission worksheet + communicate with all parties re: changes, additions, etc.Assist in development of project management component of timesheet software + oversee program with project leadsOversee expense software and managing staff to handle expense reporting in timely + efficient mannerWork with HR on building + managing salary bandsOther duties as assigned by direct supervisorRequirements1-2 years of compliance, accounting, finance or consulting experienceBachelor’s degree requiredBenefitsCompetitive compensation package including base salary and company bonus planMedical and dental benefits401K + company matchFlex vacation policy"}