{"jobID": "2674112519", "jobLocation": "Cambridge_MA", "jobTitle": "Senior Data Analyst, Marketing", "companyRating": "3.4", "companyInfo": {"Website": "www.ef.com", "Headquarters": "Lucerne, Switzerland", "Size": "10000+ employees", "Founded": " 1965", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "62000", "jobDescription": "Senior Data Analyst, MarketingEF Ultimate BreakBoston, MA, United States Do you have an obsession with numbers and the desire to tell stories with data-driven analysis?  We are looking for a data rock star (or wizard – your pick!) to perform intelligent analyses backed by quantitative data that guides our strategic, tactical and operational business decisions.  You will proactively and upon request work with identifying trends that suggest new marketing & business opportunities and follow through with the recommendation of key strategies to leverage opportunities. You will serve as an evangelist for the power of data analytics and present findings and recommendations to key stakeholders. You will participate in the development of organizational benchmarks of key consumer metrics and performance indicators. The roleLeverage data to analyze and determine performance of current initiatives such as but not limited to marketing acquisition and promotional campaigns.Use your statistical skills to develop hypothesis and build predictive models for acquisition, repeat and referral rates, customer life-time value (LTV), customer response rate, tour actualization, etc.Use quantitative methods and tools including A/B testing, multivariate analysis (MVA), and optimization techniques to analyze and optimize various areas of business such as marketing, operations and sales performanceGenerate insights and recommendations and present these to the senior managementPartner with Marketing and technology to prioritize critical initiatives, tests, analysis and insightsQualificationsStrong analytical aptitude with practical business experience – degree in Statistics, Mathematics, Business, Economics, Finance, Computer Science, related field OR demonstrated analytical and technical ability3-5+ years of experience as a management consultant or front-end business analyst supporting marketing, finance and customer functions, performing reviews, analysis and making recommendations on current and future marketing initiatives.Must have on the job real world experience developing business models.Must be able to write SQL queries, comprehend requirements and extract data to support analysis requiredMust have digital ecommerce experience (retail preferred but not required)Excellent analytical, communication and presentation skills,Must be proficient using ExcelWorking knowledge or exposure to Google Analytics, Tableau and SalesForce.com would be a strong assetA team player and have the ability and desire to collaborate effectivelyEntrepreneurial mindset & sense of urgency and accountabilityMust be able to communicate clearly and effectively in explaining insights to non-technical staff ABOUT EF Ultimate Break EF Ultimate Break is the best way to experience the world for anyone 18-29. With 60+ trips, everything from airfare and accommodations to flexible payment plans and free daily breakfasts are included. As a proud part of EF Education First, EF Ultimate Break draws on over 50 years of EF expertise to add amazing travel experiences to its growing tour portfolio. EF, the world leader in international education, has helped more than 15 million people learn a language, discover the world or earn an academic degree to date."}