{"jobID": "2728926118", "jobLocation": "Palo_Alto_CA", "jobTitle": "APP: Nurse Practitioner/Physician Assistant - Pre Anesthesia Eval", "companyRating": "3.4", "companyInfo": {"Website": "www.stanfordhealthcarecareers.com", "Headquarters": "Stanford, CA", "Size": "5001 to 10000 employees", "Founded": " 1957", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Sutter Health, UCSF Medical Center and UCSF Benioff Children’s Hospitals, Kaiser Permanente"}, "estimatedSalary": "171000", "jobDescription": "Job Description: Ths is a full-time 1.0 position (5 days a week) in the Pre-Anesthesia clinics at Stanford Healthcare including Stanford Hospital main campus (Palo Alto) and to other Outpatient Surgery Centers for Stanford Healthcare. The Nurse Practitioner/Physician Assistant provides routine care and management of the pre-procedural and post-procedural patient referred to Pre Anesthesia clinics, consulting anesthesiologists, and through implementation of standardized procedures. A. Performs initial evaluation of patient documents, medical records, referral requests and patient inquiries to determine if patient can be seen by a Nurse Practitioner/Physician Assistant or should be referred directly to a supervising Attending physician or postdoctoral Fellow. B. Obtains anesthesia history and performs pertinent physical exams with assessment of normal and abnormal findings on pre-procedure patients. Completes appropriate pre-procedure documents and records a history and physical in patient\"s chart. C. Provides pre-procedure teaching and reviews consent form with patient. D. Performs or requests diagnostic studies as indicated upon evaluation of the patient according to written standardized procedures. E. Orders medications that patients are taking at home as necessary to provide continuity of care, according to written standardized procedures. Acquires counter-signature on prescriptions from the supervising physician for medications not included in the approved formulary. F. Provides discharge instructions to patients, and provides first point of telephone contact for inquiries from existing patients. G. Works closely with OR scheduling and outpatient clinics to provide timely elective procedures after new patient visits in the clinic, and to ensure scheduling of follow-up procedures and clinic visits at appropriate intervals.  All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, national origin, protected veteran status or on the basis of disability. Job Qualifications: Nurse Practitioner Education: Master\"s or Doctorate Degree in Nursing from an accredited college or university is, required. License/Certification: BLS - Basic Life Support, required. License/Certification: CA Registered Nurse (RN), required. License/Certification: Certification as a Nurse Practitioner by a nationally recognized nursing organization (e.g., American Academy of Nurse Practitioners-AANP, American Nurses Credentialing Center-ANCC, or any successor organizations), required. License/Certification: DEA - DEA Number from the US Drug Enforcement Administration, required. License/Certification: CA NP - Nurse Practitioner, required. License/Certification: NPF - NP Furnishing Number, required. Physician Assistant Education: Bachelor\"s degree or above from an accredited college or university. Graduate of a PA program accredited by the Accreditation Review Commission on Education for the Physician Assistant, Inc. License/Certification: Current licensure as a Physician Assistant in the State of California is required. License/Certification: BLS - Basic Life Support, required. License/Certification: DEA - DEA Number from the US Drug Enforcement Administration, required. License/Certification: Must be board certified from the National Commission on Certification of Physician Assistants (NCCPA) at the time of hire and maintain certification during employment at SHC. "}