{"jobID": "2790525178", "jobLocation": "Sunnyvale_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.roseit.com", "Headquarters": "Chesterfield, MO", "Size": "1001 to 5000 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Position Title: Data AnalystPosition Number: 282867Location: Sunnyvale, CADesired Skill Set: Data Analytics, Data Visualization, Python, SQL, TableauPosition Description: **C2C IS NOT ALLOWED**  Duration: 3-6 months  Sunnyvale, CA  Data Consultant/Modeler  We are looking for strong candidates who have experience in SQL, Tableau and Python. Need someone who has created mutiple dashboards on a daily basis.  We need someone who has the ability to communicate very well, exceptional in Tableau and SQL. A plus is having experience in Python. If the individual doesn’t have experience in Python, but has the ability to pick it up very quickly we would strongly consider them as well.  For the reporting on-site consultant, absolute must is strong knowledge of SQL and proficient at Python. If candidate has experience with Tableau that is a strong plus.  Typical expectation of candidate, but not hard set.  Minimum four years of solid hands-on experience with data visualization, data mining, and analytics.  Strong analytic problem solving skills and an aptitude for learning systems quickly.  High attention to detail, organization, team-orientation, and ability to work under tight deadlines in a fast paced dynamic environment.  Exceptional communication and collaboration skills.  Proven experience programming in SQL, R, Tableau, Python.  Applied background in Hadoop, Spark, Hive.  Experience building and leveraging RESTful services and API libraries.  A strong understanding of data models and the ability to mine data to answer complex feature questions,  Expert in data analysis and presentation tools.  Curious and forward thinking, with passion to improve and simplify processes.  High level of autonomy and influence to unblock delivery of results (evaluate and solve difficult problems involving various teams ranging from data instrumentation to analytics tool development).  The ability to define metrics, understand A/B testing and statical measurement of model quality.  Conduct analysis to learn from terabytes of data.  High level of motivation, residence, agility, and energy.  Extraordinary degree of intellectual curiosity.  Comfortable in a loosely structured and ambitious problem solving environment.  Overall, a highly driven, result-oriented, creative and nimble problem solver with a willingness to do “whatever it takes” to deliver business impact quickly and accurately. #CBRose# Send me a reminder to complete this applicationRose International is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender (expression or identity), national origin, arrest and conviction records, disability, veteran status or any other characteristic protected by law. Positions located in San Francisco and Los Angeles, California will be administered in accordance with their respective Fair Chance Ordinances.  Rose International has an official agreement (ID #132522), effective June 30, 2008, with the U.S. Department of Homeland Security, U.S. Citizenship and Immigration Services, Employment Verification Program (E-Verify).  (Posting required by OCGA 13/10-91.)"}