{"jobID": "2830863033", "jobLocation": "Palo_Alto_CA", "jobTitle": "MBA Intern - Corporate Development", "companyRating": "4.2", "companyInfo": {"Website": "www.vmware.com", "Headquarters": "Palo Alto, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (VMW) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "142000", "jobDescription": "MBA Intern Corporate Development Location: Palo Alto, CA, Summer 2018 - 12 weeks  VMware is a global leader in cloud infrastructure and business mobility. VMware accelerates customers digital transformation journey by enabling enterprises to master a software-defined approach to business and IT. With VMware solutions, organizations are creating exceptional experiences by mobilizing everything, responding faster to opportunities with modern data and apps hosted across hybrid clouds, and safeguarding customer trust with a defense-in-depth approach to cybersecurity.  At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Do you dare to do the stuff youve always dreamed about? Dare to explore at http://careers.vmware.com. Team Description VMware is seeking a current MBA student to join the Strategy and Corporate Development (SCD) team at its global headquarters in Palo Alto, CA for the Summer of 2018. We are an excellent platform for motivated, market savvy, technology curious professionals to play a prominent role in shaping the future of one of the most exciting companies in cloud infrastructure and business mobility.  Within SCD, the Corporate Development (Corp Dev) team is comprised of a small and nimble group of transaction practitioners who help plan and develop growth strategies, proceed to identify, analyze, and execute specific opportunities (acquisitions and other strategic business transactions) to help the company realize its objectives. As a member of this team, you will work closely with members of the full SCD team as well as with business unit / functional leaders and executive leadership in evaluating markets as well as potential ideas and targets. Specific responsibilities include:Develop hypotheses, strategies, and pipeline for potential acquisitions working with SCD team members and business unit teams Research multiple sources for company, industry, and competitive market informationAssess business, technology, and go-to-market fitness of targetsAnalyze and synthesize acquisition business casesSupport Corp Dev deal leads from idea generation and inception to execution and deal closeSupport post-close evaluation of acquisitions to analyze performanceRequirements:A first year MBA student, currently enrolled in a full time program. A technical degree will be considered a plus but is not mandatory.3-5 years of related experience and a real passion for technology and software. Relevant experiences range from product management, technology focused investment banking or private equity, or management consulting for technology clients.Proven ability to think strategically with a strong business foundation. You are able to thrive in a relatively unstructured, quick changing environment where priorities may shift and potentially compete.Strong financial modeling and presentation skills required. Strong written and interpersonal skills are critical. Excellent market analysis skills with comfortable facility leveraging 3rd party research and equity analyst reports.You must be a U.S. Worker to apply for this role. VMware will not provide sponsorship for this role.Equal Employment Opportunity Statement VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. VMware will provide reasonable accommodation to employees who have protected disabilities consistent with local law."}