{"jobID": "2803630448", "jobLocation": "New_York_NY", "jobTitle": "Sales Consultant", "companyRating": null, "companyInfo": {"Website": "www.gloskinbeauty.com", "Headquarters": "Denver, CO", "Size": "51 to 200 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Consumer Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Glo Skin Beauty is seeking a full time Sales Consultant to join our team and grow our territory in Manhattan NY/Northern PA. Our Sales Consultants are driven sales professionals with a real passion for our award-winning premium mineral cosmetic and skincare products. Sales Consultants are responsible for maintaining and growing existing client accounts and prospecting new clients in the area. Sales Consultants are members of our national outside sales field sales team and report to the Regional Manager. What does it mean to be a Glo sales consultant? As a Glo Business Consultant, you will actively maintain existing client accounts, drive growth by adding new accounts, and run the territory as your own business, while representing the Glo brand positively. We'll outline the essential duties below: You'll manage existingclientaccounts when you:Collaborate with clients to craft actionable business plans resulting in revenue generation for them and GloConduct regular business meetings with active accounts as well hold refresher and education trainings with both new and existing accountsPlan and organize workshops and events with our dedicated Education teamYou'll drive territory growth with new accounts when you:Research prospects throughout your territory and develop a robust pipeline of leadsEducate prospects on Glo’s products and unique advantages as a partnerConvert leads into customers by using follow-up visits, strong persuasion and communication skills, and a collaborative consultative approachIn order to achieve sales goals, you will:Manage customer orders and questions; make decisions using available information and resourcesAssist in the development of territory sales forecasts by building monthly territory analysisUse your organizational skills to plan sales call rotations, record sales notes, track prospects, and comply with required reporting and other internal administration tasksYou will be recognized for your performance at regional sales meetings and on regional conference calls with your Glo teammatesYou'll represent the Glo brand positively when you:Share your real passion for skincare and mineral makeup products with enthusiasmShowcase a strong working knowledge of our full product portfolio and ability to clearly promote our products’ valueDemonstrate continuous personal development by being open and receptive to Regional Manager mentoring and customer feedbackCommunicate clearly and respond to clients in a timely and professional mannerJob qualifications- To be considered for this role you should:Live within the territory and within one hour from the Manhattan NY/Paramus NJUnderstand effective sales techniquesCommunicate clearly, apply best-practice selling skills, and use a consultative approach to learn how to meet a client’s business needsOffer experience in developing and maintaining positive customer relationshipsFunction independently, manage time and resources effectively, and adjust behaviors to meet and exceed sales goalsHave expertise in using Microsoft Office suite, internet browsers, and ability to use a tabletDisplay organizational and administrative skills to complete sales management tasks such as expense reporting, weekly and monthly sales reporting, and other administrative tasks in our internal SAND database as well as third-party applications and softwareStrongly preferred experience:Proven success in a business to business sales roleProfessional experience in beauty industryWorking Conditions: Travel by car daily and by plane weekly or monthly, including overnight stays in territory to visit current and prospective client locations in person; regular travel to attend quarterly regional meetings. Residence within the assigned territory. Work may occur before/after normal business hours. Physical activities include driving, lifting products in/out of vehicles, carrying boxes, listening and speaking with clients, demonstrating product use, using tablet and mobile phone.  Please note this is a full time employment within our organization and is not a multilevel sales opportunity.  Glo offers equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics."}