{"jobID": "2513527110", "jobLocation": "San_Francisco_CA", "jobTitle": "Sr. Data Scientist - Advanced Analytics", "companyRating": "4.3", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "184000", "jobDescription": " About Uber Were changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now were a part of the logistical fabric of more than 600 cities around the world. Whether its a ride, a sandwich, or a package, we use technology to give people what they want, when they want it. For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer. And thats just what were doing today. Were thinking about the future, too. With teams working on autonomous trucking and self-driving cars, were in for the long haul. Were reimagining how people and things move from one place to the next. Are you interested in developing and applying quantitative solutions related to Uber's problems? Do you believe data creates better products and has a key role in product decisions? This is the job for you. You'll be partnering with Uber's product and engineering teams to drive actionable data insights and solutions from some of the world's most interesting datasets. Our data scientists work on every aspect of the product - whether it's exploratory research to understand user behavior for riders and drivers, or running experiments to optimize untapped areas of growth, or developing machine learning models to mitigate fraud on our platform. The perfect candidate will have an excellent quantitative background, will be able to address abstract business and engineering problems with extreme precision, and has the enthusiasm and initiative necessary to deliver those answers at Uber's fast pace. What you'll needAt least 4 years of experience in quantitative analysis experience (preferably in an engineering or product role).Quantitative background in Statistics, Computer Science, Math or other technical field. Graduate degrees preferred.Experience with common analysis tools - SQL, R, and Python. Demonstrable familiarity with code and programming concepts.A product mindset - you ask and address the most important analytical questions with a view on enhancing product impact.Passionate and attentive self-starters, great communicators, amazing follow-through - you love the responsibility of being personally empowered."}