{"jobID": "2708950376", "jobLocation": "New_York_NY", "jobTitle": "Python Developer", "companyRating": null, "companyInfo": {"Website": "www.axelon.com", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Python Developer for Infrastructure Automation Our team is in charge of the full-stack development of our hardware requisition portal and workflow system, which is responsible for hardware purchases for Brokerage. In our small team you will work in front-end interfaces, application-tier logic, and database code. The product is the face of Enterprise Computing to the customer hence affords opportunities to work with business users. Our development team reports to the Agile Engineering team in Enterprise Compute, is well aligned with back-end infrastructure and IaaS systems and interacts with a variety of engineers and developers. The opening is for a Python developer with experience developing a multi-tier web application including back-end enterprise software and infrastructure management toolsPrimary responsibilities: -Be the sole owner responsible for developing and reviewing code and contributing ideas to a team of talented technologists -Facilitate technical discussions and the development of web applications, web services, and public APIs that support hundreds of users -Participate in the design of the web application -Understand software requirements -Implement various parts of the application using Python -Formulate and implement recommendations/solutions Due to the global nature of the team and function, you will be required from time to time to work and collaborate with colleagues located in US, Europe and Asia.Skills Required: -Strong experience developing with Python -Working knowledge HTML/Javascript/CSS -TDD, CI and iterative software development -Experience with application code and configuration scanning for best practices -Designing and building XML/SOAP/Restful service applications and clients -The ability to effectively communicate with a global team and customers -A solid understanding of change management processes -Are able to write and present comprehensive technical content / documentationSkills desired: -Thorough knowledge of web database applications -General understanding of Linux & Apache -Knowledge of TCP/IP, HTTP protocols -Excellent problem solving skills, and an eye for solving performance issues -Experience with Perl or Python web frameworks development (flask, pylons, catalyst, mojolicious). -AngularJS/extjs or other client-side JavaScript frameworks"}