{"jobID": "2760597727", "jobLocation": "New_York_NY", "jobTitle": "Installation Technician", "companyRating": null, "companyInfo": {"Website": "security.kastle.com", "Headquarters": "Falls Church, VA", "Size": "201 to 500 employees", "Founded": " 1972", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Datawatch, Genesis Securities, Tyco"}, "estimatedSalary": null, "jobDescription": " Mutual Central Alarm (MCA) offers the most advanced and effective electronic security systems and services available today. MCA has been the security choice for many major New York area businesses that require the best in security services. State-of-the-art electronic security and surveillance equipment, highly skilled system design specialists and installation, and a dedicated, knowledgeable and professional service support and management team all combine to provide our customers with the most logical, efficient and cost effective security for their home or business.  Mutual Central Alarm Services is seeking a Field Installation Technician to assist in all phases of installing, testing, and troubleshooting Burglar Alarms, CCTV systems, Access Control systems and intercom systems in NY metropolitan area. Install, test, and troubleshoot Burg, Access, CCTV and Intercom systems.Install conduit and pull cable and connect devices.Program digital video recorders and network video recorders according to client needs.Diagnose Security system problems and determine faulty components.Ability to speak intelligently with network and IT personnel about IP addressing issues.Supervise subcontractors and other workers.Work with power tools.Interface with customers as necessary to install and test equipment.Train customers on operation of equipment.High School Diploma, GED, or 2 or more years of experience.Knowledge of analog and IP camera systemsBasic understanding of TCP/IP and networkingKnowledge of programming digital video recorders (DVRs)Handson experience with hand and power tools.Basic knowledge of AC and DC theory.Mechanical aptitude and ability to use metering devices.Must be able to climb stairs and ladders, and carry tools and equipment not to exceed seventyfive pounds.Must be able to distinguish colors.Must be able to interface and communicate with customers and coworkers in a clear and professional manner.Candidate should be able to use MS Word, Excel, etc.Willingness to accept responsibility and carry out assigned tasks with limited supervision.Work history must display stability and good attendance.Ability to follow the installation, testing, and troubleshooting proceduresDesire and ability to work well with others.Self-motivation.Excellent attention to detail.Neat, professional appearance.Must be available to work overtime, weeknights, and/or weekends.Must possess a valid driver’s license and satisfactory driving record.Must pass a pre-employment drug screening and must be at least 18 years of age to apply.Work history must display stability and good attendance.Must be eligible to work in the U.S. These physical demands are representative of the physical requirements necessary for an employee to successfully perform the essential functions of the job. Reasonable accommodation can be made to enable people with disabilities to perform the described essential functions of the job.  While performing the duties of this role, the employee may be required to talk and hear face-to-face and while using telecommunication devices; sit for long periods of time; use hands and fingers to handle or feel, and manipulate standard keyboard, mouse and office equipment; stand, walk, and reach; lift and carry with arms and hands; use close vision; and be able to adjust visual focus. The employee must be physically and mentally capable of functioning effectively for extended periods of time and consistently produce organized thoughts and execute sound judgment in environments with: moderate to high levels of stress  competing demands and dynamic response required  Open floor plans with ambient noise and activity consistent with office or call center work  Ongoing construction Travel requirements: by automobile, plane and other modes of public transportation may be required. Must be able to:Lift and carry up to 75 poundswork unsupervisedwork closely with others/ as part of a teamwork under close supervisionwork in enclosed spacesuse color vision to distinguish colored wires, signals, other lighting devices,use and manipulate hand tools, small power tools, communication and diagnostic devicesThe employee is subject to prevailing weather condition at the time.The noise level in the warehouse/stockroom environment is usually moderate but may be periodically load.The employee made be exposed to moving mechanical parts, tools and vehicles."}