{"jobID": "2827610586", "jobLocation": "Boston_MA", "jobTitle": "Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.massgeneral.org", "Headquarters": "Boston, MA", "Size": "10000+ employees", "Founded": " 1811", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " CareGroup, Beth Israel Deaconess Medical Center, Boston Medical Center"}, "estimatedSalary": "93000", "jobDescription": " General Summary Overview Statement Working within an academic research environment, the Database Coordinator will contribute to the development and maintenance of specialized databases of family history and risk factors for cancer, as well as outcomes. Perform data entry to update these databases and use them to identify and analyze patient care and outcomes, including performing mathematical analysis of cancer outcome.  The Principal Investigator and team engage in collaborative investigations with the BayesMendel group in the Biostatistics and Computational Biology Department at DFCI. The groups jointly work on a tool which provides absolute cancer risk predictions for various hereditary cancer susceptibility genes and involves genetic epidemiology, cancer risk assessment and health care management. The position will assist in this research by providing data support.  Serve as a point person and resource for all team members, including collaborators at DFCI, MIT, NWH and other outside entities. Coordinate activities needed for research staff and visiting research fellows. Assist the investigator with Institutional Review Board (IRB) activities to include entry protocols and updates; comply with IRB regulations. Prepare manuscript drafts to facilitate publication of MGH and/or collaborative research.  Principal Duties and Responsibilities Learn and use Access and other software as needed for data management and analysis.  Update the databases by uploading data (e.g. patient demographics, risk factors, tumor characteristics, pathology results and imaging reports) from hospital systems and the Electronic Health Record. Perform data entry to update the databases.  Review data additions for quality control; resolve discrepancies.  Utilize the databases to conduct analyses on patient data; identify trends, needs and make preliminary conclusions and/or outline further research opportunities.  Prepare progress and other reports (descriptive and statistical) for the investigator. Prepare drafts of articles, manuscripts, presentations and other materials for publication; work with the investigator to ensure readiness for and coordinate submission to journals and other publishers.  Conduct literature searches and compile summaries and information.  Assist the Investigator with activities and compliance related to institutional review of research through the Institutional Review Board, such as by completing forms and submitting paperwork. Collate and prepare materials for submission to granting agencies and foundations.  Serve as a point person for information on research projects and collaborations. Serve as a resource to the teams; coordinate administrative activities to include providing access to all experimental data for the faculty researcher, responding to project related email and maintaining website materials.  Maintain accurate records, safeguarding the confidentiality of subjects, data, results, etc.  Comply with IRB and other regulations.  Perform other responsibilities as assigned.Qualifications Bachelor's Degree required in biology, public health, epidemiology, biostatistics or a related field  2-3 years of directly related work experience required; some exposure to genetic epidemiology and big data experience preferred. A Master's Degree may substitute for some experience.  Partner's Healthcare is acting as an Employment Agency in relation to this vacancy."}