{"jobID": "2795781486", "jobLocation": "San_Jose_CA", "jobTitle": "Charter Aircraft Passenger Screening Officer", "companyRating": null, "companyInfo": {"Website": "www.xccommand.com.my", "Headquarters": "Petaling, Malaysia", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Passenger Screening Officer Position Responsibilities Provide security screening of chartered aircraft passengers in a courteous and professional manner on behalf of Command Security Services LP (CSS). Conduct passenger screening activities that comply with U.S. Transportation Security Administration (TSA) requirements for private charter aircraft. Passenger Screening Officer Position DutiesUses physical screening techniques and electronic detection equipment to identify dangerous objects in baggage and on passengers and preventing those objects from being transported onto aircraft.Protects passenger safety by conducting pat-down searches, searching carry on baggage, operating hand-held metal detectors, and checking identification documents.Courteously and respectfully interacts with passengers, aircraft crew, ground support crew, and TSA auditors while conducting passenger screening activities.Maintains organization's stability and reputation by complying with legal requirements and maintaining professional behavior at all times.Maintains focus and awareness while conducting screening services in a deadline-driven, fast-paced, loud, and stressful flight operations environment.Ensures operation of equipment by completing preventive maintenance requirements, following manufacturer's instructions, troubleshooting malfunctions, calling for repairs, and evaluating new equipment and techniques.Contributes to team effort by accomplishing related tasks as needed.QualificationsMust be a US Citizen.Must possess a High School Diploma or G.E.D.Must be proficient in the English language.Must be 18 years of age or older.Must successfully pass a background investigation to include a criminal history background check and fingerprinting prior to hire.Must successfully complete CSSs 16-hour passenger screening training program.Must be available to work various shifts, weekends, and holidays.Must be able to lift up to 50 lbs.Must possess sound judgment, objectivity, dependability, emotional control, integrity, common sense, professionalism, strong customer service skills, and ability to clearly communicate.Additional InfoDuty station locations are Oakland Airport and San Jose Airport. The potential for paid, short-term travel to other airports in the United States depending on clients needs and employees availability.Flex positions available with varying hours depending on clients and employees schedule.Possibility to schedule additional hours dependent on the needs of the client.Free certified training for this position will be provided by CSS.Individuals with military experience and retirees are encouraged to apply.Salary: $20 - $25 Hourly rate based uponthe level of experience.Affirmative action employer. All qualified applicants will receive consideration for employment without regard to race; color; national origin; religion; sex (including pregnancy, childbirth, and related medical conditions); disability (physical or mental); age (40 and older); citizenship status; genetic information; ancestry; gender identity and gender expression; AIDS/HIV; medical condition; political activities or affiliations; status as a victim of domestic violence, assault, or stalking; or status as a protected veteran."}