{"jobID": "2745814938", "jobLocation": "Issaquah_WA", "jobTitle": "Tax Data Analyst~", "companyRating": null, "companyInfo": {"Website": "www.costco.com", "Headquarters": "Issaquah, WA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (COST) ", "Industry": " Retail", "Revenue": " $10+ billion (USD) per year", "Competitors": " Sam's Club, BJ's Wholesale Club"}, "estimatedSalary": null, "jobDescription": "Description of position  The Tax Data Analyst is responsible for analyzing data related to tax calculation, compliance, and remittance. The Tax Data Analyst is focused on ensuring the highest data quality for Costco’s tax technology team, which is responsible for designing and implementing solutions for Costco’s indirect tax needs. The ideal candidate will be very comfortable working with large data sets, building data quality metrics, performing root cause analysis, and ensuring alignment with tax governance standards.  Tasks and responsibilities Elicits and documents data requirements; aligning with business requirementsData governance steward responsible for consistent and uniform consumption of the enterprise tax service across CostcoDevelops, proposes, and contributes to implementation of data quality improvement processesAnaylzes data quality metrics to proactively ensure the health of indirect tax transactionsConducts root cause analysis; present findings and propose solution improvementsCollaborates with cross functional teams to resolve data quality issuesTests data creation and data validation testingContributes to the delivery of tax technology projectsAssists in other areas of the department and company as necessary Required skills, abilities, and certifications Experience analyzing data requirements for complex projectsExperience with ad hoc query development against large data setsExperience with analyzing and querying application log filesExperience with data validation techniquesMust possess excellent analysis and data logic skillsMust possess the ability to collaborate and effectively engage with individuals at all levels of the organizationMust have proven ability to manage priorities and timelines plus excellent communication skillsResponsible, conscientious, organized, self-motivated and able to work with limited supervisionMust be detail oriented and possess strong problem-solving skills Recommended skills, abilities, and certifications Experience with database systems (Oracle, SAP HANA, SQL Server, DB2)Experience with tooling related to data analysis (SQL, SSIS, Data Profiling, etc.)Proficient at analyzing data across disparate systemsFamiliarity XML technologies, including SOAP or REST web services, XML Schemas, XSLT, and XPathAccountable team player with a constructive attitude, problem-solving and customer service mindsetExcellent oral and written communication skillsGeneral knowledge of Finance & Accounting is a plusExperience with tax solutions (Vertex, Sabrix, Avalara) is a plus Apply: Use the link below to upload all required documents to  https://chm.tbe.taleo.net/chm02/ats/careers/requisition.jsp?org=COSTCO&cws;=1&rid;=2380  Applicants and employees for this position will not be sponsored for work authorization, including, but not limited to H1-B visas. If hired, you will be required to provide proof of authorization to work in the United States. Apart from any religious or disability considerations, open availability is needed to meet the needs of the business."}