{"jobID": "2722419815", "jobLocation": "San_Jose_CA", "jobTitle": "Patient Care Coordinator", "companyRating": null, "companyInfo": {"Website": "www.westerndental.com", "Headquarters": "Orange, CA", "Size": "5001 to 10000 employees", "Founded": " 1903", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " InterDent"}, "estimatedSalary": null, "jobDescription": " Requisition Number 18-0945  Title Patient Care Coordinator  City SAN JOSE  State CA  Zip Code 95124  Description Our company is looking for a bright, motivated and talented Patient Care Coordinator. The Patient Care Coordinator is the primary point of contact and communication for patients in our offices. The Coordinator will greet patients, introduce them to the office, coordinate treatment services, and nurture the patient relationship. The Patient Care Coordinator must be a strong communicator with a passion for providing excellent customer service and strong aptitude for sales. The Patient Care Coordinators objective is to make patients feel welcome and comfortable and to provide the Ultimate Patient Experience to every patient that visits our offices.Job Responsibilities/Duties :Set and achieve personal sales goals while supporting the goals of the team Greet patients in a timely, professional and engaging manner Introduce new patients to the office and staff Provide patient consultations and communicate information about recommended treatments Discuss cost of service, insurance coverage, and payment options with patients Build lasting relationships with patients by contacting them to follow up on visits to suggest new or alternative treatments Nurture the patient relationship to encourage patient retention Work as team player to ensure each customer receives the best service possible Supports strategic local marketing initiatives that help drive brand awareness and new patient growth Western Dental – Brident offers a competitive benefit package designed to enhance the lives of our Team Members. Team Members are eligible for benefits based on their full time status. Paid Time Off (PTO) Medical Dental Vision Continuing education and advancement opportunities 401 (k) plan With solid administrative and technology support and backed by outstanding management systems, our dental practices will provide excellent patient care and where our Team Members are appreciated and respected as professional colleagues. Requirements 2 years of sales, customer service or related work experience Bilingual Spanish-English skills preferred Ability to positively and proactively handle patient concerns and prioritize multiple tasks in a fast-paced environment Ability to quickly learn new procedures and processes Excellent communication and interpersonal skills High level of ownership, accountability and initiative Friendly, outgoing and motivated personality "}