{"jobID": "2004208341", "jobLocation": "New_York_NY", "jobTitle": "Records Clerk", "companyRating": "3.0", "companyInfo": {"Website": "www.outtengolden.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 1998", "Type": " Private Practice / Firm", "Industry": " Accounting & Legal", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "14", "jobDescription": "Outten & Golden LLP has an opening for a records clerk in our New York office. O&G; is an equal opportunity employer and is committed to diversity among its lawyers and staff. Outten & Golden LLP is an employee-side employment law firm that focuses on representing employees, executives and partners. From representing senior executives in contract negotiations to combating worker exploitation and systemic discrimination in individual, class action or impact litigation, O&G; is a recognized leader in the field of employment law. The firm advises and counsels individuals on employment agreements, compensation arrangements, and severance plans; and it represents employees in all substantive areas of law, including discrimination and harassment based on sex, race, disability, or age, and including retaliation and whistleblower claims. The firm currently has 50+ attorneys and ten practice groups covering a wide range of issues. Please browse our website at www.outtengolden.com.Firm StandardsThe firm utilizes Windows 7, Office 2010, Internet Explorer and Chrome. Law firm specific packages include FileSite (iManage) for document management, Time Matters for contact management and PCLaw Pro for billing and accounting.Job RequirementsThe firm is looking for an individual with good written and oral communication skills, strong interpersonal skills and a pleasant, professional telephone manner. The individual must be well organized and be able to work independently, while understanding the importance of team work. The individual must have general computer knowledge of the Windows XP environment and be proficient in MSWord2010 and MSExcel2010.The individual will be asked to work 10:00 A.M. – 6:00 P.M. and will report to the Director of Administration. Flexibility in the daily work schedule around the lunch period may be necessary. Occasional overtime may be required during periods of heavy workflow. The ideal candidate is a mature person with good oral communication skills, strong interpersonal skills, proficiency in FileSite (iManage) for records management and document management, and proficiency in Microsoft Office, particularly Word, Outlook, Adobe and Excel at an intermediate level (e.g., formulas and sorting).The individual must be well-organized and able to work independently while simultaneously understanding the importance of teamwork. The ability to learn quickly is expected, since training will be provided as necessary to familiarize the individual with various types of legal documents.Job DescriptionJob duties include scanning documents and determining how and where they should be filed; organizing and updating case files; creating new files as necessary; answering questions about records and location of files; finding and retrieving documents; entering data; compiling documents; processing mass mailings; photocopying; and faxing.Salary Depending on experience. Eligible for yearly salary review and year-end holiday bonus.BenefitsMedical insurance, dental insurance, short-term disability insurance, 401K plan, and eTrac are available to all full-time employees."}