{"jobID": "2711388080", "jobLocation": "Emeryville_CA", "jobTitle": "Data Engineer Intern", "companyRating": null, "companyInfo": {"Website": "www.vituity.com", "Headquarters": "Emeryville, CA", "Size": "1001 to 5000 employees", "Founded": " 1975", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Help Us Enhance Patient Care Across AmericaThe Vituity Team. Our corporate healthcare team includes change makers with a broad range of training and expertise. We innovate using our diverse business, analytic, and communications skills to tackle the challenges of today’s complex healthcare landscape. We collaborate, cooperate, and celebrate our unique contributions because we know we can achieve more together than we can alone. We have a passion for building a culture that cares for our employees, our clients, and our patients.  From our administrators and management consultants to our recruiters, data and financial analysts, developers, and marketers—we help the providers and health systems we serve improve patient outcomes, operational efficiencies, revenue, and job satisfaction.  As a member of the Vituity team, you’ll put your skills to work helping our providers improve the care of the 6 plus million patients our providers treat annually in over 250 practices throughout the United States. You’ll have the recognition and support you need to grow professionally. And you’ll have the opportunity to discover work you love in a family oriented company that wants you to succeed. Are You Searching For A Company That Values Talent? Well, Your Search Is Over! We are building a world class data and applied analytics team to deliver healthcare solutions and reporting. Our team is looking to hire a talented Data Engineer Intern to work on automated data centric solutions, developing real time ingestion data pipelines directly from hospitals, translation of unstructured data to SQL, high performance database design, and automated deployment systems. This Data Engineer Intern will also help us with designing and deploying new, purpose-built semantic layers and for designing processes and tools to reconcile multiple healthcare centric data sources. Typical projects will include integrating external data into an EDW, reporting or analytic system using APIs, existing standards or other protocols. Responsibilities include, but are not limited to:Analyzing trends in healthcare practice community.Collaborating with departments to update information and content.Attend meetings and provide insight into discussions.Special projects as needed.Critically interpret and evaluate user requests to design data solutions for multiple clientsAssist with complex data mining and deep analysis of data sets, applications, systems, and protocolsProvide recommendations and propose solutions for improving processesDevelop and deliver oral and written communications on key findings, conclusions, and recommendations to business leaders, external business entities and technical audiences Our Ideal Candidate Profile:Pursuing a BS, MS or PhD degree in one of the following areas: Computer Science, Information Systems, Mathematics, Statistics, or related technical field, preferredProgramming experience with Java, Python, R.Knowledge of SQLKnowledge of database systemsCurious, self-driven, analytical and excited to play with dataAbility to thrive in a fast paced work environmentExperience with and understanding of data analysis systems and operations that will improve organization and efficiency.Collaborative personality with excellent verbal and written skills.Intuitive data modeling skills.Strong organizational and reporting skills.Ability to keep impeccable records and to sustain strong attention to detail.Demonstrated ability to handle detailed work accurately and quickly, work to deadlines on multiple tasks, and to work as a team member in a collaborative and participatory manner, and to interact both in person and over the phone with a courteous and professional demeanor.Ability to edit and proofread own work and that of others.Demonstrated self-learner interested in continued professional development and personal growth. Why Vituity? When you work at Vituity, you share your talents with an awesome team that makes coming to work empowering and fun. That’s why our employees have voted us a Best Place to Work in the Bay Area for nine years. That, and some pretty incredible benefits: Competitive benefits package: Superior health plan options, best in class 401(k) plan (with a very generous company match like you’ve never seen before), 3 weeks paid vacation in your first year, tuition reimbursement policy, paid sabbaticals, and more!A Culture of Caring: We not only like working together, but care about one another personally and professionally. We host fun staff activities, health and wellness programs, employee recognition programs, and so much more.Location: We are located in the Emeryville Watergate business park overlooking the San Francisco Bay -- just minutes away from San Francisco and the East Bay.Your Life. Your Career. Your Success. Apply Today! Vituity is an Equal Opportunity Employer."}