{"jobID": "2762096521", "jobLocation": "Los_Angeles_CA", "jobTitle": "Computer Science Internship", "companyRating": null, "companyInfo": {"Website": "www.walshgroup.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1983", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Bechtel, Kiewit Corporation, Skanska"}, "estimatedSalary": null, "jobDescription": " Walsh is currently seeking a Computer ScienceIntern for our Crenshaw/LAX Corrdior Project located in Los Angeles, CA.  Are you someone who thrives on managing your school work and solving problems? Are you excited about working for a family company where, when you push yourself, you will be recognized? For Walsh Interns/Co-ops, a good day is getting everything done on their to-do lists or helping to solve a pesky problem. A great day, is when they get to do both.  Walsh Interns/Co-ops are easy to follow because they speak with precision, order and efficiency. They get things done because they plan their work and then work their plan. Are you a student that puts the same amount of care into managing relationships as you do into managing your course load? If so, we might have something for you.  As a fourth generation family owned business, Walsh recruits students that will take ownership for ensuring things are handled right. Are you someone who likes to say “yes” to taking on more? Are you someone who gets things started without being asked?  If this sounds like you, then we want to hear from you. If you have what it takes, welcome to the family. Help develop and maintain simple project data management data bases using Microsoft Access, SharePoint, SQL and VBA codingSupport migration of project data from current structure to new structure facilitating project closeoutHelp ensure data integrity throughout remaining phases of the project We are seeking students with the following qualifications: Seeking a degree in computer science or other related fieldPrevious work experience is a plusStrong leadership skillsExcellent oral and written communicationAbility to prioritize work and meet project deadlinesEqual Opportunity Employer, Disability/ Veteran#LI-LP1"}