{"jobID": "2209238775", "jobLocation": "New_York_NY", "jobTitle": "Data Scientist", "companyRating": "4.5", "companyInfo": {"Website": "www.ridewithvia.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "103000", "jobDescription": " As Data Scientist, you’ll utilize advanced quantitative & statistical analysis techniques to drive business model innovation for Via, and work closely with our CEO & senior management to help drive decisions. Responsibilities:Adeptly interpret and utilize mass quantities of data to generate innovative hypotheses & insightsUse sophisticated statistical methods to solve problems, leveraging up-to-date academic research and toolsQuantitatively test hypotheses about customer and driver behavior using large sets of proprietary data; leverage results to increase conversion and retention at every touch pointDesign and implement novel experiments to better understand current operation as well as expansion to new marketsYou:Obsessed with data; analytical and rigorous, with a thorough understanding of statistics and machine learningExtraordinary communicator with demonstrated writing and editing skills.Passionate about elegant visualization; you understand the importance of graphic techniques in communicating a quantitative idea effectivelyDeep understanding of business concepts within strategy, operations, and marketingHave a Masters Degree or PhD from a top-tier university (statistics, machine learning, physics, math, systems biology, or highly quantitative fields in social sciences), including 2+ years of graduate-level research experience (or the equivalent)Have experience with predictive modeling and statistical analysis techniques in a business environmentMastery in some or all of the following: SQL, Python, R, and Tableau Via offers highly competitive compensation packages and benefits, including equity, health insurance, a flexible vacation policy, and relocation assistance.  Via is an equal opportunity employer."}