{"jobID": "2788244607", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.nugs.net", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " nugs.net, the leading multi-channel live music distribution company, is hiring a Data Analyst in our San Francisco headquarters.The Data Analyst will be  responsible for the development and support ofnugs.net's data reporting  layer. As such, the analyst will be responsible for the  architecture, security, transformation, import/export, and presentation of  internal and external reporting data. This data includes sales, product,  user, and content consumption data spread across multiple platforms and  systems. The candidate will work with Finance and Content Ops teams on  business intelligence issues including ongoing revenue and user data reporting,  financial settlements and royalties to ensure accurate and timely delivery of  data to key stakeholders. The individual will report directly to the Director  of Finance. Experience:  -  Deep experience in the financial technology and reporting spaces  - Experience with  subscription apps, particularly the music or media industry  -  Strong .NET application development experience relative to  financial technologies required to extract and format data  -  Strong MSSQL experience in writing Procedures, Functions, Triggers,  Complex SQL, DTS, and SQL Reporting Services.  -  Experience with royalty calculation and payout models specific  to the media digital distribution space  -  Familiarity and experience with ETL processes and software Education:  -  B.A./B.S. in related technical or financial field or equivalent  experience Skills: -  Microsoft Development Stack ( .NET, SQL, Azure )  -  Must have excellent oral and written communication skills,  particularly in the presentation of data to internal and external stakeholders  -  Excellent analytical and problem-solving skills  -  Experience working in a team-oriented and collaborative  environment"}