{"jobID": "2783668619", "jobLocation": "Boston_MA", "jobTitle": "Data Scientist", "companyRating": "4.3", "companyInfo": {"Website": "www.cogitocorp.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "104000", "jobDescription": "We are seeking an experienced Data Scientist to execute data analysis projects to support both client-specific Insights and product development led research questions. The ideal candidate has experience with both big data technologies (Hadoop, Spark, Hive, etc) and modern data analytic tools (Python, R, etc), with an understanding of how to turn ill-defined problems into insights. He or she is passionate about pushing the boundaries of our understanding of human behavior by using novel, longitudinal social signaling data.This role reports to the Director of Behavioral Research. Responsibilities: Execute complex data analysis projects to support both individual client Insights and product-led research questionsSupport all aspects of the data analysis lifecycle, including data specification, data cleaning, data visualization, analysis and statistical modelingCollaborate with Signals, Product, Insights & Engineering to utilize modern big data tools to answer critical research questionsCreate reproducible scripts & methods to efficiently & effectively reanalyze similar datasets across clientsHelp drive the research backlog by generating thoughtful and data-driven perspectives on our most difficult business problemsRequirements:PhD in Psychology, Cognitive Science, Neuroscience, Statistics, Math, Computer Science or relevant fieldAt least 3 years experience in an industry data science roleAbility to communicate with equal proficiency to technical or business colleaguesAbility to multi-task and work in a fast paced start-up cultureRequired Skills:Expertise in data analysis tools (Python, R, etc)Expertise in cloud-based big-data tools (Hadoop, Hive, etc)Expertise in data cleaning and dataset preparationExpertise in data visualizationFamiliarity with traditional data management and presentation tools (SQL, Tableau, etc)Knowledge of git and code repository methodsFamiliarity with unix / command lineExpertise in modern statistical approachesFamiliarity with modern machine learning approachesBenefits:Your choice of comprehensive benefits for you and your familys health, dental, vision, disability, and life insuranceBi-weekly catered lunch and live product demos401(k) retirement plan optionsOngoing professional development and cross-trainingVacation time and 11 company holidays (yes, Patriots Day is a holiday)Company paid parental leave upon hireCompetitive pay, stock options, and annual bonus eligibilityCasual dress and fun office atmospherePre-tax commuter benefitsStocked groceries in the kitchenOffice location in the heart of Boston with convenience to the MBTA linesCogito is a proud equal opportunity employer. We are committed to fair hiring practices and to creating a welcoming environment for all team members. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, disability, age, familial status or veteran status.Applicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States and with Cogito Corporation (i.e. H1-B visa, F-1 visa/OPT, TN visa or any other non-immigrant status)."}