{"jobID": "2693071112", "jobLocation": "New_York_NY", "jobTitle": "High Performance Retrofit Accelerator Intern", "companyRating": null, "companyInfo": {"Website": "www.nrdc.org", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " 1970", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Natural Resources Defense Council (NRDC) is the nation's most effective environmental action organization. We use law, science and the support of 3.1 million members and online activists to protect the planet's wildlife and wild places and to ensure a safe and healthy environment for all living things. NRDC was founded in 1970 and our staff helped write some of America's bedrock environmental laws, including the Clean Water Act, and many of the implementing regulations; our water enforcement cases played a major role shaping current water policy throughout the country. Today, our staff of more than 500 lawyers, scientists, economists, policy and communications experts, and others, work out of offices in New York, Washington, Chicago, Los Angeles, San Francisco, Bozeman, Montana and Beijing. Position Summary: NRDC is seeking a High Performance Retrofit Accelerator Intern to work with the Facilities team in our New York office. This is a part-time role and will be from March to June 2018. The role will entail: Reviewing existing energy audits and capital needs assessmentsDocumenting existing and planned energy conservation measuresGathering key systems data such as age and end of useful life of equipmentCollecting and analyzing resident survey informationManaging RFP process and hired consultant for a net zero energy study of the NY office buildingReviewing existing energy audits and capital needs assessmentsDocumenting existing and planned energy conservation measuresGathering key systems data such as age and end of useful life of equipmentCollecting and analyzing resident survey informationBachelor’s degreeProject management experienceExcellent written communication skillsKnowledge of building systems and sustainability strategiesLEED Green Associate or AP favorable NRDC is committed to workplace diversity and inclusion. We are equal opportunity employers and do not discriminate in hiring or employment on the basis of race, color, religion, national origin, gender identity and expression, marital status, sexual orientation, age, disability, veteran status, or any other characteristic protected by federal, state, or local law. We offer competitive salaries, excellent benefits, and a pleasant working environment. Salary is based on a nonprofit scale and commensurate with experience.  Pursuant to the San Francisco Fair Chance Ordinance, for positions based in San Francisco, CA we will consider for employment qualified applicants with arrest and conviction records.  To apply, please visit www.nrdc.org/careers and upload your resume and cover letter through our online portal. Please no phone calls, emails, faxes or in-person resume drop-offs. Please reference where you saw this posting. NRDC is an Equal Opportunity Employer.  If you are having technical difficulty while applying, please reach out to iCIMS Customer Care at 1-800-889-4422. For further information about NRDC, please visit www.nrdc.org"}