{"jobID": "2828892524", "jobLocation": "Boston_MA", "jobTitle": "Marketing Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.pg.com", "Headquarters": "Cincinnati, OH", "Size": "10000+ employees", "Founded": " 1837", "Type": " Company - Public (PG) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unilever, Colgate-Palmolive, Henkel"}, "estimatedSalary": "115000", "jobDescription": "Do you have passion to help transforming P&G;'s brand building to enable better decision-making through the usage of advanced analytics and enhance business results?  We are looking for YOU to expand our Data Science Team based in Cincinnati.  As a IT Marketing Data Scientist (F/M) you will:  “Get into the details”, using machine learning algorithms, data visualization best practices, and analytic engines to release business building insights and build proprietary algorithms on our data, and combining with business and marketing knowledge: Design and implement analytical frameworks in the context of overall performance marketing objectives such as media effectiveness, RnF / conversion rate optimization, consumer engagement, content optimization, and personalization.Deliver high performance data science, including data sources identification, processing, model/algorithm development, and turning insights into actionable recommendation and systems.Adept at demonstrating analytic technologies solving ad hoc business problems, innovating on potential future solutions, and working with technology partners to translate your innovations into robust, scaled, analytic solutions.Work actively and effectively with other functions partners and senior management to accomplish project objectives.Participate in and lead analytic capability building program at various levels of skill and seniority  Qualifications  To qualify for this role you possess the following:  • 5 years’ experience in Direct to Consumer Marketing including media and CRM  • 5 years’ of shown leadership in applying and scaling Analytic techniques to deliver actionable insights from data.  • Master Degree in a quantitative field (Operation Research, Computer Science, Engineering, Applied Math, Statistics, Analytics, etc.) or equivalent work experience  • Experience in disrupting current business practices in CPG or related industries to help crafting a new go-to-market models.  • Domain familiarity with media (online/offline/paid/owned/earned)  • Good interpersonal skills, self-motivated, dynamic and can-do attitude  …and it would be good having as well knowledge of:Business Intelligence Tools such as KNIME, Tableau, SpotfireBusiness start-up/Direct-To-Consumer experiencePractical experience with Linear TV planning, Programmatic buying, & CRM orchestrationArtificial Intelligence / Big Data Ecosystem: Hadoop, Spark, TensorFlow, SQL, HiveScientific Computing: R, Python, C , Java, ScalaAdvanced Analytical models (Bayesian, Optimization (global, local, stochastic methods), Uncertainty Quantification, etc.)We offer:Meaningful position in a Dynamic, Diverse, Multi-cultural and Flexible working environment'Vibrant Living' offering on-site: Gym / Yoga / Sports-teams, Hair-Salon, Canteen, Agile workspace design, Flex-work arrangements possible P&G; is one of the world's leading consumer goods company improving lives of millions of people with brands like Pampers, Gillette, Pantene, Ariel, Lenor etc. IT (Information Technology) in P&G; is where business, innovation and technology comes together to help improving consumers life. Demonstrated leadership in applying techniques to deliver actionable insights from data"}