{"jobID": "2817560317", "jobLocation": "Los_Angeles_CA", "jobTitle": "Sr. Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.wonderful.com", "Headquarters": "Los Angeles, CA", "Size": "5001 to 10000 employees", "Founded": " 1980", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "94000", "jobDescription": " The Sr. Data Analyst partners with multiple business lines across the organization to help execute direct marketing programs and campaigns. The analyst is responsible for extracting and analyzing data and presenting results and recommendations. Help prepare data for KPI reporting and collaborate with your team to provide marketing campaign results, evaluate customer buying behavior and other data in ways that drive strategy and vision for internal decision makers.  Here's what you'll bring to the table: Bachelor's or Master's degree, or equivalent work experience.Three to five years of experience in analytics and reporting.Strong understanding of relational databases and experience with SQL.Preferred Skills & Experience:Superior proficiency in Excel and Access.Experience with web analytics tools preferably Omniture.Analytical and problem-solving skills.Strong attention to details, ability to prioritize and multitask.Positive attitude, team player with professional demeanor.Dependable, proactive, flexible and eager to learn new skills.Effective at communicating with technical and non-technical colleagues.Ability to identify and resolve exceptions and to analyze data.Excellent verbal and written communication skills.Ability to work on multiple projects concurrently.Collaborate with other team members to develop and manage reporting needs.Monitor and analyze critical business metrics and trends.Deliver data in reports, presentations and in other ways that let you share your exiting findings.Support and report on systems that stream and analyze very large data setsAnalyze data and develop techniques and process for automating this analysisUse database to report out daily, weekly and monthly metrics. Here's what we'll bring to the table: Competitive benefits package including Medical (including 24/7 online access to a physician), Vision, Dental, and 401k with match eligibility.Subsidized gym membership.On-site subsidized high end cafe offering farm to table meals and snacks.Free on-site yoga classes and other wellness-focused activities.Wonderful Giving (www.wonderfulgiving.com) -- allowing you to donate company money to a cause of your choice.Free tobacco cessation programs.Work-Life balance.All the FIJI Water and Wonderful snacks you may want in the office.Discounted tickets to various LA attractions.We are bicycle-friendly, with newly installed bicycle racks available to all LA-based employees. Teleflora brings together the time-honored tradition of sending flowers with the modern benefits of an advanced florist network. By tapping over 11,000 member florists in North America alone, Teleflora offers the kind of personal touches, artistry and expertise you expect from a trusted neighborhood florist--even if that neighborhood is across the country. No prepackaged flowers in nondescript boxes dropped on your doorstep--Teleflora's network of professional florists create artistic arrangements personally delivered in a vase, often on the same day. And, with the organization's pioneering \"Flowers in a Gift\" Collection, the recipient gets a keepsake that turns the treasured gesture of a bouquet into a lasting memento. Luxe yet affordable, aspirational yet accessible, Teleflora makes every day an occasion. Follow Teleflora on Facebook.  The Wonderful Company is an Equal Opportunity Employer and with opportunities for advancement. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age, protected veteran status, or other protected categories.  Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}