{"jobID": "2671079774", "jobLocation": "Sunnyvale_CA", "jobTitle": "Sr. Software QA Engineer", "companyRating": "2.9", "companyInfo": {"Website": "www.microfocus.com", "Headquarters": "Newbury, United Kingdom", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (MCRO) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " SAP, EMC, Oracle"}, "estimatedSalary": "109000", "jobDescription": " Discover the new Micro Focus now the worlds 7th largest pure-play software company. By combining HPE Software and Micro Focus offerings, we have built a brand new company with a stronger, bigger portfolio that delivers customer-centered innovation. We are now uniquely positioned to help enterprise customers solve their most pressing business problems and operate in the Hybrid environmentfrom mainframe to mobile to cloud.  Our portfolio spans the following areas: DevOps | IT Operations| Cloud | Security | Info Governance | Big Data, MachineLearning, & Analytics Take charge of your future and join our dynamic, motivated Security team as we go to market with a best-in-class portfolio that will help shape the worlds software landscape. #discoverthenew About the Role Micro Focus is seeking an energetic, self-driven SW QA Engineer to set and maintain quality standards for company products through the use of systematic processes. Develops, modifies, and executes software test strategies, plans and suites. Analyzes and writes test standards and procedures. Maintains documentation of test results to assist in debugging and modification of software. Analyzes test results to ensure existing functionality and recommends corrective action. May develop tools and environments to automate test execution. Consults with development engineers in resolution of problems. Responsibilities:Leads multiple project teams of other software quality assurance engineers and internal and outsourced development partners responsible for all stages of quality assurance for complex products and platforms, including testing strategy, analysis, coding, results evaluation, and proposed corrective actions.Manages and expands relationships with internal and outsourced development and quality assurance partners on software and firmware design and development.Reviews and evaluates designs and project activities for compliance with quality assurance guidelines and standards; provides tangible feedback to improve product quality and mitigate failure risk.Provides domain-specific expertise and overall software quality assurance leadership and perspective to cross-organization projects, programs, and activities.Drives innovation and integration of new technologies into projects and activities in the software quality assurance organization.Provides guidance and mentoring to less- experienced staff members.Education and Experience Required:Bachelor's or Master's degree in Computer Science, Information Systems, or equivalent.Typically 6-10 years experience.Knowledge and Skills:Must have ability to demonstrate strong coding experience in C/C++ and Python and scripting languages, Java experience is a plus.Must have testing experience in these areas: server/client relationship, API, SNMP, UI, command line interface, load test, and stress testingMust have experience in automation and automation framework such as Robot Framework, Cucumber, FitNesse.Must have experience in security - encryption, decryption, and various algorithms. Knowledge in cryptography and certificates is a plus.Must have experience with Linux and Microsoft environmentsExperience with continuous integration tools such as JenkinsPrefer Hardware Security Module (HSM) software testing experience.Excellent applying product understanding into practice.Fast learner, strong ability to apply analytical, statistical, and problem solving skills.Strong interpersonal skills, ability to multi-task.Excellent written and verbal communication skills; ability to effectively communicate quality architectures, plans, proposals, and results. #LI-DK1"}