{"jobID": "2725877244", "jobLocation": "Boston_MA", "jobTitle": "Lead Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.bose.com", "Headquarters": "Framingham, MA", "Size": "5001 to 10000 employees", "Founded": " 1964", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job DescriptionBose is looking for an experienced data scientist to grow and lead its new corporate data science group. The mission of this group is to develop, extend and use data science, data engineering, machine learning (ML), artificial intelligence (AI), and related technologies, algorithms, and tools to extract insights from data for driving business value. As the corporate center of excellence for data science, this group will provide world-class data science expertise, support and consulting to all business divisions (including consumer electronics and wellness) and functional units (including sales, marketing, research, supply chain, finance, product design and development) across the company. The desired business outcomes will include improved customer experiences, personalized recommendations and digital optimization.  This is a unique opportunity to lead and grow the data science capabilities of a highly-respected multibillion-dollar global consumer brand that produces industry-leading hardware devices and software.  Key capabilities and competencies Expertise in developing, prototyping and productizing algorithms in areas such as data science, AI, ML, deep learning, probabilistic and statistical modeling and reasoning, and mathematical optimizationProficiency in data science software development using languages and frameworks such as Python, R, MATLAB, Tensorflow, and cloud machine learning enginesExperience in working with big data frameworks such as Hadoop and Spark, cloud platforms such as AWS and GCP, visualization platforms such as Tableau, and SQL and other NoSQL databases.Passion for using data and insights to improve customer experiences and business outcomes, while helping people do their job betterAppreciation for the sort of precision and excellence that Bose has always been known for in audioResponsible for mining, analyzing, and modeling large structured and unstructured datasets, and applying advanced statistical predictive models and leading machine learning algorithms to solve business questionsCreatively translate business problems into a subset of data science problems that leverage appropriate methodology (e.g., classification, regression, probability estimation, etc.), evaluate the results rigorously, and transform the results into insights and recommendations that are clearly communicated to the businessDrive requirements for data systems professionals to develop the corporate data platform for ingestion, analytics, governance and delivery of data and insights.Champion and educate the business and product owners on ways to extract value from data that can be collected from our products or externally.Create mechanisms to use data as a strategic asset throughout the enterprise in enabling the partner organizations to accelerate their objectivesDevelop analytic metrics that establish a consistent, coherent approach to data throughout the organization to tie analytics into all enterprise functionsProvide analytics results directly to business users, allowing them to identify trends and insightsMeasure the ROI of analytics initiatives and create a standard benchmark program for measuring analytics valueDevelop and implement big data and artificial intelligence capabilities to help enhance customer experience. Job Requirements A Master’s degree (PhD preferred) in computer science, business analytics, applied mathematics, statistics, engineering, economics, social sciences or related fields.10+ years of experience in developing data science and analytics solutions for business applications using ML and AI technologies5+ years of experience in leadership of technical teamsProven track record of working with big data and social data, as well as cloud-based delivery of solutionsStrong business acumen, problem solving skills, and possess substantial operational experienceStrong domain knowledge and a keen understanding of how to leverage IT and data analytics toolsExcellent analytical, communication, organizational and presentation skills Location will move from Framingham to Boston Landing in late 2018.Bose is an equal opportunity employer that is committed to inclusion and diversity. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, age, disability, veteran status, or any other legally protected characteristics. For additional information, please review: (1) the EEO is the Law Poster (http://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf); and (2) its Supplements (http://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm). Please note, the company's pay transparency is available at http://www.dol.gov/ofccp/pdf/.pdf. Bose is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the application or employment process, please send an e-mail to Wellbeing@bose.com and let us know the nature of your request and your contact information."}