{"jobID": "2627215962", "jobLocation": "Cambridge_MA", "jobTitle": "Software Engineer (Recent graduates / Interns)", "companyRating": null, "companyInfo": {"Website": "www.cmtelematics.com", "Headquarters": "Cambridge, MA", "Size": "1 to 50 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " At Cambridge Mobile Telematics (CMT), our mission is to make roads safer by making drivers better. Our products are in use by millions of drivers, with proven results: users of our apps show reductions of 40% or more in risky behaviors like phone use while driving. Our safest and most engaged users are many times less likely to have an accident than the average driver.  At CMT, we are developing innovative software and hardware products that measure driver safety and provide insightful feedback about how drivers can do better. We couple this with leaderboards, competitions, rewards, and other incentives to incite behavior change. Some of the technical problems we work on include: Inferring vehicular dynamics and trajectories using sensor data from a mobile phone Automatic drive detection, activity detection, driver/passenger classification Detecting and discouraging distracted driving Quantifying safe vs. risky driving characteristics Detecting and responding to crashes and accidents in real-time Mobile app visualization, feedback, & incentives to improve a users driving Scaling our cloud infrastructure for a unique sensor-intensive workload Developing hardware and software for new mobile sensing platformsCMT is looking for outstanding graduating engineering students with strong software development backgrounds who are ready to make an impact on millions of users. CMT is looking for software engineers in the following areas: Full-stack web design in JavaScript/HTML/Python/SQL Mobile app development in Android/iOS Infrastructure / site reliability engineering, with expertise in building scalable web services in Python/SQL We are located in Kendall Square, Cambridge, Massachusetts. For more information, check out our website. Desired Skills and Qualifications Bachelor's Degree in Computer Science or related field Proficient in a programming language such as Java, Swift, Objective-C, or Python and familiarity with other programming languages Familiar with the software development lifecycle Familiar with source control systems such as git, hg, svn Strong debugging and troubleshooting skills If you are still in college or a recent graduate, please include a transcript with your application.  Cambridge Mobile Telematics provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, sexual orientation, protected veteran status or genetics. In addition to federal law requirements, Cambridge Mobile Telematics complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training."}