{"jobID": "2794340169", "jobLocation": "Palo_Alto_CA", "jobTitle": "MBA Intern - Senior Financial Analyst, Renewals & Worldwide Customer Ops Finance Team", "companyRating": "4.2", "companyInfo": {"Website": "www.vmware.com", "Headquarters": "Palo Alto, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (VMW) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "113000", "jobDescription": "MBA InternRenewals&WorldwideCustomerOpsFinanceTeam-SeniorFinancialAnalystLocation: Palo Alto, CA Start: May or June 2018, 12 weeks  VMware is a global leader in cloud infrastructure and business mobility. VMware accelerates customers digital transformation journey by enabling enterprises to master a software-defined approach to business and IT. With VMware solutions, organizations are creating exceptional experiences by mobilizing everything, responding faster to opportunities with modern data and apps hosted across hybrid clouds, and safeguarding customer trust with a defence-in-depth approach to cybersecurity.  At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Do you dare to do the stuff youve always dreamed about? Dare to explore at http://careers.vmware.com. Team Description: Our Finance Team supports Renewals and Worldwide Customer Operations. Our primary responsibilities include supporting the Renewals business ($3B+ Bookings). The preparation of monthly close and forecast, annual/ bi-annual/quarterly planning, Spend/ HC /ad-hoc analysis and reporting, and cross-functional work with Sales Finance, Sales Operations and Sales. The right candidate needs to have excellent organization and communication skills, as well as be highly detailed oriented and time & project management skills Responsibilities:Drive strategic projects to support Renewal BookingsBusiness model analysisShare best practices, identify gaps, lead change and help determine priorities.Develop strong operational knowledge on the critical systems like Hyperion, SalesForce, Essbase & SAPRequirements:Bachelor's degree in Business, Finance or Accounting and a first year MBA student in a full time program2-4 years of experience in FP&A;, Accounting or Finance related with a strong record of career progression, or other relevant work experienceDemonstrated ability and experience with finance, strategy, or excel modelingEspecially strong analytical skills and a natural predisposition toward data-driven decision-making.Ability to work independently across multiple groups in a rapidly changing environmentStrong MS Excel, PowerPoint capabilities; deep research skillsDesired Skills:Ability to handle several high-priority bodies of work concurrentlyYou have outstanding financial acumen blended with business partnership and leadershipYou bring confidence and presence collaborating with and presenting to executive staffYou should be a self-starter, who takes charge of complex tasks with minimal direction and develop new ways of approaching business challenges independently and pro-activelyYou have excellent written, verbal communication and interpersonal skillsPassion for continuous learning and personal developmentYou must be a U.S. citizen or permanent resident to apply for this role. VMware will not sponsor a non-transferable visa for this role.Equal Employment Opportunity Statement VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. VMware will provide reasonable accommodation to employees who have protected disabilities consistent with local law."}