{"jobID": "2783883068", "jobLocation": "Mountain_View_CA", "jobTitle": "Fiber Sales Operations Data Analyst", "companyRating": "2.7", "companyInfo": {"Website": "www.intelliprogroup.com", "Headquarters": "Santa Clara, CA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "104000", "jobDescription": "Company Overview our client is always striving to innovate and our Fiber-to-the-Home program is no exception. We're building one of the fastest national broadband networks to deliver next generation Internet content to users. If you want the opportunity to work on a state-of-the-art high profile program, look no further than the opportunity to frame the future of broadband. Job Summary Work closely with the Sales Operations team to understand their information needs and develop daily, weekly, monthly, and ad-hoc reports to highlight key performance metrics  Develop SQL scripts to structure, analyze, and make recommendations based on large data sets  Create easy to understand dashboards from complex data sets  Assist with special projects as needed Responsibilities and DutiesBA/BS degree in Computer Science, Mathematics, Statistics, other similar quantitative field or equivalent practical experience3-4 years of experience writing queries, stored procedures or functions in SQLAdvanced Excel skillsGsuite experienceExperience creating data visualizations/dashboardsQualifications and SkillsEffective problem-solver with a proven ability to understand stakeholder needs, work with ambiguity and quickly deliver analysis that meets the business requirements.Excellent business partnering and communication skills.Genuine excitement and passion for developing and analyzing large, complex data sets and converting them into the information / insights that drive business decisions at all levels of the organization.Capable of working on multiple projects and deadlines simultaneouslyExperience with Tableau"}