{"jobID": "2828923829", "jobLocation": "Menlo_Park_CA", "jobTitle": "Patient Registration Coordinator", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "The Patient Registration Coordinator is responsible for greeting and registering patients, answering phones, collecting patient demographics and insurance details, completing medical record requests, and provides front office administrative support for the office. The Patient Registration Coordinator is the first person that will communicate with and greet the patients as they arrive to the practice. He/she will answer questions or provide general information, or may direct a patient to a person who can provide more specific information. This position reports to the Director of Patient Support Services and the Practice Manager.CCRM is an industry leading pioneer in fertility science, research and advancement, offering access to national network of award-winning physicians, a full suite of fertility services, innovation technology and cutting edge labs. CCRM is currently comprised of eleven locations spanning the U.S. and Canada with growth planned for continued network development on a domestic and international basis.ESSENTIAL FUNCTIONS:Greet all patients and visitors as they enter the practice.Check in each patient upon arrival.Responsible for gathering, updating and maintaining the patient demographic information.Responsible for scanning insurance cards, picture ID or other identification cards and prior medical records information into the patient’s medical record.Responsible for taking patient payments, procedure pre-payments, and past due balances and provide a receipt to the patient.Responsible for patient appointment scheduling and rescheduling patient appointments when needed.Communicate with patients in a timely manner when schedule changes are made.Responsible to handle confidential information and patient medical records.Answer phone calls, take and triage phone messages, forward calls based on urgency and in a timely manner.Responsible for assisting each patient with their appointments for the day, monitoring patient schedule to assure patient is getting to their appointment on time and with minimal wait time, effectively maintaining timely patient flow.Assist patient, staff, and provider, as needed.Confirm that ordered test results are in the EMR prior to a patient’s appointment date with the provider.Responsible for calling each patient who has not completed the new patient paperwork two days prior to their scheduled appointment.Mail out patient information and education materials, when needed.Maintain positive relationships with other departments.Check fax machine, throughout the day and distribute all incoming faxes to appropriate staff member. Fax patient information, as directed.Assure the readiness of the lobby for each work day; open building at the designated time and ready computers at the front desk prior to patient arrival for the day.Secure building at the close of each work day by locking all entrances.Train new employees, as requested.Participate in staff meetings and other in-services or training and is accountable for the information/education provided in those meetings.Assume responsibility for development and accomplishment of annual personal and team goals.Other duties as assigned.REQUIRED QUALIFICATIONS:High School Diploma, required minimum. Associates degree in health administration, social work, sociology, psychology, management, marketing, finance, accounting or business, or equivalent relevant work experience, preferred.Minimum of 2 to 4 years of experience in a professional work environment.Strong attention to detailExcellent communication skills and be able to deal efficiently and courteously with all patients providing a very high level of customer service.Excellent organizational skills combined with excellent multitasking abilities.Strong computer skills, be able to use basic office equipment and handle multiple phone lines.Ability to schedule patient appointments in an accurate and timely manner and [patient friendly manner.Demonstrate the ability to be a team player and perform duties that are delegated to him/her.Exhibit courteous, compassionate and respectful treatment of internal and external customers.Displays a positive attitude and flexibility in changing situationsFollow HIPAA guidelines and maintains confidentiality for all patient and practice information at all times.WORK ENVIRONMENTThis job operated in a professional office setting performing predominantly sedentary work. This role routinely uses standard office equipment such as computers, including computer keyboards and mice; telephones; photocopiers; scanners; filing cabinets.While performing the duties of this job, the employee is regularly required to talk, see and hear. The employee is frequently required to sit; will occasionally stand and/or walk; use hands and fingers to grasp, pick, pinch, type; and reach with hands and arms. Employee is required to have close visual acuity to perform an activity such as: preparing and analyzing data and figures; transcribing; viewing a computer terminal; extensive reading; operation of standard office machines and equipment.The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.EQUAL EMPLOYMENT/ANTI-DISCRIMINATIONCCRM is an equal opportunity employer and does not discriminate on the basis of Race, Color, Religion, Creed, National Origin, Ancestry, Sex, Pregnancy, Age, Sexual Orientation (including transgender status), Physical or Mental Disability, Marriage to a Co-Worker, or for anyone engaging in Protected Activity (opposing a discriminatory practice or participating in an employment discrimination proceeding). Additionally, this employer does not tolerate any employees engaging in discriminatory behavior based on any of the aforementioned protected classes.PRE-EMPLOYMENT REQUIREMENTSAll offers of employment by this employer are conditional upon the incumbent’s successful completion of pre-employment screenings, including a criminal background check, drug screen, educational and prior employment verification, professional reference checks, and verification of the incumbent’s eligibility and authorization to work in the United States. This employer participates in the E-Verify Program in order to verify the identity and work authorization of all newly hired employees."}