{"jobID": "2756012897", "jobLocation": "Seattle_WA", "jobTitle": "Marketing Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.flyhomes.com", "Headquarters": "Seattle, WA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Founded in October 2015 by two full-time students and based out of Seattle, WA, FlyHomes is a real estate and fintech company focused on making home buying seamless, transparent, and fun. Since the co-founders graduated in June 2016, FlyHomes has continued to rapidly scale its team, focusing on helping buyers across Seattle, San Francisco Bay Area, Chicago, and new emerging marketplaces to purchase more than $300M in homes annually. About the job: What if we were to tell you that we had millions of rows of data, from dozens of sources that needed to be organized, analyzed and visualized, all with a mission to help drive strategic decision making? Would that interest you? If so, we have just the job for you. The real estate industry has no shortage of data, the question is how best to use it. With your help, we will use this data to make FlyHomes the most powerful home buying platform around. Your work will directly impact clients, company strategy, day-to-day execution and the overall direction of the real estate industry. Are you ready to dive into the data? Roles & responsibilities:Work cross-functionally to compile, organize and analyze large datasetsAnalyze real estate data to inform pricing decisionsExplore, pilot and implement new data tools to optimize operations and marketing efficiencyDive into FlyHomes internal data, combining disparate sources of information into data sets you can analyzeEstablish systems to identify insights that will be used to inform FlyHomes strategyDefine, track and communicate key business metrics including via automated dashboards and visualizationsUnderstand your customer needs and translate these into new analytic opportunitiesCommunicate your complex analyses and insights to a broad range of (less technical) partnersJob requirements:3+ years of working in data analytics rolesExcellent data and analytical skills and strong business insightBS in a quantitative field (math, science, engineering, economics etc.) from a top programExpert knowledge in SQL and ExcelStatistical skills and experience using stats packages is a plusAbility to communicate complex concepts clearlyComfortable presenting to senior leadershipStrong collaboration and interpersonal skillsWell organized and creativeAble to hand multiple critical projects at one timeExperience with Tableau or data visualization software a plusExperience with web analytics data a plusBenefits:401(k) plan, 401(k) company-match, Life-insuranceMedical/dental/vision insurance packages to fit your needsUnlimited vacation policy; work hard and take time off when you need it"}