{"jobID": "2645590923", "jobLocation": "Burbank_CA", "jobTitle": "User Interface Summer Intern", "companyRating": null, "companyInfo": {"Website": "www.appliedminds.com", "Headquarters": "Burbank, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Our Summer Interns gain valuable work experience in a fast-paced environment working on one of a kind projects which involve a combination of design, development and testing on the team's various projects, as well as conceptual prototyping activities. Work is expected to include a mix of user interface and server-side code. Projects center around big data applications and include large-scale analytics and machine learning, coupled with innovative user interfaces.  Candidates will have knowledge of and experience in some or all of the following technologies: HTML5JavascriptPythonAdobe Suite (Photoshop, Illustrator, InDesign, AfterEffects etc.) Specific day to day responsibilities will vary based upon skills, expertise, and project needs. Intern candidates must be full time students enrolled in a college or university working towards a Bachelor’s or Master’s degree in any design, technology, science, engineering, mathematics, or architectureResourceful, with a relentless drive for finding innovative and creative solutionsPassionate about STEM; has STEM hobbiesCreative individuals who approach problems with curiosity and enthusiasmAbility to manage through ambiguity, comfort with grey spacePerseverance and tenacityMulti-disciplinary engineering coursework with project experience in design and prototyping a plus Work Environment and Other Job Specifications: Intern positions at Applied Minds are paid and work part-time over the summer breakPosition is located in Burbank, CA. No relocation assistance will be offered.The work environment is open and casual"}