{"jobID": "2808389764", "jobLocation": "San_Francisco_CA", "jobTitle": "Content Analytics (Intern)", "companyRating": null, "companyInfo": {"Website": "www.crunchyroll.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " San Francisco  Crunchyroll, the leader in Anime and founded by Berkeley engineers in 2006, has an exciting summer internship opportunity in data. We have an amazing set of data around content consumption and want you to join us in generating analysis and insight which will ultimately be used to create a better user experience.  We are looking for a dynamic and highly-motivated individual for special projects in the Content Analytics group. This position is primarily responsible for driving analysis associated with Crunchyroll's content and audience, and delivering actionable insights. The role will also generate key strategic work products and presentations to support management through critical business decisions. The right candidate will possess, technical skills, and creativity with a passion for problem-solving and driving real-world results.  Duration: 10 Weeks  Hours: 16-24 hours per week as needed Responsibilities:Work as part of a team that will ingest data from a variety of source types including viewership, behavioral attributes, content metadata, etc.Apply machine learning, statistics or data mining in a variety of areas, including customer analysis, video content genome, social analysis, etc.Invent and fast iterate on novel solutions to challenging large dataset related problems.Structure and munge ingested data in support of various use cases.Maintain a constant cadence of queries and research to identify segments consumption and other growth opportunities to address our audience.Qualifications:An undergraduate degree in Computer Science, Mathematics, Statistics, or fields with relevant coursework at the intersection of applied computation and large dataset analysis requiredGraduate students with similar backgrounds and advanced coursework or relevant experience in data mining, machine learning, and data analysis a plus!Strong analytical skills - ability to queries, process, and analyze dataExperienced with dataset related scripting languages such as R, Python, Ruby or SASDesire to learn new things, ability to thrive in entrepreneurial setting, and an infectious passion for making things betterDemonstrated experience pairing creative thinking with rigorous quantitative analysis About Crunchyroll  Crunchyroll is a leading global destination and platform for Japanese anime and Asian content. Through applications including Crunchyroll for iPhone, iPad, Android, Playstation®3, Playstation®4, Xbox LIVE®, AppleTV, Roku, Internet-enabled TVs, set-top boxes, affiliate websites and its own streaming website, Crunchyroll delivers more than 25,000 episodes and 15,000 hours of officially-licensed content from leading Asian media producers direct to viewers translated professionally in multiple languages within minutes of TV broadcast. The company was founded in 2006 and now has over 700,000 paid subscribers and is a Top 10 SVOD service.  About Ellation, Inc. (General)  Ellation is a leading OTT video business committed to building premium video experiences for passionate superfans and creating a more sustainable direct-to-consumer business model for content creators and programmers. Ellation operates the anime streaming platform Crunchyroll, the crafting site Creativebug, and the recently launched VRV, a curated multi-channel platform for fans of animation, games, sci-fi, fantasy, comedy, horror, and technology.  Ellation is headquartered in San Francisco, CA and is funded by Otter Media, a Joint Venture between The Chernin Group and AT&T.;"}