{"jobID": "2676302482", "jobLocation": "Boston_MA", "jobTitle": "Data Scientist – Top Insurance Carrier – Boston, MA", "companyRating": null, "companyInfo": {"Website": "www.gqrgm.com", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Data Scientist – Top Insurance Carrier – Boston, MA DATE 16 Jul LOCATION Boston COMPENSATION Competitive KEY SKILLS DESCRIPTIONSUMMARY  A top insurance carrier is seeking an experienced data scientist to manage complex statistical analysis projects. Applicants should have real world experience using machine learning, data mining and predictive modeling to deliver business solutions.  JOB DESCRIPTION  Responsibilities  · Design, build, implement, monitor and improve predictive models  · Manage full project lifecycle  · Create advanced statistical programs using R,SAS, SPSS  · Data mining  · Inter-departmental collaboration – Including acting as an advanced analytics “Champion”  Requirements  · At least a PhD or M.S. in a quantitative field (statistics, operations research, mathematics, computer science) and 3 to 5 years of relevant work experience (Preferably advanced analytics with a top 5 Insurance carrier)  · Highly skilled in at least one of the following R, SAS, SPSS  · Experience programming and implementing machine learning algorithms  · Experience with large unstructured data sets preferred  · Hadoop (ecosystem) knowledge a plus  In return we offer  · Base salary $100,000 - $125,000 + Bonus  · Competitive benefits package  · Retirement/401(k) Program  · Exceptional opportunity for personal development and career growth  Key words  Predictive Modeler, Machine Learning, Research and Development, Quantitative Researcher, Data Scientist, Statistician, Advanced Analytics, Modeler, Property and Casualty, Insurance, Researcher"}