{"jobID": "2827004897", "jobLocation": "Mountain_View_CA", "jobTitle": "Business Development Lead", "companyRating": null, "companyInfo": {"Website": "www.geomagical.com", "Headquarters": "Mountain View, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Are you a high-energy, analytical, and ambitious BD/sales professional who is enthusiastic about early startups?  Here at Geomagical Labs, we are pioneering a mass-scale consumer software platform using state-of-the-art AI breakthroughs, with founders who have taken two R&D; teams through IPO. And we're looking for a killer Business Development lead, with strong analytical skills, and a confident & persuasive personality, to develop powerful industry partnerships. This position will report directly to the CEO. RequirementsBachelor’s degree in business or marketing (MBA preferred).2+ years track record of proven success prospecting & deal-making in sales/bus dev/PM capacities.Experience driving partnerships/sales for internet SaaS, B2B or B2C consumer software products (not hardware).Comfortable \"calling high\" and pitching to all levels of an organization (while having fun doing it!)Analytical; able to quickly master technical details & distill complicated environments into crisp analyses.Entrepreneurial; can enthusiastically develop/execute strategies with limited supervision and incomplete info.High EQ communicator, and accurate interpreter of partner priorities and feedback.Great team player, fun to work with, but also an impressively-effective \"army of one\"Very productive with modern visual presentation & spreadsheet tools.Enthusiastic about early startup adventures & comfortable with ambiguity.Bonus points for consumer internet experience.Bonus points for product management experience.BenefitsRare opportunity to join an early tech startup, led by founders who've taken two startup teams through IPO.Substantial stock equity packages, of the sort only available to early startup staff.Headquartered in Mountain View, California, in the heart of the Castro Street downtown, an easy walk from Caltrain and bicycling trails."}