{"jobID": "2738745654", "jobLocation": "San_Francisco_CA", "jobTitle": "Sr. Marketing Manager, Live Ops", "companyRating": "3.2", "companyInfo": {"Website": "www.gsn.com", "Headquarters": "Santa Monica, CA", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Big Fish Games, DoubleDown Interactive, Zynga"}, "estimatedSalary": "88000", "jobDescription": "GSN Games, the leading developer in mobile and social games, is seeking a Senior Manager, Live Ops with a passion for creating player excitement and engagement through events, community and player dynamics - and measuring that excitement with data - to join our casual games studio based in Palo Alto and San Francisco. About the GSN Casual Games Studio: Our studio consists of a talented group of game artists, designers, engineers, product people and marketers who craft industry-leading mobile games providing very high quality experiences. This studio is the home of Solitaire Tripeaks by GSN, the #1 revenue solitaire game on mobile that has quickly grown into one of the top grossing games on both iOS and Android. What You’ll Do: As the leader of our Live Ops team, you’ll ultimately be responsible for a happy, healthy, active and engaged player base.  You’ll be responsible for expanding and managing a strategy of player engagement, managing our events, community tools, player services, and any other dynamics you can develop. You’ll provide the focus, processes and market knowledge to ensure that our methods of player engagement are effective, contributing to both our studio success and the long-term health of our players.  You’ll work with our killer Live Ops people (including Events, Community Management and Player Services) to optimize their work and stay on strategy. You’ll also work with Design and Marketing to develop new ideas and projects; Engineering to execute those projects; and Analytics to build tools to better understand how to quickly and dynamically shape our Live offerings to provide features of most interest to our players. You coordinate closely with Performance Marketing to deliver a great continuous live environment for players, while providing a framework for ongoing learning about the best ways to engage and communicate with them. This is a unique opportunity to join a highly functioning team and take it to the next level through developing and driving strategic direction, and continually evaluating and revising it in a culture of learning.  Our ideal candidate brings extensive experience in F2P Live Ops, is comfortable working at a hands-on level, knows how to manage awesome people, and can work with data and people to prioritize A+ priorities vs B- priorities. You use your experience to set the right goals, communicate clearly and make sure the team is going the right direction, rather than figuring out how to extract that last dollar from players. You know how to use your instincts to get to the best jumping-off point, but you embrace data that tells you what’s *really* effective. You want to learn from people on your team as much as you want to teach them. You realize that we’re just at the start of this road, and know that there are great new ideas of player engagement just waiting to be developed. Responsibilities include:Provide strategic direction and day-to- day management of our player communication and engagement channelsBuild plans (and forecast/justify them) for developing new ways to make our players happier and more engagedManage our Daily Events, Community Management and Player Services teams to help them build on the amazing successes they’ve delivered over the last 2 yearsUnderstand industry and market trends in order to bring our LiveOps offerings to “state of the market”Review data and leverage analytics teams to find new opportunitiesWith our Performance Marketing Director, own a continual process of reviewing and updating our processes for keeping our players 99% happy while we test and improve our features and communicationsIdentify important analytics ideas & plans to drive Studio Analytics, Central GSN Data team and external contractors to provide key data about users and channels that improve adding value through segmenting and targeting About You:5+ years in LiveOps for a market-leading game at a top publisher1+ years managing a LiveOps team on a marketing-leading game at a top publisherPersuasive and logical verbal & written communication skillsStrong Excel and conceptual modeling skillsFamiliarity with data tools, such as Tableau, SQL or other ways to digest dataPassion for inspiring and shepherding teams to do their best workAn ability to be flexible and thrive in a collaborative, agile environmentStrategic thinking and a willingness to embrace change and failure for learningStrong portfolio that demonstrates developing new LiveOps ideas across different channelsLike everyone on our small and efficient team, you can set direction and goals strategically, but like getting your hands dirty bringing plans to lifeWhen work gets out of hand, you think first about how to improve the tool set, not expanding headcount Bonus Points!Success in LiveOps in a casual Free2Play gameAbout Us: GSN Games delivers social casino and skill-based games designed to fuel every player’s inner winner. Founded in 1999, the company has evolved into one of the world’s top game publishers and creators. Its collection of social casino games includes GSN Casino and Bingo Bash, both top 10 grossing iPad apps, as well as Wheel of Fortune Slots: The Ultimate Collection, Solitaire TriPeaks, Mirrorball Slots, Fresh Deck Poker and more. GSN Games also features WorldWinner.com and the WorldWinner app, where players can compete for real money in skill-adapted versions of the biggest game franchises of all time. Owned by Sony Pictures Entertainment and AT&T; Entertainment Group, GSN Games operates eight locations worldwide across Boston, San Francisco, Palo Alto, Washington, D.C., London, Barcelona, Bengaluru and Zaporozhye, Ukraine. Connect with us on Twitter @insidegsngames, on Instagram @gsngames and on LinkedIn at https://www.linkedin.com/company/gsn."}