{"jobID": "2703962109", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.teespring.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Amazon, Zazzle, CustomInk"}, "estimatedSalary": "146000", "jobDescription": " Teespring is revolutionizing e-commerce through our platform that empowers anyone to easily turn their ideas into life and offer them to the world. Creators use our platform to sell high-quality products people love, with just an idea and no cost or risk. Teespring powers all aspects of bringing merchandise to life from the e-commerce tools to printing it on-demand to delivering it to buyers. Teespring has helped creators sell over 25 million products in more than 80 countries.Data ScientistWhat does our team do? The Data team is composed of analysts, data scientists and engineers who are responsible for core data collections and application. We provide analysis, build tools, and offer critical insights that drive our strategy and decision making.What is the job? The Data Scientist will be responsible for discovering hidden information in vast amounts of data and helping the team make smarter decisions to deliver even better products. The role has two practice areas. First, descriptive data science focuses on applying data mining techniques and doing statistical analysis to better understand our users and make business decisions based on their behavior. Second, predictive data science focuses on employing the data we have about our users behavior to build data-driven user-facing products.Responsibilities include: Build complex data sets from multiple data sources and provide insight into helping improve analytics Build learning systems to analyze and filter continuous data flows and offline data analysis Partner closely with the data team to develop data sources to be used in modeling and predictive analytics Solve complex analytical problems using a quantitative approach and state-of-the-art methods Consult with product teams to assist them with implementation of recommended data-driven solutionsOur Environment: Java, Ruby, REST API, Python, AWS, Spark Streaming, Vertica, mapreduceWhat do we need? 3+ years in a data analytics/scientist role Strong background in data visualization tools Experience in creating statistical models on large datasets to predict future performance of products and buying behavior Proven ability to develop database solutions by designing proposed systems and defining database physical structure and functional capabilities. Excellent communication skills including the ability to identify and communicate data driven insights Insatiable curiously and high aptitudeBonus Points: Massive scale relational databases Hadoop/Spark related experience Object oriented programming experience Experience in developing recommendation engines or algorithmsWhat do we offer?Happiness is just as important to us as hard work. What makes us different is our desire to completely change how the world thinks about apparel and custom commerce. Here are the benefits you will receive: Working with talented, collaborative, and entrepreneurial teams Medical, dental and vision insurance Company contributions toward Health Savings Accounts (HSA) Company-paid life insurance and long-term disability Flex time and paid holidays 401k Generous stock options Daily company-provided lunch and abundant snacks Endless free t-shirts!"}