{"jobID": "2822616085", "jobLocation": "Boston_MA", "jobTitle": "Senior Analytics & Reporting Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.experis.com", "Headquarters": "Milwaukee, WI", "Size": "5001 to 10000 employees", "Founded": " 1953", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Robert Half, Adecco, Robert Walters"}, "estimatedSalary": null, "jobDescription": " Experis IT, the professional division of the ManpowerGroup, invites you to join our 13,000+ consultant team today. We offer a large national presence, high stability, and tremendous remarket capabilities. We are currently seeking a Data Analytics and Reporting Analyst for our Fortune 100 client located in Boston.  Primarily responsible for providing data research and analytical support for Retail Financial Services. KEY RESPONSIBILITIES AND DUTIES: The ideal candidate will perform the following responsibilities and duties:  Requirements gathering with business partners  Documentation of the process  Develop SQL code for repeatable data retrievals to update data  Data-mine to meet ad hoc data requests  Collaborate on development and measurement of financial product improvement initiatives.  Support project works led by manager  Prepare analysis and presentation of periodic performance management results  Assist in the development of business cases in support of business growth initiatives  Perform ad hoc analysis, participate in cross functional special projects  Work in a team environment but be the technical/data subject matter expert  Provide support to operationalize advanced analytics solutions and capabilities in partnership with different centers of excellence and I.T. partners QUALIFICATIONS: Approximately 4 or more years experience working with relational databases  Skilled at writing code and programming in SQL.  Experienced in and comfortable working with Teradata environments.  Able to extract data and summarize business performance data  Comfortable working in environments where documentation is limited.  Bachelor's degree in Computer Science, Engineering, Finance, Marketing, or related discipline  Strong analytical and quantitative skills  Flexible, detail oriented and driven  Solid understanding of financial services products, including retirement, banking, lending, brokerage, and life insurance products a plus. ADDITIONAL QUALIFICATIONS: Experience with SAS, SPSS or R  Experience with OBI, Tableau or other data visualization solutions  Experis is an Equal Opportunity Employer (EOE/AA)"}