{"jobID": "2787849007", "jobLocation": "New_York_NY", "jobTitle": "Data Scientist Intern", "companyRating": null, "companyInfo": {"Website": "www.nucleusmarketing.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "WHY YOULL LOVE THIS JOB  Nucleus the joint venture recently formed by Gannett, Hearst, McClatchy, tronc, Inc. and additional affiliatesprovides national brands the ability to connect, with scale and ease, to affluent consumers in environments of trust. Nucleus creates innovative solutions for national advertisers across a group of premier publishers in news media, offering brands influential advertising environments and access to 70% of consumers in the top 30 US markets across existing and emerging digital platforms.  We are looking for summer interns to join in the continued development and evolution of Nucleus. With a wealth of ground-breaking new data and metrics, we are looking for people who can analyze, validate and provide meaningful context around it. This is an excellent opportunity for anyone who has an interest in statistics, metrics, and data.  HERES WHAT YOULL DO (RESPONSIBILITIES INCLUDE BUT ARE NOT LIMITED TO:) Support staff on day-to-day project operations including project status updates, client deliverables, note taking, data prep, etc.Develop analyses/code to support client projects, including marketing mix modeling, attribution, and purchase funnel analyticsEfficiently prepare large, disparate data sources for analysisPrepare client-facing material (ex. PowerPoint Slides and Charts) to support analytical insightsEffectively distill data into coherent analysis, insights and ultimately enhance storyline for analytics results through authoring client communication materials HERES WHAT WERE LOOKING FOR (QUALIFICATIONS & REQUIREMENTS)  Qualifications/Experience Undergraduates and Masters students studying Computer Science, Statistics, Mathematics, or other relevant STEM degrees.A self-starter that's highly accountable and will take ownership of delivering your workAbility/Desire to learn new skills and technologies quickly.Experience with R, Python or SQLExperience programmatically structuring and cleaning data, and not just analyzing highly cleaned data setsA strong foundation in probability, statistics, and algorithm developmentUnderstanding of statistical and predictive modeling techniques such as generalized linear modeling, decision trees, association rules, clustering, regression, machine learning, probability networks, and neural networks.Excellent verbal and written communication skills.WHAT WE OFFER Nucleus offers a strong compensation and benefits package, including health, vision, dental, commuter, 401k with a strong match and much more. This is an excellent opportunity to get in on the ground floor with a company built on the trust and legacy of established brands, with the passion and growth potential of a startup. We are a casual but professional team, with this role working in our New York office."}