{"jobID": "2831257458", "jobLocation": "Brooklyn_NY", "jobTitle": "Design Intern", "companyRating": null, "companyInfo": {"Website": "www.afropunk.com", "Headquarters": "Brooklyn, NY", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Other Organization", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "AFROPUNK is defining culture by the collective creative actions of the individual and the group. It is a safe place, a blank space to freak out in, to construct a new reality, to live your life as you see fit, while making sense of the world around you.AFROPUNK is known for their images and branding. All of our artwork has a certain aesthetic and look that carries our message of diversity, embracing other, and breaking rules. From helping to curate to editing works that will be seen by millions worldwide, your role will contribute to the many images, flyers, and artwork that AFROPUNK will create.DUTIES/RESPONSIBILITIESPassion to create innovative designs for web and print campaignsProficiency in the Adobe Creative Suite for digital and print design (InDesign, Illustrator, and Photoshop — anything else is a perk!)Effective writing and editing skillsSuggesting images for web pagesAble to resize images and create/manipulate social media layoutsAttention to detailCreate variations of imagery for social media or emails/newsletterInterest in emerging web and digital technologiesPersonal Characteristics: ATTENTION TO DETAIL!, SELF-STARTER WHO IS INVESTED IN BEING HERE, AND DOING THEIR BEST, NOT JUST SHOWING UP TO A JOB.Skill using social media platforms for campaigns and branding (Facebook, YouTube, Twitter, LinkedIn, Blogging, etc.)APPLICATION DETAILS/QUALIFICATIONS Primary:-Experience with graphic design, Adobe Illustrator, Photoshop, Adobe Premiere or iMovie, interest in creating artistic content-Experience with animation or motion graphic design –Adobe After Effects, motion graphics, photography, video editing, Tumblr, Pinterest, social media layouts, GIF making In addition to CVs/resumes: samples of work, including portfolios, websites, images Period of performance: ASAP – September 2018 with possible extension to the end of the yearHours: Min. 25 hoursPerks & Environment: Real world opportunity to staff/work & get exposure to festival and event production. Opportunities to manage programs and key campaigns with demonstrated performance and leadership, including special bespoke events like private HBO series premiere dinners; Battle of the Bands performances; Film screenings & panel/workshops with notable figures. AFROPUNK is a fast-paced environment. Questions are expected & welcomed. Free thinkers and creative ideas and input are highly encouraged in our office culture."}