{"jobID": "2823447138", "jobLocation": "San_Francisco_CA", "jobTitle": "Head of Marketing Channel", "companyRating": null, "companyInfo": {"Website": "www.agoda.com", "Headquarters": "Singapore, Singapore", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "This role is based at Agoda Bangkok office, full-time Are you looking for a unique opportunity to work at the cutting edge of marketing optimization? Would you want to work in a rapidly growing company with some of the sharpest minds in the industry? How about living in one of the worlds most beautiful countries, one top-rated by expats? Then Agoda is the place for you!  We are seeking top-notch candidates to own important marketing channels such as Search, Display, Agoda loyalty program, Mobile App marketing, discounting, and more. The head of marketing channel is a senior role overseeing a team or marketing managers responsible for over one or more of these areas, depending on the final outcome of the recruitment process.  The Agoda marketing department is highly data-driven and focused on developing and leveraging proprietary in-house tools to automate and scale marketing programs that maximize the lifetime value of Agoda customers through measurable marketing programs and channels. You will drive new strategies, idea generation, growth and development of products, as well as people. You will be in a senior manager role in our international digital marketing team and should be comfortable working with product managers, engineers, and teams ranging from finance to analytics. Because of the significant impact that these channels have on our overall business, you will have regular interaction with the senior management team, including COO, and CEO.  This role is based at Global Operations Office at Bangkok, Thailand.  Responsibilities: You will own a marketing channel and lead Agodas advertising strategy and operations in that channel, including managing, motivating and developing the team you will manageOwn a significant part of Agodas marketing spend including strategy, planning, and execution of marketing activitiesDrive the marketing team to test, analyze and optimize campaigns, deliver data-driven insights.Work with Agodas Product Owners to implement new IT developments to improve existing advertising programs or add new advertising programs to the Agoda channel mixManage the relationships with key partners and marketing channels, including commercial terms, bidding strategies and technical implementationsCommunicate channel strategy, plans, and results with stakeholders and senior management.Develop a deep understanding of Agodas website offerings and of Agodas target markets to create actionable advertising programsInnovate to drive improvements by leveraging the latest technologies, analytics and optimization processes Qualifications: Relevant experience in high responsibility roles in online marketing and/or analyticsStrong analytical abilities, especially with respect to experimental design and analysisStrategic thinking and planningHands-on mentalityExcellent skills in presenting and analyzing data and creating actionable reportsExperience in and a passion for projects involving big data and statistical modelsExcellent interpersonal skills and demonstrated ability to report and persuade different levels, including senior managementAbility to work under pressure in a fast-paced/rapidly changing environmentDetail-oriented with strong organizational and time management/prioritization skillsProven skills in recruitment and staff leadershipWe welcome both local and international applications for this role. Full visa sponsorship and relocation assistance available for eligible candidates.Apply!"}