{"jobID": "2662118673", "jobLocation": "Bedford_MA", "jobTitle": "Data Science Intern, July - December", "companyRating": null, "companyInfo": {"Website": "www.irobot.com", "Headquarters": "Bedford, MA", "Size": "501 to 1000 employees", "Founded": " 1990", "Type": " Company - Public (IRBT) ", "Industry": " Retail", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " SummaryAre you excited about spelunking in robot data? iRobot is looking for a Data Science Intern to join our team Summer/Fall 2018 (July- December).  iRobot Corporation, with a mission of “empowering people to do more,” is at the forefront of the development of robotics and artificial intelligence technologies. We've become one of the world’s preeminent specialist designers and builders of consumer robots, and we invest in the development and growth of our people in a culture of empowerment, innovation, and fun. Would you like to come work with some of the most talented and influential people in the robotics field utilizing cutting edge data science technologies, in an exciting, fast-growing industry?  Our team's mission is to creatively solve problems related to iRobot’s data sources and bring data-informed intelligence to our customers and colleagues. As an intern on our team, we’ll help you develop a strong background in applying probability and statistics to real data, as well as defining a problem and evaluating the effectiveness of different techniques in solving these problems. Previous experience with financial modeling, signal processing, or other advanced methods on time-series data is not required but would make a you a very attractive applicant. With regards to computing skills, we're looking for someone who can manipulate and quickly prototype solutions that work on large data sets in a clear (and possibly interactive) manner. An understanding of algorithms, operating systems, and modern server hardware is also a plus.Essential Functions/ Job Duties Use data analysis to solve problems for our customersProgram working prototypes in a modern analytical language (Python, R, JS/D3, or others)Make creative use of public and private datasets to improve our customers' experiencesContinuously push the edge of what iRobot Data Science can deliver in a cost-effective mannerInteract with other internal teams on a regular basis, both to sell new ideas and to elicit feedback on old onesWork as part of a fun teamQualificationsYou are available to work on-site 40 hours a week in our Bedford OfficeYou have strong problem-solving and analytical skillsYou have rich communication skills to explain complex solutions to non-data science peersYou also have strong computer skills in your language of choice (such as Python, Clojure, Mathematica, Scala/Java, or even R).You have graduate-level background in data science, statistics, or mechanical/building/electrical engineeringYou have a sense of humor, and enjoy solving puzzlesYou are self-motivated and able to work in a dynamic, delivery-focused environment iRobot is an “Equal Opportunity Employer, Minority / Female / Veteran / Disabled”About UsWe are the leading global consumer robot company, designing and building robots that empower people to do more, both inside and outside of the home. Founded by MIT roboticists who had the vision of making practical robots a reality. To date, we have sold over 20 million robots and globally employ more than 600 of the robot industry’s best and brightest. iRobot is committed to fostering invention, discovery and technological exploration in the pursuit of practical and valuable robot products for the home. iRobot stock trades on the NASDAQ stock market under the ticker symbol IRBT.  iRobot is headquartered in Bedford, Massachusetts, accessible by our corporate shuttle directly from Alewife Station. We also have offices in California, Europe, Japan, China & Hong Kong. Imagine the future you could help us build as a fellow iRoboteer! Check out #LifeAtiRobot and follow us on Instagram: @irobotcareers  iRobot is an Equal Opportunity Employer"}