{"jobID": "2738642001", "jobLocation": "New_York_NY", "jobTitle": "Data Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.point72.com", "Headquarters": "Stamford, CT", "Size": "1001 to 5000 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "87000", "jobDescription": " About Cubist  Cubist Systematic Strategies is one of the world’s premier investment firms. The firm deploys systematic, computer-driven trading strategies across multiple liquid asset classes, including equities, futures and foreign exchange. The core of our effort is rigorous research into a wide range of market anomalies, fueled by our unparalleled access to a wide range of publicly available data sources. Job Description We are passionate about data. We collaborate to build elegant, effective, scalable and highly reliable solutions to empower predictive modelling in finance.  Cubist’s Data Services group is looking for a Data Analyst to join our dedicated team. Our group is responsible for the timely delivery of comprehensive and error-free data to some of the most demanding and successful systematic Portfolio Managers in the world.  This exceptional individual will be a member of a small team of Data Scientists/Analysts who play a vital role in ensuring the smooth day-to-day implementation of a large research infrastructure, and the live production trading of billions of dollars of capital across global capital markets, including equities, futures, options and other financial instruments.  Job Responsibilities Identifying potential data sourcesCoordinating with compliance team and legal team on new vendor trial/subscription processAssisting with collecting and maintaining vendor overviews and content offeringsAssisting with data questions and requests from investment teamsSetting up feed downloads and monitor check-in databaseMonitoring the automated data collection and cleansing infrastructureAssisting with scheduling meetings and conference calls between data users and expertsAssisting Data team with interoffice travel arrangements, expenses, etc.Assisting in organizing presentationsManaging data trial repository permissionsDownloading trial datasets from vendor FTP sites or other delivery mechanismAssisting Data Team with manual data processing as requiredMaintaining Cubist Data Wiki contents Desirable Candidates Bachelor degree requiredBasic understanding of SQL.Programming skills in Python and at least one of C#, C++, or Java are a plusProficient knowledge of Microsoft Outlook, Excel, and WordFinancial industry experience is preferred but not requiredStrong organization, communication and interpersonal skillsAttention to detail and a love of processStrong oral and written communication skillsAbility to exercise sound judgment in assessing and determining how to handle queries, calls and issuesAbility to multitask and prioritize assignments"}