{"jobID": "2830924064", "jobLocation": "El_Segundo_CA", "jobTitle": "University Programs: Fall Software Engineering Intern (Junior, Senior or Graduate)", "companyRating": "3.7", "companyInfo": {"Website": "www.raytheon.com", "Headquarters": "Waltham, MA", "Size": "10000+ employees", "Founded": " 1922", "Type": " Company - Public (RTN) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": "***Great opportunity for current college students entering their Junior or Senior year by Fall 2018 or college graduate students (entering or currently enrolled) in a graduate program by Fall 2018. If you are not a current college or graduate student, please visit our other opportunities at www.raytheon.com/careers and apply!***As a defense contractor, there are specific programs requiring a certain level of security clearance and special access for assigned staff. The selected candidate will be required to secure these accesses. Not being able to secure the Interim Secret Security Clearance needed for this position may result in an offer of employment being rescinded.This position requires a U.S. person or the ability to obtain an Export Authorization from the appropriate government agency for non-U.S. persons.Job Description: The Software Engineering Center is seeking an enthusiastic and highly capable software engineer with experience developing embedded radar software. The ideal candidate will employ Raytheon software development processes. Responsibilities include but are not limited to: Work effectively and contribute during all phases of the software development life-cycleDevelop radar mode software in C and/or AdaShow strong investigation and trouble-shooting skills to assess issues and develop resolutions to themWork proactively to complete tasks with some oversight directionCommunicate effectively with team members across disciplines, project management, and customersActively participate in program and customer meetings and reviews when neededU.S. Citizenship status is required as this position will need a U.S. Security Clearance within 1 year of start date. For Multi-Level Intern Requisitions:  This position can be a Salary Grade of G04, G05 or NUG based on the candidate's qualifications as they relate to the skills, experience and responsibility requirements for the position. G04 (College Junior by Fall 2018) - must have completed 60 hours of collegeG05 (College Senior by Fall 2018) - must have completed 90 hours of collegeNUG (Post- Graduate-Masters-PhD by Fall 2018) - must have an undergraduate degree and currently enrolled or about to enroll in a graduate degree programRequired Skills:Experience developing software utilizing C, C++, Ada or related tools/languages (either at school or combined school and work experience)Completed coursework in the following areas: Calculus for Engineers and ScientistsPhysics for Engineers and ScientistsSoftware engineeringCandidate should have appropriate courses and experience (work or school projects) that have prepared them to undertake real work and make a meaningful contribution in a professional software engineering environmentCandidate should be proficient with general purpose computer applications such as Microsoft Word, Excel, and PowerPointMust be a college Junior, Senior or Graduate student by Fall 2018This position requires the eligibility to obtain a security clearance. Except in rare circumstances, only U.S. citizens are eligible for a security clearance.U.S. Citizenship is requiredDesired Skills:At least 1 Year Previous Software related co-op / internship experienceAt least 1 Year working knowledge and experience in multiple phases of the software development life-cycleCompleted coursework or equivalent knowledge/experience in following areas: Software Architecture, Signal processing, Data processing or related engineering activitiesAgile/Lean, Continuous Integration, and similar development techniquesSoftware IntegrationAssembly languageAlgorithmic FundamentalsGreen Hills Integrity, VxWorks or equivalent development toolsStrong interpersonal skills and work habits:Good work ethicAbility to learn quickly and apply knowledge towards assigned tasksAbility to work well independently and in teamsAble to work with minimal supervisionExcellent oral and written communication skillsSelf-motivated and highly ambitious"}