{"jobID": "2685362806", "jobLocation": "Seattle_WA", "jobTitle": "Data Analyst", "companyRating": "4.2", "companyInfo": {"Website": "www.logic2020.com", "Headquarters": "Seattle, WA", "Size": "201 to 500 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "59000", "jobDescription": "Data AnalystSeattle, WAAbout the Role. . . Data Analysts review functional requirements and assist with functional specifications. They work directly with our customers to develop insights into business and data models and perform data analysis activities to identify relational data issues. About you . . .Proficient at assessing business requirements/model and gaining an understanding of business metricsComfortable communicating technical issues to non-technical usersExcellent at communicating over written, verbal, organizational, and presentational channelsYou excel at being flexible and juggling multiple projects in a fast-paced environmentComfortable working under pressure independently handling multiple projects and deadlinesQualifications. . .3+ years of experience working with SQL queries and accessing data2+ years of consulting experience, preferably at a \"Big 4\" or similar firmDemonstrated expertise in business analysis and data analysisExperience writing requirements and specifications for IT systemsWorking knowledge of DAXAn undergraduate degree in technology or businessAbout Logic20/20. . . Logic20/20 is one of Seattle’s fastest growing full-service consulting firms. Our core competency is creating simplicity and efficiency in complex solutions. Although we make it look like magic, we succeed by combining methodical and structured approaches with our substantial experience to design elegant solutions for even the most intricate challenges. Our rapid growth is in response to our ability to deliver consistently for our clients, which is directly related to the quality of the people we hire.  The past two years, we’ve been in the top 10 “Best Companies to Work For” ….. why? Our team members are highly self-motivated, comfortable conceiving strategies on the fly, and enjoy working both individually and as part of a team. Our environment is very high-energy and demanding, and individuals with remarkable enthusiasm and a can-do attitude are joining our team. We have lots of fun, focus on our employees and our clients, and work to bring our best to every opportunity."}