{"jobID": "2821030010", "jobLocation": "Bellevue_WA", "jobTitle": "Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.beyondsoft.com", "Headquarters": "Bellevue, WA", "Size": "201 to 500 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "113000", "jobDescription": "We are looking for only W2 candidates No C2CPosition- Data ScientistLocation- Bellevue,WA Based in Bellevue, WA, Beyondsoft has a growing data science consulting practice centered around Machine Learning as a Service. We are seeking a creative, collaborative, adaptable data scientist to join our agile team of highly-skilled developers, data scientists and project managers. You will be responsible for all aspects of consulting engagements: in-person client meetings; understanding, and achieving, the business goals for the Machine Learning project; integration of custom APIs and self-service analytical dashboards into the data workflow; building custom data science visualizations; and building our presence (and brand-awareness) in the Pacific NW data science community.  Responsibilities:  Key attributes for success: You enjoy taking ownership of projects from start to finish and can be flexible as the project needs evolveYou love solving (often complex) problems across business verticalsYou are customer-focused and can articulate data science terms and processes to non-expertsYou know the techniques to ensure data accuracy and completenessYou desire working in a dynamic, agile environment in a small team with often rapid turn-around timesYou have a desire to learn new technologies on the job and grow your skills and careerYou know when to put in the extra time to complete the projectYou are comfortable working directly with sales and delivery teamsYou are willing to work in a globe team distributed in different time zones Qualifications: Master or Doctor degree in Machine Learning, Mathematics, Statistics, Computer Science or a related technical fieldA proven track record of data analysisAt least 1-3 years’ experience using statistics and analytics to tackle complex problems2 - 3 years coding experience in Python and/or R, Tensorflow, Matlab or other statistical/machine learning softwareExperience with RESTful APIsAbility to extract and transform data from various sources (SQL, CSV/TSV, JSON)Ability to write production-quality code utilizing knowledge of data structures and algorithmsA proven understanding of services offered by Azure, AWS or GCP, and how to use them for maximum valueAbility to collaboratively multitask across projects and problemsWorking knowledge of self-service Business Analytics applications (e.g. Power BI, Tableau, Quicksight)Strong verbal and written communication skills We are an equal opportunity employer and value diversity at our company. We do not discriminate based on race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability"}