{"jobID": "2758271927", "jobLocation": "Burlington_MA", "jobTitle": "Data Analyst Nursing Support", "companyRating": "2.6", "companyInfo": {"Website": "www.laheyhealth.org", "Headquarters": "Burlington, MA", "Size": "5001 to 10000 employees", "Founded": " 2012", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Beth Israel Deaconess Medical Center, Boston Medical Center, Tufts Medical Center"}, "estimatedSalary": "61000", "jobDescription": " Position Summary: Under the general direction of the Manager of Nursing Special Projects, the Data Analyst performs research and analysis of complex healthcare data to aid in the development of performance dashboards, balanced scorecards, and ad-hoc reports. The Data Analyst serves as the subject matter expert of the data repositories available within the organization by obtaining an in-depth understanding of each source system, including but not limited to; National Database of Nursing Quality Indicators (NDNQI), Nursing Quality Database (NQDB), Press Ganey, Vizient, ANSOS, PeopleSoft, and Hyperion. The Data Analyst acts as the operational owner for nursing-specific metrics, utilizing data to support, manage, and sustain both operational and improvement activities within the department.  Essential Duties & Responsibilities including but not limited to: Employ statistical methods to analyze data to support business intelligence.Utilize statistical techniques and applications to provide and apply quality assurance processes for data submissions prior to transmission to business partners.Apply sound data collection and data management practices in order to support operational programs and improvement projects within the Division of Nursing.Analyze data, including monthly key performance indicators, and identify early trends that illustrate opportunities to implement process improvement initiatives.Track the results of implemented initiatives for progress and impact.Actively review and suggest improvements to current or planned systems and processes based on your knowledge of healthcare data.Provide recommendations of specific actions or work based on analysis and research.Perform various ad-hoc analyses to drive business decisions across the Division of Nursing.Responsible for identification and analysis of errors/inconsistencies in the data and provides timely resolutions.Work with operations to resolve any data discrepancy related to user input, user error, or poor source system design.Professional Growth / Self Improvement:Maintains current knowledge of trends and advances in the field of nursing and healthcare data management. Progressive knowledge in finance, quality/safety, patient experience, nursing professional development and employee engagement.Pursues self-awareness, actively seeks feedback, accepts constructive criticism, and modifies behavior accordingly.Engages in professional development activities such as education and leadership development, participation in professional associations, or other appropriate activities.Identifies knowledge gaps and takes appropriate courses or seminars to improve understanding.Identifies internal resources as sources of expertise to achieve learning goals.QualificationsMinimum Qualifications: Education: Baccalaureate Degree required. .  Licensure, Certification, Registration: None Skills, Knowledge & Abilities:Ability to prioritize projects according to knowledge of the subject matter as well as Lahey?s strategic goals and objectivesStrong knowledge and understanding of healthcare operations and systems.Experience designing dashboards and key performance indicatorsExperience with healthcare data sources (e.g. NDNQI, NQDB, Patient Experience, Vizient)Expert level knowledge in Microsoft ExcelDemonstrated competency in MS Word, Access, SharePoint, etc.Strong analytical skills, with particular emphasis on data management and statistical process control.Strong aptitude for analytical thinking and demonstrated data skills.Demonstrated ability to work with large data and self-direct in analysis to reach recommendations and conclusions.Able to discover, understand, and translate business language and rules from customer to database developers and vice versa. Experience: A minimum of three years of healthcare experience.  Shift DAYS About Lahey Health  At Lahey Hospital & Medical Center, as one of the world's premier health care organizations, we provide superior health care leading to the best possible outcome for every patient. We exceed our patients' high expectations for service each day. We also help advance medicine through research and the education of tomorrow's health care leaders  We care for our patients with compassion and openness, unsurpassed expertise, a drive for continuous learning improvement, and with respect, caring, teamwork, excellence and commitment to doing our personal best.  Join our team and our mission of excellence by applying today!  How To Apply  Please apply directly online at http://www.laheyhealth.org/engage-with-us/careers. Use the Job ID number to quickly locate the appropriate job listing. Once you have located the desired job, click on the checkbox in the 'Select' column, and then click the 'Apply Now' button, located at the bottom of the screen. Please note you are only able to select 5 jobs at a time.  Lahey Colleagues please apply directly through Colleague Connection using your Login and Password. "}