{"jobID": "2746914689", "jobLocation": "San_Jose_CA", "jobTitle": "Insurance Sales Representative", "companyRating": null, "companyInfo": {"Website": "www.appreciationfinancial.com", "Headquarters": "Las Vegas, NV", "Size": "201 to 500 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "We have school districts and educators that need help now and we are searching for new team members to help service our demand. Would you like to be the trusted and respected advisor servicing existing school districts doing meaningful work for amazing people?We are looking for like-minded people that share the same drive and ambition to serve others and grow something bigger than themselves.What we do:We help teachers and staff with their retirement and insurance needs. We do this through approved contracts and relationships with the school districts. It’s a privilege to be able to help the same people that helped raise us as children. Our office is growing, and we are searching for talented sales professionals and leaders to join the team and take on the important and critical role of educating the educators.The Top 7 Rewards of Working with Appreciation:Regular 9 to 5 hours and the best quality of life possible in insurance and financial servicesThe ability to build a VESTED book of business and significant residual income that will pay you for yearsPre-set appointments – no more leads, cold calling, friends, and family or any of those ineffective things!Eliminate overhead in leads, gas, and time wasted driving all over the placeFull back office support to simplify your life (case management, admin, CRM, tech, commissions, sales reports)Team-building & agency opportunities that are unrivaled within our industryPublic employee marketplace is consistent, recession-proof, and growing.Requirements: Our most successful reps and leaders have come from all walks of life so our requirements are a little different than the traditional thought of education, resumes, and references.What makes someone successful with us are the following characteristics:CoachableAccountableHardworkingResourcefulPositive AttitudeSincere desire to help peopleIf you possess these traits, chances are you will be our next superstar and we'd like to chat with you.*** PLEASE NOTE: This is a 1099 independent contractor full commission position (commissions, bonuses, incentives, residual income) and Appreciation Financial is a Results-Only Work Environment (ROWE).If interested, please send your info/resume and you will be contacted within 72 hours for an initial phone interview to learn more."}