{"jobID": "2741639834", "jobLocation": "Sunnyvale_CA", "jobTitle": "Associate Medical Director - Hospice Physician", "companyRating": "2.7", "companyInfo": {"Website": "www.pathwayshealth.org", "Headquarters": "Sunnyvale, CA", "Size": "201 to 500 employees", "Founded": " 1977", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " VITAS Healthcare, Hospice by the Bay"}, "estimatedSalary": "239000", "jobDescription": " DescriptionFor over 40 years Pathways has been a Bay Area pioneer, leader and innovator in Hospice, Home Health, Palliative Care, Private Duty, and Care Management services. We provide care at home or in settings such as assisted living, a nursing home, or the hospital. We have offices in Sunnyvale, South San Francisco, and Oakland. Patients and their families know us for our personalized, high quality care, delivered with empathy, kindness, and respect. We are seeking an experienced and compassionate Hospice Physician to join our team. Come contribute your clinical knowledge to our patients, clinical staff and to expanding programs with our community partners. Position: Associate Medical Director Locations: We have needs in the following counties, Santa Clara, San Mateo and San Francisco Schedule: Full Time, Part Time or On-Call Positions Available AREAS OF RESPONSIBILITY: The Hospice Physician is a Board Certified licensed physician in the State of California who assumes overall responsibility for the medical component of the patient care program. This includes the following: assesses appropriateness of admissions, certifies terminal prognosis and participates in establishing, reviewing and revising plans of care for Hospice patients; participates in development of in service education and quality assurance programs; acts as a medical resource/liaison to physicians and health care providers; and acts as a resource for and member of the Interdisciplinary Group (IDG). The ideal candidate will provide an oversight for the clinical component of the Hospice patients’ care; including visiting the patient and families for evaluation and assessment when appropriate. This individual also performs other duties as assigned consistent with skills and training for this position in alignment with the goals and mission of Pathways Home Health & Hospice. QUALIFICATIONS:Board Certified in Internal Medicine with current unlimited license to practice medicine in the State of California.Board Certified or eligible for Board Certification for Palliative Medicine.Current controlled substance Registration certificate issues by the U. S. Department of Justice Drug Enforcement Administration.Current CPR certificate.Recruiter Contact: Trisha Bingham  Director of Talent Acquisition  P: 408-773-4202  E: tbingham@pathwayshealth.org"}