{"jobID": "2755008984", "jobLocation": "San_Jose_CA", "jobTitle": "Analog/Mixed Signal Circuit Design Intern", "companyRating": null, "companyInfo": {"Website": "www.xilinx.com", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 1984", "Type": " Company - Public (XLNX) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Qualcomm, Intel Corporation, AMD"}, "estimatedSalary": null, "jobDescription": "DescriptionXilinx is the leading provider of All Programmable FPGAs, SoCs, MPSoCs and 3DICs. Xilinx's all-programmable devices are designed into  tens of thousands of products that improve the quality of the everyday lives of billions of people worldwide. For over 30 years, Xilinx  has been behind some of the greatest advancements in technology and science - from the industry's first fabless semiconductor model  to the NASA Curiosity Mars Rover, to today's autonomous vehicles and hyperscale data centers. Xilinx uniquely enables applications  that are both software-defined, yet hardware optimized - enabling smart, connected and differentiated applications across  technology's biggest megatrends, including Machine Learning, 5G Wireless, Embedded Vision, Industrial IoT and Cloud Computing and more.Xilinx Serdes Technology  Group develops high-performance, multi-protocol wireline transceivers in  state-of-the-art CMOS process. We are currently seeking an  analog/mixed-signal design intern to join our world-class team.  The candidate will be  responsible for the design of a high-speed ADC-based receiver or DAC-based  transmitter  - Define DAC/ADC  circuit architecture optimized for a PAM4 electrical an optical links  - Perform link level  simulation in Matlab or HSPICE to proof the architecture  - Design circuit  components (e.g. SAR-ADC, S/H, Analog Front-end) required to implement the  architecture in advanced FinFET process  This position is open for Ph.D students interested  in pursuing career in analog/mixed signal circuit design. The candidates must  have taken a graduate-level circuit design classes covering analog/digital  circuit design and data-converters. Hands-on experience using circuit  simulators as part of a class design project and project/lab-work experience in  high-speed circuit design and high-speed data converters are a plus."}