{"jobID": "2738679213", "jobLocation": "Boston_MA", "jobTitle": "Machine Learning Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.vrtx.com", "Headquarters": "Boston, MA", "Size": "1001 to 5000 employees", "Founded": " 1989", "Type": " Company - Public (VRTX) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Biogen, Shire"}, "estimatedSalary": "123000", "jobDescription": " Vertex is seeking a Data Scientist with expertise in the strategy, design, development, and implementation of applied data science efforts across health care, life science, and operational domains. This is a unique opportunity to help build a data driven organization. You will play a key role in supporting the build-out of enterprise-wide data science team, culture and capabilities across R&D;, clinical, commercial, and G&A; to address high-impact research and business questions. The data scientist will be responsible for being a driving contributor for a wide variety of cross-functional analytic projects and initiatives from problem definition to data acquisition, analysis, and development of solutions in close collaboration with internal stakeholders from across the organization and participate in strategic planning around analytics methodology, technologies, staffing, and training. Responsibilities:Develop innovative and fit for purpose solutions across the business.Apply machine learning and statistical approaches to projects to provide innovative solutionsProvide expertise with advising and deploying advance statistical techniques for solving problems and advancing business opportunities.Contribute to the design, development, and implementation of data science solutions that guide decision-making and building foundational capabilities.Plan and deploy methodological standards, standardized processes, demos, and POCs for the company’s highest priority business needs.Advise senior management on opportunities and gaps in the company’s current capabilities across data science technology and infrastructure, and recommend plans for growth through adoption of new methods and/or technologies.Mentor and support the training of new and existing staff in data science and advanced analytics.Support the translation and appropriately champion advanced analytics results and capabilities to non-technical audiences.Participate in the broader data science community to stay current with data and software development.Foster an entrepreneurial mindset and collaboration with IT and business partners and internal analytics community."}