{"jobID": "2638192031", "jobLocation": "Boston_MA", "jobTitle": "Corporate Account Executive - SaaS Sales", "companyRating": null, "companyInfo": {"Website": "www.hubspot.com", "Headquarters": "Cambridge, MA", "Size": "1001 to 5000 employees", "Founded": " 2006", "Type": " Company - Public (HUBS) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Marketo, Eloqua"}, "estimatedSalary": null, "jobDescription": " HubSpot is looking for a Corporate Account Executive to join our high performing sales team. As a Corporate Account Executive, you will be in a role where your sales process will align with the way people research and and make buying decisions today In this inside sales role, you will target companies across all industries with over 200 employees.  Our new marketing, sales and CRM product models provide you with warm leads. You will cultivate inbound leads generated from engagement efforts from HubSpots marketing team and partner with internal Business Development Reps to research prospective customers, create outreach strategies, and identify additional opportunities.  In this role, you will find visibility, flexibility and world class coaching and training. This is an inside sales/territory based position working in our Cambridge HQs or remotely. Although travel is not a necessity, for the right opportunity, we understand the value in face to face meetings. We are looking for sales professionals with the following:Commitment To Win - Consistently achieve their personal and professional goals.Intellectual Curiosity - A strong desire to learn and understand and ask thoughtful questions.Critical thinking - The ability to find and synthesize information, apply logic to problems and quickly analyze information to provide a recommendation.Coachability - You are humble, acknowledge strengths and weaknesses and take feedback well. Able to self diagnose and translate into an actionable solution.Strong communicators and motivatorsCorporate Account Executives at HubSpot: Are passionate about transforming sales and marketing, and whose values align with the Hubspot culture. We are on a mission to help companies align their marketing and sales to match how people research and make buying decisions. We achieve our mission by being humble, empathetic, adaptable, remarkable and transparent. Have excellent time management and organizational skillsHave a customer first mentalityAre excellent listeners and know how to ask effective follow-on questionsUnderstand how to tell compelling stories which offer valuable and unique perspectivesLead our prospects through a challenger sales approach that delivers value through constructive tensionsHave a track record of being closersKnow the HubSpot product eco-system inside and out and can directly tie customer pain points to HubSpot product solutionsConsult our free user base into our multi-tiered paid product install baseQualifications:2+ years of quota carrying and closing experience with a consistent track record of success.SaaS sales experience is a plus, but not a requirement.Experience leading a consultative sales processExperience using CRM tools to manage and forecast sales opportunitiesExperience in successfully executing complex sales cycles with C-Level executives.Strong analytical skills to identify trends and patternsAbout HubSpot HubSpot helps millions of organizations grow better, and wed love to grow better with you. Our business builds the software and systems that power the worlds small to medium-sized businesses. Our company culture builds connections, careers, and employee growth. How? By creating a workplace that values flexibility, autonomy, and transparency. If that sounds like something youd like to be part of, wed love to hear from you.  You can find out more about our company culture in the HubSpot Culture Code, which has more than 3M views, and learn about our commitment to creating a diverse and inclusive workplace, too. Thanks to the work of every HubSpotter globally who has helped build our remarkable culture, HubSpot has been named a top workplace by Glassdoor, Fortune, Entrepreneur, and more.  HubSpot was founded in 2006. Were headquartered in Cambridge, Massachusetts, and we have offices in New Hampshire, Dublin (Ireland), Sydney (Australia), Singapore, Tokyo (Japan), Berlin (Germany), and Bogotá (Colombia)."}