{"jobID": "2819832188", "jobLocation": "Boston_MA", "jobTitle": "Architectural Intern", "companyRating": "4.1", "companyInfo": {"Website": "www.whrarchitects.com", "Headquarters": "Houston, TX", "Size": "51 to 200 employees", "Founded": " 1984", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "49000", "jobDescription": " Title Architectural Intern Category Architecture DescriptionEYP is seeking a full-time Architectural Intern to assist project teams and work on a variety of projects in various stages of design and construction. This individual will perform basic design and technical tasks requiring application of standard techniques and knowledge while working under direct supervision of more experienced staff. Job Responsibilities:Perform architectural assignments, compile data, perform design computations, prepare architectural drawings, and inspect architectural features of projects in constructionPerform graphic tasks according to the EYP Project Delivery ManualUnderstand and execute “red marked” revisionsDevelop details from sketches generated by Project ArchitectsDraft construction documents based on previously developed informationDemonstrate awareness of coordination with specificationsDemonstrate awareness of the implications of building codes and other regulatory requirementsUse technology and methodologies to create innovative approaches to building designConsistently strive to improve technical quality of work product by keeping abreast of new technologies, changes in building codes, and advances in the industryWork collaboratively in a cross discipline environment to produce integrated project documents, and ensure integrated design approaches and solutions Position Requirements Pre-Professional or Professional degree in Architecture or equivalentAt least one year of related experienceAbility to use BIM and other computer generated design softwareExperience with Revit preferredGood communication and interpersonal skillsAbility to work successfully in projects teamsAbility to multitask Full-Time/Part-Time Full-Time Position Architectural Intern Req Number ARC-18-00032 Location Boston, MA About the Organization / EYP Inc. is a global provider of comprehensive high-performance building design, research, and consulting services. Our 500 professionals work across 15 offices in the United States and Europe. The only firm to have been ranked #1 for energy and sustainability for two consecutive years by Architect Magazine, EYP is committed to creating rich, productive, and inspiring environments that promote human well-being, preserve natural resources, and provide flexibility and resilience for the future. Our knowledge-based innovation strategy helps promote action-oriented public dialogue about the future of the built environment.  We are five sectors - Higher Education, Government, Healthcare, Science & Technology, and Energy - who work as one firm to help our clients address some of the most critical issues facing our nation and our world. EOE Statement We are an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, disability status, protected veteran status or any other characteristic protected by law.This position is currently accepting applications."}