{"jobID": "2685684084", "jobLocation": "San_Francisco_CA", "jobTitle": "IT Security Analyst Intern", "companyRating": "2.9", "companyInfo": {"Website": "www.chenega.com", "Headquarters": "Anchorage, AK", "Size": "1001 to 5000 employees", "Founded": " 1974", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " ASRC Energy"}, "estimatedSalary": "74000", "jobDescription": "CHENEGA PROFESSIONAL & TECHNICAL SERVICESCompany Job Title:IT Security Analyst, InternChenega Job Title:IT Security Analyst, InternClearance:Secret Location:San Francisco, CAReports To:Program ManagerFLSA Status:Regular, Full Time, Salaried, ExemptPrepared Date:03-05-2018Approved Date: 03-05-2018***THIS POSITION IS CONTINGENT UPON CONTRACT AWARD***Summary: Chenega Professional & Technical Services (CPTS) is seeking an IT Security Analyst, Intern to provide support to NASA - AMES Research Center (ARC) within the Information Technology Services. Essential Duties and Responsibilities: (Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions of this position)Under direct supervision, performs packet analysis, identifies malformed packets, and analyzes the payload of a pack of network protocols and routing. Writes and maintains processes, procedures, test/assessment results, presentations, papers, articles, and other types of documents as required.Non-Essential Duties:Other duties as assigned.Supervisory Responsibilities: None.Minimum Qualifications: (To perform this job successfully, an individual must be able to perform each essential duty satisfactorily.) High School Diploma or GED. Zero (0) to Two (2) years of related experience. Must have an understanding of commonly used network services (e.g. domain name server (DNS), mail, web, and other less common network services) Must be able to obtain required NASA badge. Must be able to provide a certified Birth Certificate (with state seal), Passport, or INS Citizenship documents on date of hire (candidate will be sent home if this paperwork is not provided upon arrival on date of hire). Must have, and maintain, a valid driver’s license.Knowledge, Skills and Abilities: Good organizational and planning skills Excellent communication skills Proven ability to pay close attention to detail Ability to work independently but follow specific detailed instructions Ability to interface with various levels of personnel in a multi-cultural, team- oriented environmentDiversity: Shows respect and sensitivity for cultural differences; Educates others on the value of diversity; Promotes a harassment-free environment; Builds a diverse workforce.Ethics: Treats people with respect; Keeps commitments; Inspires the trust of others; Works with integrity and ethically; Upholds organizational values.Physical Demands: The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this Job, the employee is regularly required to sit and talk or hear. The employee is frequently required to walk; use hands to finger, handle, or feel and reach with hands and arms. The employee is occasionally required to stand; climb or balance and stoop, kneel, crouch, or crawl. The employee must occasionally lift and/or move up to 25 pounds. Specific vision abilities required by this job include close vision.Work Environment:The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. The employee will normally work in a temperature-controlled office environment, with frequent exposure to electronic office equipment. During visits to areas of operations, may be exposed to extreme cold or hot weather conditions. Is occasionally exposed to fumes or airborne particles, toxic or caustic chemicals, and loud noise.Chenega Corporation and family of companies is an EOE. Equal Opportunity Employer Minorities/Women/Veterans/Disabled/Sexual Orientation/Gender Identity Native preference under PL 93-638. We participate in the E-Verify Employment Verification Program.Minimum Qualifications: (To perform this job successfully, an individual must be able to perform each essential duty satisfactorily.)High School Diploma or GED. Zero (0) to Two (2) years of related experience. Must have an understanding of commonly used network services (e.g. domain name server (DNS), mail, web, and other less common network services) Must be able to obtain required NASA badge. Must be able to provide a certified Birth Certificate (with state seal), Passport, or INS Citizenship documents on date of hire (candidate will be sent home if this paperwork is not provided upon arrival on date of hire). Must have, and maintain, a valid driver’s license."}