{"jobID": "2720918729", "jobLocation": "New_York_NY", "jobTitle": "CGG Enterprise Client Executive", "companyRating": null, "companyInfo": {"Website": "www.workfront.com", "Headquarters": "Lehi, UT", "Size": "501 to 1000 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Enterprise Client Account Executive Workfront is a leading provider of enterprise work management software. We are a dynamic, fast-growing company with great opportunities, top-ranked benefits, and an employee-focused culture. We are seeking an experienced salesperson of Client Growth to join a team of overachieving professionals. You will be part of the Client Growth Group (CGG), which handles all existing customers for SaaS retention and expansion.  The Enterprise Sales team works with existing customers and is responsible for closing business, expanding relationships and building opportunities within assigned accounts. We are looking for sales experts that can take ownership of assigned accounts, retain their business, and create significant growth. Desired Skills & Experience:5+ years experience, SaaS sales preferredTechnical Sales experience required (consultative, solution experience selling software products)Account management / growth sales experience requiredBachelors degreeUnderstanding of MEDDPICC Sales Methodology is preferredForecast accuracyProven track record of continually exceeding quota targetsAbility to gather information on customer business processes, critical success factors, and competitive standing to deliver value-added business solutionsKnowledge of the work management, project management and portfolio management market space, competitors and related industriesExperience building qualified growth pipeline quarter over quarter, and positioning business to close each monthStrong analytical skills that enable the development of complete sales cycleProven track record in developing and managing clients in multiple industriesIndependent thinker, with good judgment skills and proven track record in problem solvingExcellent presentation skills, business writing skills and oral communication skillsMust be capable of balancing general prospecting requirements, fulfilling customer needs and meeting company expectations and goalsStrong knowledge of Salesforce.com is preferred Responsibilities:Exceed assigned sales quotas and objectives and build new revenue through the expansion and growth of business relationships with current customersWork with customers to understand and identify their strategic vision and objectives and align our products and services where opportunities existThoroughly understand specific customers work management/project management needs and demonstrate Workfront's ability to solve those needsPerform sales presentations/demonstrations to match solutions with identified needsAccurately forecast quarterly and monthly sales by possessing a full understanding of customers specific decision-making and purchasing processMeet face to face with customers to build relationships and gain an excellent understanding of their political and corporate environmentEffectively manage RFPs, bids & other customer requirementsExpedite the sales cycle by demonstrating superior knowledge of Workfront solutionsIncrease deal size through a consultative and analytical sales approachDevelop and manage pipeline activity and monitor sales activity against assigned quotasAcquire and integrate industry knowledge related to general trends, emerging technologies, and competitors"}