{"jobID": "2788830361", "jobLocation": "New_York_NY", "jobTitle": "Data Science Working Group Intern (Part-Time), - Equities- US Research Sales", "companyRating": null, "companyInfo": {"Website": "www.jefferies.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1962", "Type": " Subsidiary or Business Segment", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Jefferies, the global investment banking firm focused on serving clients for over 50 years, is a leader in providing insight, expertise and execution to investors, companies and governments. The firm provides a full range of investment banking, sales, trading, research and strategy across the spectrum of equities, fixed income, foreign exchange, futures and commodities, and also select asset and wealth management strategies, in the Americas, Europe and Asia. Jefferies Group LLC is a wholly-owned subsidiary of Leucadia National Corporation (NYSE: LUK), a diversified holding company. Positiion: We are looking for an intern to work 10-12 hours per week during his or her fall semester, starting in September. Primary Responsibilities: Research and catalog disruptive data providers for use in financial investments. Create cutting edge alternative data content to hedge funds and asset managers. Assist with planning and logistics of data science events and conferences.Required Background: Pursuing Bachelor’s degree in Data Science, Political Science, History, Economics, Business or a similar realm.Desired Experience/ Skills: Experience using statistical computer languages (R, Python, SLQ, etc.) valued but not required. Excellent communication skills, both written and verbal. Strong project management skills with ability to keep multiple moving pieces organized and accurate in a fast-paced environment. Ability to execute tasks independently and act as valuable team player. Advanced knowledge of Microsoft Office software and aptitude for picking up new technologies quickly. Strong analytical skills with ability to compare products, markets and clients. Demonstrated interest in asset management business, data science and marketing/communications strategy. Positive attitude and willingness to be hands on and do whatever it takes to get the job done while maintaining extremely high standards."}