{"jobID": "2605385686", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.essenceglobal.com", "Headquarters": "London, United Kingdom", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Public", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Merkle, PHD Worldwide"}, "estimatedSalary": "78000", "jobDescription": "About EssenceEssence, part of GroupM, is a global data and measurement-driven agency that blends data science, objective media and captivating experiences to build valuable connections between brands and consumers. Clients include Google, FrieslandCampina, and the Financial Times. The agency is more than 1,100 people strong, manages over $3.2B in media spend and deploys campaigns in 71 markets via its global offices throughout North America, EMEA and APAC.  Visit essenceglobal.com for more information and follow us on Twitter at @essenceglobalAbout the opportunity Essence is seeking a Data Analyst to join our team in Los Angeles. You'll build an understanding of the analytical needs of clients, help define how performance should be measured and analyzed, and communicate the insights you discover in order to improve campaign performance in the future. Some of the things wed like you to do:Get under the skin of marketing plans and clients propositions to help formulate robust test & learn strategies and produce detailed Performance Measurement Plans prior to campaign launchesEnsure the appropriate data points are being collected from the appropriate data sources during campaign executionDesign, research and test advanced analytics methodologies to perform audience segmentation on first, second and third party dataDevelop framework (or query log files) to understand which real-time optimization signals correlate with offsite engagement and on-site conversionsExplore robust and cutting edge statistical and machine learning techniques for solving business problems given available data sets or 3rd party data.Work closely with your peers in other practices at Essence (e.g. performance marketing, media buying and planning etc.), to ensure analytical support for campaigns is scoped properlyA bit about yourself:Up to 2-3 years of technical analytics experience, including statistical analysis, predictive modeling, and/or machine learning a plusExperience presenting data in a visually engaging and insightful manner that cuts through the noiseExperience in marketing analytics and/or digital media experience a plusStrong analytical skills - ability to analyze raw data, find insights, and provide actionable strategic recommendationsExperience working with relational databases.Experience querying and modeling data, with SQL, R, Python preferred.Strong organizational and project management skillsEstablished and professional communication and presentation skillsWhat you can expect from Essence Essences mission is to make advertising more valuable to the world. We do this by employing the worlds very best talent to solve some of the toughest challenges of todays digital marketing landscape. Its important that we hire people whose values reflect those of our own: genuine, results-focused, daring and insightful. As an Essence employee, we promise you a workplace that invests in your career, cares for you and is fun and engaging. We believe these factors create a workplace where you can be yourself and do amazing work."}