{"jobID": "2795972101", "jobLocation": "New_York_NY", "jobTitle": "Associate UI/UX Designer", "companyRating": null, "companyInfo": {"Website": "www.konradgroup.com", "Headquarters": "Toronto, Canada", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Konrad Group Konrad Group is a next generation digital consultancy. We are dedicated to solving complex business problems for our global clients with creative and forward-thinking solutions. Our employees enjoy a culture built on innovation and a commitment to creating best-in-class digital products in use by hundreds of millions of consumers around the world. We hire exceptionally smart, analytical, and hard working people who are lifelong learners. Associate Experience Designer (UI/UX) As an Associate Experience Designer (UI/UX) you will be involved in our design thinking process and the creation of innovative mobile, tablet and web products. You will bridge the gap between design, business, and technology to ship world-class digital experiences for leading companies and global brands. ResponsibilitiesWork with design leads to create compelling interactive experiencesPerform user research and develop information architecture, user goals, journey maps, and design wireframes and visual interfacesCollaborate with developers to ensure pixel perfect execution across all project deliverablesWork with strategy consultants to gain insights into clients business and project objectivesLearn the end-to-end process of project delivery and the associated design tools involvedSuccessful candidates will haveFirm grasp of design fundamentals demonstrated by a strong portfolio of digital projectsMeticulous attention to detail and a keen eye for typography and visual hierarchyClear and effective communication skills in articulating design concepts and rationalesProficient in Sketch and Adobe Creative Suite, and an eagerness to learn new toolsPositive attitude with a desire to grow within a collaborative, inspiring teamwork environmentPerks and BenefitsFlexible Vacation PolicyHealth & Wellness ProgramsCulture of Learning & DevelopmentFully-Stocked Kitchens & LoungesNew Shiny Device UpgradesMonthly Socials & Team OutingsBonus Points: Have you taken any courses at BrainStation? A lot of our design and development best practices and processes are taught during our courses - make sure to highlight this experience in your cover letter if you have! Konrad Group is committed to maintaining a diverse work environment and is proud to be an equal opportunity employer. All qualified applicants, regardless of race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status will receive consideration for employment. If you have any accessibility requirements or concerns regarding the hiring process or employment with us, please notify us so we can provide suitable accommodation. While we sincerely appreciate all applications, only those candidates selected for an interview will be contacted."}