{"jobID": "2726689573", "jobLocation": "San_Mateo_CA", "jobTitle": "Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.lumiata.com", "Headquarters": "San Mateo, CA", "Size": "1 to 50 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " IBM, Verscend, Milliman"}, "estimatedSalary": "129000", "jobDescription": " Lumiata is growing their data science team! Looking for data science candidates who are interested in using AI to predict impact of disease burden with respect to cost and clinical states. With millions of patient records, Lumiata has a wealth of data to work with to build these models. Need to have: -Python experience: specifically, these packages – pandas, numpy, scipy, sklearn  -Machine learning experience – have built Lasso regression, random forest, even deep net models  -Understanding of metrics like precision/recall curves  -Good communication skills  -Authorization to work in the US Nice to have: -Medical Informatics (ICD, CPT, LOINC, NDC, RxNorm, FHIR, HL7)  -Apache Spark experience  Process will be – phone screen on applicant’s background, on-site to meet with 3-4 Data science team members and a coding interview to assess the readiness of an applicant.  About Lumiata  Lumiata is a venture-backed company based in San Mateo, California inventing predictive analytics for healthcare leveraging the power of Artificial Intelligence (AI). Our flagship Data-as-a-Service (DaaS) product, the Lumiata Matrix Suite, is an enterprise-grade, individual-to-population predictive analytics solution powered by AI. It enables the hyper-segmentation of vast amounts of patient data to predict which patient cohorts may be at highest risk for disease progression. Action-ready insights are returned to enterprise healthcare data analysts to enable more effective early-intervention strategies that lead to improved revenues, better patient outcomes, and lower overall costs of healthcare delivery."}