{"jobID": "2626962639", "jobLocation": "Boston_MA", "jobTitle": "Market Research Project Manager", "companyRating": "3.8", "companyInfo": {"Website": "www.cmbinfo.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Lieberman Research Worldwide, Ipsos, Millward Brown"}, "estimatedSalary": "61000", "jobDescription": " Market Research Project Manager Voices of CMB THE CHADWICK MARTIN BAILEY BLOG Check it outOur Clients  We work with amazing clients  Check them outOur Work  Interested in learning more about what we do?  Take a lookResponsibilities and Expectations Essential DutiesSuccessfully manages multiple challenging and complex projectsActively manage project budget, work plan, profitability, as well as project and billings scheduleOwns questionnaire, sample design, analysis, and reporting and serves as day-to-day client contact on projectsParticipates in the proposal development process (e.g., schedule, pricing, methodology)Oversees and effectively communicates with project team and external resourcesActively manages client relationships for existing clientsAnticipates and identifies project problems and finds solutions independently or with minimal guidanceDemonstrates confidence in client interactions and communicationsPresents a CMB University case study annuallyClient Services TeamAdheres to “The CMB Way” (defined approaches, processes, best practices, etc.)Contribute to marketing CMB by writing a blog annuallyTake advantage of training and development opportunitiesContributes to a team and/or committee for ongoing CMB initiativesEnsure end-to-end client/project delivery in alignment with Sales & Account Management leading to high client satisfaction with project deliverablesQualificationsDemonstrated success meeting performance expectations as a Project ManagerMinimum of 2 years managing multiple custom market research projects with minimal oversightMinimum of 5 years of custom market research experienceExperience delegating and managing and influencing teams and individualsUnderstanding of complex market research methodsExcellent at proofreading and editing documents or presentationsExcellent at managing multiple projects and prioritiesExcellent attention to detailExcellent at establishing and managing relationships with clients, vendors and coworkersExcellent skills in PowerPoint, Excel, SPSS, Microsoft Word, and OutlookBA in a related field (e.g., statistics, marketing, market research, business management)Sense of humor and self-awareWe are looking for people to join our team that are collaborative, enthusiastic, and who can put their ego aside, roll up their sleeves and get the job done. If you are interested in any of these positions please forward a cover letter, a copy of your resume in MS Word, and your salary requirements to careers@cmbinfo.com. We are an equal opportunity employer. No agencies, please."}