{"jobID": "2674586610", "jobLocation": "New_York_NY", "jobTitle": "Full Stack Dev | Digital Studio - Seattle/Chicago/Atlanta/NY", "companyRating": null, "companyInfo": {"Website": "www.avanade.com", "Headquarters": "Seattle, WA", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Slalom, Cognizant Technology Solutions, Deloitte"}, "estimatedSalary": null, "jobDescription": " About the role  Avanades Digital Studios are standalone, agency-like, cross functional team of individuals, who will deliver end-to-end digital projects from strategy and design, through build and on-going support and optimization. Our Digital Studios are located in Seattle, Atlanta, Chicago, and New York. Studio team members work side by side with clients on cutting-edge projects that add a layer of creative, world class delivery, on top of repeatable technology solutions. Our Studios are made up of UX and Visual folks, Content Strategists, Business Analysts, Tech Leads/UI Developers, and Delivery Managersmost of whom have lots of experience working at Digital agencies.  The Experience Technology team turns designed experiences into reality by helping designers shape and imagine the future. It provides efficient and scalable solutions to deliver a seamless experience across multiple touch-points.  As Manager, Experience Technology, you will lead tactical and short-term operational planning and execution within projects and programs for Avanade or our clients. You will work in a diverse environment within the scope of a professional discipline, function or Market Unit, often requiring new or different inputs, processes or outcomes. You will lead one or more teams and projects that create modern and responsive web user interfaces across screen sizes for a diverse client base. You will use your deep expertise to create innovative client solutions and ensure Avanade is a leader in experience design capabilities.  Day-to-day, you will: Experiment with new techniques and proofs of concept for improving code practices and methodsLead architecting efforts of discrete, modular site structure and code with a focus on code reuseProvide direction and examples for junior developers to follow and partner with teammates who lead other project aspectsLead code review planning and execution for project work and suggest areas for refactoring or improvementContribute to the growth of Avanades library of reusable features and modules by building prototypes and proofs of conceptLead teams in creating creative technical solutions to address challenges for Avanade and our clientsContribute to business development efforts through customer relationships, Requests-for-Proposal submission support and identification of ways to grow existing projectsTravel as needed. About you  You are a project leader who can work with cross-functional teams and diverse clients. You have a passion for emerging technologies and innovation. You have experience with and deep understanding of User Experience (UX) concepts, techniques and practices. You can define front-end architecture and have developed for mobile devices.  Your background and skills likely include: Strong proficiency in the common skills of front-end development, including HTML, JavaScript and CSSKnowledge of current development tools and frameworks used in front-end development, such as Bootstrap, Foundation, Angular, Ember, Xamarin, PhoneGap, Grunt, Handlebars, SASS and LessExperience working with front-end developer tools (Visual Studio, Sublime, Photoshop, Illustrator and Fireworks)Understanding of common code patterns and standards, such as semantic HTML, Revealing Module Patterns and Immediately Invoked Function ExpressionsGood understanding of code debugging practices and toolsExperience with Microsoft technologies. You likely have six or more years of relevant UI/front-end development experience with two or more years of managing people and teams. Your education likely consists of a Bachelors Degree in computer science/engineering, computer information systems, web development or a similar degree or experience that may substitute for a degree. You may also have a Masters Degree in a related discipline.  About Avanade  Avanade leads in providing innovative digital services, business solutions and design-led experiences for its clients, delivered through the power of people and the Microsoft ecosystem. Our professionals combine technology, business and industry expertise to build and deploy solutions to realize results for clients and their customers. Avanade has 30,000 digitally connected people across 24countries, bringing clients the best thinking through a collaborative culture that honors diversity and reflects the communities in which we operate. We welcome all, and seek talented individuals who can bring their whole self to work, build inclusive teams and encourage diversity inside and outside the organization. Majority owned by Accenture, Avanade was founded in 2000 by Accenture LLP and Microsoft Corporation. Learn more at www.avanade.com.  Qualifications"}