{"jobID": "2653268975", "jobLocation": "Cupertino_CA", "jobTitle": "Pre-Sales Engineer - (CA / TX)", "companyRating": "3.3", "companyInfo": {"Website": "www.huawei.com", "Headquarters": "Shenzhen, China", "Size": "10000+ employees", "Founded": " 1987", "Type": " Company - Private", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " Ericsson-Worldwide, Cisco Systems, Apple"}, "estimatedSalary": "129000", "jobDescription": "Huawei is a leading global information and communications technology (ICT) solutions provider. Through our dedication to customer-centric innovation and strong partnerships, we have established end-to-end advantages in telecom networks, devices and cloud computing. We are committed to creating maximum value for telecom operators, enterprises and consumers by providing competitive solutions and services. Our products and solutions have been deployed in over 170 countries, serving more than one third of the world’s population. Huawei has over 180,000 employees, approximately 80,000 of which are engaged in Research & development. Huawei operates a global network of 12 regional headquarters, 15 R&D; Centers, 36 Innovation Centers jointly operated with customers, and 45 Training Centers. Huawei is leading the way by rethinking the future. From devices to telecom infrastructure to cloud computing and convergence solutions, we are rethinking every link in the chain with ICT based innovation to deliver a better future...faster. Pre-Sales Engineer - (CA / TX) Location: Cupertino, CA (Enterprise) Req #: 8334 # of Openings: 1 DescriptionSolution Sales Product ManagerLocation: Cupertino, CA & Plano, TXContract - to hire This position requires intensive hands-on experience in enterprise networks or Data Center. Storage Skills Server/Blades experience is required. Cloud Computing skill are definitely a plus  The Huawei Enterprise Delivery & Services group is in need of a Storage/Server Engineer to join a newly established, high energy, highly collaborative team. The position requires the candidate must have an aptitude and appetite to learn, the ability to resolve complex technical issues, excellent inter-personal communication and great teamwork skills. This opportunity is a great career path to become a technical expert or lead, and add superior value to the team while working in Huawei Enterprise USA, the industry leader in Telecom/IP network solutions.  ESSENTIAL DUTIES AND RESPONSIBILITIES:  These are the key responsibilities of the job. On occasion you may be required to undertake other duties commensurate.  Responsible for project Pre-sale testing/POC support, which includes test case and solution review, testing implementation and the documents which for customers review.  Responsible for key storage/server project implementation, which includes installation and testing, project management.  Responsible for Channel partners’ training, and bring up engineers from Channel partners. Make sure the Channel resource can support Huawei storage/server product implementation and maintenance service.  Be responsible for service related technical activities such as training and technical communication, technical Demo for customers, etc.  (Requirements on work experience relevant to the target position and target companies)  1. 5 years +;  2. Experience in the main vendor of server, storage and virtualization, or system integrator.  3. Intensive hands-on experience in server, enterprise storage and virtualization,  4. Experience of independently presale POC of IT project  5. Experience in internet service provider is better.  6. CS/EE background preferred  Professional Knowledge: Familiar with Server/Storage/Cloud, esp. serverFamiliar with Datacenter solutionKnowledge of datacenter consolidate, Active-active solution and backup solution is better.Huawei Inc. is proud to be an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Why work for us?In 2016, Huawei's revenue reached CNY520 billion (US$74.9 billion based on the year-end exchange rate), an increase of 32% (YOY)We invest in engineering and innovation - 80,000+ of our 180,000+ global employees work in R&D;, and we invest roughly 10% of our annual revenue in to R&D.; U.S. R&D; efforts are carried out by Futurewei Technologies, Inc.Futurewei’s commitment to R&D; is a major reason why Huawei holds one of the largest patent portfolio’s in the world: Since 2008, Huawei has been a top five international patent filer, per the World Intellectual Property Organization.We support green energy - Lowered CO2 emissions by 13,000 tons via Huawei’s green packaging solutionsFuturewei works with leading universities to further R&D; efforts, investing more than $10million USD each year to support programs at Harvard, MIT, Stanford and Yale, among others. Are you a returning applicant?Previous Applicants:Email:Password: If you do not remember your password click here. Back to Search Results New SearchCopyright © Huawei Technologies Co., Ltd. 1998-2017. All rights reserved."}