{"jobID": "2632748748", "jobLocation": "Burlington_MA", "jobTitle": "Senior Data Analyst", "companyRating": "2.3", "companyInfo": {"Website": "www.welltok.com", "Headquarters": "Denver, CO", "Size": "201 to 500 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " RedBrick Health, Rally Health"}, "estimatedSalary": "77000", "jobDescription": "Senior Data Analyst Welltok is pioneering health optimization by connecting consumers with the right programs and resources to optimize their health and reward them for healthy actions and behaviors. Its CaféWell health optimization platform empowers users with personalized activities that are designed to drive healthy habits and active lifestyles. Welltok Ranked #1 in Colorado, #74 Nationwide on Deloitte's 2016 Technology Fast 500. Be part of something big and join our smart, passionate team in changing the way consumers engage in their health. General Description As a Senior Data Analyst within Analytic Services, your responsibilities will sit at the intersection of data management and predictive analytics. You will utilize SAS in conjunction with other applications and database languages to form the foundation of the data management ecosystem that cost-effectively fuels a sophisticated machine learning and data mining analytic services business model. Ideal candidates will possess hands-on experience using data sets commensurate with the Healthcare industry, and those used in processes associated with consumer profiling methods. It is critical that qualified candidates have the skills and experience necessary to facilitate the development, deployment and maintenance of the technologies, processes and policies that govern success within the Healthcare industry. Key responsibilities include:Acquiring, validating, standardizing, and warehousing incoming client data in all forms and frequencies, from membership information to wearable device data, long cycle to near real timeCreating and maintaining the environment and processes that govern this dataFacilitating in-depth data discussions with clients and data vendors, as well as internal customersPartnering with internal and external customer teams to ensure the continuity and consistency of our client deliverablesAnalyzing and critically thinking about data issues, then developing and executing a plan to resolve themMaintaining knowledge of the latest industry tools and best practicesServe as lead developer / engineer on team-based projectsIdentify opportunities for improving data quality and accuracy, within both new and existing processes, facilitate the introduction and selection of suggested solutions with key stakeholders, and lead the effort to implement the agreed-upon solutionsServe as a Healthcare Data ETL SME in cross-functional team projectsServe as a mentor on all of the above items for other members of the teamDesired Skills and ExperienceRequirements:4-year degree or equivalent in a computer science, data engineering, or healthcare-related discipline. An equivalent degree in mathematics or statistics with demonstrated Healthcare data experience is also acceptable.3+ years of experience programming with advanced SAS scripts1+ years of hands-on experience within a Healthcare industry settingKey experience would include:Data requirements gatheringDocumentationData acquisition and validation techniquesData stagingData preservationFluency in SAS and other relevant programming languages will be given additional consideration.Demonstrated ability to self-direct, work, and lead with minimal supervisionAdditional consideration will be given to candidates who express an interest in or have experience with ETL system designCompetencies/Skills:Experience working with large data sets and Healthcare data in all formsExcellent verbal and written communication skillsProven ability to lead team data engineering effortsAbility to accurately determine data quality and define best programming practices as it relates to Healthcare data"}