{"jobID": "2812757585", "jobLocation": "Seattle_WA", "jobTitle": "FP&A; Business Intelligence Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.darigold.com", "Headquarters": "Seattle, WA", "Size": "1001 to 5000 employees", "Founded": " 1918", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Dean Foods, Northwest Dairy, Tillamook County Creamery Association"}, "estimatedSalary": "73000", "jobDescription": " The Darigold Finance Team is looking to fill a Data Analyst position within the newly formed FP&A; Business Intelligence group to support the build of our analytical capability through the maintenance, optimization and governance of key data elements that bridge the various business systems and the data warehouse. The position performs critical support activities which ultimately result in better business decisions across the company. The ideal candidate for this position is able to create value through improved data integrity and is proficient in collaborating across functional areas on data optimization initiatives. Essential Duties and ResponsibilitiesMaintain and optimize data tables to bridge business systems and data warehouseWork with all departments to improve source data quality to optimize data warehouse extract methodologyMaintain standard operating procedure documentation to reflect data warehouse developmentsWork with all departments to identify the specific data needs for new business requestsUse statistical methods and modeling to analyze data and generate useful business informationCreate and maintain dashboards and visualization tools to communicate business performanceSupport initiatives to enhance and upgrade data warehouseOther tasks as assignedKnowledge, Skills and AbilitiesPassion for improving data quality through collaboration with and influencing of data and process owners within a multi-system environmentFamiliarity with ERPs and accounting transactional dataAbility to deliver concurrent projects with a strong attention to detail and accuracy within a less than perfect data integrity environmentA self-starter learner with highly developed sense of curiosity and drive to deliver results within demanding timelinesCritical thinker with ability to identify and recommend correction to root causes and trendsExcellent sistening skills to understand business needs and strong visualization (verbal and visual) skills to translate large amounts of data into understandable informationResilient to challenges of performing within an emerging business intelligence capability within the companyAbility to effectively collaborate and work as part of a team across the organizationEducation, Experience and CertificationsBachelor’s Degree in Mathematics or Computer Science or similar analytical discipline2+ years’ demonstrable experience in data mining or a data analyst roleProficient with data analysis tools and descriptive statistical techniques and methodsHands on experience with OBIEE Analysis, Dashboard Creation, and Oracle Data VisualizationStrong MS office suite skills: Excel and Power BI Darigold is known for delivering fresh, high quality, value-added dairy products to people,& customer-driven solutions to organizations, all around the globe. We are the 5th largest dairy Co-Op in the US& one of the largest privately held organizations headquartered in Seattle, Washington. We produce over 10 billion pounds of milk every year! Since 1918, our Farmer-owners have taken great pride in producing nutritious dairy products with unsurpassed quality. Our work environment provides a result driven, collaborative space, with open& transparent communication,& a culture of celebrating everyone’s wins. Our mid-size private business model provides the ability to have dynamic involvement at all levels of our organization. We’re also proud to say we offer an excellent Total Compensation Package& a few other unique perks to our industry!At Darigold, we embrace diversity& welcome all qualified applicants regardless of race, color, national origin, sex, gender identity and expression, age, sexual orientation, veteran status, disability, marital status, creed, religion, genetic information or any other characteristic protected by federal, state or local law- We’re proud to say we are an Equal Opportunity and Affirmative Action Employer.As a condition of employment applicants offered a role will be required to successfully pass our pre-employment background screen, receive a negative drug screen result& confirm eligibility to work in the U.S. We participate in E-Verify- please follow the links for details,English /Spanish& view our Right to Work Statement,English /Spanish."}