{"jobID": "2808476222", "jobLocation": "San_Francisco_CA", "jobTitle": "Automotive Technician/Customer Service Advisor Entry Level-Sunset District", "companyRating": "3.5", "companyInfo": {"Website": "www.valvoline.com", "Headquarters": "Lexington, KY", "Size": "5001 to 10000 employees", "Founded": " 1866", "Type": " Company - Public (VVV) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "12", "jobDescription": "Accelerate your potentialGeared for the Driven Interested in a rewarding career with great pay, outstanding benefits and the opportunity to grow? Henley Enterprises, Inc. a franchisee of Valvoline Instant Oil ChangeSM (VIOC), is hiring Automotive Technicians. Whether youre looking for a part-time job with flexible hours or a full-time career with excellent advancement potential, youll find it all at VIOC. With an award-winning training program and fair and honest values, were here to help you reach every milestone and have some fun in between. What you'll do As an Automotive Technician you will help drive the continued success of VIOC by providing reliable and impeccable preventive maintenance service. Through face-to-face interactions, you will act as a trusted advisor to our customers, evaluating their needs and performing maintenance to keep their vehicle serviced and safe on the road. Evaluate customers needs, working quickly and efficientlyContribute to a fun team atmosphereMaster products, services and company knowledgePerform automotive preventive maintenance such as changing oil, checking and refilling other vehicle fluids, replacing filters, and inspecting and replacing lights and wipersMaintain a clean and safe workplaceHow youll succeedYou are friendly and ready to work as part of a customer-focused teamHave an eagerness to learnYou can lift up to 50 poundsHave full mobility and the ability to work with your hands above your headCan stand for extended periods of time and climb stairsWhy choose a career with Henley Enterprises / VIOC? For over 30 years, weve been bringing the convenience of fast, friendly maintenance service to busy people. Today, we operate over 1,100 locations across the U.S. and growing. Were passionate about cars, but were really in the business of taking care of people. We live by the policy of promoting from within and maintaining an unwavering dedication to hiring, developing and supporting the best talent in the world. Isnt it time you aligned your career to your needs? Join us today! Benefits include:Competitive pay & flexible work scheduleOn-the-job trainingWe promote from within a commitment we are passionate aboutNo late eveningsTuition reimbursement *Paid vacation, holidays, and sick time*Medical, dental, vision, and 401(k) savings plans**Terms and conditions apply and benefits may differ depending on locationValvoline is proud to be an Equal Opportunity Employer. All qualifiedapplicants will receive consideration for employment without regard to race,color, religion, sex, gender identity, sexual orientation, national origin, orprotected veteran status and will not be discriminated against on the basis ofdisability. Pursuant to the San Francisco Fair Chance Ordinance, we willconsider for employment qualified applicants with arrest and conviction record"}