{"jobID": "2827919257", "jobLocation": "Sunnyvale_CA", "jobTitle": "FPGA Engineer - Contractor", "companyRating": null, "companyInfo": {"Website": "www.infinera.com", "Headquarters": "Sunnyvale, CA", "Size": "1001 to 5000 employees", "Founded": " 2001", "Type": " Company - Public (INFN) ", "Industry": " Telecommunications", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Ciena"}, "estimatedSalary": null, "jobDescription": " Join Infinera OME team to design, Simulate, and Validate FPGAs for HW boards being developed for Optical Line System Products. Duties may also include existing product engineering support and documentation. Essential Functions/ResponsibilitiesResponsible for FPGA design and this include: Design Specifications, Coding, Simulation, and Validation.Drive designs from conceptual work, architecture requirements, functional specification, design, prototype, H/W bring up and verificationWork closely with HW engineers to define new FPGA. Fully participate in all HW board bring up activitiesSupport product through pre & post production release.Develop and execute DVT plans to ensure high-reliability in field deployment.Work closely with FW and SW Engineers.Maintain good documentation and formal FPGA image release process.Knowledge, Skills and Abilities Master’s degree desired. Bachelor's degree required. At least 10 years of relevant experience in FPGA design and HW board bring-up. Significant experience with all the standard FPGA families from Altera, Xilinx  and others.Excellent knowledge of Verilog code is required.Good Knowledge of ARM based dual core processor platform (Xilinx Zynq family or similar).Experience in implementing control algorithms in FPGAs is required.Experience with closed loop control systems is a must.Experience in implementing I2C, SPI, and ADC/DAC interface drivers in FPGAs is a must.Ability to simulate and write test benches is essential.Strong logic design skills; Expertise in FPGA development flow (Verilog RTL, robust device verification discipline, FPGA Place & Route; documentation and release process).Ability of debugging prototype hardware and operate lab equipment such as logic analyzers, oscilloscopes, network analyzers etc. is a must.Would be expected to heavily interact with HW engineers, FW and SW driver/diagnostics engineers, for device requirement definition, and for HW/SW integration.Knowledge of DSP algorithms such as digital filters and Fourier transform is a benefit.Familiarity with networking protocols/standards such as SONET and GbE is a must.Very good communication skills and ability and desire to work in a team environment. Board design experience also would be a plus. Infinera is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, age, status as a protected veteran, or status as a qualified individual with disability. EEO Employer/Vet/Disabled."}