{"jobID": "2725082404", "jobLocation": "New_York_NY", "jobTitle": "Data Scientist, Marketing", "companyRating": "4.4", "companyInfo": {"Website": "www.betterment.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "144000", "jobDescription": " Data Science & Analytics is one of the fastest growing teams at Betterment. We operate with a 360-degree view of the company, partnering closely with teams such as Finance, Marketing, Product, and Operations, and always with our users in mind. Our projects range from creating beautiful dashboards to developing machine learning models. These projects add tremendous value to the business and we are looking for more thoughtful, driven, and curious people to push the business even further.About the right team member:Marketing plays a critical role in Betterment’s success. As with all areas of the company, we hope to make marketing even more data-driven than it is today, using our data to continuously improve our customer models and optimize our marketing spend. e are looking for a talented data scientist to help with these efforts. The company is in a growth stage and marketing’s analytics needs are fairly broad, so the work is bound to stay interesting. At any one time projects may include tuning programmatic ad spend, modeling customer behavior using machine learning, measuring the success of ongoing marketing campaigns, or assisting on ad-hoc data requests from the marketing team.At Betterment you will get to: Partner closely with cross-functional teams of product managers, engineers, designers, and user researchers.Perform analysis on large data sets to extract actionable insights that will help drive decisions across the user funnel – such as acquisition, activation, churn and retention.Build advanced predictive models to forecast the impact of specific growth and marketing initiatives.Work on end to end projects to ensure execution, testing, and results are tracked to your high standards.Conceptualize and build data models, tools, and dashboards that empower stakeholders, enabling them to access data and draw insights in a self-serve manner.Contribute to Betterment’s data driven culture, and influence best practices.Be a member of the broader data science community in NYC, staying abreast of new ideas and trends, and contributing thought leadership. You will be effective if you have: 5+ years of experience applying data science to marketing, including user modeling and CRM.A willingness to be flexible, prioritizing problems that are most pressing and using tools that are most appropriate.Deep familiarity with media mix modeling, cross-channel dynamics, and adtech-specific nuance.Experience applying statistical (or machine learning) models to real-world challenges.The ability to write SQL in your sleep.Strong ability to code in Python or R.Self-starter with a track record of seamless execution of complex projects with minimal guidanceAn eye for beautiful and effective data visualizations, and experience creating them programmatically.Experience extracting insight from massive datasets.Experience working with third-party user data including DMPs.Entrepreneurship in your nature, with a bias for action instead of waiting for perfection.Bonus points if you have:An advanced degree in a quantitative field.Experience working in a fast moving, ever-changing environment.Excitement around the prospect of mentoring more junior members of our Analytics organization. About BettermentBetterment is the largest independent online financial advisor with more than $13 billion in assets under management. The service is designed to help increase customers’ long-term returns and lower taxes for retirement planning, building wealth, and other financial goals. Betterment takes advanced investment strategies and uses technology to deliver them to more than 330,000 customers across its three business lines: direct-to-consumer, Betterment for Advisors, and Betterment for Business.Learn more.Come join us!"}