{"jobID": "2755009330", "jobLocation": "San_Jose_CA", "jobTitle": "Senior Staff Machine Learning Engineer", "companyRating": "3.7", "companyInfo": {"Website": "www.xilinx.com", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 1984", "Type": " Company - Public (XLNX) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Qualcomm, Intel Corporation, AMD"}, "estimatedSalary": "223000", "jobDescription": "DescriptionXilinx is the world's leading provider of All Programmable FPGAs, SoCs and 3D ICs. These industry-leading devices are coupled with a next-generation design environment and IP to serve a broad range of customer needs, from programmable logic to programmable systems integration. Our All Programmable devices underpin today's most advanced electronics. Among the broad range of end markets we serve are:Aerospace/DefenseAutomotiveBroadcastConsumerHigh Performance ComputingIndustrial / Scientific / Medical (ISM)WiredWirelessDescription  You will be part of an R&D; team that develops high-performance low-power FPGA acceleration hardware and software. This position focuses on designing algorithm and infrastructure for high-performance FPGA accelerator for well-known software stacks in the area of Machine Learning.  You will work on projects critical to Xilinx's growth, with opportunities to move among various teams and projects. You are versatile, display leadership qualities and are enthusiastic to tackle new problems across the full-stack as we continue to push technology forward. Most of all, you are driven to find creative solutions where solutions may not exist yet.  Responsibilities  • Design and develop FPGA-accelerated Machine Learning solutions  • Enable FPGA acceleration of open source deep learning frameworks like: Caffe, MxNet, and Tensorflow  • Design and modify machine learning models: reduce computational complexity by model optimization, computation using lower precision arithmetic, data flow reordering for memory bandwidth optimizations  • Work closely with customers to port their deep learning requirements to FPGA #ik  Minimum Qualifications  • MS/Ph.D. degree in Electrical Engineering or Computer Science with 2+ years of industry experience or BA/BS degree in Electrical Engineering or Computer Science with 5+ years of industry experience  • Solid foundation in data structures, computer arithmetic, algorithms and software design with strong analytical and debugging skills  • Good understanding of common families of Machine Learning models and Machine Learning infrastructure  Preferred qualifications  • Experience with implementing machine learning computation framework on GPU, CPU or FPGA  • Experience with developing acceleration application using OpenCL or CUDA  • Experience with internals of one of more frameworks like Caffe, MxNet or Tensorflow  • Solid engineering and coding skills. Ability to write high-performance production quality code. Experience in C++, Python, and other equivalent languages is a plus  • Experience or coursework in FPGA Digital Design or EDA optimization tools"}