{"jobID": "2815416477", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist (Marketplace, Content, and Operations)", "companyRating": "4.4", "companyInfo": {"Website": "www.udemy.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "173000", "jobDescription": "ABOUT UDEMYWith a mission to improve lives through learning, Udemy is a global marketplace for learning and teaching online. More than 20 million students learn from an extensive library of over 65,000 courses taught by expert instructors. Whether learning for professional development or personal enrichment, students can master new skills through self-paced, on-demand courses, while instructors have a way to share their knowledge with the world. For companies, Udemy for Business offers subscription access to a collection of business-relevant courses as well as a simple platform to host and distribute their own content in one central place.We’re a close-knit bunch that enjoys problem-solving and collaboration, and we share a serious commitment to delivering the best possible learning and teaching experiences. Udemy’s culture encourages innovation, creativity, passion, and teamwork. We also celebrate our milestones and support each other every day.Founded in 2010, Udemy is privately owned and headquartered in San Francisco’s SOMA neighborhood with offices in Dublin, Ireland, Sao Paulo, Brazil, and Ankara, Turkey. Compensation includes full-time salary, equity compensation plan, and competitive benefits including healthcare, commuter benefits, parental leave, and a discretionary time off policy.JOB DESCRIPTIONThis position partners with the Marketplace, Content and Operations team (MCO) whose job is to support and grow the courses and instructors that make up the backbone of our marketplace. As someone with a strong economics background, you will be looked to as the subject matter expert in understanding the interactions of supply and demand and marketplace health. You will be able to turn ambiguous problems into precise questions and work across internal teams to extract the relevant data.Because your audience will sometimes include executive staff members, knowing how to communicate technical or complex results in a clear and effective way will be key. At the same time, your stakeholders will also include those far less experienced with data so patience and willingness to help co-workers learn are vital. And as a senior analyst, you will also be responsible for mentoring and supporting the growth of less experienced analysts. Responsibilities:Support the MCO team with business analytics and insights that will drive actionAct as a mentor and coach to less experienced analystsCollaborate with people across Udemy to answer key business questions or find untapped opportunitiesConduct exploratory analyses with methodologies ranging from data mining and visualization to more sophisticated statistical modeling techniquesMine and structure data to prove hypotheses that will guide business decisions and help us understand our students and instructors betterBuild SQL tables, metrics, and dashboards to track the health of the marketplace and inform business decisionsCommunicate clearly and effectively to stakeholders with varying business and technical backgroundsContinuously improve the quality and accessibility of our data"}