{"jobID": "2757501966", "jobLocation": "Howard_Beach_NY", "jobTitle": "Mammography Technician- Radiology", "companyRating": null, "companyInfo": {"Website": "www.prohealthcare.com", "Headquarters": "Lake Success, NY", "Size": "1001 to 5000 employees", "Founded": " 1997", "Type": " Subsidiary or Business Segment", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Northwell Health, Stony Brook University Medical, Catholic Health Services of Long Island"}, "estimatedSalary": null, "jobDescription": " ApplyProHEALTH is one of the largest private multi-specialty medical practices in the Northeast and has been serving the health needs of Long Island and the Greater New York Metropolitan area since 1997. With over 900 providers in 300 locations, our goal is to provide quality health care to ensure that our patients get the right care at the right time.  We’re a dynamic and growing health care organization, offering a wide range of employment opportunities. We are seeking professional and dedicated individuals to be part of our team, where integrity, compassion, relationships, innovation and performance are among our core principles.  We offer our employees competitive compensation and benefits, flexibility and opportunity for growth and advancement. We are offering a $2K Signing Bonus for MammographyTechs who join the ProHEALTH team by April 1st, 2018.Responsibilities: Experience with Screening and Diagnostic mammogram proceduresAbility to effectively communicate procedures to patientsKnowledge of database software, RIS/PACSMust be willing to perform Bone Density testing, General X-ray and FluoroscopyPerforms other work-related duties as assignedQualifications:AS. in Radiologic Technology or certification from an approved 24 month hospital based programNY State radiology license3D certification preferred.Valid ARRT registry with advanced certification in Mammography. RT (R)(M). ProHEALTH strives to maintain a workplace that accepts and appreciates the differences among our employees. The company will not discriminate against any applicant or employee based on age, race, gender, color, religion, national origin, ancestry, disability, marital status, covered veteran status, sexual orientation, gender identity and/or expression, genetic information, status with respect to public assistance or any other characteristic protected by state, federal, or local law. "}