{"jobID": "2802704059", "jobLocation": "Los_Angeles_CA", "jobTitle": "2019 - Summer - TMC D365 Intern", "companyRating": null, "companyInfo": {"Website": "www.rsmus.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1926", "Type": " Private Practice / Firm", "Industry": " Accounting & Legal", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "RSM currently has openings for business-minded individuals to join our Technology and Management Consulting (TMC) practice as an intern. Our TMC Practice works with our clients’ executive leadership teams onsite in their office locations to support a wide range of engagements. Engagement teams are typically responsible for identifying business requirements, requirements management, functional design, development, prototyping, process design (including scenario design, flow mapping), defining support requirements and managing system & process implementations. Examples of the candidate’s responsibilities include: Participating in project scoping and strategic planningMeeting with decision makers, systems owners, and end users to define business, financial, and operational requirements and systems goalsLearning new technologies and “best practice” business process trends as necessary to meet client needs and identify current business application issuesReviewing and preparing client infrastructure & process documentation (Microsoft Visio, Excel);Communicating project and recommendation details – verbally or through written documentation – to management, peers, and other project stakeholders so that issues and solutions are understood and can be accurately portrayed to the client; and,Preparing and delivering reports, recommendations, or alternatives for improving processes in operating systems across the client’s organizationEngagements may include, but are not limited to:Financial, operational, and technological strategy developmentBest practices and process re-engineeringBusiness integration planning and executionInformation systems requirements design, selection, and implementation & optimization managementSystem developmentProject and program managementOperational and IT strategy assessments and due diligenceBasic Qualifications:Working towards a B.A. or B.S. degree or equivalent from an accredited universityBachelor’s degree in the field of accounting, business administration, economics, finance, computer science, and/or management information systemsDemonstrated capability to achieve strong academic results in selected field as well as a facility with / aptitude for technologyCritical thinking and creative problem-solving skills, as well as the ability to apply theoretical concepts and best practices to solve business problemsHighly self-motivated and directed character with the ability to effectively prioritize and execute task while under pressureStrong oral, written, and interpersonal communication skillsAbility to work successfully in a team-oriented, collaborative environmentEligibility to work within the U.S.Travel to assigned client locations locally & nationally is required. Must have access to and ability to arrange for use of reliable modes of transportation to those locationsAbility to travel up to 50% locally and nationallyA minimum 3.0 GPA is preferredPreferred Qualifications:Basic understanding of business processes and concepts in process redesignBasic understanding of technology, including infrastructure, databases, and application / enterprise architectureAbility to exercise independent judgment and take guided action on itStrong data manipulation skills utilizing Excel, including database knowledge (Microsoft SQL and/or Access knowledge is plus)Experience with software, such as Microsoft Project, Visio, PowerPoint, and Word; andAccess to a vehicle for client site visits You want your next step to be the right one. You've worked hard to get where you are today. And now you're ready to use your unique skills, talents and personality to achieve great things. RSM is a place where you are valued as an individual, mentored as a future leader, and recognized for your accomplishments and potential. Working directly with clients, key decision makers and business owners across various industries and geographies, you'll move quickly along the learning curve and our clients will benefit from your fresh perspective.  Experience RSM US. Experience the power of being understood.  RSM is an equal opportunity/affirmative action employer. Minorities/Females/Disabled/Veterans.Job ID req3353Line of Business: Consulting ServicesSubFunction: TMC BA D365 Ent DeliveryJob Type: Part TimeReq #: req3353Location:  515 S. Flower Street, 41st Floor, , Los Angeles, CARegion: West RegionJob Category: Business Consulting/TechnologyEmployment Type: Campus InternDegree Required: NoneTravel: Yes"}