{"jobID": "2429274596", "jobLocation": "San_Francisco_CA", "jobTitle": "OTR Independent Contractor Position", "companyRating": null, "companyInfo": {"Website": "www.driveforprime.com/?r=glassdoor", "Headquarters": "Springfield, MO", "Size": "1001 to 5000 employees", "Founded": " 1970", "Type": " Company - Private", "Industry": " Transportation & Logistics", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Prime Inc. was founded in 1970 by Robert Low and is North America's most successful refrigerated, flatbed, and tanker trucking company and provides safe, reliable, and continuous on-time service to its expanding international customer base. We are hiring for experienced and non-experienced drivers in refrigerated, flatbed, and tanker. How To Get Started: Attend a 3-day orientation at Prime in one of the following locations: Springfield, MO; Pittston, PA; and Salt Lake City, UT. Prime provides bus transportation to orientation as well as 3 meals per day and hotel accommodations during orientation. Experience hands-on, computer based, and simulator training. Get the keys to your own truck and get on the road!Excellent revenue and steady miles Earn 72% of revenue as a Refrigerated/Flatbed Contractor Earn 71% of revenue as a Tanker Contractor Team Driver Associates earn Quarterly Mileage Incentives at 50,000+ miles in a quarter $100 cash reward for clean roadside inspections Retention and Rewards Program- Prime invests up to $1,500/year on your behalf Driver Referral Program Earn money for referring new drivers to Prime. Innovative award & recognition programs Ability to become a CDL Instructor or Trainer & earn more moneySpend less on fuel, tires & service Volume discounts on fuel, tires, parts, & service Fuel Purchase Network with fleet volume discounts Fuel surcharge protection planEnjoy the best equipment features: Sensor Tracs Ability to customize your tractor with decals and graphics Variety of colors and models available through Success Leasing No money down, no credit check leasing options available Trailer Tracs to help protect your freight Lane Deviation Warning System APUs available Passengers allowed (simply obtain a free passenger permit from your Fleet Manager) Pets allowed without a pet deposit ACE continuous learning makes your business more profitableIncentives and Bonus Programs: Safety and Service Incentive Driver Referral Program Training ProgramEquipment: Freightliner, Peterbilt, and International 2014 Model Tractors & Newer APU & 1500 Watt Inverters Omnitracs Qualcomm with Electronic Logs and Navigation Prime Mobile App for Trip Scanning, Messaging, and MoreSupport: 24/7/365 Driver Support for for Operations/Dispatch and Road Assist Industry-Leading Amenities at our main terminals in MO, PA, & UT Driver Health and Fitness ProgramIf you have at least 6 months of recent tractor trailer experience, ask your Recruiter about Start Right Pay which offers guarantee pay of at least $1000 per week for the first 3 weeks at Prime for experienced independent contractors. Apply now on Glassdoor or call 877-491-1113 to speak with a Prime Inc. Recruiter!"}