{"jobID": "2654413108", "jobLocation": "Seattle_WA", "jobTitle": "Senior Data Scientist, Decision Analytics", "companyRating": "3.2", "companyInfo": {"Website": "www.exlservice.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1999", "Type": " Company - Public (EXLS) ", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "88000", "jobDescription": "Senior Data Scientist, Decision Analytics EXL (NASDAQ:EXLS) is a leading operations management and analytics company that helps businesses enhance growth and profitability in the face of relentless competition and continuous disruption. Using our proprietary, award-winning Business EXLerator Framework™, which integrates analytics, automation, benchmarking, BPO, consulting, industry best practices and technology platforms, we look deeper to help companies improve global operations, enhance data-driven insights, increase customer satisfaction, and manage risk and compliance. EXL serves the insurance, healthcare, banking and financial services, utilities, travel, transportation and logistics industries. Headquartered in New York, New York, EXL has more than 24,000 professionals in locations throughout the United States, Europe, Asia (primarily India and Philippines), Latin America, Australia and South Africa.  EXL Analytics provides data-driven, action-oriented solutions to business problems through statistical data mining, cutting edge analytics techniques and a consultative approach. Leveraging proprietary methodology and best-of-breed technology, EXL Analytics takes an industry-specific approach to transform our clients’ decision making and embed analytics more deeply into their business processes. Our global footprint of nearly 2,000 data scientists and analysts assist client organizations with complex risk minimization methods, advanced marketing, pricing and CRM strategies, internal cost analysis, and cost and resource optimization within the organization. EXL Analytics serves the insurance, healthcare, banking, capital markets, utilities, retail and e-commerce, travel, transportation and logistics industries.  Please visit www.exlservice.com for more information about EXL Analytics. Design, develop and deploy data-driven predictive models/algorithms to solve business problems using the latest and most appropriate technologies in Operations Research, Machine Learning and Statistical ModellingPerform data analysis on large scale datasets (millions of rows)Perform large scale optimization and statistical analysis in areas of web analytics, forecasting and supply chain managementCommunicate insights and formulate recommendations for the clientsCommunicate and coordinate effectively with the offshore teamAdvanced degree (PhD/MS) in a quantitative field like Operations Research, Industrial Engineering, Computer Science, Mathematics, Statistics, or equivalent education1+ years of hands-on experience of working on Supply Chain Management problems such as Network Planning, Transportation, Inventory Optimization, Forecasting etc.Deep knowledge of statistical and machine learning algorithms such as regression, decision trees, neural networks, clustering, collaborative filtering, survival analysis, etc.Extensive experience using SQL, Bash scripting, analytic programming language like R/PythonExperience working with optimizer solver tools like LLamasoft, GurobiExperience working with NoSQL data environments and tools such as Hadoop, Spark, DynamoDB will be preferredKnowledge and experience working with cloud computing solutions such as AWS, Azure and visualization tools like Tableau, Shiny, d3.js, etc.Self-starter with ability to solve ambiguous/open-ended business problemsExcellent written and verbal communications skillsWhat we offer:EXL Analytics offers an exciting, fast paced and innovative environment, which brings together a group of sharp and entrepreneurial professionals who are eager to influence business decisions. From your very first day, you get an opportunity to work closely with highly experienced, world class analytics consultants.You can expect to learn many aspects of businesses that our clients engage in. You will also learn effective teamwork and time-management skills - key aspects for personal and professional growthAnalytics requires different skill sets at different levels within the organization. At EXL Analytics, we invest heavily in training you in all aspects of analytics as well as in leading analytical tools and techniques.We provide guidance/ coaching to every employee through our mentoring program wherein every junior level employee is assigned a senior level professional as advisors.Sky is the limit for our team members. The unique experiences gathered at EXL Analytics sets the stage for further growth and development in our company and beyond. \"EOE/Minorities/Females/Vets/Disabilities\"EEO/Minorities/Females/Vets/Disabilities"}