{"jobID": "2761538602", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist - Insurance", "companyRating": null, "companyInfo": {"Website": "www.blueowl.xyz", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2016", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "A million people a year die in car collisions around the world and we want that number to be zero. We invite you to help us build an InsurTech company that uses rich customer insights, advanced technology and data science to save lives by preventing car collisions before they happen. To this end, we recently helped launch our first product, hiroad.com, a cloud native insurance solution that rewards people for the act of driving well.With impressive funding, a compelling vision, and a world-class team, we're poised to re-engineer a trillion-dollar category from the ground up- and that's just where we're beginning. Longer term, we're out to change behavior and promote mindful living at a societal level.We're seeking someone to build and support critical backend systems and services that are core to our business. This includes the rewards system that will be used to increase driver safety, designing APIs, creating/managing databases, and writing automated test suites.General tools you build will be open sourced and will ideally be consumed by the greater community.Job requirements This role will require the candidate to be extremely hands on with building models and data driven tools. Past experience implementing complex data-driven solutions is required.Advanced Python skills. Should be familiar with Python’s scientific computing ecosystem.Advanced SAS skills. Should be familiar with SAS best practices.Deep experience with GLMs as well as modern machine learning methods.Actuarial science is a plus, but is not required.More details Salary: We invest in first-rate people and pay top-of-market salaries for most positions, factoring in experience and talent. We are unable to offer equity.Benefits: Full medical, dental, vision coverage, 401k, daily catered lunch, wellness reimbursement & on-site shower, four weeks of vacation, six weeks of parental leave, panoramic views, and more.Location: Near Montgomery Street BART station, San Francisco, California. Locals preferred, but relocation within the US considered for outstanding candidates.All are welcome at Blue Owl. We are an equal opportunity and affirmative action employer who values diversity and inclusion and looks for applicants who understand, embrace and thrive in a multicultural world. We do not discriminate on the basis of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records."}