{"jobID": "2735052304", "jobLocation": "New_York_NY", "jobTitle": "Office Supervisor", "companyRating": null, "companyInfo": {"Website": "www.dmediainc.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 1978", "Type": " Company - Private", "Industry": " Arts, Entertainment & Recreation", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " JOB DESCRIPTION  Position Title: Office Supervisor  Location: Westchester County, NY & New York, New York  The Office Supervisor is responsible for the organization and coordination of all office operations, procedures and resources to facilitate effectiveness and efficiency throughout our company. Digital Media Systems Inc. is a fast paced firm which caters to the very quick and dynamic changes in the Cinema industry.  The Office Supervisor will work directly with management to insure that all facets of Digital Media Inc. business are performed professionally, efficiently, and reliably.  The ideal candidate will have a minimum of 5 (five) years experience in traditional office environment. The candidate must also have the ability to think and act strategically with strong problem solving, analytical and negotiating skills, as well as proven skills in prioritizing and managing many situations simultaneously. Additionally, the candidate must possess outstanding communication skills and a proven record of client follow up.  Essential Job Functions by Category:  Office Management  · Oversee and direct tech staff with adherence to office procedures and job responsibilities.  · Manage Tech calendar, including scheduling of technicians and projects.  · Manage all screening room and contractual field service needs. This includes scheduling techs, coordinate equipment deliveries, organize billing, provide follow up.  · Create and maintain office timelines and staff accountability. Establish and monitor procedures for all office record keeping.Implement procedural and policy changes to improve operational efficiency. · Organize weekly meetings, including minutes and agenda updates.  · Client relations - working with clients to understand their needs, their possible budget concerns to create appropriate proposals.  · Manage travel arrangement for techs including flights, hotels, car rentals and train ticket purchases. Create travel itineraries for techs with all applicable information. Include on-site contact person info, reservation numbers, etc.  · Update and issue Weekly Activity Report to ownership.  · Office management including ordering supplies, organizing, filing design and implementation, equipment inventory.  · Other routine clerical work including answering of telephones as necessary.  Bookkeeping  · QuickBooks management including: create /maintain all invoicing, accounts receivable/payable,  PO requests, reconciling bank accounts.  · Prepare, maintain, and distribute income and expense budgets  · Submit payroll and expenses through ADP.  · Create Job costing reports per invoice / project.  · Employee recruitment when and if necessary.  Requirements:  College degree in Business Administration.  5 years experience in traditional office environment with bookkeeping experience.  Detailed knowledge of accounting and other computer software including spread sheets, word processing, including Microsoft Word, Excel and QuickBooks Pro.  Outstanding organizational and communication skills.  Demonstrate understanding of the industry."}