{"jobID": "2829349473", "jobLocation": "San_Francisco_CA", "jobTitle": "Front-end Developer Intern", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " If you are someone who possesses a keen eye for detail, a superb aesthetic sense, and a passion for building the best user experience, keep reading.  NOSON is based in San Francisco and is the premier online company for airport parking reservations. With over tens of thousands of travelers, and working with only the best airport parking companies, we are transforming how the world discovers and reserves airport parking.  NOSON has a fast paced work environment and we are seeking talented interns who crave learning new skills and aren't afraid to tackle big projects. As an intern you will get to work directly with our CEO, while working on real projects that will help us grow.  Our ideal candidate is someone who walks into a room of people and canât leave without making a few friends. Someone who is obsessed with aesthetics, user experience and perfection. Also someone who is organized and self-led. What You Will Learn: How to develop beautiful interfaces for real projects  Troubleshooting problems and learning from the professional experience.  How to thrive in an organization that is growing in a fast pace  Continuous Integration methods and best practices  Plenty of additional opportunities in related projects  What We Require: Experience with HTML- Experience with SASS, CSS3- Experience with JQueryKnowledge of coding in Visual Studio and submitting to test server using FTP- Experience with Unit testingAbility to work from our office in SF and sometimes remotelyWe value all of our interns and go the extra mile to make sure you receive a learning experience that fits your career goals. You will become a highly skilled Frontend Developer with experience working on a product with thousands of customers, and understanding of the right tactics to reach goals in a professional setting. You will also learn how to work in a professional environment and have ample opportunities to network with professionals in the start-up and technology world. Details: The position begins July 10 (or when school is out for you), and will go until the end of the summer.  You are expected to work 40 hours a week and the internship is unpaid.  To apply please submit your application to Ramya Krishnamoorthy using the apply button below.  Job Type: Internship  Education: High school or equivalent  Location: San Francisco, CA 94105  Language: English  Job Type: Internship Required work authorization:"}