{"jobID": "2724510637", "jobLocation": "Cambridge_MA", "jobTitle": "Biological Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.asimov.io", "Headquarters": "Cambridge, MA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We are looking for a data scientist with experience in analyzing large scale biological datasets to join our foundational software team. At Asimov, data is core to our product; we engineer living cells by designing and inserting genetic circuits into living organisms. We are constantly generating molecular debugging data on the performance of our circuitry from RNA-seq, flow cytometry, microplate readers, and more. The optimal design of our genetic circuits and velocity of our biological design cycle depends on accurate and informed analysis of these experiments. At Asimov, we care deeply about every data scientists autonomy, emphasizing quality of analysis and algorithms over arbitrary deadlines. We have built a cross-functional organization and believe strongly in cross pollination: taking time to learn from our peers.As our lead data scientist you will have the opportunity to: Design the software systems and tools for analysis of biological datasets Partner closely with our synthetic biology team to understand our analysis flow and develop methods to improve the efficiency of our biolab Pair with our machine learning engineers to use cutting edge deep learning and GA methods to improve our circuit optimization platform (see github.com/CIDARLAB/cello) Embrace ambiguity and drive for impact Help define the company product, direction and cultureAbout you: You are a highly skilled technical lead in data science with years of experience in industry or research. You are passionate about joining an early stage startup where autonomy, passion to learn and excitement to engineer biology take precedence over process and ego. You have strong experience with python scripting, SQL, analysis of large biological datasets, a foundation in statistics and a passion to continually learn."}