{"jobID": "2746177894", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst", "companyRating": "4.8", "companyInfo": {"Website": "www.plaid.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "70000", "jobDescription": "Plaid is building technologies that improve how millions of users understand and grow their financial lives. Were looking for creative data analysts with strong product sense and client/user empathy, who can leverage billions of rows of data into actionable insights across our organization.At Plaid, you will have ownership over unparalleled collections of transactions, accounts, financial, and Plaid usage data. You will be empowered by this data and by our team to ask questions and find answers that enable our engineering, product, and business teams to make data driven decisions.What excites you Championing a data-first approach toward decision-making across the entire organizationPartnering with our sales, business development, and growth teams in identifying and growing business opportunitiesWorking with engineers, product managers, and business operations to identify improvement opportunities in our products and our internal data consumptionDesigning, building, and popularizing analytics dashboards and visualizations guiding the decisions, priorities, and goals of the companyWorking with data scientists on modeling with statistical/machine learning methodsWhat excites us:1-3 years of production SQL experience, and experience with/willingness to learn a scripting language like Python or RubyQuantitative, analytical background and experience communicating technical idealsA strong collaborative mindsetWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}