{"jobID": "2829463055", "jobLocation": "New_York_NY", "jobTitle": "Data Analyst", "companyRating": "2.0", "companyInfo": {"Website": "www.eheintl.com", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Private Practice / Firm", "Industry": " Health Care", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": "Who we are:EHE has led the way in preventive medicine for more than 100 years. With unparalleled experience, EHE fuses traditional and validated non-traditional methods to develop personalized care that boosts performance and facilitates longevity. EHE optimizes the experience for companies and individuals, engaging healthy employees through an integrated approach to wellness for both body and mind. EHEs clinical staff and vast physicians network provide dynamic, proactive and innovative care tailored to the specific needs of each person. Through comprehensive medical exams and post-exam coaching and coordination, EHE makes individual health management convenient and holistic. EHE-enhanced care creates incredible value for your personal health and promotes a culture of workplace wellness. EHE is backed by Summit Partners, the investment engine behind many of the worlds leading technology and healthcare enterprises. Summits strategic involvement has helped EHE reach new heights as a pioneering force in preventive care. What were looking for:EHE is looking for a talented Data Analyst to be an integral part of the CRM team. The Data Analyst will identify and analyze how data from multiple data sources influences current marketing programs and forward-looking campaign planning. This position will develop and monitor KPIs and identify opportunities to increase conversion rates. The Data Analyst will work closely with the Director of Demand Gen and CRM team to develop and execute all marketing analytics functions. This position will ensure strategic and tactical marketing decisions are informed by data-driven insights. In this role, you will:Build dashboards and execute reporting to provide real-time, ongoing insights to key internal and external stakeholdersEvaluate effectiveness of marketing initiativesUse data to create models that depict trends in the patient base and population as a wholeDeliver insight and research for optimizing communication programs; customer journey mapping, cross-sell campaign strategies, personalization, and A/B testingAnalyze data specifications to ensure required data fields are available for campaignsAssist in developing appropriate quality assurance standards, methods, or procedures to ensure overall data quality and/or release readinessWhat the role requires:5 years at top-tier consulting firm or marketing agency with experience in big data or marketing analytics (healthcare experience is a plus)Comfortable in the world of marketing and able to easily identify areas of opportunityProficiency with developing, maintaining and interpreting complex analytical insightsExperience with business intelligence analysis and project management skillsExperience in reviewing mass amounts of data within strict timeframesKeen eye for detail and the ability to manage multiple complex tasksExperience with Marketo, Salesforce and Google Analytics strongly preferredWhat we offer:Competitive salaryMedical, dental, vision, life and disability insuranceEmployer-matched 401(k) planTuition reimbursementEmployee access to our wellness clinicsGym membershipEHE is committed to Equal Employment Opportunity and to attracting and retaining the most qualified employees."}