{"jobID": "2759859477", "jobLocation": "Glendale_CA", "jobTitle": "Talent and Succession Planning Intern", "companyRating": null, "companyInfo": {"Website": "www.averydennison.com", "Headquarters": "Glendale, CA", "Size": "10000+ employees", "Founded": " 1935", "Type": " Company - Public (AVY) ", "Industry": " Manufacturing", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Bemis, 3M, UPM-Kymmene"}, "estimatedSalary": null, "jobDescription": " Company DescriptionAvery Dennison (NYSE: AVY) is a global materials science and manufacturing company specializing in the design and manufacture of a wide variety of labeling and functional materials. The company’s products, which are used in nearly every major industry, include pressure-sensitive materials for labels and graphic applications; tapes and other bonding solutions for industrial, medical and retail applications; tags, labels and embellishments for apparel; and radio frequency identification (RFID) solutions serving retail apparel and other markets. Headquartered in Glendale, California, the company employs approximately 30,000 employees in more than 50 countries. Reported sales in 2017 were $6.6 billion. Learn more at www.averydennison.com.Job DescriptionThis position provides the following support to the Sr. Director of Global Executive Development Talent and Succession Planning Process: Assist in the annual launch of our Leadership Development Review process (LDR). Aid in creating communications to the broad HR Global community, guidelines and instructions. and ensure electronic system (Success Factors) includes any adjustments needed for the kick off of the yearly process.Assist in the collection/integration of all source LDR documents from regions and businesses.Aid in the work related to analysis and summary of the overall state of talent and succession for the corporation, including talent metrics and key themes.Prepare for annual talent and succession planning review with CEO and his team: Assist in scheduling, material homogenization, and communication with key stakeholders. Aid in integrating notes during meeting into one document as well as other post-meeting activity.Aid in the post-meeting analysis of data and creation of master file that identifies talent in key categories as well as actions to take.Support in Quarterly Corporate Leadership Team talent and succession planning reviewsCo-lead Talent Analytics work: Identify what metrics we want to use, benchmarks, pull data from system/documents. Create a sustainable solution for talent metricsExecutive Development: Assist in the process of finding coaches worldwide, set up feedback tools, researching external programs, analyzing vendors, etc.Aid in the tracking, documentation and progress report for the different stakeholders of the Executive Development initiative.Team Effectiveness sessions for Key Senior Leadership Teams: Assist in the successful execution of team effectiveness sessions (OD) and related activities including, needs assessment, development, facilitation, material creation, launching surveys, etc.Other responsibilities include but not limited to: Vendor management, including managing scope of work process and related NDAs, ordering of materials, coordinating enrollment, session scheduling, and payment.Research vendor options and make recommendations on vendor capabilities for review.Serve as a liaison for Corporate Talent and Succession and the different organizations across the enterprise.Planning and execution of logistics and troubleshooting for sessions, workshops and events.Distribution and management of surveysStay current on market best practices/benchmarking.Be a thought partner/share observations related to the state of succession planning and overall talent landscape.Make recommendations for talent metrics that enable the organization to identify and provide solutions to key areas for improvement in how we’re managing, building and retaining key talent.Obtains and analyzes data from related systems and aids in the interpretation and identification of key messages from the data.Aids in data distilment and conversion into key input for decision making in Human Resource Strategic Initiatives QualificationsBachelor's degree in Business, HR, Leadership, Organizational Design or related fields is required; candidates with a Master’s Degree or are pursuing a Master’s degree are preferred1-2 years of working experience in Talent and Succession Planning as well as Leadership Development fieldsUnwavering commitment to maintain confidentiality of sensitive informationHas prior experience working with senior leadershipProfessional yet personable with excellent communication skillsReliable, productive, enthusiastic, proactive and detail orientedAbility to multitask and function within a fast paced organizationStrong computer skills; proficient in Google Suite and Microsoft Office suite (Word, Excel, PowerPoint)Demonstrated ability to handle detailed work accurately and quickly, work to deadlines on multiple tasks, to work as a team member in a collaborative and participatory manner, and to interact both in person and over the phone with a courteous and professional demeanorDemonstrated self-learner interested in continued professional development and personal growthStrong Time Management skills, ability to prioritize own Calendar and Time, meet project timelines, deadlines, and deliverables with independenceManage Competing Priorities - effectively manages own time and resources to ensure multiple priorities are balanced and managed successfullyAbility to be self managed/directed and capable of completing tasks with minimal supervisionAbility to assess and track training effectiveness through the use of metricsExcellent written and verbal communication skills and ability to effectively communicate and collaborate with internal and external connections at all levelsPositive and consistent customer service orientationAbility to work and thrive in a fast-paced environmentStrong analytical skills. Comfortable with data management/data manipulation and strong attention to detailAbility to take on increased responsibility and special initiatives/projects as needed Additional InformationAll your information will be kept confidential according to EEO guidelines.Job LocationI'm interested"}