{"jobID": "2517490505", "jobLocation": "Boston_MA", "jobTitle": "Digital Services Intern", "companyRating": null, "companyInfo": {"Website": "www.mapc.org", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 1963", "Type": " Company - Private", "Industry": " Government", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " DescriptionThe Metropolitan Area Planning Council seeks a Digital Services Intern for the Data Services Department. The Digital Services Intern will assist in the Digital Services team in order to beta test, design and develop features and interactive content for web-based projects. The ideal candidate will be familiar with urban planning and experience with a programming language such as R, SQL, Python, JavaScript, Ruby, Ruby on Rails, or other scripting language. Additionally, experience with, and interest in learning interactive cartographic tools and visualization libraries including: Carto, Leaflet, d3, Processing.js are ideal.   The intern will have the opportunity to participate in a wide variety of digital projects that focus on topics relating to workforce development, housing, open data management, municipal IT procurement, and transportation data across Metro Boston. This is an opportunity to work in a dynamic, multidisciplinary environment focused on using data and digital tools to support regional planning and policymaking.  About MAPC MAPC is the Regional Planning Agency (RPA) serving the people who live and work in metropolitan Boston. Our mission is to promote smart growth and regional collaboration. We are guided by MetroFuture: Making a Greater Boston Region, our regional policy plan for a more sustainable and equitable future, which was adopted in 2008. We work toward sound municipal management, sustainable land use, protection of natural resources, efficient and affordable transportation, a diverse housing stock, public safety, economic development, an informed public, and equity and opportunity among people of all backgrounds. MAPC's staff includes approximately 75 full-time employees located in downtown Boston in a transit-accessible and bike-friendly office. For more information about MAPC and MetroFuture, visit www.mapc.org/about-mapc and www.mapc.org/metrofuture.  About the Data Services Department The Data Services Department is a team of 14 planners, analysts, researchers, programmers, and IT professionals dedicated to using data and technology to support informed decision-making. We provide mapping, digital and analytical services to support MAPC's local and regional planning activities, develop new datasets, conduct independent research, prepare population and land use forecasts, and serve as a resource for municipalities, state agencies, and community organizations. To learn more about the department, visit data.mapc.org.   This position will offer you many opportunities to build relationships with numerous public and private sector collaborators throughout Massachusetts, and to build new connections and cultivate new partnerships. You will have the chance to gain significant data visualization, mapping, and programming skills.  Instead of imposing vision from the top down, we work together to establish and maintain the vision for a project. We trust each other to do high-quality work, and acknowledge that we have lives outside of the office.Examples of Duties Develop prototype applications for supporting the work of planners at MAPC and within municipal governments Utilize user-centered design principles in prototyping these applications Use CartoDB, Leaflet, d3 and c3 to produce interactive maps and data visualization Assist lead developer on the production of Ruby on Rails applications, Ember.js framework Test and perform QA on existing applications Beta test and develop features and interactive content for MAPC's own data storytelling platform, an interactive data visualization GUI, data visualization for annual State of Equity Report Contribute writing and interactive content to blog on planning and data Explore machine learning and maintain web-scraping infrastructure Typical QualificationsThe following are required qualifications for the position: Currently enrolled in an undergraduate or graduate program. Comfort and some experience with general programming practices. Training and experience (either academic or applied) using interactive cartographic and data visualization tools (Carto, Mapbox, Leaflet, javascript) Experience with using open data in an interactive project Background in Urban Planning, Urban Studies or Urban Design with interest in programming; OR background in Computer Science, Data Science, Interactive Design (UI or UX) with interest in urban and regional planning  The following are preferred qualifications for the position:  Strong quantitative and problem-solving skills; experience with empirical methods and data analytics including working with a diverse profile of data sets, building applied statistics or econometrics models, and/or conducting research Experience with other statistical and analytical tools such as STATA, SAS, SPSS and ArcGIS are a plus. Excellent written and oral communication skills Energetic and resourceful, organized and results-oriented Comfortable interfacing with senior management and stakeholders Supplemental InformationCompensation $17 - $23, depending on qualifications. This is a paid, part-time (15 – 30 hours per week) internship with flexibility. To qualify as an intern, individuals must be enrolled in a course of study, provide written verification of their status, and agree to a scheduled end date upon hire. How toApply The position is open until filled, and applications are reviewed on a rolling basis. Interested candidates should submit a cover letter, resume, and interactive project example. Those who are interviewed will be asked to submit three (3) references.   Apply online at www.mapc.org/jobs. Please attach a cover letter, résumé, and portfolio that includes a writing sample and digital project example. A review of applications will begin immediately. The position is open until filled. Only candidates currently enrolled in an academic program will be considered for this position. Candidates must have legal authorization to work in the USA. MAPC is an EOE/AA employer. MAPC takes pride in the diversity of its workforce and encourages all qualified persons to apply."}