{"jobID": "2738802314", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist - MindMeld Conversational AI", "companyRating": "4.0", "companyInfo": {"Website": "www.cisco.com", "Headquarters": "San Jose, CA", "Size": "10000+ employees", "Founded": " 1984", "Type": " Company - Public (CSCO) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Alcatel-Lucent, Juniper Networks"}, "estimatedSalary": "113000", "jobDescription": "What You’ll Do The workplace of the future will be powered by AI and the MindMeld team is making that a reality. Our small team was recently acquired by Cisco to power conversational interfaces for their Collaboration portfolio. Our first step will be to bring voice AI to meeting rooms. As a Data Scientist, You will analyze data from query logs and crowdsourced simulationsYou will prototype work flows for data acquisition and augmentation, to enable training and evaluating machine learning modelsYou will produce empirical insights to iteratively improve our conversational interfacesWho You’ll Work With You’ll join a small, high-caliber team of machine learning specialists who are passionate about the future brought by AI. We move fast, continuously improve, and deliver high-impact results. We’re not only aiming to build a conversational AI; we strive to build the best conversational AI application the world has ever seen.Who You Are You have a passion for and experience in data analysis, natural language processing and conversational interfaces. You thrive in an agile development process, and you look forward to joining a collaborative team of high-caliber experts. You’re not just looking for a job, you’re looking for an innovative product where you can make a large impact. You’re self-motivated and set high expectations for yourself, you take ownership and sweat the small stuff. You flourish with constructive feedback, you insist that facts drive decisions, and you deliver results that matter. Our Minimum Requirements AreB.S. or advanced degree in a quantitative discipline (e.g. cognitive science, statistics, psychology)3+ years’ experience of data science working on NLP/ML/IR products or researchFamiliarity with inferential statistics and machine learning data pipelinesExperience with crowdsourcing, search log analysis, or voice UX analysisDemonstrated ability to conduct and interpret quantitative and qualitative analyses using noisy data setsExperience using Python/R or similar scripting languages to manipulate, analyze and visualize large data setsExperience with programmatic usage of SQL databases and search enginesStrong communication and problem-solving skillsWhy CiscoWe connect everything: people, processes, data, and things. We innovate everywhere, taking bold risks to shape the technologies that give us smart cities, connected cars, and handheld hospitals. And we do it in style with unique personalities who aren't afraid to change the way the world works, lives, plays and learns.We are thought leaders, tech geeks, pop culture aficionados, and we even have a few purple haired rock stars. We celebrate the creativity and diversity that fuels our innovation. We are dreamers and we are doers.We Are Cisco.LI-MA1#GD2015"}