{"jobID": "2808819893", "jobLocation": "Ipswich_MA", "jobTitle": "Senior Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.ebsco.com", "Headquarters": "Ipswich, MA", "Size": "5001 to 10000 employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Ex Libris, Cengage, Copyright Clearance Center"}, "estimatedSalary": "61000", "jobDescription": " EBSCO Information Services (EIS) provides a complete and optimized research solution comprised of e-journals, e-books, and research databases — all combined with the most powerful discovery service to support the information needs and maximize the research experience of our end-users. Headquartered in Ipswich, MA, EIS employs more than 3,300 people worldwide. We are the leader in our field due to our cutting-edge technology, forward-thinking philosophy, and top-notch workforce. EIS, a division of EBSCO Industries Inc., based in Birmingham, AL, is ranked in the top 200 of the nation’s largest, privately held corporations according to Forbes magazine. EBSCO is a company that will motivate you, inspire you, and allow you to grow. We are looking for the best. If you are too, we encourage you to explore our unique opportunities. Mission: EBSCO’s Content Management (CM) team is looking for a creative and motivated individual who, like us, have a passion for data, innovation, problem-solving, and continuous improvement. The ideal candidate will be a passionate problem-solver with excellent analytical skills, who is comfortable navigating large data sets from multiple sources, clearly connects technology solutions with measurable business value, and is eager to work fast and smart as part of a high-performing team. The Senior Data Analyst will constantly seek ways to improve and automate day-to-day operations for the team, enabling us to exceed customer needs and expectations by delivering content quicker and with higher quality. The position is a great fit for a motivated self-starter who loves to drive sustainable solutions for real business problems. Primary Responsibilities:Lead or participate in multiple initiatives by evaluating business requirements managing project scope; determining priorities; ensuring efficient and on-time delivery of initiative tasks and milestones; and managing customer expectations on resultsIdentify, create and facilitate process design changes by conducting business and systems process analysis; focusing on quality improvement and data management; ensuring data is reliable and valid; developing process improvements; integrating new systems and processes with existing ones; and partnering with key stakeholders to ensure systems provided meet the long-term business strategiesProvide and support the implementation of business solutions by building relationships and partnerships with key stakeholders in CM; identifying business needs; determining and carrying out necessary processes and practices; monitoring progress and results; recognizing and capitalizing on improvement opportunitiesSupport Content Management reporting needs by: gathering and documenting thorough requirements; identifying, preparing and analyzing data; creating ad hoc or persistent reports; and providing actionable insights to business users.Identifies new opportunities and solutions, and vets various methods and tools that could lead to future process improvements (in particular, with ways to automate manual processes and develop automation solutions)Provide leadership to team members and peers by collaborating with others; articulating ideas and viewpoints to senior management, peers and others; identifying and initiating projects; managing resources; driving the resolution of issues; and holding self and team accountable for resultsRole Based Competencies: •Analytical skills: Able to structure and process qualitative or quantitative data and draw insightful conclusions from it. Exhibits probing mind and achieves penetrating insights.  • Communication and Presentation: Able to effectively communicate and present technical concepts to technical and non-technical professionals. Requirements Analysis: Gathers, organizes and evaluates any information or data needed as input from stakeholders to determine requirements and specifications.Technical Proficiency: Understands complex components, technologies and architecture and thinks about the interdependencies and interconnected systems.Continuous Improvement: Continually focused on improving the responsiveness and quality of the solutions delivered.Self-Motivated: ability to drive oneself to overcome challengesStrategic Thinking: ability to think broadly about process and generate new ideas as well as drive the implementation of new workflows. Determines opportunities and threats through comprehensive analysis of current and future trends. Required Qualifications:Bachelor’s degree or equivalent years of experience5+ years of experience in a business analyst role2+ years of experience working in an agile environment2+ years of experience with Data Analysis – Must have proficiency with relational databases, SQL, Microsoft ExcelStrong communication skills – both written and verbal2+ years working and developing knowledge of data visualization tools such as Tableau2+ years experience extracting and analyzing large data setsPreferred Qualifications:3+ years’ experience with TableauKnowledge of Publishing IndustryStrong organization and time management skills and the ability to manage multiple projects EBSCO Industries, Inc.is an equal opportunity employer and complies with all applicable federal, state, and local fair employment practices laws. EBSCO strictly prohibits and does not tolerate discrimination against employees, applicants, or any other covered persons because of race, color, sex (including pregnancy), age, national origin or ancestry, ethnicity, religion, creed, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class. This policy applies to all terms and conditions of employment, including, but not limited to, hiring, training, promotion, discipline, compensation, benefits, and termination of employment.  EBSCO complies with the Americans with Disabilities Act (ADA), as amended by the ADA Amendments Act, and all applicable state or local law. Nearest Major Market: Boston Job Segment: Database, Data Analyst, Business Analyst, SQL, Data Management, Technology, Data"}