{"jobID": "2823489436", "jobLocation": "Seattle_WA", "jobTitle": "senior data scientist, data&measurement;, Customer Analytics", "companyRating": "3.8", "companyInfo": {"Website": "www.starbucks.com", "Headquarters": "Seattle, WA", "Size": "10000+ employees", "Founded": " 1971", "Type": " Company - Public (SBUX) ", "Industry": " Restaurants, Bars & Food Services", "Revenue": " $10+ billion (USD) per year", "Competitors": " Dunkin' Brands, McDonald's"}, "estimatedSalary": "155000", "jobDescription": " Job Summary and Mission  Are you a data scientist who thinks like a business owner? Are you passionate about solving business problems by designing optimal experiments and deploying solutions at scale using 1st, 2nd, and 3rd party customer data in a next generation analytics infrastructure to help Starbucks optimize digital engagements with our 75M customers?  If you answered \"yes\" to the questions above, please come and join our Customer Marketing Analytics team. You will help optimize app-level product recommendations, digitial menu board content, voice-order recommendations, drive-thru personalized menu board content, in-store marketing via personalized content on order labels and POS systems.  Summary of Key Responsibilities  Responsibilities and essential job functions include but are not limited to the following: Leverage and enhance Starbucks' \"DeepBrew\" data science experimentation and ML solutions deployment platform that is built in AzureBuild and operationalize Machine Learning models in batch, real-time data pipelines and scalable Restful APIsEmploy scaling and automation to data preparation in cloud-based VMs and clustersDetermine analytics approaches to solve business problems; incorporate machine learning algorithms where appropriateActively participate in an Agile team structure designed to create a bias for action (fail fast)Connect insights to business decision making options and next steps testingUnderstand business initiatives and serve as primary analytic resource in discussions with business partners to define business questions and research opportunitiesDrive creation of business insights package and recommendations; lead presentationsCreate clear and concise packaging and presentation of data products' design and utility to business leaders and broader analytics communityPromote and advocate value of advanced analytics to solve business problems within departmentMentor peers in data science Summary of Experience Years within data analysis field or disciplineMinimum 3 Year's Experience Basic Qualifications Education: MS with concentration in quantitative discipline - Stats, Math, Comp Sci, Engineering, Econ or similar discipline Required Knowledge, Skills and Abilities Experience using Microsoft Azure (or AWS equivalent) cloud tech stack to build and deploy solutionsAdvanced competency and expertise in R or Python with exposure and business-applicable experience in additional languagesExperience processing data at scale via Spark (PySpark, Scala, or Java) in HadoopAdvanced competency and expertise in at least one statistical modeling&machine; learning technique (regression, tree models, survival analysis, cluster analysis, forecasting, anomaly detection, association rules, etc.) with non-academic experience in deployment to solve a business problemBasic SQL and NoSQL experienceAbility to apply knowledge of multidisciplinary business principles and practices to achieve successful outcomes in cross-functional teams and projectsBe an effective advocate within Starbucks for analytics to solve key business problemsExperience with one or more compiled programming languages such as C , Java preferredRetail, customer loyalty and eCommerce experience preferred Starbucks and its brands are an equal opportunity employer of all qualified individuals, including minorities, women, veterans&individuals; with disabilities. Starbucks will consider for employment qualified applicants with criminal histories in a manner consistent with all federal, state, and local ordinances."}