{"jobID": "2819942055", "jobLocation": "San_Francisco_CA", "jobTitle": "Lead Teacher", "companyRating": "3.1", "companyInfo": {"Website": "www.brighthorizons.com", "Headquarters": "Watertown, MA", "Size": "10000+ employees", "Founded": " 1986", "Type": " Company - Public (BFAM) ", "Industry": " Education", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Learning Care Group, Kindercare, Knowledge Learning"}, "estimatedSalary": "45000", "jobDescription": "Job Title Lead Teacher  14-Jun-2018 Job DescriptionShape enriching experiences As a Lead Teacher at Bright Horizons, you will guide a team to create a safe and nurturing environment that encourages children’s social, emotional, physical and intellectual development. You’ll enjoy a warm and supportive workplace in a beautiful center and classroom designed with children and teachers in mind. We're hiring in several locations in San Francisco with all age groups- infants to kindergarten prep. Some centers offering a $1500 hiring bonus. You will be encouraged to share your passion for early childhood education with the children, their parents, and your colleagues. Your love of learning will be passed onto the eager minds of the children in your care, and your guidance and positive reinforcement will set the stage for many incredible milestones to come.  At Bright Horizons, you’ll also find opportunities to experience personal and professional breakthroughs of your own. While working for a company with a learning culture, you will discover your full potential through state-of-the-art online training, leadership development, and tuition reimbursement. Our company culture invites you to bring your whole self to work as we believe that our unique attributes, perspectives and backgrounds make us a stronger team.  How will you inspire our future generation? What you will do as a Lead Teacher:Feel a sense of accomplishment as you hear the laughter and experience the wonder of children participating in activities that you and your team plannedObserve children’s interests and work with your team to design creative and engaging curriculum that reflects the children’s interestsGive direction and mentor less experienced staff to ensure that daily responsibilities are completed and that safety and attention to the children’s individual basic care needs are top prioritiesRecord and share children’s triumphs and progress with parents on a daily basis, sharing their children’s latest adventures and achievements through a variety of avenues, including mobile apps and personal conversationsLive and exemplify our HEART Principles of Honesty, Excellence, Accountability, Respect, and Teamwork in your interactions with the children, families, and your colleagues Req Number73649BRState California Zip/Postal Code94105City San Francisco Job Category Teaching Posting Title Lead Teacher FT/PT Full-Time Job RequirementsWhat we are looking for:Minimum age of 18Hold a High School Diploma/GED and minimum 12 ECE core units12 months of professional teaching experience in a classroomMeet state educational licensing and additional center/school requirementsDemonstrated knowledge of developmentally appropriate practice (DAP)A passion for child care and making a difference in the lives of young children We do give preference to child care lead teachers with the following:Bachelor’s degreeCDA or Associate’s degree in Early Childhood education or related field12 months of professional teaching experience in a classroom Bright Horizons – A fresh perspective on learning In addition to being the leading provider of high quality child care and early education, Bright Horizons is the only child care company repeatedly named by FORTUNE as one of the “100 Best Companies to Work For.” We are passionate about building an organization where you can make an impact on future generations. It begins with the educators that we hire, and by helping you grow with us. We support a well-rounded, individualized curriculum that is fully engaging and tailored to each child’s developmental needs. This visionary approach helps craft enriching experiences, and empowers children to be confident and successful lifelong learners. Benefits we offer:Competitive salariesCareer path opportunitiesExtensive health benefitsComprehensive tuition reimbursement401(k)Volunteer opportunities through the Bright Horizons Foundation for ChildrenCommuter benefitsHealth club discountsCell phone discounts and much more  Learn more about our award-winning company and culture, including our Foundation for Children and focus on social responsibility here.Additional InformationBright Horizons – A fresh perspective on learning In addition to being the leading provider of high quality child care and early education, Bright Horizons is the only child care company repeatedly named by FORTUNE as one of the “100 Best Companies to Work For.” We are passionate about building an organization where you can make an impact on future generations. It begins with the educators that we hire, and by helping you grow with us. We support a well-rounded, individualized curriculum that is fully engaging and tailored to each child’s developmental needs. This visionary approach helps craft enriching experiences, and empowers children to be confident and successful lifelong learners. Benefits we offer:Competitive salariesCareer path opportunitiesExtensive health benefitsComprehensive tuition reimbursement401(k)Volunteer opportunities through the Bright Horizons Foundation for ChildrenCommuter benefitsHealth club discountsCell phone discounts and much more  Learn more about our award-winning company and culture, including our Foundation for Children and focus on social responsibility here.Job Category 2 Center and School  Apply"}