{"jobID": "2770016960", "jobLocation": "Santa_Clara_CA", "jobTitle": "Principal Engineer, Quality Systems", "companyRating": "3.9", "companyInfo": {"Website": "www.inphi.com", "Headquarters": "Santa Clara, CA", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Public (IPHI) ", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "166000", "jobDescription": " We are looking for a Principal, Quality Systems Engineer who will be responsible for Inphi’s quality management system, document control system, support ISO as well as customer audits, support customer quality, and track corrective actions. Ensure company quality systems and procedures conform to generally accepted practices that enable best in class quality. The candidate will report to the Director of Quality.  Responsibilities Include: Responsible to maintain and expand Inphi’s quality management system ensuring that it is adequate, up-to-date and completeEnsure compliance to the quality management system across all facets of the companyMaintain compliance with ISO certification requirementsSupport audits by customers, ISO registrars or external certification companies, and of suppliers. Track audit action items and CAR’s.Lead regular Quality Management reviews, including data collection, analysis and reportingConduct/manage internal audits at Inphi’s US and worldwide sitesSet up and maintain document control system.Support sales with completion of supplier quality surveys from customersPeriodic travel to offices and suppliers in North America/Asia requiredEducation, Experience and Skill Requirements:BS. or higher in Materials Science or Electrical Engineering or related field with 10+ years work experience in semiconductor product company.Proven track record of managing and improving quality systems at a fabless semiconductor companyISO 9001 and ISO27001 Quality systems training.Experience with Document control and Quality Management systems like PLM360, Agile or similar; knowledge of databases is a plusExperience planning/conducting audits and managing customers / suppliers.Good oral and written communication skillsStrong interpersonal, planning, and organization skillsAbility to be highly effective in a matrix management organizationMust be able to work independently and think proactively"}