{"jobID": "2753082790", "jobLocation": "New_York_NY", "jobTitle": "ONE-TO-ONE AIDE", "companyRating": "3.3", "companyInfo": {"Website": "www.birchfamilyservices.org", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Non-Profit", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "17", "jobDescription": "Job DetailsLevel EntryJob Location Riverdale Early Childhood Center - Riverdale, NYPosition Type Full TimeEducation Level High SchoolJob Shift DayJob Category EducationDescription The One-to-One Aide will provide support and coverage to one child under the guidance and supervision of the Lead Classroom Teacher. ESSENTIAL FUNCTIONS Works hand-in-hand with the Teacher and related service staff, following the Teacher’s instructions classroom model;  Assists the Teacher in all activities necessary to support student attainment of IEP goals, including daily program planning and physical environment organization following all IEP mandated guidelines and goals established for the  Participates as a classroom and interdisciplinary team member, as well as in other teams as determined by the Principal. Participates in all relevant meetings (team, department, staff, module, etc.) and other school functions or activities (e.g. Open School Night) as assigned by Teacher, Supervisor or Principal.  Assists in maintaining appropriate documentation as specified according to program and regulatory compliance. Submits  Maintain appropriate and effective interpersonal relationships with team and department members, parents, other staff, supervisors, administrators, and outside agencies. Demonstrate:Open communication, flexibility and the ability to learn and utilize team building strategiesThe ability to self-evaluate, to utilize supervision and problem solveThe ability to both offer and accept assistance to/from others.Qualifications• Communication, Oral - Ability to communicate effectively with others using the spoken word."}