{"jobID": "2830927206", "jobLocation": "New_York_NY", "jobTitle": "Print Production Artist", "companyRating": null, "companyInfo": {"Website": "www.forcebrands.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About The PositionOverview Glossier is looking for a Print Production Artist as part of our Creative Operations and Production team. Our in-house team is responsible for a range of Creative - from Glossier's brand voice and messaging, to video and photo production, to product and packaging design for each of our products.  This role is responsible for maintaining brand consistency and integrity across all printed assets. Ideal candidates are enthusiastic about the production process, comfortable with following creative direction, self-motivated and can work both independently and collaboratively. They oversee the end-to-end production details of packaging mechanicals and various printed collateral pieces and are able to manage multiple projects and meet deadlines. This role reports to Senior Manager, Print Production. ResponsibilitiesBuild and release complex packaging mechanicals for a variety of primary and secondary componentsStarting from a single design spec, version out packaging mechanicals in several shades and languagesBuild and release mechanicals for a variety of printed collateral including postcards, posters, out of home, and direct mailProvide the final technical checkpoint before any print file is released to vendorEnsure that all photography and artwork assets are at optimal resolution and color spaceFollow and maintain brand identity standards across all touch pointsBasic image retouching and editing as neededColor proofing and printer calibration as neededQualifications5+ years experience as a production artist or graphic designer in a technically challenging fieldExperience with product packaging mechanicals is ideal but not requiredBFA in design, fine arts, printmaking, or similarA deep understanding and appreciation for typography and designAn exceptional eye for detail in regards to layout, color, hierarchy, and balanceAbility to manage multiple projects, prioritize own workload, and work independentlyExpert knowledge of Mac OS X and Adobe Illustrator, Photoshop, InDesign and Acrobat.Professional understanding of traditional and digital print processesProfessional understanding of color management and proofingAbout Gossier Glossier is a beauty company that lives in NYC, is sold on the internet, and promotes a skincare-first philosophy that celebrates beauty in real life. "}