{"jobID": "2827783490", "jobLocation": "Bellevue_WA", "jobTitle": "Business Intern - Late Summer", "companyRating": null, "companyInfo": {"Website": "www.echodyne.com", "Headquarters": "Bellevue, WA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Aerospace & Defense", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "THE BEST JOB YOU'VE EVER HAD. Echodyne's Metamaterials Electronically Scanning Array (MESA) is changing the way people think about commercial radar. Built on decades of research, Echodyne brings high-performance radar to commercial markets and applications constrained by Cost, Size, Weight or Power.  It's not often you get the chance to change industries by bringing truly breakthrough technology to market technology that not only disrupts existing markets, but creates vast new ones. It's hard and challenging work, but it's also exciting, energizing, satisfying, and rewarding! INNOVATE. DISRUPT. ENABLE. Drones, autonomous cars and trucks, heavy machines, even flying cars. To operate safely, these machines need sensors that work flawlessly across all environmental conditions. Echodyne has applied the physics of metamaterials to create a new category of sensor that provides the critical high-resolution, ground-truth data that autonomous machines and vehicles need to operate safely at any time and in any weather. Advanced control and processing software is a key part of Echodyne's intelligent radar solutions, and Echodyne's software team is setting the bar for high-reliability smart sensors for commercial applications.  Echodyne has developed a ground-breaking sensor for Level 4+ Autonomous Driving and is seeking an energetic&motivated; late-summer intern candidate to dig-in on the details of the Autonomous Vehicle market by performing independent research and collaborating with product management on quick-turn projects. The ideal candidate would be detail oriented self-motivator that is comfortable working in a fast-paced work environment.  Echodyne is an equal opportunity employer. We want to build a team with a diverse mix of people whose common denominator is talent. We consider all applicants for employment without regard to race, religion, color, national origin, sex, sexual orientation, gender identity, age, veteran status or disability. RESPONSIBILITIES:Support Echodyne's product team by researching the customer landscape and collating new information with existing research outputs.Provide direct input on the development of Echodyne's market database and customer tracking system.Act as a crossover between the Engineering Product Manager and the Business and Marketing sides of the company.Help create, iterate on, and codify business processes in a fast-paced technology startup environment.REQUIRED SKILLS/EXPERIENCE:Must demonstrate great attention to detail and the ability to manipulate and analyze data to solve problemsMust demonstrate strong organizational skills, ability to work on multiple projects simultaneously, and ability to communicate clearly with senior leadershipIntermediate-level Excel skills, including functions and chartingIntermediate-level Word and PowerPoint skillsQUALIFICATIONS:Sophomore or junior (or equivalent experience) majoring in business, marketing, economics, accounting, or finance. Echodyne's technology is export controlled by the U.S. Government and we must evaluate an applicant's eligibility to handle export controlled information or obtain required Government authorizations. Therefore, we will ask you as part of the application process to identify whether you are a U.S. Citizen or green card holder, or have asylum/refugee status in the U.S.  One of the 100 Best Companies to work for in Washington - two years in a row!Visit www.echodyne.com for more information."}