{"jobID": "2529865079", "jobLocation": "Boston_MA", "jobTitle": "Solutions Engineer (Sales)", "companyRating": null, "companyInfo": {"Website": "www.klaviyo.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About KlaviyoKlaviyo is using technology to reinvent email marketing from the ground up. For too long marketing has been pretty selfish. Companies blast everyone with the same email, not because they think thats what customers want, but because they dont have a choice. Klaviyo fundamentally changes the game. Our software ties together everything companies know about their customers, processes massive quantities of data in real-time, and uses it to drive a platform thats part CRM, part analytics engine, and 100% an email platform that gets results. Technology has come a long way in the last 15 years, but email hasnt really changed. Were here to fix that.Sales Engineering at KlaviyoSales Engineering is a critical part of the sales cycle but is NOT a typical give demos role. A true expert in the Klaviyo product, the primary mission of a Klaviyo Sales Engineer is to close deals with long term customers. The Sales Engineer is a go-to technical resource for the sales team, helping to make prospects successful through live assistance, behind the scenes support and education. A Sales Engineer relies on their technical expertise to effectively explain and apply technical concepts including APIs, the inner workings of the Klaviyo platform, and integrations with 3rd party and other client systems, to both prospects and teammates.You Will Effectively balance a range of core functions in support of constantly striving to help increase the output and efficiency of the sales teamBe the go-to internal technical resource for the entire go to market team, educating team members as well as prospects in service of providing a consistently positive Klaviyo experienceDevelop and maintain personal relationships with prospects during the sales process across many different prospects simultaneouslyUse your in-depth product knowledge and technical skills to suggest and potentially develop product solutions for prospectsAct with urgency and precision to give users best in class pre-sales support in troubleshooting issues as they ariseSolve problems manually first and then either automate future solutions and/or collaborate with Product and Engineering to proactively improve the Klaviyo product and customer experience over time You Have 3 plus years of sales engineering, technical support, or engineering experienceA naturally helpful mindset, great attention to detail, and high technical aptitudeExperience in a start-up or a start-up mentalityA scrappy, hands-on, get stuff done attitudeThe desire to be a cross-functional team playerExperience working with sales and a sharp business acumenStrong ability to effectively manage a range of simultaneous engagementsWorking knowledge of web languages preferred (HTML, Javascript, CSS)Ability to effectively convey customer requirements to Product Management, Support, and Engineering teamsExperience developing products or contributing to open source projects is a plusKlaviyo is a team of people who are crazy motivated by growth.Its what we help our customers do: grow their businesses by making it possible and easy for them to use their data to power better marketing.Its how we behave as individuals: were all deeply passionate about learning.Its how we manage our business: we have thousands of paying customers, were profitable, and were growing insanely fast.And its what our culture is all about. Working at Klaviyo means youll work on things you never imagined you would; youll grow in ways you didnt consider possible, and youll do the best work of your career with people who are just as motivated and talented as you are.Your curiosity has led you this far, so if this sounds like your ideal place to work, apply now!No phone calls or agency submissions, please."}