{"jobID": "2681621202", "jobLocation": "San_Francisco_CA", "jobTitle": "Client Service Coordinator", "companyRating": "4.8", "companyInfo": {"Website": "www.brightonjones.com", "Headquarters": "Seattle, WA", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Freestone Capital Management"}, "estimatedSalary": "55000", "jobDescription": "Are you hungry for more than just a career move? Wondering if it’s possible for work-life to be an extension of your own personal and professional passion? Brighton Jones’ unique and inclusive culture enables you to discover your potential and pursue your definition of a richer life.Brighton Jones, one of the country’s fastest growing wealth management firms, is looking for a talented Client Service Coordinator to join the team and provide immediate positive service impact for our clients.Your Role Attend prospect and client meetings and record notes, draft meeting summaries, and update internal records after meetingsPrepare various deliverables which directly support client retention and acquisition; prepare and process all documentation related to client onboarding, implementation and on-going maintenance including account applications, transfer documents and other forms as required Assist with calendaring functions with both our internal teams as well as external prospects, clients and centers of influence (COI); communicate directly with external parties to coordinate times and venues; allocate firm resources (room, technology required) appropriatelyAct as the primary liaison with our external business partners, including custodians; respond to daily custodial alerts or other notifications; troubleshoot, escalate as appropriate, and determine the appropriate action required; maintain the accuracy and integrity of all electronic record-keeping with these partiesGather, organize, and input client data into the CRM (Salesforce); manage data accuracy and integrity and keep records current; Provide support and respond to task requests from team members in a timely and accurate manner; follow up to ensure completionHandle cashiering and money movement requests including capital calls, distributions, journals, trades, and asset transfersCoordinate prospect and client “touch points” which reinforce the on-going sales and client retention process including anniversaries, Thank You notes, flowers and/or giftsWelcome clients and guests; supply beverages or order catering as neededEnsure the overall office environment is clean, inviting and well suppliedHandle incoming and outgoing mail and other delivery, manage incoming telephone calls, inventory/ supply ordering and general office maintenance and upkeepAssist with ad hoc projects around office needs, client support or team supportYour Experience  One to three years of client service experience in financial services industry required Undergraduate degree desired; Business, Economics, Finance, or Accounting preferred Self-motivated and takes pride in providing exceptional support to clients and the team Proficiency in Microsoft Office Suite products (Word, Excel, Windows) required; Salesforce experience a plus Expected to learn other position-related systems on the job Able to handle multiple tasks at once with the help of technology Excellent verbal and written communication skillsOur CultureAs a group of individuals that love what we do and enjoy who we work with, we know that the genuine relationships we build with each other positively affect our clients and their experience of working with us. We’re intentional in cultivating a culture that is inclusive, collaborative, and celebrates individual initiative.We are:Genuine - our unquestioned commitment to integrity is demonstrated in all of our personal and professional activitiesFocused – we work together to manage heavy workloads and time-sensitive projects - we thrive in a fast-paced environment that fosters continued growth and developmentApproachable – we enjoy interacting with each other and our clients, always projecting a professional, friendly and capable image in everything we doInvested – our commitment to our clients and each other means we are willing to maintain a flexible work schedule to address cyclical work periodsDriven - we possess good judgment, initiative and decision-making skills - able to anticipate problems, determine the appropriate level of response, and act accordinglyOur CompanyWe are a company that uses objectivity, creativity and passion to help our clients, colleagues and community members live richer lives. We eliminate the conflicts of interest in the financial industry by not selling products and sitting on the same side of the table as our clients.We are a nationally recognized wealth management firm with a strong talent focus. To the right individual, we offer a very competitive compensation and benefits package for our industry. If you meet the above requirements, please apply online. In your cover letter, please describe your professional passions and ultimate career objectives.In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility form upon hire.Brighton Jones provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Brighton Jones complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has offices. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.Brighton Jones expressly prohibits any form of workplace harassment based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status. Improper interference with the ability of Brighton Jones employees to perform their job duties may result in discipline up to and including discharge."}