{"jobID": "2707164316", "jobLocation": "Boston_MA", "jobTitle": "Data Scientist", "companyRating": "4.3", "companyInfo": {"Website": "www.pelotongroup.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " interRel Consulting, Huron Consulting Group, The Hackett Group"}, "estimatedSalary": "83000", "jobDescription": " Recognized on the Inc. 5000 fastest growing companies in the US, Peloton is one of the largest and fastest growing professional services firms specializing in Integrated Cloud Solutions for Enterprise Resource Planning, Enterprise Performance Management, and Big Data and Analytics. At the core of who we are – we believe that business analytics is changing the competitive landscape. Companies that are equipped with the right information, have the know-how, and the enabling technology to consistently leverage analytics will gain a competitive advantage.  Peloton is focused, committed and passionate to demonstrate progress, measure results, and implement practical solutions that produce transformational outcomes. Our company provides an opportunity to work with consulting professionals in a collaborative, stimulating, entrepreneurial environment. Where individuals look forward to arriving at work each day, are recognized and appreciated, and are allowed to move boundaries and take calculated risks for greater success. Our teams partner with business leaders to develop unique and innovative solutions that generate real business results. Beyond results, we also strive to make every engagement educational and fun. Yes – fun! We really like what we do and we let it show. Join the revolution and lead organizations on a journey to compete in the 21st century! We are actively seeking highly motivated, enthusiastic, and talented professionals that have a diverse background with cloud solutions in areas such as architecture, analysis, integration, data visualization and deployment strategies. You will have the opportunity to be involved in a variety of team-based projects throughout the project lifecycle such as requirements gathering, process re-engineering, solution design, implementation, and delivery. Peloton also places a high value on internal contributions through the support and development of the firm and its team members. Responsibilities:Analyze and document client information (data architectures, databases, and data flows) and translate business requirements into recommendations for appropriate solutions.Work with customer stakeholders to manage and deliver successful Relational, OLAP, and Big Data Solutions.Define and architect future state data architectures incorporating latest industry best practices.Design and develop ETL and Data Integration routinesDesign and Document Data Models for Analytic systems using Oracle Data Modeler or ErwinWork closely with Practice Leadership on best practices and lessons learned. Required Experience & Skills:Qualified candidates must have a BS or BA degree in Computer Science, Mathematics, Management Information Systems (MIS) or equivalentAt least 5 years of experience designing and developing data intensive analytic applications and databases.At least 3 years of experience designing and developing ETL and data integration processes (Informatica, ODI, REST APIs)At least 2 years of experience with Data Visualization and Business Intelligence applications (Oracle DVCS, BICS or Tableau preferred)Any prior experience with one or more Big Data Technologies (Cassandra, HBase, Redis, MongoDB, Hadoop, Spark).Familiarity with developing applications in both On-premise and Cloud environment (Oracle Database Cloud Service or AWS)Excellent presentation and communication skills, ability to translate business requirements into technical solutions.Excellent analytical and problem solving skills.Eagerness to work in a team oriented, collaborative environment.Ability to travel within the United States. Compensation:Competitive base salaryMedical and dental insurance401KFlexible SpendingTechnical and business skills trainingPerformance bonusPaid holidays and vacation daysPeloton Group is an Equal Opportunity Employer (EOE). Qualified applicants are considered for employment without regard to age, race, color, religion, sex, national origin, sexual orientation, disability, genetics, or veteran status."}