{"jobID": "2829325960", "jobLocation": "Mountain_View_CA", "jobTitle": "Data Analyst", "companyRating": "4.7", "companyInfo": {"Website": "www.study.com", "Headquarters": "Mountain View, CA", "Size": "51 to 200 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Udacity, Khan Academy, Coursera"}, "estimatedSalary": "76000", "jobDescription": "About Study.com We are a technology company on a mission to make education accessible. Study.com helps millions of students improve their grades, gain career skills and earn college credit. We offer self-paced, online video courses that cover every subject taught in middle school through junior college as well as a growing suite of corporate learning and professional education products. Weve built our platform from the ground up, leveraging data and technology to make the entire learning process simple and engaging for students.  We are a profitable, fast growing company looking to expand our team.  We began our journey in 2002 as a self-funded start-up and have grown every year since our inception. As a small, independent company, our employees have a direct impact on company direction and results.  We are located in the heart of downtown Mountain View, just a few steps from the Caltrain station. We only hire top talent, so those who pass our rigorous interview process will find themselves as part of one of the brightest and most innovative teams in Silicon Valley.  We have a culture of social responsibility. As we continue to generate profits, we give back by funding scholarship programs and helping charitable organizations provide open access to information and education throughout the poorest regions of the world.  Come join us on our mission and make a difference. About the Data Analyst Position As a technology leader, we have high-traffic websites and store massive amounts of data that we need to slice and dice every day. We are looking for a Data Analyst that will be part of a growing, world-class team supporting our account management and site optimization groups. The ideal candidate for the Data Analyst role will be a key resource for analytic best practices within Study.com and for analyzing and querying data in a fast-paced Internet business environment.  The Data Analyst must be passionate about digging into data and understanding the stories the data are telling. You will be equally passionate about helping others solve problems, gain insights, and make decisions using data.  Responsibilities: Ownership (with your team) of all data used for analytics, including millions of events coming through a Kafka queue each day, a 15 TB relational data warehouse, and integration with Google BigQuery.Master the structure of Study.coms data and the metrics that drive the businessPerform ad hoc analyses and data extraction requestsExtract insights from data to improve the efficiency of our sites and our advertisement systemActively build processes and tools to make data more accessibleDrive the monitoring, analysis, and improvement of website and campaign performanceWork in a cross-functional team to implement data-driven plans designed to maximize ROITeach others how to use data effectively Requirements: A passion for learning and a willingness to pick up whatever you need to to get the job done4+ years' experience in a data analyst role, experience with web analytics is a plusSolid MySQL/SQL experience or other related databasesSolid experience in Excel for data analysis and visualizationStrong analytical skills and ability to draw conclusions based on dataComfortable working in a fast-paced, dynamic environment while juggling multiple projectsBS in Mathematics, Statistics, Computer Science, Operations Research, or similar fieldsGood interpersonal communication and presentation skillsSelf-motivated, detail-oriented and passionate Preferred Qualifications: Reporting and Business Intelligence experience (Tableau, QlikView, Microstrategy, etc)Proficient in using statistical software (R, MATLAB, SAS, etc.)Hands-on experience with advanced statistical concepts, such as cluster analysis, singular value decomposition, stochastic gradient descent, and Bayesian methodsExperience using an ETL tool (Pentaho, Talend, SSIS, etc.) on large datasets (terabytes in size)Knowledge of web analytics software and best practicesExcellent programming knowledge in a scripting language such as Groovy, Python, Perl, or in a compiled language such as Java or C++Higher degrees such as Masters or PhD Why work for Study.com? Help make education accessible to people who need itEnjoy a fun, casual and collaborative working environmentJoin a profitable and financially stable companyHelp guide company decisions and directionSee results of your work in days, not yearsHave your work impact 30+ million web visitors each monthGrow professionally with our training and skill development programsWork with other talented and passionate team members Benefits: Competitive compensation (including salary and bonus plan)401(k) retirement plan with employer matching20 days of flexible paid time off annually (increases to 30 days over 5 years)Additional 10 paid holidays annuallyFlexible work schedulesComprehensive medical, dental and vision plans (we pay 100% of premiums)Fully subsidized Caltrain passTuition reimbursement and gift matching programsStocked kitchen and beverages providedCompany sponsored gym membershipsCompany sponsored happy hours to celebrate accomplishments Study.com provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, veteran or disability status. In addition to federal law requirements, Study.com complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. Additionally, qualified applicants with arrest and conviction records will be considered for the position in accordance with applicable state and local laws."}