{"jobID": "2632505207", "jobLocation": "Mountain_View_CA", "jobTitle": "Global Key Accounts Application Engineer (Robotics) Mountain View, CA", "companyRating": "3.5", "companyInfo": {"Website": "us.mitsubishielectric.com/fa/en", "Headquarters": "Vernon Hills, IL", "Size": "201 to 500 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Rockwell Automation, Schneider Electric, Siemens"}, "estimatedSalary": "82000", "jobDescription": " Mitsubishi Electric Automation, an industry leader in factory automation products and solutions is seeking a Global Key Accounts Application Engineer (Robotics). Join a team of smart, dedicated, technical experts who are not only the best in their fields, but are committed to a tradition of technical leadership and innovation.  The Global Key Accounts Application Engineer (Robotics) will provide engineering application development, pre-and post-sales large and/or strategic project support for GKAM for Industrial Automation Application. Test new products, and maintain direct contact with product development. Support EMS GKAM and develop and/or deliver custom technical training to customers on all Mitsubishi products. Position Duties and ResponsibilitiesProvide pre and post sales technical support to key and strategic customers on Industrial Automation Projects, – on-site, via phone, email or via SI/OEM, as appropriate.Oversee all engineering requirements and progress for assigned projectsMaintain current knowledge of new products and applications, through self-study, hands-on testing of demo units, and seminar attendance. Assist marketing with technical documentation reviews, suggestions, etc.Evaluate, support, educate and provide technical leadership for Systems Integrators.Provide advanced and custom technical training to customers, and MEAU personnel on Mitsubishi products. Deliver presentations to external organizations or entities on applications, as requested.Deliver presentations to external organi­zations or entities.Document support case data utilizing CRM.Perform other duties as assigned.Supervisory / Management ResponsibilitiesNoneTravel Requirements25-50% Travel for training and application support within North America and Asia.Ability to develop and maintain complex applications, up-to-date technical knowledge, including the latest MEAU products.Possess technical writing skills.Possess customer service and phone skills.Possess ability to develop, write and perform technical training for groups.Possess organization skills, i.e. for documents, demos, and work area, and time management.Possess project management skills.Ability to operate effectively as part of a team.Professional, patient, positive, confident communication style and attitude.Ability to write and perform technical product and solution training for groups.Organization skills, i.e. for documents, demos, work area and time management.Beneficial Skills and ExperienceFamiliarity with PLCs, VFDs, HMIs, Industrial network, process control, IEC 1131 programming standards, and competitive product knowledge is preferred.Smart Device Industry applications expertise is a definitely plus.Chinese Language is plus.BS in Electrical Engineering or equivalent experience.2-5 years of application experience with industrial automation products and customers.Willing to consider a recent graduate"}