{"jobID": "2631254491", "jobLocation": "New_York_NY", "jobTitle": "Audit Senior Associate - Real Estate", "companyRating": null, "companyInfo": {"Website": "www.rsmus.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1926", "Type": " Private Practice / Firm", "Industry": " Accounting & Legal", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Real Estate-Senior Associate RSM is looking for a motivated Audit Senior Associate to join our National Real Estate Practice within our New Yorkoffice. Our National Real Estate Practice serves public and private clients including real estate private equity funds, advisors, institutional investors and joint ventures, hotel and hospitality, developers, and owners/operators of commercial, retail and multifamily real estate. Our National Real Estate Practice provides for strong opportunities to work on projects within the New York office as well as offices throughout the Firm. Being a part of the National Real Estate Practice will allow you to obtain exposure to the various lines of business within the industry including but not limited to tax compliance, valuation, and lease consulting and related services. Responsibilities:Provide timely, high quality client service that meets or exceeds client expectations including coordinating the auditing of all required financial statements, related disclosures, and other client deliverablesCollaborate with the Engagement Manager on approach and execute on the audit plan to mitigate riskUnderstand and utilize RSMs Audit MethodologyDevelop an understanding of the client's business, and become a real estate industry specialist to understand client specific needsUnderstand skillsets and capabilities of Associates on projectsTrain and supervise Audit Associates on engagement teams and function as an in-charge facilitating field work by monitoring and reporting regarding productivity and adherence to work plan schedules on each assignmentDevelop and communicate work plan schedules on each project to Engagement Manager and engagement personnelReview work product of Associates and articulate coaching notes throughout the processDevelop and maintain open items lists and tracking of project statusManage time appropriately across multiple projectsProvide insightful feedback on financial statements, and prepare other related client deliverables such as management letters and end-of-audit governance communicationsInteract with clients in a way they would understand to help ensure the information flow from the client to the audit team is efficientIdentify and communicate accounting and auditing matters to Managers and PartnersKeep abreast of developments in the industry by reading trade publications and other relevant periodicalsAnticipate and address client concerns and escalate issues as they ariseIdentify performance improvement opportunitiesRecognize and inform management of opportunities to increase level and types of services to clientsEnsure professional development through ongoing educationWillingness to travel 25% of the year, depending on your clientsRequired Qualifications:BS/BA Degree in Accounting or equivalent degree2 years of current or recent experience in public accounting environmentUnderstanding of audit services with knowledge of FASB regulations, GAAS, and GAAPCPA Certification or demonstrated progress toward obtaining CPA certification, including courseworkPreferred Qualifications:Experience auditing real estate or related organizationsDemonstrated ability to in-charge on an engagement You want your next step to be the right one. You've worked hard to get where you are today. And now you're ready to use your unique skills, talents and personality to achieve great things. RSM is a place where you are valued as an individual, mentored as a future leader, and recognized for your accomplishments and potential. Working directly with clients, key decision makers and business owners across various industries and geographies, you'll move quickly along the learning curve and our clients will benefit from your fresh perspective.  Experience RSM US. Experience the power of being understood.  RSM is an equal opportunity/affirmative action employer. Minorities/Females/Disabled/Veterans. "}