{"jobID": "2750984702", "jobLocation": "San_Jose_CA", "jobTitle": "Technical Support Engineer", "companyRating": "3.6", "companyInfo": {"Website": "www.247.ai", "Headquarters": "San Jose, CA", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Nuance, RightNow Technologies"}, "estimatedSalary": "84000", "jobDescription": "Job Code: 15341Job Title: NOC EngineerLocation: San Jose CA The Cloud Infrastructure organization designs, implements, and maintains the global infrastructure and environments used to build, test, and run [24]7’s Omni-channel customer engagement and big data services. Collaborating with Sales, Product Management, and Engineering, we provide highly-available, scalable, cloud-based infrastructure supporting dozens of corporations in the telecom, financial, travel, and retail industries. Within the Cloud infrastructure organization, the Network Operations Center (NOC) is responsible for incident and problem management along with change and release management, to maintain the stability and continuous availability of our services.As a member of our team, you will share in the challenge and satisfaction of building and maintaining a world-class SaaS/PaaS cloud while gaining experience with a myriad of cutting-edge technologies.As a member you will be empowered to use your experience and expertise to deliver cross-functional operational excellence.ResponsibilitiesPerform Incident Management and Change ManagementEnsure all NOC and Corporate operating procedures are maintained and executedAnalyze alarms and dashboards to identify problem areas, report incidents, troubleshoot, and escalate as requiredPerform ticket review and updatesManage, coordinate, and document all network maintenances / eventsMaintain communication with Customers, Account Managers, Development Operations and Engineering teamsRequirements 5+ years experience working in a round the clock production operation environment5+ years of experience and knowledge in Unix platform system administrationDemonstrated proficiency in troubleshooting, analyzing and problem solvingTechnical expertise with some combination of TCP/IP networking and TelephonyWorking experience with networking appliances such as firewalls, load balancers, and proxy/cache serversAssociate degree or equivalent technical trainingFast learner and ability to quickly adapt to new scenarioStrong process and documentation backgroundStrong written and verbal communication skillsAbility to maintain composure with a team in a fast paced, high-stress, crisis environmentAdditional Experience (preferred But No Required)Windows Server production experience (PowerShell, Special Administration Console)Familiarity with storage systems (NAS, SAN)Relational database experience (MySQL)Ability to write and debug shell, Perl, and PHP scriptsExperience in Voice Telecommunications technology, VOIP platform, and familiarity with SIP protocolExperience working in ITIL environmentShould be proactive and willing to take on responsibility to learn new products and procedures.Must be a team playerABOUT [24]7: [24]7 is redefining the way companies interact with consumers. Using artificial intelligence and machine learning to understand consumer intent, [24]7’s technology helps companies create a personalized, predictive and effortless customer experience across all channels. The world’s largest and most recognizable brands are using intent-driven engagement from [24]7 to assist several hundred million visitors annually, through more than 1.5 billion conversations, most of which are automated. The result is an order of magnitude improvement in digital adoption, customer satisfaction, and revenue growth.  Learn more at www.247.ai  #LI-PS1"}