{"jobID": "2814117116", "jobLocation": "San_Jose_CA", "jobTitle": "Senior Clinical Director - OBM in Action", "companyRating": "4.0", "companyInfo": {"Website": "www.juvobh.com", "Headquarters": "Oakland, CA", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " STE CONSULTANTS, Trumpet Behavioral Health, Autism Spectrum Therapies"}, "estimatedSalary": "82000", "jobDescription": "Learn more about how our ABA agency is applying OBM A team of our smart clinicians recently presented at CalABA on how were putting OBM in action. It is so exhilarating to see ABA at work, not only for our clients and their families, but also for our organization as a whole At Juvo, we use these principles to track four performance areas: Quality of Services, Relationships with Coworkers, Relationships with External Customers, and Sustainability. How you can join us... Were looking for a Senior Clinical Director for our San Jose, CA region to help us use these key performance indicators to manage a team of awesome clinicians. As Senior Clinical Director (SCD) you would oversee and supervise the clinical, administrative, and professional components of Juvos programs in your region. Minimum Qualifications (Knowledge, Skills, and Abilities):Masters or doctoral degree in special education, applied behavior analysis, psychology, or a related field.Board Certified Behavior Analyst (BCBA) for a minimum of two years with a current certification in good standing with the regulatory board.Certified by the Behavior Analysis Certification Board to provide supervision to those pursuing certification.Five years of related professional experience designing and providing programs based on ABA to individuals with developmental disabilities.Three or more years experience in a supervisory role.Knowledge of a variety of evidenced-based methodologies used for behavioral programs in home, school, and community settings.Essential Duties and Responsibilities:Manage caseloads for the clinicians in the region. Ensure that caseloads allow clinicians to meet their billable requirements in addition to being feasible to complete (e.g., minimal drive time between clients, a balance of daytime and after school hours).Report capacity for referrals on a weekly basis.Monitor clinicians monthly contract fulfillment.Scorecards include goals in Juvos four Key Performance Indicators: Quality of Services, Relationships with External Customers, Internal Relationships, and Sustainability. Monitor clinicians scorecards on an ongoing basis and provide feedback as necessary. Monitor your own performance towards meeting your scorecard goals. Report any concerns with meeting goals to your supervisor.Conduct 1:1 supervision meetings with clinicians in the region. Complete supervision notes at each meeting.Conduct field overlaps with clinicians in the region.Review assessment, progress, and discharge reports written by clinicians for clinical content, writing style, formatting, and funding source requirements before reports are submitted to the funding source. Score reports using the report writing checklist.Interview clinicians following Juvo interview procedures and assist with hiring decisions.Onboard new clinicians.Assist with leading staff meeting, group supervision meetings, and CEU events.Conduct performance evaluations for clinicians in the region.Help foster a collaborative and supportive sense of community among the clinicians in your region.Monitor the regional budget and gross margin goals.Provide BCBA supervision to Juvo employees. Oversee the BCBA supervision thats conducted in the region.Maintain an assigned caseload and complete the responsibilities of a Clinical Director associated with that caseload (caseload size will be determined by your direct supervisor).Overlap and train Program Supervisors and Behavior Therapists in all client specific job duties.Provide initial and ongoing performance feedback to Program Supervisors and Behavior Therapists.Conduct parent training when needed."}