{"jobID": "2796591011", "jobLocation": "Pleasanton_CA", "jobTitle": "Senior Claims Examiner", "companyRating": "3.7", "companyInfo": {"Website": "www.keenan.com", "Headquarters": "Torrance, CA", "Size": "501 to 1000 employees", "Founded": " 1972", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "100000", "jobDescription": " Keenan & Associates is a successful insurance brokerage and consulting firm meeting the insurance needs of hospitals, public entities and California school districts. Keenan specializes in providing consulting services for employee benefits, workers' compensation, loss control services, Keenan Financial Services, and property & liability to school districts and hospitals throughout California. We have seen continuous progress and expansion, making us the 18th largest consulting firm in the United States. This growth positions us to continue to lead the industry into the 21st century.  We currently have an exciting, career opportunity for a Senior Claims Examiner, located in our Pleasanton office. The Senior Claims Examiner will be responsible for administration and management of work comp claims.  The successful candidate will be tasked with handling complex legal issues, litigation prevention and control, negotiation of settlements, lien resolutions and cost containment. Description of duties & responsibilities: Identify, prevent and mitigate potential penalties Report excess files to the Reinsurance Manager in a timely manner Report SIU/Fraud and identify and pursue subrogation Update reserves upon review of file and accept delayed claims within 90 days Request settlement authorization/notification Prepare legal referrals, provide direction to and monitor defense attorney Maintain client/claimant satisfaction Oversee new set-ups, reserves and instruction sheets Negotiate outstanding liens Make 3-point contact on delay and/or complicated cases Other duties assigned Essential Skills and Knowledge: Candidates must have five years of claims examiner experience and a Self-Insurance Certificate, or the ability to pass Self-Insurance Test. WCCP a plus. Effective in oral and written communication. Will have to work with all levels of Client, Vendor, and Keenan employees.  High school degree or equivalent work experience. Special Skills Required: · IEA Basic class required  Software: Microsoft Outlook, Word and Excel Reasoning Ability: Ability to solve practical problems and to interpret a variety of instructions furnished in written, oral, diagram, or schedule form.  Keenan provides a competitive compensation package. We encourage teamwork and employee initiative - people working together is what makes Keenan a success. We invite you to share in the commitment of preserving our warm tradition, reputation and dedication to our clients. After all…What you do makes a difference!  Please submit your resume cstory@keenan.com . For more information, visit our website at www.keenan.com  Keenan is an Equal Opportunity/Affirmative Action Employer and supports Workplace Diversity."}