{"jobID": "2553956753", "jobLocation": "San_Francisco_CA", "jobTitle": "Product Manager - Data Infrastructure", "companyRating": "3.3", "companyInfo": {"Website": "www.yelp.com", "Headquarters": "San Francisco, CA", "Size": "5001 to 10000 employees", "Founded": " 2004", "Type": " Company - Public (YELP) ", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Google"}, "estimatedSalary": "153000", "jobDescription": "As our primary Product Manager focusing on critical company-wide data needs, you will help set the tone for how Yelp solves technically and organizationally challenging but highly impactful data aggregation and curation needs. You will build and evangelize the sources of truth for decision makers, data scientists, machine learning teams, and others throughout the company. You will work closely with data-driven partners throughout Yelp to ensure we always have access to the right information, at the right time, so as to make the best decision we can. Success in your role will directly empower your peers in the company to deliver a more personalized experience to our users, maximize revenue, empower analysts, and gain deeper insights into our product and users.Yelp is a highly data-driven company, with large engineering investments across many teams aiming to ensure our rapid access to high quality data. You will have a unique opportunity to drive this work and ensure we’re focused on solving the most important problems for the maximum benefit. This will be a dynamic role, with high demands on multi-tasking, communication skills, and technical knowledge. For the right candidate, it will be an exciting and deeply rewarding experience.Yelp’s products are used by millions of people every day. At Yelp you’ll have an opportunity to make a real impact on a product you actually use. The team you’ll work with is small, passionate, dedicated, and fun. The culture at Yelp is a unique, combining the best parts of being at a startup with the stability and resources of a successful public company. You’ll have full ownership of the product you’re working on and will be able make fast decisions in a highly collaborative environment.What You Will Do: Work with our Data Lake team to transform massive amounts of disparate facts into useful curated datasets and machine learning signals.Work with multiple engineering teams to build meaningful and unified data products, to serve as the basis for all analysis at the company.Coordinate and communicate data needs amongst stakeholders throughout the company, including product, engineering, machine learning, data science, business analyst, and marketing teams.Internalize how Yelp describes the interactions of millions of users throughout our data, and help strategize on how to best leverage that information to solve our most urgent business problems.Become an expert on data loading, transport, access, and storage systems.We Are Looking For:"}