{"jobID": "2826812933", "jobLocation": "Livermore_CA", "jobTitle": "Jr Sales Representative", "companyRating": null, "companyInfo": {"Website": "www.aeroprecision.com", "Headquarters": "Livermore, CA", "Size": "51 to 200 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Join a strong and growing company where coming to work every day is both rewarding and fun. Aero Precision, a worldwide stocking distributor of OEM aircraft part is expanding. We are a customer-focused organization—we listen, we learn, we respect one another, encourage personal contribution, focus on partnering with people and above all, make it easy for our customers to do business with us. Employees throughout the organization are empowered to make decisions—everyone here has a voice and shares in the responsibility.SummaryAssists Sales Representatives, Managers, Directors, and the Sales Group with all sales projects and purchasing as well as marketing activities for territory. Special projects or territory focus may be assigned.Essential Duties and Responsibilities include the following. Other duties may be assigned. Assists in coordinating all RFQ, Tender and Quotation activities for the territory(ies).Prepares bids for territory(ies).Assists in coordinating sales orders and related activities to sales order flow process.Assists in coordinating all purchase activity and coordinates with Vendor Relations Agent to facilitate expediting procedure.Assists in preparing all necessary reports for regular management meetings. Assists in all interfaces with OEM Business Managers regarding day to day activities as required. Defines and administers the process of obtaining territory(ies)' RFQ through to award win in support of team.Investigates, coordinates and resolves customer problems with deliveries and discrepancies with purchase orders and in support of the Vendor Relations Agent. Assists in obtaining all credit reference information for new customers as applicable among the sales team.Assists in proposal writing and presentations as required.Enters new customer data and other sales data for current customers into customer database.Enters new vendor data and other pertinent vendor data into vendor database.Produces regularly scheduled reports from computer databases.Trains other team members in all aspects of ERP system as related to performing all of the above requirements.Understand and perform functions in accordance with AS9120:2009 and ISO9001:2008 StandardsEducation and ExperienceHigh School Diploma or equivalentCollege education or 2+ years of relevant experience preferredLanguage SkillsFluent in EnglishForeign Language skills desirableAbility to read, analyze, and interpret general business information. Ability to write reports, business correspondence, and procedure manuals. Ability to effectively present information and respond to questions from groups of managers. We offer unprecedented benefits to our employees beyond compensation including an excellent career path and flexibility. As part of benefits package, we offer one of the best available benefit programs for small businesses, including healthcare plan, PTO, 401k), long-term and short term disability, holidays and life insurance "}