{"jobID": "2689560670", "jobLocation": "Santa_Clara_CA", "jobTitle": "Financial Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.centrify.com", "Headquarters": "Santa Clara, CA", "Size": "201 to 500 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "77000", "jobDescription": "Do you have a passion for quality and innovation? If so, you'll be right at home at Centrify. We are always looking for talented, motivated individuals who would like to help us design, build, sell and support the next generation of integrated software solutions as we redefine security from a legacy static perimeter-based approach to protecting millions of scattered connections in a boundaryless hybrid enterprise!  We are looking for a high energy Financial Analyst with two years’ experience out of University. The individual has a demonstrated record of excelling at researching, quantifying and communicating actionable insights from Salesforce and Concur data. This hands-on, individual contributor will assist with the Renewals/Retention processes, report and highlight trends and outliers in T&E;, as well as hold key responsibilities for the integrity of the Bookings database. The position reports to the Director of Financial Planning and dotted line to the VP of Sales Operations. Responsibilities: The Financial Analyst will split his/her time working with the Financial Planning team 50% and Sales Operations team 50%. Financial Planning Responsibilities (@50%)Assist with calculation and timeliness of renewal and retention calculations.Bookings Database - research summary customer names, industries and customer tiers while the quarter is underway. Accelerate the timely publication of Bookings Database using advanced Excel functionality, as well as Sequel and Tableau.Update Forecast using Host Analytics planning software.Create and publish quarterly Travel and Expense database tracking spend and trends by individual and department via a detailed pull from Concur. The objectives are transparency and efficiency of spend.Publish Travel and Expense highlights by outlier spend in hotels, meals, entertainment. As necessary create/publish list of employees with outlier spending to foster compliance with company policies.Sales Operations Responsibilities (@50%)Monitor daily chores and complete all related activities, including creation of future renewal opportunities.Update closed won orders with additional information as required.Update new contracts, as well as current and new environments.Ensure customers have appropriate access to support portal, per contract terms.Update account detail for current status and support renewals team in maintaining accurate account history.Collaborate with Financial Planning team to reduce manual effort and speed calculation of retention.Complete projects as assigned by Sales Operations Management.Desired Skills & Experience:Undergraduate degree in Finance with courses in accounting, financial analysis and data analysis.Understanding of the inter-relationships of financial statements (balance sheet, cash flow and P&L;).High level of competency in Microsoft Excel, including Vlookups, Hlookups and pivot tables.Ability to manipulate large data sets. Knowledge of practical applications in Sequel and Tableau a big plus.Prior practical job experience as an intern and with Salesforce a strong plus.Must possess excellent analytical skills, be detailed oriented and derive critical insights independently. Must have strong written and verbal communication skills. Centrify offers competitive salaries and an excellent benefits package, including medical, dental, vision and life insurance. We also provide an Employee Assistance Program, paid holidays, paid time off, flexible spending account, stock options, 401k, and more. This is just part of what made Centrify one of Glassdoor's \\\"Best Places to Work in 2016\\\"!  Centrify Corporation is an Equal Opportunity Employer, committed to providing a diversified work environment, free of discrimination and harassment.  For more information regarding our company, or to search for all available job openings, please visit our website at www.centrify.com.  Centrify does not accept unsolicited resumes from individual recruiters or third party recruiting agencies in response to job postings. No fee will be paid to third parties who submit unsolicited candidates directly to our hiring managers."}