{"jobID": "2768375334", "jobLocation": "New_York_NY", "jobTitle": "Global Macro Quant Developer", "companyRating": null, "companyInfo": {"Website": "www.worldquant.com", "Headquarters": "Old Greenwich, CT", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "WorldQuant develops and deploys systematic financial strategies across a variety of asset classes and global markets. We seek to produce high-quality trading signals (Alphas) through our proprietary research platform to employ trading strategies focused on exploiting market inefficiencies. Our teams work collaboratively to drive the production of Alphas and financial strategies the foundation of a sustainable, global trading platform.WorldQuants success is built on a culture that pairs academic sensibility with accountability for results. Employees are encouraged to think openly about problems, balancing intellectualism and practicality. Great ideas come from anyone, anywhere. Employees are encouraged to challenge conventional thinking and possess a mindset of continuous improvement. Thats a key ingredient in remaining a leader in any industry.Our goal is to hire the best and the brightest engineers. We value intellectual horsepower first and foremost, and people who demonstrate an exceptional talent. There is no roadmap to future success, so we need people who can help us create it. Our collective intelligence will drive us there.The Role: Technologists at WorldQuant research, design, code, test and deploy projects while working collaboratively with researchers and portfolio managers. Our environment is relaxed yet intellectually intense. Our teams are lean and agile, which means rapid prototyping of products with immediate user feedback. We seek people who think in code, aspire to solve undiscovered computer science challenges and are motivated by being around like-minded people. In fact, of the 600 employees globally, approximately 500 of them code on a daily basis.WorldQuant is seeking an exceptional individual to join the firm as a Quantitative Developer and help drive the build out of a new quant macro business. While prior finance experience is not required, a successful candidate must possess a strong interest in learning about finance and global markets. Quant Developers will design, code and implement proprietary systems and tools to drive our quant macro business. You will collaborate with researchers and PMs to gather, analyze and spec out requirements, develop/test code, and manage product deliverables. A successful candidate will help build the software that will serve as the foundation of our Quant Macro business and that will be used by Portfolio Managers to construct portfolios and analyze trading.Its Impact: Quant Macro is a new business line being built from scratch and aspires to be a strong contributor to WorldQuants continued growth and success. WorldQuant continues to diversify our unique investment platform, which is a leader amongst its peers. We desire people who are driven by new challenges and will help us in our relentless pursuit to succeed.What Youll Bring:B.S./M.S./Ph.D. from a leading university in a Computer Science, Engineering, or related disciplineGraduated at the top of your program, with excellent problem solving abilities, insight, and judgment as well as a strong attention to detailExpert-level knowledge of algorithms, design patterns, OOP, threading, multiprocessing, etcDemonstrated ability to program in a scientific computing environment, preferably in python/Numpy and C++, although other leading languages are OK.Working understanding of basic probability, statistical inference, software solvers, mathematical optimizationStrong communication skills; ability to express complex concepts in simple terms"}