{"jobID": "2764782790", "jobLocation": "Andover_MA", "jobTitle": "2018 System Test (SVTAD) Summer Intern (MA) - Tech Student", "companyRating": null, "companyInfo": {"Website": "www.raytheon.com", "Headquarters": "Waltham, MA", "Size": "10000+ employees", "Founded": " 1922", "Type": " Company - Public (RTN) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Systems Validation, Test, and Analysis Directorate (SVTAD) is the central focus for all integration, verification, validation and test activities within Integrated Defense Systems (IDS). The more than 700 employees of SVTAD provide their expertise to ensure customer success through the design, development and execution of innovative and comprehensive test, verification and validation strategies, processes, tools and techniques. SVTAD employees are involved in all aspects of test including: design-for-test, integration, subsystem, and component level testing through Customer sell-off of IDS' most sophisticated systems and technologies. SVTAD Systems Engineering Intern What is Systems Engineering? What does a Systems Engineer do? Systems Engineering contributes to programs throughout the entire product development lifecycle, from inception through development, sell-off, deployment, and operations and maintenance in the field.  Systems Engineers work within an interdisciplinary process that ensures that the customer's needs are satisfied throughout a system's entire life cycle. This process is comprised of the following seven tasks: State the problem. Stating the problem is the most important systems engineering task. It entails identifying customers, understanding customer needs, establishing the need for change, discovering requirements, and defining system functions.Investigate alternatives. Alternatives are investigated and evaluated based on performance, cost, and risk.Model the system. Running models clarifies requirements, reveals bottlenecks and fragmented activities, reduces cost and exposes duplication of efforts.Integrate. Integration means designing interfaces and bringing system elements together so they work as a whole. This requires extensive communication and coordination.Launch the system. Launching the system means running the system and producing outputs to verify that the system does what it was intended to do.Assess performance. Performance is assessed using figures of merit, technical performance measures, and metrics -- measurement is the key. If you cannot measure it, you cannot control it. If you cannot control it, you cannot improve it.Re-evaluation. Re-evaluation should be a continual and iterative process with many parallel loops.Job Description Opportunities for SVTAD Interns require individuals to use engineering, math, and teamwork skills to perform various engineering activities, such as requirements development, system test and validation planning and execution, modeling and simulation, data analysis, flight test analysis, and overall systems integration. Successful Systems and Test Engineers are curious about the way things work and interact. Interns assist in the integration and testing for the complex defense systems of Raytheon's IDS business product line. Testing includes hardware and software.  Duties could include developing test or integration strategies and procedures, debugging and testing functions and interfaces, conducting performance studies and data analysis on air defense, radar, ship or Homeland Defense systems and/or their subsystems. Writing data analysis tools is also part of our work along with supporting sophisticated state-of-the-art integration and test facilities. Interns work under the guidance of one or more experienced engineers. Some assignments offer the opportunity for short term travel.  If you are on your way to obtaining a BS, or MS in Electrical Engineering, Computer Engineering, Systems Engineering, Aerospace Engineering, Mechanical Engineering, or Computer Science, here is your opportunity to pursue an exciting career with Raytheon's SVTAD organization. Assignments are located in Massachusetts (Andover, Marlborough, Tewksbury, Woburn). U.S. Citizenship status is required as this position needs an active U.S Security Clearance as of day one of employment. Basic Qualifications:"}