{"jobID": "2819680097", "jobLocation": "Boston_MA", "jobTitle": "Technical Business Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.unitedhealthgroup.com", "Headquarters": "Minnetonka, MN", "Size": "10000+ employees", "Founded": " 1977", "Type": " Company - Public (UNH) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Aetna, Humana, WellPoint"}, "estimatedSalary": "53000", "jobDescription": "We're enhancing our health management products and creating new, innovative solutions for the market. Due to the increasing demand for quality measurement initiatives, we need a detail-oriented, highly motivated analyst with quality measurement expertise to add to our growing analyst group. This position will afford you the opportunity to work as part of a team to create and enhance products used for provider quality measurement. If you want to make a difference in key national healthcare initiatives, work with other expert quality measurement analysts, and enhance products that affect over 100 million people, please apply. We offer outstanding benefits and many opportunities to learn, grow and contribute! Primary Responsibilities:Giving database and data analysis support to team of business analystsInterpreting specifications to create and modify complex measure logicWorking within a team of other quality business analysts, product owners technical engineers, and quality control analysts to ensure end-to-end production of accurate rules engine logicCreating methodology solutions based on healthcare dataParticipating in product testing, validation and documentation activitiesRequired Qualifications:High School/GED1+ year of administrative claims data and medical coding systems experience (i.e. CPT, HCPCS, ICD-9, NDC)5+ years of data analysis experience including solid expertise with SQL( Designing/Modifying Tables) and Access1+ year of experience with relational databasesIntermediate level of experience in MS Excel and MS WordPreferred Qualifications:Bachelors degreeSome quality measurement experience preferred - preference given to candidates with implementation experience (i.e. healthcare organization, state / federal reporting)Exposure / Experience in product testing, validation and documentation activitiesStrong attention to detail and accuracyExcellent written / oral communication and listening skillsExcellent evaluative, analytical and problem-solving skillsAbility to understand complex requirements and derive solutionsCareers with Optum. Here's the idea. We built an entire organization around one giant objective; make health care work better for everyone. So when it comes to how we use the world's large accumulation of health-related information, or guide health and lifestyle choices or manage pharmacy benefits for millions, our first goal is to leap beyond the status quo and uncover new ways to serve. Optum, part of the UnitedHealth Group family of businesses, brings together some of the greatest minds and most advanced ideas on where health care has to go in order to reach its fullest potential. For you, that means working on high performance teams against sophisticated challenges that matter. Optum, incredible ideas in one incredible company and a singular opportunity to do your life's best work.(sm) Diversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law.  UnitedHealth Group is a drug-free workplace. Candidates are required to pass a drug test before beginning employment.  Keywords: business analyst, data analysis, product testing, Minnetonka, MN, Minnesota, Boston, MA, Massachusetts, Raleigh, NC, North Carolina"}