{"jobID": "2815450301", "jobLocation": "San_Jose_CA", "jobTitle": "Experienced Financial Advisor", "companyRating": null, "companyInfo": {"Website": "www.pacific.massmutual.com", "Headquarters": "Walnut Creek, CA", "Size": "201 to 500 employees", "Founded": " 1851", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable", "Competitors": " New York Life, Northwestern Mutual, Lincoln Financial Group"}, "estimatedSalary": null, "jobDescription": "Career Opportunities for Experienced Financial Advisors.Have you already established your career as a top advisor, and built a business that has delivered personal satisfaction and financial success? MassMutual Pacific is committed to building a strong, mutually beneficial relationship with you. We treat you with respect and value your ideas and contributions. Advisors are part of an open, entrepreneurial system in which you’re free to help your clients choose products and services that fit their financial needs. We provide innovative products, tools and support so you can do your job well. We are committed to a thriving Career Agency System. Our keen focus on our advisor’s success has helped us grow and build an advisor-centered culture that is the envy of the industry. When you affiliate with a MassMutual agency, you’ll work with a mutual company that has been around for more than 160 years and has a tradition of financial strength and stability. You will be welcomed into an elite group of advisors who share your passion for excellence. Drawing on their expertise and MassMutual’s support, you’ll have what you need to land bigger, more complex and more profitable cases Why affiliate with a MassMutual agency? As an established advisor, you have many opportunities to maximize your impact and your income through sales management, collaborative practices, agency partnerships and corporate advisory committees, and a range of other paths. We have an advisor-centered cultureEntrepreneurship drives the mindset and paceBusiness growth and success are the objects of constant and intense focusCommunication and cooperation are our watchwordsAdditional incentives: eligibility drives a competitive bonus program that rivals the best in the industry.You have what your client’s need at your fingertips.We deliver services that make a difference.Our very own MML Investors Services, one of the nation’s largest broker-dealers.Easing the transition: It takes planning and seamless execution to move to a new broker-dealer, which is why MML Investors Services and MassMutual Pacific are committed to helping you: Examine your current product mix and offeringPlan the timing of your transitionComplete all registration requirements and paperwork, as well as dealer-change paperworkTransfer all eligible client securities brokerage and Corporate RIA accounts We have enjoyed great success in attracting top talent to our Career Agency System. A major reason for this is our advisors’ ability to earn substantial performance-driven income. Advisors tell us that they appreciate the opportunity to earn bonuses for persistency and vested renewal commissions, which help to increase their total compensation package. When you’re affiliated with MassMutual Pacific, you have the ability to earn competitive commissions, incentives and bonuses.  Beyond financial rewards, MassMutual offers comprehensive benefits* to qualifying advisors who hold a career contract: Health benefits: medical with health savings account, dental and visionRetirement benefits: qualified pension and 401(k) – and nonqualified optionsWelfare benefits: health- and dependent-care flexible spending accounts, group term and variable life insurance, group short- and long-term disability, assistance programEligibility applies to those advisors who hold a full-time career contract (X4X) with MassMutual. Eligibility for subsidized benefits and before-tax coverage is based on meeting certain contract requirements. Benefit provisions are subject to modification or termination.Stay on the leading edge: MassMutual helps you to expand your skills and business in ways that suit your goals. That’s why we offer customized leadership, training and sales management opportunities that let you broaden your knowledge, using a range of easy-to-access tools and resources. We have Training and development opportunities help you keep ahead of the curve: MassMutual AcademyPersonalized advanced trainingInvitation-only sales and service support programsMassMutual UniversityAdvanced designation supportEnjoy the recognition you deserve: Qualifying advisors, along with a spouse or guest, may be invited to special recognition conferences for networking, business sessions and good times: Top of the Council Conference –Blue Chip Council ConferenceLeaders ConferenceFreshman FiveAgent of the Year and Chairman’s ClubCompany and Product LeadersCentury CircleCompany Sales Contests MassMutual was founded in 1851 and – for over 160 years – we’ve kept our strength, our integrity and our customer focus. We are a mutual company committed to long-term strength and stability to help our customers meet their financial goals. We operate for the benefit of our policy owners and customers. Built on more than a century-and-a-half of financial strength and customer service, MassMutual is a leading mutual life insurance company, providing a range of quality products – life insurance, disability income insurance, long-term care insurance, annuities, and retirement planning products. Take the next step! Join the team who has the resources, experience, passion and commitment to help you take your business to the next level. Must be legally authorized to work in the United States without sponsorship. Your future is waiting.  Securities products and services offered through registered representatives of MML Investors Services, LLC, Springfield, MA 01111-0001 or a broker-dealer that has a selling agreement with MML Strategic Distributors, LLC or MML Distributors,LLC, Springfield, MA 01111-0001. MML Investors Services, LLC, MML Distributors, LLC (Membes SIPC), and MML Strategic Distributors, LLC are subsidiaries of MassMutual, Springfield, MA 01111-0001. "}