{"jobID": "2694387319", "jobLocation": "Milpitas_CA", "jobTitle": "Project Manager", "companyRating": null, "companyInfo": {"Website": "www.northlandcontrols.com", "Headquarters": "Milpitas, CA", "Size": "201 to 500 employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job DescriptionJob Title: Project ManagerReports To: PMO DirectorDepartment: Program ManagementLocation: Milpitas, CaliforniaWhat Northland DoesNorthland is a world-class global security integrator with offices in the United States, United Kingdom, Singapore, China and India. We specialize in design, build, integration, and management of high-end Lenel, Software House, S2 global enterprise security systems which include 6 out of 10 of the largest hi-tech companies in Silicon Valley.We are responsible for single card reader installations in some of the most remote parts of the world, all the way through to the design, deployment and management of large enterprise systems managing up to 300 corporate offices in over 70 countries including datacenters and multi-faceted security operations centers.With 250 highly trained professionals, all program management, project management, system design, system programming, testing and commissioning is carried out by Northland Controls experts to ensure we deliver the right solution, to the right standard, every time, anywhere in the world. In addition, Northland is supported by a network of over 100 in-country local service partners (LSPs) across the world who partner with Northland to deliver unparalleled world class services to our enterprise customers.We are trusted to get the job done no matter what. Through word-of-mouth our elite list of customers has rewarded us with phenomenal growth from $1M to $70M in 10 years’. To achieve this, we are always interested in the very best people who share our core values and beliefs, and will “do whatever it takes” to enable our customers to realize their goals. We will take on difficult challenges regardless of where they may lead us, and we will always take the most honorable route to get there.Our MissionTo be the most trusted and influential leader in the industry. By delivering exceptional services across the world, we are determined to continually surprise our customers, the industry and even ourselves while having fun.Core ValuesBe HonorableTake on ChallengesDo Whatever it TakesOur PeopleHave FunJob MissionThe successful applicant manages a project portfolio ranging from$1,500,000 to $3,000,000 in project value. Project managers are responsible for the entire project lifecycle from budgeting through job completion and after care.Project managers are responsible for the project scope, schedule, and cost. Project managers attend owner, architect and contractor meetings representing the security interests of our clients.Defining and managing scope requires project planning and recurring reporting. Project managers establish project plans at the project’s outset and report frequently during the project’s course. They publish the scope and ratify it with interested parties. Scoping includes written statements of work, responsibility matrices, device schedules, and project drawings.Like project scoping, the project manager defines and manages project schedules. Scheduling requires coordination between multiple interested parties, ratifying the schedule, and executing the schedule. Scheduling requires recurring review of baseline and actual schedules; reviewing requires reporting the revisions to baseline schedules. Schedules are defined by several milestones. Within the milestones work is broken down into tasks. Tasks include durations and staffing levels. Scheduling is often done using Gantt charts, but other methods can be used as well.Managing cost requires establishing a project budget and work packages, executing the project in line with the budget, and reporting status.Forecasting future costs and invoicing are also required. Simple reporting includes estimated versus actual costs, a more sophisticated approach is earned value.Attending owners, architect and contractor meeting is in interactive experience. Project manager’s review published meeting notes and highlight their responsibilities. They execute their assigned duties and they report on their progress. They also take and publish copious notes. During the meeting they answer questions and present their project plans and requirements.QualificationsBachelor of Science degree, preferably in science, technology, engineering, mathematics, or construction management.Completion of CSPM certification from the Security Industry Association – within the first six months of hire.Five years of project management experience.Duties Delivers completed projects to our clients.Develops a relationship with the decision makers ofPresent a professional image of company when speaking to customers.Maintains current job plans and specifications.Manages project designs.Maintains construction schedule and coordinates scheduling with other trades.Maintains all records of job status, job changes, material flow and other control records and prepares reports for internal and external use.Manages job costs.Forecasts future costs.Reports on project costs and invoices.Manages installation labor and contracted partners."}