{"jobID": "2621808202", "jobLocation": "Cupertino_CA", "jobTitle": "Math and Science Teacher", "companyRating": "4.1", "companyInfo": {"Website": "www.halstromacademy.org", "Headquarters": "Irvine, CA", "Size": "51 to 200 employees", "Founded": " 1985", "Type": " School / School District", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "51000", "jobDescription": " Halstrom Academy is the leader in personalized learning. We are a network of schools serving students who learn better outside the traditional classroom environment. Our success rates are based on continually adopting the most effective teaching and learning techniques, both traditional and innovative, to help students find and maximize their strengths. Founded in 1985 by Dr. Karen Bishop, we a growing community of 15 schools across California, spanning from Northern California to Greater Los Angeles to Orange County, and San Diego. We have over 16,000 graduates and alumni who have found a better way to learn. JOB DESCRIPTION: Halstrom Academy in Cupertino, CA is looking for dynamic, dedicated, and energetic teachers to inspire and help our students achieve academic excellence. We are currently accepting applications for a Science Teacher. COMPANY CULTURE: We are leaders in innovative education. We teach, inspire, and cultivate a love of learning. At Halstrom Academy, we exemplify our ETHOS – We Exude energy and optimism, we Think and act creatively, we Honor our commitments, we Openly collaborate and communicate, and we Serve students, families, and each other. JOB REQUIREMENTS:Bachelor's DegreeMinimum 1 year teachingA love of teaching and desire to help students succeedA Passion for EducationAvailability to teach at least 15 hours a weekMust live locally to be consideredHOW IT WORKS:Teach students in a 1:1 modelOccasionally teach small groups of middle or high school students for labs and/or tutoringMotivate middle and high school students to reach academic excellenceBecome part of an amazing and dynamic teaching teamSCHEDULE: Part-Time. We are open for classes Monday through Friday, from 7:30am-6:30pm. You have the ability to set your schedule based on your hours of availability in conjunction with our open class slots that need to be filled."}