{"jobID": "2830871021", "jobLocation": "Palo_Alto_CA", "jobTitle": "MBA Intern - Product Marketing Manager - Integrated Systems Business Unit", "companyRating": "4.2", "companyInfo": {"Website": "www.vmware.com", "Headquarters": "Palo Alto, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (VMW) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "140000", "jobDescription": "Intern Product Marketing Manager Intern - Integrated Business Unit Location: Palo Alto, CA, Summer 2018  VMware is a global leader in cloud infrastructure and business mobility. VMware accelerates customers digital transformation journey by enabling enterprises to master a software-defined approach to business and IT. With VMware solutions, organizations are creating exceptional experiences by mobilizing everything, responding faster to opportunities with modern data and apps hosted across hybrid clouds, and safeguarding customer trust with a defense-in-depth approach to cybersecurity.  At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Do you dare to do the stuff youve always dreamed about? Dare to explore at http://careers.vmware.com. Team Description The mission of the Integrated Systems Business Unit (ISBU) is to bring the Software Defined Data Center (SDDC) to the mainstream by delivering integrated offerings that are simple for pur customers to purchase, deploy, and operate. In other words, we focus on delivering experiences to customers that make it easy for them to build their IT environments with VMware products so that they can focus on their business goals. We work with all the business units across VMware to ensure that the integrated offerings are built to VMware standard methodologies and incorporate the latest features.  The two main solutions that we are responsible for are the VMware Validated Designs and VMware Cloud Foundation. The VMware Validated Designs provides comprehensive and extensively tested blueprints for customers to build and operate the VMware SDDC stack. VMware Cloud Foundation takes this a step further and automates the deployment and operations of the VMware SDDC stack. Both offerings are fundamental to VMwares cloud strategy to help its customers in their digital transformations.  Product Marketing Managers are business owners who are responsible for driving the go-to-market initiatives for a product. Successful PMMs will lead cross-functional teams to successfully meet their objectives. This leadership requires setting the overall vision for product go-to-market strategy, knowing and monitoring key performance indicators, understanding the dynamics of both direct and channel sales, and influencing many teams towards common goals. Specific responsibilities include:Develop a deep understanding of the private and public cloud markets. Identify customer goals, challenges, buying behaviors and sales motions. Define target markets and corresponding go-to-market strategies.Define the sales and channel strategy. Analyze the sales cycle and channel mix, and formulate ideas and approaches to optimize the selling process.Drive the overall marketing strategy. Work closely with corporate marketing to determine and execute lead generation, analyst relations, and public relations programs.Determine packaging and pricing to optimize market success in each target segment.Launch new products and releases, including pricing and packaging, messaging and positioning, press and analyst communications, and field and channel training and enablement.Create the whole spectrum of sales tools and collateral to communicate the value proposition of ISBUs products and solutions for different level audiences (end user, IT Manager, CXO) and for different target segments.Train the VMware sales force and channel on product positioning and sales motions.Evangelize the positioning and messaging to industry analyst, press, bloggers, prospects, and customers.Perform competitive analysis, define and communicate key VMware advantagesContribute to product strategy and roadmap through specific, actionable feedback provided to the VMware Product Management teamsRequirements:You are a first year MBA studentYou have 3-5 years of work experience in technology product marketing or product management, strategic management consulting, investments banking or management in entrepreneurial projects.Excellent written and verbal communications skills. Ability to translate technology features into business benefits. Previous experience interacting with and presenting to C-level executives.Exceptionally strong analytical skills and a natural predisposition toward data-driven decision making. The ideal candidate should nevertheless be able to make reasoned decisions in the face of uncertainty or imperfect data.Desired Skills:Experience with enterprise software preferred.Aptitude to quickly come up to speed on new technology concepts. Passion to evangelize a disruptive new technology.You are a strong leader, self-starter and excellent teammate with experience in a high achievement-oriented environment.You must be a U.S. worker to apply for this role. VMware will not sponsor a non-transferable visa for this role.Equal Employment Opportunity Statement VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. VMware will provide reasonable accommodation to employees who have protected disabilities consistent with local law."}