{"jobID": "2671344098", "jobLocation": "New_York_NY", "jobTitle": "Business Development Manager - Mutual with Fire Prevention Sales Experience", "companyRating": "3.3", "companyInfo": {"Website": "security.kastle.com", "Headquarters": "Falls Church, VA", "Size": "201 to 500 employees", "Founded": " 1972", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Datawatch, Genesis Securities, Tyco"}, "estimatedSalary": "83000", "jobDescription": " Mutual Central Alarm Services, Inc., a subsidiary of Kastle Systems International offers the most advanced and effective electronic security systems and services available today. MCA has been the security choice for many major New York area businesses that require the best in security services. State-of-the-art electronic security and surveillance equipment, fire prevention and detection systems, highly skilled system design specialists and installation, and a dedicated, knowledgeable and professional service support and management team all combine to provide our customers with the most logical, efficient and cost-effective security for their home or business.  The primary objective of the Business Development Manager is to sell comprehensive security systems and services to the Company’s clients: local building owners, managers, tenants, and developers. The Company, a well-established leader in the security industry, recognizes the challenges and complexity that its clients must overcome to successfully perform ongoing management of their security systems. The Company uniquely runs and manages security systems so its clients don’t have to face these challenges.  To be successful, the Business Development Manager must be cognizant of the dynamics within the market served and understand the client’s security and fire prevention requirements. The Business Development Manager will instill in the client a clear understanding of the Company’s value proposition and offer systems and Identify and cultivate long-term business relationships with building owners, managers, tenants, and developers.Develop and plan account strategies that provide the greatest opportunity to make sales.Design security systems that meet the client’s needs.Write proposals, conduct presentations, and demonstrate Company systems and services.Generate sales that meet or exceed established goals.Maintain an ongoing sales journal that accurately summarizes the status of outstanding proposals.Participate in scheduled sales meetings.Amplify collective sales opportunities by introducing decision-makers and key client contacts to colleagues and managers.Identify, research, analyze, and communicate competitive sales strategies.Participate in key industry associations and events to increase awareness of the Company’s brand and favorably position the Company to targeted clients within the community.Demonstrate enthusiasm, initiative, teamwork, and professionalism.All other duties as assignedBachelor’s DegreeMinimum 6 years sales experience preferredDemonstrated outstanding sales skills to commercial clients at the executive level.Working knowledge and understanding of the commercial real estate market or commercial construction a plus.Demonstrated track record of closing sales of complex systems or services with protracted sales cycles.Experience with fire detection and prevention systemsOutstanding written, verbal and presentation skills.Experience with sales force automation systems such as Sugar is a plus.Demonstrated ability to work with little direct supervision.Excellent personal computer skills including a working knowledge of word processing, spread sheet, contract management, and e-mail programs.Ability to work well under pressure.Ability to perform a physical survey of commercial premises such as construction sites, parking garages, office building public spaces, tenant spaces and roofs.Neat, professional appearance.Must be willing to participate in and pass the company’s pre-employment screening process including a background investigation, drug screening and driving record.Must continue to maintain a safe driving record and valid driver’s license to fulfill the travel requirements of this position.Must be able to meet and continue to meet state licensing requirements for security.Must be able to meet client background and suitability screening when required to access client’s data and/or site. This job advertisement is intended to convey information essential to understanding the scope of this role and it is not intended to be an exhaustive list of the duties, knowledge, skills, abilities or working conditions associated with the role. Kastle Systems is an equal opportunity employer and complies with all EEOC, ADA, Local, State, and Federal employment laws  #kastle"}