{"jobID": "2827919263", "jobLocation": "Sunnyvale_CA", "jobTitle": "Optical Integration System Architect", "companyRating": "3.4", "companyInfo": {"Website": "www.infinera.com", "Headquarters": "Sunnyvale, CA", "Size": "1001 to 5000 employees", "Founded": " 2001", "Type": " Company - Public (INFN) ", "Industry": " Telecommunications", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Ciena"}, "estimatedSalary": "153000", "jobDescription": "Job Description Coherent Optical System Architect Infinera is looking for a Coherent Optical System Architect to join the Optical System Group in Sunnyvale, CA.  Description  Imagine being part of a team that is fundamentally changing the way people communicate, the way they collaborate, the way they watch TV and explore the universe through the internet. Utilizing our uniquely differentiated technology, we have created an Intelligent Transport Network with more speed, capacity and scalability than ever before. Imagine a world with unlimited bandwidth. The network of tomorrow will allow for content and creativity limited only by the imaginations of its users.  If this is something that interests you, that excites you, come and take look at a team not bound by large company obstacles and bureaucracy, where an idea today can be set in motion tomorrow. Come take and look at Infinera!  Infinera is seeking a Coherent Optical System Architect to join our Optical Systems Group (OSG). The engineer will be responsible for developing a leading digital coherent MODEM based on Infinera's next-generation coherent photonic integrated circuits (PICs) and FlexCoherent DSP ASICs. The ideal candidate will be prepared to work with early prototype PIC based TX and RX modules to get an initial look at product performance and provide rapid feedback to the PIC team. Performance characterization will include RF signal integrity measurements (linearity, input referred noise, bandwidth, TTR, S-parameters), OSNR tolerance, laser linewidth, receiver sensitivity and MZM control. The candidate will also have frequent interactions with the coherent DSP ASIC team and will be expected to validate the performance of new generations of the FlexCoherent ASIC family. Performance characterization will include DAC/ADC ENOB measurements, jitter analysis and optical line side validation. A key component of this role is the ability to understand and make tradeoffs between optical, electrical, and digital capabilities to optimize the overall system performance.  Responsibilities  Infinera’s next generation communications platform will be defined, developed, characterized, and optimized on your optical testbed. Your experimental data will fuel our design, starting with off-the-shelf components, evolving to prototype PICs, and eventually taking the form of the final integrated line card. This requires ownership of the optical design, optimization methods, and stabilization techniques. A key aspect of your research will be pushing our optical systems to higher symbol rates and higher order modulation formats.  Through frequent interaction with the firmware team, you will assist in optimizing performance-critical aspects such as powerup self-calibration, receive acquisition, real-time performance monitoring, and in-service performance optimization. These algorithms will be tested during the implementation stage to ensure they operate correctly. Results will be presented internally and documented as electrical and optical performance specifications for next-generation platforms.  Some customer-facing interactions may be required, such as field trials using prototype equipment, or debugging unusual field failures that cannot be resolved through the normal customer service process.  Requirements  PhD. in Electrical/Electronic Engineering or Applied Physics with minimum of 2 years of industrial experience in optical communications, photonics, high speed electronics or systems.  Fundamental understanding of optical communication systems, DWDM transmission systems, photonic integrated components and electronic (integrated) circuits.  Extensive understanding of coherent communications systems, including experience with higher order modulation formats and forward error correction algorithms. Significant experience in digital signal analysis and processing is required.  Hands-on experience working with system-level optical communication hardware and components. This should include high-speed digital sampling oscilloscopes and DACs, linear electrical amplifiers, integrated coherent receivers and optical modulators.  Experience characterizing high-speed RF and mm-wave inter-connects, amplifiers, and components.  Characterization of RF/mm-wave systems, such as S-parameter measurements, jitter measurements, and ADC/DAC performance and ENOB  Hands-on experience with writing control and data acquisition scripts for high-speed optical and electrical test and measurement equipment.  Programming experience in Matlab is a MUST, additional experience in Python, VB.net or C desired. Infinera is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, age, status as a protected veteran, or status as a qualified individual with disability. EEO Employer/Vet/Disabled."}