{"jobID": "2822048876", "jobLocation": "Boston_MA", "jobTitle": "DATA MANAGER, SUSTAINABILITY, Facilities Management & Planning, Sustainability", "companyRating": "4.2", "companyInfo": {"Website": "www.bu.edu", "Headquarters": "Boston, MA", "Size": "10000+ employees", "Founded": " 1839", "Type": " College / University", "Industry": " Education", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "50000", "jobDescription": " DATA MANAGER, SUSTAINABILITY, Facilities Management & Planning, SustainabilityTracking Code  6179/F1918  Job DescriptionBe a part of the solution. Help Boston University achieve its commitment to carbon neutrality by 2040. sustainability@BU, Boston University’s award-winning sustainability office is building capacity to support the Climate Action Plan recently approved by the Board of Trustees. This is an unparalleled opportunity to build on a data-driven foundation to help advance sustainability at Boston University. The successful candidate will have an underlying understanding about climate change and a passion for sustainability. You will report to the Director, and collaborate closely with the Assistant Director for Sustainability, Energy Analyst, Facilities Management & Planning, Dining, and many other departments across the University. This position will support the effort to improve operational performance and enhance institutional decision-making to meet the University’s sustainability goals and climate commitments to lead to a fossil fuel-free future. You will be responsible for managing data interns, collecting data, assuring data integrity, managing, analyzing, and reporting the multiple elements of the University’s sustainable actions to stakeholders across the framework provided by AASHE’s Sustainability Tracking Assessment and Rating System (STARS), building dashboards, and other systems.  Visit us to learn more at https://www.bu.edu/sustainability/ and http://www.bu.edu/climateactionplan/  If you’re a data-driven, tenacious collaborator, and an expert communicator, this position is for you!Required SkillsB.A./B.S. required, Masters preferred. Three to five years of experience.  Qualifications An understanding of sustainability issues, metrics, tradeoffs, and life cycle assessments.Experience using the Sustainability Indicator Management and Analysis Platform (SIMAP) or the World Resources Institute’s Greenhouse Gas Protocol.Advance skills with Excel and plugins for handling and automating tasks with thousands of rows of data.Exceptional writing and verbal communications skills.A data-driven self-starter and collaborator who demonstrates strong analytical, problem solving, strategic thinking, and project management skills. Experience:Experience working in higher education and with AASHE STARS.Experience with Zero Waste metrics, Life Cycle Assessment, and Scope 3 emissions a plus.Experience in science, engineering, finance, or business-related fields also a plus.Experience in the following programs and languages a plus: Project management (Trello)Statistical programming languages (e.g. R, Python)Database querying languages (e.g. SQL)Predictive analysis techniques and tools (e.g. SAS, SPSS, R)Data visualization and communication tools (e.g. Tableau, D3.js)Geographic information system (GIS)We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. We are a VEVRAA Federal Contractor.Job Location  BOSTON, Massachusetts, United States  Position Type  Full-Time/RegularSalaryGrade 74"}