{"jobID": "2793826850", "jobLocation": "Sunnyvale_CA", "jobTitle": "Sr. Technical Recruiter (Temp)", "companyRating": "3.4", "companyInfo": {"Website": "www.infinera.com", "Headquarters": "Sunnyvale, CA", "Size": "1001 to 5000 employees", "Founded": " 2001", "Type": " Company - Public (INFN) ", "Industry": " Telecommunications", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Ciena"}, "estimatedSalary": "77000", "jobDescription": " Infinera is looking for a top notch Sr Technical Recruiter who can support the hiring for the Engineering PLM + Sales and Services organization. Sales and software full cycle recruiting capability is needed. This person would have 10+ years of recruiting industry experience. Your Key Responsibilities Would Include:Manage full lifecycle recruitment on 20-25 positions at a given timeBecome proficient on applicant tracking system and hiring processes quickly (Workday)Conduct recruitment intake strategy meetings, clarify successful candidate’s profile and market availability, develop and execute sourcing strategy, & complete phone screens.Work closely with hiring managers to influence selection process and results.Use direct sourcing and networking techniques to prospect qualified candidates and build a pool of Top Talent.Assess candidate competence and present a short list of top candidates for on-site interviews.Working closely with the Compensation team, HR Business Partner and Hiring Manager to develop competitive offer packages to present to selected candidate.Keep current with new sourcing techniques, external market trends and serve as a trusted resource.Education & Experience Necessary For Success:10+ years of recruiting industry experienceA proven track record of proactive sourcing and hiring technical candidates using your networking skills to attract passive candidates.Ability to work cohesively with supported groups and establish Infinera brand in the communityEnsure great candidate experience through entire processProven ability to work in a fast-paced changing environment, effectively prioritize and ensure high quality work.Experience with advanced internet searches, Boolean search logic, and Applicant Tracking Systems.Ability to rapidly learn leading tech positions and niche skill-sets. A strong background in recruiting Software is preferred.Strong collaboration skills working with other team members to achieve goals and improve processes.Bachelor’s degree preferredInfinera is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, age, status as a protected veteran, or status as a qualified individual with disability. EEO Employer/Vet/Disabled."}