{"jobID": "2817708810", "jobLocation": "Boston_MA", "jobTitle": "Sr. Data Scientist - Research and Prototyping", "companyRating": "4.2", "companyInfo": {"Website": "www.pluralsight.com", "Headquarters": "Farmington, UT", "Size": "501 to 1000 employees", "Founded": " 2004", "Type": " Company - Public (PS) ", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " lynda.com, Skillsoft"}, "estimatedSalary": "166000", "jobDescription": "Company Description About Pluralsight  Pluralsight proudly creates the creators of tomorrow: the people who develop the technology that lifts the human condition. We do this through the tech industry's leading learning platform for serious Developer, IT and Creative professionals. Our team of 700+ innovators serves millions of users across the globe.  Working At Pluralsight  We're committed to a values-driven culture here at Pluralsight and our mission inspires everything we do:  Creating Progress Through Technology That Lifts The Human Condition.  This is our North Star it's the why and how behind all of our decisions. Since our start in 2004, we've chosen to grow in a way that will make our Mission a reality. We've raised over $190 million in funding and acquired five awesome startups (PeepCode, TrainSignal, Tekpub, Digital Tutors, & Code School) that have grown our platform in immense ways. We're growing quickly and we're looking for people who are passionate about making a serious impact on technology -- and the world. We invite you to help us create the future while doing the best work of your life. Job Description The Opportunity  Pluralsight Iris is the learning intelligence platform built within Pluralsight. It helps technologists worldwide discover the learning they need to achieve their personal and career goals in technology.  As a data scientist on our core team, you will help us you will help us solve novel statistical, machine learning, and data science problems by building and improving on the intelligence of Iris. We are looking for an experienced data scientist who loves tackling ambiguous problems, finding creative and practical solutions, and producing concrete prototypes that will become a key part of Pluralsight's user experience. You'll work closely with an established team of top-notch, collaborative data scientists and you will collaborate with a cross-functional product team that is responsible for one of Pluralsight's key differentiators. Who you are: You are intellectually curious, collaborative, and highly driven with an entrepreneurial mindset. You have excellent critical thinking, problem solving, and analytical skills.  You can guide complex projects from ideation and planning to model design to deployment and independently make decisions about the technical approach You have a strong foundation in Machine Learning, Computer Science, and Statistics.You have mastery of either Python or R. Regardless of your favorite scientific computing environment, you can flex between the two languages.You know your way around SQL-like databases (e.g. PostGres, Impala, Hive) and even better if have experience with Spark and other big data platforms.You are able to perform rapid prototyping of experimental solutions, writing readable, scalable, and reproducible code.You have a solid data science toolkit that you can leverage, with knowledge of and understanding of how and when to apply different algorithms and technical approaches.You can describe and speak in an approachable way about complex analyses and concepts within a cross-functional team. You are a great analytic translator.What you'll do:You will collaborate with the Iris product teams to research, envision, and create quality reliable data science solutions needed to drive our user experience outcomes.You will create, iterate, and innovate on Iris algorithms and partner to implement them on the Pluralsight platform.Champion the introduction of new technology by developing proof-of-concepts and prototypes and effectively communicating highly complex information to Experience team partnersYou will propose and design experiments to test new product features and analyze their results.You will also serve as a data science expert and consultant to Pluralsight's product teams, leveraging your statistical and analytical skills to answer ad hoc questions.QualificationsExperience you'll need:M.S. or Ph.D in Computer Science, Statistics, Mathematics, Data Science, or related quantitative disciplineMinimum 5 years in a non-academic data science role, conducting analysis, developing algorithms and building prototypesExperience working with product development teams and/or with developersAdditional Information Be Yourself. Pluralsight is an equal opportunity employer.  I'm interested"}