{"jobID": "2573496421", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.wish.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "143000", "jobDescription": "Wish is looking for an exceptional Pricing Data Scientist to join our Product Engineering team. The role entails driving business analytics insights to inform product pricing strategy, promotions, shipping policies, and overall revenue optimization. Additionally, you will guide pricing strategies in the more than 50 countries we have presence in!You should have an extensive background in a quantitative field, a strong research background, and experience working with large data sets. You should be results-driven, highly motivated, and have a track record of using data analytics to drive the understanding, growth, and the success of a product.What you'll be doing: Drive pricing strategy and modelsAnalyze revenue drivers and marketplace performanceLeverage your analytical skills to analyze large data sets and optimize key metrics of the businessCommunicate your complex analyses and insights to a broad range of partnersWho you are:BS in a quantitative field (math, science, engineering, economics, etc.) from a top universityProficiency with SQL and ExcelStatistical skills and experience using stats packages (e.g. R, Python)2+ years of relevant experience with PricingAbility to communicate complex concepts clearlyFocus on delivering business impact rapidly via analyticsAbility to excel in a dynamic, cross-functional environmentExperience with Tableau or data visualization software a plusCompany DescriptionWish is transforming the way the world shops by offering a convenient and personalized mobile shopping experience. Our mission is to offer an unlimited selection of affordable quality goods to be accessible for everyone on a global scale. Wish selectively brings together world-class talent with a passion for connecting relevant products to the global population.Learn more about us:Wish + LA LakersIntro to WishOur CEO discusses WishRecruiting VideoWe are an equal opportunity employer and value diversity at Wish. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.Wish values diversity and is committed to creating an inclusive work environment. We provide equal employment opportunity for all applicants and employees. We do not discriminate based on any legally-protected class or characteristic. Employment decisions are made based on qualifications, merit, and business needs. If you need assistance or accommodation due to a disability, please contact us at hrteam@wish.com. For job positions in San Francisco, CA, and other locations where required, we will consider for employment qualified applicants with arrest and conviction records."}