{"jobID": "2824424685", "jobLocation": "San_Francisco_CA", "jobTitle": "Outside Sales Representative", "companyRating": null, "companyInfo": {"Website": "www.productivelearning.com"}, "estimatedSalary": null, "jobDescription": " We are currently searching for an outside salesperson to join our team. We are looking for an enthusiastic individual to book and deliver presentations to organizations, businesses, and other groups in the San Francisco Bay area.  Productive Learning supports our clients in creating an EXTRAORDINARY life or business through fun, interactive, experiential learning vacations and workshops. Check out our website below:  www.ProductiveLearning.com  Productive Learning's Culture and Values:  • Reciprocity  • All for One and One for All  • Self-Propulsion  • Community  • We take responsibility for our actions and results  • We deliver high quality products  • We hold our agreements with the highest regard  • We value truthful, open relationships  • We are committed to learning and growth  This position is best suited for a self-driven, motivated individual that enjoys introducing people to new ways of thinking. You will be on the front line of our sales funnel finding prospective clients to purchase seats in our cornerstone workshop, Beyond Reasons. The growth of Productive Learning is contingent on new client acquisitions and client retention. This is an exciting position that will give you the opportunity to develop your influence and expertise in the world of personal growth. As an outside sales representative, you will be delivering the first impression of who we are and what we do to the San Francisco Bay Area.  Our ideal candidate does not settle for the status quo. If you are a high energy person who enjoys engaging with groups of people (whether 10 or 100) as a speaker then let's see how we can work together to influence the world!  Your typical week will include calling organizations and networking groups to book yourself as a speaker. You'll then be driving to these presentations, lead interactive, engaging presentations with a grabbing sales punch at the end. After the presentation you'll be taking people's registrations and working the crowd for more registrations and referrals for other presentations.  Once you're back home (yep, you'll be working out of the comfort of your house), you'll be following up with some people from the presentation to register them and also the referrals to book yourself into the other presentations.  If you are looking for a vibrant, fun company to work for and have an eagerness to enroll people in something that truly changes lives, then send us your resume and we'll see if you have what it takes!  Productive Learning has a culture of growth and adaptability. Our value of Self-Propulsion speaks to the concept of \"if you want it, you can create it.\" Along with our value of Reciprocity, we live by the belief that when you serve the company, the company will serve you, and vice-versa. Our goal is to develop our clients AND staff to build the life they want. Your career growth and goals are largely in your hands to define, and we will help you create a path within Productive Learning for that, whether that is a Workshop Facilitator, Corporate Development, Management or higher administration positions!  Compensation:  • Base Salary between $48,000 - $55,000 (based on experience)  • Quarterly Bonus (up to $3,000 per quarter based on team performance)  Benefits:  • Presentation and sales training program  • Mileage reimbursement  • Health Insurance with Vision and Dental Options (available after 30 days of employment)  • 401k (available after first year of employment)  • Copious Paid Vacation Day Agreement  • Generous Workshop Tuition Discounts  Experience:  • 2 Years Outside Sales  Preferred:  • Presentation experience"}