{"jobID": "2822176032", "jobLocation": "New_York_NY", "jobTitle": "Project Manager - Consumer Brand Insights", "companyRating": "2.9", "companyInfo": {"Website": "www.hallandpartners.com", "Headquarters": "London, United Kingdom", "Size": "201 to 500 employees", "Founded": " 1991", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Kelton, Ipsos, Millward Brown"}, "estimatedSalary": "74000", "jobDescription": "Role The role of a Research Project Manager is to oversee the set up and management of qualitative and quantitative research projects to ensure successful completion within H&P; Standard Operating Procedures (SOP). This will require working closely with research teams, clients, field partners, facilities, data management centers, and other external suppliers/partners. You will be expected to contribute to the company’s operational processes by providing proactive ideas and plans about improving the efficiency of the project management function and by supporting operational initiatives. Core responsibilitiesSetup and manage projects spanning from adhoc to tracking studies across a range of qualitative and quantitative methodologiesAct as an expert to support researchers and other project management team members for methodology, sampling and supplier selection in marketsCover full project management, including not just the research team and the suppliers, but also liaising professionally with clients and taking a key role in status meetings and providing updates on fieldwork, timelines, deliverables, etc.Provide full costs and timings for new business proposals or existing projectsDrive adherence to H&P; Standard Operating Procedures (SOP) within the research teamsIdentify further areas for efficiency and profitability of projectsMaintain and update databases of recommended field partners and contribute to managing suppliers’ best practiceProvide expertise and proactive guidance as to how to be as operationally efficient as possibleMentor, develop and train more junior members of staff on the research teamsSupport the wider operations and research teams with any training and implementing of operational initiativesKey attributes2+ years of experience of project management experience in a market research environment, including project setup, field management and schedule managementExperience with multiple methodologies, including online and inperson focus groups, indepth interviews, and quantitative surveysExcellent knowledge of multiple types of studies, including concept testing, creative development, pretesting, and continuous trackingExcellent project management skills, managing the endtoend project life cycle with multimarket and complex studiesAbility to manage multiple projects at a time while sticking to deadlines and achieving a high quality outputAbility to work effectively across all levels including senior leadershipExperience in managing external suppliersExcellent communication skills with an ability to influence others within areas of responsibilityExcellent organization skills, attention to detail and time managementDedicated to quality and responsiveness with a focus on processes and efficiencyAbility to champion methodological choices with clients and teammates and identify potential pitfalls in clients’ briefs/requestsHas a good working knowledge of approaches to brand and communications research, including new products/techniquesHas a presence in the office; looks for ways to interact with other teams and departments within H&P; And, importantly, embodies Hall & Partners’ core values: curious, courageous, collaborative, creative.  Overall, we are looking for people who can act as genuine consultants to their clients and teams. People who can offer them integrated solutions and talk to them about what research methods and suppliers/partners can contribute to solving their business issues. Be a “goto” person. What we offer you We’ve been told that our culture is unique, it’s a difficult thing to put into words but it’s all about being challenging yet treating each other with respect. We are naturally curious and we love to learn and discover new things.  We nurture opinions and really respect people who have a point of view and aren’t afraid to share their thinking. We work as teams and responsibilities sit with everyone in that team, whatever their job title. A can-do attitude goes a long way in our business and we don't tolerate egos!  We are passionate about helping our people to learn, stretch and grow. We want this to be a place where people feel challenged, as well as guided and supported.  We have a Learn calendar packed with opportunities to attend interactive training sessions. From “OutsideIn” sessions with industry experts to “15 minutes of Fame” sessions with colleagues to share the amazing work we do, there are lots of ways to build your skills for the future. Benefits We want our people to feel rewarded for the great work they do. Here are some of the benefits we offer.  Comprehensive benefits program (including medical, dental and vision coverage)  401k program  Group life insurance  Generous vacation policy  Discretionary summer Friday bonus days  Employee Discount programs  To find out more about Hall & Partners click here to check us out online. Hall & Partners is an equal opportunity employer and are strongly committed to promoting equal opportunity. We maintain an Equal Opportunities, Diversity and Anti-Harassment Policy to inform, guide and encourage equal opportunities practices within the Company. We are also part of the Omnicom group and together we promote and embrace equality and diversity through a number of initiatives such as Omniwomen, ADCOLOR and Open Pride. You can read more about our commitment to do equality and diversity here:http://www.omnicomgroup.com/culture/diversity/"}