{"jobID": "2813073183", "jobLocation": "San_Jose_CA", "jobTitle": "Enterprise Security Project and Remediation Manager", "companyRating": "4.3", "companyInfo": {"Website": "www.arm.com", "Headquarters": "Cambridge, United Kingdom", "Size": "5001 to 10000 employees", "Founded": " 1990", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Intel Corporation, Imagination Technologies, NXP Semiconductors"}, "estimatedSalary": "113000", "jobDescription": "We are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class. Job DescriptionPassionate about building a world-class information security program to safeguard a global tech company from the latest cyber threats and meet challenging security and compliance requirements? Arm is seeking a passionate, expert project manager to work across our business as we grow our program.About the role The Enterprise Security Project and Remediation Manager is an awesome opportunity for a project professional who loves to get things done, while making a major impact. It's the right role for someone who wants to grow their security knowledge. This role requires passion, grit, persistence, initiative, drive, and finesse. Arm's Enterprise Security team has an ambitious agenda. This role will drive several initiatives across the team, will direct and facilitate teams across the company to attain security goals, and will play a major role in keeping the program on track. You will utilize project management processes and methodologies to ensure the suite of projects are delivered on time, within a set budget, to high-quality standards, and meet customer expectations. You will be a key team player within a global team including Information Security, Engineering, IT, Internal Audit, Communications, Operations and various Arm vendors to deliver on the program's objectives.  You are mature and confident in your information security knowledge and will have excellent Project Management experience.  You will travel ~15%. AccountabilitiesYou will facilitate completion of \"Get Well\" plans by the organization to bring them into compliance with information security policies and standards.You will lead and facilitate project teams to complete information security related projects and initiatives.You will track and manage the team's commitments to ensure that we are meeting our roadmapYou will gain consensus on aligning processes and technology to achieve the desired outcomeYou will align internal projects to the Corporate PMO process and objectivesYou will communicate and provide timely project status to senior leaders, project team, management and key internal and external partnersYou will optimize all resources for delivery Job RequirementsWhat qualifications, skills and experiences do you need?You thrive in organizing chaos and are results-focused.You have a Bachelor's degree and 5-10 years of experience in IT, or other engineering related fieldsYou are a certified Project Management Professional (PMP)You are an excellent communicator who is politically astuteYou consider yourself a builderYou are dynamic and collaborative. You are someone who lives Arm's values of Be Your Brilliant Self, Passion for Progress and We, Not I.You have a Security Certification (CISSP, CISM, etc.) or equivalent work experienceProcess improvement and M&A; experience is a plusAbout Arm Arm® is at the heart of the world's most advanced digital products. Our technology enables the creation of new markets and transformation of industries and society. We design scalable, energy efficient-processors and related technologies to deliver the intelligence in applications ranging from sensors to servers, including smartphones, tablets, enterprise infrastructure and the Internet of Things.  Our innovative technology is licensed by Arm Partners who have shipped more than 50 billion Systems on Chip (SoCs) containing our intellectual property since the company began in 1990. Together with our Connected Community, we are breaking down barriers to innovation for developers, designers and engineers, ensuring a fast, reliable route to market for leading electronics companies.  With offices around the world, Arm is a diverse community of dedicated, innovative and highly talented professionals. By enabling an inclusive, meritocratic and open workplace where all our people can grow and succeed, we encourage our people to share their unique contributions to Arm's success in the global marketplace.  #LI-SC2  BenefitsYour particular benefits package will depend on position and type of employment and may be subject to change. Your package will be confirmed on offer of employment. Arm’s benefits program provides permanent employees with the opportunity to stay innovative and healthy, ensure the wellness of their families, and create a positive working environment. Annual Bonus PlanDiscretionary Cash Awards401(k), 100% matching on first 6% eligible earningsMedical, Dental & Vision, 100% coverage for employee only, shared cost for dependentsBasic Life and Accidental Death and Dismemberment Insurance (AD&D;)Short Term (STD) and Long Term (LTD) Disability InsuranceVacation, 20 days per year with option to buy 5 more.Holidays, 13 days per yearSabbatical, 20 paid days every four-years of serviceSick Leave, 7 days per yearVolunteering, four hours per month (TeamARM)Office location dependent: café on site, fitness facilities, team and social eventsAdditional benefits include: Flexible Spending Accounts for health and dependent care, EAP, Health Advocate, Business Travel Accident Program & Commuter programs.  ARM, Inc. (USA) participates in E-Verify. For more information, please refer to www.dhs.gov/E-Verify About ArmArm® technology is at the heart of a computing and connectivity revolution that is transforming the way people live and businesses operate. From the unmissable to the invisible; our advanced, energy-efficient processor designs are enabling the intelligence in 86 billion silicon chips and securely powering products from the sensor to the smartphone to the supercomputer. With more than 1,000 technology partners including the world’s most famous business and consumer brands, we are driving Arm innovation into all areas compute is happening inside the chip, the network and the cloud.  With offices around the world, Arm is a diverse community of dedicated, innovative and highly talented professionals. By enabling an inclusive, meritocratic and open workplace where all our people can grow and succeed, we encourage our people to share their unique contributions to Arm's success in the global marketplace.  About the officeThe Arm San Jose office is nestled in California's Silicon Valley, just south of San Francisco. Serving as Arm’s North America headquarters, the office houses employees serving all divisions of Arm. World-renowned Stanford University is seen as a hub of innovation, helping to make San Jose one of the US’s fastest growing cities. San Jose, California USA Arm Inc.  150 Rose Orchard Way  San Jose, CA 95134-1358  See on Google maps"}