{"jobID": "2724535056", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.angaza.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Company Description Angaza is a venture-backed company that is tackling global energy poverty by enabling financing of solar power for off-grid consumers. We have developed a mix of hardware and software solutions for some of the most demanding and dynamic markets in the world. We are for-profit, based in San Francisco, California and Nairobi, Kenya, and focused on aiming market forces at the linked challenges of climate change and global development.Role Summary The Data Analyst will be primarily responsible for all Sales, Marketing, and Customer Success Analytics at Angaza. You will help us use data intelligently to focus internal priorities, drive business decisions, and benefit our global customer base. Your responsibilities will range from constructing efficient schemas for use in our visualization tools, to working directly with key customers to create custom BI dashboards, to building internally-facing decision science products.Outcomes Marketing, Customer Success, and Sales teams are empowered with:  Analysis of campaign performance, conversion rate, and other key performance indicators Accurate, precise forecasts on which to base compensation targets Rich analytical data models with clear Data Dictionary entries for self-service analytics Relevant data sources (CRM tool, ERP models, Marketing expenditures, Forecast results) are effectively integrated into the wider Angaza BI Ecosystem. Significant trends are identified and surfaced in high-impact BI features for both internal and customer audiences. The social and environmental impact of internal decisions is measured to ensure we are living our core values.Competencies Advanced SQL skills Ability to design an efficient data model for use within modern BI tools Familiarity with modern CRM tools from an analyst/administrator perspective Demonstrated ability to design and build rich data visualizations Competency with one or more programming languages for data manipulation and analysis Understanding of applied statistics and experimental design in a business contextSuccessful Candidates Will... Thrive in a cooperative environment Exhibit a strong tendency towards self-management Enjoy balancing multiple projects simultaneously Be comfortable with a role that is both internal- and external-facing, including occasional direct engagement with key customers Get excited about beautifully presented graphs and reports to communicate complex information in a straightforward way Have strong quantitative, problem-solving, and project management skills Demonstrate excellent written and verbal communication skills Pride themselves on attention to detail Thrive in fast-paced, dynamic work environments Exemplify Angazas key values: impact-driven, empathetic, courageous, trustworthy, curious, and collaborativeRecommended Experience BA/BS in business, statistics, computer science, or related field; graduate degree a plus 2+ years of experience, preferably in a data analytics position Experience working closely with Sales and/or Marketing teams at a growing organizationBenefits Medical, dental, vision Covered commute costs 401(k) with company match Snacks and drinks Parental leave Flexible scheduling and time off policies Knowledge that youre making a positive impact on the world every day you come to work!Note that applicants must send a resumeandcover letter to be considered. Due to application volume, we will only be able to follow up with the most promising candidates.Thank you we appreciate your consideration."}