{"jobID": "2816152310", "jobLocation": "Seattle_WA", "jobTitle": "Health Data Analyst", "companyRating": "2.4", "companyInfo": {"Website": "www.qualishealth.org", "Headquarters": "Seattle, WA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": " In April 2018, HealthInsight and Qualis Health announced a formal merger, combining the two organizations and operations across the U.S. Both HealthInsight and Qualis Health have been engaged in health care quality consulting and providing quality improvement services for more than 40 years. Who We Are HealthInsight and Qualis Health are national leaders in assisting front-line providers and engaging health care stakeholders to improve care delivery and patient outcomes. We have offices in Alabama, Alaska, California, the District of Columbia, Idaho, Kansas, Nevada, New Mexico, Oregon, Utah and Washington. Who We Serve Clients include the Centers for Medicare & Medicaid Services, state Medicaid and other government agencies, health plans and providers, federally qualified health centers, foundations and other privately funded organizations. What We DoNationally recognized care management services for public and private purchasers.Technical assistance and support to health care providers.Health information technology consulting services through the Outlook Associates subsidiary.External quality review services.Transparency and public reporting of health care services and health outcomes.Patient and family engagement work in the community.Redesigning how care is paid for and delivered.As a member of our Analytics team, you would:Retrieve data from a variety of sources and conduct detailed data validation and accuracy checks.Assist with the standardization of processes to produce reports, including documentation of operating procedures.Create and maintain regularly scheduled and ad-hoc data reports including appropriate programming and coding of data.Analyze clinical outcomes data in support of clinical quality and/or process improvement initiatives.Developing structured dashboards and ad-hoc analytical “deep dives” into relevant areas of clinical interest and concern.Assist internal and external stakeholders to understand data by preparing tables/charts/graphs, written narrative, and other visual aids, using appropriate statistical methods.Evaluate patient care data to ensure that care is provided in accordance with clinical guidelines and organizational standards.Required SkillsKnowledge of data models, data warehouse and database design development.Ability to present complex information in an accurate and compelling manner.Ability to organize and coordinate multiple simultaneous tasks in a team environment.Advanced proficiency with:MS Office Suite (especially Word, Excel, Access and PowerPoint).Visual Basic (VB), SQL, SSRS, SSAS, SAS, R, or other programming languages.Data visualizations tools like Tableau, Power BI or comparable applications.Administration of online software services, e.g., Tableau Online or Jira.Required Experience4+ years of data analysis, report design, research, and/or other relevant work experience.BA / BS in a related field (equivalent combination of education and/or work experience may be substituted).Experience in data mining techniques/procedures to achieve compelling analytical outcomes. Job Location  Seattle, US-WA "}