{"jobID": "2830886885", "jobLocation": "Palo_Alto_CA", "jobTitle": "Reporting Data Analyst", "companyRating": "4.2", "companyInfo": {"Website": "www.vmware.com", "Headquarters": "Palo Alto, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (VMW) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "88000", "jobDescription": " The Candidate selected will should start on May 2018. We are looking to hire a Data Analyst to join IB services. He/she will take the responsibility for managing our master data set, developing reports & dashboards, enhance and automate them. The Data Report Analyst is responsible for the daily execution of reports critical to ensuring customer satisfaction, report creation based on gaps identified in the day-to-day activities of the business, data analysis to resolve customer or quoting related issues, and report to management. There is an additional component that involves management of internal and external customer relationships and deliverables as it relates to data and reporting.  This can include driving customer requests to resolution, managing customer expectations, and driving regularly scheduled customer meetings. As the first point of contact when customers encounter data or reporting problems, the Data and Report Analyst has a key role in establishing Vmware, IB services credibility as a Best in Class company. There is a high level of day-to-day interaction with internal and external customers that require a high degree of accountability and timeliness in responses and updates.  Candidates should have an Intermediate to Expert knowledge of MS Excel VBA and the entails that the applicant should have the ability to: Write code from memoryConstruct code logically based on instructionWork in variables (declare, initialize and display a variable in Excel VBA.)Understand the creation of loops, If Then statements, Case functions, Etc It is important that the applicant has working knowledge and experience of creating automation tools from scratch. Career Path Core Competencies Communication:Excellent written and oral communication skillsListens to others and accepts input from team members.Clearly articulate ideas and thoughts verballyAccurately prepares written business correspondence that is coherent, grammatically correct, effective and professional.Technical UnderstandingBachelors degree from an accredited university or college in computer science, administration, industrial Engineering, or related fieldProven experience in business analytics, reporting, enhancement and data visualization.Experience with Excel, Access, VBA, and/or SQLUse statistical methods to analyze data and generate useful business reportsPowerPoint skillsPrior experience with data analytics and modelling applications preferredProblem Solving:Propose solutions to problems and considers timeliness, effectiveness, and practicality in addressing client needs.Work with departmental managers to outline the specific data needs for each business method analysis projectUse data to create models that depict trends in the customer base and the consumer population as a wholeGenerates innovative solutions by approaching problems with curiosity and an open mind, using existing information to its fullest potential.Required SkillsMotivated self-starter, collaborator, and team player who is energetic, empathic, and enjoys problem-solvingExcellent verbal, written, and presentation skills with an attention to detail. A demonstrated ability to effectively communicate technical and business issues and solutions across organizational levels and with customersUse statistical methods to analyze data and generate useful business dataExperience writing scripts in JavaScript, or similarSolid analytical and problem-solving skills; ability to think strategicallyStrong process orientation with an ability to receive inbound data and report requests and manage accordinglyExcellent time management skills and ability to manage multiple projects simultaneously and deal with conflicting prioritiesAbility to work independently with strong time management and ability to execute on multiple concurrent deliverablesKnowledge of reporting systems such as SQL, Business Intelligence.Ability to adapt quickly to changing priorities, assignments, and rolesAble to interact with Engineering, Technical Operations, and Customer Success teamsResponsibilities:Daily execution of key performance reports and metrics for internal and external reportingResolution of customer requests related to data analysis and reportingAbility to extract and analyze data from Vmware CRM tools and othersDevelopment of new or existing reports to address customer requirements or internal business issuesUse statistical methods to analyze data and generate useful business repCharacterization of reports for automation by technical teamsOngoing management of customer relationships and weekly meeting agendasAdherence to Service Level Agreements (SLAs) related to request response, management, and resolutionFunction as liaison between internal technical teams and application usersDocumentation of process steps associated with report managementUtilize existing documentation, websites, and VMware tool to address data and reporting request Location: CRI-Heredia-America Free Zone"}