{"jobID": "2826806153", "jobLocation": "San_Francisco_CA", "jobTitle": "Software Engineering Intern", "companyRating": null, "companyInfo": {"Website": "www.irisonboard.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Description Iris Automation engineers are at the center of our core mission: building state of the art technologies that enable drones and autonomous vehicles to perceive, understand, and navigate the world we live in. As an intern, you will join a motivated, creative, and talented team to help design sophisticated, production ready code by being given complete ownership of a project and seeing it through. We view our interns differently than most: you will be hands-on with the most meaningful problems facing the drone industry today, and your contributions will make a lasting impact. This is a paid, full-time position for a minimum of three months. How You'll Make an Impact Crafting and improving underlying systems and frameworks that make up the Iris Automation Collision Avoidance systemAssisting in creation of internal tools to better the development of our softwareHelping to implement computer vision algorithms, from the drawing board into productionCreating robust testing suites for internal use.Taking ownership of a project through to completion Required Skills Proficiency in writing clean, well organized C++ codeWorking knowledge of Linux systemsWorking understanding of Python, Bash scriptingA strong willingness to learn and be challenged Useful Skills Prior experience with GPU programming/CUDAWorking knowledge of ROSAbout Iris Automation IncCollision avoidance systems for industrial drones, unlocking a $100B industry.  Iris Automation Inc is a venture-backed high tech computer vision company that is working to build groundbreaking new ways for drones and unmanned systems to perceive and navigate the world. Currently, industrial drone systems are not trusted to fly beyond-line-of-sight or be completely autonomous; we are changing that by giving them the ability to intelligently see and react to the physical world. Our product is a sophisticated computer vision algorithm packaged into a physical, plug-and-play perception unit that adds tremendous value to unmanned systems operators as it enables them to overcome regulatory, insurance, trust and safety concerns. The team includes PhDs in Computer Vision, has worked together in the drone industry for the last three years, and combines experience from NASA, Boeing, Airbus, Nvidia, and leading tech startups. We are an equal opportunity employer who values diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}