{"jobID": "2799442649", "jobLocation": "San_Jose_CA", "jobTitle": "FT Retail Sales Consultant", "companyRating": null, "companyInfo": {"Website": "www.comcastcareers.com", "Headquarters": "Philadelphia, PA", "Size": "10000+ employees", "Founded": " 1963", "Type": " Company - Public (CMCSA) ", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " AT&T, Time Warner Cable, Verizon"}, "estimatedSalary": null, "jobDescription": "Comcast brings together the best in media and technology. We drive innovation to create the world's best entertainment and online experiences. As a Fortune 50 leader, we set the pace in a variety of innovative and fascinating businesses and create career opportunities across a wide range of locations and disciplines. We are at the forefront of change and move at an amazing pace, thanks to our remarkable people, who bring cutting-edge products and services to life for millions of customers every day. If you share in our passion for teamwork, our vision to revolutionize industries and our goal to lead the future in media and technology, we want you to fast-forward your career at Comcast.Military Experience Welcome!Bilingual skill set required (Spanish)Company Summary:Comcast brings together the best in media and technology. We drive innovation to create the world's best video and broadband experiences. We are focused on making customer experience our best product. As a Fortune 50 company, we set the pace in a variety of innovative and exciting businesses and create career opportunities across a wide range of locations and disciplines. We are at the forefront of change and move at an amazing pace, thanks to our remarkable people, who bring cutting-edge products and services to life for millions of customers every day.Xfinity Retail Store Summary:Our XFINTY Retail Stores represents a significant sales and service channel in the company serving over 30 million customers every year. Join us as we continue to evolve into a world-class national retailer, bringing together immersive in-store sales and service experiences. Our stores have always been a place where customers could find a friendly expert to help with routine service. Now we are so much more! Our stores have become a place where customers can experience our products and services in convenient locations. Additionally, customers can purchase the latest consumer electronics products that enhance home entertainment, home connectivity and their mobile experiencesPosition SummaryBeing the face of XFINITY, our Retail Sales & Service Consultants are responsible for assisting customers with all aspects sales and service ensuring an excellent customer experience. Using your knowledge, tools & technology along with a passion and desire to help; you will customize a unique solution to each customer.Product & service offerings include:XFINITY TVXFINITY InternetXFINITY VoiceXFINITY HomeEmployees at all levels are expected to:- Understand our Operating Principles; make them the guidelines for how you do your job- Own the customer experience-think and act in ways that put our customers first, give them seamless digital options at every touchpoint, and make them promoters of our products and services- Know your stuff-be enthusiastic learners, users and advocates of our game-changing technology, products and services, especially our digital tools and experiences- Win as a team-make big things happen by working together and being open to new ideas- Be an active part of the Net Promoter System-a way of working that brings more employee and customer feedback into the company-by joining huddles, making call backs and helping us elevate opportunities to do better for our customers- Drive results and growth- Respect and promote inclusion and diversity- Do what's right for each other, our customers, investors and our communitiesCore Responsibilities- Provide superior customer service with all customer interactions.- Deep understanding of XFINITY products and services; effectively inform and educate customers- Provide product demonstrations to illustrate to customers how XFINITY products and services improve the customers' lives.- Understand XFINITY products capabilities and how they outperform the competition.- Evaluate customer's potential product needs and tailor XFINITY solution to meet customer video, data, voice, and connected home requirements.- Set high standard by meeting or exceeding sales & customer satisfaction goals.- Support store operations including inventory, equipment transactions and payment activity.- Thrive in a fast paced, high-energy, rapidly changing environment.- Responsible for immersive customer onboarding experience ensuring the customer fully understands how to use XFINITY products and services including XFINITY Apps.- Complies with all operational policies and procedures and Comcast code of conduct- Completes all courses in the training curriculum.- Must be able to work a flexible schedule that includes evenings, weekends and certain holidays. May be asked to work in alternate XFINITY Stores outside of home base store. Regular, consistent and punctual attendance.- Require standing for extended periods of time servicing customers- Other duties and responsibilities as assigned.Key Qualifications- High School Degree or Equivalent- Generally requires 1-3 years related experience; prefer consumer electronics/wireless/telecommunications retail sales experience- Must enjoy interacting with people- Committed to providing world class customer experience- Warm & engaging-ability to develop rapport quickly- Positive, \"I can help you with that\" attitude- Genuinely curious about customer needs- Solution orientated- Strong communication skills- Consultative selling approach- Passion for technology- Desire to learn- Ability to excel in dynamic environmentComcast is an EOE/Veterans/Disabled/LGBT employer"}