{"jobID": "2827971731", "jobLocation": "San_Jose_CA", "jobTitle": "Associate Consultant Intern", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " HireIO, Inc. (HIO) is a leading executive search firm specialize in recruiting high profile talents in cutting-edge technology in United States. We have grown an exceptional team and excellent reputation. You will have great opportunity to work closely with our clients which are top tier companies between US and China. We are now opening for internship program for year of 2018!  This Associate Consultant Intern is expected to be working with our team based in San Jose to recruit high profile candidates. You will be working with a small team with an open culture to speak with Silicon Valley talents regarding their career interests, backgrounds, etc. Responsibilities: Analyze job requirements with clientsIdentify clients needs according to discussion with clientsAssist with job requisitions/job description developmentObtain a thorough understanding of job requisitions (i.e. KSAs, competitiveness, etc.) and conduct research when necessaryImplement sourcing strategies and identify potential candidatesSearch talents on websites (i.e. LinkedIn, Monster, Dice, etc.)Communicate with candidates and understand candidates skills and interestsSupport Consultants to conduct labor market researchAnalyze current talent poolConduct research and estimate compensation ranges for different level of positionsDesign market mappingMatch candidates with suitable positions and draft referral reportsMaintain the Applicant Tracking SystemCoordinate interviews in different time zonesCollaborate with clients recruiting team to continually improve processes and experienceProvide onsite support for recruiting events and forumsQualifications:Be interested in consultant Industry, particularly recruitingBe fluent in English and Chinese: you are expected to communicate with candidates and clients who only speak English or Chinese. Thus, English and Chinese fluency is a must. Be self-motivated and proactiveHave a high level of comfort and confidence around engineers, managers, executivesAsk questions and think why you ask those questionsBear the ability and comfort to multitask and prioritize your workBachelors degree, MBA or graduate degree preferredPreferred:Previous experience in a technical sourcing or recruiting role would be a plus. Be interested in / familiar with IT industry and ecosystem in China as well as in the Silicon ValleyPerks:Commission + Free Company LunchOpportunities to build your own network with Silicon Valley talents and leading Chinese Internet companiesWeekly case training and experience sharing from top talentsLots of opportunities to learn HR related skills, but in business, technology, finance, etc. Work-life balance: We would love to see a commitment to be onsite at our San Jose office on normal weekdays but take your time off when you need it. You will find fun and pleasure working with us!Job Type: Internship Education:"}