{"jobID": "2723087919", "jobLocation": "San_Francisco_CA", "jobTitle": "User Experience Writer Intern, Summer", "companyRating": null, "companyInfo": {"Website": "www.google.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (GOOG) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Apple, Facebook"}, "estimatedSalary": null, "jobDescription": "Applications are now closed. Please check back next year for 2019 opportunities.Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; New York, NY, USA; San Francisco, CA, USAAs a User Experience (UX) writer, you are an advocate for Google design, working to shape product experiences by creating useful, meaningful text that helps users complete the task at hand. You help set the vision for content and drive cohesive product narratives across multiple platforms and touchpoints. As a stellar writer, you have a portfolio of work which demonstrates content that simplifies and beautifies the overall user experience.  You work with people in a variety of UX design-related jobs including researchers, product managers, engineers, and marketing and customer operations personnel. Collaborating with each, you strive to establish cohesive language and a unified voice across products and platforms. You regularly use empathy, logic, and hard data to inform content choices, and are an expert in your product. You provide content recommendations that include the right words and sometimes complementary data and images.  Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From AdWords to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another. Responsibilities Write clear, concise user-interface text for products.Develop a vision for product content across a given domain. Ensure tactical execution to drive cohesive product narratives across all digital touch points within the product (and work with marketing and operations on touch points outside the product).Collaborate with designers, researchers, prototypers, product managers, and engineers to define requirements.Develop concepts for early stage products. Provide data-informed insights to improve existing experiences.Help coordinate translations, improve writing tools and processes, format documents, and generally assist as needed to produce world-class software and hardware products. Qualifications Minimum qualifications:"}