{"jobID": "2829398825", "jobLocation": "Jersey_City_NJ", "jobTitle": "Machine Learning Intern", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " !!!!!!!!!!!!!!!!!!Freshers with Masters in Data Science and GPA > 3.5 Welcome to Apply!!!!!!!!!!!!!!!  Please note that we are considering U.S Citizens and Green card holders only at this point.  As a Data Scientist Intern(Data Science Freshers welcome to Apply): This is an exciting opportunity to learn modelling in data science (normally experienced guys get to do it) hands-on while working with domain experts in finance and helping them solve the problems. you will participate in our agile development lifecycles by assisting with new development, software bug resolution and envisioning new and exciting ways to leverage Tobin data. Your day-to-day work will consist of participation in our agile software development process, ensuring critical operational issues are addressed quickly and effectively, and you will need to be innovative in how to analyze/clean a wide variety of data. Additionally, you will need to have knowledge of machine learning, advanced statistics, and mathematical model development.Skills (Required):Masters degree in Analytics or Data Science with GPA > 3.5- Strong Academic Java knowledge is required (Core Java)Strong technical knowledge/experience including:Machine Learning/Deep LearningMulti-variate linear regression, SVM's and SVR'sStochastic Modeling - Markov ChainsOptimization (Discrete and/or Continuous)Cleaning of noisy/incorrect/sparse dataDevelopment experience a plus - skills include:R based rapid prototypingPythonJava(Preferred)Knowledge of Agile development practicesStrong technical, analytical, and problem-solving skills including data qualitySelf drive to persist with challenging problems and ability to think out of the boxAbility to work in a fast-paced environment, meet deadlines, and deliver on scheduleJob Type: Contract  Salary: $45.00 to $50.00 /hour Education:"}