{"jobID": "2829551875", "jobLocation": "San_Jose_CA", "jobTitle": "Medical Technologist - Clinical Laboratory Scientist - (Med Tech - MT - CLS)", "companyRating": null, "companyInfo": {"Website": "www.clubstaffing.com", "Headquarters": "Boca Raton, FL", "Size": "201 to 500 employees", "Founded": " 1999", "Type": " Subsidiary or Business Segment", "Industry": " Health Care", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Description & Requirements Medical Technologist - Clinical Laboratory Scientist - (Med Tech - MT - CLS)  StartDate: 07/16/2018Available Shifts: 8 N Pay Rate: $31.00 - 36.00  SHIFT: 11p-7a  Required Qualifications  CLS with active CA license. 2+ years of experience and 50 mile radius rule. ASCP required, California CLS license required. Special Skills/Experience Required: Clinical laboratory experience. Typical Procedures Performed: See Job Description. Equipment Type: Meditech (LIS), Beckman Coulter, Ortho Vitros 5,1 (or greater)  Preferred Qualifications  START DATE: 07/16/2018 for 13 weeks Facility Location Ranked as the fifth most popular place to live in America, its no wonder that traveling health care professionals enjoy packing their bags for San Jose. Once a sleepy orchard town, the prosperity of Silicon Valley has transformed this area into a thriving city of fine restaurants, great shopping, world-class arts and culture, a state-of-the-art light-rail system and plenty of big-city excitement. Job Benefits Allied travel assignments are typically for 13 weeks and offer generous packages that include:  Competitive pay rates Medical, Dental, Vision 401(k) and Flex Spending Life Insurance Accident and Short-term Disability Coverage Free Continuing Education Free Private Housing Refer a friend and earn extra cash!About the Company Club Staffing, an AMN Healthcare company, is the leader in allied healthcare staffing, with thousands of travel positions available throughout the United States. We are dedicated to meeting the unique needs of each allied healthcare professional; whether it's travel, per diem, temp-to-perm, or permanent. We also offer more therapist, laboratory and medical imaging jobs in more places than other travel companies. AMN Healthcare is an EEO/AA/Disability/Protected Veteran Employer. We encourage minority and female applicants to apply.  medical technologist, clinical laboratory scientist, medical tech, clinical laboratory technologist, medical laboratory technologist, laboratory, clinical laboratory tech, allied, allied health"}