{"jobID": "2830932575", "jobLocation": "Sunnyvale_CA", "jobTitle": "Senior Software Engineer", "companyRating": "2.9", "companyInfo": {"Website": "www.microfocus.com", "Headquarters": "Newbury, United Kingdom", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (MCRO) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " SAP, EMC, Oracle"}, "estimatedSalary": "113000", "jobDescription": " At Micro Focus, everything we do is based on a simple idea: The fastest way to get results is to build on what you have. Our software solutions enable organizations to do just that. Secure and scalable, with analytics built in, they bridge the gap between existing and emerging ITfast-tracking digital transformations across DevOps, Hybrid IT, Security, and Predictive Analytics. In the race to innovate, Micro Focus customers have the clear advantage.  Our portfolio spans the following areas: DevOps | IT Operations| Cloud | Security | Info Governance | Big Data, Machine Learning, & Analytics Take charge of your future and join our dynamic Digital Center of Excellence Engineering team as we go to market with a best-in-class portfolio that will help shape the worlds software landscape About the Role Take charge of your future and join our dynamic and motivated engineering team building web applications, CMS and services as the face of entire Micro Focus go to market with best-in-class portfolio and creating an impact on its Digital Marketing strategy in the true DevOps sense of build, own and run your own software. The Senior Software Engineer will:Lead, inspire and influence group of talented engineers to build/maintain the software system.Take ownership and responsibility to execute the product roadmap and vision along with defining and evolving the next generation web content management software and tools.Full hands on to build WEB and CMS based applications to be deployed in the cloud and delivering software components for the WEB platform.Collaborate with engineers, product management and XD teams to create solutions that increase the platform's value.Create technical specifications, prototypes and presentations to communicate your ideas.Content Management and User Management.Education and ExperienceDegree in Computer Science or a related field with 6+ years of experience.Skills and KnowledgeFull hands on and Ability to develop software in PHP, NodeJS, HTML/JS and JAVA.Experience in building and owning highly available web content managements systems, web components & platform integration services, and user management systems.Experience in creating enterprise class MVC applications, API Integrations, and good understanding of Service Oriented Architecture concepts (SOA) and micro services.Exposure to DRUPAL CMS, Dockers and JenkinsExposure to cross-application integrations, authentication and authorization (SSO).Strong coding skills, including understanding of optimization, performance needs, OOD design and product quality.Well versed in test-driven development practices and Automation including Selenium and mock frameworks to maximize code quality early.Ability to execute project deliverables within agile and scrum methodologies.Highly motivated and extreme sense of ownership and responsibility towards project needsNice to Have: Strong architectural skills in building MarketPlace, Application Add-On platforms & eCommerce integrations. User management systems responsible for authentication and authorization. If you want to be part of what's next and find out more about our available opportunities, visit Micro Focus Careers.  #LI-SD1"}