{"jobID": "2684800295", "jobLocation": "New_York_NY", "jobTitle": "Receptionist", "companyRating": null, "companyInfo": {"Website": "www.deshaw.com", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " 1988", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Citadel, Renaissance Technologies LLC, Two Sigma"}, "estimatedSalary": null, "jobDescription": " The D. E. Shaw group is a global investment and technology development firm with more than $41 billion in investment capital as of January 1, 2017, and offices in North America, Europe, and Asia. We offer a collegial work environment and high-caliber colleagues from diverse backgrounds—everything from mathematicians and computer scientists to philosophers, musicians, and journalists. Our culture combines some of the best aspects of academia, finance, and technology. We pride ourselves on adhering to the highest standards of ethics and performance, but in our offices you’ll see more flip-flops than suits—we have no dress code, and our meritocratic culture gives employees the opportunity to make significant contributions early on in their careers. If you’re intellectually curious, energized by ambitious goals, and willing to take on a new challenge, we’d like to hear from you.  The D. E. Shaw group seeks an intelligent, articulate, proactive, and resourceful individual to join its reception team. Primary responsibilities will include general receptionist duties such as greeting external guests, helping manage the firm’s main phone line, helping oversee the firm’s conference rooms, and providing general administrative support as needed.  The ideal candidate will be a strong team player and will be able to handle confidential information with the utmost discretion. A Bachelor’s degree is required, as are strong writing, communication, organizational, problem-solving, and interpersonal skills. A steadfast sensitivity to detail is imperative, and familiarity with the Microsoft Office suite (particularly Microsoft Outlook) is a decided plus.  Interested students should apply directly through our website at:  https://www.deshaw.com/recruit/jobs/Ad/Glassdoor  The Company is an equal employment opportunity employer. We do not discriminate against any applicant, employee, or former employee on the basis of race, color, religion, gender, gender identity, pregnancy, national origin, age, military service eligibility, veteran status, sexual orientation, marital status, disability, or other category protected by law. All employment-related decisions are based solely on legitimate non-discriminatory business reasons."}