{"jobID": "2693796581", "jobLocation": "New_York_NY", "jobTitle": "Communications Intern", "companyRating": null, "companyInfo": {"Website": "www.artsy.net", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Communications Intern will support Artsy’s efforts to develop and grow the company’s public profile through press placements, speaking engagements, media relations, and internal communication initiatives. As the Communications Intern, you will develop invaluable messaging and branding skills, hone your written and interpersonal skills, and learn about the inner-workings of the art market. The Communications team interfaces with all team members at Artsy and supports each area of the business, so you will have an opportunity to get a 360º view of a dynamic—and rapidly growing—art and tech company.KEY RESPONSIBILITIES: Conducting research on target journalists, media outlets, and speaking engagementsTracking and circulating mentions of Artsy in the pressServing as first line of communication for people reaching out to Artsy’s press team through management of Artsy press inboxLeading development, organization, and maintenance of internal messaging resources for the Artsy teamProviding key programming and production support for team-wide bi-quarterly All Hands meeting and other internal communication events KEY QUALIFICATIONS:Our ideal candidate is a self-starter and enjoys exploring new challenges and working with new people. You are passionate about Artsy’s mission and business, and curious about the art market. You proactively seek out learning opportunities, both big and small. Outstanding writing and communication skillsMeticulous attention to detailExperience interfacing with important stakeholders in person or via emailPassion for storytellingKnowledge or experience in the art world and/or art market, a plus TO APPLYThis position is full-time and starts immediately in our New . To apply, please submit your resumé and a cover letter here.ABOUT ARTSYArtsy is a global platform for collecting and discovering art.  We think of Artsy less as a business with employees, and more as a community of people who have chosen to work together towards a common goal, and who share a common set of values.  Artsy empowers a global audience to learn about, discover, and collect art. We partner with leading museums, international galleries, auction houses, and art fairs to create the world’s largest marketplace for art, enabling the growth of the entire art market by effectively connecting supply and demand at a global scale.WHY ARTSYAt Artsy there are no specific work hours or policies, no pointless bureaucracy. We only care that you achieve inspiring results and are a joy to work with. This means you must be highly energetic, enthusiastic, and resourceful—no problem is too big or too small for you to tackle. You will enjoy both responsibility and autonomy in your work.WORKING AT ARTSYArtsy has five core values that will inform your experience at Artsy. Art x Science: We believe in uniting empathy with logic, emotion with data, and intuition with research in everything we do. Whether in business strategy or design, culture or code, we seek the magic that happens when the often separate worlds of art and science come together. People are Paramount: We spend extraordinary energy finding the best person for a job—and once found, we give them the trust and autonomy to be CEO of their role. We avoid pointless bureaucracy and prefer to empower people with information rather than limit them with process. Quality Worthy of Art: We aim to create an experience worthy of all the world’s art and so hold ourselves to the highest standards in all our work. We believe that the best long term quality comes from rapid shipping, iterating, and learning as we go. Positive Energy: We know positivity and optimism benefit our work, and we harness positive energy as a vehicle towards greater awareness, growth, and collaboration. We believe in cultivating a positive relationship to art as opposed to one based on exclusivity or scarcity. Openness: We believe in being open with each other and the world—whether in open-sourcing our code, sharing feedback, or building a diverse and inclusive work culture. We believe in bringing our full selves to work and manifesting an open world where everyone has access to art. Artsy is an equal opportunity employer. We value a diverse workforce and an inclusive culture. We encourage applications from all qualified individuals without regard to race, color, religion, gender, sexual orientation, gender identity or expression, age, national origin, marital status, disability, and veteran status."}