{"jobID": "2803185902", "jobLocation": "Redwood_City_CA", "jobTitle": "Senior Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.shopkick.com", "Headquarters": "Redwood City, CA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "121000", "jobDescription": " Shopkick is the most engaging rewards program, with an enthusiastic community of users who spend more time in-app and web than any other shopping experience. For consumers, we bring moments of joy to everyday shopping, dining, and leisure activities by offering fun ways to earn rewards (that we call kicks). They are similar to points in a mileage rewards program and can be redeemed for a wide variety of gift cards. For brands and retailers, we drive sales by providing high consumer engagement along the entire path to purchase--without the use of margin dilutive coupons. Our unique pay for performance model has been proven to deliver high ROI, driving incremental traffic, visits to shelves and stores, and sales across platforms: online, mobile and in-store. Some of our leading partners include Best Buy, Clorox, Coty, GSK, Georgia Pacific, Marshalls, Nestle, Purina, TJ Maxx, and Unilever, among others. Shopkick is available for free on the iPhone from the App Store and for Android on Google Play.  We are in search of a detail-oriented Senior Data Analyst to join our Analytics & Data Science team. If obscure Excel functions permeate your dreams, or you view your life as a series of complex joins, then this might be the role for you. You will be responsible for supporting our various product and business teams in making better decisions. Essential duties and responsibilities may include, but are not limited to: Work with product and business owners to define actionable reporting and visualization requirementsImplement and scale the tools, systems and processes for delivering data and insights to the relevant stakeholdersChallenge assumptions and push teams towards the right questions to ask, and then deliver the right answersTake the initiative to find patterns and propose experiments against core product and business goalsQualificationsThe confidence to make quick decisions and the courage to fail forward in doing soAt least 4 years of experience as a product or data analyst. Experience with both consumer and advertising technologies is a big plusThe ability to teach a masterclass in query writing and data visualization, with an emphasis on choosing the best approach and tools for the jobExperience writing complex queries on Google Cloud Platform (GCP) is a big plusComfort working in scripting languages such as Python and RStrong understanding of hypothesis testing and experiment designComfort dealing with an environment of organized chaos and quick, reversible decisionsA Bachelor's degree in Statistics, Mathematics, Economics (quantitative) or equivalentStories to tell of the impact you have had on other products and businesses in your careerAny unsolicited resumes/candidate profiles submitted through our website or to personal email accounts of employees of Shopkick are considered property of Shopkick and are not subject to payment of agency fees."}