{"jobID": "2802535024", "jobLocation": "New_York_NY", "jobTitle": "Intern, Marketing Science", "companyRating": null, "companyInfo": {"Website": "www.annalect.com", "Headquarters": "New York, NY", "Size": "201 to 500 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job DescriptionAs every CMO knows, employing  technology, data and analytics to business challenges is the cost of entry, not  a nice to have. Unlocking the value of consumer data can deliver growth,  revenue and ROI, and create differentiation to stay on top. Real-time action is  instrumental in driving results within a highly fragmented marketplace.  Annalect’s data solutions are built to deliver insightful results with speed,  accuracy and a single version of the truth. In leveraging the DNA of a  marketing agency with a talent pool of developers, data scientists and PhD’s,  we hold a unique position in the increasingly crowded ad tech and consulting  space.  Join our dynamic and diverse team  at Annalect – data solutions for marketers, by marketers.  Position  Overview:  As an Intern of our Marketing  Science Team, you will be tasked with aiding in the transformation of vast data  sets into compelling and actionable insights and story. At Annalect, you will  be working in a fast-paced environment at the forefront of marketing  technology, data and advertising. Our goal is to help our Agencies and  Advertisers understand the impact of their marketing. Our expertise is applied  across the Omnicom Group to help boost advertising effectiveness and  efficiency.Key Responsibilities:Steward data  collection from various third-party platforms and analytics toolsCollaborate with  Marketing Science teams on audience insights generation using 1st, 2nd  and 3rd party dataTranslate data  into clear, compelling, and actionable insightsIdentify  opportunities to continuously improves processesHelp size and  define audiences using a variety of data and toolsEnsure timely  follow through on all scheduled and ad hoc deliverablesWith the leaders  of the functional specialty teams, keep track of projects being run by the  Functional Specialists to ensure they are done on time and to right level of  qualityDevelop of  presentations to stakeholders, including the results of analyses and research  projects in a clear and insightful narrative, digestible by a lay personEducation & Experience:Working on attaining a Bachelor’s degree  in advertising/communication, business/marketing, statistics, mathematics,  economics, engineering, information management or related fieldsThe ability to  strategically evaluate a set of circumstances and assist in the application of  solutionsAbility to work  in a team environment and share in the work to achieve team goalsProficiency in  written and verbal communicationUnderstanding of  Microsoft OfficeIt’s a plus if you have:"}