{"jobID": "2261913584", "jobLocation": "New_York_NY", "jobTitle": "Director of Brand Development", "companyRating": "4.3", "companyInfo": {"Website": "www.fancy.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "108000", "jobDescription": " Fancy (www.fancy.com) is the place to discover, collect and buy from a crowd-curated catalog of amazing goods, wonderful places and great stores. Fancy is an innovator in mobile commerce with an award-winning app.  The Brand Development team represents Fancy in the brand community by ensuring our lifestyle brands are successful on our platform. This is a unique opportunity for someone with a background in media, fashion or branding to drive high impact in a fast-paced innovative social e-commerce company. Responsibilities:Strategically identify and close new brandsGenerate leads and uncover high-value partnership opportunitiesLead deal negotiation parametersCreate execution details for brand partnersEnsure overall long term brand partnership successDesired Skills and Experience:BA/BS degree or equivalent5-8+ years experience in a fast-paced enterprise sales, partnership or business development roleHigh professionalism, with demonstrated ability to leadExcellent persuasive verbal and written communication skillsExcellent quantitative thinkingExcellent relationship skills you are a team player and have experience effectively collaboratingYou:Are active on and passionate about FancyAre goal and action oriented with the ability and desire to word towards revenue targets within a team environmentAre forward-thinking and solutions-orientedAre ambitious and optimistic you are not afraid to dream big and push the boundariesAre creative and have a high level of initiative and self motivationConvey excitement and passion in everything you doLove a good challenge and are excited about going outside of your comfort zone"}