{"jobID": "2823609535", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Scientist (Partner Services)", "companyRating": "4.2", "companyInfo": {"Website": "www.factual.com", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Foursquare"}, "estimatedSalary": "159000", "jobDescription": " Data Scientist (Partner Services) Los AngelesAt Factual we love all things data! Our mission is to organize and interpret the world’s location information. As a Data Scientist on our Partner Services team, you will have the opportunity to work directly with our customers to query, filter, aggregate, analyze, explain, and visualize what is happening in the physical world.About you:You are a data scientist who knows the tools and algorithms to analyze data, and understands how to find its shape and underlying structure. Working on the Partner Services team, you’ll apply analytics to bridge the gap between Factual’s established products and the huge variety of questions we’re trying to answer. You are a skilled communicator that will provide compelling and appropriate explanation and guidance to critical existing and potential customers. You have strong engineering experience and enjoy working in a rapidly changing environment. And most of all: you ship.What you’ll do:Analyze, interpret, and solve a range of location data problemsDesign experiments and work with fellow engineers to ensure thoroughness and correctness on a variety of analysesUse and provide feedback to our data processing software and frameworksDevelop visualizations based on bespoke data analysis challengesAuthor specifications and lead technical projectsPropose creative strategies based on data-driven insightsWhat we’re looking for:Deep understanding of machine learning concepts and algorithms - particularly classification, clustering, and supervised learning.Expertise with Python/Scala/JavaFamiliarity with distributed programming with Spark or MapReduceApplied knowledge of Statistics (we really value people who can handle uncertainty and variance)Willingness and ability to wrangle messy dataAn advanced degree in a quantitative field (Math, Statistics, Computer Science)Excellent oral and written communication skillsIndustry experience maintaining production data pipelines and using data science to solve business problems is a plusCover letters will be greatly appreciated! Thanks!Apply for this JobRequired First Name * Last Name * Email * Phone Resume/CV  AttachPaste Cover Letter  AttachPaste LinkedIn Profile Website How did you hear about this job?"}