{"jobID": "2759835137", "jobLocation": "San_Diego_CA", "jobTitle": "Research Intern (Part time)", "companyRating": "3.4", "companyInfo": {"Website": "www.hjf.org", "Headquarters": "Bethesda, MD", "Size": "1001 to 5000 employees", "Founded": " 1983", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "50000", "jobDescription": "Updated: YesterdayJob ID: 213870Status: Part-TimeRegular/Temporary: TemporaryLocation: San Diego, CA, United StatesJoin the HJF Team!HJF is seeking a Research Intern to support the Deployment Health Research Center located at the Naval Health Researd Center (NHRC) in San Diego, California. HJF provides scientific, technical and programmatic support services to NHRC.  The candidate will help to input, update, and maintain study participant information in our company databases and computer systems. Research Intern responsibilities include collecting and entering data in databases and maintaining accurate records of valuable participant information. Our ideal candidate has essential data entry skills, like fast typing with an eye for detail and familiarity with spreadsheets and online forms. You will work with a data entry team and study coordinator.Responsibilities:  Transferring data from paper formats into computer files or database systems. Typing in data provided directly from study participants. Scan surveys and verify data for assigned research study. Verify data by comparing it to source documents Retrieve data from the database or electronic files as requested. Organize paperwork after entering data to ensure documents are filed appropriately. Creating spreadsheets with large numbers of figures without mistakes. Retrieves bundled mail from the Postal Office. Performs related duties as assigned or as the situation dictates.Job Specifications: Required Knowledge, Skills, and Abilities: Working knowledge of office equipment and computer hardware and peripheral devices. Good command of English both oral and written and customer service skills Great attention to detail. Fast typing skills with little to no errors. Skilled in alphabetizing with a filing system. Skilled in use of word processing, spreadsheet, email, database, and scanning software. Ability to make presentations to groups. Ability to plan and prioritize work. Ability to self-start and work independently. Ability to interface with investigators, research staff, and study participants.Minimum Education/Training Requirements: This position requires the equivalent of a High School degree with 6 months - 1 year related experience. An Associate's degree with 0-2 years related experience is preferred, but not required. Physical Capabilities: Walking, standing, must be able to read reports, labels and use computer, must be able to hear well enough to communicate with coworkers, must be able to write, type, and use phone system. Must be able to lift 10 lbs. Supervisory Responsibilities/Controls: n/a Security Clearance: It is a condition of employment with the Naval Health Research Center that you undergo a favorable National Agency Check with Local Agency and Credit Checks (NACLC) investigation which will include being fingerprinted. If a favorable NACLC is not received, your employment with the Foundation would terminate.HJF is an equal opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status."}