{"jobID": "2796566996", "jobLocation": "San_Jose_CA", "jobTitle": "Director of User Experience Research", "companyRating": "3.4", "companyInfo": {"Website": "www.netgear.com", "Headquarters": "San Jose, CA", "Size": "501 to 1000 employees", "Founded": " 1996", "Type": " Company - Public (NTGR) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "129000", "jobDescription": "Director of User Experience Research The Director of User Experience Research is a key strategic hire for ARLO. This individual will infuse the voice of the user throughout every ARLO product and make it a standard part of our UX, software development, and product design process. The Director will start by building a User Research practice and will be responsible for primary research techniques such as usability testing, community research, establishing segmentations and personas, cognitive walkthroughs and mental models, observational research, analytics and mobile ethnographies to understand user behavior to validate, inform, and guide the various product experiences within the ARLO product portfolio. This is a key role that will become a trusted, strategic partner to design and product stakeholders as well as executives by delivering insights that lead to demonstrable business value.  The ideal candidate is a hands-on self-starter who can quickly ramp up basic research processes and is a seasoned User Research professional who can help build out mature research practice for ARLO. The Director of User Experience Research is a full-time position in San Jose, reporting directly to the SVP of Design and Experience. ResponsibilitiesPlan, Design, and Conduct qualitative and quantitative user research studies, and moderate 1:1 usability sessions.Work with the UX team and other stakeholders to analyze findings and deliver innovative, actionable insights.Develop, through research dashboards and reports, forecasts, surveys, and presentation findings.Conduct in-lab and field usability evaluation of products & prototypes and competitive analysis.Inform ARLO with high-quality analysis and research, providing Product Management and Design teams with data driven insights that will help influence future customer experiences.Partner and collaborate on UX design research insights and UT findings with marketing, product management, product design and consumer research.Design better behavioral metrics to help improve ARLO experiencesIdentify and set up relationships with agency partners and key vendorsDevelop longitudinal research plans to continuously monitor design features across all ARLO products.Proactively involve designers, engineers, product managers and executives in the research process.Required Skills and ExperienceSelf-starter with 7-10 years of experience in user research/cognitive science with a proven track record of utilizing research and analytical skills to draw valid conclusions and robust insights.Able to understand the needs of product and UX teams and translate them into a research plan.Proven knowledge and experience with a wide variety of qualitative and quantitative research methods.Strong working knowledge of statistics and Experimental Design.Must be an effective communicator/collaborator who can handle multiple projects, tight deadlines and work well in fast-paced, entrepreneurial environment.Strong understanding of UX design principles and design thinking process (human centered design).Product design or software UX experience, ability to solve problems, strong written and verbal skills, management skills, strong organizational skills and deep empathy for customers.Ability to collaborate across functional areas."}