{"jobID": "2813262201", "jobLocation": "New_York_NY", "jobTitle": "Investment Analyst(intern)", "companyRating": "3.4", "companyInfo": {"Website": "www.jacobs.com", "Headquarters": "Dallas, TX", "Size": "10000+ employees", "Founded": " 1947", "Type": " Company - Public (JEC) ", "Industry": " Construction, Repair & Maintenance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Fluor, Bechtel, AECOM"}, "estimatedSalary": "57000", "jobDescription": " We are looking for an entry-level Investment Analyst (Intern) to work with the Investment Management team. Ideal candidates must be self-motivated, well-organized, team-oriented, with strong technical, analytical, and communication skills to provide precise analysis effort and present information that assist team with underwriting. Responsibilities: Support research and communication of findings on macro trends,market considerations;Assist in deal execution, and on-going portfolio management;Conduct due diligence for potential new investments, including market research and analysis of industry trends, financial modeling, and valuation;Develop detailed financial models for financing;Analyze operational forecasts and budgets for active and potential investments;Prepare presentation materials for the firm and its portfolio companies;Conduct company-specific due diligence and valuation analysis, input and maintenance of investment models, portfolio data and supporting analytics;Maintain cordial cooperative relationship with brokers, investment bankers and target company management teams;Monitor investment holdings, exposure forecasting, valuation input and post investment management.QualificationsBachelor's Degree or above in finance, accounting, business, economics or other related fields;Passion in VC/PE industry;Strong collaboration, coordination and facilitation skills;Excellent verbal and written communication skills;Outstanding analytical skills, detail-oriented, proactive and self-motivated;Strong project management, process management, and organizational skills- Previous work experience in any of these fields: capital markets, investment banking, private equity, real estate, management consulting is highly preferred;Strong financial knowledge. Strong analytical and quantitative skills including financial model construction, data manipulation, valuation;Full proficiency in PowerPoint and Excel. Mandarin is preferredJob Type: Full-time  Job Type: Full-time"}