{"jobID": "2753042363", "jobLocation": "Boston_MA", "jobTitle": "Sr. Healthcare Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.unitedhealthgroup.com", "Headquarters": "Minnetonka, MN", "Size": "10000+ employees", "Founded": " 1977", "Type": " Company - Public (UNH) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Aetna, Humana, WellPoint"}, "estimatedSalary": "72000", "jobDescription": " Innovation. Adaptability. A passion for analytics and problem solving. If those traits brought you here, this opportunity can take you much further. Optum is serving the health care marketplace with the information tools and analytics solutions that will fuel change going forward. We are well past big data. In fact, we are using great data to uncover new solutions and novel marketplace opportunities. If you thrive on making an impact in an evolving market, we should be talking. Join us and help shape history. You'll help us improve the lives of others while doing your Life's Best Work (tm).  We are currently hiring a Senior Healthcare Data Analyst in the Life Sciences division of Optum. As a Healthcare Data Analyst, you would work as a part of our Life Sciences Data & Tools team. In this position you will play a key role in the transformation of vast amounts of clinical data into meaningful datasets that provide key actionable insights. You will stretch your skills and grow your career as a primary contributor and gain experience in big data. You will be working with a product which is poised for incredible growth and which is essential for advancements in healthcare.  Our work is challenging, our opportunity is huge, and we are looking for people who enjoy working hard with enthusiastic teammates.  The ideal candidate must have a demonstrated aptitude and enthusiasm for solving data problems and analyzing (not just manipulating) data to provide key insights and must have a strong orientation toward teamwork. Primary Responsibilities: Work closely with our external and internal stakeholders  Gather and understand requirements from Data Delivery, Client Services and Tools teams  Work with data onboarding, clinical informatics and NLP teams to help shape and/or improve data quality and content to satisfy Life Sciences requirements  Conduct data exploration, solve data problems, and execute algorithmic data processing using SQL  Understand unique characteristics of different EMRs as it relates to meaningful assimilation of data  Provide specifications to Data Warehouse team for implementation in customer deliverables with an eye towards data integrity, and user-friendly, research-conducive, accurate representation of data"}