{"jobID": "2437088878", "jobLocation": "New_York_NY", "jobTitle": "Insurance/Financial Advisor", "companyRating": null, "companyInfo": {"Website": "www.lenoxadvisors.com", "Headquarters": "New York, NY", "Size": "201 to 500 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Who we are: Lenox Advisors is a premier wealth and insurance advisory firm providing solutions for high net worth individuals and their families. We are professional fiduciaries with an entrepreneurial spirit. For our professionals, that means keeping our clients at the center of everything we do while also maintaining a collegial and collaborative environment in which everyone can contribute, develop relationships and further build their business.  With a national footprint, Lenox is continually looking for ambitious, experienced Sales Professionals, who will be responsible for developing new client opportunities across the wealth management spectrum including insurance, asset management, risk management, estate planning, retirement planning, children’s college education, etc. What you’ll be doing:Proactively establish, develop and maintain strong client relationships through regular contact and by providing timely, value-added information, advice and recommendations.Engage with several new and existing clients every day to understand their long term goals and objectives and their short term needs, present customized recommendations, offer advice and complete sales.Build client loyalty by providing an exceptional client experience through delivering trusted advice resulting in earned referrals from your clients and friends.Network regularly with existing clients and referrals in order to build relationships and gain referral business.Be your clients’ main point of contact and accountable for responding to their questions and concerns.Be part of a broader team all working together to build client loyalty through a “one team” approach.What we’re looking for:The Lenox brand represents a caring, creative and passionate family of professionals. It’s important that your values align to ours – trust, team work and accountability.A passion for client service. You enjoy talking with clients and are interested in getting to know them and helping them achieve their goals.Well-developed interpersonal and communication skills including the ability to quickly engage and connect, actively listen, empathize, ask questions and respond in language that clients understand.Well-developed relationship building and presentation skills sufficient to convey detailed information requiring interpretation to highly knowledgeable clients, professionals and business groups within the community.Developed knowledge of insurance and investment solutions.Minimum two to five years of experience in sales with a proven track record.State Variable Life & Health License and FINRA licensing including Series 6 or Series 7, Series 63."}