{"jobID": "2754696687", "jobLocation": "Santa_Clara_CA", "jobTitle": "Senior Demand Planner", "companyRating": "3.7", "companyInfo": {"Website": "www.marvell.com", "Headquarters": "Santa Clara, CA", "Size": "1001 to 5000 employees", "Founded": " 1995", "Type": " Company - Public (MRVL) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "119000", "jobDescription": "SummaryThe Demand Planner will manage the demand planning activities within the supply chain planning functions in Operations and will ensure key performance indicators are measured and improved to meet the corporate goals. He/she will work closely with business units, sales, finance and other operations teams to ensure that operational metrics on demand, delivery and inventory are achieved and maintained.ResponsibilitiesResponsible for maintaining accurate demand forecast for the business unitDrive quarterly BU/Sales/Finance consensus on demand forecast and build planAssemble and analyze all data pertinent to creating the forecast (bookings, customer lead times, historical sales, market trends, sales forecast)Create targeted forecasting techniques for various customer and product segmentationsDrive quarterly review of product portfolio for product discontinuance and new product rampsOwn and improve forecast accuracy and bias metrics. Drive root cause/corrective actions to improve performanceSet up appropriate buffer stocks to balance the supply chain delivery and inventory goalsReview wafer starts plan and assembly loads plan weekly to drive balance between delivery and inventoryOwn customer on-time delivery metric and analyze root cause/corrective actions to achieve target goalsQualificationsTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements includeBS/BA in Business Administration, Engineering, Finance, Economics or Operations. MBA/MS preferred3-5 years of related job experience. Semiconductor experience a strong plusGood communication and self-starterStrong reporting and analytical abilities, detail orientedExperience using advanced planning systems. Statistical software packages a plusProficient in MS Office (Word, Excel); advanced Excel skills are a must"}