{"jobID": "2800742480", "jobLocation": "San_Francisco_CA", "jobTitle": "Marketing Analyst Intern", "companyRating": "4.1", "companyInfo": {"Website": "www.fundbox.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "51000", "jobDescription": "Fundbox is looking for a Marketing Analytics Intern to join us this summer for exciting projects. This role will work very closely with marketing and analytics on meaningful analyses that will help us understand our customers and prospect behavior. In this role you will: DEVELOP in-depth understanding of various types of marketing campaigns and their evolution over time at fundbox.PARTNER closely with marketing, analytics, and data teams to define problem statements and plan analyses that deliver clear answers.UNDERSTAND various success metrics across the funnel and use them to analyze past campaignsTRANSFORM data into useful business insights that can be used to drive future marketing strategy Job Requirements Love of data: You should feel empowered by the presence of data and be comfortable getting your hands dirty.Basic understanding or familiarity of web analytics and A/B testing.Passion for learning and ability to deal with ambiguityAble to communicate incisive insights in a succinct fashion – verbally and visually.Familiarity with SQL and/or other databases.Pursuing BS / MS in Computer Science, Mathematics, Statistics, Economics, or MBA/BBA with strong analytical focus.Experience using Tableau or other software for data exploration & visualization is strongly preferredFamiliarity with R / Python is a plus. Fundbox background  The Fundbox story began when a co-founder’s mother couldn’t solve cash flow problems to grow her small business. That set us off on a journey to level the playing field for small businesses by providing them with financial tools that never existed before. We do this by combining cutting-edge deep learning and data science technologies with outstanding design. Fundbox has raised over $100 million in capital from leading Silicon Valley investors such as Jeff Bezos, Khosla Ventures, General Catalyst Partners, and Spark Capital. Fundbox has offices in downtown San Francisco and Tel Aviv, Israel.  San Francisco Office  The Fundbox San Francisco office is located in the heart of downtown, minutes walk from public transportation, great restaurants, and everything that San Francisco offers. Our space is open, modern, and well-appointed, with a fully-stocked kitchen, free drinks and snacks, and gourmet lunches delivered daily. We offer a choice of health, dental, and vision plans, 401k, fitness reimbursement, and commuter benefits. We take our jobs seriously, but we also know how to have fun, with sponsored social activities and plenty of opportunities to celebrate our achievements!"}