{"jobID": "2794086556", "jobLocation": "New_York_NY", "jobTitle": "Hospice Care Planner (RN)- $7,500 Sign On Bonus!!!", "companyRating": "3.6", "companyInfo": {"Website": "www.mjhs.org", "Headquarters": "Brooklyn, NY", "Size": "1001 to 5000 employees", "Founded": " 1906", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "44", "jobDescription": "Do you have a \"Hospice Heart\"? If your answer is yes, then you are just the nurse we are looking for. When days cannot be added to a life, we add life to remaining days. Our multidisciplinary teams offer culturally-sensitive, end-of-life and palliative care services to patients and their families at home or in assisted living communities, skilled nursing facilities and hospitals. Ask About Our Sign On Bonus!!! Working at various facilities including hosptials, nursing homes and clinics in an assigned territory, the Hospice/Palliative Home Care Planner is responsible for evaluating and establishing a plan of care for patients referred for home health services. The Planner will facilitate admission of referrals upon discharge from the hospital to a home care or facility program that meets the needs of the patient and family members. As a key member of the business development and marketing team, the Hospice/Palliative Home Care Planner develops and maintains positive relationships with physicians, social workers, case managers and discharge planners at the assigned locations.  home care, nursing, RN, homecare, nurse, hospice, home care hospice, hospice nurse, hospice rn Licensed with current Registration to practice as Registered Professional Nurse in NYS is requiredBachelor's Degree preferredTwo years nursing experience in a hospital setting, preferrably in the emergency room, critical care, oncology or telemetry with proficiency in physical assessment and interviewing skillsBusiness/Marketing background strongly preferredMust be client-service focused with excellent written and verbal communication skillsAdvanced critical thinking and problem solving skills, plus the ability to work independently is essentialBilingual Spanish/English is required in some locations We truly value our staff and further acknowledge their contributions by offering: Sign On BonusGenerous time off including a birthday holidayEmployer contributed pension planEmployee and family health coverageCompetitive salariesEmployee tuition reimbursementDependent tuition reimbursement403(b) retirement plan"}