{"jobID": "2612144366", "jobLocation": "New_York_NY", "jobTitle": "Test Lead | Digital Studio", "companyRating": null, "companyInfo": {"Website": "www.avanade.com", "Headquarters": "Seattle, WA", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Slalom, Cognizant Technology Solutions, Deloitte"}, "estimatedSalary": null, "jobDescription": " About the role  Avanade Inc. an industry-leading technical consulting firm, is looking for a Digital Test Lead to join our fast-growing, energetic Digital Studio team.  Why join Avanade and our Digital Studios? Are you passionate about building better user experiences utilizing technology? Do you enjoy working on a wide variety of large brands? Do you want to create experiences that have a positive and lasting impact on peoples lives? So do we!  Avanades Digital team engages a diverse array of design challenges across various industries, working with a variety of internationally recognized brands. We solve these challenges with an equally diverse array of products, from internal and external line-of-business applications, to public-facing websites, to mobile and tablet applications, to complete digital marketing solutions. The demand for experience design is rapidly growing so much that we need more Test Leads to join our all-star team of design/UX professionals and help our customers realize results.  As a Test Lead, you will be applying proven manual and automated test techniques on all applications with a rigorous and precise approach before any application goes live. Using in-depth analysis and test skills, you will work closely with UX Architects, UI Developers, Strategists and our Project Managers to estimate level of testing effort and develop and execute thorough test plans. You will communicate all test issues and document all defects in order to arrive at an appropriate fix. Youll lead a team of Digital Testers providing mentoring, best practice, training, and discipline leadership.  About Avanade  Avanade leads in providing innovative digital services, business solutions and design-led experiences for its clients, delivered through the power of people and the Microsoft ecosystem. Our professionals combine technology, business and industry expertise to build and deploy solutions to realize results for clients and their customers. Avanade has 30,000 digitally connected people across 24 countries, bringing clients the best thinking through a collaborative culture that honors diversity and reflects the communities in which we operate. We welcome all, and seek talented individuals who can bring their whole self to work, build inclusive teams and encourage diversity inside and outside the organization. Majority owned by Accenture, Avanade was founded in 2000 by Accenture LLP and Microsoft Corporation. Learn more at www.avanade.com.  Qualifications"}