{"jobID": "2818862805", "jobLocation": "Waltham_MA", "jobTitle": "Data Analyst II - Reporting & Analytics", "companyRating": "2.8", "companyInfo": {"Website": "www.verscend.com", "Headquarters": "Waltham, MA", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": " The Data Analyst II is an individual contributor role that provides healthcare analysis for Medicare, Medicaid, and Commercial lines of business. In this role you will manage various sources of information and large data sets including member, pharmacy, claims and encounter data to support Reporting and Analytics projects. You will also analyze data and conduct impact assessments and recommend solutions while staying current with industry regulations and trends. Responsibilities: Analytic Responsibilities Analyze Healthcare data, including medical procedures, health conditions and provider practices - with ability to think logically and process sequentially with a high level of detailed accuracyApply statistical, predictive modeling and/or data mining techniques to support analytical solutions.Help with the development of predictive analytics processes at the project and product levelAssist in successful completion of deliverables and ensure all requirements are accurately met. Quality Assurance and Documentation Responsibilities Analyze existing procedures to identify system/process changes needed to meet such requirements including but not limited to streamlining processes and quality assuranceEnsure that consistent documentation is developed and actively maintained throughout all phases of work.Adhere to industry standards and regulations when developing and maintaining analytic products including, but not limited to, algorithms, predictive models, and risk adjustment models. Data and Process Support Become a subject matter expert on our data, processes, and business methodologies.Develop specifications for needed data structures and execute plans for exploratory analysis of data. Training Actively support onboarding new team members with respect to analytic activities and company policiesRequirements:Master’s degree in Data Analytics, Social Science (e.g., Economics, Statistics), or related area. Ph.D. a plus.5+ years of advanced analytical experience. Experience in healthcare and fraud detection a plus.Strong background in data analytics, predictive modeling, machine learning, delivery systems, and current regulatory developments in the industry.Working knowledge of database applications, including extraction and querying skills.Proficient using SAS.Python/R experience a plusWell-organized with the ability to identify priorities and handle several projects simultaneously.Problem solver, resourceful, quick learner, with strong written and verbal communication skillsAbility to professionally interact with a diverse group of stakeholders including executives, managers, clients, and subject matter experts"}