{"jobID": "2797257737", "jobLocation": "Far_Rockaway_NY", "jobTitle": "Licensed Practical Nurse (LPN)- LTC/STC, Subacute Care", "companyRating": null, "companyInfo": {"Website": "www.newsolutionsstaffing.com", "Headquarters": "Brooklyn, NY", "Size": "1 to 50 employees", "Founded": " 2014", "Type": " Company - Public", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About Our Company: New Solutions Staffing is a full-service staffing agency located in Sheepshead Bay, Brooklyn. Recognized by the State of New York as a Certified Woman-Owned Small Business, we offer the highest quality in staffing. We recruit highly-trained, educated, and compassionate professionals for medical facilities within the Tri-State. Our goal is to develop long-lasting, quality partnerships with healthcare professionals and facilities, connecting them efficiently without compromising service or demand for excellence.Area of Talent: Licensed Practical Nurse, LTC/STC, Subacute CarePosition Type: Per DiemLocation: Far Rockaway, NY (11694)Shift: Morning (7 am-3 pm), Evening (3 pm- 11 pm), or Night (11 pm-7 am)Compensation: DOEPosition Summary: Administers nursing care in a 120-bed facility under the supervision of a registered nurse or other medical supervisor. Provides basic medical care, including changing bandages, administering medication, and collecting specimens. Ensures the health, comfort and safety of patients by assisting with bathing, feeding, and dressing. Monitors and reports changes in patient's condition to supervisor.Job Responsibilities:Giving medication as prescribed by a physicianTaking vital signs, such as blood pressure, temperature, and weightBasic wound care including cleaning and bandaging injured areasGiving injections of medicationImmunizationsTaking medical historiesEntering information into computer systemsManaging IVsEnsuring patients and their families understand release instructionsSupervising CNAs (Certified Nursing Assistants)Monitoring fluid and food intake and outputMoving patients safelyAssessing patients’ reactions to medicationsAssessing patients' mental healthProviding emotional supportAssisting with daily needs such as bathing and dressingObservation of patients' skin for potential bed soresRequired Qualifications:Minimum of 1 year of LPN nursing home experienceActive NYS LicenseSigmacare charting experienceFull Time Employee Benefits:Submit all required credentials with your application for your employee file, and receive a $50 bonus on your first paycheckHealth Benefits with Dental and Vision401KEnd of year bonus, based on hours workedPaid Referral ProgramSick TimePTOVacation DaysPart Time Employee Benefits:Submit all required credentials with your application for your employee file, and receive a $50 bonus on your first paycheck401KEnd of year bonus, based on hours workedPaid Referral ProgramSick Time"}