{"jobID": "2356858989", "jobLocation": "Boston_MA", "jobTitle": "Senior Postgres Consultant", "companyRating": null, "companyInfo": {"Website": "www.enterprisedb.com", "Headquarters": "Bedford, MA", "Size": "201 to 500 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Location: Bedford, MAResponsibilities:Support customers in the design, development, and deployment of Postgres-based data management solutions.Evaluate customer deployments of PostgreSQL, Postgres Plus Advanced Server, and related EnterpriseDB products and make recommendations concerning improvements.Develop an understanding of client businesses to develop recommendations, write code, and deliver training.Develop solutions balancing performance, usability, feasibility, and client satisfaction. Perform database migrations from Oracle, SQL Server, and MySQL to Postgres.Engage in performance and make tuning recommendations for existing database deployments. Engage with sales and engineering teams to develop new business opportunities and to develop, document, and communicate Postgres best practices.Engage with Postgres open source community.Qualifications:Master’s degree or equivalent in Computer Science or related plus two years of experience or a Bachelor’s degree or equivalent in Computer Science or related plus five years of experience. Must have two years of experience with PostgreSQL.Must have experience as a Consultant or Database Administrator (DBA), experience providing customer training, and experience with Python, Perl & Bash programming languages.Limited travel, approximately 2 weeks per month.Will accept a bachelor's degree equivalent based on a combination of education, training, and work experience as determined by a professional credentials evaluator.Any suitable combination of education, training, and experience is acceptable."}