{"jobID": "2776021189", "jobLocation": "Sausalito_CA", "jobTitle": "Research Intern, Full Body Capture and Reconstruction (PhD University Student)", "companyRating": null, "companyInfo": {"Website": "www.oculus.com", "Headquarters": "Menlo Park, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Research Intern, Full Body Capture and Reconstruction (PhD University Student)Internship - Engineering, Tech & Design | Sausalito, CA  Oculus is a world leader in the design of virtual reality systems. We are currently seeking innovative interns with a passion for technology to develop the next generation of virtual humans. The focus of our roles is on full body capture and reconstruction. Our internships are twelve (12) to twenty four (24) weeks long and we have various start dates throughout the year. Research topics:Markerless motion captureDense 3D surface deformation and reconstructionStatistical deformation modelsPhysics based animation and simulationApplied machine learningResponsibilitiesDesign and execution of algorithmsPrototyping, building and analysis of experimental systemsCollaboration with and support of other researchers across various disciplinesCommunication of research agenda, progress and resultsMinimum QualificationsPursuing a PhD in Computer Science, Computer Vision, Machine Learning, RoboticsCurrently enrolled in a full time degree program and returning to the program after the completion of the internship2+ years experience with developing machine learning, Bayesian filtering, information theory, 3D geometry, and physics based simulation2+ years experience with C/C++, numerical optimization, and/or machine learningInterpersonal skills: cross-group and cross-culture collaborationAbility to obtain work authorization in the United States in 2017 Preferred Qualifications 2+ years experience with developing computer vision, 3D geometry capture, Non-rigid deformation, Physics based simulationProven track record of achieving results as demonstrated in accepted papers at top computer vision and machine learning related conferences such as CVPR, ECCV, NIPS, etc.SDL2017"}