{"jobID": "2645521325", "jobLocation": "San_Jose_CA", "jobTitle": "Naval Nuclear Power School Instructor", "companyRating": null, "companyInfo": {"Website": "www.navy.com", "Headquarters": "San Diego, CA", "Size": "1001 to 5000 employees", "Founded": " 1775", "Type": " Government", "Industry": " Government", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " \"About This JobNuclear Power School Instructors teach nuclear-trained Officers and Enlisted personnel the theories and fundamentals behind the design and operation of Navy nuclear reactors and power plants. They are essential in preparing them for their work in the fast-paced, competitive nuclear power field.Naval Nuclear Power School is a 24-week course in science and technology, designed to provide theoretical background knowledge of nuclear power. Naval Nuclear Power Instructors provide detailed knowledge of how to work the key aspects of a pressurized-water Navy nuclear power plant, which include: Reactor core nuclear principles Heat transfer and fluid systems Plant chemistry and materials Mechanical and electrical systems Radiological controlThe working environment at Naval Nuclear Power School (NNPS) in Charleston, S.C., is both challenging and rewarding. Much of your work will take place in an academic setting. You will study the same curriculum that you eventually teach, and facilitate the same collaborative learning environment that you first experienced in your own training.Typically, there is one instructor per subject on duty each academic night, providing help to students who needd additional assistance on their homework or studies. Much of the curriculum is highly classified and demands the utmost discretion.Upon graduation from college, the formal training process of becoming an Officer in the Naval Nuclear Propulsion program is officially underway. For those pursuing a Nuclear Power School Instructor position, the first step is Officer Development School (ODS) a 5-week course in Newport, R.I., that provides a comprehensive and intense introduction to the responsibilities of being a Navy Staff Corps Officer.After ODS, prospective Nuclear Power School Instructors move on to Naval Nuclear Power School (NNPS) in Charleston, S.C. This 4-month course of intensive study provides the foundation of knowledge necessary for a theoretical understanding of key areas involved in nuclear propulsion. While at NNPS, these prospective instructors assume an intense workload focused on the subjects they will eventually teach. Subjects could range from mathematics and physics to thermodynamics and electrical engineering.Upon completion of NNPS, the student becomes the teacher. Nuclear Power School Instructors then take the lead in administering the technologically advanced curriculum, working closely with both the Officer and Enlisted personnel who come through their classrooms.\""}