{"jobID": "2808051040", "jobLocation": "Culver_City_CA", "jobTitle": "Social Media Global Threat Detection Intern - Fall 2018 - Entertainment and Media Industry Opportunity", "companyRating": "3.5", "companyInfo": {"Website": "www.sonypictures.com", "Headquarters": "Culver City, CA", "Size": "1001 to 5000 employees", "Founded": " 1982", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Universal Studios, Warner Bros., Disney Studios"}, "estimatedSalary": "37000", "jobDescription": " Social Media Global Threat Detection Intern, Corporate - Fall 2018The Global Threat Management (GTM) department is responsible for providing SPE with actionable intelligence, threat analysis, and mitigation recommendations to ensure the safety and security of staff, assets, operations, and reputation around the world. GTM is capable of monitoring the security situation surrounding all SPE assets and productions and generating a wide range of forward looking products for decision makers within SEHS and key business partners throughout the company. GTM also heads up the travel security/journey management program and is tasked with designing and developing global security guidelines for over 120 offices in 50 countries across the globe. RESPONSIBILITIES: The GTM intern will be responsible for social media threat monitoring, maintaining department SharePoint data, monitoring developing trends in the greater geopolitical landscape and identifying potential threats, plotting SPE assets and productions in GIS applications and escalating security incident information to higher management. They will be exposed to global security monitoring processes, threat analysis, analytical writing techniques, and tactical social media monitoring methods.  Social Media Reporting/Monitoring  Open-source research  Finding creative and useful ways to expand the GTM program QUALIFICATIONS: Currently enrolled in an accredited college/university for the duration of the internship and able to work part time  Major in International Relations, Political Science, or Journalism preferred  Two or more years of university completed and pursuing Bachelor's degree  Experience with social media monitoring and GIS applications  Strong interest in geopolitics and international relations  Adept in Microsoft Word, PowerPoint, Visio, Excel, and SharePoint  Proficient analytical capabilities and research aptitude  Excellent oral, organizational and written communication skills  Ability to work effectively both individually and as a team SPE INTERN PROGRAM DETAILS: The Sony Pictures Entertainment Internship program offers a unique opportunity to work alongside the teams that come together to create movies, TV shows, and other great experiences. These seasonal paid assignments provide meaningful and productive work that allow you to build your resume, experience and develop your skills further. You will be provided with challenging tasks, real-world experience, valuable networking opportunities, and many educational and social opportunities while on the lot.  This Fall internship is from Tuesday, September 11th through December 14thbut is flexible with start date based on school schedule. All candidates must be able to work between 10-29 hours and be currently enrolled in a college or university. Sony Pictures Entertainment is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, national origin, disability, veteran status, age, sexual orientation, gender identity, or other protected characteristics. Sony Pictures - CA - Culver City Area & Studios"}