{"jobID": "2789186480", "jobLocation": "San_Francisco_CA", "jobTitle": "System Development Intern", "companyRating": "4.1", "companyInfo": {"Website": "www.sfgiants.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Arts, Entertainment & Recreation", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "41000", "jobDescription": "Title: System Development Intern Reports To: Senior Director, Application Development Department: Information Technology Status: Part-Time, Non-Exempt/Hourly Duration: June December 2018 Position Summary: This individual will focus on projects related to baseball development. Projects may include acquiring new data, working on ETL, or front-end development. Additionally, this individual will assist in the daily support and maintenance of The San Francisco Giants baseball information system. This internship will run from June through December. Position Responsibilities:Complete assigned projects related to baseball development and baseball analyticsIdentify new and unique approaches to accomplish baseball objectivesDocument all work so that it can be understood and used by other members of the baseball development teamAssist in administrative and support tasks related to baseball information systemsTechnical Skills:General understanding of scripting language and databases.Experience in .Net, SQL, CSS and JS a plusA technical test will be required as part of the interview process Knowledge and Skills:Current student in an undergraduate or graduate school program or recent graduate with a Bachelors Degree in Computer Science, Electrical Engineering or Information Systems, or equivalent experienceKnowledge of and passion for baseballStrong interest in researching, identifying and applying new techniques and strategic uses of technologyMust be able to work efficiently and multi-task in a high stress environment and easily adapt to shifting prioritiesSelf-motivated, detail-oriented, highly organized and deadline drivenResourcefulness, desire and ability to learn quickly and acquire new technical skillsExcellent written and verbal communication skills. Technical documentation experience required.Patience and ability to satisfy demanding customers while effectively managing workload and expectationsTeam player who prefers a collaborative environmentCommitted to going above and beyond to serve the customer and enhance their technical knowledge We are an equal employment opportunity employer and consider applicants for all positions regardless of race, religious creed, color, national origin, ancestry, medical condition or disability, genetic condition, marital status, domestic partnership status, sex, gender, gender identity, gender expression, age, sexual orientation, military or veteran status and any other protected class under federal, state or local law. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records."}