{"jobID": "2728788033", "jobLocation": "New_York_NY", "jobTitle": "Carrier Account Executive", "companyRating": null, "companyInfo": {"Website": "www.firstlight.net", "Headquarters": "Albany, NY", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " FirstLight Fiber is seeking an experienced and success-driven Carrier Account Executive interested in taking their career to new heights. This position has the flexibility to work from any of our offices or work remotely from home as long as they are within driving distance of our footprint in New England and Upstate New York. Position Summary Reporting directly to the Senior Vice President of Carrier and Wholesale Sales, this individual will be responsible for working directly with wholesale wireline and wireless customers, including but not limited to interexchange carriers, wireless carriers, internet service providers, CLECs, and MSOs. Carrier Account Executives are expected to cultivate existing and new relationships in order to develop and close new revenue opportunities on behalf of FirstLight. ResponsibilitiesAchieve or exceed monthly revenue targetsSchedule and attend sales meetings to present FirstLight’s value proposition and identify new opportunitiesProvide competitive proposals, highlighting FirstLight’s value proposition and strengthsAct as primary point of contact for customers providing a high level of customer service to all FirstLight’s customersDevelop and maintain strong relationships with decision makers and influencers within assigned Carrier accountsMaintain accurate account information and proposal status in the Company’s CRM systemWillingness and ability to travelRequired SkillsStrong prospecting, networking and business development skillsStrong written and verbal communications skillsAbility to work in a team environment, with minimal supervision, managing multiple accounts and proposals with positive resultsStrong presentation skillsStrong negotiation skillsSolid understanding of Ethernet, IP and Networking technology (required)Solid understanding of competitive landscape in Metro Ethernet and IP market (required)Experience/Education:7-10 years successfully selling WAN and IP Technologies to Carrier/Wholesale customers Preferably experience selling Metro Ethernet, Fiber Optic, or Data services within the telecommunications spaceProficiency in Microsoft Office SuiteProficiency in CRM applications, experience with Sugar a plusBachelor’s degree preferredCompany Profile We offer competitive base salary and generous commission plan as well as an outstanding benefits package including health, dental, vision, and life insurance, short-term and long-term disability, 401(k) with company match, flexible spending accounts, and paid time off.  FirstLight, provides fiber optic data, voice, and high-speed Internet services to enterprise, carrier and wholesale customers in Upstate New York and Northern New England utilizing its own fiber optic network. FirstLight offers a robust suite of advanced telecommunications products, including dedicated Internet access, Metro Ethernet, traditional TDM solutions, SIP trunks, virtual PBX and audio-conferencing, managed commercial wireless systems, and Data Center Colocation."}