{"jobID": "2806377448", "jobLocation": "Sun_Valley_CA", "jobTitle": "Intern - Program Management -", "companyRating": "3.2", "companyInfo": {"Website": "www.hawker.com", "Headquarters": "Sun Valley, CA", "Size": "201 to 500 employees", "Founded": " 2002", "Type": " Subsidiary or Business Segment", "Industry": " Construction, Repair & Maintenance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "51000", "jobDescription": " Hawker Pacific Aerospace, Sun Valley, CA is seeking an Intern Program Management to support its Program Engineering Department during a six (6) month internship program. During the internship the selected applicant will work on the Project LDG Parts.  Project Description: Assess all processes and procedures required to overhaul Piece Parts and Hydraulic Components. Assess also the capability of Small Parts Cell (SPC). Based on the assessment develop the new processes and procedures to create LDG Parts, the new setup to bundle all of these components under one Program Management.  Project Goals: Establish the setup for LDG Parts and bring the Top 15 P/Ns (QTY) into the setup.  Project Skills: The intern will improve project management skills as well as Program Management, Material Management and point-of-use usability design for all parts of the organization.  Qualifications: Selected applicant must be an undergraduate college student enrolled in an accredited college or university and have an overall grade point average (GPA) 2.0 or higher.  Skills: The intern must have basic Microsoft Office skills such as Word, PowerPoint, and Excel as well as good English communication skills. The intern must have a good understanding of SolidWorks modeling with some material science background recommended. A current or past education in mechanical engineering is necessary.  This position may require use of information which is subject to the International Traffic in Arms Regulations (ITAR) or the Export Administration Regulations (EAR), or both. U.S. Person preferred. Under U.S. law, a U.S. Person is: a U.S. Citizen, a U.S. Permanent Resident (i.e. 'Green Card status'), a Political Asylee or Refugee. Foreign Nationals applying for this position are subject to U.S. export licensing requirements in order to lawfully have access to technical data, including approval(s) from the U.S. Department of State, Directorate of Defense Trade Controls or the U.S. Department of Commerce, Bureau of Industry and Security. Prior written authorization from the U.S. Department of State-DDTC or the U.S. Department of Commerce-BIS, or both, must be granted, or the inapplicability of such requirements must be certified by the Empowered Official, BEFORE the applicant can work at Hawker Pacific Aerospace.  We are proud to be an EEO/AA employer M/F/D/V. We maintain a drug-free workplace and perform pre-employment substance abuse test"}