{"jobID": "2827414814", "jobLocation": "New_York_NY", "jobTitle": "Restructuring Market Data Analyst", "companyRating": "2.9", "companyInfo": {"Website": "www.computershare.com", "Headquarters": "Abbotsford, Australia", "Size": "10000+ employees", "Founded": " 1978", "Type": " Company - Public (CPU) ", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": "Restructuring Market Data AnalystComputershare is a global market leader in transfer agency and share registration, employee equity plans, mortgage servicing, proxy solicitation and stakeholder communications. We also specialize in corporate trust, bankruptcy, class action and utility administration, and a range of other diversified financial and governance services.Founded in 1978, Computershare is renowned for our expertise in high integrity data management, high volume transaction processing and reconciliations, payments and stakeholder engagement. Many of the world’s leading organizations partner with us to streamline and maximize the value of relationships with their investors, employees, creditors and customers.Computershare is represented in all major global financial markets and has over 16,000 employees worldwide who are key to delivering exceptional value and outcomes. Our career opportunities span many business units, including Computershare Loan Services and Kurtzman Carson Consultants – join our growing team of financial services professionals!Job SummaryThe Restructuring Market Data Analyst is responsible for supporting the initiatives of the Corporate Restructuring and Fiduciary Administration Services Business Development teams. This role will research, collate and analyze marketplace data. This position requires attention to detail, strong communication skills, extensive data manipulation skills, proficiency in excel, ability to read financial documents and distil financial viability of companies, accountability, efficiency and the ability to multi-task.Position Responsibilities and Essential FunctionsResearch into industry targets, compilation of sharable and non-sharable information for use in communicating with client base. Develop in-depth market research sheets on companies in focus for sharing in the marketplace.Ongoing monitoring and evaluation of monthly operating reports to understand competitive cost landscape of restructuring consultingReview of relevant professionals involved in cases. Track debtors counsel, CROs and FAs involved in bankruptcy cases. Track who is advising creditors' committees for potential FAS assignments.Attend BD functions as requiredAssist in developing and producing marketing and brand collateral as neededManipulate above data into action plans in conjunction with the BD team to win new businessBack up for business development proposalsProduce and distribute bimonthly pipeline reporting for CS and FASMaintain contacts and contact lists via Salesforce.Other duties or tasks as assigned by management.The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.QualificationsTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.SkillsRequired:Critical thinking skillsResearch SkillsAbility to multi-task and stay organizedStrong attention to detailMust have excellent written and verbal communication skills.Excellent time management skills and the ability to prioritize to meet deadlinesStrong interpersonal skills and ability to work well in a team environmentPreferred:Intermediate Microsoft Office skills, with advanced Excel skills preferredEducation and ExperienceRequired:High school diploma or general education degree (GED)2-4 years of data analytic experiencePositive attitude; works well with othersIntermediate to advanced knowledge of Microsoft Office, Photoshop, Illustrator and InDesignAttention to detail and thoroughnessExcellent written and verbal skillsExcellent organizational skills and ability to self-direct and prioritize initiativeProfessional and personable demeanor for dealing with both trusted clients and vendorsPreferred:Bachelor's degree (B. A.) from four-year college or university; or one to two years related experience and/or training; or equivalent combination of education and experience.Experience with Salesforce – managing and updating Salesforce database; creating reports; etc.Experience working with attorneysLanguage AbilityAbility to read/comprehend simple instructions, short correspondence, and memos; write simple correspondence; effectively present information in one-on-one/small group situations to customers, clients, and other employees of the organizationMathematical AbilityAbility to add and subtract two digit numbers and to multiply and divide with 10's and 100's. Ability to perform these operations using units of American money and weight measurement, volume, and distance.Work EnvironmentThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.The noise level in the environment is moderate.Physical RequirementsThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.While performing the duties of this job the employee is regularly required to talk or hear. The employee is frequently required to sit, stand, walk, reach with hands and arms, and use hands to finger, handle, or feel. The employee may occasionally have reason to lift up to 10 pounds. The vision requirements include close and distant vision.Computershare is an Equal Opportunity Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity or expression, national or ethnic origin, age, disability, protected veteran status, or other characteristics protected by applicable law.This job specification should not be construed to imply that these requirements are the exclusive standards of the position. Incumbents will follow any other instructions and perform any other related duties as may be required by business needs and communicated by their supervisor."}