{"jobID": "2824366051", "jobLocation": "Fremont_CA", "jobTitle": "Prinicipal R&D; Engineer", "companyRating": null, "companyInfo": {"Website": "www.shockwavemedical.com", "Headquarters": "Fremont, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Shockwave Medical is revolutionizing the interventional treatment of advanced cardiovascular disease, creating new opportunities for patients and physicians by effectively targeting calcified plaque. Together, we are working to reshape interventional therapy with Lithoplasty® Technology for the treatment of calcified plaque.  Position Overview  The Principal Engineer will use technical and leadership skills in the development of innovative products to treat peripheral and coronary diseases.  Essential Job Functions Provide technical leadership for projects including managing cross functional technological teamsResponsible for managing technology and other relevant resources.Design and develop product(s) in full compliance with the company’s Design Control requirements and consistent with FDA, ISO, and MDD requirements.Prototype and develop proof of concept designs, disease models and test methods of testing these concepts in a simulated environment and develop new product designs based on the defined user needs.Work with clinical and scientific advisors as well as Key Opinion Leaders in translating clinical needs into design solutions while utilizing these resources to develop and optimize product design.Analyzes, evaluates, sources, and coordinates the procurement of new materials to support prototyping and pilot operation.Participate on cross-functional development team that manage projects from concept through commercialization.Responsible for ensuring proper documentation consistent with company’s quality system.Responsible for knowing and planning activities consistent the company’s quality policy and quality objectives.Responsible for ensuring the lab notebooks are documented in a timely manner and consistent with the applicable SOP.Develop protocols/reports and perform product in-vitro, in-vivo as well as verification and validation testing.Perform process-related design tasks to support pilot manufacturing.Identify suppliers and maintain relationships to ensure the delivery of superior components and services.Enhance the intellectual property position of the company via invention disclosures and patent applications.Maintain current knowledge of competitive technologies in addition to medical, technical, and biomedical developments related to company’s products.Responsible for component and assembly documentation for new products being developed.Support company goals and objectives, policies and procedures, Quality Systems, and FDA regulations.Other duties as assigned. These job requirements are not intended to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel.RequirementsEffective communication skills with all levels of management and organizations.Operate independently and adaptability to changing requirements.Ability to work in a fast paced environment, managing multiple priorities.Bachelor’s Degree (Master’s or PhD preferred) in Mechanical, Biomedical Engineering, or equivalent experience.Minimum of 7 years’ experience in engineering preferably in the medical device industry.Experience developing disposable medical devices.Knowledge of disposable peripheral and coronary device design, material selection, and testing.Strong understanding of engineering materials, component selection, and design for reliability and manufacturability.Experience in early stage catheter based cardiovascular devices development is a strong plus.Previous experience managing cross functional teams is preffered.Ability to work in a fast-paced environment while managing multiple prioritiesOperate as a team and/or independently while demonstrating flexibility to changing requirements.There may be continuous sitting for prolonged periods (more than 2 consecutive hours in an 8 hour day)Employee may be required to lift objects up to 25lbs or more. Employees will be required to work in an air conditioned office space and possibly perform some tasks in our non-temperature controlled warehouse space.Benefits Shockwave Medical offers competitive salary, equity and healthcare. If you have experience and initiative for this fast paced fun start-up, please apply.  EEO Employer"}