{"jobID": "2823447191", "jobLocation": "New_York_NY", "jobTitle": "Nurse Manager / FT Days", "companyRating": "3.0", "companyInfo": {"Website": "www.archcare.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1899", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " MJHS, VillageCare"}, "estimatedSalary": "109000", "jobDescription": " ArchCare, the Continuing Care Community of the Archdiocese of New York, provides top-quality healthcare and other services to thousands of people each day through an ever-expanding array of home- and community-based and residential care programs. We offer: Long-term nursing home care and short-term rehabilitationNursing home alternatives that keep seniors healthy, safe and independentHealthcare plans that coordinate members’ every healthcare needHome health services for infants, children and adultsFamily-centered hospice and end-of-life careSpecialized programs for people with exceptional care needs, including Huntington’s Disease, HIV/AIDS and developmental disabilities As one of the largest and most dynamic Catholic health systems in the nation, ArchCare caters not just to the physical health of those we serve, but to their emotional and spiritual well-being, too. Helping families understand their healthcare options and cope with the challenge of making sure their loved one is well cared for is just as important to us. Join the ArchCare Team Our team of dedicated Care Members are shaping the health care landscape of today and tomorrow.  This position manages budgetary, operational, administrative and human resource functions of assigned unit, provides the leadership needed to achieve unit, departmental objectives, and communicates effectively with the Director of Nursing to resolve resident and staff issues.  • Collaborates with Human Resources regarding the selection of staff for the resident/patient care units. Provides for professional growth and development of nursing staff through identification of needs, encouraging education (formal and continuing) efforts, and evaluation of same.Responsible for completion of regular performance evaluations for each staff member; conducts evaluations for new staff prior to completion of probationary period.Counsels employees, develops staff and, as appropriate, utilizes the disciplinary process in conjunction with existing labor contracts.Plans and maintains staffing pattern for the resident care unit on a 24 hours, seven day a week basis, in order to meet the resident’s/patient’s need for continuity of care. Monitors and contains the use of minimal overtime to meet staffing needs.Responsible for safety and comfort of residents/patients, and the health and safety of employees assigned to the unit.Collaborates with ancillary support services to provide a safe, clean and secure environment for residents, staff and visitors.Justifies and maintains a fiscal plan (budget) for the unit. Monitors residents, expenses and operating expenses (salaries and capital expense items) and provides appropriate reports to Nursing Administration.Responsible for the accuracy and timelines of resident census and conditions and roster/matrix.Oversees the use of consultant physicians within the facility within a timely fashion.  NYS Registration as a Registered Nurse.  Bachelor's Degree preferred."}