{"jobID": "2758231688", "jobLocation": "New_York_NY", "jobTitle": "Strategic Account Manager", "companyRating": "2.8", "companyInfo": {"Website": "www.affinitysolutions.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Upserve, Cardlytics"}, "estimatedSalary": "87000", "jobDescription": "Office Title: Strategic Account ManagerDepartment: Strategic Account ManagementWork location: New York, NY or San Jose, CAHours: Full-Time Reports To: VP Head of Strategic Partner Management COMPANY BACKGROUNDAffinity Solutions (‘Affinity’) delivers powerful, data-driven marketing solutions to companies in retail, travel, financial services, and other sectors. We have been building the required technology and intellectual capital for leadership for more than a decade, well before ‘Big Data’ took on its name. Our position in the market is unique and defensible.Affinity Solutions’s Marketing Products provide the intelligence gleaned from continuous discovery of purchase patterns to identify, reach, and influence likely buyers in real-time. Our purchase-based data products help marketers measure and optimize the sales impact of marketing campaigns. This unique data is leveraged in programmatic advertising, powers measurement of digital and TV advertising and is the backbone of incredibly powerful and customized market intelligence for some of the biggest brands in the US. Our goal is to delivery data-powered intelligence so that our customers can drive the most effective and lucrative experiences throughout their customer’s journey.Job DescriptionAffinity has partnered with some of the industry’s leading Marketing and Data Service Providers. You will serve as the primary point of contact with our key channel partners (Ad Agencies, DSPs, DMPs, MarTech providers) helping to drive their Go-to-Market and sales efforts. To do so successfully, you will be their internal voice at Affinity - responsible for working with our Product and Marketing organization to ensure your partners’ have everything they need to drive revenue.  Responsibilities include:Design and drive business plans with your Partners.Create co-marketing and co-selling strategies that align to both Affinity’s revenue goals and your partner’s.Set and deliver against quarterly revenue goals by managing a joint sales pipeline.Work closely with Affinity Marketing department on core messaging and sales materials for your partners’ specific GTM needs. Everything from sales decks, one-sheeters, co-branding and PR. You will build out the plan with our marketing team and ensure it’s flawless execution.Provide detailed Product and Technical support feedback to the Affinity Product/Eng organization so that we are always innovating and evolving to address market needs. Be the voice of your partner internally at Affinity.Be ready and excited to co-present, co-sell with your Partners as they take our Products to their clients.Account Managers will be accountable and responsible for the coordination of internal resources to enable an organized and efficient approach to program delivery and management of client services activities.Identification and troubleshooting of client-side constraints which could impact program delivery, operation and full utilization.Prepare and present Quarterly Business Reviews and strategic recommendations both internally to Affinity Exeuctives but also to your Partners.Essential Requirements and Skills:3-5 years of client-facing experience in an Ad Tech or Marketing Tech platform-facing role, with strong expertise in Advertising Technology, Data Sales and/or Data Analytics.Strong Analytical proficiency - candidate must be a strategic and creative thinker that understands business problems and opportunities and is able to identify, aggregate and synthesize relevant data to inform decisions and show trends.Deep industry experience building major, enterprise strategic alliances and complex partnerships.Great communication skills, with the expericience engaging and advising senior level stakeholders and clients.History of revenue generation/sales support in past roles.Remarkably strategic, driven, and very entrepreneurial, rooted in the ability to creatively solve complex client problems.Start-up personality: smart, ethical, friendly, hard-working and proactive. Strong project management skills and attention to detail, with the ability to multi-task and consitiently manage multiple projects.Must have strong PC skills: Windows, Word, PowerPoint and Excel, and strong mathematical/budget management skills."}