{"jobID": "2745466129", "jobLocation": "San_Mateo_CA", "jobTitle": "Senior Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.guideline.com", "Headquarters": "New York, 061", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " At Guideline, were helping Americans save for a better future. Guideline is the only 401(k) provider with a fee-free, full-stack 401(k) offering that automates plan administration and compliance with a platform that directly integrates with many of the most popular payroll providers. By building transparent and first-of-its-kind software, the Guideline team is combatting whats unfortunately become the retirement industry status quo -- legacy providers have put profit over the interests of employees, abandoning the goal of the programs in the first place: to give employees the opportunity to save as much as possible for retirement. With over 3,000 clients and hundreds of millions of dollars in assets under management, in just a couple years of operations, were well on our way to making smart retirement planning easy for everyone.Job Description We are looking to hire Senior Data Scientist to join our growing Data Team, which is comprised of data engineers and data scientists, and tasked to improve our 401(K) product and business efficiency by leveraging the power of proprietary data and public data. If you are experienced with and passionate about leveraging sophisticated data, analysis, statistics and algorithms to help tens of millions of Americans save for a better financial future, this is the team you want to join.Responsibilities: Develop metrics to understand the performance and identify levers in product, marketing, sales, operations and customer services. Communicate findings and recommendations to department leads and executives. Evaluate and ETL rich data from proprietary and public data sources Design and develop data product, in collaboration with data engineers and product teams Identify and adopt state-of-the-art methodologies to meet companys increasingly more complex data needs Identify and adopt frameworks, policies and tools to enhance the teams productivity Facilitate cross-functional collaboration Coach junior members Thought leadership communication by authoring data-driven blog posts and infographicsDesired Skills and Experience/Qualifications: Bachelor degree in a quantitative discipline 6+ year professional experience in a similar role Extensive experience of applied statistics (e.g. distributions, hypothesis testing, regressions) Extensive experience of 1+ analysis-oriented programming languages (e.g. SQL, R, Python) Superb verbal and written communication skills Experience of ETL development Experience of 1+ database technologies (e.g. transactional database, analytical data warehouse, key-value data store, document store) Experience of 1+ third-party analytics solutions (e.g. BI solution, marketing analytics solution, product funnel analytics solution, CRM solution) Empathy, as manifested by excellent people skills and collaboration skills Creative and think outside the box Intellectual curiosity and lifetime learner Proactive and driven to deliver high-quality work and make impactCompensation & Benefits At Guideline, were dedicated to creating a workspace environment that fosters creativity, collaboration, and hustle. Transforming a decades-old industry isnt easy, so we reward our team with generous compensation and a robust benefits package. Competitive compensation with cash and stock option grants Unlimited vacation policy An employer-matched Guideline 401(k) Generous paid maternity/paternity leave policies Premium health benefits; Short and long-term disability benefits Daily catered lunch, in addition to more snacks, coffee, and beverages than you could ever consume Computer and monitor setup of your choosing Caltrain annual pass A spacious office in Hillsdale, steps away from Hillsdale Caltrain station, that happens to have an on-site beer garden, two Bocce Ball courts, and is conveniently across the street from Blue Bottle and Tin Pot. Equal Employment Guideline provides equal employment opportunities to all employees and applicants for employment without regard to race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}