{"jobID": "2725444613", "jobLocation": "New_York_NY", "jobTitle": "Assistant Merchandiser,Menswear and Womenswear", "companyRating": null, "companyInfo": {"Website": "www.fbbrands.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1901", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " DUTIES/RESPONSIBILITIES: Assist the Product Manager/Sr. Product Manager in all phases creating assortment, developing and selection product for both catalog and web.Interact daily with Creative, E-Commerce, Inventory, Global Sourcing, Domestic Vendors and Technical Design teams to coordinate merchandising objectives and support cross collaboration.Conduct competitive research by shopping catalog and retail competition to identify key items and trends.Assist Product Manager/Sr. Product Manager in the reporting of business results and Key Performance Indicators. MINIMUM QUALIFICATIONS: Bachelor’s degreeMinimum 1-3 years of merchandising or product related experience required including internshipsIntimate experience requiredProficiency in Microsoft Office (Word, Excel, PowerPoint) is a mustDetail orientation & organization skills a mustStrong communication and follow up skillsAbility to multi task We offer a competitive salary and a comprehensive benefit package that includes a fun work environment, a generous merchandise discount and realistic growth potential. We value a culture of inclusion and diversity within our workforce. We are committed to maintaining a workplace free from prohibited employment conduct, including discrimination or harassment on the basis of race, color, national origin, sex, age, religion, disability, genetic information, sexual orientation, gender identity or expression, marriage and civil partnership, pregnancy and maternity and any other characteristic protected by law. FULLBEAUTY Brands™ is an equal opportunity employer, M/F.Required Skills Required Experience Job Location  New York, US-NY "}