{"jobID": "2745615168", "jobLocation": "Quincy_MA", "jobTitle": "Data Analyst - Identity & Access Control", "companyRating": "3.1", "companyInfo": {"Website": "www.statestreet.com", "Headquarters": "Boston, MA", "Size": "10000+ employees", "Founded": " 1792", "Type": " Company - Public (STT) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " J.P. Morgan, BNY Mellon, Northern Trust"}, "estimatedSalary": "55000", "jobDescription": " State Street Corporate Information Security Administration Services has embarked in a new and exciting opportunity within the Identity & Access Management organization. We are seeking a skilled and proven Data & Reporting Analyst. The individual contributor in this role will design and develop visualization and analytics based solutions on big data. The candidate will be required to have a proven track record of delivery of visualization solutions and analytics in support of multiple, simultaneous projects. The candidate should have the ability to quickly get a solid understanding of existing and future State Street business and related technologies. Your contributions to our team:Design, develop, and support visualization and analytics for multiple, simultaneous projects.Consult with business unit management as needed to analyze requirements and identify the optimal visual and analytical solution to fit within existing technologies and comply with overall strategic direction.Proactively ensure minimum delays in deliverables.Provide subject matter expertise on visual representations which will foster analytical insights.Leverage industry best practices; shares the same with team.Qualifications:3-5 years of proven related experience Minimum 2 years of experience in Identity Access Control or Corporate Information Security Services; exposure to financial services environment helpful;Very strong experience with creating solutions using visualization tools (Tableau, Qlik, etc.)Demonstrated ability to work independently and as part of a teamStrong problem solving skills and willingness to learnStrong communication and collaboration skills with ability to work in a team environmentGood interpersonal, communication, facilitation, and presentation skillsResults oriented ownership mentalityExceptional Candidates will also have:Core analytics skills such as statistics, machine learning, analytic models, and data miningIntermediate level experience with SQLExperience with analytical languages like Python and/or R"}