{"jobID": "2756747206", "jobLocation": "Lowell_MA", "jobTitle": "Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.verizon.jobs", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Public (VZ) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Microsoft, Google"}, "estimatedSalary": "127000", "jobDescription": "What you’ll be doing... If you are curious about new technology and the possibilities it creates, then this job may be perfect for you. As part of the Information Technology team, you will work on new technologies and find ways to meet our customers’ needs and make it easy for them to do business with us. You will use your expertise to solve complex problems and find unique solutions. The work you’ll do every single day will make people’s lives, work and play better.  As a Data Scientist, you’ll use AI/Machine Learning to solve business problems. You will report to the IT Director focused on implementing emerging technologies. You’ll support the design and implementation of standardized global quote to cash process automation including: Perform independent and objective evaluations of quote to cash processes.Redesign existing processes and assess and establish key process controls.Ensure the consistency and completeness of design and implementation for the end to end process.Analyze results or metrics and meet with key subject matter experts to help identify potential improvements or evaluate different alternate solutions, including recommending process changes, system enhancements or other automation options.Support Verizon IT transformation initiatives including follow-up, resolution and closure of open items as well as identifying and developing continuous improvement opportunities.What we’re looking for... With an eye towards improving performance and predictability, you like the science of analytics. Developing resolutions to complex problems, using your sharp judgment to develop methods, techniques, and evaluation criteria enables you to deliver solutions that make a big impact. You’re able to communicate technical information to non-technical audiences, and you take pride in your ability to share your considerable knowledge with your peers.  You'll need to have: Bachelor's degree or four or more years of work experience.Four or more years of relevant work experience.Experience with programming languages such as Java, Python, R, or SQL.Experience with data modelingKnowledge of Artificial Intelligence/Machine Learning (AI/ML) technologies concepts ranging such as RNN, CNN's and LSTM's. Even better if you have: Your degree in business intelligence and analytics, computer science, or mathematics.Master’s degree.Experience in telecommunications industry.Experienced in the design and implementation of CRM systems and applications.When you join Verizon... You’ll be doing work that matters alongside other talented people, transforming the way people, businesses and things connect with each other. Beyond powering America’s fastest and most reliable network, we’re leading the way in broadband, cloud and security solutions, Internet of Things and innovating in areas such as, video entertainment. Of course, we will offer you great pay and benefits, but we’re about more than that. Verizon is a place where you can craft your own path to greatness. Whether you think in code, words, pictures or numbers, find your future at Verizon. Equal Employment Opportunity We're proud to be an equal opportunity employer- and celebrate our employees' differences, regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or Veteran status. Different makes us better."}