{"jobID": "2829274222", "jobLocation": "San_Jose_CA", "jobTitle": "Director - Information Technology", "companyRating": "4.0", "companyInfo": {"Website": "www.corovan.com", "Headquarters": "Poway, CA", "Size": "501 to 1000 employees", "Founded": " 1948", "Type": " Company - Private", "Industry": " Transportation & Logistics", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "105000", "jobDescription": " Director - Information Technology, San Jose General InformationJob Title:Director - Information TechnologyLocation:C/O Corovan Corporation650 Lenfest RoadSan Jose, CA, 95133United StatesEmployee Type:ExemptJob Category:Information TechnologyMinimum Experience:5 YearsRequired Degree:4 Year DegreeTravel:50%Manage Others:YesContact informationName:Sara MasonJob previewIT DirectorJob DescriptionCorovan is a rapidly growing California based privately held company with a management team that genuinely cares about their employees. Our values include growth, continual improvement, and offer our employees training in a variety of fields. We work with varied and interesting work environments with some of the most dynamic companies in the world.  Information Technology (IT) is responsible for the full lifecycle of infrastructure and platform services supporting Corovan and Corodata business. With a robust portfolio of custom and highly-configured applications, the IT function develops strategy, plans and budgets for the infrastructure supporting those applications as well as the tier-1 operation support phases of all applications.  IT is required to support end-user functions, desktop and laptop platforms, voice, mobility as well as server and network infrastructure. IT’s commitment is to maintain a robust, highly available and cost-effective platform that allows the business to be agile in response to market opportunities.  While this role is not a business or systems analyst, candidates who excel in this role are able to analyze complex business problems and arrive at simple technical solutions that are aligned with budget, time and quality expectations of the business. Communication and collaboration skills are critical to being successful in any IT role.RequirementsWhat you'll be doing:Team LeaderLead a dynamic, diverse team of 5 IT staff and 4 Developers.Lead the IT team that Analyzes, diagnoses and resolves computer hardware, network and software problems for local and remote users.Executes project tasks, action items, and coordinates with team leads for timing and milestone completion.Monitor emerging technology developments and identify innovations with potential high payoffs for the business.Make recommendations for new/altered technologies that would contribute to overall cost savings and/or productivity improvements as well as the development of technical standards.Assist in developing long-term strategies and capacity planning for meeting future technology needs.Information TechnologyAssists in the installation, implementation, modification, testing, servicing, and upgrades of internal systems.Performs the installation, repair and preventative maintenance of systems. Assists in determining suitable software to meet user requirements.Assist in interface planning methodology by communication with clients, vendors and team members.Provide for efficient database operations, including total throughput, input/output analysis and performance statistics. Implement hardware and software to support client user activities.Establish database management criteria including transaction logging, backups, restore and recover, and disaster recovery.Coordinate software upgrades with software vendors and team members as necessary.Manage technical performance improvement programs, stressing quality control of service to clientsSecurityDevelop, implement, and maintain a security program for the protection of systems hardware, software, and data. Develop and implement policies, procedures, and guidelines to direct and carry out the objectives established by the security program.Research and recommend security measures to be included in the installation of new systems of application programs.Monitor and evaluate data security; collaborate with management and other stakeholders to reduce all risks to corporate computer resources, and investigate security breaches.Ensure that the security program provides the necessary safeguards for good business practice and that it meet; all corporate and government regulatory requirements.Coordinate the development of a comprehensive disaster recovery plan, maintain the plan, and conduct periodic testing.Software DevelopmentEnsure consistent communication with clients regarding issues affecting their workgroup, in collaboration with.Screens, refers and diagnoses internal inquiries and work requests as they relate to maintenance of personal computers and related systems. May prepare incident reports and assist in hardware and software evaluation.Practice continuous process/system improvement by helping improve standards, policies and procedures for managing technology.Project ManagementHandles multiple projects simultaneously, to prioritize work and resolve technical emergencies as they occur.Develops clear and concise documentation and reports.Remains knowledgeable of operations and the computer systems used within client sites to provide comprehensive support.Ensures awareness of and compliance to all applicable employment, environmental, health and safety legislation. May periodically attend seminars and training opportunities on current technology and support expansion in order to enhance abilities and company’s operations.Responsible for execution of change control tasks.What we are looking for:BA/BS in computer science or related fieldMinimum 5-8 years experience leading IT teams and hands on exposure utilizing help desk ticketing and management systemsExperience with PC & laptop hardware, incl. the ability to replace cards, RAM etc.A solid understanding of networking including subnetting, the OSI model and firewalls.Experience installing software, patches, updates on desktop and server platforms.Excellent customer service skills. Able to build good relationships with and relate well to end users.Demonstrated ability to build a cohesive and efficient project team with shared resources from cross-functional teams (stakeholders, engineering, developers, quality)Prior experience in a regulated (SSAE-18, PCI, HIPAA) environment a strong plus.Previous experience enterprise IT teams performing a similar role.Experience with desktop lifecycle management for teams of 200+.Experience with virtualization, colocation and hosting.Experience with enterprise MS Exchange, SQL and IIS deploymentsEnterprise application (ERP, CRM, etc…) experienceExperience supporting custom and highly-configured applicationsExperience with virus removal from Windows systems.50% travel to various worksites and or recruiting locations is required. A valid driver’s license is required for this positionPosition is based in Northern California"}