{"jobID": "2535622950", "jobLocation": "New_York_NY", "jobTitle": "OTR Class A CDL Refrigerated Truck Driver", "companyRating": null, "companyInfo": {"Website": "www.driveforprime.com/?r=glassdoor", "Headquarters": "Springfield, MO", "Size": "1001 to 5000 employees", "Founded": " 1970", "Type": " Company - Private", "Industry": " Transportation & Logistics", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Refrigerated drivers at Prime are responsible for safely operating a tractor trailer and delivering freight on-time to our customers across the United States and Canada. As a driver in the Refrigerated Division, you will need to be prepared to haul a variety of products including beef, pork, beer, produce, frozen foods, floral goods, and more. Over-the-road truck drivers will get home every 3 to 4 weeks. You earn 1 day of home time for every week that you are out on the road as a company driver.  Whether you want to be a company driver or an independent contractor, Prime has options and profitable opportunities for you. With 24/7 support and late-model equipment, we will provide you the tools to succeed. We offer Freightliner, Peterbilt, and International models available with APUs and 1500-watt inverters. All company and lease trucks also come with an Omnitracs Qualcomm unit for electronic logs, messaging, and navigation. The Prime Mobile App is an additional tool available to help our drivers be more effective with their time by allowing you to not be tied to your truck and Omnitracs Qualcomm unit inside your truck. Eligible Applicants:Experienced Class A CDL DriversRecent CDL School GraduatesNon-CDL Holders interested in Prime Student Driver ProgramCompany Driver Pay & BenefitsSolo Pay = .42 cpm plus additional 5 cents per mile for a lightweight tractorTeam Pay=.48 cpm split plus additional 20 cents per mile for all miles above 3,000 per weekHealth, life, dental, and vision insurance options401(K) Plan with company matchPaid VacationFuel Mileage Bonus - Earn up to 8.2 additional cents per mile for exceeding 7.75 mpgTuition Reimbursement - Up to $1500 for CDL School graduates, if qualifiedDriver Referral Program - Earn money for referring new drivers to PrimeAbility to become a CDL Instructor or Trainer & earn more moneyIndependent Contractor BenefitsEarn 72% of revenue as a Refrigerated ContractorVolume discounts on fuel, tires, parts, & serviceQuarterly Mileage IncentivesLongevity IncentivesRider Policy Passenger Policy (no cost)Pet Policy (no cost)Home Policy allows you to go home whenever you chooseQualificationsMust be at least 21 years old with a valid license from your state of permanent residence including a tanker endorsementBe able to obtain United States Passport, TWIC Card, and Hazmat EndorsementHave a verifiable work history and referencesHave an acceptable motor vehicle recordMust be able to pass a physical compliant to the Federal Motor Carrier Safety StandardsIf any failed or refused drug or alcohol related test, must provide proof of completed Substance Abuse Counseling to considerMust present one or more of the following: US Passport, State Certified Copy of Birth Certificate, or INS paperwork that shows US Citizenship or that permanent residence has been established and is currentAn affirmative answer to the questions regarding criminal record will not automatically result in the denial of employment. An applicant’s criminal record will be evaluated based on the job for which the applicant has applied."}