{"jobID": "2574679275", "jobLocation": "Santa_Monica_CA", "jobTitle": "Senior Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.headspace.com", "Headquarters": "Santa Monica, CA", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "113000", "jobDescription": "About the Senior Data Analyst role at Headspace:At Headspace, we believe the power of health and happiness can deeply impact each one of us. We are seeking a Senior Data Analyst to join our Growth team and make significant contributions to our mission of making the world a happier and healthier place.As a member of the Growth team, you are analytical, technical, and have a knack insight mining. You enjoy finding opportunities to scale our impact, influence decisions with data, and work cross-functionally in the business. This individual will report to the Head of Growth.How your skills and passion will come alive at Headspace: Drive projects to identify key levers for new user growth, retention, and revenueLeverage data to understand the product, identify opportunities, and execute initiatives to drive growth and engagementDrive experiment design, interpretation, and actionable insightsPartner closely with Growth & Finance teams to drive data-driven solutions and alignmentSelf motivated with a growth mindset - you seek out learning opportunities for yourself and the teamWhat youve accomplished:3+ years in a data-intensive roleBachelors degree in quantitative field (or equivalent training & experience)Proficiency with SQL, Excel, and R or Pythondeep experience conceptualizing and executing A/B testsStrong team player who can work well across multiple cross-functional teams, including, finance, growth, product, engineering, and data teamsFocus on scale - develop tooling to automate commonly requested analysesExperience building out data pipelines from new and raw data sourcesYou have a passion for meditation & mindfulnessHow to get started:If youre excited by the idea of seeing yourself in this role at Headspace, please apply with your CV and a cover letter that best expresses your interest and unique qualifications."}