{"jobID": "2787857427", "jobLocation": "Redwood_City_CA", "jobTitle": "Senior Data Scientist-Ingestible Sensor", "companyRating": "3.1", "companyInfo": {"Website": "www.proteus.com", "Headquarters": "Redwood City, CA", "Size": "201 to 500 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " MC10, AirStrip, Fitbit"}, "estimatedSalary": "196000", "jobDescription": "The Company: Proteus Digital Health® is a privately held company, funded by leading institutional and corporate investors, including Novartis, Otsuka, Oracle and Kaiser Permanente Ventures. Armed with an intellectual property portfolio that includes more than 440 issued patents and led by some of the brightest minds in technology, pharmaceuticals, and healthcare, Proteus is enabling a new category of therapy: Digital Medicine. These offerings include widely used drugs, formulated so they communicate when they have been taken; a wearable patch that detects medicines and captures physiologic response; mobile applications to support patient self-care and physician decision-making; and data analytics to serve the needs of health system managers. The FDA granted its first approval of a Digital Medicine, Abilify Mycite® on November 13, 2017. Abilify Mycite® is a drug-device combination product of Otsukas aripiprazole, an atypical antipsychotic, embedded with Proteus ingestible sensor that communicates with Proteus wearable sensor patch and a smartphone application. The Product: Proteus Discover Proteus Discover is a Digital Medicine offering that measures medication treatment effectiveness and helps physicians, care teams, and patients improve clinical outcomes. Proteus Discover provides the tools needed for health organizations to build patient engagement, efficiency and measurement into the delivery of care, and an opportunity to mitigate the high costs of uncontrolled diseases.  Join Us: Come join our unique collection of innovative scientists, engineers, market makers, designers, doctors, developers, clinicians, and other digital health industry pioneers, and assist us with achieving our compelling vision, Healthcare for Everyone, Everywhere.  Learn more about what we do (video): https://youtu.be/ImWPu51bR88 Summary: This position is responsible for generating data-based insights on medication adherence, with a focus on characterization of ingestible sensor data. Essential Responsibilities/Duties:Managing analysis of Ingestible Sensor and Wearable clinical studies, including:Maintenance and improvement of the clinical analysis toolset, including automated processing, and databasesDetermining critical statistical tests and visualizations for unlocking insights into system performanceCollecting data into digestible outputs (reports, graphics, presentations), presenting to key stakeholders, and documenting resultsAligning needs and requirements of the clinical teamMining manufacturing, clinical, and product data for insights on sensor performance and potential system/product improvements. Automating and displaying results where possible.Provide subject matter expertise on appropriate statistical analysis and modeling techniques to key technical stakeholdersLearn and understand sensor communication scheme.Support cross-functional efforts to unify data structures across the company, to enable easier end to end access and analysis of data setsIndependently identifies critical data gaps or missing analysis that can provide insight to Proteus, and acts independently to fill these gapsQualifications/Experience:5 years of experience in Data ScienceExtensive knowledge of statistical techniques and modeling, and machine learning algorithmsExperience with automation, database structure, and data pipelinesExcellent written and verbal communication. Capable of leading meetings to present study findingsAbility to work independentlySignificant experience in Python and MATLABExperience with a statistical analysis language, including R or JMPStrong organizational skills with attention to detailEducation:BS, MS, or Ph.D. in Statistics, Engineering, or other quantitative disciplines with emphasis in data science"}