{"jobID": "2829064788", "jobLocation": "San_Jose_CA", "jobTitle": "Council Assistant U (Mayor’s Office - Agenda Services Manager/Policy Analyst)", "companyRating": "3.6", "companyInfo": {"Website": "www.sanjoseca.gov", "Headquarters": "San José, CA", "Size": "5001 to 10000 employees", "Founded": " 1846", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "110000", "jobDescription": "The Office of Mayor Sam Liccardo is recruiting for a full-time Agenda Services Manager/Policy Analyst. In the role of the Agenda Services Manager (ASM), this position interfaces directly with the Mayor, providing him with staff support as he chairs City Council and Committee meetings. This position requires a staff person who epitomizes professionalism in the workplace, who can handle challenging situations with tact and confidentiality, and who is extremely organized.The Agenda Services Manager/Policy Analyst provides staff support for the Mayor at all City Council; Rules and Open Government Committee; and other legislative bodies on which the Mayor serves. This position provides a key interface within the Office of the Mayor and the City Administration (Offices of the City Manager, City Clerk and City Attorney, and departments); the ten City Council members; and the public on matters appearing before the City Council and other issues of concern to our residents. The Agenda Services Manager/Policy Analyst also manages constituent input and concerns received via mail, phone, or email. This position serves as a key member of the policy team for Mayor Liccardo, working on several priority initiatives, making recommendations, and developing action plans for meeting the Mayor’s policy objectives.The position requires an employee with strong and effective organizational skills; ability to handle multiple assignments; excellent written and oral communications skills, and the ability to develop and maintain effective and collaborative working relationships with community members and neighborhood organizations, key stakeholders, and City staff.Typical Duties:Agenda Services Manager (20-30 hours):Staffing Council meetings, Rules meetings, Oversight Board meetings, Special meetings, and Study Sessions, Joint Agency meetingsAttending Council Assistants’ and Rules Assistants’ meetingsPrepare Council meeting binder and Mayor’s scriptPrepare, review, process, and distribute various memoranda for City Council and Rules meetings. Examples of memoranda include:Travel memosCommittee WorkplansInformational memosDraft, prepare, and print Council commendations and proclamations for Mayor’s office, and help revise and print Council commendations and proclamations for other Council officesPlan/coordinate the Mayor’s ceremonials and invocations for Council meetings (communicate with ceremonial recipient(s), choosing a Council date, confirming with Clerk’s office, etc.)Attend training workshops hosted by City Clerk staff on various topics pertaining to public administrationBecome familiar with administrative procedures, including but not limited to: deadlines to submit memoranda and make changes to an agenda, how to submit a travel request form on behalf of Senior Staff, upholding the Brown ActAdvise Mayor and Senior Staff on various Council and City policies related to the Council/Committee meeting Agenda processWork with the Office of the City Clerk and City Manager's Office to coordinate Council meetings, Committee meetings and Study Session logisticsDisclosure forms (fundraising solicitation forms DFR1 and 803), Form 700, Family Gift Reporting, and Outside Income and Employment)PRA request coordinationManage Intern hiring processManage office grants processEERT (evacuation and emergency response team) training and proceduresPolicy Analyst (10-20 hours):Responding to constituent inquiries and issues, resolving complaints, and interpreting operating policies for residents of the community and other interested parties; management of Mayor’s Office e-mail account, records retentionLead initiatives within an assigned policy portfolio. Drive policy priorities through government and legislative process. Research best practices on assigned policy portfolio.Gathering background information relative to issues pending before the City Council, specifically focused on public safety, budget and matters pertaining to neighborhood quality of life.Draft resolutions, commendations, memos and other materials on the City Council agenda.Preparation or assisting in preparation of speeches and talking points for the Mayor.Develop and maintain positive working relationships with council offices, community organizations, residents, business community, non-profit organizations, and government agencies as they are key partners on policy and as a representative of the Mayor’s Office.Coordinate arrangements for meetings, programs or other civic functions on behalf of the Mayor.Attend meetings and community events with the Mayor, requires availability on evenings and weekends.Analyzing a wide variety of materials on assigned projects, programs, and topics.Attending and representing the Mayor at City-related meetings and activities, meeting with governmental agencies, private industry, and related meetings.Performs other duties of a similar nature or level as required."}