{"jobID": "2771458259", "jobLocation": "San_Francisco_CA", "jobTitle": "Clinical Data Scientist / Statistician", "companyRating": null, "companyInfo": {"Website": "www.foresitecapital.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Foresite Capital is a healthcare and life sciences investment firm with a multidisciplinary team of scientists, engineers, analysts, clinicians, subject matter experts, and specialists in various disciplines. We work together in a highly collaborative environment, with all investments getting attention from each member of our investment team. Roles at Foresite Capital offer exposure to multiple firms in the healthcare and life sciences industry, and the opportunity to collaborate with top-tier experts in the life sciences, data science and financial industries. We offer competitive salaries, excellent benefits, a flexible work environment, and the opportunity to learn from top thinkers in various disciplines. Foresite Capital is headquartered in San Francisco with satellite offices in New York, Philadelphia and San Rafael. If youre a data scientist with a strong background with clinical data, lets talk.Role Foresite Capitals data science team are the companys internal experts on the interface of the life sciences and data science, engaging in applied research to advance the standard of biological data science, providing insights to drive the company's investment decisions, and collaborating with our portfolio companies. We develop methods and practices that set standards for rigor in the field, combining cutting-edge techniques with biological understanding and statistical rigor. We are looking for clinically-minded data scientists to bring their skills to our team. We offer a flexible work environment, a diverse set of projects, and a best-in-class peer group to learn from. This is a great opportunity to tackle a unique set of problems while shaping the future of healthcare.Responsibilities Analyze large-scale clinical data to produce novel, high-confidence insights Collaborate with portfolio companies to solve core quantitative and scientific problems Evaluate potential investments through deep technical diligence Develop methods that combine cutting-edge machine learning techniques with deep statistical rigor, particularly in the areas of EHR analysis and causal inference Distribute tools and results through software and publicationsQualifications PhD or equivalent in a quantitative field (e.g., statistics, biostatistics, computer science, or mathematics) 5-10 years of relevant work experience, including postdoctoral fellowships and relevant engagements outside of class work during PhD. Some industry experience preferred but not essential. Experience with statistical software (e.g., R, pandas, sklearn), scripting languages (e.g., Python), and database languages (e.g., SQL). Applied experience with machine learning on clinical datasets, including deep engagement with and modeling of observational clinical data such as EHRs/EMRs and claims Rigorous statistical intuition, deep understanding of core statistical principles, and extensive experience with core methods (e.g., linear regression, GLMs, dimensionality reduction, tree-based models, bootstrapping, maximum likelihood estimation, and Bayesian modeling) Track record of published collaborative research in clinical data research or related fields preferred Foresite Capital is an equal opportunity employer. We thrive on diversity and collaboration.  Please submit a complete CV, not an abbreviated résumé."}