{"jobID": "2824024053", "jobLocation": "Seattle_WA", "jobTitle": "Director, Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.apploi.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "153000", "jobDescription": " The fastest growing Big Four professional services firm in the U.S., KPMG is known for being a great place to work and build a career. We provide audit, tax and advisory services for organizations in todays most important industries. Our growth is driven by delivering real results for our clients. Its also enabled by our culture, which encourages individual development, embraces an inclusive environment, rewards innovative excellence and supports our communities. With qualities like those, its no wonder were consistently ranked among the best companies to work for by Fortune Magazine, Consulting Magazine, Working Mother Magazine, Diversity Inc. and others. If youre as passionate about your future as we are, join our team.  KPMG is currently seeking a , to join our Advanced Data Analytics Organization. Responsibilities: + Develop innovative data science solutions for Fortune 500 clients that utilize natural language processing, optimization, machine learning, econometric and/or Bayesian modelling, while working across a diverse range of domains such as risk management, product development, marketing research, supply chain, and public policy  + Utilize a hypothesis-driven problem-solving approach to design, construct and rapidly test/iterate exploratory analyses that will reveal insight and opportunities for the client  + Utilize a variety of rich variety of data sources such as web data, internal/external documents, emails, financial, transactional, sales, and operational data; identify, review, and integrate data sources and classify the appropriate technologies (SQL, NoSQL, HDFS, S3, Lucene) to store the data  + Stay up to date on research and industry trends, and identify technical areas for opportunity and lead innovation projects that demonstrate value; educate internal and external clients through workshops, and present at conferences, seminars, courses, and training events  + Plan, direct, and build analytics solutions with a team of data science, big data engineers, consultants, and visualization experts; utilize a variety of big data technologies and analytics tools as deemed appropriate and as required by the client; be hands-on as needed to achieve project delivery  + Provide SME support to projects through supporting brainstorming, project scoping, technical approach creation, and technical quality review, while helping manage technical risks, and blockers helping to ensure successful delivery; document approach and underlying design decisions Qualifications: + A minimum of ten of relevant experience and expert knowledge in at least one of the following fields: statistics, data mining, machine learning, statistics, operations research, econometrics, natural language processing, and/or information retrieval  + s degree from an accredited college/university in Computer Science, Statistics, Mathematics, Engineering, Econometrics, or related fields, PhD is preferred  + Proficiency in programming languages (e.g. R, Python, Java, Scala) and ability to deploy tools in a Linux environment; broad understanding of databases (e.g. SQL, NoSQL, Lucene, Mongo), and high-performance or distributed processing (e.g. Hadoop, Spark)  + Ability to translate engagement objectives to a project plan with milestones, and resource/technology requirements, and teach, lead, and manage projects to successful execution  + Ability to work across multiple engagements with clients to assess needs, provide assistance, and resolve problems, using structured problem solving and communication to both technical and non-technical audiences  + Ability to travel up to eighty percent of the time"}