{"jobID": "2788324263", "jobLocation": "Weehawken_NJ", "jobTitle": "Capital Adequacy Committee Support", "companyRating": null, "companyInfo": {"Website": "www.ubs.com", "Headquarters": "Zurich, Switzerland", "Size": "10000+ employees", "Founded": " 1862", "Type": " Company - Public (UBS) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Deutsche Bank, Credit Suisse, Morgan Stanley"}, "estimatedSalary": null, "jobDescription": "Your RoleJoin a dynamic team that is at the forefront of enhancing Capital Governance across UBS Americas. Contribute to a core team with a cross functional mandate interfacing with Business, Risk and Finance legal and regulators. Leverage expertise in corporate governance to establish and maintain a level of excellence for Senior Management ? We're looking for someone who:Coordinating and attending senior management committeesPreparing materials for senior management and committeesServe a quality assurance function as a central point of aggregation for governance materialsDrafting comprehensive meeting minutes to capture and demonstrate effective review & challengeLead effort in tracking and closing out action items raised on governance forumsMaintain version control and ensure presentation materials and minutes are memorialized centrallyAssisting in execution of the Terms of Reference/Mandate and obligations of the committeesCoordinating committee calendar, agenda and logisticsPeriodically assessing the committees governance practices and suggesting opportunities for the committee to better perform its responsibilitiesOther management and corporate responsibilities, as assignedYour teamYou will be part of the CCAR Governance & Oversight team, and you will be working as an assistant to the Secretary for a Senior Management Committee. The focus of this committee is to ensure the capital adequacy of the bank under multiple US regulations. This is a high frequency, cross functional governance body with scope across the entire bank.Your experience and skillsYou have:JD or paralegal experience strongly preferred but not required1+ years in corporate secretary experience preferredBasic knowledge of corporate and securities law, with relevant knowledge of corporate governance practicesExperience with drafting, editing and producing corporate minutesExperience dealing with senior stakeholder and management committeesThe ability to lead and work within a multi-disciplinary setting to achieve consensusBachelor's degree requiredExcellent computer skills, including Microsoft OfficeYou are:Detail-orientedA strong verbal and written communicatorAble to respect and maintain strict confidentiality regarding mattersAble to maintain the appropriate perspective no matter how pressured a situationAble to adeptly manage multiple competing priorities with demanding deadlinesWhat we offer"}