{"jobID": "2826786494", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist 4, Words with Friends", "companyRating": "3.7", "companyInfo": {"Website": "www.zynga.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2007", "Type": " Company - Public (ZNGA) ", "Industry": " Media", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "160000", "jobDescription": " Data Scientist 4  Zynga has one of the largest and most feature rich data sets in the tech industry, and were seeking a Principal Data Scientist to help us drive key product insights that will have big impacts to our games and company! The successful candidate will enjoy combining analytic skills with business acumen to provide our game studios with insights and tools that will drive our continued success.  The Principal Data Scientist will serve as a data-driven advisor and partner on strategic issues and should enjoy both working with people and undertaking rigorous statistical analyses. The candidate must be proactive and self-driven with the ability to understand macroeconomic trends within the mobile gaming industry. This role will require someone who is intellectually curious and wants to learn the gaming business inside and out. This individual will need to be able to tie together structured and unstructured information to help make decisions that delight our players and maximize revenue.  Responsibilities: Product OperationsProvide analytical and data-driven decision-making support for product launches and key projectsDevelop predictive models and execute quantitative analyses that translate data into actionable insightsProvide reporting and performance monitoring to game studios using data drawn from diverse sourcesProduct leadershipProvide guidance on the Data Science and Analytics roadmap: what matters and what should we being doing next?Serve as an evangelist for our data-based solutions. Educate others through formal presentations and other forms of knowledge sharingAdvocate for the adoption of best practices regarding experimentation, coding, and reportingInfrastructure and ToolingAutomate data pipelines, models, analyses, and reporting using distributed infrastructureTransform theoretical and strategic goals into technical products that support live operations and other studio objectives Required Skills: Enjoys playing mobile games (preferred)Ability to identify and execute research projects, and generate practical results and recommendationsExcellent presentation and communication skills; comfortable explaining technical topics to non-technical usersExperience building predictive models in a distributed environment using regression / ensemble methods, clustering analysis, etc.Experience automating analysis using analytics packages in languages like R, Python, and specifically PySpark (ML, MLlib)Experience using tools like Tableau for creating dashboards, reports, and general data exploration (strongly preferred)Comfortable manipulating, transforming, and analyzing complex, high-volume, high-dimensionality data from varying sources; demonstrated expertise with SQLProven ability to work in a fast-paced environment, and to meet changing deadlines and priorities on multiple simultaneous projects; Able to work effectively as an individual and as part of a teamExperience with A/B testing design and read-outs5+ years of experience performing quantitative/statistical analysis, preferably for an internet or technology companyB.S. or B.A. in Math, Statistics, Comp Sci, Engineering, or other technical field required; advanced degrees strongly preferred"}