{"jobID": "2796405534", "jobLocation": "New_York_NY", "jobTitle": "Technical Writer", "companyRating": "3.7", "companyInfo": {"Website": "www.wideorbit.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": "About WideOrbit:WideOrbit is the technology platform for media companies to connect audiences and ads, everywhere. Its mission is to simplify media buying and selling by focusing on innovation, customer delight, and value creation for both sides of media transactions. Starting with its core traffic management solution, WideOrbit centralizes operations and streamlines workflows for radio, cable, and television companies. The company continues to introduce new benefits to the media industry, including a programmatic media exchange for increasing demand for advertising inventory and improving campaign efficiency. WideOrbit is headquartered in San Francisco with offices worldwide. Customers include NBCUniversal, Tribune Media, Entercom Communications, Raycom Media, TEGNA, AMC Networks and many other top media companies around the world.Job Description:We are looking for a technical writing extraordinaire who is self-driven and innovative with strong technical aptitude and a willingness to jump in with both feet. This is not your average everyday technical writer job and you’ll have a voice in the direction of the team and the deliverables that best meet our customers’ needs.In this role, you will be responsible for researching, creating, and testing a large amount of online help for multiple product versions of a business-critical software application. You will work closely with developers, product managers, and testers to gather your information. You will also work with training, implementation, and support teams to improve the content ecosystem. You’ll create release notes, training materials, user guides, and other content that will directly impact our clients’ satisfaction with our products. We are constantly upgrading our many product lines, and the ideal candidate will have a passion to produce clear and useful end-user content, the drive to master the many challenges of a complex business-to-business platform, the insight to turn roadblocks into stepping stones, the persistence to dig in when the going gets tough, and the sense of humor to keep everything a little bit fun.Here is what you’ll be doing:Research, author, and publish outstanding user-facing content (help topics, release notes, user guides) under tight deadlines and short product cycles.Collaborate with Product, Development, Training, and Support to develop content that helps our clients succeed with WideOrbit software. Identify areas to be improved, and advocate for the user during the design and development phases for new features.Deliver professional, accurate, and most importantly, useful content when it’s needed most by our users.Create and own a plan for delivering technical documentation and complete release notes for builds on time.Learn and understand the phases of software development in ad tech, including agile and waterfall methodologies.Read, write, and troubleshoot XML and HTML-based contentHere is what we’re looking for:B.A. or B.S. degree in Technical Communications, English, Instructional Design, Publishing, Project Management, or Broadcasting is preferred, but consideration will be given for equivalent work experience2+ years of experience working with XML-based and Web content management systems (XMeTaL, Help & Manual, Madcap Flare, and others)2+ years of experience working with designers and developers to translate their vision into easy-to-read content for usersConfident, professional, and effective communicator (both verbally and in written form) that can work with all levels and departments in an organization and get his/her point across in a concise, articulate, and congenial wayProactively taking the initiative to research solutions online and come up with creative solutions to content problemsProven ability to succeed in a fast paced and somewhat ambiguous technical environmentAbility to own complex documentation projects with minimal supervision and meet tight deadlines with multiple deliverablesProven ability of creating solutions to complex documentation problems, driving projects to completion, and overcoming the inevitable unexpected project obstaclesExperience working with bug databases and code repository systems (such as SVN or Visual Studio)Strong track record of excellent time management and prioritization in an environment where large volumes of content are produced across multiple subject areasSpecial consideration for the following:Previous work history in WO Network and/or Sales departments within the Cable or TV industryExperience working with CRM, Sales, or Advertising softwareExperience using and documenting large-scale databases and multi-system application client/server configurationsExperience with or understanding of the online, broadcasting, or print advertising industry.Knowledge of broadcast ratings data and advertising rate cards.Location:This position will be based in our New York, NY office. Compensation, Benefits and Perks:Besides a competitive salary and great work environment, here are some of our additional benefits and perks:Health insurance, 401K, stock options, sabbatical leaves, great vacation package, work/life balance, life event benefits, casual work attire, snacks and coffee in the café, and plenty of opportunities to grow! To Apply: Along with your resume, please provide writing samples and/or a link to these samples.WideOrbit is an Equal Opportunity Employer and hires are made without regard to any individual’s race, age, color, national origin, ancestry, disability, veteran status, religion, marital status or domestic partnership; pregnancy, childbirth or related medical conditions; other medical conditions or genetic characteristic; sexual orientation, gender, gender identity or transgender status; or any other basis protected by state, federal or local law, regulation or ordinance. "}