{"jobID": "2803979001", "jobLocation": "Cambridge_MA", "jobTitle": "Undergrad Intern - Summer 2018 - Analytics & Machine Intelligence", "companyRating": null, "companyInfo": {"Website": "www.raytheon.com", "Headquarters": "Waltham, MA", "Size": "10000+ employees", "Founded": " 1922", "Type": " Company - Public (RTN) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Analytics & Machine Intelligence business unit at Raytheon BBN Technologies has been a leader in the research, development, and application of speech recognition and natural language processing technologies for over 30 years. We perform world-class research and routinely transition our technology into solutions for our customers.  Raytheon BBN currently has exciting opportunities available for interns to develop state-of-the-art applications and solutions in speech translation and multi-lingual document image processing. As a research intern, your responsibilities will include one or more of the following in the areas of speech recognition, handwriting recognition, and statistical machine translation: algorithm development, software development, scripting for data pre-processing, analysis of results, and transitioning state of the art systems into production environment.  Sample project work: Work in a team to advance techniques for recognizing and translating speech. Qualifications:Current sophomore or junior aspiring towards a BS degree in Computer Science/Electrical Engineering or relevant fieldSound background in mathematics and statisticsBasic programming skills in Java, C/C++An exceptional individual interested in working on cutting edge technologies This position requires a U.S. person or the ability to obtain an Export Authorization from the appropriate government agency for non-U.S. persons.  116722Raytheon is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, sex, sexual orientation, gender identity, national origin, disability, or protected Veteran status."}