{"jobID": "2787457684", "jobLocation": "New_York_NY", "jobTitle": "GM, Business Operations", "companyRating": null, "companyInfo": {"Website": "www.valuepenguin.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About UsValuePenguin is a successful New York-based personal finance website that draws more than 10 million unique visitors annually. Launched in 2013 by three former Wall Street financial analysts, the site educates consumers on financial decisions, from the impact of a daily Starbucks habit to the choice of a new credit card. Our content, tools, and expertise have been featured in publications such as Time, Washington Post, and CNBC. ValuePenguin prides itself on a culture that’s entrepreneurial, diverse and intellectually curious while also being supportive and committed to career development.OverviewValuePenguin is seeking a strategic and driven General Manager, Business Operations to lead our Financial Products business. The General Manager will directly manage the product team made up of Research Analysts responsible for ValuePenguin’s core business verticals. This team is responsible for driving the growth of our overall business by growing traffic, product coverage and monetization.The GM will have demonstrated an ability to lead a cross-functional team through strategic planning and have a proven track record of driving results. It is critical that the leader has strong executive presence and an ability to lead through influence and navigate ambiguous and complex situations.ResponsibilitiesDrive the strategy and execution of the growth and management of ValuePenguin’s financial product verticalsDirectly manage the financial products business team (currently a team of 10)Help manage the overall P&L; responsibilityWork closely with product, technology and editorial team members to grow our financial products coverage, traffic and revenueLead and manage qualitative and quantitative performance metricsOversee operations, growth and data analytics for this business segmentQualificationsExperience working as a GM or in a similar positionExecutive with a minimum of 5 years of leadership and people management experienceProven track record as a great cross-functional business partnerExperience managing a team of 8+ direct reportsSuccessful track record of managing P&L;Strong communication, organization and project management skillsExperience in planning strategic growth of teamsExperience working at a growing startup is a plusThe Fun StuffThis is an opportunity to join a financially solid, fast-paced and ambitious FinTech StartupWe provide competitive salaries and generous benefits including daily catered lunch, health coverage, 401k plan (with 3% match), unlimited vacation, pre-tax commuter benefits, stocked kitchen, open floor office layout (choose to sit or stand), subsidized Equinox gym memberships and frequent company outingsWe have built a fluid structure where we encourage experimentation, collaboration and open communicationInspiring colleagues that enjoy a good lunch time debateWe are an equal opportunity employer"}