{"jobID": "2801569188", "jobLocation": "Los_Angeles_CA", "jobTitle": "Market Research Intern", "companyRating": "3.1", "companyInfo": {"Website": "www.fuelcycle.com", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Vision Critical, C Space, Toluna"}, "estimatedSalary": "42000", "jobDescription": " FUEL CYCLE’s best-in-class SaaS-based online community platform tells clients exactly what they need to know about their customers across the customer lifecycle. With this information at their fingertips, clients are empowered to make decisions that increase both revenues and long-term customer loyalty.  Fuel Cycle is headquartered in Los Angeles, California with a satellite office in a WeWork space in New York.  As a Market Research Intern you will support your project team in its desire to understand consumers and influence business decisions. Using your attention to detail, creativity and flexibility, you will solve problems and assist team members to help achieve high-quality client results. Executing a wide variety of special assignments and administrative tasks related to research projects; including programming using Survey Gizmo/Qualtrics and other programs, proofreading reports and numerical data, moderating discussion boardsCalculating and assisting in data analysis and proofing numerical data for accuracyProviding switchboard reliefAttending Fuel Cycle internal training seminars with research teamEducation and/or Experience:Business, Math, Psychology, Marketing, Economics, Social Sciences, or other research-related majors preferredPrevious internship or office experience preferredStudents must be currently attending a related course or be interested in learning market research techniques3-4 month commitment, 15-20 hours/weekKnowledge, Skills, and Abilities:Strong written and verbal communication skillsAbility to learn quicklyStrong attention to detailStrong follow-through and analytical skillsAbility to work independently with minimal instructionsMust be dependable and show commitment"}