{"jobID": "2830932294", "jobLocation": "Sunnyvale_CA", "jobTitle": "Software Engineer, Digital Center of Excellence", "companyRating": "2.9", "companyInfo": {"Website": "www.microfocus.com", "Headquarters": "Newbury, United Kingdom", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (MCRO) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " SAP, EMC, Oracle"}, "estimatedSalary": "73000", "jobDescription": " At Micro Focus, everything we do is based on a simple idea: The fastest way to get results is to build on what you have. Our software solutions enable organizations to do just that. Secure and scalable, with analytics built in, they bridge the gap between existing and emerging ITfast-tracking digital transformations across DevOps, Hybrid IT, Security, and Predictive Analytics. In the race to innovate, Micro Focus customers have the clear advantage.  Our portfolio spans the following areas: DevOps | IT Operations| Cloud | Security | Info Governance | Big Data, Machine Learning, & Analytics Take charge of your future and join our dynamic Digital Center of Excellence as we go to market with a best-in-class portfolio that will help shape the worlds software landscape About the Role The Software Engineer, Digital Center of Excellence analyzes, designs, programs, debugs, and modifies software enhancements and/or new products used in local, networked, or Internet- related computer programs, primarily for end users. Using current programming language and technologies, writes code, completes programming, and performs testing and debugging of applications. Completes documentation and procedures for installation and maintenance. May interact with users to define system requirements and/or necessary modifications. The Software Engineer, Digital Center of ExcellenceDesigns limited enhancements, updates, and programming changes for portions and subsystems of end-user applications software running on local, networked, and Internet- based platforms.Analyzes design and determines coding, programming, and integration activities required based on specific objectives and established project guidelines.Executes and writes portions of testing plans, protocols, and documentation for assigned portion of application; identifies and debugs issues with code and suggests changes or improvements.Participates as a member of project team of other software applications engineers and internal and outsourced development partners to develop reliable, cost effective and high quality solutions for assigned applications portion or subsystem.Collaborates and communicates with internal and outsourced development partners regarding software applications design status, project progress, and issue resolution.Education and Experience Required:Bachelor's or Master's degree in Computer Science, Information Systems, or equivalent.Typically 2-4 years experience.Knowledge and Skills:Uses software applications design tools and languages, testing methodology, including execution of test plans, debugging, and testing scripts and tools.Ability to apply analytical and problem solving skills.Designs software applications running on multiple platform types.Strong written and verbal communication skills; mastery in English and local language.Ability to effectively communicate design proposals and negotiate options. If you want to be part of what's next and find out more about our available opportunities, visit Micro Focus Careers.  #LI-SD1"}