{"jobID": "2806680603", "jobLocation": "Boston_MA", "jobTitle": "Senior Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.wayfair.com", "Headquarters": "Boston, MA", "Size": "5001 to 10000 employees", "Founded": " 2002", "Type": " Company - Public (W) ", "Industry": " Retail", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Amazon, One Kings Lane, Crate and Barrel"}, "estimatedSalary": "146000", "jobDescription": "Job Description Product performance incidences, such as damage, lost in transit, etc., negatively impact thousands of customers and account for millions of dollars in lost revenue each year at Wayfair. The Product Performance Analytics team plays a vital role in working with our partners in operations to identify strategic and tactical opportunities to reduce incidence impact using data. We're looking for a talented, self-motivated Data Scientist to join our team. You will be part of an innovative team dedicated to developing top-notch analytical talent through problem-solving and value-creating. You will apply analytical skills and critical thinking to provide insights and recommendations to solve one of Wayfair's most important problems. What you will do:Partner with business partners to understand business processes and data requirements and identify opportunities to use analytics to provide valueDevelop analytical frameworks to address business questions and navigate through data from multiple sources to synthesize what's required to answer business questionsSupervise junior data scientists to apply tools such as SQL, Python and R, and develop machine-learning or statistical models to provide insights to support strategic, tactical and operational decisionsPresent insights and recommendations clearly to diverse stakeholders encompassing all levels of the organization and successfully influence business partners and leadershipExample Projects:Drive the implementation of a supplier score program based on predictive models and collaborate with stakeholders to improve supplier audit effectivenessCollaborate with business partners to develop experiments to evaluate if an operations process change helps reduce product performance incidences and measure the financial impactWho you are:You have at least 3+ years of experience in analytics and data scienceYou have at least 1 year of experience in leading a data science team or executing on large-scale analytical programsYou have a Master or PhD degree in Analytics, Mathematics, Industrial Engineering, Economics, Statistics, Physics, Computer Science or other concentrations with heavy quantitative focusYou possess strong written and verbal cross-functional communication skillsYou are passionate about solving complex business problemsYou are positive, people-oriented, and enthusiastic, and can easily work with others, regardless of their analytical proficiency or technical competencyYou write complex scripts in SQL to query both analytical and transactional databasesYou may have written scripts in Python, R, or other languages used by data scientistsWhat we offer:Fun and collaborative work environmentLimitless career growthFree snacksCasual dress codePaid time offHealth/wellness programsMatching 401KMonthly team outings About Wayfair Inc.  Wayfair believes everyone should live in a home they love. Through technology and innovation, Wayfair makes it possible for shoppers to quickly and easily find exactly what they want from a selection of more than 10 million items across home furnishings, décor, home improvement, housewares and more. Committed to delighting its customers every step of the way, Wayfair is reinventing the way people shop for their homes - from product discovery to final delivery. The Wayfair family of sites includes:Wayfair, an online destination for all things homeJoss & Main, where beautiful furniture and finds meet irresistible savingsAllModern, unbelievable prices on everything modernBirch Lane, a collection of classic furnishings and timeless home décorPerigold, unparalleled access to the finest home décor and furnishings Wayfair generated $5.2 billion in net revenue for the twelve months ended March 31, 2018. Headquartered in Boston, Massachusetts with operations throughout North America and Europe, the company employs more than 8,700 people. This position is ONLY for on-site in our Boston, MA headquarters *SDL2017"}