{"jobID": "2822390505", "jobLocation": "Seattle_WA", "jobTitle": "Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.umbragroup.com", "Headquarters": "Foligno, Italy", "Size": "501 to 1000 employees", "Founded": " 1972", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "64000", "jobDescription": " ApplyDescriptionThe OpportunityUmbra Cuscinetti, Inc., (UCI), located in Everett, WA, is the U.S. base for the Italian-owned UmbraGroup, a visionary operation revolutionizing motion solutions in aerospace, industrial and energy markets. Umbra has been designing and manufacturing precision ballscrews and high precision components for the aerospace industry for over 45 years. The worldwide UmbraGroup supports 18 global aircraft manufacturers and over 60 military, commercial, regional, and business jet aircraft programs. UCI specializes in design engineering, gear manufacturing and complex assemblies for a worldwide clientele. The RoleIn 2017, we went live with an upgraded ERP system, Microsoft Dynamics. This is a brand new package from Microsoft that has elevated our business and propelled our company into a new world of data integrity, analysis and measurement of our company. This summer, we have a wonderful opportunity for an up-and-coming Data Analyst to join our team and help expedite the visualization and analysis of our business performance. You must be a data junkie and an Excel power user. You should have an unquenchable curiosity for new systems, tools and features of our software and the data it supports. Above all else, you must share our UMBRAGROUP values of FIRST - Focus on the Customer, Innovation, Respect, Social Responsibility & Teamwork. MUST BE LOCAL TO GREATER SEATTLE AREA.We expect this project to conclude in September 2018.Specific Responsibilities May IncludeInterpreting data, analyzing results using statistical techniquesDeveloping and implementing data analyses, data collection systems and other strategies that optimize statistical efficiency and qualityAcquiring data from primary or secondary data sources and maintaining databasesInterpret data, analyze results using statistical techniques and provide ongoing reportsDevelop and implement databases, data collection systems, data analytics and other strategies that optimize statistical efficiency and qualityAcquire data from primary or secondary data sources and maintain databases/data systemsIdentify, analyze, and interpret trends or patterns in complex data setsFilter and “clean” data by reviewing computer reports, printouts, and performance indicators to locate and correct code problemsWork with management to prioritize business and information needsLocate and define new process improvement opportunitiesOther duties as assigned.RequirementsTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Must be detail oriented and able to handle more than one task at a time, making sure that each task is followed through to completion.High School Diploma or general education degree (GED) or equivalent combination.Recent completion of a B.S/B.A. degree or anticipated graduation date.Must be knowledgeable in Microsoft Office Suite with expert Excel skills.Ability to read and interpret documents such as safety regulations, operating and maintenance instructions, technical drawings, procedure manuals, and professional journals.Ability to write advanced reports and regular business correspondence.Ability to speak effectively before top management, supervisors, or employees of the organization.Ability to accomplish common mathematical calculations, in all units of measure. Ability to compute rate, ratio, percent, and to draw and interpret bar graphs.Ability to calculate figures and amounts such as proportions/percentages, area circumference and volume.Must be able to communicate effectively, both written and verbally with senior management and suppliers and have better than average interpersonal skills.Must be able to pass a pre-employment drug screen and background check.Work Environment This position is in a standard manufacturing environment. While performing the duties of this job, the employee is exposed to moving mechanical equipment. The noise levels in the work environment are frequently moderate to loud. Safety glasses and safety shoes are required throughout the shop floor and hearing protection is recommended, with the exception of certain manufacturing areas, which require hearing protection at all times. Physical Demands The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. While performing the duties of this position the employee is regularly required to talk and hear. Specific vision abilities required by this job include close vision, distance vision, peripheral vision, and focus adjustment. To perform the job, the employee is frequently required to talk and hear on the telephone, and in person with individuals and groups. The position requires regular use of a compute. The incumbent may occasionally reach with hands and arms. The incumbent is required to read documents in hard copy and electronic form. The incumbent must be able to take instruction from multiple sources and prioritize appropriately. The employee will regularly lift up to 10 pounds and occasionally lift up to 35 pounds. The noise level in the work environment is usually quiet to moderate in an office environment.  If you are an individual with a disability and need a reasonable accommodation in the application or hiring process, please contact Human Resources at 425.405.3500.  All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or age. We are a Drug Free Workplace.  For more information about our commitment to equal employment opportunity, please see these government posters: “EEO is the Law” and its accompanying temporary supplement."}