{"jobID": "2366767188", "jobLocation": "New_York_NY", "jobTitle": "Psychiatry Part Time - Medical Director - Recovery Center", "companyRating": "3.3", "companyInfo": {"Website": "www.pagny.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "221000", "jobDescription": " Overview Physician Affiliate Group of New York (PAGNY) is comprised of nearly 4,000 physicians and healthcare professionals who provide services to NYC Health + Hospitals, the largest public health system in the United States. Our practitioners are highly skilled professionals with outstanding credentials who deliver the highest level of quality healthcare to patients throughout New York City. Equal Employment Opportunity Employer M/F/D/V. Lincoln Medical & Mental Health Center, located just 15 minutes from NYC, is an acute care teaching hospital academically affiliated with Weill-Cornell Medical College. Dedicated to providing high quality patient care to a diverse community, Lincoln Hospital is a NYS designated Level I Trauma and Stroke Center and has Centers of Excellence in all medical specialties including its awarding winning Cancer and Breast Centers. ResponsibilitiesMedical Director for Chemical dependency treatment program - supervises care rendered to clients; provides direct care including assessment, medication assisted treatment; psychiatric treatment. Also will serve as teacher to residency program in area of addictions and psycho-dynamic psychotherapy (this particular candidate) will participate in expansion of chemical dependency services hospital-wide, attend Grand Rounds and Departmental meetings.QualificationsPsychiatry Residency, ABPN certificationExperience in addictionsPsychoanalytic training PAGNY offers a generous benefits package, competitive salary, loan repayment eligibility and visa sponsorship!"}