{"jobID": "2808889927", "jobLocation": "Seattle_WA", "jobTitle": "Senior Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.indeed.com", "Headquarters": "Austin, TX", "Size": "5001 to 10000 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Simply Hired, CareerBuilder, Glassdoor"}, "estimatedSalary": "84000", "jobDescription": " Ref#: P1288 Our mission.  As the world’s number 1 job site, our mission is to help people get jobs. We need talented, passionate people working together to make this happen. We are looking to grow our teams with people who share our energy and enthusiasm for creating the best experience for job seekers. The team.  We are a rapidly growing and highly capable engineering team building the most popular job site on the planet. Every month, over 200 million people count on us to help them find jobs, publish their resumes, process their job applications, and connect them to qualified candidates for their job openings. With engineering hubs in Seattle, San Francisco, Austin, Tokyo and Hyderabad, we are improving people's lives all around the world, one job at a time. Your job. As a Data Scientist at Indeed your role is to follow the data. Analyze, visualize, and model job search related data. You will build and implement machine learning models to make timely decisions. You will have access to unparalleled resources within Indeed to grow and develop both personally and professionally. We are looking for a mixture between a statistician, scientist, machine learning expert and engineer: someone who has passion for building and improving Internet-scale products informed by data. The ideal candidate understands human behavior and knows what to look for in the data.  About you. Requirements Ph.D. or M.S. in a quantitative field such as Computer Science, Operations Research, Statistics, Econometrics or MathematicsExpertise in machine learning and statistical modeling5+ years professional or research experience in data sciencePassion to answer Product/Engineering questions with dataDemonstrated mentorship experience We get excited about candidates who Have full stack experience in data collection, aggregation, analysis, visualization, productionization, and monitoring of data science productsCan do small data modeling work: R, Python, Julia, OctaveCan do big data modeling work: Hadoop, Pig, Scala, SparkCan fish for data: SQL, Pandas, MongoDBCan deploy data science solutions: Java, Python, C++Indeed provides a variety of benefits that help us focus on our mission of helping people get jobs.  View our bounty of perks: http://indeedhi.re/IndeedBenefits "}