{"jobID": "2261908841", "jobLocation": "New_York_NY", "jobTitle": "Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.datadoghq.com", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "138000", "jobDescription": " Were on a mission to bring sanity and clarity to Dev & Ops. We collect an extraordinary amount of data every second from customers all over the world. We need you to design and build machine learning-powered products that help our customers learn from their data and make better decisions in real-time.  You will have a fantastic team of data engineers to support you, a collaborative environment to encourage your work, and the best technologies for performing data science at high scale in your toolkit.  Join us to build powerful, intelligent data systems. What you will doApply machine learning algorithms and statistical techniques to build new product featuresExplore and find meaning in extremely high volumes of dataUse Python, Hadoop, Pig, Spark, Luigi and other open-source big data componentsJoin a tightly knit team solving hard problems the right wayOwn meaningful parts of our service, have an impact, grow with the companyWho you must beYou have a BS/MS/PhD in a scientific fieldYou have significant experience applying statistics, probability, and machine learning to real business problemsYou have mastered working with data in Python, R, or JuliaYou can explain complex ideas and algorithms in understandable waysYou want to work in a fast, high growth startup environment and thrive on autonomyBonus PointsYou are fluent with SQL / relational algebraYouve done data science at high scale with tools like Hadoop and SparkYou've written production data pipelinesYouve learned a handful of languages beyond Python and R Is this you? Send your resume and link to your GitHub."}