{"jobID": "2827610644", "jobLocation": "Boston_MA", "jobTitle": "DATA ANALYST II", "companyRating": "4.0", "companyInfo": {"Website": "www.massgeneral.org", "Headquarters": "Boston, MA", "Size": "10000+ employees", "Founded": " 1811", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " CareGroup, Beth Israel Deaconess Medical Center, Boston Medical Center"}, "estimatedSalary": "62000", "jobDescription": " The Mongan Institute for Health Policy is seeking a full-time Data Analyst to provide analytic support for research activities within the Program for Clinical Economics and Policy Analysis. Specifically, the Data Analyst will work with a team of investigators on externally funded research studies that focus on examining the clinical and economic effects of health care policy, including Medicare financing, insurance coverage expansion, and mental health services research. The Mongan Institute for Health Policy (MIHP) is a leading Harvard health policy institute housed within Massachusetts General Hospital. Founded by Partners HealthCare System and Massachusetts General Hospital in 1998, the MIHP conducts research to support improvements in quality and efficiency within Partners HealthCare, to inform and influence health policy on the national level, and more broadly, to improve health and health care across America and in other nations worldwide.Reporting to John Hsu, MD, MBA, MSCE, the Data Analyst will play a key role in conducting health policy research. These studies will produce generalizable, publishable findings. The Data Analyst will work collaboratively with a team of investigators, including health services researchers, clinicians, economists, and biostatisticians, as needed. The Data Analyst will be responsible for translating research questions into analytic plans; analyzing data, including medical and pharmacy claims data and clinical data; conducting valid statistical tests and statistical models, and assisting in communicating findings in presentations and manuscripts. We are looking for someone with advanced biostatistics training and experience analyzing healthcare claims and administrative data. The Data Analyst will be involved in all aspects of data management and will work with other team members by providing analytic skills for new and ongoing projects. Specific tasks will include: extracting, managing, and analyzing medical and pharmacy claims data; working with investigators and staff to obtain and combine additional data sources to answer new/refined study questions; creating longitudinal patient cohorts that can be analyzed over time; evaluating the impact of health policies on health care costs, utilization and quality; and conducting valid statistical tests and advanced modeling. As part of all of these activities, the Data Analyst will apply excellent data cleaning, organizing and statistical programming skills. Qualifications MPH or Masters Degree in Biostatistics, Statistics or closely related field Biostatistics background with advanced knowledge of statistical testing Familiarity with medical/pharmacy claims data Research experience a plus General Skills Superior organizational and data management skills Practical problem solving abilities, i.e. the ability to formulate hypotheses, test options and move forward in a fast paced environment Ability to work well with individuals at all levels within the institution Strong analytic and computer skills with extensive knowledge of database management Ability to work both independently and as part of a team Excellent graphic and tabular presentation skills Technical Skills Biostatistics background with advanced knowledge of statistical testing and multivariate modeling required Strong programming skills in SAS or STATA required, willing to learn other programming languages as necessary Relational database experience (MS Access, Oracle, and/or SQL server) Massachusetts General Hospital is an Equal Opportunity Employer. By embracing diverse skills, perspectives and ideas, we choose to lead. Applications from protected veterans and individuals with disabilities are strongly encouraged. EEO Statement Massachusetts General Hospital is an Equal Opportunity Employer. By embracing diverse skills, perspectives and ideas, we choose to lead. Applications from protected veterans and individuals with disabilities are strongly encouraged.  Partner's Healthcare is acting as an Employment Agency in relation to this vacancy."}