{"jobID": "2716788067", "jobLocation": "New_York_NY", "jobTitle": "Marketing Insights Manager", "companyRating": null, "companyInfo": {"Website": "www.ubimo.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Full-time position, New York City, USAWe are looking for an experienced individual with passion for understanding consumer journeys. The candidate would have proven ability to generate actionable marketing insights via mobile location data. The ideal candidate is experienced Data Analyst / Researcher with an emphasis in verticals like retail, QSR, CPG, Auto, adtech, publishing, etc. The Marketing Insights Manager will be responsible for generating marketing insights in content that will demonstrate Ubimo’s superior location intelligence technology. Deliverables will be celebrated and publicized via various forms, including: Published research, Infographics, Quarterly industry reports /reviews, etc. The position reports to the Head of Marketing and working closely with a content writer at Ubimo’s NYC office.We are looking for an experienced individual with passion for understanding consumer behaviors. The Marketing Insights Manager will be responsible for generating marketing insights and content that will demonstrate Ubimo’s superior location intelligence technology.The candidate would have proven ability to generate actionable marketing insights using mobile location data. The ideal candidate is experienced Data Analyst / Researcher with an emphasis in verticals like retail, QSR, CPG, Auto, adtech, publishing, etc. Deliverables will be celebrated and publicized via various forms, including: Published research, Infographics, Quarterly industry reports /reviews, etc. The position reports to the Head of Marketing and working closely with a content writer at Ubimo’s NYC office. ResponsibilitiesOwn the process of ideation, prioritization, production and release of research projectsExecuting research projects, developing and apply methods for measuring and analyzing audiences, points of interest, patterns and trendsPresent insights, collect feedback and iterate as needed. Develop storylines together with the content team and support the writing process with data as needed.Provide the sales team with ad-hoc research to support the sales process.Develop and document research processes and methodologies to ensure research consistency and quality.Minimum Qualifications5 years work experience in a similar role. Practical experience in quantitative analysis at marketing insights/consulting firms/marketing and media research companies (e.g.: Nielsen / ComScore).BA/BS or MS degree in Statistics or other quantitative disciplines such as Data Sciences, Engineering, Applied Mathematics, etcExperience with large data sets using statistical software (ideally: R, S-Plus, Matlab, or similar) Experience with large large databases (SQL - a must) and codingAdvanced Excel skillsStrong experimental design and analysis skillsStrong communication skills are a mustAbility to draw conclusions from data and provide well articulated recommendations with an external/marketing oriented perspectiveDemonstrated leadership and self-direction as well as ability to take initiative Positive energy and can-do attitude Strong team spirit "}