{"jobID": "2808489098", "jobLocation": "New_York_NY", "jobTitle": "Trading Partner Manager", "companyRating": null, "companyInfo": {"Website": "www.availity.com", "Headquarters": "Jacksonville, FL", "Size": "501 to 1000 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Passport Health Communications, MedAssets, Claimlogic"}, "estimatedSalary": null, "jobDescription": "Availity delivers revenue cycle and related business solutions for health care professionals who want to build healthy, thriving organizations. Availity has the powerful tools, actionable insights and expansive network reach that medical businesses need to get an edge in an industry constantly redefined by change.The Manager’s mission is to proactively focus on relationship management, strategic account planning, contracting, and identification of revenue enhancement and optimization opportunities. They are focused on connecting key business executives and stakeholders to advance Availity product lines and drive the increase of transaction volumes via the Availity platform.The Manager will participate in both existing and net new partnership strategy discussions, business contracting, and managing Trading Partner and Aggregator partnerships. Trading partners include clearinghouses, practice management system vendors, electronic medical record vendors, IPAs, LAB and HIS Systems. The Trading Partner Manager will be required to review existing partnerships to determine roadmaps for additional integration and increased transactions to promote revenue growth. Partnerships are established and fostered at the appropriate levels of clearinghouse and aggregator organizations resulting in providing Availity platforms access to commercial, private, and government payers.The position requires a self-starter who requires minimal supervision, strong business acumen, and excellent relationship management skills. Up to 30%travel is required.KEY RESPONSIBILITIESOwns the relationship between clearinghouse and/or aggregator accounts, IPAs, LABS, HIS Systems and Availity, and acts as the primary point of contact for contracting, accountability, escalation and resolution of issues originating from customers or internal teams.Develops a trusted advisor relationship with key accounts, customer stakeholders and executive sponsors.Drives increased revenue for a portfolio of accounts with goal of achieving and exceeding personal and company goals.Identifies new sales opportunities (Additional EDI/B2B/API or product and/or support) within existing accounts to remain a client-account manager relationship by upselling and cross-selling.Responsible for writing strategy, setting objectives, and obtaining new business and upselling existing accounts.Maintains technical knowledge, professional skills, and market knowledge by attending industry workshops, tradeshows, client meetings, professional societies, and reviewing professional publications.Responsible for identifying and qualifying leads, negotiating, and contracting partnerships.Ability to create a presentation, then clearly and concisely deliver to Directors, VP’s, and C-level executives clearly and conciseDemonstrated subject matter expert on partnerships and integrations for all internal departments.Responsible for building strong inter-departmental relationships to achieve individual, team, and corporate objectives.Assists with market opportunity identification for Clearinghouse Product Manager.Responsible for building strong inter-departmental relationships to achieve individual, team, and corporate objectivesCommunicates with accounts on a regular basis based on tier structure and need, via newsletters, email, phone, and/or face to face meetingsOccasional travel to various home offices, partner location, sales shows, user group meetings, etc. is requiredThe above cited duties and responsibilities describe the general nature and level of work performed by people assigned to the job. They are not intended to be an exhaustive list of all the duties and responsibilities that an incumbent may be expected or asked to performEDUCATION AND EXPERIENCE5+ years of experience in direct sales or account management (with revenue targets)Demonstrated ability to meet quantitative goals, take direction, and work independentlyTrack record of consistently achieving and exceeding quotasBachelor’s degreeStable job historyAbility to accommodate up to 30% travelSKILLS AND KNOWLEDGEAbility to balance duties from an operational function (pre-sales & post-sales) to C-Suite level relationship buildingAbility to multitask and perform well under pressureExceptional communication abilities: oral and writtenStrong presentation skills and ability to present to large groupsStrong conflict resolution skillsStrong time management, organizational, analytical, and problem-solving skillsAbility to operate strategically and consider the “big picture”Knowledge of the clearinghouse and/or healthcare technology industryDemonstrated sales closing skillsContract negotiation experienceDemonstrated ability to use discretion and make sound decisions under pressureAbility to adapt to change of process and/or directionsCUSTOMER SCOPE (ADDITIONAL SPECIFICATIONS FOR JOB POSTING)External clearinghouses and any vendor business line that aggregates on behalf of their providers and/or members. IPAs, TPAs and small payers.Internal liaison to all functioning departments and platformsAvaility is an equal opportunity employer and makes decisions in employment matters without regard to race, religious creed, color, age, sex, sexual orientation, gender identity, gender expression, genetic information, national origin, religion, marital status, medical condition, disability, military service, pregnancy, childbirth and related medical conditions, or any other classification protected by federal, state, and local laws and ordinances.Availity is a drug-free workplace. Candidates are required to pass a drug test before beginning employment.NOTICE: Federal law requires all employers to verify the identity and employment eligibility of all persons hired to work in the United States. When required by state law or federal regulation, Availity uses I-9, Employment Eligibility Verification in conjunction with E-Verify to determine employment eligibility. Learn more about E-Verify at http://www.dhs.gov/e-verify.Click the links below to view Federal Employment Notices.Family & Medical Leave Act Equal Employment Law Poster Pay Transparency Employee Polygraph Protection Act IER Right to Work Poster Employee Rights Under Federal Labor Laws"}