{"jobID": "2827232246", "jobLocation": "San_Francisco_CA", "jobTitle": "Manager, Data Scientist (Margin)", "companyRating": "3.5", "companyInfo": {"Website": "www.schwab.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1973", "Type": " Company - Public (SCHW) ", "Industry": " Finance", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "140000", "jobDescription": " Description:San Francisco - CA, BRCAS2, 211 Main Street, 94105  Lance Alan Britton  20180606-3787 We believe that, when done right, investing liberates people to create their own destiny. We are driven by our purpose to champion every client’s goals with passion and integrity. We respect and appreciate the diversity of our employees, our clients, and the communities we serve. We challenge conventions strategically to create value for our clients, our firm and the world. We live and bring to life the concept of ‘own your tomorrow’ every day. We champion our employee strengths, guide their development, and invest in their long-term success. We hire optimistic, results-oriented, curious, innovative, and adaptable people with the desire to help our clients and one another succeed.  As a company, we were established by Chuck over 40 years ago to champion Main Street over Wall Street, and to help Americans transform themselves from earners to owners. Through advocacy and innovation, we work to make investing more affordable, accessible and understandable for all. As we enter our fifth decade, we are looking for talented, innovative and driven people who believe they can help themselves, and our clients, create a better future. Our Opportunity: The Cash and Margin strategy team is looking for a results-driven team player to help drive analytics related to Schwab’s margin product. The Manager of Margin Analytics will work collaboratively with the margin product team, the cash and margin strategy team, and cross-functional business partners on every step of the data analysis.  An individual in this role will have the opportunity to apply rigorous data analytics to inform and direct strategic projects that have firm-wide impact while building subject matter expertise and industry knowledge in both the banking and brokerage industries.  Individuals must have superior partnering skills as work typically requires a coordinated effort with team members and business partners in the margin product group. Members of the team who are highly successful demonstrate the ability to think creatively, develop recommendations that are data driven/fact-based, deliver results in a matrixed organization and have the flexibility and maturity to handle ambiguous situations. Individuals with a bias for action and the ability to overcome obstacles to successfully execute on multiple projects simultaneously tend to perform well in the role. What you’ll do:Work with management and peers on all stages of model development and presentation, including:Identifying the problem,Writing complex SQL code to pull data from Schwab’s data warehouse,Summarizing data and results in tables and graphs using Excel and Tableau,Developing presentations in Power Point to present results and recommendations to stakeholders.Where appropriate, developing Excel models to facilitate decision-making related to the margin productWhere appropriate, developing statistical or machine learning analysis in Python or RDesign, build, and maintain business dashboards for senior management to monitor key business results and initiatives.Identify and utilize different analytics tools (Excel, Python, R, SAS, etc.) and statistical techniques to perform the analyses necessary for a variety of projectsWhat you have:Bachelor's degree required in statistics, economics, applied mathematics, or other quantitative field; Post-grad degree preferred4+ years of work experience on a highly analytical role;Advanced knowledge of SQL;Excellent skills in Excel;Experience with statistical modeling;Excellent communications skills: ability to convey complex information clearly and concisely in both verbal and written form to a variety of audiences;Excellent data-presentation skills, experience with Tableau a plus;Demonstrated ability to work collaboratively;Strong attention to detail;Comfortable working concurrently on multiple projects and deliverables with minimal supervision.What you’ll get:Comprehensive Compensation and Benefits packageFinancial Health: 401k Match, Employee Stock Purchase Plan, Employee Discounts, Personalized advice, Brokerage discountsWork/Life Balance: Sabbatical, Paid Parental Leave, New Mothers returning to work Program, Tuition Reimbursement Programs, Time off to volunteer, Employee Matching Gifts ProgramEveryday Wellness: Health and Lifestyle Wellness Rewards, Onsite Fitness Classes, Healthy Food Choices, Wellness ChampionsInclusion: Employee Resource Groups, Commitment to diversity, Strategic partnershipsNot just a job, but a career, with an opportunity to do the best work of your life Learn more about Life@Schwab.  Charles Schwab & Co., Inc. is an equal opportunity and affirmative action employer committed to diversifying its workforce. It is Schwab's policy to provide equal employment opportunities to all employees and applicants without regard to race, color, religion, sex (including pregnancy, childbirth, breastfeeding, or related medical conditions), gender identity or expression, national origin, ancestry, age, disability, legally protected medical condition, genetic information, marital status, sexual orientation, protected veteran status, military status, citizenship status or any other status that is protected by law. Schwab also does not discriminate against applicants or employees because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. At Schwab, we believe that every employee, through their diverse abilities and experiences, can contribute to our growth, innovation and client loyalty. We embrace diversity and are committed to providing equal opportunity to all employees and applicants. If you have a disability, and require reasonable accommodations in the application process, call Human Resources at 800-725-3535. We will be happy to assist you. Schwab will only share your accommodation request with those individuals who have a specific need to know. The request for an accommodation will not affect Schwab's hiring decisions. All other submissions should be performed online.Job Specifications  Relocation Offered?: No Work Schedule: Days Languages: English - spoken Current Licenses / Certifications: None Relevant Work Experience: Analyst/Strategy-2-5 yrs Position Located In: CA - San Francisco Education: BA/BS Job Type: Full Time Category:Marketing Analytics  Activation Date: Saturday, June 23, 2018  Expiration Date: Wednesday, August 1, 2018  Apply Here"}