{"jobID": "2736245964", "jobLocation": "Hercules_CA", "jobTitle": "Master Data Analyst TEMP ( Customer Master COE)", "companyRating": "3.1", "companyInfo": {"Website": "www.bio-rad.com", "Headquarters": "Hercules, CA", "Size": "5001 to 10000 employees", "Founded": " 1952", "Type": " Company - Public (BIO) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Thermo Fisher Scientific, Abbott Labs, bioMérieux"}, "estimatedSalary": "74000", "jobDescription": " The Customer/Vendor Master Center of Excellence (COE) is responsible for data quality and data processes for the Customer and Vendor data domains. They work with management to ensure data management initiatives and sustaining processes are aligned with the strategic business objectives of the corporation. The COE is responsible for implementing the Corporate Data Policy, the Data Quality Program, and supporting compliance and audit of data for Sarbanes-Oxley and other regulatory requirements within their data domain. The primary measure of success for the COE is sustainable data quality for their data domain as measured and reported by the users of the data. Review SAP MDG customer and vendor create and update change requests for adherance to global design and data quality.Work with DMO Manager to ensure the alignment of the IT support systems to Business Data requirementSupport Data Management Office in establishing and enforcing standard methodologies for the data components of Business ProjectsMonitors compliance with data security requirements by the Custodians and approves data access requests for CustodiansProvide leadership for definition, approval, publication and maintenance of the Corporate Data Policy and supporting guidelines, standards and procedures for their data domainProvide authority to Data Custodians to create and enforce data quality and data process standardsSponsor definition, approval and execution of the Corporate Data Quality Program for their data domainDevelop recommendations for data programs and initiatives relative to their data domain for input to the funding processesAssist with the resolution of Data integration issuesRecommend adjustments to data policies and procedures as necessary to improve key performance indicatorsField calls from Data Custodians and users within their business area. Resolves routine data problemsIdentify root causes of data quality problems within their business area and identifies sustainable solutionsDevelop and performs independent data quality analyses relevant to Customer/Vendor Master domainEnsure Data Custodians are kept informed of changes in data standards and processesTrain Custodians on proper updating and use Customer/Vendor Master DataBA/BS in business or equivalentProficiency in excel is mandatoryExperience in Master Data Governance, SAP 6.3 or higherAttention to detailExperience in an FDA or cGMP environment is a plusStrong business acumen with 3 yrs+ of manufacturing operational experience and a functional understanding of financial operations from corporate, regional and local perspective.Ability to decompose complex processes into sub-processesExcellent oral, written and presentation skills; communicate effectively with diverse people at various organization levels with right level of detail and cultural sensitivityFlexible and open to new ideas with the ability to understand things from corporate, regional and local perspective while maintaining customer focusProven ability to work in an ambiguous environment; self-motivated to work in an independent and collaborative modeAbility to build strong relationships with peers and leaders by building trust and credibility; strong collaboration skillsActive listening skills to understand business needs and steer business team to take decisions that have enterprise-wide impactEffective meeting management skillsEffectively manage a team of individuals without reporting authority to achieve goals and meet deadlinesProficiency in American English language is a must. Verbal and written forms of communication.Proficiency in a non-English language (French, German, Italian, Dutch and/or Spanish) is a plusDemonstrates Company mission and core values in daily activitiesSavvy user of technologyProven problem solving skillsFamiliar with root cause analysis techniqueOvertime flexibility is a plusDemonstrates ability to train, teach or coach business professionalsAbout Bio-Rad: Bio-Rad is a global leader providing a broad array of clinical diagnostics and life science research products. With a team of more than 7,800 employees and a global network of operations serving our customers, we help people live longer, healthier lives.  Bio-Rad was founded over six decades ago and has continued to provide the healthcare industry with innovative and useful products that help life science researchers accelerate the discovery process and medical diagnostic labs obtain faster, better results.  EEO/AA Employer/Veterans/Disabled/Race/Ethnicity/Gender/AgeTo all recruitment agencies: Bio-Rad does not accept agency resumes, unless the agency has been authorized by a Bio-Rad Staffing Representative. Please do not submit resumes unless authorized to do so. Bio-Rad will not pay for any fees related to unsolicited resumes."}