{"jobID": "2411884458", "jobLocation": "San_Francisco_CA", "jobTitle": "Software Engineering Intern", "companyRating": "4.6", "companyInfo": {"Website": "www.sighten.io", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "52000", "jobDescription": "Sighten is a San Francisco start-up driving greater adoption of renewable energy by connecting investors to clean energy projects through an integrated, cloud-based software platform. The platform's solar system design, pricing, asset management and analytics features are gaining traction in the rapidly expanding residential solar market - driving Sighten's growth and creating a pipeline of challenging and exciting coding projects. The Sighten software stack includes core solar production and asset pricing algorithms written in C++ and Python, a full Django web platform with an integrated REST Web Service API, and a robust client application built on the AngularJS JavaScript framework. Position:Software Engineer interns will tackle mission-critical coding projects essential to the growth of the company, and well aligned with their own strengths, interests, and professional/educational goals.RequirementsA positive, \"can-do\" attitude Team player who loves to code and collaborateInterested in working at a start-up and quickly taking on responsibilityExperience with Python or JavaScriptExcited about renewable energy growthBonus Relational database experienceWeb development experience with MVC framework (preferably Django)Front-end development experience (JavaScript/HTML/CSS)Familiarity with JavaScript frameworks (Angular, Ember, etc.)Perks:- Potential for full-time employment offer at end of internship- An incredible learning experience!- Company events: Sporting events, outdoor excursions, etc.- Central downtown San Francisco location- Company food and happy hours- Casual and friendly work environment"}