{"jobID": "2605013509", "jobLocation": "New_York_NY", "jobTitle": "LED Field Engineer (Digital Signage) - East Coast", "companyRating": "3.8", "companyInfo": {"Website": "www.cri.com", "Headquarters": "Louisville, KY", "Size": "51 to 200 employees", "Founded": " 1997", "Type": " Company - Public (CREX) ", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": " We are looking for AV Field Engineers with experience installing, implementing, and troubleshooting large scale LED displays.  We have 3 available openings and would like a presence in the following areas: Northeast (New York/ surrounding area)Westcoast (LA/Phoenix/surrounding area)Midwest (Louisville/surrounding area)Key ResponsibilitiesTravel between 50% to 75%, up to 90%Coordinate with PM to assure handoff of details prior to installation.Coordinate final installation schedule with customerEvaluate site at start to installation to assure it is ready to begin installation. If changes are required, work with GC to assure changes are completed properly.Be the liaison between company and final customer, knowing all players involvedTrain installation team on details and proper installation process for the particular product, project and site conditions.Assure that the display is being installed properly and meets installation standards. This is hands on continual work with the install team.Configure the display and do associated testing to assure DIU is working properly with display.If required, perform calibration of display on site.Work with customer to assure the head end equipment is working properly with the display.Finalize all on site testing and commissioning of the display.Fill out and present final project closeout form and spare parts form to customer for approval.Coordinate packing and shipping of triage kit and other misc. parts and equipmentInventory management at site from initial uncrating through final packing and shipping components and ensuring returning to inventoryEducation and ExperienceTechnical Degree in engineering preferred or equivalent experience.Mechanical and electrical aptitudeField experience on installations, working directly with customers and with construction general contractorsAbility to use MSOffice and similar software packagesKey Competencies/BehaviorsStrong attention to detail.Self-motivated with a drive to succeed in a dynamic environmentAbility to find creative solutions to problems in the fieldWork independently or within a diverse team framework (well-developed interpersonal skills).Flexible and willing to do what is needed to help the team deliverBenefits Medical, Dental, Vision, Life, Long & Short Term Disability, Paid Time Off, Paid Holidays, 401K"}