{"jobID": "2823288791", "jobLocation": "San_Jose_CA", "jobTitle": "Territory Manager", "companyRating": null, "companyInfo": {"Website": "www.americanhotel.com", "Headquarters": "Vernon Hills, IL", "Size": "501 to 1000 employees", "Founded": " 1865", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Medline Industries, W.W. Grainger, Essendant"}, "estimatedSalary": null, "jobDescription": " Now celebrating over 150 years of business as a leading distributor in hospitality, American Hotel Register Company has always invested in the passion of talented people. Put your skills to work for American Hotel, and build an exciting career with a company that’s at the forefront of an evolving industry.  TERRITORY MANAGER/ OUTSIDE SALES - San Jose  The Territory Manager‘s primary responsibility include creating end user demand for American Hotel products and services. The Territory Manager will be responsible for an assigned group of customers within San Jose area from Palo Alto to Monterey/Carmel.The position requires focus on both relationship building and new business development with Hotels, Management Companies and Group Purchasing Organizations. The majority of new business is generated through the Territory Manager’s initiatives.  Job Responsibilities Applicant must be well organized, able to analyze sales and business reports to help drive businessAbility to develop rapport with client management and maintain strong working relationshipsPersuasive negotiator with ability to clearly communicate to effectively close businessPromotes customer service excellence by providing superior service to each customer technical specificationsExperience managing accounts and targeting prospects within defined territorySelf-confidence in a variety of settings with an unshakable belief in own success and capabilitiesStrong organizational skills to prioritize and handle several tasks at onceSelected candidate will need to attend 2 weeks initial training session at our corporate headquarters in Vernon Hills, Illinois  Work with us. Grow with us. We go above and beyond to offer our associates a variety of tools and support– including an excellent benefits package, flexible working hours, leadership development programs, wellness initiatives and paid time off as well as paid volunteer hours that enable our associates to lend their time and talent to a wide range of community organizations. Equal Opportunity Employer: Minorities, Women, Veterans, Disabilities  www.americanhotel.com"}