{"jobID": "2807992388", "jobLocation": "San_Jose_CA", "jobTitle": "Apartment Maintenance Technician III", "companyRating": "4.4", "companyInfo": {"Website": "www.elevatetosequoia.com", "Headquarters": "Walnut Creek, CA", "Size": "201 to 500 employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " Unknown / Non-Applicable", "Competitors": " Greystar, FPI Management"}, "estimatedSalary": "24", "jobDescription": " As a lead Service Technician with Sequoia, your hands on work will be essential to the operation of a multi-million dollar property.  You’re an expert at home remodel and repair. You can rewire electrical switches, know the parts of an HVAC system, and repair appliances. You love troubleshooting and fixing things. When you must call on help for a complex job, you make sure the contractor gets the job done right the first time.  You love to make people’s day and service with a smile is never optional.  You are in it to win it.  We’re not just any property management company. Join us as we elevate the industry.  This position is for a new acquisition in the East Bay of San Francisco.  Must haves: Positive attitudeOrganizationSpeedSense of humorOn call availabilitySuperior knowledge of home maintenance Great to haves: Renovations or construction experienceGeneral contractor, journeyman, electrician, or other skilled tradeMaintenance certification (if you don’t have it, we’ll help you get it) What we’ll do for you: Provide a great place to work – you’ll want to show up and give your best self everyday, we promiseAllow you to crush it – by providing you the best training programs in the industryMake sure you’re covered – superior health, dental, and vision insurance and a 401(k) program/match that keeps you on track for your futureGive you a break – paid time off for vacation, sick days, holidays, and your birthdayReward you – apartment rent discounts, fun days, generous monthly perks, cash bonuses, and recognition for a job well doneLet you give back – through our purpose program Sequoia Equities is an Equal Employment Opportunity employer and promotes a drug free workplace."}