{"jobID": "2655667689", "jobLocation": "Sunnyvale_CA", "jobTitle": "Systems Research Intern", "companyRating": null, "companyInfo": {"Website": "www.baidu.com", "Headquarters": "Beijing, China", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Public (BIDU) ", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Baidu Research, headquartered in Silicon Valley, is looking to hire Systems Intern with a background in high performance parallel computing, computer architecture, system software, or machine learning. Baidu's research mission is to develop hard AI technologies that will impact hundreds of millions of users. Our Silicon Valley Artificial Intelligence Lab (SVAIL) develops state-of-the-art AI technologies that require bleeding-edge systems to improve accuracy, scale, and performance.  Our systems researchers address the many systems challenges that arise as we extend the AI state-of-the-art. We support AI team members by researching the emerging challenges when mapping machine learning applications to large-scale computing systems. As an intern in the Systems team, you will learn about deep learning and how to build computer systems and technologies that support large models and datasets.  By providing great hardware infrastructure, learning opportunities, and connecting you with a great AI research team, we aim to maximize the significance of your systems research. Here's what you will do:Develop and perform systems research to advance AI state-of-the-art. This includes literature review, developing proofs-of-concept, and implementing solutions to real AI application challengesCollaborate highly-talented systems and machine learning team to create a highly productive and efficient platform for large scale deep learning research and AI applicationsCommunicating your research both internally among AI researchers and externally through presentations and paper publicationsLearn about high performance computing (HPC) systems, and about machine and deep learning algorithms.Here's what we'd like to see in you: Very strong technical skills: Pursing a Ph.D in a related discipline (computer architecture, high performance computing, system software, or machine learning) with track record of influential systems research.Strong software engineering concepts (Object-oriented programming, templates, API design) and skills (able to write clean, efficient code, testing). C++ proficiency is a plus.Deep technical expertise in one of the follow computer system domains: computer architecture, programming models and compilers, systems software , or parallel programmingCulture fit:Mission alignment: If you want to use your systems skills to advance AI, we will give you the best possible platform to do that. If you are on a different mission, then we are not a good fit.Self-directed: We work best with people that are driven, motivated, and aspire to greatness. Are you the sort of person that, if you had time on your hands, will independently find interesting and useful things to do?Hungry to learn: We are eager to teach you new skills. But learning is hard work and this is something we hope you want to do.Team orientation: We work in small, fast-moving teams. We don't believe in lone wolves. We watch out for each other, and go after big goals together---as a team. We are based in Silicon Valley, in Sunnyvale, California."}