{"jobID": "2735568358", "jobLocation": "Austin_TX", "jobTitle": "Sr Data Scientist - Autonomy", "companyRating": "4.6", "companyInfo": {"Website": "www.sparkcognition.com", "Headquarters": "Austin, TX", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "116000", "jobDescription": " SparkCognition is looking for innovative Data Scientists to join our team to help create the next generation of analytics and artificial intelligence solutions. At SparkCognition, you will immerse yourself in cutting-edge research and work with the latest reinforcement learning technologies to deliver value for defense, security, and maintenance applications  Responsibilities  Building models to solve specific problems. This includes, but is not limited to:  Processing, cleansing, and verifying the integrity of data used for analysis  Feature engineering using various techniques for the enhancement of data  Performing feature selection on original and generated data  Using machine learning tools to develop and train models  Performing efficacy testing of the models  Building automated tools that enable data scientists to more effectively perform tasks such as data cleaning, feature generation, feature selection, or model building  Performing ad-hoc analysis and presenting results in a clear manner  Working with a team to help solve new, never-before-solved challenges in autonomous operation and coordination.  Skills and qualifications  Understanding and experience using machine learning techniques and algorithms, including but not limited to: Linear Models, Neural Networks, Decision Trees, Bayesian Techniques, Clustering, Anomaly Detection, and more  Experience with data science languages, such as Python, R, MatLab, etc  Experience with machine learning frameworks, such as TensorFlow, PyTorch, Theano, Keras, etc  Experience with deep reinforcement learning techniques such a policy gradient and actor/critic (e.g. DDPG and PPO) and toolkits like OpenAI gym.  Experience managing large volumes of data (terabytes or more)  Great communication skills  Good scripting and programming skills, especially Python  Graduate degree (or equivalent industry experience), Ph.D. preferred, in Computer Science, Statistics, Physics, Mathematics, or a related scientific discipline *US citizenship required Desirable skills and qualifications  Active US security clearance  Experience with simulators like Gazebo, AirSim, Unity ML, etc  Experience with developing application on full stack of HTTP, JSON, REST, React, Java/C#, SQL and no-SQL databases. SparkCognition is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity and/or expression, national origin, protected veteran status, disability, genetics, or citizenship status (when otherwise legally authorized to work) and will not be discriminated against on the basis of such characteristics or any other status protected by the laws or regulations in the locations where we operate. If you need assistance or an accommodation due to a disability, you may contact us at accommodations@sparkcognition.com"}