{"jobID": "2820775207", "jobLocation": "Austin_TX", "jobTitle": "Software Engineer, Intern", "companyRating": "3.3", "companyInfo": {"Website": "www.kapsch.net", "Headquarters": "Vienna, Austria", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Subsidiary or Business Segment", "Industry": " Telecommunications", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "58000", "jobDescription": " Kapsch TrafficCom is a leading global provider of intelligent transportation systems (ITS) and offers solutions across our customers’ entire value chain – from single products and components, to fully integrated turnkey systems and solutions in the applications of electronic toll collection, commercial vehicle operations, and highway traffic management. The Company is headquartered in Vienna, Austria with North American headquarters in McLean, Virginia and offices throughout the United States (Virginia, Georgia, New York, New Jersey, Texas, California), Canada (Mississauga) and Mexico (Mexico City). The Role We have an immediate opening for a Software Engineering Intern who has a desire to develop their skillset in a dynamic, project-based environment. In this role, you will assist with the development of electronic toll collection solutions by working on projects that focus on:  Image ProcessingEmbedded C++Web UI/UXMiddle Tier Interfaces Our work is deadline-focused and project-based, using a generic core that is customized/extended for individual customers. We have the best, most reliable, and most accurate system in our market space -- independent audits have proven this to be true.  We also have a great culture, positive work environment and offer competitive salary packages which include parking. Education and Experience: 0-2 years’ experience working with one or more programming languages, in professional environment OR Current undergraduate student, with Junior status, in a science, technology, engineering, or mathematics (STEM) related discipline. “Big picture” thinking with regard to design and solution architectingTechnical Proficiency: Introductory college level understanding of at least two of the following: HTML, CSS, JavaScript, Java, C++ Understanding of object-oriented programming and concepts Effective written and verbal communication skills"}