{"jobID": "2805314292", "jobLocation": "Seattle_WA", "jobTitle": "Data Scientist, Analytics - Developer Ecosystem", "companyRating": "4.5", "companyInfo": {"Website": "www.facebook.com", "Headquarters": "Menlo Park, CA", "Size": "10000+ employees", "Founded": " 2004", "Type": " Company - Public (FB) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Google, Snap, Uber"}, "estimatedSalary": "139000", "jobDescription": " Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities we're just getting started.Facebook relies on a strong ecosystem of developers to build on top of our experiences to enable business. Being a global platform, it's impossible to build for every business case internally. Instead we empower developers to provide business solutions that help all businesses grow on Facebook. Our ecosystem supports millions of developers who impact a large portion of the businesses on Facebook's platform.  In this role, you will be helping the developer ecosystem team build a platform that is working to build systems that more effectively enable businesses to leverage Facebook tools and enable businesses to more easily create meaningful and lasting relationships with their customers while also protecting the people that use Facebook. In this role, you will be working with a strong analytics team, as well as cross-functionally with product, and engineering teams to define the future state of this platform. We are looking for a thought leader who can break down complex systems and ambiguous problems into actionable insights that can be used to better understand the ecosystem and direct strategic decision making. Some examples of big questions that we are hoping to answer in the next year are: How do B2B apps and developers differ in their behaviors from B2C apps and developers? How do developers and the ecosystem impact the ability of businesses to grow on Facebook? Are there meaningful differences in impact to businesses that develop their own apps compared to those that use third part solutions? Responsibilities:"}