{"jobID": "2830583587", "jobLocation": "Somerville_MA", "jobTitle": "Digital Marketing Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.thegrommet.com", "Headquarters": "Somerville, MA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "51000", "jobDescription": " The Grommet is seeking an analytical self-starter to join our Ecommerce Marketing Team as a Digital Marketing Analyst. This role will help grow The Grommets customer base and revenue through day-to-day execution and optimization of digital marketing campaigns. This person will work closely with other team members to deliver efficient new customer acquisition and return on ad spend goals.  The Digital Marketing Analyst will support a wide range of Acquisition Marketing activities to varying degrees including: SEO, Paid Search, Facebook ads, Pinterest ads, Product Feeds, Affiliate Marketing, and Display Marketing.  This position will report to our Director of Acquisition. Key Activities:Manage various acquisition campaigns, identify efficiency and scaling opportunities, and continually optimize to achieve campaign goalsDevelop and implement A/B tests (creative, copy, audience targeting) to improve campaign performanceWork with Product and Engineering teams to implement SEO recommendations and landing page testsCollaborate with other marketing team members to implement integrated cross-channel marketing campaignsReport on campaign performance regularlyStay abreast of and advise on industry trends and best practices.Desired Skills & Experience:Bachelor's degree in quantitative field such as math, finance, statistics, economics, or related experienceHighly analytical and data-drivenA quick learner who can easily adapt in a fast-paced, dynamic environmentA master multi-tasker, capable of juggling and prioritizing multiple responsibilitiesFamiliar with various online marketing channels and best practices1-3 years digital marketing experience, preferably in an e-commerce environmentExperience working with various marketing tools and platforms, such as Google Analytics, Facebook Ads Manager, Google Adwords, and bid management toolsStrong excel skillsKnowledge of SQL preferred but not required"}