{"jobID": "2720074085", "jobLocation": "Melville_NY", "jobTitle": "Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.newsday.com", "Headquarters": "Melville, NY", "Size": "1001 to 5000 employees", "Founded": " 1970", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": " Newsday Media Group (NMG) is one of the nation’s most dynamic media organizations, serving Long Island and New York City through its portfolio of mobile and digital products, print publications and live events. With 19 Pulitzer Prizes and other esteemed awards for outstanding journalism, our mission and vision is to engage consumers and businesses by connecting them to the communities in which they live, work and play.  NMG properties include the award-winning Newsday, Newsday.com; amNewYork, New York City’s most widely circulated free daily paper along with its mobile app and amNY.com; Newsday Connect, the digital solutions company serving Long Island business owners; and Newsday Local Publishing, one of the Northeast's largest groups of weekly shopper publications.  Newsday is looking for a Data Analyst to join their team in Melville, NY. The Data Analyst will apply a logical, systematic approach to problem-solving using mathematical and statistical techniques and/or innovative/quantitative analytical approaches to identify insights and make recommendations to resolve business problems and help drive change. This involves gathering, manipulating and synthesizing data, models and other relevant information to draw conclusions to business questions and make recommendations that assist in driving and informing our print and digital Audience Development strategies. Qualifications:BA/BS degree with 1-3 years experience, or MA/MS/MBA degree, with preferred majors in Data Science, Financial Engineering in Business Intelligence & Analytics, Statistics, Applied Mathematics, Decision Sciences, Applied Social Sciences, Management Information Systems or other related discipline.Experience/knowledge of descriptive and inferential statistics, data transformation and statistical modeling using R or SAS; understanding of database design and SQL queries desirableComfortable integrating and manipulating complex, high-volume, high-dimensionality data from varying sourcesKnow Your Audience: Communicate complex quantitative analysis in a clear, precise, and actionable manner to both technical and non-technical groups; report complex research and modeling results in a visual and intuitive mannerData-Minded: A strong passion for empirical research and for answering hard questions with dataSolution-Oriented: Have business skills to understand problems and build the algorithms necessary to find the right answersEnergy and Passion: Thrive in a dynamic environment, both autonomously and on a teamInterest/Knowledge in a selection of the following; Building and applying machine learning / predictive modelling in real-world use cases; / operations research problems;Partner with consultant to develop specifications and monitor progress for complex analytical assignments.Desk jobs are largely sedentary roles that would require one’s ability to sit for extended period of time up to full 8 hour shift; may occasionally lift up to 25 lbs. for files and supplies; ability to reach, bend. Newsday Media Group is an Equal Opportunity Employer and maintains a drug-free and smoke-free workplace."}