{"jobID": "2605886832", "jobLocation": "El_Segundo_CA", "jobTitle": "Software Engineering Intern", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Software Engineering Intern  Do you love Disruptive Technology, Big Business Opportunities, Space, Big Data Analytics, Computer Vision or AI? We do! At Slingshot, we are charting the intersection of GIS, remote sensing imagery, machine learning, and big data technology!  Slingshot employs team members from a variety of disciplines, including technical and engineering fields. We are a small team with plans for rapid growth. We currently looking to fill a new position as an embedded systems engineer at the Los Angeles facility. You will be in a lead role implementing digital signal processing modules in software.  The ideal candidates should be working towards a Masters or PhD in Computer Science/Engineering or Electrical Engineering Geomatics, or related fields and possess strong programming skills. Research background in Remote Sensing, Computer Vision, Environmental Modeling and Mathematics are a plus.  Slingshots interns will gain experience in architecting highly scalable, distributed systems using big data technologies, designing and optimizing large multi-terabyte data lakes and distributed systems while working directly with expert engineers and highly experienced project managers. Interns will work in an agile team environment directly partnered with the project manager, data architects, software engineers, and business analysts to facilitate the development of Slingshots data platform architecture and analytical tools for delivery of user specific products.  This is an exciting opportunity for talented and hard-working students who are interested in developing the next-gen geospatial AI to gain hands-on experience developing next to top-rated developers and world class mentors.  Basic requirements: Strong foundation in machine learning and data mining algorithmsSolid background in SQL/NoSQL databasesHands-on experience with Amazon Web ServicesHands-on experience with big data technologies such as Spark, Kafka, Hadoop, Hive, PigHands-on experience with data visualization such as ZeppelinHands-on programming skills in Python, C++, or JavaDemonstrated ability to create, invent, and be innovativeAbility to work both independently and collaboratively in a fast-paced research environmentEnthusiasm for pursuing new challenges and technologiesMS degree in computer science, electrical engineering, or equivalent experience in statistics, machine learning, image processing or fields with heavy focus on these disciplines Preferred background (not required):  Data analysis / machine learning algorithm development using Python, Matlab, etcExcellent critical thinking capabilitiesSuperb communication skills. Youll need to be able to explain yourself and your methods both within the companyStrong Unix/Linux skillsKnowledge of assembly level programmingExperiences of software development under real-time operating system Your commitment:  Full Time Internship If youre interested in this role, let us know. Tell us what excites you and why you would be a good fit. Looking forward to hearing from you!"}