{"jobID": "2522940123", "jobLocation": "Long_Island_City_NY", "jobTitle": "Senior Logistics Manager", "companyRating": null, "companyInfo": {"Website": "www.airseapacking.com", "Headquarters": "London, United Kingdom", "Size": "Unknown", "Founded": " 1966", "Type": " Company - Private", "Industry": " Transportation & Logistics", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Senior Logistics Manager The qualified individual will be responsible for leading and managing all aspects of a logistics operation to ensure consistent high level service quality and customer satisfaction, profitable, cost efficient operations, and compliance with company policies and procedures. Ideally strong knowledge in domestic rounding with connection to the van lines industry is desired, along with the ability to build our existing network to service all major cities in the U.S. DUTIES AND RESPONSBILITIES • Lead, direct and manage a logistics operation to ensure that the staff executes on delivering consistent high quality level service and customer satisfaction; and achieves a profitable, cost efficient operations in compliance with company policies and procedures,  • Maximize profitability through superior customer service, effective and prompt communications and follow-up on all pending customer matters.  • Manage periodic process reviews for each client.  • Utilize effective communication or negotiation skills, employing diplomacy and sensitivity to resolve critical or escalated issues affecting the customer, staff, or senior management.  • Maintain performance statistics and ensure accurate record keeping of all operational documents.  • Works with operation leadership to plan and monitor daily staffing schedules and adjusts accordingly to ensure adequate staffing levels that support operational demands and business objectives.  • Work with senior management to develop a business plan and goals for department.  • Ensure directives, rules and procedures are communicated to all operations' staff.  • Manage and oversee administrative functions to ensure all paperwork is processed efficiently and in a timely manner.  • Ensure safety methods, practices and programs are implemented and maintained.  • Ensure that freight is moved safely and in a timely manner utilizing appropriate equipment and tools.  • Utilize superior communications skills to motivate staff and develop effective working relationships with peers, executives and clients.  • Train and certify new employees on all performance standards.  • Personally coach, train and mentor direct reports and provide career development opportunities through training and quality management activities.  • Supports the annual performance reviews process for all staff within department.  • Keep abreast of emerging technology changes and innovations through formal or informal study, reading business and professional publications, networking and participation in professional organizations.  • Perform other duties as needed.  EDUCATION AND EXPERIENCE  High School Diploma or GED required.  Bachelor’s Degree in Business Administration, Transportation, Logistics, Supply Chain Management or a related field preferred; or an equivalent combination of work and education; or an equivalent combination of work experience.  Minimum six to eight years related experience.  • Minimum five years industry experience preferred.  • Minimum five years supervisory or managerial experience required.  SKILLS REQUIRED  • Must be able to read, write and speak English fluently.  • Ability to communicate and interact effectively with people from multi-functional and diverse backgrounds.  • Ability to read, analyze and interpret general business periodicals, professional journals, technical procedures, or governmental regulations.  • Ability to write reports, business correspondence, and procedure manuals.  • Ability to effectively present information and respond to questions from management, employees and vendors.  • Computer literate. Intermediate level proficiency in Microsoft Office, internet, web-based and related job specific software applications.  • Experience with Voxme applications preferred.  • In-depth knowledge of all company products and services.  • Highly experienced in the management of logistics operations.  • Experienced in inventory management and reconciliation.  • Demonstrated success in leading, managing and developing staff and high performance teams.  • Ability to manage the financial aspects of a department (purchasing, budget preparations and review, financial reporting and monitoring expenses).  • Demonstrated leadership skills in influencing departments and implementing and managing change.  • Experience in strategic planning and execution.  • Exposure to project management methodologies with a focus on developing solution driven strategy plans to achieve goals, implementing business requirements analysis and testing processes, and identifying timeline constraints, and risks."}