{"jobID": "2806975130", "jobLocation": "Culver_City_CA", "jobTitle": "Crackle Data Science Business Intelligence Intern, SPT - Fall", "companyRating": null, "companyInfo": {"Website": "www.sonypictures.com", "Headquarters": "Culver City, CA", "Size": "1001 to 5000 employees", "Founded": " 1982", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Universal Studios, Warner Bros., Disney Studios"}, "estimatedSalary": null, "jobDescription": " Crackle Data Science Business Intelligence Intern, SPT - Fall 2018The Data Science and Business Intelligence team’s vision is to provide the Crackle family with timely and useful information to help monitor our performance at a business and at an operational level. The aim is to aid our departments in using this data to visualize and quantify the results of their innovative solutions using advanced analytics. RESPONSIBILITIES:Design, develop, and maintain innovative reports & dashboards using Tableau and other data visualization toolsBuild automated tools and frameworks to monitor internal and external data stacks across programming, marketing, sales, and productCreate topical research decks for sales support, including information on consumer trends in online video, mobile advertising, connected devices, advertising products, cross platform measurement and overall media marketplacePerform statistical analysis on the data from various sources using tools like R, Alteryx, ExcelGenerate regular reports using SQL from Snowflake Data WarehouseQUALIFICATIONS:Enrollment in an accredited college/university for the duration of the internshipPassion and focus on analytics, big data, and digital mediaExperience in data analysis, forecasting, and data visualizationInterest in entertainment, marketing, television, and moviesPreferred experience with Adobe/Google analytics, Microsoft Excel, SQL and RPerform studies to gain deeper understanding of how people consume streaming videoAbility to translate data into insights for use in sales support materials (ComScore, Nielsen, Conviva or similar)SPE INTERN PROGRAM DETAILS: The Sony Pictures Entertainment Internship program offers a unique opportunity to work alongside the teams that come together to create movies, TV shows, and other great experiences. These seasonal paid assignments provide meaningful and productive work that allow you to build your resume, experience and develop your skills further. You will be provided with challenging tasks, real-world experience, valuable networking opportunities, and many educational and social opportunities while on the lot.  This Fall internship is from Tuesday, September 11th through December 14th but is flexible with start date based on school schedule. All candidates must be able to work between 10-29 hours and be currently enrolled in a college or university  *Sony Pictures Entertainment is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, national origin, disability, veteran status, age, sexual orientation, gender identity, or other protected characteristics.USA - Culver City - Studio Lot - Harry Cohn Bldg"}