{"jobID": "2619670242", "jobLocation": "New_York_NY", "jobTitle": "Sales Development Rep, Enterprise", "companyRating": null, "companyInfo": {"Website": "www.wayup.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " WayUp is the go-to platform for millions of early-career professionals to explore job and internship opportunities, receive advice, and get discovered by employers. Top companies from startups to Fortune 500s use WayUps platform to reach, recruit and engage with the new generation of early-career talent. Since launching in 2014, WayUp has helped millions of candidates launch their careers.  We are looking for an Enterprise Sales Development Representative who can own the entire first half of the Enterprise Sales Cycle, and partner with Account Executives to drive new business. This role will be responsible for initiating all net new sales, qualifying leads, and growing our business on our Enterprise team. We are looking for someone who is driven, reliable, passionate about sales, and cares about WayUp's mission of connecting students and recent grads with awesome opportunities. This is an amazing opportunity to gain experience selling to Enterprise clients and learn the full scope of an Enterprise deal (large clients with 1000+ employees). RESPONSIBILITIESCold call and email enterprise companies and qualify leadsMaster WayUp product offerings to best pitch and present to product to prospective clientsConvey the full scope of WayUps products and services to new customersIdentify new businesses and contacts through lead generation, research and data gatheringManage all data and activity through Salesforce and master all enablement toolsWork collaboratively with Enterprise Account Executives & entire Sales org.REQUIREMENTSBachelor's or Associate's degree1-3+ years experience in a customer facing roleStrong organizational and time management skillsExcellent verbal and written communication skillsCold Calling & Cold Emailing experience a plusExcellent strategic and critical thinkerAdapt discipline to dedicate multiple hours each day to calling people on the phoneExcellent interpersonal skills - necessary for communicating via phone with a variety of clientsAbility to multitask, showcase attention to detail, as well as prioritize deadlinesAbility to be creative, resourceful, and autonomous in a startup environmentDesire to achieve and exceed sales goals - self-starting attitude is a must!PERKS & BENEFITSComprehensive Healthcare Plan (Medical, Dental, Vision)401k Plan through MassMutualWeekly Catered Team LunchMonthly Lunch & Learns with Industry Leaders, CEOs, VC's and moreUnlimited Sick DaysPre-Tax Commuter & FSA BenefitsContinuous Education StipendOffice Snacks, Cold Brew and Lots of Dogs! By submitting your application, you agree to submit a list of references as part of the interview process and consent to WayUp contacting these references.  The Company values the array of backgrounds, talents and perspectives that a diverse workforce brings. All qualified applicants will receive consideration for employment without regard to actual or perceived race, religious creed, color, national origin, ancestry, physical or mental disability, medical condition, genetic information, marital or familial status (including registered domestic partnership status), sex and gender (including pregnancy, childbirth, lactation and related medical conditions), gender identity and gender expression (including transgender individuals who are transitioning, have transitioned, or are perceived to be transitioning to the gender with which they identify), age, sexual orientation, Civil Air Patrol status, military and veteran status, certain arrest or conviction records, domestic violence victim status, and any other consideration protected by federal, state or local law (collectively referred to as \"protected characteristics)."}