{"jobID": "2692456652", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist, Clinical Informatics - Health Informatics (CLIN INFORMATICS SPEC 4", "companyRating": "3.9", "companyInfo": {"Website": "www.ucsfhealth.org", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1907", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Stanford Health Care, Dignity Health, Sutter Health"}, "estimatedSalary": "138000", "jobDescription": "At UCSF Health, our mission of innovative patient care, advanced technology and pioneering research is redefining what’s possible for the patients we serve – a promise we share with the professionals who make up our team.  Ranked by U.S. News & World Report as the number one hospital in California – and among the top five in the country – UCSF Health is committed to providing the most rewarding work experience while delivering the best care available anywhere. In an environment that allows for continuous learning and opportunities for professional growth, UCSF Health offers the ideal atmosphere in which to best use your skills and talents.Department DescriptionThe Advanced Analytics and Innovation (A2I) team of UCSF Health Informatics is a small team that collaborates closely with clinical and business stakeholders throughout the health system to lead and support initiatives that advance the patient care, research, teaching, and public service missions of UCSF Health.  The A2I team convenes as a group and with the rest of UCSF Health Informatics on a weekly basis to address the informatics needs of the health system. The A2I team also collaborates with the Clinical Systems (EHR) teams, including the data reporting team and the Epic build team, to design and implement novel solutions for healthcare value and quality improvement.Job SummaryThe Data Scientist will derive, validate, and analyze large data sets, and develop novel predictive models using statistical techniques and machine learning, with a goal of deploying these to impact the delivery of patient care in real-time.  The Data Scientist will frequently analyze problems without precedent and/or existing structure within UCSF Health, and address complex problems with an organization-wide scope. He or she will serve as a mentoring resource to advance understanding of data science within the health system. The Data Scientist will develop comprehensive expertise in the predictive modelling module of the Epic Electronic Health Record, and serve as a collaborator and reference for improvement activities involving predictive modelling, implemented in the Epic EHR and outside it.  Competitive applicants for this position are data scientists or quantitative analysts who have experience in delivering actionable findings from large data sources. Candidates are ideally fluent in programming languages such as R, SQL, or Python, or other tools used for data manipulation and visualization and have a background in machine learning.  Prior relevant work with clinical data, and/or the Epic electronic health record, is favorable but not required.Required QualificationsThree to five years of experience in positions of increasing responsibility, working with large datasets and conducting statistical and quantitative modeling, melding analytics with strong programming, data mining, clustering and segmentationBachelor’s degree and a combination of 6 years of education and work experience in predictive modelling, machine learning, and or a related quantitative field (Computer Science, Physics, Mathematics, Statistics, Bioinformatics, etc.)Strong data and statistical programming skills. e.g. SQL, Python, R, Stata, SAS, SQL, Hadoop, Hive, and/or other large data systemsData scientist with in-depth knowledge and experience with machine learning and predictive analytics, proficiency in R or Python programming languages, or other tools used for data manipulation and visualization, and experience working with data warehouses. In-depth knowledge of all relevant clinical informatics software and systems, and of the highly-complex concepts, principles, policies, methodologies, techniques, best practices, regulations, and standards practices involved with patient care and electronic medical data management in the UC health care systemBroadly encompassing and highly in-depth knowledge of machine learning, and deployment of predictive analytics in operational environments. Knowledge of controlled terminology, clinical workflows, user interface optimization, clinical decision support, rules development, data integration and mining, clinical ontologies and adoption of technology. (clinical domain knowledge is preferred but not required, and may be developed or expanded after hiring)Advanced organizational and project management skills, with the ability to lead a team, prioritize tasks, and see projects through from inception to completion on scheduleAdvanced interpersonal communications skills, to convey highly technical information and instructions to all levels of clinical users in a clear and concise manner, to provide technical support, and to develop and deliver training materials as neededAbility to apply advanced problem-resolution skills to highly complex issues, quickly diagnose problems, and develop, test, and implement appropriate and effective solutions in a timely mannerAdvanced analytical skills and expertise in documentation and reporting, with the ability to apply metrics, design and run queries, collect and analyze performance data, and produce sophisticated reports and analyses for management useAdvanced ability to serve as a technical leader and information resource, and to work collaboratively with senior staff and management across departments, providing advice, counsel, and analysis on issues of policy, functionality, system efficiency, upgrades, business analytics, and industry advances and trendsStrong interest in working with health care data and understanding the challenges that face complex health care delivery systemsThe flexibility to orient and work at all UCSF Medical Center locationsPreferred QualificationsCompletion of one to two years of undergraduate or graduate level coursework in StatisticsMaster’s degree or Doctorate in computer science or related areaBackground in STATA and/or SASPrior experience with healthcare data, in particular Epic-derived healthcare dataLicensure/CertificationN/ALiving Pride StandardsService Excellence Demonstrates service excellence by following the Everyday PRIDE Guide with the UCSF Medical Center standards and expectations for communication and behavior. These standards and expectations convey specific behavior associated with the Medical Center’s values: Professionalism, Respect, Integrity, Diversity and Excellence, and provide guidance on how we communicate with patients, visitors, faculty, staff, and students, virtually everyone, every day and with every encounter. These standards include, but are not limited to: personal appearance, acknowledging and greeting all patients and families, introductions using AIDET, managing up, service recovery, managing delays and expectations, phone standards, electronic communication, team work, cultural sensitivity and competency.Uses effective communication skills with patients and staff; demonstrates proper telephone techniques and etiquette; acts as an escort to any patient or family member needing directions; shows sensitivity to differences of culture; demonstrates a positive and supportive manner in which patients / families/ colleagues perceive interactions as positive and supportive. Exhibits team work skills to positively acknowledge and recognize other colleagues, and uses personal experiences to model and teach Living PRIDE standards.Exhibits tact and professionalism in difficult situations according to PRIDE Values and PracticesDemonstrates an understanding of and adheres to privacy, confidentiality, and security policies and procedures related to Protected Health Information (PHI) or other sensitive and personal information.Demonstrates an understanding of and adheres to safety and infection control policies and procedures.Assumes accountability for improving quality metrics associated with department/unit and meeting organizational/departmental targets. Work Environment Keeps working areas neat, orderly and clutter-free, including the hallways. Adheres to cleaning processes and puts things back where they belong. Removes and reports broken equipment and furniture.Picks up and disposes of any litter found throughout entire facility.Posts flyers and posters in designated areas only; does not post on walls, doors or windows.Knows where the Environment of Care Manual is kept in department; corrects or reports unsafe conditions to the appropriate departments.Protects the physical environment and equipment from damage and theft. The flexibility to orient and work at all UCSF Medical Center locations is required.Equal Employment OpportunityThe University of California San Francisco is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, protected veteran or disabled status, or genetic information. Further information about the University of California, San Francisco, is available at diversity.ucsf.edu. UCSF seeks candidates whose skills, and personal and professional experience, have prepared them to contribute to our commitment to diversity and excellence, and the communities we serve."}