{"jobID": "2724683809", "jobLocation": "New_York_NY", "jobTitle": "Tax Manager - M&A;", "companyRating": "3.5", "companyInfo": {"Website": "www.rsmus.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1926", "Type": " Private Practice / Firm", "Industry": " Accounting & Legal", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "128000", "jobDescription": " RSM US LLP is looking for a dynamic M&A; Lead Tax Manager to join our national Mergers and Acquisitions (M&A;) Tax group. This is a rapidly growing consulting practice with significant advancement opportunities. We advise multinational corporations, privately held companies, partnerships, and private equity firms on the tax aspects of planning, structuring, and executing  M&A; transactions.  Responsibilities: Work as a part of a multi-disciplinary team that focuses on delivering due diligence and tax structuring services, and communicates findings and opportunities to clientsWork with and assist other senior members of the M&A; Tax practice with various technical tax issues dealing with consolidated returns, S Corporations, partnerships, and limited liability companiesAssist clients with reorganizations, bankruptcy emergence planning, out of court workouts, debt restructurings, tax basis, Earning and Profits, and Section 382 studiesManaging multiple engagements simultaneously and working with all M&A; colleagues across the enterpriseDevelop, motivate, and train staff and senior level team members Qualifications: 4+ years of federal tax with mergers and acquisition experience in a public accounting firm, a corporate tax department, or a law firmBachelor's degree from an accredited college/universityCPA or J.D./LL.MKnowledge of a broad range of corporate tax matters in various industriesAbility to handle multiple engagementsExcellent research and writing skills You want your next step to be the right one. You've worked hard to get where you are today. And now you're ready to use your unique skills, talents and personality to achieve great things. RSM is a place where you are valued as an individual, mentored as a future leader, and recognized for your accomplishments and potential. Working directly with clients, key decision makers and business owners across various industries and geographies, you'll move quickly along the learning curve and our clients will benefit from your fresh perspective.  Experience RSM US. Experience the power of being understood.  RSM is an equal opportunity/affirmative action employer. Minorities/Females/Disabled/Veterans. "}