{"jobID": "2778273402", "jobLocation": "San_Jose_CA", "jobTitle": "Executive Chef", "companyRating": "3.1", "companyInfo": {"Website": "www.guckenheimer.com", "Headquarters": "San Mateo, CA", "Size": "1001 to 5000 employees", "Founded": " 1965", "Type": " Company - Private", "Industry": " Restaurants, Bars & Food Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "77000", "jobDescription": " Food. Cooking. Creativity. Is this your life? Do you believe that commitment unlocks unlimited potential? We are the perfect Company to launch or further your career. We are all about great ingredients, culinary innovation and nourishing inspiration. Oh yeah, we don't work weekends unless we are opening a new location or kicking it at some cool industry event.  Guckenheimer, is a national foodservice management company that pioneered restaurant style, healthful dining in the workplace. We encourage our team members to join in community events such as Chef Ann Foundation to support the #RealSchoolFood campaign, promoting cooking healthy meals with real ingredients at schools., Second Harvest Food Bank, Girls on the Run, and many more community programs.  We offer fantastic health and wellness benefit options that include but not limited to medical, HSA, a rewarding wellness program, dental, vision, FSA, commuter benefits, EAP, free meal each day, free pair of safety shoes at time of hire, and much more. Guckenheimer's own Learning Management System at your fingertips and a yearly tuition reimbursement program will enable you to enhance your career development in your new and exciting position with Guckenheimer!  We encourage you to apply to our Executive Chef opportunity and bring your knowledge and passion of high quality food and customer service to our culinary program. Responsibilites:Responsible for the effective and efficient operation of a restaurant culinary department within the guidelines established by the Company.Maintain budget in all financial areas – food, labor, operating costs. Maintaining accurate financial records. Forecast, plan, purchase, and receive for operating needs and supplies. Complete an accurate inventory each financial cycle.Menu Planning in a creative manner utilizing your culinary skill and experience in developing menus and utilizing the utmost in sustainable and organic products. Maintaining accurate food production records.Ensure all food Preparation and cooking is of high quality tasty well presented foods for each day’s menu utilizing HACCP guidelines and procedures. Also including breakdown and cleanup of area, maintaining a sanitary/clean environment.Responsible for all catering functions. Receiving catering orders and coordinate service with individual customers; working with the customer for planning of the event, if necessary - ensuring accurate cost effective pricing Ensure preparation, delivery, display of hot and cold catering and/other foodstuffs are completed.Employee training and development to include but not limited to food quality and presentation, food safety, safety, customer service.Superior interpersonal skills leading your staff to the highest standard of the CompanyKnowledge and implementation of Local, State, and Federal Labor Law regulationsEffective communication with employees, customers, and all levels of management in the Company utilizing superior customer service.Detailed oriented and ability to multi-task working independently with minimal directionRequirements:Passion for customer servicePositive attitudeDependableAbility to communicate effectivelyServSafe Certified or ability to become ServSafe CertifiedGraduate of an accredited Culinary Institution, a plusExperience in operating a successful restaurantPhysical Demands and Work Environment:Ability to lift a minimum of 25 #.Employee has to work under pressure and time deadlines during peak periods.Reports to: General Manager / Area Manager FLSA status: Exempt  Guckenheimer embraces equal opportunity employment  Guckenheimer participates in the E-Verify Program, as required by law"}