{"jobID": "2728572951", "jobLocation": "Los_Gatos_CA", "jobTitle": "Senior Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.roku.com", "Headquarters": "Los Gatos, CA", "Size": "501 to 1000 employees", "Founded": " 2002", "Type": " Company - Public (ROKU) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "135000", "jobDescription": "About Roku: Roku pioneered streaming to the TV. We connect users to the streaming content they love, enable content publishers to build and monetize large audiences, and provide advertisers with unique capabilities to engage consumers. Roku streaming players and Roku TV models are available around the world through direct retail sales and licensing arrangements with TV brands and pay TV operators. The Role: Roku is looking for a Senior Data Analyst to play an instrumental role in user segmentation and modeling, analysis of key platform and behavioral trends, and A|B testing. Senior Data Analyst roles on the Data Science & Analytics team require both strong technical abilities to retrieve, manipulate, analyze & model, and visualize data from Rokus Big Data Platform but also excellent communication capabilities. One of the key features of the role is to intermediate between Rokus Big Data and timely business initiatives.  The role requires both high technical aptitude and problem-solving abilities, motivation, exceptional attention to detail, and strong verbal and written communication. Please note this role is located in either Los Gatos, Santa Monica, or New York City Responsibilities:Design and execute A|B tests to determine optimal decisions around product, advertising, and email strategyLeverage Rokus vast amounts of data to generate business insights that inform strategy at the highest levels of leadershipBuild visualizations to illustrate complex on-platform behavioral trendsInterface with business and product leaders to communicate insight from analyses and testingTechnical Experience/Qualifications:4+ years relevant experience in Big Data analytics or data scienceExpert in A|B test designExperience working within and structuring very large data warehouses (i.e., Big Data), preferably map-reduceStrong knowledge of statistical distributions and predictive modeling techniquesExpert abilities in SQLExperience coding in R or PythonExperience creating data visualizations and intuitive management reporting (Tableau, Looker, OLAP cubes, etc.)Proven track record of defining and executing key analyses with minimal supervisionEducational background in math, physics, economics, or computer science"}