{"jobID": "2825829300", "jobLocation": "Santa_Clara_CA", "jobTitle": "Director Member Engagement", "companyRating": "3.3", "companyInfo": {"Website": "www.keypointcu.com", "Headquarters": "Santa Clara, CA", "Size": "51 to 200 employees", "Founded": " 1979", "Type": " Nonprofit Organization", "Industry": " Finance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "70000", "jobDescription": " Job Summary:  The primary responsibility of the Director of Member Engagement is to strive for excellence in service and sales via the branch delivery channels. This position supports the retail branch network in acting as a floating branch manager as needed and supports the branches in business development. They are responsible for driving member engagement and helping to drive business to the branches by building relationships with local organizations.  The Director of Member Engagement will work closely with the Senior Branch Managers in addition to the VP of Retail Operations on developing and implementing a sales and service driven culture. They will provide branch management coverage as needed. They will oversee recommendations that streamline branch transaction processing, consumer and business product opening in addition to processes related to other products and services.  This position will have a hands-on approach and will be committed to the expansion and success of the business by implementing strategies that increase productivity, and enable sales target achievement. They will manage staff, foster a positive environment and ensure member satisfaction.  Responsibilities:  Works with Senior Branch Managers to ensure TMA and Integrity Coaching efforts are consistently practiced  Acts as a floating branch manager  Supports business development efforts around the branch footprint  Looks to deepen member engagement and development within the branch network  Supports the Sales and Service Program  Supports the Member Onboarding Process  Acts as floating branch manager  Completes monthly reporting  Participates in special projects  Supports Net Promoter Score Program and promoting a member centric work environment when interacting with staff, members, and other departments  Supports branches in overall employee development as needed  Enforce and adhere to policies, procedures, regulations and relevant laws  Other duties as assigned  Physical Requirements: (Including lifting, sitting, walking, bending, reaching and squatting % of time in each function)  This position does not require any physically strenuous effort. This is an indoor assignment. The incumbent will spend approximately 90% sitting at a desk and using the telephone and PC to perform most of the work duties. 10% will be walking into work areas. In addition, the group is required to lift and carry approximately 30 - 50 pound boxes when researching or preparing information for our off-site storage facility.  Minimum Requirements:  Bachelor?s degree preferred or equivalent work experience  Knowledge of Branch/Bank Operations  Excellent interpersonal relations, communications, analytical, report writing, and time management skills.  Skilled at the art of collaborating with cross-functional teams to drive business objectives  A minimum of 5 years management experience in financial institutions overseeing a network of branches  Proficient in MS applications, including Word, Excel, PowerPoint, and Outlook  Flexibility in work schedule based on volume  Ability to make sound decisions and resolve member or operational issues"}