{"jobID": "2795527632", "jobLocation": "Long_Beach_CA", "jobTitle": "Maintenance Accounting Intern", "companyRating": null, "companyInfo": {"Website": "www.lbtransit.com", "Headquarters": "Long Beach, CA", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OverviewGENERAL SUMMARY: Long Beach Transit's (LBT) Student Intern Program offers career-minded students the opportunity to gain hands-on experience while being compensated. Intern will gain real-world work experience on meaningful projects under the guidance of professionals, and will have the opportunity to use problem-solving, communication and decision-making skills. The Intern will also work with a professional(s) as a Mentor for assistance to enhance a career path.  The Intern will be exposed to LBT's career opportunities in the transportation industry. The Intern will gain deeper awareness of many facets of Transportation through LBT's orientation, cross-divisional projects and internal networking.  Under the direction of the Maintenance Operations Planner and the guidance of the Maintenance Analyst, the intern role is a developmental position that will involve all aspects of Maintenance Financial and Data Analysis at Long Beach Transit. The Intern will directly assist with a wide range of tasks and projects related to monthly budget financial analysis, warehouse key performance indicators, warranty management and Bus Performance indicators and special department projects. Assisting in these tasks and projects includes generating reports and queries from a database, and the manipulation of the data in Excel using intermediate and advanced formulas and techniques to create reports. OPEN UNTIL FILLEDResponsibilities Assisting in analysis and preparing key performance indicator reportsWarranty filing and reportingReporting on monthly budget performanceWarehouse material analysis and inventory controlAssisting in the preparation of our capital budget reportsConducting internal audits and writing standard operating proceduresOther duties may be assigned QualificationsSuccessful candidate will be a full time student maintaining a 2.7 or above GPA for undergrads and a 3.0 or above for graduate students and currently enrolled in a Bachelor’s or Master’s Degree Program majoring in Accounting, Finance, Economics or a related field. Transcripts and class schedules will be requested. Strong technical aptitude as shown by strong grades and/or hands-on experience. Ability to work in a highly collaborative team setting. Candidate must demonstrate analytical and problem-solving skills and be a self-starter who is able to work with limited supervision and has a strong desire to learn. Demonstrated leadership experience through school or extracurricular projects is a plus. Good communication and organizational skills; proficient in MS Office applications – Excel, Word, Access. Application Apply on-line at www.lbtransit.com/jobs. On-line applications must include past work history and be fully completed to be considered. Resumes will not be accepted in lieu of a complete on-line application.  Candidate must be eligible to work in the United States. Long Beach Transit does not sponsor H1B or other related work visas. An Equal Opportunity EmployerSuccessful candidate must pass company physical, drug and alcohol test. Long Beach Transit 1963 E. Anaheim Street, Long Beach, California 90813"}