{"jobID": "2767298395", "jobLocation": "Redmond_WA", "jobTitle": "SR DATA SCIENTIST", "companyRating": "4.1", "companyInfo": {"Website": "www.microsoft.com", "Headquarters": "Redmond, WA", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (MSFT) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Amazon, Apple"}, "estimatedSalary": "155000", "jobDescription": " Microsoft's Cloud and Enterprise group has a unique opportunity at the intersection of cloud computing and artificial intelligence. Fueled by Microsoft's cloud-first vision, we are disrupting the cloud industry with innovation and large-scale AI implementation. The goal of the Azure Customer Growth & Analytics (CGA) team is to foster a data-driven culture; to encourage and enable the entire organization to make more informed decisions through data. In support of this mission, our data science team carries out applied research in ML/AI and designs, develops and deploys state of the art algorithms for various business scenarios. Some of the more recent developments include applications of deep learning, neural networks, boosted decision trees, sparse linear models, and customer segmentation, which have been executed in partnership with teams across engineering, finance, business planning, and sales and marketing. Our team also has a strong presence in both internal and external data science and AI/ML conferences. We are looking for a passionate, talented, and innovative Data Scientist with a strong machine learning and deep learning background to help build industry-leading solutions. As a senior data scientist in the Azure CGA team, you'll collaborate with partner teams and other researchers at Microsoft to build new ML solutions to solve critical and complex business problems. As part of this process, and with support from our data platform and engineering team, you will be working with huge volumes of data to solve real-world data science problems. If you are seeking an iterative, fast-paced environment where you can drive innovation, apply state-of-the-art technologies to solve extreme-scale real world delivery challenges, and have business impact on global scale, this is your opportunity. Join us and be a part of an exciting team that is shaping the evolution of cloud computingResponsibilities"}