{"jobID": "2813928962", "jobLocation": "Palo_Alto_CA", "jobTitle": "Surgical Pathology Technologist - 0.5 Evenings", "companyRating": null, "companyInfo": {"Website": "www.stanfordhealthcarecareers.com", "Headquarters": "Stanford, CA", "Size": "5001 to 10000 employees", "Founded": " 1957", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Sutter Health, UCSF Medical Center and UCSF Benioff Children’s Hospitals, Kaiser Permanente"}, "estimatedSalary": null, "jobDescription": " Under the direction of a supervisor and/or lead, 1) receives and accessions specimens; 2) performs basic specimen handling, gross dissection and dictation of routine biopsies; 3) processes and loads specimens onto testing instruments; assists in instrument maintenance; archives samples after analysis; responds to inquiries regarding specimens from internal and external departments; monitors equipment and temperature readings; 4) assist and perform frozen sections for rapid intraoperative diagnosis; 5) completes assignments with accuracy and in a timely manner without compromising the quality of the patient sample; 6) performs a variety of clerical duties and participates in pre-clinical test development, training and ad-hoc projects as directed; 7) answers phones, FAX results upon request and aids in report distribution; 8) assists in the training of new employees and/or students as needed; 9) exercises good judgement in recognizing and correcting irregularities and/or unusual requests; 10) performs other miscellaneous duties or special projects as assigned; 11) complies with all aspects of the job according to written procedure.  Accessions patient information into Laboratory information system(s). Checks all requests for proper and accurate patient information. Consults with Supervisor or Technologist if request is problematic. Notifies physician, nursing unit, clinic, etc. if sample received is inappropriate or compromised.  After processing of samples is complete, distributes and ensures that samples are routed to appropriate areas in the laboratory. Distributes STAT requests in a timely as well as appropriate manner.  Receives samples via the pneumatic system, couriers, patients, or other hospital personnel. Deals with patient\"s samples in an appropriate and efficient manner, distributing to the appropriate area of the laboratory or routing to other hospital departments as necessary according to procedure.  Receives and processes all specimens/samples following the proper laboratory procedures. Ensures patient samples are distributed to the appropriate areas of the laboratory or routed to other hospital departments as required.  According to procedure, prepares specimens for testing and quality control as directed.  Adheres to all Safety/Health regulatory and state/federal legal requirements and policies, operating procedures, and Services Standard of the Hospitals.  Assists in routine and regularly scheduled preventive maintenance for all automated and semi-automated instruments according to established procedures.  Inventories and orders supplies. Verifies delivery order and restocks and/or distributes supplies to the appropriate areas of the Lab.  Maintains the logs and records for all Laboratory transactions and information in accordance with department and regulatory requirements.  Monitors temperatures of incubators, heating blocks, water baths, freezers, and refrigeration units; ensure readings are within specified range; notifies supervisor of any exceptions to range limits.  Organizes, catalogs and stores patient specimen samples. Triage surgical specimens qualifying for disposal and discard according to SOP.  Participates in pre-clinical test development according to established protocols.  Performs a variety of clerical functions such as word processing, entering information into the database, handling calls and inquires, responds to inquiries regarding status of testing, faxing of reports, transferring calls as necessary, answering all inquiries in a polite and efficient manner. and other support functions as assigned.  Provides coverage as necessary to monitor fax machine for incoming patient report handling, scan reports into Epic according to written procedure  Dictates and/or transcribes results in laboratory information systems following established procedures.  Perform and/or assist with gross examination, dissection, and selection of representative tissue for microscopic examination for designated specimens.  Assists pathologists, fellows and/or residents with frozen section preparation. Maintain staining set up per SOP.  Perform cryostat maintenance according to SOP.  Assist pathologists with instruction and orientation of residents to procedures and techniques of basic specimen handling, gross dissection, and dictation of routine biopsies and use of equipment as needed/requested.  Assists with media preparation, reagent preparations, and glassware preparation when requested.  Communicates with physicians, nurses, visitors and other laboratory/ hospital staff in a cooperative and courteous manner. Responds to their needs appropriately with minimal waiting time.  Follows all departmental policies regarding attendance, punctuality and health and safety.  Independently resolves problems encountered in routine work. Recognizes problems or requests which require Supervisor and/or Lead assistance when appropriate.  Keeps all work areas clean and disposes of all waste appropriately. Perform minor spill clean up per SOP when necessary.  Keeps current with all laboratory procedures, techniques and changes in all areas of the laboratory through which he or she rotates. Meet competency standards of the department.  Provides orientation and training to new employees. Trains on general procedures in the lab and the performance of nontechnical duties.  Reports promptly to Supervisor or Lead any abnormal circumstances with equipment, machinery or other problems that may exist.  Understands patient care and laboratory priorities and independently assists others to ensure efficient workflow. Expected behaviors include adaptability to change, collaboration toward common goals, is self motivated and takes initiative. Expected communication skills involve active listening and proper email etiquette.  Performs other duties as assigned.  Equal Opportunity Employer Stanford Health Care (SHC) strongly values diversity and is committed to equal opportunity and non-discrimination in all of its policies and practices, including the area of employment. Accordingly, SHC does not discriminate against any person on the basis of race, color, sex, sexual orientation or gender identity and/or expression, religion, age, national or ethnic origin, political beliefs, marital status, medical condition, genetic information, veteran status, or disability, or the perception of any of the above. People of all genders, members of all racial and ethnic groups, people with disabilities, and veterans are encouraged to apply. Qualified applicants with criminal convictions will be considered after an individualized assessment of the conviction and the job requirements. Education · A.S. degree in the biological, life sciences, medical laboratory technology, or other related field. B.S. degree preferred.  Experience  · One (1) year of progressively responsible and directly related work experience. Technical experience in a gross laboratory preferred.  License/Certifications  · None "}