{"jobID": "2804100791", "jobLocation": "San_Jose_CA", "jobTitle": "RN/Registered Nurse Clinical Supervisor", "companyRating": "3.0", "companyInfo": {"Website": "www.premier-homehealth.com", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "52", "jobDescription": " WHO WE ARE:Premier Healthcare Services is a leading provider of skilled in-home nursing care for patients. We are currently looking for a passionate, empathetic, motivated and COMMITTED individual to fill our RN/Registered Nurse Clinical Supervisor Position! Our success is largely based upon hiring ambitious team members who provide outstanding customer care.JOB DESCRIPTION: The Clinical Supervisor is responsible for ensuring that patient care is coordinated and managed appropriately. The Clinical Supervisor is responsible for the clinical activities of the field staff. The Clinical Supervisor plans, implements and evaluates patients plan of care for appropriateness to the individual patients needs.WHAT PREMIER OFFERS:FUN, POSITIVE, and PROFESSIONAL work environment.Be EMPOWERED by working INDEPENDENTLY with a FLEXIBLE work schedule.WEEKLY pay.BENEFITS: Medical, Dental, Vision, vacations/sick days, life insurance, and 401(k).Receive a $5,000 retention BONUS.Generous referral BONUSES.G-tube, Ventilator, Trach Refresher Training and MORE.Monthly office outings, and an annual company-wide beach party.Employee appreciation events & employee recognition awards.Monthly core values meetings, regular paid trainings & orientations.RN/REGISTERED NURSE RESPONSIBILITIES:Assesses and supervises the delivery of nursing services.Reviews patients clinical diagnosis, medications, procedures and clinical course.Provide in-home supervision of home care cases.Perform home health visits for pediatric & adult patients and attend case conference meetings.Prepares and coordinates clinical notes and progress notes.Ensures compliance with all professional, State and Federal regulations and practices.Update plan of care as necessary during supervisory visits.Assist in orientation and training of Premier team members.RN/REGISTERED NURSE QUALIFICATIONS:Registered Nurse (Bachelor or Associate Degree) with at least 2yrs of clinical experience (i.e. home health agency, primary care clinic, or health facility) within the last 5yrs.Demonstrates ability to supervise and direct administrative personnel.Current State license, CPR certification and valid driver's license (local travel required up to 30% of the time).Current PPD or chest x-ray required.Has excellent observation, verbal and written communication skills.Highly organized and ability to work independently.Ability to work with people of diverse backgrounds.Computer literate with proficiency in Microsoft Office, Google Suite, electronic medical records and ability to learn new applications easily.If you feel that you are a match for our Clinical Supervisor opening we welcome you to submit your resume.Premier Healthcare Services is an equal opportunity and affirmative action employer and is committed to providing employment opportunities to minorities, females, veterans, and disabled individuals, as well as all other protected groups."}