{"jobID": "2827423493", "jobLocation": "Seattle_WA", "jobTitle": "Data Analyst I", "companyRating": "3.4", "companyInfo": {"Website": "www.pioneerhumanservices.org", "Headquarters": "Seattle, WA", "Size": "1001 to 5000 employees", "Founded": " 1963", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "55000", "jobDescription": "Pioneer HumanServices (PHS) is a social enterprise that provides individuals with criminal histories the opportunity to lead healthy, productive lives. You may learn more about our organization, mission, and vision here: About Us. POSITION SUMMARY The Data Analyst I will apply understanding of data architecture and modeling and serve as a collaborator for multiple projects requiring specialized skills and breadth of expertise using a variety of data. This role is responsible for working with internal and external stakeholders in conceptualizing business questions, identifying necessary data for systems, completing complex analyses, and interpreting and disseminating results to key audiences in a manner appropriate to each audience. This individual will also be involved with understanding the data transformation, data harmonization and visualization. The Data Analyst I should be able to work as part of a project team and independently as needed as well as being able to work with a cross-functional team within a matrix environment to ensure timely completion of work. Monitors and executes relative IT help desk Service Requests and Incident Reports. This position also supports the Data Analyst II as first responder to Service Requests and reports to the Information Systems Manager - Applications. POSITION DUTIES & TASKSData Analysis (40%)Identifies, extracts, and scrubs data from legacy systems for migration into new solutions.Creates, tests, performs data migration.Extracts data from a variety of relational databases including SQL and manipulates, explores data using quantitative, statistical and visualization tools.Integrates data from various internal and external sources in order to provide data for analysis and/or reporting. Works with various reporting tools including but not limited to Crystal Reports and SSRS.Works with subject matter experts and end users to validate data requirements.Analyzes and normalizes relevant information related to business processes, functions, and operations to evaluate data credibility and determine relevance and meaning.Formulates validation strategies and methods to ensure accurate and reliable data.Maps data across the organization, both electronic and paper records.Works with subject matter experts and end users to validate data requirements.Analyzes and normalizes relevant information related to business processes, functions, and operations to evaluate data credibility and determine relevance and meaning.Formulates validation strategies and methods to ensure accurate and reliable data.Maps data across the organization, both electronic and paper records.Database Maintenance and Support (30%)Assists in the development and maintenance of the data quality, working with the Database Technology and IT Applications team.Assists with maintenance and health of databases, including data normalization.Documentation & Reporting (25%)Works with business analysts and the Data Analyst II in developing SQL queries and automating reports where appropriate and opportunity exists.Assists with Data Management plan and documentation.Assists with end-user documentation.Assists with IT documentation.Other Duties as Required (5%)WORKING CONDITIONSSchedule (i.e. hours and days):M-F standard daytime hours.Evenings and weekend as needed for projects, deadlines and systems production support.Travel Requirements:5-10%, generally within Washington StateTools & Equipment:Office and position specific computing software and hardware with reasonable accommodation.Customer Interactions:Interacts within IT and across the organization at multiple levels and with vendors and service providers in a positive and professional manner, recognizes customer needs, responds quickly and appropriately to requests and concerns, maintains regular contact and communication, and integrates feedback into work and priorities.Other:Ability to sit for extended period of time with reasonable accommodationQUALIFICATIONSRequired QualificationsEducation: Bachelor’s degree in computer science, information systems, mathematics, health informatics or business (or an additional four years of recent and relevant work experience may be considered).One or more years experience in data analysis.Two years training or experience with SQL, SSRS, MS Visual Studio, or similar data analysis tools.Demonstrated knowledge of business service systems and the ability to operate complex computer business applications and systems.Demonstrated proficiency in defining problems, collecting and scrubbing data, selecting appropriate tools and methods for standard reports and testing conclusions required.Ability to work in a collaborative and supportive way with teams and colleagues from across the organization and interact comfortably with a wide range of individuals.Preferred/Desirable QualificationsTableau, Crystal Reports, SAS or similar reporting softwareData Modeling Tools (ERwin or similar)BI ToolsBENEFITS FOR FULL-TIME EMPLOYEESFull medical, education assistance, a 403(b) retirement plan, and paid time off (10 paid holidays per year, plus sick and vacation pay).Pioneer contributes 4.5% of employees' annual salaries into retirement plans. An additional 3.5% match is offered to those who contribute 6% of their own salary.Full-time employees accrue 10 days of vacation their first year and 15 days their second.All employees; regardless of benefits eligibility status, accrue 1 hour of sick time for every 30 hours worked. Accrual begins the first day of employment. Sick time can be used to care for yourself or a family member, for preventive medical care, for leave covered under the Domestic Violence Leave Act, for bereavement purposes, or if your workplace, or your child’s school or place of care is closed by a public health official for any health-related reason.Other benefits include participation in the Life Assistance Program and public transportation reimbursement of $25 per month.Employee Recognition Program (PERC Rewards). Rewards include gift cards, additional time off, weekend getaways and other items.Pioneer Human Services is a drug-free company.In addition to pre-employment drug screening, Pioneer reserves the right to conduct random sample alcohol or drug testing of all employees. Please note that our drug-free policy includes marijuana and there are no exceptions for those with medical marijuana prescriptions. EEOPioneer Human Services is an Equal Opportunity Employer of Minorities/Women/Individuals with Disabilities/Protected Veterans and does not unlawfully discriminate under federal, state, or local laws.All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, physical or mental disability, or protected veteran status.EEO is the Law PosterEEO is the Law Poster SupplementWe participate in E-Verify. Details are provided below in both English and Spanish.This Employer Participates in E-Verify |Este Empleador Participa en E-Verify"}