{"jobID": "2760201355", "jobLocation": "Montville_NJ", "jobTitle": "Doctor of Physical Therapy / Physical Therapist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Are you familiar with the 12 Stages of the Hero's Journey by Joseph Campbell? If not, maybe you're familiar with the Matrix or Star Wars series. No? Then surely you've heard of Harry Potter, Katniss Everdeen, or Frodo.What's the unifying theme in these stories and our profession?In Physical Therapy there was a time where new doctors could fulfill their aspirations to be autonomous, board-certified doctors, practicing in PT-owned facilities, spending quality time with patients. Additionally, they would be trained to treat the public directly (direct access) and would be able to use the gifts learned, passed down through true mentorship from accomplished women and men to accurately diagnose a patient with their eyes, ears, and hands.If there were a need for confirmation, they would write their own referral for an X-ray, CAT scan, or MRI.Instead what's happened is physical therapy businesses are owned and run by corporations, physicians, chiropractors, or general business owners with dozens to hundreds of offices marching to the beat of high volume care. In some settings, a physical therapist has been forced to return, once again, to being treated like a high-quality personal trainer. An image we fought so hard against when pushing to the doctoral level of education. We’re being asked to forget the importance of being board-certified doctors, diagnosing, ordering imaging and using the highly skilled art of manual therapy, exercise prescribed with precision and cutting-edge modalities. Our profession in some instances is losing its identity.Be happy and energized, practicing the way you envisioned when you decided to become a doctor, spending time caring for your patients. Come experience what excellence feels like. Join us, a connected team that invests in you and become a hero for our profession.Interested?Submit your resume and cover letter to Ms. Mantzouranis atcareers@njdpt.com*A video cover letter if preferred.Highest caliber medical insurance, retirement fund, excellent pay, opportunities for advancement, mentorship program, and a successful career.Other Locations: Montville Physical Therapy, Wayne Orthopedic Physical Therapy, Paramus Orthopedic Physical Therapyhttps://www.instagram.com/newjerseycpt/"}