{"jobID": "2769117055", "jobLocation": "Boston_MA", "jobTitle": "Data Scientist PhD", "companyRating": "3.5", "companyInfo": {"Website": "www.wayfair.com", "Headquarters": "Boston, MA", "Size": "5001 to 10000 employees", "Founded": " 2002", "Type": " Company - Public (W) ", "Industry": " Retail", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Amazon, One Kings Lane, Crate and Barrel"}, "estimatedSalary": "110000", "jobDescription": "Introduction to the team: The Data Science group is made up of team members with diverse skill sets across math and engineering, dedicated to solving some of the most analytically challenging problems here at Wayfair. The work we do encompasses: Data mining - uncover deep insight hidden in our vast repository of raw data, and provide tactical guidance on how act on findingsAlgorithm design - develop quantitative models, leveraging machine learning and advanced data analysis techniquesAlgorithm platform engineering - architect and build technical platforms for our algorithmic engines to run at scaleInfluencing business decisions - relentlessly leverage our work and encourage adoption across our business partners, to drive real business value As part of this role, you will be a creative thinker in how to solve problems, utilizing quantitative/technical skills along with business understanding to devise solutions. Youll work within Wayfairs big data technology infrastructure in order to dive deep into our data sets and develop innovative new capabilities.  The Data Science department covers three main topic areas. You will work in one of the following: Data Science Personalization builds sophisticated platforms designed to personalize customer experience to millions of unique shoppers across site and email. This includes working on different types of recommendations engines, as well as algorithms that machine-learn complex shopping behavior. The goal is to be intelligent and automated in making the experience more relevant for every user. Data Science Marketing builds the framework and algorithms that help guide Wayfairs $250M+ annual marketing investment. The work touches all marketing channels (TV, catalog and digital) and aims to improve our ability to measure marketing impact, improve our customer targeting and optimize our investments across millions of marketing campaigns. Data Science Operations builds data-driven solutions to support Wayfair operations teams, including Merchandising Operations, B2B, Supplier Performance, and Customer Service. The big goals are to enhance Wayfairs behind-the-scenes operational capabilities through rigorous use of algorithms and analysis. Responsibilities:Partner closely with business leads in Marketing, Product, or Operations to plan out valuable data science projectsWork in complex data systems and wrangle data from multiple sources including sales, customer, and clickstream databasesConduct analysis and build models to uncover key learnings from data, leading to appropriate strategy recommendationsServe as an algorithm and engineering lead to build advanced quantitative solutions into our overall technical platformWork alongside business stakeholders to apply our findings and developments and continually improve the Wayfair customer experienceQualifications:2+ years of experience in a quantitative or technical work environment or advanced degree (PhD) in quantitative field (e.g. mathematics, economics, computer science, physics, neuroscience, operations research etc.)Intuitive sense of how quantitative and technical work aligns closely with business priorities and business valueAbility to effectively work with business leads: strong communication skills, ability to synthesize conclusions for non-experts and desire to influence business decisionsHigh comfort level with programming, e.g. languages such as SQL, Python, R, Scala, Java, C++, C#, PHP, etcKnowledge of quantitative methods statistics, machine learning, general data analysisIntense intellectual curiosity strong desire to always be learningAnalytical, creative, and innovative approach to solving open-ended problemsHighly collaborative, team-player attitudeAbout Wayfair Inc. Wayfair believes everyone should live in a home they love. Through technology and innovation, Wayfair makes it possible for shoppers to quickly and easily find exactly what they want from a selection of more than 10 million items across home furnishings, décor, home improvement, housewares and more. Committed to delighting its customers every step of the way, Wayfair is reinventing the way people shop for their homes - from product discovery to final delivery.  The Wayfair family of sites includes: Wayfair, an online destination for all things homeJoss & Main, where beautiful furniture and finds meet irresistible savingsAllModern, unbelievable prices on everything modernBirch Lane, a collection of classic furnishings and timeless home décorPerigold, unparalleled access to the finest home décor and furnishings Wayfair generated $5.2 billion in net revenue for the twelve months ended March 31, 2018. Headquartered in Boston, Massachusetts with operations throughout North America and Europe, the company employs more than 8,700 people. Wayfair does not accept unsolicited candidate referrals or resumes / CVs from third-party vendors, including recruitment agencies. Wayfair will not be responsible or liable for any fees or costs associated with such unsolicited submissions."}