{"jobID": "2461938162", "jobLocation": "Sunnyvale_CA", "jobTitle": "Full-Stack Web Application Developer", "companyRating": "2.4", "companyInfo": {"Website": "www.support.com", "Headquarters": "Sunnyvale, CA", "Size": "1001 to 5000 employees", "Founded": " 1997", "Type": " Company - Public (SPRT) ", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " CA Technologies, Citrix, VMware"}, "estimatedSalary": "130000", "jobDescription": "Job Title: Full-Stack Web Application Developer Location: California  External Description:Support.com, Inc. (NASDAQ: SPRT) is a leading provider of tech support and turnkey support center services, producer of SUPERAntiSpyware® anti-malware products, and the maker of Support.com® software. Support.com services and products help leading brands deepen their customer relationships. Customers want technology that works the way it's intended. By using Support.com services and software, companies can deliver a fantastic customer experience, leading to happier customers, greater brand loyalty and growing revenues.  We are looking for a talented and dedicated Full-Stack Web Application Developer to build a world-class software platform for embedding and delivering product support. We are a public company, with mature software products established in the marketplace, rolling out the next generation of products. These products consist of sophisticated web applications, SDKs and Open APIs for embedding modern, data driven customer support capabilities in software products on a wide range of platforms (Win, Mac, Android and iOS, IoT platforms). Why work with usGet in on the ground floor of a new SaaS product offering that is changing the way technology support is built into products, managed and delivered. Our Dev teams utilize the latest web application technologies, write applications that run on or communicate to desktop/laptop, mobile, and 'Internet of Things' devices, and create analytics software that analyze data mined from millions of devices.Use cutting edge cloud technology stack built on Linux, Node.js, AngularJS, Redis, and PostgreSQL. Don't have experience with these? You'll get it here!We love collaborative, agile software development, iterative design and testing. We form tight teams with PM and UX which build rapid prototypes and release frequently. You won't get bored!We encourage learning and integration of new technologies. You think you have a new technology solution you'd like to try? We'd love to hear it.What you will be doingDesign and develop features for our SaaS productDesign and develop integrations with complementary third party systemsDesign and implement unit and functional testingPerform design and code reviewsShare knowledge and learning with the team and contribute to system architecture design decisionsImprove the scalability and security of the systemInterface with QA, UX/product design, and DevOps teamsWhat you need for the job5+ years of experience as a web developer; but, really, we are open to any developer that has the technical prowessSolid understanding of CS fundamentals, object oriented design and web technologiesExperience with Node.js is preferred; significant web development experience with one or more of the following: Ruby, PHP, Python, Asp.Net, MVC, and Java, works as wellExpertise in JavaScript, jQuery, HTML and CSSExperience architecting and consuming API.Substantial knowledge of relational databases (PostgreSQL or MySQL), including use of SQLStrong appreciation for data collection and analyticsExtensive testing experience, both at unit level and system levelBonus points for these!Experience with building Single Page AppsClient side frameworks: AngularJS, React, Backbone, Ember, or similarWebsockets: sockjs, socket.io, or similarNginx configuration and administrationTesting: mocha, karma, mockery, node qunit, httpMock, or similarDevOps: Jenkins, OpenStack, SaltStack, AWSYour benefitsFlexible work environment -- e.g. ability to work from home 1 - 2 days a week!Catered lunches every Friday!Competitive benefits and compensation!Fun atmosphere! Weekly happy hours, activities and team builders!Ability to work with exceptionally creative and talented people! Support.com is an Equal Opportunity EmployerJob Description: "}