{"jobID": "2781859176", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist, Platform Analytics", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Our past is full of iconic moments but our future is going to spark many more. We're looking for the people who'll help make our next decade just as revolutionary as our first five. If you're one of the super-talented who thrive on change, aren't afraid to take risks and love to make a difference, you're the right fit. Come grow with us.The Customer Data and Analytics organization is a critical component of the Customer and Strategy Team at Gap Inc. and is a central function chartered with unlocking the power of customer data and analytics to drive customer obsession across the company. The organization is also responsible for building the Customer Data and Analytics Platform in partnership with Gap Tech to power customer experiences such as, but not limited to, real-time website and in-store personalization, algorithmic contact strategy etc.  Reporting to the Director of Platform Analytics, the Sr. Data Scientist, Platform Analytics will be the technical lead of a team of data scientists focused on building data science products using advanced statistical models and machine learning algorithms to deliver industrial grade data science driven products centered around scalability, repeatability and adaptability. Key Responsibilities:Implementing Data Science Solutions: Build predictive models using machine learning algorithms and advanced statistical models, provide actionable recommendations based on insights and drive outcomes to support our business and technical partners. Experience in building recommender systems, algorithmic and optimized contact strategies will be a plus.Model Deployment and Production: Build extensible, repeatable and scalable models that will be deployed in partnership with Gap Tech and can be embedded in our Customer Data Platform to enable batch or near real-time decisions. This also includes building framework for adaptive update of models which will require periodic review and quality assessment of the deployed models.Partnership: Actively partner with the teams within Customer Data and Analytics organization as well as external business groups to understand requirements, propose data science solutions and implement strategies that will drive personalized experiences for our customersLearning and Development: Evangelize adoption of technology, best modeling and coding practices within and across the Customer Data and Analytics functions. Cultivate a culture of learning and continued development through mutual sharing of knowledge with other teamsKey Experiences:5-7 years of experience in core data science and analytics functions focused on pattern classification and pattern recognition. Experience in building recommender systems is a plus.Demonstrable experience in building predictive models and algorithms that directly power real-time or near real-time data science productsExpertise in framing, building and validating predictive models using advanced statistical methods such as fixed effects and mixed effects linear and logistic regressions, non-linear regressions or machine learning algorithms such as decision trees, boosting and bagging algorithms, support vector machines, kernel classifiers and deep learning frameworksExpert knowledge of statistical software such as Python and/or R. Knowledge in SAS is good to have but not requiredBroad experience analyzing massive datasets in Hadoop environment as well as with relational databases. Experience in Hive HQL, SQL, Spark, Pig is a good to have skillset.MS/PhD, preferably in statistics, computer science, mathematics, economics or a technology focused degreeProficiency in R and Python -Knowledge of deep learning frameworks such as tensorflow, torch, caffe, mxnet, h2o etc.Hands on experience in Python libraries like keras, tflearn, scikit-learn, numpy, scipy, pandas, matplotlib, seaborn etc.Hands on experience in R packages like caret, kernlab, gbm, xgboost, dplyr, shiny,KEY BENEFITS:Merchandise discount for our brands: 50% off regular-priced merchandise at Gap, Banana Republic and Old Navy, 30% off at Outlet and 25% off at Athleta.One of the most competitive Paid Time Off plans in the industry.*Employees can take up to five on the clock hours each month to volunteer at a charity of their choice.*Extensive 401(k) plan with company matching for contributions up to four percent of an employees base pay.*Employee stock purchase plan.*Employees receive medical, dental, vision and life insurance.*Employees can apply for tuition reimbursement.*Family care programs.Commuter benefits.Pet Discount Program. *For eligible employeesGap Inc. is an equal-opportunity employer and is committed to providing a workplace free from harassment and discrimination. We are committed to recruiting, hiring, training and promoting qualified people of all backgrounds, and make all employment decisions without regard to any protected status. In 2016, Gap Inc. was named one of the Best Places to Work by the Human Rights Campaign for the thirteenth consecutive year and was the sole winner of the Catalyst award for equality in the workplace in 2016."}