{"jobID": "2777295216", "jobLocation": "San_Jose_CA", "jobTitle": "Family Partner (Campbell Sch District - Bilingual Spanish Required)", "companyRating": null, "companyInfo": {"Website": "www.upliftfs.org", "Headquarters": "Campbell, CA", "Size": "501 to 1000 employees", "Founded": " 1867", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Title: Family Partner I Classification: Non-Exempt Salary Range: $17.75-$24.86 Actual offers will be determined by the candidate’s creditable years of experience in conjunction with internal equity considerations and based on the organization’s current compensation practices.Job Code: 057 Job Summary Works within the vision, mission, and philosophy of the agency to provide support and coaching on specific skill sets for caregivers as well as to provide a parent perspective in a variety of settings. Supports the development of a shared understanding between individuals and groups based on the twelve principles of the agency service philosophy. Uses personal and professional life experiences to establish credibility and infuse hope for a better future, to demonstrate unconditional acceptance, and assist with problem solving. Supports the implementation of family friendly practices by providing a parent’s perspective to the routine operations and development of programs. Provides consultation and training for staff and others to increase awareness and improve the effectiveness of parent-professional partnerships to meet the needs of families. Participates in program and community meetings to maximize parent voice, choice, access, and involvement throughout the service delivery process. Works directly with parents and caregivers. Essential Duties 1. Utilizes personal and professional life experience to provide peer support to parents and caregivers served by the program as appropriate.  2. Provides parents and caregivers with information about the agency and the process and procedures, including the Family Partner I role to assist them.  3. Participates in providing a variety of support services for parents/care givers (e.g.; family events, family activities, recognition events).  4. Coaches families to make decisions and develop plans based on their needs, and to use their voice to direct treatment.  5. Collaborates and participates in Child and Family team (CFT) meetings to ensure the parent and family members have access, voice and choice within process and to support the parent/caregiver’s connection to the Child and Family team (CFT) members, as necessary.  6. Identifies community connections for internal teams.  7. Serves as consultant and supports shared understanding to ensure that family and providers understand each other’s perspective and information.  8. Provides non-judgmental, culturally informed support to parents and caregivers.  9. Explores, identifies, and works to (re)establish natural support system as needed; identifies and links family with community connections and resources.  10. Models and coaches effective coping techniques for parents and caregivers.  11. Provides a caregiver’s perspective in agency service support structures.  12. Assists with the design and implementation of internal and external trainings about the parent perspective.  13. Utilizes conflict resolution skills.  14. Participates in continuous learning process as it relates to engaging youth and families.  15. Maintains and manages schedule effectively in order to manage the needs of multiple families, meetings, external and internal customers.  16. Produces and maintains accurate and timely documentation within agency standards.  17. Holds staff accountable to service delivery principles related to the family voice, choice, access, pace and process, through sharing personal experience, engaging in team meetings and consultations with staff internally and externally.  18. Participates in service improvement and development efforts.  19. Participates in program and system meetings.  20. Employee is required to meet applicable productivity and documentation requirements  Other Duties  21. Driving to appointments with clients and their families or other key contacts  22. Physical interactions with children of variable ages such as, but not limited to, games, sports and other activities Qualifications To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. All employees are responsible for keeping job requirements up to date. This can include but are not limited to certifications, licensure, and maintaining a clear criminal record. Education Requirements • High School Diploma or General Education Development (GED) required. Preferred Education Qualifications •Some college education is preferred. Experience Requirements • Three (3) years of experience as a parent or caregiver of child with special needs.  • Be able to articulate the experience and perspective of a parent/caregiver or relative of a child with complex needs involving mental health, child protective, or probation services. This ability is acquired as the primary caregiver of a child with complex needs required.  • Bilingual Spanish Required. Other Specific Requirements • Must pass Department of Justice (DOJ), Federal Bureau of Investigations (FBI), and Child Abuse Index Check (CAIC) background clearance, if applicable.  • Valid California Driver's license with two years experience driving and clean driving record is required. Work Environment/Conditions Reasonable accommodations may be made to enable qualified individuals with disabilities to perform the essential functions.  While performing the duties of this job, the employee may be required to use hands to handle or feel objects, tools or controls; reach with hands and arms; and taste or smell. Specific vision abilities required by the job include close vision, distance vision, color vision, peripheral vision, depth perception and the ability to adjust focus.  In addition, this position requires standing, sitting, walking, climbing, and kneeling. Employee Statement of Understanding I have read and understand the job description for my position. I am able to perform all of the essential functions of this position. I agree to successfully complete all required training indicated for this position. I agree to keep all of my required certifications and licenses current and up to date and provide proper documentation of the same to my Human Resources Department. I agree to comply with all Agency policies and procedures. I agree to comply with the agency compliance plan and all laws, rules, regulations and standards of conduct relating to my position. As an employee, I understand my duty to report any suspected violations of the law or the standards of conduct to my immediate supervisor. As an employee, I will strive to uphold the mission and vision of the organization. All employees are required to adhere to the values in all their interactions with youth and families and fellow employees."}