{"jobID": "2725444611", "jobLocation": "New_York_NY", "jobTitle": "Assistant Sourcing Manager", "companyRating": "2.3", "companyInfo": {"Website": "www.fbbrands.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1901", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "37000", "jobDescription": " FULLBEAUTY Brands™ is the most trusted, comprehensive resource for plus-size women and men seeking fashion inspiration, style advice, and clothing tailored to their individual needs. Proprietary brands under the FULLBEAUTY Brands umbrella include: Woman Within®, Roaman’s®, Jessica London®, swimsuitsforall®, KingSize®, Brylane Home® and fullbeauty.com®, an online marketplace offering a curated collection of the finest brands and thousands of products – the premier fashion and lifestyle destination for women sizes 12+. POSITION SUMMARY: The Assistant Sourcing Manager provides assistance to a Sourcing Manager, as well as, overall assistance to the category group. Duties, as outlined by the Sourcing Manager, will include individual accountability for tasks, as well as, shared responsibility with the Sourcing Manager. DUTIES/RESPONSIBILITIES:Assists Sourcing Manager in sending out all development to the Agents and Production offices and following up for completionWorks with Sourcing Manager to ensure all fabric details are accurate and help to maintain PLM fabric libraryKnowledgeable of the Brand’s development calendars and milestone requirementsBecome familiar with Sourcing Strategies and objectivesBecome familiar with Cost targets and pricing needsAssists Sourcing Manager in Costing, Negotiating, Sourcing Strategy and Production follow up.Assist Sourcing Manager with implementing Ad hoc reporting and tracking of Key Performance IndicatorsPerform various Administrative tasks across multiple systems including recording costs, tracking all predevelopment approvals (i.e. fit samples, lab dips and photo samples), calendar milestone timelinesWorks with Colorist to ensure filing of all lab dips, bulks and trim submitsEnsures timeliness of lab dip comments from the Colorist by providing assistance to the Colorist when needed to either view colors or send out color comments for the Colorist.Ensures timely delivery of all samples to the appropriate departmentsAttends all Fit and Development meetings with Sourcing ManagersMINIMUM QUALIFICATIONS:Bachelor’s degree in related field1-3 years of experience within a Catalog or Retail Apparel Sourcing and production environmentStrong resourcefulness in Problem solving and organizational skillsAbility to multitask in a faced pace environmentExcellent computer skills in MS office with emphasis on Excel and PowerPointWritten and oral skillsInterest in future overseas travel requirementsWorks well with ambiguity and long distance cross functional teams with understanding of cultural and time zone differencesEntrepreneurial mentality with strong analytical skillsProfessional work ethic and interpersonal skills The role is located in our new state-of-art headquarters at One New York Plaza in vibrant downtown Manhattan.  We offer a competitive salary and a comprehensive benefit package that includes a fun work environment, a generous merchandise discount and realistic growth potential. We value a culture of inclusion and diversity within our workforce. We are committed to maintaining a workplace free from prohibited employment conduct, including discrimination or harassment on the basis of race, color, national origin, sex, age, religion, disability, genetic information, sexual orientation, gender identity or expression, marriage and civil partnership, pregnancy and maternity and any other characteristic protected by law. FULLBEAUTY Brands™ is an equal opportunity employer, M/F.  Required Skills Required Experience Job Location  New York, US-NY "}