{"jobID": "2801942905", "jobLocation": "New_York_NY", "jobTitle": "Systems Engineer - SCOM / MS-Exchange", "companyRating": "4.0", "companyInfo": {"Website": "www.emtecinc.com", "Headquarters": "Radnor, PA", "Size": "501 to 1000 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "72000", "jobDescription": " Company OverviewEmtec is a Global consulting company that provides technology-empowered business solutions for world-class organizations. Our Global Workforce of over 700 consultants provide best in class services to our clients within the Healthcare & Life Sciences, Utilities, Business Services, Banking, Insurance & Financial Services, Education and Manufacturing sectors. Our clients span the emerging, mid-market and enterprise space. With multiple offices worldwide, we are uniquely positioned to deliver solutions to our clients leveraging Oracle, Salesforce, Microsoft and Infor with a focus on Mobility, Cloud and Analytics. Emtec’s singular mission is to create “Clients for Life” - long-term relationships that deliver rapid, meaningful, and lasting business value.  At Emtec, we have a unique blend of Corporate and Entrepreneurial cultures. This is where you would have an opportunity to drive business value for clients while you innovate and continue to grow and have fun while doing it. You would work with team members who are vibrant, smart and passionate and they bring their passion to all that they do – whether it’s learning, giving back to our communities or always going the extra mile for our client.Position DescriptionWe are looking for a talented and experienced Systems Engineer/Administrator with a strong working knowledge of the SCOM (installation, configuration and support) in relation to Exchange 2013 availability for our client project in New York City. Must Have Skills:3+ years of IT experience in SCOM and Microsoft Exchange Server 2013 administration (2016 a plus) including:Understanding of SCOM Management Pack including installation, configuration and support with ExchangeExperience in Exchange Server migration to 2013 and new versionsExperience with support and administration of environments with high-availabilityExperience with disaster recovery technologies such as clustering and replicationExperience in configuring exchange mail routing - install and configuring Exchange roles, DB, address list and message routingProfessional Skills:Solid written, verbal, and presentation communication skillsStrong team and individual playerMaintains composure during all types of situations and is collaborative by natureHigh standards of professionalism, consistently producing high quality resultsSelf-sufficient, independent requiring very little supervision or interventionDemonstrate flexibility and openness to bring creative solutions to address issuesEmtec is an Equal Opportunity Employer US citizens and those authorized to work in the US are encouraged to apply"}