{"jobID": "2804341134", "jobLocation": "Menlo_Park_CA", "jobTitle": "Senior Creative Project Manager", "companyRating": null, "companyInfo": {"Website": "www.brainrider.com", "Headquarters": "Toronto, Canada", "Size": "1 to 50 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Company DescriptionBrainrider is a marketing services company with teams in San Francisco, Menlo Park, and Toronto helping our clients build beautiful, effective, compelling content and campaigns.We are a team of craftspeople. Our expertise and understanding earn our clients trust. We are successful when our clients value us. We hold ourselves accountable. We are driven to become better. We do our best when we work as a team.We work in an open-concept space designed for team collaboration, filled with creativity, productivity, experimentation, and learning. Whether were brainstorming better marketing ideas for our clients or pushing hard to meet a tight deadline, it all happens with teamwork, adaptability, and optimism.Job DescriptionThis is a full-time position reporting to our Menlo Park office. Please apply only if you&apos;re in the SF Bay Area. NO RELOCATION OFFERED.Brainrider is looking for a seasoned, results-oriented senior creative project manager to join our client-embedded on-site team, working closely with an in-house creative and content development team at one of the world&apos;s most well-known tech companies. Your previous experience working in a medium or large cross-functional organization has equipped you to manage projects for this internal b2b digital marketing team, partnering with digital and media teams to deliver scaled national and global programs to the market. You understand how to complete a project without having a perfect picture, let your instincts lead the way, and embrace your process-driven approach to finding the path to successful delivery. You have the confidence and experience to multi-task and act swiftly and surely under pressure.The ideal candidate will possess a variety of competencies including a proven ability in leading cross-functional teams, strong project management, follow-through, communication, and the capability to manage and contribute to multiple projects simultaneously.Your regular responsibilities will include:establishing deadlines, communicating issues as they occurfacilitating communication, reworking schedules, identifying issueshaving the foresight to identify obstacles and pitfalls, and ensure everyone is on the same pageprioritizing competing needs with good reasoning and creative solutionscoordinating resources across projects and teamstracking activities on projectsestablishing clear path of owners and next stepscommunicates clearly across projects and peopleidentify opportunities to improve processesidentify need for additional resources on a projectQualificationsRequired Qualifications8+ years of relevant experience working in a digital company, agency, or studioexperience partnering with digital and media teams to deliver scaled programsexperience managing budgets and vendorsAdvanced level Microsoft Office (Excel, PowerPoint, Word, Outlook)Strong verbal and written communicationWorking knowledge of Workfront or other similar project tracking toolsBonus QualificationsWorking knowledge of Photoshop, Illustrator, and other Adobe Creative Suite toolsUnderstanding of the digital advertising industry, including exposure to digital marketing and mediaUnderstanding of web UX/UI trends and best practicesAdditional InformationThis is a full-time position reporting to our Menlo Park office. Please apply only if you&apos;re in the SF Bay Area. NO RELOCATION OFFERED.Compensation: annual salary of $100,000-$130,000 plus 15 days PTO per year, medical, dental, vision, 401(k), and other benefits.Impressive candidates will be invited to advance through our rigorous evaluation process.NO AGENCIES OR RECRUITERS PLEASE."}