{"jobID": "2791843875", "jobLocation": "New_York_NY", "jobTitle": "Commercial Sales Executive", "companyRating": null, "companyInfo": {"Website": "www.salesloft.com", "Headquarters": "Atlanta, GA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Commercial Sales Executive As a Commercial Sales Executive at SalesLoft, youll play a pivotal role in helping us become the next anchor technology company by winning high visibility deals and crushing your $600k annual quota. If youre passionate about sales technology, providing a world-class customer experience, and thrive in a fast-paced, hyper-growth startup environment, then becoming a Commercial Sales Executive is the career path for you! At SalesLoft, our Sales Executives build and manage company relationships with potential SMB & midmarket customers around the world. You are our boots-on-the-ground solution to build personal relationships and make our customers successful!  You will be responsible for generating new business with easy-to-identify prospects with a focus on generating new business. You must be able to forecast sales activity and revenue achievement while creating satisfied and referenceable customers. To thrive in this role, you will keep up with industry trends, competitive landscape and customer needs. ResponsibilitiesThis is first and foremost a hunter role. Youll be actively prospecting new business opportunities, as well as developing and upselling current clients.Responsible for the overall business development, client engagement, and sales lifecycle of the SalesLoft platform to large mid-market customers throughout the USConduct in-depth research to identify lead opportunities and present sales strategies to SalesLoft sales leadershipDocument and track all potential and existing client interactions and lead follow-through using Salesforce and SalesLoftExecute detailed product presentations and web demonstrations of our software capabilities to C-level executives, directors, and sales managersIdentify and utilize internal resources (Sales Development, Sales Engineers, etc.) to build SalesLoft brand awareness, assist in sales cycles, and close dealsQualifications2 years of experience selling SaaS solutionsSuper collaborative by prioritizing we and not focusing on meSuperb listening skills. You must understand objections and defeat them by turning skeptics into ecstatic new customersHigh level of empathy. Its important for our AEs to be a good person to peers and prospectsExperience hunting in greenfield environmentsConsistent overachievement of quota and revenue goals w/ a strong W2 track recordProven ability to make strong connections and overcome rejection to achieve resultsDemonstrated ability to conduct compelling on-site presentations and product demonstrations to C-Level executivesWhy work here instead of somewhere else?Voted #1 Top Midsize Workplace in Atlanta by the Atlanta Journal-ConstitutionAwesome commission structure with no capClearly laid out and communicated career progression and promotion planYou will become part of an amazing culture with a supportive CEO and smart teammates who actually care.We have a clear purpose to change the industry of sales, the lives of our customers, and the ecosystem of ATL, to make a dent in the universe.You will join North America's 7th fastest growing company according to the Deloitte Fast 500.You will work with an amazing product team you can learn from and teach.You will experience joining at a high-growth/high-traction inflection point.We have challenging projects using modern technology.You will grow more than you would anywhere else. That is a promise."}