{"jobID": "2725975857", "jobLocation": "Boston_MA", "jobTitle": "Financial Analyst III", "companyRating": "3.5", "companyInfo": {"Website": "www.chacareers.org", "Headquarters": "Cambridge, MA", "Size": "1001 to 5000 employees", "Founded": " 1891", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Boston Medical Center, Lahey Health, MelroseWakefield Healthcare"}, "estimatedSalary": "84000", "jobDescription": "Category: Professional and Management Location: Commerce Place,  Malden, MADepartment: FINANCIAL PERFORMANCE & BUDGETING Job Type: Full Time Job Class: Non-Union Work Shift: Days Work Days: M-F 8-4:30 Hours/Week: 40 Date Posted: 05/04/2018 Requisition Number: hrq-82943Job DetailsTo provide support, analysis and review to Director Reimbursement & Financial Systems Reporting and Senior Management across all areas of the department: monthly financial reporting and analysis, FTE reporting and management, revenue, reimbursement, financial planning, cost reports, external reporting, federal and state reporting, and special projects. Will utilize various systems within CHA (Meditech, Harvest, Kaufman Hall, Access) to collect, organize and prepare analysis for range of reports and filings. Support Sr. Directors, Directors, Managers in the reporting and variance analysis for both staffing and non staffing expenses. Participate in annual budget training for the organization and support identified service line Managers with budget access and preparation. Assist in the federal and state quarterly and annual filings; Intern & Resident program tracking; and review, correction and submission of casemix tape for state submission. Assist department in improving systems and data for more accurate, efficient reporting. Maintain appropriate supporting documentation, participate in audits and reviews. Responsibilities: 1. Responsible for providing a high level of customer service to assigned service lines/departments. Be fully knowledgeable on all aspects of the department functions and reporting as well as the CHA work/data flow and systems to be able to respond and resolve all issues.  2. Perform monthly review of staffing and non staffing variances, research variances and provide complete explanations for the PreCFO and CFO meetings.  3. Prepare, review and process all departmental staffing and non staffing reclasses to ensure accurate reflection of expenses. Work with the department management, staff as well as Purchasing and AP to correct any outstanding PO's or request to correct and prevent further errors. For staffing reclasses verify the correct data and/or allocation in the Meditech source data.  4. Prepare comprehensive monthly analysis of major variances at the service line and the departmental level. Provide thorough explanation of relevant factors and supporting documentation. Generate monthly report package for all service lines for Director and to be presented to SVPs.  5. Assist Director to maintain CHA reporting and budget access tables. Set up new service lines, cost centers, expense and revenue codes as identified. Weekly review and correct new cost centers and mapping for Kaufman Hall dimensions, chart of accounts, and cost report mappings.  6. Complete quarterly state filings for Bed Count and Financials.  7. Review and correct the quarterly casemix downloads. Improve submission quality by reducing errors. Submit to the state and follow-up on questions or issues. Develop and complete quality measures for the inpatient, ER and observation patient reporting.  8. Prepares general and standard journal entries, financial statements, and analysis, comparative reports and account reconciliations.  9. Determines and devises data collection, research techniques, data interpretation and analytical methodology to analyze financial, operational and statistical data  10. Participates in annual budgeting and forecasting process including corporate training sessions, error resolution, projections, report preparation and analysis. Qualifications: 1. Comprehensive experience in variance analysis and the ability to create and produce reports to summarize and present complex financial data to departments.  2. Strong communication skills with ability to explain financial data and concepts to non finance staff as well as provide training on financial systems and reports.  3. Demonstrated experience in a wide range of systems databases, including Meditech, Kaufman Hall budgeting and reporting software.  4. Solid working experience with monthly entries, accruals, prepaids, trial balance, and financial statements. Full understanding of financial work flow including patient accounts, accounts payable and payroll.  5. Bachelor's degree with a major in finance or accounting, along with demonstrated accounting and analytical skills.  6. Superior Excel skills necessary plus current, solid Access experience. Demonstrated proficiency in large, complex databases manipulation and reporting.  7. Requires five to seven years of analytic experience with industry metrics, revenue, staffing parameters and nonstaffing expenses.  8. Experience in Hospital Finance preferred.  [cha072516]"}