{"jobID": "2657608389", "jobLocation": "Mountain_View_CA", "jobTitle": "Knox Security Researcher Intern", "companyRating": "2.6", "companyInfo": {"Website": "www.sra.samsung.com", "Headquarters": "Mountain View, CA", "Size": "1001 to 5000 employees", "Founded": " 1988", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Sony, LG Electronics, Nokia"}, "estimatedSalary": "142000", "jobDescription": " Security Research Engineer Intern  Location: Mountain View, CA  General Description:  Smartphones, tablet, and other mobile devices have completely revolutionized how we operate in our daily lives. From communicating and sharing information to traveling and shopping, Samsung and Android have been at the core of this revolution. The next generation of mobile devices will completely change how we work.  Samsung KNOX is a comprehensive, secure mobile solution for both work life and personal life. It addresses the mobile security needs of enterprise IT without invading an employees personal privacy. Samsung KNOX enables employees to use their favorite personal mobile devices at work as well as enabling enterprises to allow personal use of company devices.  Come join the Samsung KNOX team and help us define and develop the future role of security and productivity for mobile devices and services!  Samsung KNOX A New Solution for your Work Life and Personal Life: https://www.samsungknox.com/  We are hiring at all levels, Apply immediately to our fast growing team!  Position Summary:  As part of the KNOX Security team, security research intern engineers identify and solve difficult security challenges involving Samsungs mobile products. Team members are typically expert in one or more specialties, and can expect to learn more about other areas from exposure to the rest. Due to the breadth of Samsungs enterprise interests, the work is varied: example banner projects include Samsung KNOX, Samsung Pay, and Samsung Connect Auto.  Team Responsibilities Include:  Develop novel technologies for mobile device security, including mobile operating systems, application security, network security, and applied cryptography  Develop tools for identifying vulnerabilities in Samsungs mobile computing systems  Work closely with system software engineers to verify and to integrate developed technologies  Provide guidance to product management, engineering and sales teams throughout the lifecycle of our products and services  Analyze and respond to threats to the security and privacy of enterprises using Samsungs Mobile Business Solutions  Threats include Product Management, consumer-oriented features, engineers writing code under heavy sleep deprivation, and upstreams next brilliant idea  Minimum Qualifications:  Working on undergraduate degree in technical field (e.g., Engineering or Computer Science) or equivalent practical experience  Knowledge with computer security issues, as demonstrated by: Conference papers or talksVulnerability disclosures, such as CVEsTools developed to analyze computer programs A sense of humor!  Preferred qualifications/knowledge: Vulnerability discovery and exploitationAndroid FrameworkAndroid applications development in a professional environmentAndroid SDK performance tools and optimization techniques is a plusAndroid components such as services, providers, activities, fragments etc.Android Framework internals is a plusLinux kernelVirtualizationDriver developmentExploit developmentDevelopment for Trusted Execution EnvironmentsQSEE, Trustonic T-Base (Kinibi)Secure ElementSGXDeveloping and verifying cryptographic protocols under system limitationsEmbedded systemsBootloadersLittle KernelInternet of ThingsIncident response (with professional experience)Digital forensics or malware analysisTizen OSBoundless optimism"}