{"jobID": "2698697174", "jobLocation": "New_York_NY", "jobTitle": "Sales Development Representative", "companyRating": null, "companyInfo": {"Website": "www.sermo.com", "Headquarters": "New York, NY", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Doximity, WebMD Health, HealthTap"}, "estimatedSalary": null, "jobDescription": " Position: Sales Development Representative  Location: New York, Union Square  Report to: Sales Director  Start date: ASAP  SERMO® is the world’s largest social network for physicians and a global leader in healthcare data collection. We have over 15 years’ of experience in healthcare fieldwork and a network of 1.8 million medical professionals worldwide, as well as the number one social network for doctors. Our mission is to revolutionize real-world medicine by connecting doctors around the world to the wisdom and support of their peers.  SERMO is an international company with over 200 employees across eight countries. We are a culturally diverse group of individuals with backgrounds in technology, product, social networks, market research, healthcare and international business. As a performance driven, dynamic company, our aim is to provide the best customer experience possible, while actively encouraging and supporting each employee’s continued growth and development.  SERMO is an Equal Opportunity Employer. SUMMARY: The Sales Development Representative is an individual contributor role. You will work closely with the Sales team to accelerate market penetration of commercial platform offerings through lead development, identification and qualification of prospects, as well as executing critical sales operations activities. This job is about driving revenue growth as a key member of the Sales team and provides opportunity to contribute to a high-growth area of the business and advance within the organization. ESSENTIAL DUTIES AND RESPONSIBILITIES:Generate new business opportunities through outbound activity to fuel the sales pipelineAdminister and qualify inbound sales leadsSupport sales operations including customer and opportunity management, analysis, and reporting using SalesforceGain expertise in our target markets and customer segmentsWork closely with Sales & Marketing on various projects that are in support of the sales cycleWork closely with product, client service and technology teams to assure strong collaboration across the SERMO team in support of client solutionsQUALIFICATIONS:Integrity, passion, high-energy, and positivitySales development or sales operations experience in a high-growth, rapid pace environmentDirect experience generating and qualifying leads for field sales staff a plusAccount Management or supporting function experience at a life sciences focused agency or other healthcare experience is valuedComfortable learning new software systems & existing basic competence, Salesforce a plusProven self-leadership ability and working with cross functional teamsExcellent verbal and written communication skillsBA/BS required"}