{"jobID": "2506412074", "jobLocation": "Campbell_CA", "jobTitle": "$2500 Signing Bonus! - RVT or Senior Veterinary Assistant - Surgery -", "companyRating": null, "companyInfo": {"Website": "www.sagecenters.com", "Headquarters": "Concord, CA", "Size": "201 to 500 employees", "Founded": " 1992", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " United Veterinary Specialty & Emergency, VCA Animal Hospitals, BluePearl Veterinary Partners"}, "estimatedSalary": null, "jobDescription": "Surgery Registered Veterinary Technician or Assistant - $2500 signing bonus for current CA RVT/ $1250 for qualified non-RVTs - Full Time - Bay AreaWho we are:We at SAGE Centers appreciate and love animals. Every day we are honored to provide our patients and their families with the best possible care in an atmosphere of kindness and respect. Come join our fast-paced, growing, learning, innovative, compassionate, and collaborative team.We are seeking a Registered Veterinary Technician or Veterinary Assistant for our Campbell Surgery department.Who you are:Do you love providing exceptional care for animals? Are you a current Registered Veterinary Technician (RVT), or have prior Veterinary Assistant experience? Do you meet the initial qualifications below? If so please apply! Wed love to meet you.Some of the responsibilities you may own in this role:Induce anesthesia, intubate and monitor patients under anesthesiaAssist doctor in surgical procedures using established surgical preparation techniquesDemonstrate proper restraint techniques of patientsCalculate drug dosages (including CRIs)Perform Phlebotomy or Cystocentesis procedures and in house labsPerform catheterizationProcess in-house and outside pharmacy requests as prescribed by the Doctor of RecordGenerate and explain treatment estimates and invoices to clientsReceive telephone calls from clients and answer clinical questions as directed by the Doctor of RecordBasic required qualifications:High school diploma required and minimum 3 years' clinical experience in veterinary fieldStrong interpersonal skills to effectively interface with staff and clients using tact, patience, professional courtesy, and exhibit confidentiality and discretion where appropriateConsistent and reliable ability to perform mathematical calculations for drug doses, CRIs, client invoices and estimates, and other position-related calculationsMaintain the California Veterinary Assistant Controlled Substance Permit (VACSP); must obtain within 60-days of hire or transfer into this roleValid California drivers license with proper vehicle registration and Californias minimum automobile insurance coverage requirementDesired qualifications:Registered Veterinary Technician preferred but not requiredSpecialty experience in SurgeryWork schedule:Full-Time4/10 schedule (4 10 hour days a week)Day ShiftThursday - Sunday availability preferredSAGE Centers, a nationally recognized veterinary specialty hospital system in the Bay Area (Concord, Dublin, Campbell, and Redwood City), employs 350+ employees and veterinarians in a 24/7 setting. Our doctors and outstanding support staff have created a unique environment emphasizing high caliber, compassionate and ethical service to our patients, clients, and referring veterinarians, as well as a continued commitment to the growth and welfare of everyone involved in our organization.We offer competitive compensation and a benefits package with generous employer cost sharing that includes medical, dental, and vision, flexible spending, commuter benefits, and a 401(k) retirement plan that can include company contributions of up to 4% each year. We also offer a generous educational assistance program that supports ongoing learning and development, three weeks of paid time off, plus paid holidays.It is the policy of SAGE Centers to afford equal opportunities for all qualified persons, regardless of their race, creed, color, age, sex, gender, sexual orientation, national origin, religion, disability, medical condition, marital status, veteran status, or any other protected class at the local, state, or Federal level. As such, no applicant or employee will be excluded from employment consideration based on these factors.Visit our careers page to view all current openings! http://www.sagecenters.com/careers/"}