{"jobID": "2829649619", "jobLocation": "Santa_Monica_CA", "jobTitle": "Search Analyst Intern", "companyRating": "4.0", "companyInfo": {"Website": "www.directagents.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "51000", "jobDescription": " Join an experienced and passionate team to develop the sharpest and most innovative digital marketing skills and minds in the industry. You will work with our Search Team and gain hands on training and experience to develop and implement strategies for top tier clients. Come to work each day knowing you are creating real impact and making a difference!  What You’ll Do: Work hands on and learn from seasoned Analysts, Sr Analysts, etc.Learn to understand and master paid search marketing platforms, i.e. Google Adwords, Apple Search Ads, Bing/Yahoo Ads, etc.Research and understand client business models, products/services, verticals, and competitionLearn to develop and implement performance driven campaign strategies for clients in a variety of verticalsBegin to manage daily execution of client campaignsWork directly with clients to communicate campaign results, strategy, issues or needsLearn to provide elite services for clientsGrow to understand and experience additional channels including social, programmatic, SEO, analytics, and moreContinuously learn and maintain up-to-date knowledge of best practices, strategies and latest developments in paid search, learn from search team members and also contribute to search team knowledge base What You’ll Need: Bachelor's Degree preferably in Marketing, Advertising, Engineering, Finance, or Math6 months to 1 year of successful experience in Marketing or related field, preferably with e-commerce clientsExcellent analytical and problem solving skillsExcellent communication skills, verbal and writtenAbility to prioritize tasks, multitask, and manage time efficientlyA sharp mind with the ability to learn quickly, understand and apply new conceptsSelf-starter approach to work, with an eagerness to consistently meet and exceed objectives and take on more responsibilityFamiliarity with HTML, website design, and web analytics. CSS and Javascript is a plus, but not necessaryAbility to work in teams and/or individually to meet client goals What You’ll Get: Competitive compensation and comprehensive health benefitsCare and guidance for your personal growthFast tracked growth with quarterly reviewsLearning & Development opportunitiesCross channel training across paid social, display, analytics & SEOAccess to leading industry conferences and eventsFlexible work schedule and supportive maternity policyPerkSpot Discounts, Gym Membership Subsidies, and More!Who We Are: Direct Agents is a data driven digital marketing agency with offices in NY and LA.  Our award winning cross-channel customer acquisition solutions allow us to help build and transform brands with Media, Strategy, Analytics and Creative.  Our teams are made up of experts who are passionate, collaborative and entrepreneurial, fostering a culture of innovation, learning and fast paced growth. Who We Work With: Some of the brands we work with include Time Inc, NBC Universal, Sony, BBC, IMG, Rolling Stone, Forbes, Shutterstock, HotelTonight and more. How To Apply: Click \"Apply for this Job\" below to submit your application. After doing so, please take our 3-minute marketing metrics assessment followed by a 15-minute aptitude assessment by clicking the following link: Start Assessment"}