{"jobID": "2739244541", "jobLocation": "Boston_MA", "jobTitle": "Senior Business Data Analyst II", "companyRating": "3.5", "companyInfo": {"Website": "www.chacareers.org", "Headquarters": "Cambridge, MA", "Size": "1001 to 5000 employees", "Founded": " 1891", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Boston Medical Center, Lahey Health, MelroseWakefield Healthcare"}, "estimatedSalary": "117000", "jobDescription": "Category: Information Technology Location: CHA Somerville Hospital,  Somerville, MADepartment: IT DSRIP Job Type: Full Time Job Class: Non-Union Work Shift: Days Work Days: M-F (9-5, flexible) Hours/Week: 40 Date Posted: 04/19/2018 Requisition Number: hrq-82965Job DetailsTo maximize the effective delivery of clinical, financial and operational data to all managers and other staff at Cambridge Health Alliance, by locating, analyzing and reporting from every available data source, under the direction of the Director, Business Analytics. This includes: • Production and analysis of both ad hoc and standard sets of utilization, financial and/or clinical data to assess clinical quality, service, operational, organizational, and/or provider performance. • Emphasis on production and analysis of data for Accountable Care Organization (ACO) including but not limited to claims, eligibility, quality metrics, and patient outreach. • Work with department leaders, medical staff, nursing, and key staff as assigned to assess analysis and reporting needs, and developing data sources and reports as necessary. • Extract data from various SQL Server data repositories to aggregate, analyze, and display the information in an efficient way using a variety of different reporting tools such as Crystal, Reporting Services, Epic Reporting Workbench, SAP BusinessObjects, and Excel. • Provide guidance to peers and less-experienced staff in a team-oriented environment. • Participate and take a key role in CHA-wide project teams • Support data extraction and submissions to external databases/performance measurement systems and manipulate and report on data provided by these sources.Qualifications/Experience:Bachelor's degree (Master's degree preferred), preferably in health information management, information systems, computer science, statistics, or business management. 2-3 years as a data analyst or similar experience in a healthcare setting.Epic Healthy Planet, Reporting Workbench, or Radar experience a plus.Tableau experience a plus.Claims experience a plus.The posted grade/title is the highest available for the position. Candidates will be assigned a final title/grade at time of offer, based on candidate's level of education, relevant experience, and taking into consideration internal equity.  [cha072516]"}