{"jobID": "2767299103", "jobLocation": "Redmond_WA", "jobTitle": "Data Scientist Mgmt-WW Customer Success", "companyRating": "4.1", "companyInfo": {"Website": "www.microsoft.com", "Headquarters": "Redmond, WA", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (MSFT) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Amazon, Apple"}, "estimatedSalary": "139000", "jobDescription": " Microsoft aspires to help our customers achieve their own digital transformation, leveraging the power of the Microsoft cloud solutions and services, to support our mission to empower every person and every organization on the planet to achieve more. To help drive this effort, Microsoft is investing in the creation of a completely new discipline and a Customer Success team that will play a key role in helping Microsoft customers achieve this digital transformation through successful adoption of Microsoft Cloud solutions.  The Customer Success team are not a sales team, and not a services / delivery team; they are a new discipline and team that truly focuses on helping our customers to get to successful business outcomes using our technology. The team will do this by engaging with stakeholders and driving consumption through governance of projects, both with key Business Decision Makers and IT Decision Makers. They will ensure that any project is set for success with the right executive sponsorship, outcome engineering, architecture and the right resources (from partners, FastTrack, Engineering, Services, relationship and specialist field sales teams). This customer centric team will, through their actions, over time, drive greater lifetime value, higher renewal propensity, higher consumption/usage and most importantly greater business value for the customer from their investments.  As part of this new organization, we are looking for a senior leader to create, lead and manage a Data Science team focused on Customer Success. This team will provide leadership across the company to provide advanced analytics and machine learning capabilities to drive customer success. You will be creating and leading a team of Data Scientists from the ground up, who will define what it means to drive actionable customer success insights leveraging big data, statistical analysis, machine learning, AI and other advanced techniques to help the company to drive customer success.  We are fortunate to be at the center of the company transformation and will be able to work with rich data across all Microsoft products and services. You will also need to partner closely with other Data Science teams in engineering, marketing and AI&R; who will help to execute, and scale based on the strategies and specialized knowledge of your team. In this role, you will have the opportunity to shape the vision of the team that’s the central intelligence to drive customer success for the company.  As one of the few senior leaders on the team with a perspective across the solutions, you will also become a critical and visible leader internally and externally for Customer Success and will have the opportunity to influence and work with many of the most senior leaders in the company.Responsibilities"}