{"jobID": "2812613026", "jobLocation": "New_York_NY", "jobTitle": "Manager, Customer Experience", "companyRating": null, "companyInfo": {"Website": "www.elysiumhealth.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Our customers, their well-being, and their education and pursuit of knowledge in advancing their approach to health is of top importance to Elysium. As Manager of Customer Experience, this is of critical importance to you and provides your daily motivation. We are seeking an individual with exceptional, high-quality/high-touch experience to lead, manage, and scale our team. This position requires a balance of innovative creativity, analytical thinking and high-impact leadership capabilities. In this hands-on role you will lead and manage the team while developing strategies to optimize workflow and plan for a department at scale.Responsibilities: Lead and manage a growing team of CX associates as the department scales with and supports Elysium Health's business and customers Drive improvements to our workflows and processes in order to meet SLA's and KPI's while driving costs down, all without sacrificing customer experiences and quality Lead strategic initiatives that drive customer satisfaction and growth, working cross-functionally to support customer facing initiatives Research, identify, and implement technical solutions to optimize both customer experience and the workflow of the Customer Experience team. Track, analyze, and report performance data; utilize customer insights to make recommendations to further drive customer loyalty to the brand and improve Elysium's customer experienceRequirements: BA/BS degree followed by 5+ years of experience driving customer satisfaction, including at least 2 years of demonstrable experience managing and developing top-performing customer experience associates Passion for health and wellness; Life Sciences experience a plus Ability to work in a fast-paced, demanding environment and bring a serious amount of passion to company mission and team development  Detail oriented, extremely organized, and metrics-focused with demonstrated ability to help teams meet and exceed performance objectives About Elysium: Elysium Health's mission is to solve the biggest challenges in health with science, to help people live healthier for longer. Elysium works directly with top scientists, clinicians and health professionals around the world to translate advances in science and technology into innovative health products that work. Our product development pipeline begins with research and development, continues with preclinical studies, and culminates with human clinical trials to demonstrate the safety and efficacy of products. Throughout this process, Elysium's focus is to develop compounds found in nature that allow people to support their health proactively. Elysium is guided by a Scientific Advisory Board, which includes multiple winners of the Nobel Prize, as well as researchers and doctors who are experts in chemistry, physiology, neuroscience, complex chemical systems, biochemistry, and many other fields of study.Basis, Elysium Health's first product, is a proprietary formulation of two ingredients designed to support long-term health at the cellular level. Basis is clinically proven to increase NAD+ levels, which decline with age. NAD+ is required for energy creation, regulating circadian rhythms, maintaining healthy DNA, and hundreds of other biological functions.We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}