{"jobID": "2804341237", "jobLocation": "San_Francisco_CA", "jobTitle": "Director of Environmental Services", "companyRating": "4.2", "companyInfo": {"Website": "www.ncphs.org", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "94000", "jobDescription": "SUMMARY:Provides leadership, direction and supervision of Environmental Services which includes plant operations, maintenance, housekeeping, laundry, landscaping, and the function of safety management and design and construction management. Oversees quality control of Environmental Services to ensure continual operations in accordance with established standards, procedures and regulatory compliance. Responsible for the maintenance, safety and cleanliness of all aspects of the community.Essential Functions:Develops short and long term goals and objectives in consultation with community management and consistent with NCPHS Mission, Vision, Core Values and Commitment to Inclusion.Oversees the administrative operations and personnel management of the Environmental Services Department. Interviews, hires, supervises, trains, motivates, and performance management of supervisors within the Environmental Services Department and line staff as needed.Reviews corrective maintenance projects and repairs for community. Oversees and maintains inventory status necessary for the completion of maintenance projects. Makes appropriate recommendations for correction to Executive Director and the Director of Design and Construction as appropriate/requested.Oversees preventative maintenance software programs. Ensures that preventative and corrective maintenance on building, equipment and vehicles are performed and inspected to confirm with all applicable Federal, State, and local codes and regulations, including but not limited to EPA.Ensures the implementation of Fire, Disaster and Safety Programs, Hazardous Materials Business Plan and Emergency Department Response Systems in compliance with all Federal, State and local codes and titles, including but not limited to OSHA/OSHPD and ADA regulations.Ensures training of personnel in general safety practices and procedures including, but not limited to the use of safety equipment for asbestos and other industrial chemicals.Prepares department operating and capital budgets and monitors expenditures. Analyzes costs and assures adherence to budget. Maintains and monitors utilities/energy and cost conservation.Solicits, evaluates and selects bids from outside contractors and service agencies for projects or services in conjunction with the Executive Director and the Director of Design and Construction as appropriate/requested.Acts as liaison between governing agencies and community management in conjunction with NCPHS Management, as necessary.Oversees appropriate performance and quality standards, timeliness of repairs, capital projects and apartment renovations in accordance with NCPHS Project Process.Interacts with Residents and committees on work orders and special projects.Coordinates apartment renovations and remodeling, including scheduling projects and personnel with staff, residents and Department Heads and Supervisors.Reviews all projects within community and makes recommendations to Executive Director, NCPHS Director of Facilities and the Director of Design and Construction as appropriate/requested.Manages the community’s capital budget projects in coordination with the NCPHS Director of Facilities.Maintains computerized capital budget program, determining schedules, interpreting needs, refining consultant recommendation, planning expenditures, and initiating annual budgets as determined appropriate through the use of the program and in conjunction with the Executive Director.Reviews, approves and monitors services and maintenance contracts, maintains permits for building operations and certificates of insurance for all private contractors.Maintains sanitary conditions in reference to garbage collection; Food Services, Health Services, and other related departments.Oversees workplace safety and risk control programs as the community Safety Coordinator to ensure employees are provided education and training regarding safe work practices and occupational exposure. Ensures all workplace injuries are reported and investigated in a timely and thorough manner in accordance to NCPHS procedures. Works with Human Resources and employees regarding Return-to-Work program and Workers Compensation Leaves of Absence when applicable.Recognizes and reports concerns regarding residents' physical, mental and/or emotional status to a member of Management Staff.Carries cellular telephone. Works on-call as necessary.Performs other work as assigned.QUALIFICATIONS:High School or equivalent. Minimum two (2) years college education or trade school with emphasis in trades, covering Environmental Services and/or Maintenance procedures and practices. Bachelors Degree in Engineering or Management field preferred. Minimum of six (6) years practical experience in Environmental Services and/or Maintenance departments of a health care or residential building or similar community. Minimum of three (3) years management experience. Prior experience working with Building Automation and Building systems such as: HVAC, Refrigeration, Boilers, Electrical, Mechanical and Pneumatic Controls. Fire Life/Safety systems. Emergency Generators and UPS systems. California driver license, proof of insurance, clean driving record, and ability to travel to pick up supplies as needed.SUPERVISORY RESPONSIBILITY: Full management responsibility for up to 60 employees and outside vendors. Manages directly or through subordinate Department Heads and Supervisors. Liaison with contractors employed by residents ensuring regulations and insurance requirements."}