{"jobID": "2635050863", "jobLocation": "San_Jose_CA", "jobTitle": "Research Developer Interns", "companyRating": null, "companyInfo": {"Website": "www.baidu.com", "Headquarters": "Beijing, China", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Public (BIDU) ", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Company Information: Located in the heart of Silicon Valley, Baidu USA is the R&D; center of Baidu, Chinas largest search engine provider. Baidu USAs team of elite, world-class researchers and engineers devote their time to tackling the most challenging, change-the-world projects in AI and related fields. Baidu USA is comprised of four groups: Baidu Research US, Intelligent Driving Group US, Baidu USDC and Duer US.  At Baidu USA, we act with the nimbleness of a startup, but as a global company, have access to immense computing resources and data. This makes Baidu USA the best place for those working in AI to see their work developed and potentially deployed to millions of users.  In case in you are wondering, the name Baidu was inspired by a poem written more than 800 years ago during Chinas Song Dynasty. Baidu, whose literal meaning is hundreds of times represents a persistent search for the ideal. Undergraduate and graduate students are invited to submit applications for Research Developer Intern positions in the Big Data Lab (BDL-US) at Baidu Research. We have offices in both Sunnyvale, CA and Bellevue, WA. Openings are available throughout the year, although typically fully-time interns work during the summer. Part-time internships can also be arranged.  Applicants should be pursuing undergraduate or graduate degrees in Computer Science, Electrical Engineering, or related fields. Interns will be assisting research scientists for implementing research ideas or developing systems in large-scale machine learning, fast search in massive data, natural language processing, or computer vision. Applicants please apply onlineand send a CV to bdlus_job@baidu.com."}