{"jobID": "2662054402", "jobLocation": "New_York_NY", "jobTitle": "VP of Enterprise Sales, Finance Practice", "companyRating": null, "companyInfo": {"Website": "www.dataart.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Position OverviewDataArt is looking for a highly experienced VP of Enterprise Sales to lead targeted sales efforts and develop relationships with new mid-to-large enterprise-level clients from the financial services and capital markets sector. The candidate must be able to communicate DataArt’s unique capabilities to deliver complex and customized software solutions. Core responsibilities include creating, managing, and developing a portfolio of enterprise-level financial services/capital markets client engagements.Responsibilities Build strong, long-lasting relationships with mid-to-large enterprise level clients, focusing on the financial services and capital markets sector;Plan, implement and manage sales activities and pipeline to meet annual revenue targets and business goals;Originate sales opportunities and guide them through to successful closure;Scope projects, shape engagements, and help define business solutions that best satisfy clients’ needs and achieve their desired business outcomes;Present DataArt’s unique value proposition to client’s top level executives;Plan resources, organize and mobilize teams (including account management, solution design, UX and delivery teams) throughout the complex sales cycle;Work with DataArt’s engagement managers to ensure maximum client satisfaction and optimized revenue for DataArt;Understand key risks and assist in managing and mitigating them through tactical plans and actions;Evangelize DataArt’s unique capabilities to deliver complex, leading edge, industry-specific custom software solutions through presentations and discussions, participation at events, speaking engagements and tradeshows. Required Skills and Experience Minimum of 5 years’ experience in B2B, custom software and enterprise solutions sales;Technology consulting experience;A record of successful enterprise software solutions’ sales for the finance industry; A demonstrable history of meeting and exceeding quotas (consistent top 20% performance); Excellent understanding of the enterprise environment, including key players, strategies, client structure, business models, needs, challenges, trends;Demonstrated strategic and analytical sales approach with a focus on initiating and building client relationships;High effectiveness in shortening traditional enterprise sales cycle. Additional Competences  Experience with multinational distributed teams;Understanding of IT technologies and tools;Business consulting experience."}