{"jobID": "2738396235", "jobLocation": "San_Jose_CA", "jobTitle": "Sr Fraud Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.signifyd.com", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About you You have a strong will to constantly learn new things and always improve. You are really good at spotting fraud trends and love working on puzzles, investigating suspicious behavior, and digging through large data. All these while using your keen eyes for details to connect the dots. You are well-versed with the payments world (especially CNP environment) and have some background with chargebacks. If this is you, then Signifyd is the place for you. About Us At Signifyd, we’re very good at proving that people are who they say they are. We build software systems that catch bad guys. Using all available payment, user, and machine data, we separate legitimate credit card transactions from fraudulent ones in under 400ms. That means building large-scale systems which reduce the complexity of human purchasing behaviors into simple and quick decisions.  You’ll join a new team working towards minimizing losses, maximizing revenue and mitigating fraud for our customers. You will be working with various cross-functional teams and will be analyzing and interpreting suspicious trends, fraud and chargeback data to draw actionable intelligence to feed into our models. This is a high-impact role that offers tremendous opportunities for growth, learning and leadership. Primary ResponsibilitiesIdentify meaningful insights from chargeback data. Interpret and communicate findings from analysis to engineers, product and stakeholders.Analyze high-volume data to investigate, identify and report trends linked to fraudulent transactions.Review suspicious activity and complex fraud cases to help identify and resolve fraud risk trends and issues.Collaborate with cross-functional groups such as Customer Support, Product Management, and Engineering to enhance tools, data sources, system functionalities, and fraud detection methodsMonitor fraud alerts and configure risk rules accordingly to flag potential fraudulent ordersApply risk management policies and procedures to help manage and minimize losses.QualificationsMinimum 5 years experience in fraud investigation in e-commerce or payments industryAnalytical, quantitative mindset with a keen attention to detailHigh level of computer skills to effectively use multiple systemsWillingness to adapt to a constantly changing, customer-driven work environmentAbility to work on routine tasks both independently and with the teamSelf-starter and comfortable taking initiative while quickly grasping concepts, processes and ideasExcellent SQL skillsFluency with data analysis and visualization tools (Tableau is extra credit)(highly desired) Familiarity with scripting(highly desired) Experience working with Rules EngineLocal candidates only"}