{"jobID": "2812197220", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist / Data Engineer (San Francisco, CA)", "companyRating": "4.2", "companyInfo": {"Website": "www.makethunder.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "105000", "jobDescription": " The New York Times describes Thunder as \"an ad engine to put Mad Men out of business.\" We're changing how digital ads are created and distributed by automating much of what people thought couldn't be done by computer. Our technology retrieves all relevant content about an advertiser across the web to intelligently design a beautiful set of ads for desktop, tablet, and mobile devices all in under a minute. THE JOB Thunder is looking for a talented Data Scientist with a track record working with Big Data and Distributed Systems to manage a cutting-edge infrastructure used by the world’s largest digital advertisers. We’re using Big Data in groundbreaking ways to uncover customer insights, personalize customer experiences and fix digital advertising. You will contribute as a key member of the Product Engineering team where you will be driving product and engineering innovation to better leverage Thunder's growing personal graph. We are looking for a self-starter who thrives with ambiguity and loves solving challenging problems. RESPONSIBILITIESDesign and develop Big Data and real-time analytics solutions using industry standard technologiesCollaborate with internal business and product teams to identify product features that can be powered by advanced data analyticsUse various machine learning and statistical techniques to analyze data, build models and identify requirements for operationalizing those models into production servicesWork with external customers on challenging data analysis problemsQUALIFICATIONS Ideal candidates will have hands-on, operational experience building and operating large-scale data analytics services and thrive working in a fast-paced startup environment. 5 -7 years of hands-on experience with using advanced statistics techniques and machine learning to build operational production servicesStrong understanding of machine learning, recommendation systems, predictive analytics, and multivariate analysisStrong computer science fundamentals including data structures, algorithms, distributed systems and common design patternsStrong database and data engineering experience with hands-on experience building services that leverage a variety of database systems including SQL, Redshift Spectrum, Druid, Hadoop, Hive, HBase, Spark, Kafka, AWS Kinesis, MongoDBB.S. or M.S. in Computer Science, Computer Engineering, Mathematics, Statistics, Applied Mathematics or related experience"}