{"jobID": "2755008534", "jobLocation": "San_Jose_CA", "jobTitle": "Senior Staff Field Applications Engineer", "companyRating": "3.7", "companyInfo": {"Website": "www.xilinx.com", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 1984", "Type": " Company - Public (XLNX) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Qualcomm, Intel Corporation, AMD"}, "estimatedSalary": "161000", "jobDescription": "Description Xilinx is the world's leading provider of All Programmable FPGAs, SoCs and 3D ICs. These industry-leading devices are coupled with a next-generation design environment and IP to serve a broad range of customer needs, from programmable logic to programmable systems integration. Our All Programmable devices underpin today's most advanced electronics. Among the broad range of end markets we serve are:Aerospace/DefenseAutomotiveBroadcastConsumerHigh Performance ComputingIndustrial / Scientific / Medical (ISM)WiredWirelessThis Xilinx FAE will be responsible for Xilinx strategic accounts in San Jose, and Bay Area managing all pre sales and post sales technical interaction with Xilinx customers and Xilinx factory experts to maximize Xilinx presence in our customers systems.  Responsibilities: Provide deep technical support to customers in their selection and use of Xilinx development tools, silicon and IP products that ensure successProvide technical leadership and guidance that focuses on design win strategies for all customer opportunitiesAnalyze customer needs, and compare and contrast Xilinx and competitive solutions in order to maximize the customers use of Xilinx productsCollaborate with field and factory resources to develop and deliver technical proposals to customer project managers, engineering managers, system architects and design engineersCode and implement circuits to demonstrate efficient use of Xilinx technology and competitive advantages to secure design winsTechnical solution creation(eg: hardware, software demos, example designs)Guide customers through their design processProvide onsite support, and solve real time problems including software tool issues, RTL and simulation assistance, HW lab debug, embedded system bring upUse factory supplied presentation and demonstration material to craft and deliver presentations and demos on Xilinx products, tools, and methodologies that align with customers’ needsProvide regular feedback to Xilinx management and factory experts on the needs of the customer base Qualifications: A Bachelor's Degree in Electrical Engineering or Computer Science or equivalent; Master's Degree preferred"}