{"jobID": "2688667193", "jobLocation": "Mountain_View_CA", "jobTitle": "US Sales Account Manager", "companyRating": null, "companyInfo": {"Website": "www.flashbay.com", "Headquarters": "London, United Kingdom", "Size": "501 to 1000 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "US Sales Account ManagerAre you looking to start a career within a dynamic, entrepreneurial and growing company? Do you have the confidence, energy and commercial nous to be part of the World’s No. 1 business-to-business (B2B) supplier of logo branded Promotional Technology products? If so check the details below and apply now to join FlashbayAbout the Role:• Effectively and efficiently converting warm inbound leads into new customers• Building and maintaining relationships with a portfolio of existing customers• Acting as the single point of contact for customer queries via phone and email• Pursue sales target objectives for assigned territory• Maintain database with accurate and current customer and prospect information• Accurately update, maintain and develop pipeline by using our CRM system• Fast-paced target driven environmentAbout You:• English speaker to native standard• Degree educated and/or relevant work experience (e.g. Sales, Customer Service)• Motivated and target driven - to meet and strive to exceed the sales targets and expectations set• Dynamic and KPI-driven• Strong presentation and negotiation skills• Excellent spoken and written communication skills• Exceptional time management skills• Detail orientated with strong follow up skills• Excellent organisational and multitasking skillsAbout Us:Flashbay is the World’s No.1 business-to-business (B2B) supplier of logo branded Promotional Technology products. From the smallest schools to the largest multinationals, we offer an attractive range of designs within our Memory, Power and Audio categories, offering unbeatable prices coupled with fast and efficient service. Our product lines include Flash Drives, Power Banks, Speakers, Headphones and a host of related technology products and accessories which allow our customers the unparalleled ability to promote their brands with confidence on the global stage.About our Training:Our Sales Hero Academy will ensure you are equipped with everything you need to be a great success: sales skills, product knowledge and an understanding of our clients. The training programme, along with on-the-job support and coaching will get your career off to a flying start!About our Offer:We have a great working environment, modern offices and free fresh fruit and delicious coffee. We recognize the importance of a healthy work/ life balance. On top of this we offer a competitive basic salary; benefits package; target based incentives with cash prizes; and an uncapped commission structure which typically adds an additional $25-45k to your basic salary in year one.Location: Mountain View, California"}