{"jobID": "2829343337", "jobLocation": "Boston_MA", "jobTitle": "Data Analyst, Global Product Analytics", "companyRating": "3.0", "companyInfo": {"Website": "www.pearson.com", "Headquarters": "London, United Kingdom", "Size": "10000+ employees", "Founded": " 1844", "Type": " Company - Public (PSO) ", "Industry": " Education", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": " Data Analyst, Global Product Analytics  Description  At Pearson, we're committed to a world that's always learning and to our talented team who help make that possible. From bringing lectures vividly to life to turning textbooks into laptop lessons, we are always re-examining the way people learn best, whether it's one child in our own backyard or an education community across the globe. We are bold thinkers and standout innovators who motivate each other to explore new frontiers in an environment that supports and inspires us to always be better. By pushing the boundaries of technology and each other to surpass these boundaries we create seeds of learning that become the catalyst for the world's innovations, personal and global, large and small. Position Summary: NOTE: MUST be fully authorized to work in the U.S. No OPTs, visa sponsorship, visa transfers or future green card sponsorships.  Product Analytics is transforming education, and Pearson is at the forefront of using data to improve teaching and student learning. With over 10 million higher education students annually studying in our MyLabs, Mastering, and other digital learning products, we generate a lot of data. We also have great instructional and assessment content. Our product teams are building adaptive and intelligent learning systems to derive actionable insights about our learners, instructors and institutions. Today, our learning products are delivering personalized experiences worldwide, establishing a powerful foundation for new research and innovation.  We are looking for a uniquely talented individual who can turn data into insight and action. A Data Analyst in Global Product Analytics consults with internal customers to understand their business questions, and then delivers analyses to meet those needs. Along the way, instrumentation is specified and deployed, data pipelines and processing defined, and visualizations built. The end results help optimize our customer experience and inform the entire product life-cycle from ideation to launch to constant improvement.  We are looking for strong critical thinking skills, the ability to navigate various data environments, hands-on technical ability in data, and a drive to understand our business. The successful candidate will be a thought partner to our customers and will assist them in understanding data and generating further questions. This individual will dig into raw and processed data (backend DBs, Google Analytics, and event/message data), transform information into visualizations using Tableau, R, Excel, etc., and effectively articulate the story behind the data. The role involves close interaction with product management, user design groups, data warehouse developers, data architects, and software development teams. Strong communication and interpersonal skills are critical. High Level Responsibilities:Partner with product managers and content teams to prioritize, scope and perform in-depth analyses that drive and inform strategic decisions, especially related to product development and growth initiatives.Develop insights to answer complex questions via thorough and well-designed data analyses using SQL, R, and Tableau and other tools with a focus on product efficacy and the optimization of learning outcomes.Provide thought leadership with internal stakeholders so that they may be able to better leverage insights.Connect with Product and Engineering teams to produce instrumentation to generate insightful measurements on our new and existing products.Work across departments and collaborate with business managers, user experience designers, systems architects, engineering delivery teams, project managers, QA, and operations teams.Identify information and visualizations required to tell a compelling and meaningful story using data; establish baselines and monitor growth or decline in metrics.Contribute to tools, documentation, and instruction to enable our customers to increasingly use data independently.Track and report on the status of deliverables in a project schedule. Serve as a point of contact to our business partners and cross-functional teams for day-to-day management of the Analytics program.Help create and maintain the plan, schedules, and other documentation required to effectively manage deliverables to our customers.Expected Results:Effective instrumentation to remediate data gapsAnalysis and insights delivered across our productsSmart, intuitive data/insight tools that promote data-driven decision makingStrong relationships with our internal stakeholdersQualificationsCompetencies:Leadership in an environment of uncertaintyInnovationSweating the details and delivering resultsCommunicating and managing complexityWorking across functions/disciplinesEngaging and motivating othersBeing a team builder/team playerRequirements:2 years in a highly analytical or quantitative functionBeing a strategic thinker, analytical, and detail oriented -- and having excellent problem-solving skills and a strong work ethic. Being a motivated self-starter, an evangelist for a data-driven culture, and desiring a deep understanding of customer needs.Ability and willingness to learn structured and unstructured data systemsExperience in developing business requirements for instrumentation with Google Analytics; ability to instrument in Google Tag Manager a plusProficiency in effective report/dashboard design and standardsFamiliarity with data preparation, processing, classification, and forecastingFamiliarity with the software product lifecycleAbility to write SQL and create data visualizationsExperience with Amazon S3, Redshift, Athena, Google Tag Manager, Google Analytics, Google Big Query, Tableau, or JavaScript, are big pluses!A Bachelor's degree or advanced degree in a technical, business, or math-based fieldExperience interacting with individuals at all levels, good time management, and solid communication skills.Proven leadership ability to influence and inspire people indirectly, lead by example, and engage and effectively build multidisciplinary alliancesAbility to do some travel for planning and team meetings (20%) and frequently use web-based remote video and project collaboration tools NOTE: MUST be fully authorized to work in the U.S. No OPTs, visa sponsorship, visa transfers or future green card sponsorships. #LI-NB0 Pearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.  Primary Location: US-CO-Centennial  Other Locations US-MA-Boston, US-NJ-Hoboken, US-CA-San Francisco  Work Locations: US-CO-Centennial-2154 East Commons 2154 East Commons Avenue Centennial 80122  Job: Product Management  Organization: Global Product  Employee Status: Regular Employee  Job Type: Standard  Shift: Day Job  Job Posting: Jun 13, 2018  Job Unposting: Ongoing  Schedule: Full-time Regular  Req ID: 1809018  Pearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply.SDL2017"}