{"jobID": "2745310274", "jobLocation": "San_Francisco_CA", "jobTitle": "Compliance Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.ucsf.edu", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1864", "Type": " College / University", "Industry": " Unknown", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "JOB OVERVIEW The Compliance Data Analyst will be working under the general direction of the Executive Director Procurement & Supply Chain Solutions, Supply Chain Management (SCM).  The Compliance Data Analyst is a critical position and has a key role in the success of the supply chain programs in supporting the risk assessment and prevention to achieve the strategic goals of the department which supports the vision and mission of the university. The Compliance Data Analyst will work to strengthen SCM’s various compliance programs and assist with the organizations risk assessment initiatives. The individual will provide guidance for new business operations/processes to help ensure risk mitigations are in place and properly designed.  As the resident expert for UCSF SCM, this Analyst is expected to be highly proficient in report writing, data management, relational database, risk assessment, research, and identify abnormal transactions. This Analyst will regularly works on tasks that are varied and complex. The Analyst will use advanced reporting writing technic with proper criteria to detect fraud, high risk transactions, non-compliant purchasing activities.  The Analyst applies full range of specialized skills and job knowledge; frequently adapts procedures, techniques, tools, materials, and/or equipment to meet specialized needs; may serve as lead; performs broad and/or focused assignments under general supervision; originality and ingenuity are often required. The individual uses continuous monitoring of data to identify risks and anomalies as part of compliance and risk mitigation. This Analyst is lead data analyst providing expertise in new systems and programs related to source-to-settle and any modules that affect SCM activities. A thinking out-of-the-box approach is often necessary to support a model that enables efficient and operationally cost effectiveness.  Please note: This is a full time contract position from June 1, 2018 to June 30, 2019.SUPPLY CHAIN MANAGEMENT Supply Chain Management (SCM) facilitates the purchase of the highest-quality goods and services at the least total cost. This is achieved by developing strategic partnerships, pursuing initiatives that leverage the power of our collective spend and investing in talented staff and state-of-the-art technology, as well as ensuring compliance with all University of California policies and state and federal regulations. ABOUT UCSF The University of California, San Francisco (UCSF) is a leading university dedicated to promoting health worldwide through advanced biomedical research, graduate-level education in the life sciences and health professions, and excellence in patient care. It is the only campus in the 10-campus UC system dedicated exclusively to the health sciences."}