{"jobID": "2811677490", "jobLocation": "San_Jose_CA", "jobTitle": "Emergency Room Nurse - RN II", "companyRating": "2.6", "companyInfo": {"Website": "www.regionalmedicalsanjose.com", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 1965", "Type": " Hospital", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "65", "jobDescription": "Regional Medical Center of  San Jose is an acute care hospital with a Level II Trauma Center. The  hospital provides a host of technologically-advanced services including Cardiovascular, Neuro, Orthopedic, Bariatric and General  Surgery, Interventional Pulmonology and services for Women. Regional holds Joint Commission advanced  certification as a Comprehensive Stroke Center and  a Get with the Guidelines- Stroke Gold Plus Performance  Achievement Award from the American Heart Association/American Stroke Association.  It is a certified Chest Pain Center, county-designated STEMI (heart  attack) Receiving Center, designated Lung Cancer Screening Center, a member  of Extracorporeal Life Support Organization (ECMO) and is  certified by The Joint Commission in Sepsis care.  We’re hiring top talent today to join an outstanding, hardworking Emergency Department RN’s to join our team, that strive for excellence in servicing our patients at Regional Medical Center of San Jose. Interested in joining this team? Apply online now. Schedule: 0.8 (32 hours per week), Shift: Evenings with rotating weekends.POSITION SUMMARY: Provides nursing care for a  wide spectrum of illnesses and injuries including life saving procedures in all  types of emergency and trauma situations to chronic medical problems, minor  illnesses and injuries. Maintains  standards for professional nursing practice in the Emergency/Trauma clinical  setting. Participates in organizational  and unit based quality improvement activities.  Completes required competencies within the defined time frames. The RN II will function within the full scope  of RN licensure according to the California Nursing Practice Act. The RN II may be assigned the position of  charge nurse. KNOWLEDGE/SKILLS: Minimum: Care of Emergency/Trauma patients LICENSE/CERTIFICATION REQUIREMENTS: Minimum: Current California Registered Nurse (R.N.) license,  American Heart Association (AHA) Basic Life Support BLS), Advanced Cardiac Life  Support (ACLS) and Pediatric Advanced Life Support (PALS)  Preferred: Trauma Nurse Core Course provider (TNCC-P)  and Neonatal Resuscitation Provider (NRP), Certified Emergency Nurse (CEN) EXPERIENCE REQUIREMENTS: Minimum: 1 year of acute care nursing in an acute care hospital  Preferred: Emergency, Trauma, Critical Care experience EDUCATION REQUIREMENTS: Minimum: Graduate of an accredited Registered  Nursing program  Preferred: Continuing education pertaining to Emergency/Trauma  care"}