{"jobID": "2757044019", "jobLocation": "Campbell_CA", "jobTitle": "Accounts Receivable Financial Analyst I", "companyRating": "3.7", "companyInfo": {"Website": "www.upliftfs.org", "Headquarters": "Campbell, CA", "Size": "501 to 1000 employees", "Founded": " 1867", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "18", "jobDescription": "Title: Accounts Receivable Financial Analyst IClassification: Non-ExemptActual offers will be determined by the candidate’s creditable years of experience in conjunction with internal equity considerations and based on the organization’s current compensation practices.Job Code: 514Job SummaryUnder general supervision, works within the vision, mission and philosophy of the agency ensuring the promptness and accuracy of monthly agency reporting requirements, contract interpretation, billings and acts as the key liaison with designated funders. Provides troubleshooting (BCMS, Tier, Tier Billing) to adhere to programmatic changes, conversions and to address billing errors. .Essential Duties1. Provide timely reporting requirements to maximize contracts secure adequate payment and remain in contractual compliance.Develop and produce monthly census reports.Develop and produce client flex fund expenditure reports.Develop and produce client monthly summary reports.Prepare line item costs by engineering the regional and occupancy pool statements to combine with project statements to get contract budget line item detail for cost reimbursement programs on a monthly basis and complete required county forms.Regularly analyze Agency’s billing and Funder reports to identify any variances and resolve.Provide financial analysis, drawing conclusions and formulating recommendations to ensure efficiencies and audit readiness.Analyze monthly reimbursement reports and contract terms to provide guidance for program and funding source based payment application and error resolution.Attain information and coordinate process flow between billing department and clinical staff and funde2. Ensure proper billing occurs in accordance with Uplift Family Services’ county funded billing contracts and actively follow up on billing issues and past due accounts with applicable staff ensuring issues are resolved. This includes but is not limited to:Review and interpret contracts for billing requirements, reimbursement specificity and reporting.Attain any pertinent information that has fiscal A/R impacts.Set-up monthly billing templates, calculate timely and accurate monthly claims and produce any needed monthly financial reporting forms.Additionally, produce timely and accurate billings for any private insurance clients and determine what needs to be held back from county monthly claim due to other health coverage or lack of service authorization.Provide timely follow through and resolution with held back billing..Provide support to clinical staff and management team in the area of funding source compliance and reporting requirements in applicable areas.Key liaison between fiscal funding representatives and Uplift Family Services’ program staff and management.As needed, provide information and feedback to funding sources and participate in necessary meetings and error resolution.Act as lead with IT on troubleshooting BCMS errors for applicable contracts..3. Work closely with the Supervisor and Billing Manager in specific functional areas:Be cross-trained in identified functional areas4. Independently perform other responsibilities or special projects, as assigned by management, to support department and business needs.Education RequirementsAssociate’s Degree (AA/AS) in Accounting, Finance or equivalent combination of education and experience required.Bachelors, B.A. or B.S. degree in Accounting, Finance or related field preferred.Experience RequirementsMinimum 3 years related billing/accounting/finance experience requiredOther Specific RequirementsMust pass Department of Justice (DOJ), Federal Bureau of Investigations (FBI), and Child Abuse Index Check (CAIC) background clearance.Ten (10) key by touch.Microsoft Office; specifically intermediary Excel skills; basic Access skillsGood written/verbal communication skills.Good interpersonal skillsDemonstrate ability to work in an environment that promotes compassion, service and social justice.Commitment and support for organizational initiatives.Ability to work co-operatively with others toward a common goal.Familiarity with automated billing modules and understanding of G/L bookings.Familiarity with general accounting software packages.Work Environment/ConditionsThe work environment conditions as described below are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable qualified individuals with disabilities to perform the essential functions.While performing the duties of this job, the employee is occasionally required to stand; walk; sit; use hands to handle, or feel objects, tools or controls; reach with hands and arms; climb stairs; balance; stoop; kneel, crouch or crawl; talk or hear; taste or smell. The employee must occasionally lift and/or move up to 25 pounds. Specific vision abilities required by the job include close vision, distance vision, color vision, peripheral vision, depth perception, and the ability to adjust focus.Employee Statement of UnderstandingI have read and understand the job description for my position. I am able to perform all of the essential functions of this position. I agree to successfully complete all required training indicated for this position. I agree to keep all of my required certifications and licenses current and up to date and provide proper documentation of the same to the Human Resources Department. I agree to comply with all Agency policies and procedures. I agree to comply with the agency compliance plan and all laws, rules, regulations and standards of conduct relating to my position. As an employee, I understand my duty to report any suspected violations of the law or the standards of conduct to my immediate supervisor. As an employee, I will strive to uphold the mission and vision of the organization. All employees are required to adhere to the values in all their interactions with youth and families and fellow employees."}