{"jobID": "2829405544", "jobLocation": "San_Jose_CA", "jobTitle": "Marketing Operations Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.maximintegrated.com", "Headquarters": "San Jose, CA", "Size": "5001 to 10000 employees", "Founded": " 1983", "Type": " Company - Public (MXIM) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Texas Instruments, Intersil, Analog Devices"}, "estimatedSalary": "82000", "jobDescription": " Minimum Degree Required  Associate's Degree  Career Level  Non-Manager - Experienced (3+ years exp) Job Description Maxim Integrated is a highly successful, $2.31 billion company. With offices and manufacturing sites around the world, we design award-winning semiconductors that make the world more integrated. We also know that it s our people who make us a great company. So we reward bold thinking, teamwork, personal growth, and community involvement. Want to make a difference and be challenged every day* Join us at Maxim Integrated. With analog integration, the possibilities are endless.  Maxim Integrated is seeking a Digital Marketing Specialist who has experience in supporting strategic marketing initiatives focusing on lead management project, marketing automation system management and mass email creation. This person will work closely with global Marketing, IT, Customer Operations and Technical Services to make sure the lead management process is working smoothly and as expected from end to end, and the emails are built and delivered on time and. Responsibilities:Monitor the lead creation/update process between the marketing automation system and CRM; Investigate and solve issues if exist in the lead creation/update processMonitor lead capture process in marketing automation system to make sure all activity data is captured; Investigate and solve issues if there is anyUpload leads generated through third party vendors into marketing automation systemAssist with marketing automation system configuration with CRMCreate emails, landing pages, forms and segments (from scratch) in marketing automation systemPull email performance reports from marketing automation system to evaluate email effectiveness in a marketing programPerform and project manage the quarterly email bounce cleansing projectAdditional projects may be assigned based on demandMinimum QualificationsSkills/Abilities/Experience & Qualifications:Expertise in Excel spreadsheets; need to be very comfortable with using varieties of functions and working with Pivot tablesAbility to analyze, investigate and troubleshoot lead management related issues in marketing automation systemAbility to think out of the box and make recommendations on how to improve business processes to avoid data issues in the futureWell-developed analytical and problem solving skills with an attention to detailSolid understanding of relational databases; fluent in SQL a plusPrior email building experience with marketing automation system (e.g. Eloqua, Marketo, Silverpop, Adobe Campaign) required; this position requires hands-on experience of pulling elements of an email blast together in the email creation interface inside the marketing automation systemFluent with Dreamweaver or similar HTML editing toolFluent with HTML to be able to build new email templates and modify existing email templates; Working knowledge of Javascript a plusHave a sense of best practices in emails and be able to suggest a better design of the email to drive engagement with prospects and customersA self-starter with exceptional organizational skills, attention to detail and the ability to multi task under tight deadlinesAn appetite to learn advanced marketing tools and tactics in a fast paced, evolving direct marketing environmentFlexibility to manage competing priorities and shift focus as determined by changing priorities and needs of the department or the business as a wholeAbility to effectively present information and respond to questions from groups of managers, vendors and other employees3+ years experience in a digital marketing/marketing operations groupNo immigration sponsorship - candidates must be either a US citizen or a permanent resident. Maxim is an equal opportunity employer and gives consideration for employment to qualified applicants without regard to race, color, religion, sex, national origin, disability or protected veteran status.  Percentage of Travel 0% - 10% Relocation Assistance Available  No  Visa Sponsorship Available  No"}