{"jobID": "2795057579", "jobLocation": "Boston_MA", "jobTitle": "Senior Healthcare Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.bidplymouth.org", "Headquarters": "Plymouth, MA", "Size": "1001 to 5000 employees", "Founded": " 1903", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": " Senior Healthcare Data Analyst  12-Feb-2018 Job PostingJob Summary: Reporting to the Senior Director, Clinical Informatics and System Strategy in the System Integration and Care Coordination Dept., the Senior Healthcare Data Analyst is responsible for examining and researching monthly and quarterly total medical expense (TME) trends with payer contracts so as to inform the development of clinical strategies that reduce TME and enhance Population Health. Furthermore, leverages disparate data systems across organizations to augment lagged and incomplete claims warehouse data with real time operational data across the system. Utilizes strong analytical, technical and communication skills to understand, track and discuss opportunities with internal and external stakeholders, including among senior clinical and operational leaders across the system. Essential Responsibilities:Collaborates with clinicians and organizational leaders to identify data/information reporting needs, collect necessary data, analyze data and identify trends to reduce Total Medical Expense (TME) and enhance Population Health. Runs Leakage Reports and assesses trends for action planning with physicians and management.Works very closely with Sr. Direct. Under the Direction of Sr. Director, supports HMFP Leadership by providing appropriate data reports on TME, Retention/Leakage and others as requested by CEO, CFO, SVP of Network Development at HMFP or and HMFP Leadership to review Leakage reports and support planning for changes for improvement/retaining care.Works collaboratively with Sr. Director and SVP on Integration initiatives across the System by supporting data needs, reports and participation at Integration Committee meetings. Research, identify, & implement new approaches and methods to facilitate TME reduction and population health enhancement.Research outliers and identify root causes of issues identified in reports; will require understanding of overall business and collaborative engagement with content experts within and beyond BID System and Beth Israel Deaconess Care Organization ( BIDCO). Ensure consistency of approach related to analysis techniques, key findings, and the development of recommendations/ opportunities.Maintains the new System Integration and Care Coordination Report Card for System Leadership Committee, chaired by CEO of BID and the System. Maintains System Clinical Dashboards of BID N, BID M, BID P. identifying performance trends and makes recommendations for improvement.Required Qualifications:Bachelor's degree required. Master's degree in Healthcare Systems preferred.5-8 years related work experience required.At least 3 years of multiple application maintenance with relational databases.Advanced technical computer skills as required for technical support specific to functional area and related systems including understanding SQL and ability to write efficient queries.Advanced skills with Microsoft applications which may include Outlook, Word, Excel, PowerPoint or Access and other web-based applications. May produce complex documents, perform analysis and maintain databases.Preferred Qualifications:Thorough understanding of databases and experience with healthcare claims preferred.Ability to design and perform sophisticated statistical and data analysis using SQL and Excel. Ability to learn new technical paradigms that enhance analytical portfolio (e.g. google distance matrix API).Working knowledge of comparative effectiveness studies and/or six sigma statistical techniques. Strong problem  solving skills and business process oriented with consulting experience.Competencies:Decision Making: Ability to make decisions that are guided by precedents, policies and objectives. Regularly makes decisions and recommendations on issues affecting a department or functional area.Problem Solving: Ability to address problems that are highly varied, complex and often non-recurring, requiring staff input, innovative, creative, and Lean diagnostic techniques to resolve issues.Independence of Action: Ability to follow precedents and procedures. May set priorities and organize work within general guidelines. Seeks assistance when confronted with difficult and/or unpredictable situations. Work progress is monitored by supervisor/manager.Written Communications: Ability to communicate clearly and effectively in written English with internal and external customers.Oral Communications: Ability to comprehend and converse in English to communicate effectively with medical center staff, patients, families and external customers.Knowledge: Ability to demonstrate full working knowledge of standard concepts, practices, procedures and policies with the ability to use them in varied situations.Team Work: Ability to act as a team leader for small projects or work groups, creating a collaborative and respectful team environment and improving workflows. Results may impact the operations of one or more departments.Customer Service: Ability to provide a high level of customer service to patients, visitors, staff and external customers in a professional, service-oriented, respectful manner using skills in active listening and problem solving. Ability to remain calm in stressful situations.Physical Nature of the Job: Sedentary work: Exerting up to 10 pounds of force occasionally in carrying, lifting, pushing, pulling objects. Sitting most of the time, with walking and standing required only occasionally Req ID24061BRCity Boston Job Title Senior Healthcare Data Analyst Hours 40 Hours Department Description BID System Integration and Care Coordination Dept works closely with our System Hospitals and leadership to integrate care within the tertiary and community sites, to analyze salient quality metrics in an effort to reduce TME (Total Medical Expense), decrease patient leakage and enhance retention, identify trends for action planning and improve care across the Beth Israel Deaconess care continuum. The department works with key stakeholders at BID and affiliates as well as with our ACO – Beth Israel Deaconess Care Organization throughout Eastern Massachusetts, and is tasked with ensuring optimization of resources across all sites to achieve mutual system goals. Shift Day Employment Status Full Time Job Category Professional & Management Organization Beth Israel Deaconess Department System Integration and Care Coordination "}