{"jobID": "2796541893", "jobLocation": "San_Jose_CA", "jobTitle": "Search Engine Optimization (SEO) Manager", "companyRating": "3.5", "companyInfo": {"Website": "www.fishercareers.com", "Headquarters": "Camas, WA", "Size": "1001 to 5000 employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": " OverviewThe Search Engine Optimization Manager’s primary goal is to maximize Fisher Investments’ presence in branded search results in both US and international markets. This is a fantastic opportunity if you are tech-savvy but also love being innovative and creative. Responsibilities include publishing content, optimizing websites, conducting competitive analysis, handling influencer outreach, and more.  Do you have in-depth knowledge of SEO industry trends and Google ranking factors? Do you have hands-on experience executing integrated SEO programs for mid- to large-size businesses? Do you thrive in an innovative environment and have the ability to think creatively, generate new test ideas, and solve problems? Then we want to hear from you! Drive Results By:•Drive positive branded search results in both US and foreign markets•Perform keyword research and competitive analysis•Recommend and execute strategies in support of SEO goals•Coordinate off-page activities like influencer outreach•Monitor the web for brand mentions•Monitor and evaluate search results and performance across the major search channels•Prepare dashboards and regular reporting for management•Continually develop new ideas for testing, and execute those tests•Regularly communicate to team and management on project development and results•Coordinate agency resources and activities•Research and keep pace with SEO industry trends and developments Qualifications:•Minimum of 4 years of experience executing and managing SEO programs at local, national and international levels•Deep understanding of ranking factors for Google’s algorithm, both past and present•Experience with Google services, including AdWords, Search Console (Webmaster Tools), and Google Analytics•A functional understanding of back-end elements such as HTML, CSS, robots.txt, metadata, etc.•Experience with technical SEO analysis, site analysis, and reporting•Familiarity with tools of the trade (MOZ, SEMrush, Majestic, etc.)•Experience administering content in CMS environments•Experience utilizing SEO in reputation management and brand-building•Ability to work in a professional, performance-based environment•High levels of integrity, autonomy, and self-motivation•Bachelor’s degree is required The Bottom Line: Fisher Investments is not your average finance firm. We are a privately-held investment management firm that has grown significantly over the years. We currently manage over $60 billion for high-net-worth private clients and some of the world’s preeminent institutions. We have operations in the US and UK with further global expansion underway.  We believe excellence and extraordinary efforts should be well-rewarded. Are you up to the challenge? If so, APPLY NOW!  FISHER INVESTMENTS IS AN EQUAL OPPORTUNITY EMPLOYER.  #LI-FI1"}