{"jobID": "1955351747", "jobLocation": "San_Jose_CA", "jobTitle": "Senior Service Technician – Security", "companyRating": null, "companyInfo": {"Website": "www.rfi.com", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Are you: TechnicalIndependentCompetitiveProfessionalOptimisticFast-pacedResponsibleGoal-oriented If this sounds like you, keep reading. Overview & Responsibilities: RFI Communication & Security Systems San Jose is looking for a confident Senior Service Technician for our Security team. We are seeking a candidate who is technical, enjoys working independently but can be part of a larger team. RFI Senior Service Technicians will report to the Service Operations Manager, but are responsible to the Service Dispatchers on a daily activity basis. Responsibilities include, but are not limited to: responding to and resolving all assigned service calls in an efficient and professional manner; and other tasks as assigned. The successful candidate must be a proven self-starter, with a strong technical background, with 3 years’ experience servicing intrusion, fire alarm, Access Control, and CCTV security systems. NICET Level 2 certification is desired. IP video and IT experience required. Software House, Genetec certifications preferred. Military training and experience is a plus. Benefits Include:Competitive SalaryMedical, Dental, Vision and Disability PlansLife InsuranceFlexible Spending AccountsMedical Reimbursement Accounts with pre-paid debit cardsEmployee Assistance Program (EAP)Savings and Retirement401(k) / Retirement Plan & 529(c) for college savingPaid Vacation & Paid Holidays In addition to all of the above benefits our employees enjoy Company Sponsored TrainingEmployee Referral ProgramTuition ReimbursementProfessional Development OpportunitiesEmployee Organized Events and CompetitionsCommuter BenefitsAbout RFI RFI Communications & Security Systems is a diversified multi-systems integrator that has been designing, installing, servicing and monitoring, technology-driven security and fire/life safety solutions for over thirty five years. Committed to our past and our future – RFI, established in 1979, is a large systems integrator doing business across the US with offices in California, Nevada, and Washington. RFI specializes in the design, installation, maintenance and service of commercial and industrial state-of-the-art integrated Security / Life Safety Management Systems. These systems include Electronic Access Control, Closed-Circuit Television, Intrusion Detection, Alarm and Fire/Life Safety systems."}