{"jobID": "2750317608", "jobLocation": "Palo_Alto_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.humanyze.com", "Headquarters": "Boston, MA", "Size": "1 to 50 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Humanyze helps companies make more informed people decisions. Born out of the MIT Media Lab, Humanyze uncovers the hidden patterns of digital and face-to-face communication to quantify the people factor in the workplace. Humanyze is committed to helping teams work better together and has the data and science to prove it. Humanyze’s world-leading People Analytics Platform delivers advanced insights and is used by top Fortune 500 companies to answer specific business questions around diversity and inclusion, collaboration and delivery, space planning, workload, teamwork and engagement, and regulatory and compliance risk.  We’re looking for an entry-level Data Analyst to join our Analytics Team. You'll be part of a fast-growing team to uncover data-driven people insights for our customers. You will have the opportunity to work with rich datasets collected from our Humanyze Badge and Digital Platforms. The ideal candidate will have strong analytical and storytelling skills as well as experience working across a variety of people areas.  This is a full-time role based in Palo Alto, CA. ResponsibilitiesCommunicate with customers to identify questions and hypothesesInterface with the Humanyze platform and API to set up datasets and query dataPartner with customers and internal product teams to deliver key findings and reportsPrepare and build clear reports and visualsAnalyze multi-source communication and social network data to generate actionable insights. Examples include:Recognizing interaction patterns across teams and levels of an organizationIdentifying key network characteristics in high-performing teamsA/B testing for pre- vs post- intervention dataJob Requirements:BS degree in a field that emphasizes analyzing, displaying, or reporting on quantitative data (e.g. computer science, engineering, economics, statistics, psychology, or other quantitative social science), or equivalent work experienceProficiency using Python, or similar programming language to analyze large datasets, specifically with data querying, validating, and auditing data and reports from multiple systemsExperience using data visualization principles, and manipulating and analyzing large data sets in ExcelAbility to conduct statistical analysis (e.g. t-tests, ANOVA, regression)Organized and detail orientedStrong team-player: You work well in a multi-disciplinary teamStrong communicator, written and verbal: You effectively synthesize, visualize, and communicate insights to othersAbility to thrive in a fast-paced startup environmentDesired Skills:Background or experience in organizational behavior, management consulting, or similarExperience engaging with enterprise-level customers and stakeholdersWe Offer:Competitive salary and bonusFlexible work environmentFully paid medical dental and long-term disability insuranceSIMPLE IRA matching3 Weeks of vacation, a holiday week, and 11 other company holidays"}