{"jobID": "2768593863", "jobLocation": "San_Francisco_CA", "jobTitle": "Financial Professional", "companyRating": null, "companyInfo": {"Website": "www.axa-equitable.com/axa/careers/axa-advisors.html", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1859", "Type": " Subsidiary or Business Segment", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "AXA Advisors is a leader in helping individuals and businesses address their financial goals through financial strategies, investment services and risk management. We have more than 40 branches across the country employing approximately 5,000 financial professionals. AXA Advisors is an equal opportunity employer committed to a workplace that is diverse, inclusive and merit-based.We're looking for highly motivated, achievement-driven individuals who want the opportunity to establish and grow a financial services practice with the support and strength of one of the nation's leading financial services firms.As an AXA Advisors financial professional, you'll be part of a recognized, respected company that offers:High earnings potential and comprehensive benefitsTraining, support and hands-on managementAdvancement/management opportunitiesOur work environment is fast-paced, energetic and enthusiastic. If you have an entrepreneurial mindset and are not looking for just a job, then this is the place for you.Job DescriptionAnalyze financial information obtained from clients to determine strategies, products and services to help clients meet their financial objectives.Provide information/education to clients about the purpose and details of financial products, services and strategies.Build and maintain client base, keep client plans up-to-date and acquire new clients on an ongoing basis.Contact clients periodically to determine if there have been changes in their financial status.Provide knowledgeable, objective financial guidance and customized strategies to consumer segments that demand high quality serviceYou don't need to have a finance or economics degree to be a successful financial professional. At AXA Advisors, training is a process not an event, whereby our financial professionals, at every level of experience, build their business. You will participate in national and local development programs and joint work opportunities that provide comprehensive knowledge and skill training. We encourage and support the pursuit of professional designations that are recognized and respected by clients and others in the industry, including CFP®, Chartered Financial Consultant and Chartered Life Underwriter.QualificationsResults-driven, highly motivated, self-starter who possesses integrity, a strong work ethic and the desire to help others plan for and protect their financial futures.Team player who possesses excellent interpersonal skills and communication abilities, with a high degree of self-confidence.Ability to draw upon past/present experiences and acquaintances to develop markets and build upon them to sustain long-term relationships.Must be authorized to work in the United StatesA four-year college degree is preferred and relevant professional FINRA securities registrations are a plus. If you do not have the following, you will be required to attain them, under the sponsorship(1) of AXA Advisors: state life and health licenses, FINRA Series 7 and 66 registrations.MBA, JD, CFP®, CPA or ChFC, a plus.Individuals who excel at AXA Advisors come from many different professional backgrounds including:LawBrokerageBankingManagementAccountingSalesWhat We OfferAs an AXA Advisors' Financial Advisor, you can look forward to a paid training program, career advancement opportunities within the company, and the potential for a high income. The extensive compensation package available to eligible Financial Services Representative includes:Base pay & commission or commission & bonus.Health, dental, life and disability insurance.401(k) plus employer match.About AXAAXA Advisors, LLC is a leading provider of financial services for consumers and businesses, working with clients to help them define and pursue their financial goals. It is a broker/dealer and the retail distribution channel for AXA Equitable Life Insurance Company (NY, NY), which provides life insurance and annuities for the financial services market.In business since 1859, AXA Equitable Life Insurance Company (formerly The Equitable Life Assurance Society of the United States) is a leading financial protection company and nationwide issuer of life insurance and annuity products.Career Opportunities are with AXA Advisors, LLC (NY, NY 212-314-4600), member FINRA/SIPC, and Equal Opportunity Employer. M/F/D/VGE- 130475 (1/18) (Exp 1/20)(1) During sponsorship, the candidate is responsible for paying the resident and non-resident licensing, appointments and registration fees. These fees are reimbursable once the candidate has been on active contract for three months."}