{"jobID": "2822984308", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Clinical Data Analyst I", "companyRating": "2.6", "companyInfo": {"Website": "www.apexlifesciences.com", "Headquarters": "Glen Allen, VA", "Size": "5001 to 10000 employees", "Founded": " 1985", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "60000", "jobDescription": "Duties: We are seeking a highly motivated, enthusiastic and independent Scientific Researcher to join the Modeling and Simulation (M&S;) Group within the Clinical Pharmacology Department in the Department of Development Sciences at Genentech.  The candidate will provide technical support for the Modeling and Simulation activities to assess the clinical pharmacokinetic and pharmacodynamics (PKPD) of drug candidates and marketed products, in order to ensure that the right drug is administered to the right patient at the right dose and regimen.  The successful candidate will be expected to effectively collaborate with colleagues in Clinical Pharmacology and work independently or under the direct supervision of a manager. Daily responsibilities include contribution to the planning of datasets, conduct of graphical data analyses including C-QT and Exposure-Response, QC of documents and programming, regulatory submission and simple M&S; analyses if applicable. The individual is expected to acquire the basic Clinical Pharmacology and M&S; knowledge to perform such tasks. He/she may support internal/external presentation and reporting of data section and other sections of M&S; analysis plans and results as applicable. He/she may assist the development of standardization of M&S; analyses. He/she may also contribute to departmental initiatives such as literature database, real world data, system infrastructure, software/tool and other efforts. Skills: Candidate must have solid hands-on expertise in R or S-Plus programming. Experience in data pooling and graphical representation of clinical trial data is highly desired. Experience with M&S; dataset, methodologies, and software (such as NONMEM) as well as Phoenix WinNonlin is preferred, but not required. Strong analytical, organization, and communication skills, attention to detail, as well as working effectively in a multidisciplinary team setting are essential. Candidate must be open-minded and ready to learn new concepts and tools. Education: M.S. or B.S. or equivalent experience in Statistics, Mathematics, Pharmacometrics, Engineering, Computer Science, other life science or related field with 0+ year for M.S. or 2+ yrs for B.S. of relevant experience, preferable in the Biotechnology or Pharmaceutical Industry. #LI-NV1EEO Employer  Apex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at [Click Here to Email Your Resumé] or 844-463-6178."}