{"jobID": "1871959011", "jobLocation": "New_York_NY", "jobTitle": "Quantitative Finance Research Consultant", "companyRating": "4.0", "companyInfo": {"Website": "www.worldquant.com", "Headquarters": "Old Greenwich, CT", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "135000", "jobDescription": "WorldQuant is a quantitative asset management firm founded in 2007 and currently has over 450 employees globally. We develop and deploy systematic financial strategies across a variety of asset classes in global markets, utilizing a proprietary research platform and risk management process. We are seeking engineering, science, mathematics and finance majors for part-time research consultant positions, involving the creation of computer-based models that seek to predict the movements of worldwide financial markets. Candidates need not have prior knowledge of financial markets, but must have a strong interest in learning about stock markets and financial markets. Upon joining us, we will provide a series of quantitative finance training and seminars to offer you a chance to learn the fundamentals of quantitative finance and theoretical stock price movement prediction.We offer outstanding learning and earning opportunities, which include:Performance based compensation, for successfully contracted consultantsTraining classes / seminars about quantitative finance research and modelingAccess to our web-based simulation system that you can use to develop quantitative financial modelsAn opportunity for students in engineering and science to break into the financial industryQualifications:Hold or working toward a Bachelor’s degree or advanced degrees from a leading university in engineering, science, mathematics, finance or any other related field that is highly analytical and quantitativeStrong interest in learning about worldwide financial marketsLocations:Flexible and online. As a Quantitative Research Consultant, you can use our proprietary web-based simulation platform to experiment with quantitative investment research at any time from any approved location with an internet connection."}