{"jobID": "2518400456", "jobLocation": "Seattle_WA", "jobTitle": "Data Scientist", "companyRating": "4.2", "companyInfo": {"Website": "www.logic2020.com", "Headquarters": "Seattle, WA", "Size": "201 to 500 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "101000", "jobDescription": "Data ScientistSeattle, WAAbout the Role. . . This role requires an in-depth understanding of statistics, as well as basic programming and data management skills. Success will require strong statistical problem-solving skills and the ability to leverage cutting-edge big data technologies. You like to . . .Create frameworks to predict a variety of outcomes in different scenariosCreate models of customer satisfaction that provide detailed insight into what causes a customer to take different actionsCollaborate with other data scientists and stakeholders on projectsYou’re Good AtResearching and designing statistical models to answer target questions, optimizing processes and outcomes, and informed decision-makingDeveloping solutions in R orPythonDeveloping production grade solution is a huge plusWorking in Hadoop, Redshift, or SparkTranslating business and product questions into analytics projectsCommunicating clearly over written and oral channels while translating complex methodologies and analytical results into high-level insightsQualifications. . .Good Knowledge of SQL (3+ years) creating advanced queries in a high impact role.Must have experience with Web Analytics.Knowledge of Statistics and Machine Learning techniques.3+ years building statistical models/evaluating/Feature selection in a high impact role.Knowledge of the latest NLP techniquesMasters in Stats, computer science or related fieldKnowledge of R or Python (3+ years)Knowledge of C# (at least 1 year)Experience building data pipelinesA portfolio of NLP projects to showcase and discussExperience in marketing analytics, attribution modeling, or click-stream data analysisMS / PhD in Machine Learning, Statistics, Computer Science, Data Mining, Math or any quantitative discipline About Logic20/20. . . Logic20/20 is one of Seattle’s fastest growing full-service consulting firms. Our core competency is creating simplicity and efficiency in complex solutions. Although we make it look like magic, we succeed by combining methodical and structured approaches with our substantial experience to design elegant solutions for even the most intricate challenges. Our rapid growth is in response to our ability to deliver consistently for our clients, which is directly related to the quality of the people we hire.  The past two years, we’ve been in the top 10 “Best Companies to Work For” ….. why? Our team members are highly self-motivated, comfortable conceiving strategies on the fly, and enjoy working both individually and as part of a team. Our environment is very high-energy and demanding, and individuals with remarkable enthusiasm and a can-do attitude are joining our team. We have lots of fun, focus on our employees and our clients, and work to bring our best to every opportunity."}