{"jobID": "2781244466", "jobLocation": "Seattle_WA", "jobTitle": "Service Desk Analyst Intern", "companyRating": "4.2", "companyInfo": {"Website": "www.watchguard.com", "Headquarters": "Seattle, WA", "Size": "201 to 500 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " SonicWall, Palo Alto Networks, Juniper Networks"}, "estimatedSalary": "15", "jobDescription": "Service Desk InternWhy Work for WatchGuard? At WatchGuard we create smart security, simply done. We’re a leader in building cyber security hardware, wireless, and cloud solutions that protect small and midsize businesses, and distributed enterprises worldwide. Our award-winning network security solutions provide layered, enterprise-grade protection that is easy to deploy and manage. Whether you are an industry veteran, or at the beginning of your career, now is an amazing time to work in the security industry, and there’s never been a better time to be at WatchGuard.  We love solving the industry’s toughest challenges, and our innovation keeps our customers ahead of increasingly sophisticated hackers, which has fueled record revenues. We’re heavily reinvesting in the company, and driving rapid acceleration across all aspects of our business. As a result, our employee base has nearly doubled in the last three years, organically and through acquisition.  Our company culture places intense focus on our customers and employees. From the newest employee to our CEO, you'll find that each person at WatchGuard embodies our core values: accountability, passion for success, community building, and maintaining a customer focus in all things.  WatchGuard Technologies is privately backed by equity firms Vector Capital and Francisco Partners, and has headquarters in Seattle, Washington, with offices throughout North America, Europe, Asia Pacific, and Latin America. Job Overview Are you ready for a chance to build your career in IT and gain valuable experience by providing awesome customer support to our global employee base? The Service Desk Intern will assist in triaging all level one support requests, resolve issues at the tier one level, and escalate issues out to the appropriate team. You will be responsible for providing application/hardware support to end users with Windows 8.1/10, Mac OS X, Android, and iOS devices.  You’ll be responsible for installing Windows and Mac OS X applications, and providing hands-on support as well as phone/remote assistance. This person must also have the initiative and ability to take a task and run with it as well as tackle other projects between tasks. Most of all, we are looking for an ambitious individual with a strong desire to learn new things and keep our customers happy. What You’ll Be DoingImage PC and Mac laptops/desktopsMaintain asset and inventory system; Check in/Check out itemsOrganize and maintain asset storage roomAssist with employee onboarding and separation processes; Setup and tear down of equipment and shipping/receiving of assetsTriage and respond to helpdesk tickets and provide solutions for reported customer problemsProvide customer-focused desktop support for all staff using strong interpersonal skillsIdentify, troubleshoot, and resolve hardware and software problems; escalate if requiredPhone and inbound ticket queue support for global employee IT requestsWhat You Need to Bring to the TablePursuing or graduated with a degree in Information Systems, Informatics, or similar area of studyStrong customer service and communication skillsStrong organizational skillsMaster of following up with end users and communicating liberally until issue resolutionThe ability to prioritize support requests while keeping response times in mind is immensely importantExcellent process documentation skills Desktop support/troubleshooting experience in a Windows-centric environment a plusWindows 8.1+ (about 80%)Mac OS X (about 20%)Knowledge of antivirus products (System Center Endpoint Protection, Windows Defender)Experience with Dell, Lenovo, and Apple hardware (desktops & laptops) a plusAbility to handle & prioritize large volumes of requests while maintaining a positive attitude and mindsetAs an Equal Opportunity Employer, we are committed to a diverse workforceWatchGuard Technologies, Inc. participates in E-Verify"}