{"jobID": "2830428551", "jobLocation": "San_Jose_CA", "jobTitle": "Sr. R&D; Manager", "companyRating": "2.8", "companyInfo": {"Website": "www.labcyte.com", "Headquarters": "San Jose, CA", "Size": "201 to 500 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " TECAN U.S., Hamilton, EDC Biosystems"}, "estimatedSalary": "169000", "jobDescription": " JOB #296Sr. R&D; Manager – Mechanical Engineering  Location: San Jose, CALabcyte Inc. seeks a highly motivated candidate to join its R&D; team. This position will be responsible for managing Labcyte’s mechanical engineering technology and contributing to the design of laboratory capital equipment and consumables. Qualified candidates must be able to work independently and as a member of multi-disciplined development teams, executing tasks on-time and to spec. Design tasks may include system mechanisms and motion systems, equipment packaging, pneumatics, fluidics systems, and laboratory consumables. Management responsibilities will include direct supervision of mechanical engineers, mechanical technology selection, and ME department infrastructure and processes.Education, Skills, Experience, and Requirements BS/MSME15+ years of experience, including:Technical and administrative management of mechanical engineering teamEngineering leadership and mentoring of ME staffTechnical leadership of mechanical engineering function on interdisciplinary (ME, EE, S/W, chemistry, biology) and cross-functional projectsManagement of Industrial Design and ME consultantsDesign, development, and NPI of low to medium production volume capital equipment (10’s to 1000’s /year)Skills and Attributes Required Outstanding management and organizational skillsAbility to define and implement mechanical engineering infrastructure and processesExcellent understanding of system-level trade-offs between engineering disciplines (ME, EE, SW, etc.)Demonstrated ability to architect instrument systems, develop creative and cost-effective designs, and define and execute thorough test programsSuperior understanding of PLM systems and product configuration managementDesign for Manufacturability & Serviceability acumenKnowledge of design principles required for metal castings and/or molded plastic partsCreative design of mechanisms, and motion, fluidics, and pneumatics systemsTrack record of leading innovation in mechanical engineering disciplineSuperior understanding of standard and geometric tolerancingHighly proficient with SolidWorks and PDM/WorksDemonstrated ability in managing small projects, delivering products on-time and to-specOther Helpful Skills, Attributes and Experience Manufacturing process developmentDevelopment of consumable productsDesign of instrument packagingDesign of liquid handling equipmentManagement of interdisciplinary (ME, EE, S/W, chemistry, biology) and cross-functional projectsLOCATION: San Jose, CA  Candidates only, no recruiters or agencies.About LabcyteLabcyte, a global biotechnology tools company headquartered in San Jose, California, is revolutionizing liquid handling. Echo liquid handling systems use sound to precisely transfer liquids. Labcyte instruments are used worldwide by all twenty of the top twenty pharmaceutical companies, as well as by small to mid-size pharmaceutical companies, biotechnology firms, contract research organizations and academic institutions. Labcyte’s customers work across a wide spectrum of biology including drug discovery, genomics, proteomics, diagnostics, imaging mass spectrometry."}