{"jobID": "2829399575", "jobLocation": "Burbank_CA", "jobTitle": "Data Analyst - Sr", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Data Analyst - Sr  Location: Burbank, CA  Duration: 12 months (contract to hire possible)  Provide data architectural leadership in developing enterprise data/process models, and logical/physical database designs. Provide data and database development, maintenance, and production support. Participate in IT and Business project to define system requirements.  Experience Level: 6-10 Years. Skill Set: Business analysis. Business process modeling - enterprise to department level. Ability to interpret Entity Relationship Diagrams. Develops accurate, easy to read, and useful information reports.Collects data, researches, and prepares advanced trend and data analysis reports.Designs and generates tracking and monitoring tools.Performs ad-hoc projectsUnder general supervision, this position exists to assist the organization in making strategic data-related decisions by analyzing, manipulating, tracking, internally managing, and reporting data.Communicates and supports analytical findings.May assist with sophisticated statistical models and forecasting tools using these databases.Assists with the definition of complex multi-dimensional healthcare issues and develops time tables/processes for decision making.May translate needs, issues, and ideas into effective strategies and action plans.May formulate specific implementation plans and evaluates the effectiveness of actions/programs implemented.Develops creative alternative solutions. MUST-HAVE Qualifications Bachelors degreeStrong Microsoft Office skills required.(Excel, Access both required)Three (3) years of experience in SQL or equivalent statistical analytical programming language required. Oracle and SQL Server exp required. PL SQL requiredMinimum two (2) or more years of related analytical experience required.Strong analytic and critical thinking skills, writing skills, communication skills, consulting skills, and ability to work within a team. Good-to-Have skills Alteryx is preferred.Tableau is a plus."}