{"jobID": "2578234400", "jobLocation": "San_Francisco_CA", "jobTitle": "MBA Intern, Product Management", "companyRating": "2.9", "companyInfo": {"Website": "www.skycatch.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "78000", "jobDescription": "Skycatch is looking for an MBA Intern to help the product management team to deliver the best drone data platform to optimize businesses. We build an entire platform spanning: cameras, drones, firmware, cloud software, mobile apps, edge computing, computer vision, and AI, so your opportunities for learning are limitless.  You will support the growth and success of the company by solving our customer's most critical problems and delivering simple software and hardware solutions, quickly and frequently. We are building an entirely new industry with drones, computer vision, and AI, so you need to love exploring the unknown and cutting a new trail. Sound like the time of your life? Come join us at Skycatch! What you'll do:Learn about the industry and conduct research on new market opportunitiesOwn the roadmap, requirements, designs, test plans, and release plan for new features and ongoing improvements for web, cloud and mobile products.Use scrum techniques to get things done faster and better.Interface with customers, sales, and customer success for continuous learning and feedbackQualifications:Strong technical background; B.S in engineering or computer science with 2-3 years of work experience.Must be pursuing a full-time MBA degree from a top school.Must be graduating in spring 2019.Have the authorization to work in the United States.Preferred Qualifications:Excellent communication skills.Deep appreciation for brilliant user-centered design.Motivated by startups; ability to work in a fast-paced, iterative, innovative environment, managing multiple simultaneous efforts.Excellent project management, interpersonal and organizational skills, with the ability to drive and implement ideas in a changing environment.Cover letters are preferred but not required.More about Skycatch: Skycatch creates industrial strength products, services, and solutions that power some of the most complex projects on the planet. We capture the world's data and create visual intelligence to help people operate faster, safer, and smarter than ever before. Skycatch is the industry leader for commercial UAV applications and data-imaging, building revolutionary products and providing unparalleled service.  Skycatch (www.skycatch.com) is a platform for capturing data using small autonomous aerial robots. Our product is built for enterprise with safety, strength, and reliability in mind. It can cover large geographic areas, be equipped with different sensors depending on the customer’s needs, and operate in challenging weather conditions. Our proprietary battery-swapping and autonomous landing technology gives our aerial robots the ability to scale and operate without human involvement. Apply for this Job"}