{"jobID": "2791550305", "jobLocation": "Mountain_View_CA", "jobTitle": "Global Sales Manager", "companyRating": null, "companyInfo": {"Website": "www.bridgestreet.com", "Headquarters": "Reston, VA", "Size": "501 to 1000 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " With more than 120,000 accommodations in over 91 countries, BridgeStreet Global Hospitality is the leading hospitality solution. Powered by OTA technology, BridgeStreet.com is built for business travellers and gives serviced apartment and home operator’s access to extensive global reach bookable in real-time along with built-in demand from BridgeStreet’s 5000+ client portfolio and 100+ global sales team. Widely recognized for uncompromising standards of quality, comfort and service, BridgeStreet Global Hospitality is a renowned award winner in both the Americas and EMEA (Europe, the Middle East and Africa). Experience Requirements: A minimum of 5 years of exceptional sales/marketing experience and/or sales management success of a product or service. Corporate housing, hotel, or other service related industry experience preferred and a solutions based approach selling is required. Previous experience selling to the C-Suite in fortune 500/1000 companies is a must. Position Overview: The Global Sales Manager position will oversee all business development activities within the various named global accounts. They will head business development and will be responsible for creating and implementing a strategy aligned with current global sales initiatives based on current and future growth plans as well as identify key contacts within targeted named accounts, solicit new business, identify and facilitate the RFP process and secure new business. This is a senior sales position and will manage and perform to their highest level by using the techniques and guidelines set forth in the BridgeStreet global sales process. They are also responsible for identifying prospective clients, developing these prospects into actual clients and then deepening these client relations at the highest levels. Working under direct supervision from the Regional Director, Sales and in conjunction with local and regional sales and operations teams, they will act as a sales leader to provide revenue growth for the company. Responsibilities:1. Achieve target percentage of new revenue growth year over year within the global business segment.2.Generating BusinessCore Markets and Global LocationsIdentify key decision makers for extended-stay travelGenerate leads through cold calling on the telephone, person-to-person meetings and networking with prospective and actual clientsWork with prospective and current clients selling vertically within each industry and business segment to identify additional business opportunities within their companiesNetwork and participate in local professional organizations within key industries specific to the assigned region and verticals. Familiarity with organizations such as ERC and SHRM is a plus.In-person follow up on leads received through general referrals, cross-selling, advertisements and inquiriesTour prospective key decision makers through apartment communities as necessaryCoordinate and assist in general sales activities, including trade shows, advertising, public relations and others as directedGenerate cross-sold business outside the local market to support the BridgeStreet system and function as a total resourceAttend a minimum of required appointments and generate a minimum number of prospecting phone calls as required by sales leadershipProvide details on their weekly activities using CRMAbility to develop and leverage internal resources and relationships to close business.3. ReportingDevelop monthly and quarterly account plans and action steps for Top 25 accountsReview monthly sales goals, revenue numbers and work with VP of Global Sales to achieve their established targetEnsure sales system/ CRM (“Landslide”) is updated in a real-time fashion with client information4. Additional responsibilities and expectationsWork within their budgetResponsible for all client meeting initiativesLead all global sales initiatives for their named accountsDevelop annual sales plans and reviewsParticipate in apartment pricing issues and decisionsDevelop and implement plans to achieve those goalsDevelop and implement a strategy to develop sales for US and offshore sitesDevelop strong personal relationships with global customersEstablish and maintain routine weekly contact with target customersEstablish new contacts and new opportunities with a list of global prospectsContact Global target customers, make initial contact and secure RFP’sCompile, distribute and implement best selling practices based on vertical opportunitiesPrepare business presentations as needed and tailored to target companiesCollaborate Regional Director, Sales to design and present custom presentations and reportsCommunicate trends on intelligence and formulate marketing strategies based on that analysisWork to establish strategic business development plans, location needs, and sales strategies.Specific Job Knowledge, Skills and Ability Requirements:Experience:Successful new business development history (“hunter”) across multiple market segments, preferably in the hospitality, finance, insurance, relocation, consulting, energy or telecommunications.The ability to call on upper management level clients through phone and in-person sales presentationsThe ability meeting sales goals and action plans and success achieving those goals.The ability to manage major accounts and global business.The ability to sell contracted services and global business.The ability to demonstrate a customer focused approach to problem solving and resolution skills.Solution based sales approach to a longer sales cycle.Current knowledge of travel and or relocation industry, current market trends and economic factorsExtensive skill in development and delivery of sales presentations (Power Point)Ability to access, understand and accurately input information using Microsoft WORD, Outlook, Access. PowerPoint, CRM (Landslide) and tasks manager systemsThe ability to read, listen and communicate effectively in English, both verbally and writtenThe ability to use Sales Automation Software for tracking sales and account activityProven success in a customer focused sales environmentStrong innovation and experimentation skills.Selling vertical marketsConfidence, enthusiasm and a strong dedication to the job and companyEducation:Bachelors of Science or Bachelors of Arts is highly preferred.Formal negotiation or presentation training is idealTravel (approx.): Local and Regional travel required as needed 50% Number of Employees supervised (approx): 0Personal Development:The Company, through Passport to Your Success will assist in achieving the skill set required (via training and mentoring), thus enabling you to reach your full potential in line with your career aspirations.Personal Attributes:Commits to embracing and embedding all of the BridgeStreet Teammate characteristics: Relentless in creating a lasting impression; Resourceful with your positive attitude; Reliable with your commitment and actions and passionate about selling in an enthusiastic way--- to name a fewUnderstands the impact of delivering the BridgeStreet Corporate Drivers: Service Excellence; Relationships; Leadership; and GrowthActs as a role model within the Marketing Team, and to the BridgeStreet Team as a wholeCommitted to upholding professional standards and being a good teammate.Takes responsibility for own actionsResults-focused - understands what is important to the organization, other BridgeStreet Teammates and clients - is committed to achieving goals. Tenacious approach to delivery, quality of output and organizationSelf-motivated and self-aware - recognizes own strengths and weaknesses and is committed to personal developmentHas a sense of fun.This is by no means an exhaustive list of responsibilities. The role may evolve and more responsibilities would be added to the current job description or delegated as and when necessary."}