{"jobID": "2767474512", "jobLocation": "San_Jose_CA", "jobTitle": "IT Intern", "companyRating": "3.4", "companyInfo": {"Website": "www.power.com", "Headquarters": "San Jose, CA", "Size": "501 to 1000 employees", "Founded": " 1988", "Type": " Company - Public (POWI) ", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " STMicroelectronics, Fairchild Semiconductor, Infineon Technologies"}, "estimatedSalary": "71000", "jobDescription": "IT Summer Intern – HelpDesk / Desktop Support Power Integrations is a leading supplier of high-voltage analog integrated circuits providing cost-effective, energy-efficient AC to DC and DC to DC power conversion solutions. Our patented EcoSmart® technology enables manufacturers to meet all current and proposed energy standards worldwide, and continues to save consumers hundreds of millions of dollars each year on their electricity bills.  We believe that our success is built around our people. We are looking for a talented individual who enjoys working on challenging projects in a team-oriented environment. Power Integrations offers competitive compensation and excellent benefits. We are an Equal Employment Opportunity employer committed to providing a culturally diverse workplace.  We are seeking an individual interested in pursuing a career in Information Systems or Computer Science. The individual’s job is to help with daily and administrative tasks. The associate’s basic tasks will be: taking calls, assist with simple troubleshooting over the phone (screen), and working the ticketing system (Service Desk). The associate will also learn the basics of Desktop Support.  Skills desired: Excellent Customer Service and People Skills.Capable of working and learning in a fast paced, team focused, environment.Flexible hours but prefer M-F 9:00 – 5:00Individual Thinker, ability to take direction but still make decisions on their own.Good communications skills a must.Microsoft Office proficient (Word, Excel, Outlook). Experience with: Microsoft Windows 7, including network and printer configuration.Computer systems imaging or installation a plus.Managing and troubleshooting desktop systems, replacing hard drives, memory etc.Hand on Android and iPhones support, particularly network configuration and app installation."}