{"jobID": "2708950439", "jobLocation": "New_York_NY", "jobTitle": ".Net Developer w/ Mobile/Xamarin", "companyRating": null, "companyInfo": {"Website": "www.axelon.com", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Strong .NET development with Mobile development experience using Xamarin Forms. MINIMUM of 1 year with Xamarin. -A minimum of 5 years demonstrated work experience in full-stack mobile application development is required along with an in-depth understanding of cloud technologies (Azure) and relational databases.-Candidate must have in-depth experience in business analysis, mobile standards, mobile security, mobile application development, and design.-Exposure to both Native (iOS) and Hybrid mobile applications is preferred.-The candidate must be able to multitask: handling multiple assignments with changing priorities while meeting project deadlines and work independently.-The candidate must be able to work independently with minimal direction and possess excellent communication skills.  The position requires the candidate to achieve a high level understanding of the application portfolio, the computing infrastructures, and other IT organizations required to support the application portfolio. The following specific technical skills and experience are required for this position:  -At least one year of experience in iOS mobile development using .NET and Xamarin Forms  -At least seven years of experience in Software Development using .NET technologies including C#, WebAPI, LINQ, Visual Studio 2013 or later, Team Foundation Server and SQL Server  -Developing and deploying web and mobile applications in Microsoft Azure cloud platform.  -Strong understanding in a wide array of mobility knowledge areas including UX standards, native and hybrid application development, app deployment, REST APIs, MVVM, cloud technologies and industry standards  -Good sense of mobile driven user experience (UX)  Note that the candidate must be able to demonstrate prior work done in mobile development (mobile or hybrid apps). Recommended to provide links to mobile apps in the resume.The candidate will have the responsibility to develop new mobile applications, enhance existing systems, and support the application portfolio used primarily by client. The current portfolio includes both internally developed Intranet -based applications and vendor mobility platforms. Some of the key responsibilities include:  -Establish necessary development and deployment ecosystem  -Understand and document user requirements  -Design and Develop mockups using wireframes. May be required to work with other UX individuals or groups.  -Design and develop backend API using .NET, where necessary  -Model and design back-end database, where necessary.  -Work with other teams and IT Support groups to establish necessary infrastructure and ensure the solutions meet expected standards."}