{"jobID": "2645519811", "jobLocation": "Boston_MA", "jobTitle": "Dietetics Food Management", "companyRating": null, "companyInfo": {"Website": "www.navy.com", "Headquarters": "San Diego, CA", "Size": "1001 to 5000 employees", "Founded": " 1775", "Type": " Government", "Industry": " Government", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " \"About This JobNavy Dietitians serve in a variety of capacities. They may encourage healthy living among ship crews by teaching them how to maintain a well-balanced diet and regular exercise regimen. Or teach in a class setting, whether for health promotion or disease management. In everything they do, they bring skills and knowledge in:Nutrition assessmentMedical record documentationMedical nutrition therapyAs a Navy Dietitian, youll deliver general nutrition education and wellness programs for servicemembers and their families, wherever theyre stationed. And get the opportunity to participate in field and shipboard patient care and food service operations at home and abroad. Youll also provide: Inpatient and outpatient medical nutrition therapy Nutrition counseling and education Food service managementMost of what you do in the Navy Reserve is considered training. The basic Navy Reserve commitment involves training a minimum of one weekend a month (referred to as drilling) and two weeks a year (referred to as Annual Training) or the equivalent of that.Dieticians in the Navy Reserve serve in an Officer role. Before receiving the ongoing professional training that comes with this job, initial training requirements must first be met.For current or former Navy Officers (NAVET): Prior experience satisfies the initial leadership training requirement so you will not need to go through Officer Training again.For current or former Officers of military branches other than the Navy (OSVET), as well as for Officer candidates without prior military experience: You will need to meet the initial leadership training requirement by attending the twelve-day Direct Commission Officer (DCO) School in Newport, RI. This will count as your first Annual Training.With flexible training options, Medical Service Corps Officers in the Navy Reserve can comfortably balance civilian and military schedules. You can maintain your own life and your own career enriching both with the rewarding work you do for others.The Medical Service Corps in the Navy Reserve offers you a truly diverse variety of operational venues. In some cases, you can even work in the same civilian location you work in now. Whats more, you will enjoy an unrivaled sense of pride and fulfillment known only to those who serve.\""}