{"jobID": "2553208293", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist, AL/ML Start-up in SF", "companyRating": null, "companyInfo": {"Website": "www.motektech.com", "Headquarters": "San Jose, CA", "Size": "1 to 50 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Sr. Data Scientist  As a Senior Data Scientist, you will take the lead on a product deliverable, from inception and prototyping through deployment with clients. You’ll need to be able to develop good intuitions about what analysis will be meaningful to clients, be able to understand the wide variety of algorithmic components you have to work with and how they can be put to best use, and know how to write robust code. You’ll be constantly learning, constantly teaching, and always be ready to engage in the careful details as well the big picture of what the data is revealing about the world.  What We Offer  Collaborative environment with abundant cross-team interactions and learning.  Opportunity to tackle previously unsolved problems in Natural Language Processing, Natural Language Generation, and other fields  Exposure to very interesting data (e.g. news, scientific publications, financial documents, communications and other long form content)  Products motivated directly by current clients with analysts in high-impact roles.  The satisfaction of taking products and new features through from their initial genesis to incorporation in a deployed product.  Rapidly growing company, with opportunities for growth into either further technical leadership or team management positions.  Fun, puzzle-loving office in the SF Financial District  What You Have  Strong programming skills, including in Python, with at least 3 years experience in a production engineering team.  Masters/Ph.D. in a quantitative field or at least 5 years building analytical/data driven products in an industry setting.  Skills in data exploration, visualization, and cleaning.  Experience applying machine learning algorithms to real data sets, preferably including text analysis and NLP.  Experience in using one or more of the following: NumPy, SciPy, Matplotlib, Scikit-Learn, NLTK, SpaCy, TensorFlow, Keras.  Experience taking ambiguous problem statements through to delivered products.  Experience interacting with end users/clients or strong interest in doing so.  Curiosity and enthusiasm, and a love for teaching and learning.  Bonus Points  Experience with information retrieval and search technologies (especially Elasticsearch).  Please send a copy of your resume to jerald.baker@motektech.com"}