{"jobID": "2824114081", "jobLocation": "Santa_Clara_CA", "jobTitle": "Senior Systems Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.svb.com", "Headquarters": "Santa Clara, CA", "Size": "1001 to 5000 employees", "Founded": " 1983", "Type": " Company - Public (SIVB) ", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Square 1 Bank, First Republic Bank, Comerica"}, "estimatedSalary": "124000", "jobDescription": "Description Job Title: Senior Systems Analyst Requisition Number: 5180 Country: United States City: Santa Clara State / Province: California Full Time/Part Time/Intern: Full-Time Education Required: Bachelor's Degree Job Description: Support the delivery of Banking Systems projects and initiatives used by SVB's commercial clients (e.g., Commercial Banking Payment systems, Card and Global Merchant Services). Serve as liaison with business owners (Product/Project Managers, BSA/AML, Compliance, Client Service, Core Banking, Cards, Private Equity, Sales, Private Banking and Marketing) to facilitate the elicitation and prioritization of business initiatives and business requirements. Analyze business requirements associated with change requests, projects, assessments and escalated issues (incl. functional and technical specifications) to develop systems design and comprehensive test strategy. Prepare Functional, System and Data Integration Specification documents. Co-ordinate with SVB IT teams to define scope and associated estimates as input to Business Cases for funding. Support project management teams for status & progress reports for delivery of projects. Accountable as System Owner for relevant applications and tools in the portfolio. Coordinate systems development with Data Warehouse, Enterprise Integration and Architecture teams, to ensure systems analysis, development, deployment, integration and upgrade efforts are synchronized and coordinated as efficiently as possible. Partner with QA for Platform, Security, Integration and System testing. Analyze the data structures and perform data validation in the Enterprise Data Warehouse. Coordinate Test data and Test environment setup, using VMware. Perform Root Cause Analysis for Production issues and develop mitigation plans. Validate functional defects, identify impacted areas, and prepare System Evaluation matrix for Support Team members. Requirements: Bachelor's degree in Information Systems, Business Administration or related fields, followed by 5 years of Systems Analysis experience in the position offered, or related capacity(ies). Qualifications."}