{"jobID": "2658739780", "jobLocation": "San_Francisco_CA", "jobTitle": "Intern - Customers & Markets, Energy - Campus", "companyRating": null, "companyInfo": {"Website": "www.navigant.com", "Headquarters": "Chicago, IL", "Size": "5001 to 10000 employees", "Founded": " 1996", "Type": " Company - Public (NCI) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Navigant Consulting, Inc. (NYSE: NCI) is a specialized, global professional services firm that helps clients take control of their future. Navigant’s professionals apply deep industry knowledge, substantive technical expertise, and an enterprising approach to help clients build, manage and/or protect their business interests. With a focus on markets and clients facing transformational change and significant regulatory or legal pressures, the Firm primarily serves clients in the healthcare, energy and financial services industries. Across a range of advisory, consulting, outsourcing, and technology/analytics services, Navigant’s practitioners bring sharp insight that pinpoints opportunities and delivers powerful results. More information about Navigant can be found at navigant.com.Navigant’s Customers & Markets team focuses on energy efficiency, demand response and clean distributed energy resources. We help the energy industry modernize, increase profitability, and mitigate risk through investment in a wide range of energy technologies. Our extensive industry expertise and rigorous analytical capabilities generate innovative and forward-looking insight to help clients position themselves for a profitable and sustainable future. Our team’s customer side services focus on: » Market Research & Characterization » Resource Planning & Potential Studies » Program Design » Program Evaluation (Impact & Process) » Corporate Sustainability » Regulatory & Policy Strategy & Support We understand that the energy landscape is evolving. Emerging technologies and societal demand promise to reshape not only the energy we use, but also how we use it. In our Energy Practice, Navigant collaborates with energy industry clients to help them build, manage, and protect their business’ value. We help our clients anticipate where the energy industry is headed and how they can improve performance, grow, and address consumer and regulatory demands. Our experts’ unparalleled depth of industry experience provides insight into regulatory processes, pricing, supply and demand dynamics, market design, fuel sourcing, financing, technologies, and operations. The breadth of our industry knowledge offers a full range of solution offerings, from insights to strategy and on to implementation. We provide sustainable results to help our clients thrive in an ever-changing environment. As a Summer Associate, you will work on teams with talented, supportive colleagues who will help you learn and challenge you to grow. You will be responsible for specific components of a project, such as analyzing a client’s or market’s performance or conducting primary and secondary research, as well as for translating your research and analysis into client presentations and reports. Summer Associates may get exposure to clients involved in a wide range of energy-related activities, including energy efficiency, demand response, distributed energy resources, energy storage, and alternative fuel transportation. As an Energy Summer Associate, you may be responsible for the following: Performing technical, statistical, and economic analysis, data collection, spreadsheet creation and management; Conducting detailed fact finding and primary and secondary research, including web-based research, interviews, and field measurements; Assessing energy technologies and analyzing technology and market trends; Developing technology and operational strategies for utilities, government, and energy companies; and Drafting solutions and new strategies to clients through technical reports and presentations.You will Work as a member of a team as well as be a self-motivator with ability to work independently Operate a computer and other office equipment to coordinate work and to prepare and analyze and transmit data Generally, work in an office environment Graduating with an undergraduate degree with an emphasis on analysis, logical reasoning, or problem solving (e.g., engineering, economics, mathematics, business, physical sciences, etc.) between December 2018 and June 2019 Interest and/or experience in advanced energy technologies, renewable energy, distributed generation, energy efficiency, electricity generation, transmission and distribution, natural gas transmission and distribution Outstanding analytical and problem-solving skills Excellent verbal and written communication skills Superior interpersonal skills High degree of self-confidence and determination Demonstrated proficiency with spreadsheets, databases, word processing, and slide presentation software Ability to work overtime hours as needed Strong conceptual, as well as quantitative and qualitative analytical skills  Strong conceptual, as well as quantitative and qualitative analytical skills Work as a member of a team as well as be a self-motivator with ability to work independently Constantly operates a computer and other office equipment to coordinate work Frequently travels by airplane, train or car as necessary to perform work at another location Regularly uses close visual acuity and operates computer equipment to prepare and analyze and transmit data Generally works in an office environmentThe company offers competitive compensation packages including an incentive compensation plan, comprehensive medical/dental/life insurance, 401(k) and employee stock purchase plans.Navigant does not accept unsolicited resumes through or from search firms or staffing agencies. All unsolicited resumes will be considered the property of Navigant and Navigant will not be obligated to pay a placement fee.Navigant is an Equal Employment Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, national origin, ancestry, citizenship status, military status, protected veteran status, religion, creed, physical or mental disability, medical condition, marital status, sex, sexual orientation, gender, gender identity or expression, age, genetic information, or any other basis protected by law, ordinance, or regulation.Navigant will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of applicable law or ordinance including the Fair Chance Ordinance of Los Angeles and San Francisco. "}