{"jobID": "2766398181", "jobLocation": "San_Jose_CA", "jobTitle": "Sales Manager - Furniture and Home Decor", "companyRating": null, "companyInfo": {"Website": "www.scandinaviandesigns.com", "Headquarters": "Petaluma, CA", "Size": "201 to 500 employees", "Founded": " 1962", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Design Your Career with Us.  Are you ready to take the lead? Put your retail and design experience into action. We are Scandinavian Designs, a home furnishings destination rooted in our love for modern design and fine craftsmanship. We are looking for a talented Sales Manager to build and inspire sales growth at our San Jose and Cupertino, CA locations.  The Sales Manager is responsible for delivering store sales and service success through demonstrating leadership, developing and motivating the sales team and supporting the operational performance of the store. The Sales Manager drives performance by building teamwork, delegating assignments appropriately and positively resolving customer issues. The Sales Manager creates a warm and welcoming customer experience; and promotes our assortment and brand with passion.  If you are passionate about interior design and quality products, as well as inspiring and providing exceptional service this could be the opportunity for you. Work with the Store Manager to lead the sales growth and profitability of your store and guide the performance of the team.Lead by example when working with customers and making sales; maintain and encourage a positive and professional presence at all times.Success is a team effort: support the recruitment, development, coaching and retention of a high performing and motivated sales, support and service staff.Provide exceptional customer care in a manner that models a positive attitude and enthusiasm for our products and builds lasting relationships with our customers.Demonstrate expertise in our merchandise: knowing the qualities, benefits and features.Qualifications:While a Bachelors Degree in related discipline is desired, equivalent education and experience are welcome.Experience leading others in a commission-based retail selling environment preferred.Demonstrated success in personal sales and providing exceptional customer service.Experience with interior design and design concepts.Excellent verbal and written communication skills; able to present and train.Good computer skills; able to perform store analytics and required calculations.Able to successfully complete our pre-employment background and drug screenings. Scandinavian Designs now operates 32 stores across seven states under the brand names Scandinavian Designs, Dania Furniture and nationwide for SCANDIS.com. We offer extensive product and sales training to facilitate career growth. Our compensation includes a competitive pay program, sales incentives and a comprehensive health and retirement benefits package.  We are an Equal Opportunity Employer. "}