{"jobID": "2692983780", "jobLocation": "Austin_TX", "jobTitle": "Technical Program Intern", "companyRating": null, "companyInfo": {"Website": "www.communitycaretx.org", "Headquarters": "Austin, TX", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OverviewSendero Health Plans serves as Central Texas’ local community-based health plan. Sendero’s mission is to provide comprehensive health care coverage and to arrange for innovative, high quality and cost-effective medical services for health plan members within Central Texas. At Sendero Health Plans we understand, and we treat our members and their families with compassion and respect. Sendero is seeking a full-time intern for our 3 month, paid internship where under the general direction of the Chief Operations Officer, the Technical Program Intern supports data analysis for Sendero Health Plans. The Technical Program Intern: Researches, compiles, and analyzes health data, prepares and distributes reports, including making appropriate observations and recommendations;Makes recommendations to support efficient and effective data collection and management for Sendero in its use in reporting to internal and external stakeholders; andResearches and develops outcome measures, makes appropriate recommendations on effective measurement and analyzes data in relation to identified outcome measures. ResponsibilitiesThis position provides the services below to support strategic planning, service delivery, performance measurement, communication and finance. Compile and analyze data from various internal and external sources, including manipulation of large clinical and claims data sets using SQL or other advanced analytic tools.Identify and troubleshoot data anomalies and irregularities.Prepare accurate and meaningful quantitative and qualitative ongoing monthly, quarterly and annual reports and briefs for various internal and external stakeholders, including elected officials.Prepare and monitor performance measure information on Sendero supported services including:Recommending measure and targets for assessing utilization and effectivenessDefining how performance measure are collectedForecasting trendsPresenting findingsParticipate in Sendero’s planning and research initiatives (both internal and external), including:Participate in Sendero and interagency strategy meetings and collaborative initiativesResearch data on community health care needs and health statusProvide data on how Sendero’s services correspond with identified needsAnalyze the impact of policy changes on community and SenderoAssist in the development of community-level measuresDevelop system to track progress on agreed-upon measures/initiativesExecute data changes and update core systems as neededHandle multiple projects and timelines effectively and communicate risks and issues to manager regularlyKnowledge/Skills/Abilities:Advanced Knowledge of Microsoft Office Suite, Version 2010 preferredBusiness Intelligence tools, such as Cognos, Tableau, SASCreation of data tracking systems, including dashboards and metricsClinical data and claims data (Medicaid or other public programs preferred)Publically available health-related data sourcesStatistical analysis, research, program evaluation or epidemiology preferred.HMO, Medicaid, CHIP and/or Marketplace experience preferred. Office applications, including Excel and AccessMust have a demonstrated ability to work with large datasetsUse of statistics to solve problems and perform moderately complex data analysis.Experience understanding and writing SQL queries in various environments.Experience developing and troubleshooting programming code (e.g. SQL, SAS, STATA, R).Demonstrated ability to manage and prioritize multiple projects with varying deadlines.Compliance with data confidentiality and security procedures.Perform complex operations in Microsoft Office Suite, with an emphasis on Excel and Access.Ability to write and speak clearly, easily communicating complex ideas as indicated by audience.Knowledge of healthcare, including medical claims coding, relationships between health plans, providers, and payers, a plus. QualificationsMINIMUM EDUCATION: Coursework in data analysis, programming or other PREFERRED EDUCATION: Bachelor of Science in Information Technology or Healthcare MINIMUM EXPERIENCE: Strong skills in Analysis, Coding, Programming, and Data Warehousing PREFERRED EXPERIENCE: Minimum of 2 years’ experience analyzing healthcare data. Knowledge of healthcare, including medical claims coding, relationships between health plans, providers, and payers, is a plus ADDITIONAL: This position is a 3 month, full time, paid internship"}