{"jobID": "2612794314", "jobLocation": "Boston_MA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.schireson.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Who were looking for: We are looking for an analytically-oriented data scientist to join our growing team and help build cutting edge data processes and products. About Schireson: Schireson is a strategic data science consulting firm with offices in New York, Boston, Seattle, Austin, and San Francisco. We always aim to do superb work, and we always try to make the experience of working with us delightful. We also try to have fun while were doing it.  Our clients are market leaders from a wide range of industries, including media & entertainment, technology, professional services, non-profit, financial services, and automotive among other categories. We forge deep, on-going relationships with our clients, and in return they trust us to help them navigate their most complex business challenges.  Our academic backgrounds are varied from PhDs to BAs, from Ivy League schools to state schools. Many of us have professional roots in tech and marketing, and our collective previous experience spans music, entrepreneurship, market research, venture capital, investment banking and management consulting.Your responsibilities would include:Conducting data miningBuilding predictive modelsDeveloping proprietary algorithms and assets for clientsDrawing key insights to drive critical decision makingCreating high quality data driven presentationsCollaborating with peers and managers to consistently exceed client expectationsParticipating in the full cycle of strategic client analysis projects from client facing kick-off to code delivery or implementationThe ideal candidate will have:3-5+ years of hand-on experience doing quantitative analysis/modeling, technical/coding workA desire to work on big data, predictive modeling, and machine learning projects (but not alone!)Superb communication and presentation skillsAbility to think strategically, analytically, and proactively about diverse business problemsPassion for managing the quality & accuracy of analytics, including checking your and others workExperience multi-tasking in a fast-paced and a fast-growing small company or professional services/consulting firm environment is a plusProficiency with PythonExpertise in SQL and relational databasesFamiliarity with AWSExposure to big data tools such as Hadoop, Hive, Sqoop, Pig, Impala or Spark is a big plusExperience in advertising or media & entertainment are a plusExperience with predictive analytics / data science is a plusDegrees in Physics, Mathematics or Engineering are a plus"}