{"jobID": "2792342298", "jobLocation": "Sunnyvale_CA", "jobTitle": "Data Mining Research Intern: Concept Drift and Model Management", "companyRating": null, "companyInfo": {"Website": "www.bosch.us", "Headquarters": "Farmington Hills, MI", "Size": "10000+ employees", "Founded": " 1886", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Continental, Delphi, FCA Fiat Chrysler Automobiles"}, "estimatedSalary": null, "jobDescription": " Job Description  For predictive analyses that rely on early and accurate detection of events of interest, numerous supervised learning approaches have been commonly employed. Conventional regression and classification approaches require the data to be i.i.d, and that the underlining concept remains constant over time. This is not always the case, as there may be gradual or abrupt changes in the underlining distributions over time, which would have an adverse impact on model performance. In absence of ground truth labels to monitor the performance of the statistical model, there is a need for semi-supervised learning frameworks that adapts dynamically to the changing streaming data environment. The aim of this internship is to develop a semi-supervised model monitoring algorithm that detects and adapts to concept drift.  The first part of the internship is a survey of the state of the art in academia in order to identify the most promising approaches. These will then be implemented and customized to work with real-world data from various domains at Robert Bosch LLC. Desired internship outcomes include a detailed research report/paper, prototypical implementations of promising methods, and their evaluation using synthetic and real-world data.  Internships are expected to be at least 12 weeks long during the summer months. Previous internships in our group have led to successful publications and/or patents.  Qualifications  Qualifications:  Pursuing Master or PhD degree in Computer Science, Statistics or a data-oriented engineering discipline  Strong background in data mining/machine learning is required  Previous research experience in anomaly detection and/or semi-supervised learning is desirable  Practical experience with large data sets is desirable  Fluency in at least one data-oriented programming language (R, Matlab, …) and at least one general-purpose programming language (Python, Java, …)"}