{"jobID": "2690239997", "jobLocation": "El_Segundo_CA", "jobTitle": "Digital Product Intern (Fall)", "companyRating": null, "companyInfo": {"Website": "www.chefd.com", "Headquarters": "El Segundo, CA", "Size": "201 to 500 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable", "Competitors": " Blue Apron, Green Chef, Plated"}, "estimatedSalary": null, "jobDescription": "At Chef’d we believe great food creates memories, enhances moments, and nurtures the soul. Our mission is to enrich lives through culinary adventure with our hand-cultivated, meticulously curated, delicious experiences. Chef’d is the only subscription-free meal marketplace allowing you to discover new foods the way you want—no strings attached. We have over 1500 recipes from some of the best names in food—celebrity chefs, major brands, and culinary influencers.We're a team filled with chef's, culinary writers, data scientists, marketing/sales experts, production associates and more - all committed to playing our hearts out. We follow through with our goals, move fast, and take risks. The industry is growing and we're at the forefront of innovation and personalization.Chef'd, a venture-backed, series-B company, is beginning to experience high growth as we scale our operations to new markets and distribution channels. There are plenty of areas where we can innovate and optimize.The Chef’d product team blends technical knowledge with business acumen. We provide a hearty basis for product design and a user-experience focused counterpoint during development. As a product intern, you will be mentored throughIngredients: 1 Bachelor's degree in Computer Science, Business, HCI, or related1 Graduate course in Product Management related field1 mind comfortable with digital, cloud, and e-commerce technologies1 tongue confident in business and technical languages1 entrepreneurial attitude flexible to change1 heart enthusiastic about food1 funny bone :)Additional seasonings:"}