{"jobID": "2738235287", "jobLocation": "Santa_Clara_CA", "jobTitle": "Mortgage Loan Officer (External)", "companyRating": null, "companyInfo": {"Website": "www.keypointcu.com", "Headquarters": "Santa Clara, CA", "Size": "51 to 200 employees", "Founded": " 1979", "Type": " Nonprofit Organization", "Industry": " Finance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Discover an exciting opportunity to work with a Leading Local Mortgage Lender.KeyPoint can help increase your income with:? Local Operations and Underwriting. You can close a purchase in 21 days!? Very strong compensation program that includes Base Salary and an aggressive commission structure.? Fannie/ Freddie product plus a Very Aggressive Jumbo Portfolio Product that meets the needs of Bay Area High Tech employees.? Competitive Pricing.? Best in class Technology bases systems to help you improve and automate borrower and Realtor service and communication.Here's what you bring to the table:? A burning desire to be the best of the best.? Minimum of 3 years as a producing Retail loan officer.? Current book of producing Realtors.? Strong knowledge in Underwriting and standard mortgage practices.? Must be a self-starter, Proactive with a sense of urgency and attention to detail.. Responsibilities:Source and originate residential real estate loans through development of relationships with realtors, builders and business professionals.Achieve individual and department real estate production and quality goals as outlined by the Credit Union.Be an active member of the community and the local real estate industry.Attend various functions and establish KeyPoint Credit Union in the community as the Real Estate Lender of choice.Develop and manage a realtor referral base of between 15-25 active real estate agents.Conducts presentations at real estate office sales meetings, homebuyer seminars or other venues to solicit real estate loans.Generate referral business, leads and relationships with individuals, existing clients, past clients and real estate professionals.Provide guidance and information relevant to the member's application and the Credit Union's real estate loan products and processes.Effectively explain and communicate the terms of the real estate loan products and ensure all necessary documents are obtained and/or signed by the members.Analyze member's existing financial status, credit and property evaluation to determine feasibility of granting the loan, providing conditional approval or denial of loan request.Analyze detailed financial and credit data, matching the member's needs with an appropriate loan program and level of risk.Clearly communicate conditional approval and the conditional approval conditions.Communicate with member to resolve questions regarding application information.Maintain a strong working knowledge of all the Credit Union's portfolio and investor guidelines as well as be fluent in loan level pricing.Manage pipeline to meet production goals, loan quality and member service including turn times.Understand and learn new CRM and LOS systems to facilitate loan closings.Responsible for quoting rates and guidelines with accuracy and fairness.Communicate directly both verbally and in writing with members, real estate clients and peers in the real estate lending department.Cross sell other products and services offered by the Credit Union.Adhere to federal and state regulatory requirements, and credit unions policies and procedures as they pertain to loan origination and sales.Compliance with the S.A.F.E. Mortgage Licensing Act of 2008 and all related regulations.Perform other duties as assigned.Physical Requirements: (Including lifting, sitting, walking, bending, reaching and squatting % of time in each function) The workstation consists of an indoor cubical. A workday consists of sitting 75% of the time with standing 10% of the time and walking 15% of the time. The job also has some of the following for a total of no more than 1 hour each day: bending, reaching, kneeling, squatting and lifting up to 25 pounds or less. Minimum 5 years mortgage experience, preferably as a loan officer or account executiveHigh school diploma or equivalent, with AA or BS preferred.Expertise in interpreting underwriting guidelines and analyzing risk.Solid time management and organizational skills.Ability to communicate clearly and effectively, both verbally and in writing, across a variety of audiences.Strong interpersonal skills.Ability to solve a variety of problems and deal with complex scenarios by using common sense and practical applications.Ability to work accurately and efficiently in a face-paced environment.Superior computer skills, including proficiency with Microsoft Office Suite.Experience and detailed understanding of FNMA’s DU and FHLMC’s LP systems. This position requires S.A.F.E. registration at the time of employment. The Nationwide Mortgage Licensing System (NMLS) web site (mortgage.nationwidelicensingsystem.org) provides the MU4R questions and registration required for employment in this position. Ongoing employment is contingent upon meeting all such requirements, including acceptable background investigation results."}