{"jobID": "2711186132", "jobLocation": "New_York_NY", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.graphika.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "How many different ways can you leverage data to answer a research question? For our cartographies of complex online movements and our data analysis work, we are looking for a rigorous and creative Data Analyst. This position is an exciting opportunity to grow a career in a dynamic startup environment, in deep collaboration with our technical team and clients with questions ranging from geopolitics to consumer goods. We are open to hiring and training a strong, motivated, creative junior - or to making space for someone who already has an established background in the field. WHAT YOU WILL DO:Think creatively about new ways to analyze the online public sphere and online attitudes: leverage other analytical tools and collaborate with subject matter experts on a wide range of topicsDevelop an in-depth expertise of Graphika’s unique capabilities and how to leverage the data our platform offers to address a wide range of analysis questionsPerform research and data collection to prepare custom analysis for clients and for the Graphika teamLiaise with our Sales, Product, Support, Research, & Tech teams to get input at multiple steps of the analysis processHandle analysis projects from initial research to final delivery, translating complex data analysis in engaging outputs to be shared with clientsRun scriptsUse a combination of command line scripts and GUIs to guide maps through the publication processREQUIREMENTS:Bachelor's or Master’s Degree in a related field: this can be communications, political science, media studies, etc. It does not have to be data analysis! Applied data analysis experience; experience leveraging social media data for analysisStrong analytical, critical thinking, and problem solving skills; rigor and intellectual honesty in analysis are also paramountMotivated and conscientious self-starter with attention to detailHigh level of perseverance and time management skillsHighly organized and effective at multitaskingAdaptable, inventive, and confident working independentlyStrong interest in internet and society, geopolitical dynamics and cares about the health of the internet and the networked public sphere globallyGOOD TO HAVE:Skilled with Google suite applicationsStrong Excel userInterested in developing additional coding skills/working on larger data setsMultilingual proficiency a big plusWHY YOU'LL LIKE WORKING FOR GRAPHIKA:Wevaluedevelopment. We are a high-performance organization always challenging ourselves to grow. We can promise that you will be working with the best and brightest in the industry. You’ll need to be great to get hired here, and we promise you’ll get even better.Wecareaboutyou. We offer 100% employee-paid health, dental, and vision benefits for employees and their dependents, FSA, and a generous monthly commute allowance to make your trips to and from work easier. Additionally, we have unlimited work-from-home, sick day, and PTO and require every employee to take a minimum of 10 days vacation/year. We also host team activities regularly including game nights, group lunches, and team outings.Weareanequalopportunityemployerandvaluediversityatourcompany. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}