{"jobID": "2770578276", "jobLocation": "Burlingame_CA", "jobTitle": "Intern, Embedded Engineer", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "OVERVIEW Lithiumstart is the rapid turn research and development arm of EaglePicher LLC, a world class lithium-ion battery manufacturer. We are looking for a talented intern to help us build the next generation of high power battery and power solutions for customers ranging from NASA to the US Armed Forces. As part of our small engineering team, you will contribute to our embedded code base for both customer deliverable products and in-house test equipment. Ideal candidates will be highly motivated with an ability to succeed in a hands on environment with limited oversight of daily functions. RESPONSIBILITIES Your core responsibilities will be to: Contribute to our embedded Battery Management System framework/libraries; for example improve our State of Health algorithm by incorporating customer feedbackDevelop automated hardware-in-the-loop testing; for example by developing built-in self-tests on existing systems and automating tasks that are presently done manually by techniciansImprove our test and data analysis tools; for example creating flexible Python/Julia based scripts for plotting/analyzing high power battery test log dataAssist in new board/prototype bring-up and debuggingREQUIRED EXPERIENCE AND SKILLS To succeed in this position, you must: Working towards BS or MS in Computer Science, Electrical Engineering, Computer Engineering, Mechatronics, or equivalentU.S. Citizenship required due to contractual requirementsExperience with embedded C and state machines for real time applications.Experience with Microchip PIC, Atmel AVR, STM32 ARM Cortex, or similar MCU's.Ability to create system state diagrams and read electrical schematics.Expertise in hands on board bring up, troubleshooting, and diagnostic tool usage.Strong intuitive sense of computer science fundamentals including algorithms, data structures, etc.Experience with high level scripting/data analysis tools (e.g. Python, Julia, Matlab)Familiarity with schematic capture tools (Altium, Eagle, etc.)Experience controlling electromechanical hardware via softwareHighly motivated with an ability to succeed in a hands on environment with limited oversight of daily functionsENVIRONMENT AND BENEFITSOnsite meals, snacks, ping pong, and foosballOpportunity to get some hands on experience!ABOUT US EaglePicher Technologies, LLC is a leading producer of batteries and energetic devices for the defense, aerospace, medical, commercial, oil, and gas industries. The company provides the most experience and broadest capability in battery electrochemistry of any battery supplier in the United States.  EaglePicher Lithiumstart, located in San Francisco, provides agile rapid prototyping and proven turnkey solutions for lithium ion battery management, pack integration, safety and power conversion technology. Lithiumstart serves as EaglePichers R&D; Electronics Center of Excellence (COE), and its highly complementary technologies are used across EaglePicher's broad suite of existing products, providing additional capabilities and customer value add. As a turnkey integrator, we source the best cells from around the world and package them in enclosures with management electronics. No project is too small or too large for Lithiumstart we build energy storage systems that range in size from two cells up to tens of thousands of cells.  EaglePicher Technologies LLC is an Equal Opportunity Employer and does not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class."}