{"jobID": "2807001330", "jobLocation": "Bellevue_WA", "jobTitle": "Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.launchcg.com", "Headquarters": "Bellevue, WA", "Size": "501 to 1000 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "62000", "jobDescription": "Data Analyst Be a part of our success story. Launch offers talented and motivated people the opportunity to do the best work of their lives in a dynamic and growing company. Through competitive salaries, outstanding benefits, internal advancement opportunities, and recognized community involvement, you'll have the chance to create a career you can be proud of. Your new trajectory starts here at Launch.  We’re seeking an experienced Data Analyst who can leverage their analytical skills to digest data and tell a story. This role requires a background in business or data analysis via modern technologies such as Excel, Power BI, and SQL. The candidate should also be experienced in cubes, pivot tables, and PBI visualizations. Responsibilities:Utilize analytical skills to digest data and tell a storySupport team planning retrospectivesGather requirements for complex reporting problems and provide recommendations on solutionsServe as primary point of contact for the team on owned workstreamsRequired Experience/Qualifications:Bachelor’s degree required3 - 5 years of work experience as a business/data analystStrong background in Excel, Power BI, and SQLExperienced in cubes, pivot tables, and PBI visualizationsExcellent communication skillsBusiness Athletes: Launch looks for the same attributes we admire in top athletes and applies them to the business world: MASTERYCOMMITMENTFOCUSDETERMINATIONINTEGRITYTEAMWORKPOSITIVITYGOAL-ORIENTEDHEALTHY COMPETITIONGOOD SPORTS We interview for these traits above and beyond the technical skill set required for a particular role. Surrounding ourselves with Business Athletes leads to a competitive, fun, winning environment.  Qualified applicants, please respond to inquire@launchcg.com with your full name, resume, and a brief description of how your skills match the requirements above.  Please refer to Job #1935 when responding to this posting.  Launch Consulting is an Equal Opportunity and Affirmative Action employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation"}