{"jobID": "2723979679", "jobLocation": "Boston_MA", "jobTitle": "Data Scientist - Biostatistics and Computational Biology", "companyRating": "4.1", "companyInfo": {"Website": "www.dana-farber.org", "Headquarters": "Boston, MA", "Size": "1001 to 5000 employees", "Founded": " 1947", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "93000", "jobDescription": " Located in Boston and the surrounding communities, Dana-Farber Cancer Institute brings together world renowned clinicians, innovative researchers and dedicated professionals, allies in the common mission of conquering cancer, HIV/AIDS and related diseases. Combining extremely talented people with the best technologies in a genuinely positive environment, we provide compassionate and comprehensive care to patients of all ages; we conduct research that advances treatment; we educate tomorrow's physician/researchers; we reach out to underserved members of our community; and we work with amazing partners, including other Harvard Medical School-affiliated hospitals.  The data scientist will organize the Department of Biostatistics and Computational Biology's data in a way that facilitates data integration and collaboration across groups, and grow and improve this database with publicly available data. Work with our faculty to transfer data from the public repositories and organize these data to facilitate data analysis.Develop analysis pipeline to convert raw data into analysis ready formats.Work with Bioinformatics Principal Investigators, Engineers, and Analysts to anticipate long-term data needs and plans for solutions.Work with local and remote IT teams to migrate data, explore data encryption and transfer options, manage user agreements, and storage of clinical and genomic information, and to disseminate data to the scientific community.Create, program and operate data management pipelines, develop best-practice protocols for storing, backup, and organization of research data, and create pipelines that implement these practices, including standardized quality control pipelines for ensuring data integrity.Create and share documentation of available data sets.Liaise with central departments such as Belfer Office for Dana-Farber Innovations (BODFI) to assure appropriate Material Transfer Agreements (MTAs), Data Use Agreements (DUAs), and/or other requirements are in place.Master’s Degree or Ph.D. in Data Science, Computational Biology, Statistics, Biostatistics or Computer ScienceKnowledge of Linux operating systems and R or Python. Strong proficiency with shell scripting and administration tools.Familiarity with (or willingness to learn) next-generation sequencing and associated data types.Strong customer service and organizational skills. The candidate must demonstrate outstanding personal initiative and the ability to work effectively as part of a team. Ability to meet deadlines and efficiently multitask is a must. Strong interest in contributing to cancer research. ** Include a short description of your interest with your resume. Please also include a link to your recent code, e.g. hosted on github. **"}