{"jobID": "2831151906", "jobLocation": "San_Francisco_CA", "jobTitle": "Sr. Data Scientist", "companyRating": "2.8", "companyInfo": {"Website": "www.williams-sonomainc.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1956", "Type": " Company - Public (WSM) ", "Industry": " Retail", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Room & Board, Design Within Reach, Pier 1 Imports"}, "estimatedSalary": "157000", "jobDescription": "Requisition Number: SS-13249  Area of Interest: Marketing  Organization: Corporate  Brand/Division: Shared Services  Position Type: Full-time JOB DESCRIPTIONAbout the team: The Customer Insights team supports all WSI brands by delivering quantitative analysis of customer behavior. The brand teams rely on Customer Insights analysts to provide high quality quantitative guidance and insight on key brand marketing initiatives. A Customer Insights analyst partners with colleagues to understand and articulate marketing questions, develops appropriate quantitative approaches, writes code SAS and/ or SQL (SAS in windows environment with processing on a UNIX platform, SQL on Teradata), creates statistical measures and analyzes data, then leads a discussion of results and implications with brand partners. The work environment is friendly, supportive, deadline driven, and service oriented. Analysts are skilled professionals who are responsible for writing database programs to manipulate large data sets, developing analytic methodologies to answer business questions, and presenting findings to business partners. Analysts should have strong communication skills and have a desire to understand and solve complex quantitative marketing problems.  You&apos;re excited about this opportunity because you will... Work with Analytics Manager/ Director to develop approaches and execute analyses via SQL (and/or SAS) programming.Contribute in the delivery of novel revenue-driving programs.Partner with the Conversion team in driving customer data in support of Site Personalization and Product Recommendation initiatives.Contribute in the bottoms-up approach of marketing attribution study. Understand various aspects of existing marketing programs and how they drive sales.Contribute and lead the effort to measure multi-channel incrementality.Support data asset creation for the Clienteling effort.Engage in ad hoc custom research.Create reports and present final analysis results to brand partners and/ or senior executives for use in marketing programs and strategy.Consult with business partners on interpretation of data and analysis results.Consult with business partners on design and implementation of marketing tests such as control group design, A/B test design, and others.Make actionable marketing recommendations.REQUIREMENTS AND QUALIFICATIONSMaster&apos;s Degree in a quantitative field such as Statistics, Operations Research, or Computer Sciences (or equivalent by experience)4+ years of hands-on experience in data mining and model buildingExperience with SAS, SQL, R, PythonStrong understanding of large scale databases and systemsAbility to work effectively with teams in collaborative, cross-functional environmentWell-organized, high attention to detail, deadline-orientedStrong analytical and critical thinking skillsExcellent written and verbal communication skillsRetail industry and digital marketing data experience a plus About Williams-Sonoma, Inc.  Founded in 1956, Williams-Sonoma, Inc. is the premier specialty retailer of high-quality products for the kitchen and home in the United States. Our family of brands are Williams-Sonoma, Pottery Barn, Pottery Barn Kids, PBteen, West Elm, Williams-Sonoma Home, Rejuvenation, and Mark and Graham. These brands are among the best known and most respected in the industry. We offer beautifully-designed, stylish and functional products for every area of the home, including the kitchen, living room, bedroom, home office, closet, laundry room and even outdoor spaces. We&apos;ve seen some big changes since our first brick-and-mortar store opened more than half of a century ago. What hasn&apos;t changed is our passion for high-quality products, functional design, outstanding customer service, and enhancing the lives of our customers and the communities where we operate. Today, we&apos;re a multi-brand, multi-channel, global enterprise supported by state-of-the-art technology and some of the most talented teams in retailing - and we&apos;re always looking for new energy and ideas. #LI-JC1 Williams-Sonoma, Inc. is an Equal Opportunity Employer.  Williams-Sonoma, Inc. will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance, or other applicable state or local laws and ordinances."}