{"jobID": "2817927564", "jobLocation": "New_York_NY", "jobTitle": "Intern: Investment Data Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.tmamerica.com", "Headquarters": "New York, NY", "Size": "201 to 500 employees", "Founded": " 1911", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "52000", "jobDescription": "Marketing StatementAbout Tokio Marine: Tokio Marine has been conducting business in the U.S. market for over a century and we are licensed to write all lines in 50 states, Puerto Rico and the District of Columbia. We provide unique insurance and risk management tools from our experienced staff of account executives, underwriters and loss prevention engineers and fair and timely claim settlement from a skilled team of claim professionals. We work with major brokers and leading independent insurance agents throughout the United States to serve the world's largest and most distinguished organizations. We are committed to creating value for our customers by providing ANSHIN (safety, security and peace of mind). We strive to be creative and passionate as we work towards our long-term success. Tokio Marine Holdings is Japan's oldest, and one of the largest property and casualty insurers. Founded in 1879, TMNF operates worldwide in 38 countries. With annual revenues of approximately $18 billion and an A.M. Best rating of A++, one of the highest in the industry, we are one of the top 20 insurance providers worldwide.  . DutiesJob Summary: This individual will be assisting portfolio managers to develop systematic strategies. Duties include leveraging alternative data (e.g. news, regulatory filings) etc. Essential Job Functions: - Involved in the front-to-back investment data science processes.  - Technology Infrastructure: Work with technology vendors to manage existing cloud computing infrastructures and onboard new computing capabilities  - Technology Management: Evaluate and optimize production codes and technology spending  - Data Acquisition: Participate in meetings with data vendors to evaluate new data sources  - Data Engineering: Implement ETL processes and manage databases  - Data Science: Research academic and industry publications and implement state-of-the-art data science methods  - Software Engineering: Rewrite legacy prototyping codes into production codes  - Project Management: Work on ad-hoc projects Qualifications: - University student ideally enrolled in a computer science or related degree  - Strong interests in cutting edge technology in regards to finance  - Strong communication and project management skills  - Proficient in one or more of object oriented language (e.g., Java), scripting language (e.g., Python), statistical language (e.g., R), database language (e.g., SQL), and visualization tool (e.g., Tableau)  - 2 years of professional working experience, a plus  - Experience working with open source libraries and distributed computing (e.g., AWS), a plus  - Knowledge of machine learning frameworks(e.g.,Weka, scikit-learn), a plus  - Knowledge of natural language processing frameworks (e.g., NLTK), a plus  - Strong computer skills with strong proficiency in Microsoft Office applications  - Ability to work independently and as part of a team  - Strong problem solving and organizational skills  - Strong oral and written communication skills EEO Statement Tokio Marine Management is an Equal Opportunity Employer. In order to remain competitive we must attract, develop, motivate, and retain the most qualified employees regardless of age, color, race, religion, gender, disability, national or ethnic origin, family circumstances, life experiences, marital status, military status, or sexual orientation."}