{"jobID": "2816069219", "jobLocation": "San_Francisco_CA", "jobTitle": "Lead Product Growth Manager, Engagement", "companyRating": "4.1", "companyInfo": {"Website": "www.glassdoor.com", "Headquarters": "Mill Valley, CA", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Indeed, LinkedIn"}, "estimatedSalary": "134000", "jobDescription": "QUICK SUMMARYProduct Management role within our Product & Growth team at the fastest growing jobs and careers site in the United StatesYou’ll have product and business ownership of our Jobs Engagement & Notifications teamsOwn the definition, goal-setting and delivery of the growth of our Engagement productManage the full product lifecycle - defining features, requirements and measurement metrics. Relentlessly iterate and improve through AB testingQualifications:5+ years of Product Management experience, ideally in a consumer facing role with strong quantitative backgroundDegree in Engineering/Sciences, MBA or a quantitative programLocation: Mill Valley headquarters / Downtown San FranciscoClick “Apply” on this page to submit your resume directly to the hiring managerFULL JOB DESCRIPTION Glassdoor’s mission is to help people find jobs and companies they love. We do this by leveraging our unique data-set of company reviews, salaries and interviews alongside our jobs data to offer a one-stop shop for job search and apply. The Engagement Product is a key pillar of our product strategy with the mission of delivering the right set of jobs to the right person at the right time through all pushchannels - e.g. email, notifications, etc. This team is a key driver behind Glassdoor’s fastest growth rates in the industry and is a high impact and visibility role within our Product team. ResponsibilitiesOwn the end-to-end job seeker journey experience - including onboarding, engagement, retention and reactivation through engagement channels.Own the ideation, user research, development, launch of new product features. Relentlessly measure, learn and optimize.Develop instrumentation and logging for data collection and drive reporting and analytics of your productWork cross-functionally with other marketing and product teams to create a cohesive and aligned product strategyBusiness ownership of your product.You will be responsible for an area that has massive impact on Glassdoor’s revenue. You will define, own, monitor and optimize your product’s KPIsRequirementsYou are a strategic thinker who can define a long-term vision but thrive in execution and driving immediate resultsYou can inspire and influence a diverse group of people to march towards your visionAnalytical horse-power and passion for data-driven decision makingYou are passionate about learning and solving burning user needs5+ years of Product Management experience, ideally in a Growth or Engagement focussed role for a consumer facing internet productDegree in Engineering/Sciences, MBA or Quantitative programsWhy Glassdoor?Work with purpose – join us in creating transparency for job seekers everywhereGlassdoor gives back! Glassdoor is a Pledge 1% member; all employees receive 3 paid volunteer days per year100% company paid medical/dental/vision/life coverage; 80% dependent coverageAn attractive long term incentive planPaid holidays and flexible paid time offCombination of a sunny & peaceful Mill Valley offices right by the bay with many hiking trails at its doorstep. Our San Francisco location is right by Embarcadero close to public transit Glassdoor is committed to equal treatment and opportunity in all aspects of recruitment, selection, and employment without regard to gender, race, religion, national origin, ethnicity, disability, gender identity/expression, sexual orientation, veteran or military status, or any other category protected under the law. Glassdoor is an equal opportunity employer; committed to a community of inclusion, and an environment free from discrimination, harassment, and retaliation."}