{"jobID": "2822161086", "jobLocation": "New_York_NY", "jobTitle": "VP,Business Consultant Floater-Banking", "companyRating": null, "companyInfo": {"Website": "merch.bankofamerica.com", "Headquarters": "Atlanta, GA", "Size": "1001 to 5000 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Fiserv, Elavon"}, "estimatedSalary": null, "jobDescription": " Ever wonder what it takes for a business to process credit card payments? Interested in helping small business owners do more with their point-of-sale systems? At Bank of America Merchant Services, we’ll help you become a payments expert. We’ll show you the intricacies of payment processing, eCommerce and security solutions so that you can become a trusted partner for a variety of small businesses.  Every day, we deliver innovative solutions that help small business owners across the U.S. better serve customers, manage operations, accept digital payments and ultimately grow their businesses. Formed in 2009 by powerhouse brands Bank of America and First Data, we’ve grown to process more than 16 billion transactions at approximately 529,000 merchant locations in 2017 alone. We’re a leader with deep expertise and momentum.  Bank of America Merchant Services is an Equal Opportunity and Affirmative Action Employer of Females, Minorities, Veterans and Disabled.  The Business Consultant (BC) - Floater is responsible assuming ownership and accountability for a market that is vacant due to an open position. They are responsible for revenue growth through complete ownership and accountability for both new and existing client relationships within the assigned portfolio. This position provides the ability to sell the full suite of Bank of America Merchant Services solutions to large corporations with revenues not exceeding $50M. This is accomplished by using a solution-based, consultative selling approach designed to help clients grow their businesses. Sales efforts will be driven by referrals obtained from a strong working relationship developed with our nationally branded bank partnership along with other referral sources, both large and small. Through needs assessment and application of consultative strategies, the BC will strengthen client and business partner relationships, ensuring clients are equipped with current industry vertical and related payment industry requirements, including security, compliance, loyalty, mobility and growth strategies. Essential FunctionsMaintain retention, margin and cross sale goals within the existing client portfolio by proactively evaluating client business needs against our ability to solution for those needs.Establish new client relationships from within an assigned prospect list, growing an overall portfolio of relationships and associated revenueMeasure success by portfolio revenue growth, cross sales, and client satisfaction.Serve as a resource lead, bringing all BAMS’ enterprise assets to the client facing relationship as needed or desired to bring positive outcomes to the client and BAMS alike.Understand industry trends and effectively position BAMS products and services to drive cross sales opportunities.Influence and guide decision making within the client organization.Develop routines that enable effective alignment, communication and collaboration with extended enterprise partners including our BANA Treasury and Client teams and Technical/product partners.Facilitate the resolution of escalations, contract extensions, financial dispute/issues and general business management.SkillsBachelor’s Degree and at least 5-8 years’ experience in bankcard and related industry sales and consultation.Consultative mindset, with the ability to develop client and business strategies to maximize growth and development.Experience selling Merchant, Bankcard, Payment Processing or Financial Services.Technologically savvy; comfortable with tablet and cloud-based solutions and able to apply technology to help grow small businessesPassion for continuously learning about and leveraging new technologyStrong prospecting skills and ability to coach others on self-generating new businessHunter mentality with drive to identify and follow-through on opportunitiesSolution selling experience preferredAbility to quickly establish and maintain productive relationships with senior executives in large corporations.Highly motivated to succeed in a performance driven environment.Strong detail-orientation and problem solving skills.Strong customer service and client-centric focus.Ability to work independently with minimal supervision toward the achievement of personal and team goals.Strong communications, including oral and presentation skills.Effective planning, time management and organizational skills.Outstanding sales/portfolio management, business development and negotiation skills.Ability to multitask and change direction in ever changing business development environment.Ability to coach associates with less experience and/or knowledge.ExperienceBachelor’s Degree.5+ years of sales/portfolio management experience, including C-level sales.ToolsProficient in Microsoft Excel, Word, PowerPoint, and Outlook. Ability to quickly learn various sales applications.Physical RequirementsWorks in varied environments involving sitting and standing. Ability to sit for prolonged periods of time, including as a driver or passenger in an automobile. Ability to utilize a tablet and telephone prolonged periods of time. Ability to visit and move around at client sites including the ability to maneuver in a variety of places. Ability to lift, carry, and otherwise transport work-related materials that may weigh up to 25 lbs. and that may occasionally weigh in excess of 25 lbs.TravelTravel is required to perform essential functions of the role.This is not necessarily an exhaustive list of all responsibilities, performance standards, measurements, skills or requirements associated with this job. While this is intended to be an accurate reflection of the current job, management reserves the right to revise the job or to require other or different tasks to be performed when circumstances change. 5432  #LI-SG1  Bank of America Merchant Services ensures equal employment opportunity without discrimination or harassment on the basis of race, color, creed, religion, national origin, alienage or citizenship status, age, sex, sexual orientation, gender identity or expression, marital or domestic/civil partnership status, disability, protected veteran status, genetic information, or any other basis protected by law.  The employer will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the employer’s legal duty to furnish information. Nearest Major Market: Manhattan Nearest Secondary Market: New York City Job Segment: Bank, Banking, Business Manager, Executive, VP, Finance, Management"}