{"jobID": "2759020123", "jobLocation": "Long_Beach_CA", "jobTitle": "Senior Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.laserfiche.com", "Headquarters": "Long Beach, CA", "Size": "201 to 500 employees", "Founded": " 1987", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " EMC, IBM, OpenText"}, "estimatedSalary": "123000", "jobDescription": " Senior Data Scientist  Business Development | Long Beach, California  DescriptionAs a Data Scientist, you instinctively approach every problem with an analytical, inquisitive and critical mindset. Aside from data crunching you will interpret trends and draw implications while utilizing your knowledge and discoveries to impact business decisions.  At Laserfiche, we are interested in expanding our versatile team of marketing analysts in order to meet the demands of dynamic business growth. The right candidate is hands-on, proactive and knows how to get things done! Responsibilities Include:Collaborate with product and marketing experts to guide data driven business strategyDevelop dashboards and systems to monitor existing programs and ensure that execution is aligned with objectivesCompare performance over time and asses market needsProvide analytics support to drive product packaging and pricing decisionsAssess problems and recommend solutions backed by analysisAggregate and analyze data from a variety of sourcesCommunicate and report data trend analysisPresent findings and provide data-based recommendations to executivesWhat You'll Need:Bachelor’s Degree in Economics, Statistics, Mathematics, or a related fieldDemonstrated strong sense of urgency with ability to juggle multiple projectsRequired SQL experienceExcellent communication skillsExperience with R or Stata,Tableau or another business analytics software a plusPrior coursework in computer science also a plus Click here to learn more about Life at Laserfiche. Laserfiche complies with all Equal Opportunity and Affirmative Action regulations. Laserfiche makes all employment decisions – such as recruiting, hiring, training, promotion, compensation, professional development practices, discipline and termination – without regard to race, religion, color, national origin, ancestry, citizenship, sex, pregnancy, age, creed, physical or mental disability, medical condition, genetic characteristic, marital status, veteran status, gender identity/expression, sexual orientation or any other characteristic protected by law, except as may be permitted by law  Share Apply Later"}