{"jobID": "2690366918", "jobLocation": "San_Francisco_CA", "jobTitle": "Solutions Consultant Intern", "companyRating": null, "companyInfo": {"Website": "www.agilone.com", "Headquarters": "Sunnyvale, CA", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Adobe, IBM"}, "estimatedSalary": null, "jobDescription": "AgilOne, the Customer Data Platform provides enterprise consumer marketers the power to integrate customer data across digital, physical, and mobile channels, deliver customer analytics with predictive insights and 360-degree profiles, and engage customers at every touch point in order to maximize lifetime value. Currently, the AgilOne solution supports more than 150 brands worldwide.We leverage the latest technologies in big data, machine learning and data quality management to deliver an enterprise-grade, scalable and high performance tool for customers such as Tumi, Lululemon, Lilly Pulitzer and Davids Tea. AgilOne is funded by the best in the Valley - Sequoia Capital, Tenaya, and Mayfield.Internship description:This is an opportunity for(a) a gap year internship of one year (no 6 months internships)OR(b) an end-of-studies internship of one year followed by a potential job offer based on performanceYou would be joining AgilOne in our Professional Services department starting summer 2018 in one of our offices in California (Sunnyvale/San Francisco). As a Solution Consultant Intern, you will: Work on the technical aspects of customer implementations projects from start to finishUnderstand the ins and outs of the AgilOnes Big Data platform product to design, build and deploy performant and elegant configurations/customizations/extensions to the platformUnderstand and translate the clients marketing/business use cases to suggest an approach/solution suitable to their needsHelp refine and distribute AgilOne Platform best practicesRequirements:The ideal candidate will display a balanced blend of technical expertise, project management and communication skills as well as a strong marketing business sense.Bachelor or Masters DegreeExcellent written and verbal communication skills in English tailored to an audience of professionals with diverse backgrounds (IT, marketing, etc..)Exceptional organizational skills and the ability to manage multiple simultaneous projects at varying stagesAbility to learn about new platforms and technologies unique to client environmentsSelf-motivated and good sense of ownership - comfortable working in a fast paced environment with limited directionStrong analytical and problem solving skillsStrong SQL programming skillsNice to Have:Knowledge on Machine-learning concepts and algorithmsPrior project management experienceKnowledge on distributed technologies such as Hadoop, Spark or HiveExperience in web technologies (e.g. HTML, CSS, JavaScript)Experience in web analytics (e.g. Google Analytics, CoreMetrics, SiteCatalyst)Working knowledge of email service providers (e.g. Silverpop, ExactTarget, Responsys)Prior IT consulting and/or project management experienceThis position does not fit your skillset or your career plans?! Please check all our internship offers :Data Scientist InternSolutions Consultant Intern"}