{"jobID": "2721167363", "jobLocation": "Boston_MA", "jobTitle": "Clinical Coordinator (RN), Plastic & Oral Surgery", "companyRating": "3.7", "companyInfo": {"Website": "www.childrenshospital.org", "Headquarters": "Boston, MA", "Size": "5001 to 10000 employees", "Founded": " 1869", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "62000", "jobDescription": "Title Clinical Coordinator (RN), Plastic & Oral Surgery  03-Apr-2018 Department Ambulatory Services AutoReqId46560BRStatus Full Time Standard Hours per Week40Shift Day Job Posting DescriptionAt Boston Children’s Hospital, success is measured in patients treated, parents comforted and teams taught. It’s in discoveries made, processes perfected, and technology advanced. In major medical breakthroughs and small acts of kindness. And in colleagues who have your back and patients who have your heart. As a teaching hospital of Harvard Medical School, our reach is global and our impact is profound. Join our acclaimed Plastic and Oral Surgery team and discover how your talents can change lives. Yours included. The Clinical Coordinator will:Plan, organize and oversee daily clinical and administrative operations of the Plastic Surgery Department. Functions using High Reliability Organization principles.Work closely with Directors and Practice Administrator regarding coordination of care/services to meet patient care and operations requirements for Waltham and Longwood.Develop, recommend and implement internal standards, policies and procedures, and standardize care across the continuum, to improve quality and cost-effectiveness of patient care.Interview, supervise and evaluate nursing and clinical support personnel.Develop and provide staff education/development programs, create nursing competencies to reflect current practices.Clinical responsibilities include: pre-operative assessment, medication administration, monitoring, documentation and post-operative recovery for patients receiving procedural sedation.Lead and participate in hospital, departmental and multidisciplinary programs, committees and special projects.Oversee departmental continuous regulatory readiness compliance and safety event reports and follow up with action plans.Work closely with Quality Improvement TRIAD nurse, consultant and physician.To qualify, you must have:A Bachelor of Science in Nursing and 4-5 years of RN experience.2+ years of management/leadership experience.A Master’s Degree in Nursing preferred. Excellent technology skills.Analytical skills to resolve highly complex problems requiring the application of clinical, scientific or technical principles, theories and concepts and in-depth, cross-functional, experience-based knowledge.The ability to communicate and collaborate effectively with an interdisciplinary team. Boston Children’s Hospital offers competitive compensation and unmatched benefits, including affordable health, vision and dental insurance, generous levels of time off, 403(b) Retirement Savings plan, Pension, Tuition Reimbursement, and discounted rates on T-passes (50% off). Discover your best.  Boston Children’s Hospital is an Equal Opportunity / Affirmative Action Employer. Qualified applicants will receive consideration for employment without regard to their race, color, religion, national origin, sex, sexual orientation, gender identity, protected veteran status or disability.Office/Site Location Boston  Boston Children's Hospital"}