{"jobID": "2791591385", "jobLocation": "New_York_NY", "jobTitle": "Project Auditor", "companyRating": null, "companyInfo": {"Website": "www.dragados-canada.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Summary The Project Auditor contributes to the ongoing development of the construction project and ensures that the project conforms to the framework of corporate standards and procedures. This person is responsible for supervising and conducting audits on US project sites, and conducts final review of construction project records verifying contractor compliance with state and federal requirements.  The Project Auditor also ensures the development of proper auditing programs for projects and verifies all expenses and costs incurred. This person will be engaged in monitoring the records and documentation of the project performing different investigations that support value judgment and identifying unnecessary costs and expenses incurred. ResponsibilitiesDragados USA Inc. is an Equal Opportunity EmployerCarry out audits that observe with all relevant industry and project standards.Communicate with internal operations personnel to guarantee the maximum uptake of time & resources.Perform and review construction records audits and coordinates with area engineers on monthly and final estimates, change orders, supplemental agreements and work orders.Prepare related correspondence and reports.Perform final review of contracts. Preparing and maintaining records, files and reportsAdvise contractors' bookkeepers on record-keeping procedures.Identify gaps in the current construction activities and responsibilitiesPerforms procedures to assess construction work in progress and adherence to compliance requirements (change orders, progress reporting, project controls, contract accounting)Test financial controls for weakness and/or complianceReconcile contractor’s cost calculations. Verify cost calculations with contract terms.Recommend financial control improvementsAscertain procedural developments of the project with regards to the maintenance of records and documentsVerify different costs and expenses to ensure their justified investmentControl unnecessary expenses and ensuring quality standards and safetyIdentify information gaps and omission to check accurate management of the accounts RequirementsBachelor’s degree in Civil EngineeringMinimum of 10 years’ experience in Construction Auditing and investigative methods, practices and proceduresUnderstanding of US industry audit regulationsStatistical and analytical skills to perform auditing and project management functionsResearch aptitude with program administration abilitiesProfessional excellence in account management and report preparationExcellent interpersonal skills to communicate orally and writtenThorough understanding of projects and construction contractsCapable of handling multiple projects and assignmentsAbility to travel up to 60 - 75%"}