{"jobID": "2801428489", "jobLocation": "Santa_Clara_CA", "jobTitle": "Ride Electrician", "companyRating": null, "companyInfo": {"Website": "www.cagreatamerica.com", "Headquarters": "Santa Clara, CA", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Subsidiary or Business Segment", "Industry": " Arts, Entertainment & Recreation", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Overview Under occasional supervision, the Ride Electrician is responsible for inspecting, maintaining and repairing rides and equipment as assigned. Performs related duties as required such as down time calls. This position will report to the Ride Electrical/Control Foreperson.Qualifications • Ability to pass a mandatory (or random) drug test, per Company policy, unless prohibited by state or provincial law.  • Ability to pass a background check, if 18 years of age or older, which may include, but is not limited to, credit, criminal, DMV, previous employment, education and personal references, per Company policy, unless prohibited by federal, state, or provincial law.  • Ability to work nights, weekends and holiday periods to meet business needs.  • Must have a valid Driver's License.Responsibilities • Refers to policies and procedure manuals, maintenance manuals, technical manuals and diagrams, ride manuals, vendor catalogs, etc.  • Orders and assists in maintaining inventory of supplies, parts and materials.  • Maintains assigned equipment in a safe and proper working condition; maintains a clean and safe work area.  • Performs all work in accordance with department policies and procedures, regulations, plans and specifications, and standards of quality and safety.  • Prepares and/or maintains inspection sheets, daily work records, downtime records, modification forms, various other reports, records, logs, etc.  • Reviews technical documents, blueprints, schematics, catalogs, etc., as needed to support ride maintenance, repair and rehabilitation work.  • Modifies electrical/electronic systems as needed to ensure ride safety and efficiency  • Installs electrical conduit and wiring; cleans electrical equipment and components; maintains controls and motors on rides; maintains ride lighting; maintains ride solid state drives.  • Inspects, troubleshoots and repairs electrical work on rides, ride control systems, computer, and PLC.  • Provides guest service according to Cedar Fair standards when serving the guest or working with subordinates, including initiating guest interactions, answering questions and giving directions.  • Maintains cleanliness and safety in assigned work area and performs all duties in compliance with Cedar Fair Safety guidelines and requirements and reports all unsafe or unusual conditions to supervision.  • Meets scheduling availability requirements, including nights, weekends, and holiday periods to meet business needs.  • Meets Cedar Fair's attendance requirements as outlined in Cedar Fair's attendance policies.  • Adheres to Cedar Fair's Rules of Conduct including specific costuming and grooming standards as outlined in Employee Guidelines and other park/division specific policies and procedures.  • Other duties may be assigned.  • Must be able to communicate effectively and efficiently in a variety of technical and/or professional languages including mechanics, electrical, etc. Must be familiar with theme park ride maintenance terminology and safety hand signals.  • Requires the ability to apply rational systems to solve practical problems and deal with a variety of concrete variables in situations where only limited standardization exists; to interpret a variety of instructions furnished in written, oral, diagrammatic or schedule form. Requires the ability to learn and understand relatively complex principles and techniques; to make independent judgments in absence of supervision; to acquire knowledge of topics related to primary occupation. Must have the ability to comprehend and interpret received information.  • Requires the ability to inspect items for proper length, width and shape, and visually read various information."}