{"jobID": "2721306417", "jobLocation": "Menlo_Park_CA", "jobTitle": "Delivery Driver (Menlo Park)", "companyRating": "2.7", "companyInfo": {"Website": "www.munchery.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Restaurants, Bars & Food Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "14", "jobDescription": "About Us Munchery makes delicious, healthy, ready-to-eat meals and 15-minute cooking kits that are crafted by critically-acclaimed local chefs. Founded in 2011 and headquartered in San Francisco, Munchery is the leading end-to-end food preparation and delivery company with a service footprint of 25 million households in the U.S. With control of its entire food service value chain, Munchery has the capability to continuously improve multiple points of operations and deliver better- personalized food experiences from developing original recipes, sourcing fresh ingredients from local farmers and producers who practice organic and sustainable farming, creating incredible scratch-made dishes, packing using only environmentally-friendly materials, to delivering fresh meals directly to customers. What Youll Do As part of our Delivery Team, you are one of Muncherys brand ambassadorsthe face of Munchery! Our Delivery Team is the final step in our supply chain, hand-delivering our customers orders to their doors. Youre expected to represent Munchery as a high quality food company. Unlike other companies who hire drivers and couriers, you are an employee of Munchery, not a contractor. As Munchery employees, you get all the perks and benefits associated with being an employee! Shifts are scheduled 3:30pm to 8:00pm 7 days a weekMust be punctual and reliableDelivery team members must be available for 4 to 5 shifts per weekWhat Youll BringYour own, well-maintained carA valid drivers licenseClean driving record (no more than two points off)Have up to date liability and bodily injury insuranceYour own smartphone (iPhone or Android)Delivery drivers must be at least 21 years of ageGeographical knowledge of San FranciscoA personable attitude and a desire to please customersFluent in EnglishAbility to carry and lift 40lbs. Climb hills or stairs safely and quicklyWhat Would be GreatExperience as a delivery driverExperience working at an on-demand economy companyWhat Youll GetMunchery t-shirts!Competitive compensation packages, tips, and mileage reimbursement ($0.54/mile)Data reimbursementEmployee Discount Program (never worry about dinner again)"}