{"jobID": "2723097173", "jobLocation": "Kirkland_WA", "jobTitle": "Security Engineer Intern, Summer", "companyRating": "4.4", "companyInfo": {"Website": "www.google.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (GOOG) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Apple, Facebook"}, "estimatedSalary": "79000", "jobDescription": "Applications are now closed. Please check back in late 2018 for future openings.Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; Kirkland, WA, USAJoin us for a unique 12-14 week internship that will take place Summer 2018.  Our team will review applications on a rolling basis and it's in your best interest to apply early. All hiring will be completed by March 2018. Thank you for your patience while we consider your application.  At Google, our users come first, and the Systems Infrastructure team is at the heart of that promise. We build the technologies that transform the way we think about doing business. Whether working on our cloud systems, researching the latest in computer technology or keeping Google's internal systems humming, Googlers and users alike rely on us to keep things running. We're back-end experts: protecting your privacy and ensuring your security.  There's no such thing as a \"safe system\" - only safer systems. Our Security team works to create and maintain the safest operating environment for Google's users and developers. As a Security Engineer Intern, you help protect network boundaries, keep computer systems and network devices hardened against attacks and provide security services to protect highly sensitive data like passwords and customer information. Security Engineers work with a broad range of devices, actively monitoring our systems for attacks and intrusions. We focus on the offensive/testing side and work with software engineers to proactively identify and fix security flaws and vulnerabilities. We also build tools, scripts and other automation to help our project teams achieve Google-scale impact.  Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From AdWords to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another. Responsibilities Responsibilities may vary by area. Qualifications Minimum qualifications:"}