{"jobID": "2756900370", "jobLocation": "Seattle_WA", "jobTitle": "Engineering Data Analyst (CE, Asst I)", "companyRating": "3.3", "companyInfo": {"Website": "www.seattle.gov", "Headquarters": "Seattle, WA", "Size": "1001 to 5000 employees", "Founded": " 1869", "Type": " Government", "Industry": " Government", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "62000", "jobDescription": "Position DescriptionThe Transportation Operations division of the Seattle Department of Transportation (SDOT) presents an exceptional opportunity working with a team of professionals focused on creating a safe, interconnected, vibrant, affordable, and innovative city for all. Reporting to the Traffic Data & Records Supervisor, the Engineering Data Analyst will conduct traffic engineering studies on traffic flow, traffic accident locations, and other traffic related matters. The position also assists in the planning, development, justification, and implementation of various data gathering projects related to transportation, traffic, data analytics, data visualization, and smart cities topics.Job ResponsibilitiesProvide essential functions for the Traffic Data and Records group including responsibility for the expanding pedestrian and bike data program. Specific job responsibilities include:  Conduct traffic engineering studies on traffic flow, traffic accident locations, parking, and other traffic related matters Assist in the planning, development, justification, and implementation of various data gathering projects related to transportation, traffic, data analytics, data visualization, and smart cities topics Analyze data for completeness and statistical feasibility Select appropriate methods of presenting data and prepares charts, spreadsheets, graphs, maps, statistical tables, and other visual aids as necessary Assist in the design and development of information databases and spreadsheets Support on-demand, large-scale, exploratory, and targeted data research and analysis Assist with the installation of traffic data collection equipment in the field as required, and compile information from a variety of devices Organize and maintain reporting and public distribution system for the division's traffic data, including online distribution through the SDOT website and data.seattle.gov Update the asset management system regarding traffic collisions, sign creation, and road modification Participate in presentations, special projects, and other assignments as directed Meet with community groups and representatives of other agencies and City departments to discuss current or proposed projects Support department goals in promoting diversity and social justice These responsibilities are only a summary of typical functions of the job and are not intended to be an exhaustive or comprehensive list of all possible job responsibilities, tasks, and duties. May perform other duties as assigned. Qualifications Required Qualifications :  Bachelor's degree in Civil Engineering, Civil Engineering Technology, or a related field Ability to effectively work in a multicultural workplace with a diverse customer base Other combinations of education, training, and/or experience that provide an equivalent background required to perform the work of the class may be evaluated on an individual basis for comparability.  Required Certifications/Licenses : Current Washington State driver's license or evidence of equivalent mobility.  Desired Qualifications : Experience in research, data collection, writing summaries, and visualizing data Experience in data analytics and statistical modeling using R, Python, SQL, or other equivalent tools Experience with databases and data warehousing including organizing, compiling, manipulating, analyzing, and summarizing large datasets Excellent oral and written ability to communicate effectively with other professionals and all levels within the organization and the ability to present research findings effectively Experience with GIS (Geographic Information System), spatial analysis, cartography, and mapping Strong analytical, problem-solving, and organizational skills, together with an ability to take initiative, multi-task, and work under time constraints Ability to work independently and/or in a team environment and under minimal supervision At least one year of experience in right-of-way engineering Able to read/understand plans and construction standards Proficient in Microsoft Word, Excel, and PowerPoint Multilingual Work Environment/Physical Demands : Most work will be performed in a normal City office environment; however, may be required to work nights, evenings, weekends, and holidays and in field assignments with exposure to all types of weather, traffic conditions, hazardous/toxic substances, and construction sites. May be required to lift over 50lbs and stand, walk, or bend for extended periods of time. Overnight travel may be required. Additional Information Application Process :  Applications are reviewed after the job posting closes. Complete or submit the following to be considered for this outstanding opportunity:  NEOGOV online (or paper) application Supplemental questionnaire A cover letter AND rsum Your application may be rejected if these items are missing or incomplete. Simply providing a cover letter and rsum is not a substitute for completing the application itself.  Job offer is contingent upon verification of credentials and other information required by the employment process and may include an oral interview, reference and criminal history background check, medical exam, and a review of driving history.  Learn more about Seattle Department of Transportation by visiting our webpage .  The City of Seattle offers a comprehensive benefits package including vacation, holiday and sick leave as well as medical, dental, vision, life and long-term disability insurance for employees and their dependents.  More information about employee benefits is available on the City's website at: http://www.seattle.gov/jobs/benefits.asp"}