{"jobID": "2829184128", "jobLocation": "San_Jose_CA", "jobTitle": "Installation Technician", "companyRating": null, "companyInfo": {"Website": "www.imperialsupplies.com", "Headquarters": "Green Bay, WI", "Size": "501 to 1000 employees", "Founded": " 1958", "Type": " Subsidiary or Business Segment", "Industry": " Construction, Repair & Maintenance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Fastenal, Wurth USA, MSC Industrial Direct"}, "estimatedSalary": null, "jobDescription": " Imperial Supplies, a W.W. Grainger company, is a national distributor of quality maintenance products. Serving the fleet maintenance industry since 1958, Imperial has formed lasting relationships with customers by tailoring our services to meet their changing needs.  With more National Account Programs in the fleet industry than all of our competition combined, we are recognized for innovative technology and solutions that reduce costs through efficient ordering methods and stringent controls. Do you enjoy traveling, working independently, and enhancing the customer experience? If so, we may have the position for you… Installation Technicians travel to customers’ maintenance/shop facilities to perform shop set-ups. Duties include: assembling and installing steel binscleaning, organizing, identifying, and labeling Imperial’s productstraining the customer on proper use of equipment Position Description 90% travel Monday through Friday including overnight stays (flying and/or driving)Strong communication and computer skillsPhysical requirements include standing majority of time, ability to lift 75 lbs., carry 50 lbs., and push/pull 100 lbs. Manual dexterity including stooping, kneeling, crouching, crawling, reaching, and handling small parts required.High school diploma / GED equivalentValid driver’s license Imperial offers A competitive wage and industry leading benefits including immediate health, dental, vision, life, and disability insurance.Excellent work-life balance, 18 days paid time off plus paid holidaysGenerous profit sharing and 401K programsEducation reimbursement and opportunities for internal advancement & professional growth EEOC Statement Imperial is an Equal Opportunity Workplace and an Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status.Nearest Major Market: San Jose Nearest Secondary Market: Palo Alto Job Segment: Technician, Technology"}