{"jobID": "2796990383", "jobLocation": "Torrance_CA", "jobTitle": "ERP Consultant Intern", "companyRating": "3.7", "companyInfo": {"Website": "www.calsoft.com", "Headquarters": "Torrance, CA", "Size": "51 to 200 employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "19", "jobDescription": "JOB TITLE: ERP Consultant – Intern  Calsoft Systems is seeking talented, motivated and entrepreneurial candidates who are passionate in learning about consulting, business and technology. We are currently accepting applications for an ERP Functional Consultant intern for our office in Torrance, CA.  Our ERP Consultant intern will be assigned specific job tasks and projects during the internship period. We are seeking interns who will assist in implementing and providing support of Enterprise Resource Planning (ERP) solutions for our global clients, ensuring the system is meeting business needs. The ERP Consultant will work directly with clients to define requirements, design solutions, configure, train, and implement ERP.  This internship offers candidates an opportunity to become experts in business applications, expose them to global business, and deepen their knowledge of the various industries, particularly distribution and logistics. Job Description Summary: Provides support and assistance to the ERP Consultant in 1.) implementing and maintaining Enterprise Resource Planning (ERP) systems, 2.) customizing and configuring workflow to allow the integration of systems, and 3.) testing ERP functions to ensure the system is meeting customer’s business and functional requirements. II. Job Responsibilities and Duties: The intern will assist the ERP Consultant in the following duties: Identify ERP business systems solutions requirements by interviewing clients; analyzing work processes and operations; establishing solution objectives; preparing specifications.Implement and support ERP (Dynamics GP, NAV, AX and D365) for new and existing customers, including design, product configuration, testing, data conversion, user acceptance test and go live support.Gather information for the development of custom applications to complement or integrate with existing software.Assist in various tasks involving other departments within the company such as helpdesk, sales, development, network, and ERP team.Follow Calsoft’s Project Charter and implementation methodology, produce the deliverables it stipulates, and ensure project documents are complete.Rely on instructions and pre-established guidelines to perform the functions of the job.Work under immediate supervision; Report to project lead or department manager.Learn new applications as needed."}