{"jobID": "2819203905", "jobLocation": "Bellevue_WA", "jobTitle": "Junior Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.ispot.tv", "Headquarters": "Bellevue, WA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We have a product that is changing how brands, agencies and networks measure and assess the impact of TV advertising campaigns. Our software uses proprietary audio and video analysis to monitor and extract TV commercials, movie trailers and other promotional content from TV. At the same time, our software analyzes consumer interactions with TV ads on the digital screen across search, video and social. Interactions are matched with specific ads and attributed back to airings on TV. Our platform collects and analyzes massive amounts of data in real-time.  This is a rare opportunity to get equity in the early stages of a company with significant early traction and which is run by an experienced team.  We are looking for someone that is highly motivated and knows how to get things done quickly and efficiently. We are seeking a talent who will share our obsession for data accuracy; someone with an insatiable appetite for learning new things and accomplishing challenging goals in a fast-paced (and not always structured) environment. Responsibilities:Understand, inside and out, all data streams collected, calculated, and attributed by iSpot.Use our in-house tools to provide quality assurance for ads and their metadata.Communicate bugs and alerts to Engineering teams, Customer Success, and management.Interest in learning SQL to query against MySQL and Redshift schema for quality assurance purposes. Besides being highly motivated and valuing the significant equity opportunity, we are looking for someone who has: Strong attention to detail.Experience with Excel.The ability to work quickly and efficiently with minimal supervision.Strong communication skills.The ability to multi-task and work well under deadlines in a changing environment.Strong interest in building their analytics skills using SQL, Tableau, and Excel.Ability to work an adjusted Tuesday-Saturday schedule.Passion for data accuracy."}