{"jobID": "2824401524", "jobLocation": "Seattle_WA", "jobTitle": "(USA-WA-Seattle) Data Scientist/Quantitative Analyst Intern, Summer", "companyRating": "4.4", "companyInfo": {"Website": "www.google.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (GOOG) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Apple, Facebook"}, "estimatedSalary": "119000", "jobDescription": " Applications are now closed. Please check back next year for 2019 opportunities.  Note: By applying to this position your application is automatically submitted to the following locations: Seattle, WA, USA; Mountain View, CA, USA; New York, NY, USA  Google's statisticians and quantitative analysts work within our Software Engineering organization, including Life Sciences, Geo, Project Aura, Technical Infrastructure, and Advertising. We analyze huge sets of data and continually run live experiments in order to help drive critical decisions at Google. Specifically, we support the development of innovative, highly scalable, next-generation technologies through deep research and advanced analysis.  Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From AdWords to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.  ## Responsibilities Provide research on topics including Google's business model and novel search techniques.Produce quantitative and qualitative modeling of business dynamics, user behavior, etc.Identify areas for further investigation as well as creating innovative methods of analysis. ## Qualifications Minimum qualifications:Currently pursuing a PhD in statistics, biostatistics, computer science, mathematics, operations research, or another discipline involving experimental design and quantitative analysis of experimental data.Must be enrolled in a full-time degree program and returning to the program after the end of the internship.Experience using technology to work with datasets such as scripting, Python, statistical software packages (R, S-Plus, SAS or similar).Preferred qualifications:Expected graduation date in late 2018 or Spring/Summer of 2019.Experience with statistical data analysis such as linear models, multivariate analysis, stochastic models, and sampling methods.Strong track record of developing intellectual capital such as published works.Authorization to work in the United States.* * At Google, we dont just accept difference - we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you have a disability or special need that requires accommodation, please let us know.  To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees or any other company location. Google is not responsible for any fees related to unsolicited resumes."}