{"jobID": "2506644856", "jobLocation": "New_York_NY", "jobTitle": "Attending OB/GYN", "companyRating": null, "companyInfo": {"Website": "www.pagny.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Overview Physician Affiliate Group of New York (PAGNY) is comprised of nearly 4,000 physicians and healthcare professionals who provide services to NYC Health + Hospitals, the largest public health system in the United States. Our practitioners are highly skilled professionals with outstanding credentials who deliver the highest level of quality healthcare to patients throughout New York City. NYC Health + Hospitals/North Central Bronx is a modern, state-of-the-art community hospital located in an attractive and safe residential Bronx neighborhood just 20 minutes north of Manhattan. It is a North Bronx Healthcare Network hospital affiliated with Jacobi Medical Center and a teaching site and academic affiliate of the Albert Einstein College of Medicine. It offers a full continuum of acute care inpatient and outpatient services in diverse medical and surgical specialties, including psychiatry. The department of psychiatry has 70 adult and geriatric acute inpatient beds, a partial hospital program, psychiatric emergency and consultation-liaison services, an adult ambulatory practice, and a community-based assertive community treatment program. The department employs evidenced-based best practices in providing the highest quality care to its patients, in a patient-centered approach that is respectful of their individuality, culture, and community. Responsibilities Attending in the OB/GYN needed. This generalist position will cover in house, outpatient and operative room duties. The hours are a critical part of our 24/7 coverage of Labor and Delivery, Emergency Services and the OR.  This position offers a competitive salary with an excellent benefits package! QualificationsMedical Degree (MD)Board Eligible or Board CertifiedMust qualify for NY State Medical LicenseEOE M/F/D/V"}