{"jobID": "2815742740", "jobLocation": "Long_Island_City_NY", "jobTitle": "Field Service Representative", "companyRating": "2.9", "companyInfo": {"Website": "www.kasco.com", "Headquarters": "Saint Louis, MO", "Size": "51 to 200 employees", "Founded": " 1901", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "44000", "jobDescription": " For more than 110 years, KASCO has been the industry leader in providing quality products, parts, repairs, and service to the meat processing and retail institutional food industries. Our cutting edge products include band saw blades, meat grinder plates and knives, and cutlery. We also offer a vast range of butcher supplies, seasonings, replacement parts, and repair services to grocers, restaurants, and meat, seafood, deli and bakery departments. Summary: Responsible for all areas of field services repair and product delivery and supplies to customer locations, maintaining and repairing equipment, making sure the overall needs of each customer are met, and representing KASCO LLC. in a professional and experienced manner.  ESSENTIAL DUTIES AND RESPONSIBILITIES include the following. Other duties may be assigned. Performs all maintenance and preventative maintenance, such as troubleshooting and repair on food processing equipment, including band saws, juicers, meat grinders, slicers, tenderizers, etc.Performs safety audits on customer's equipment.Maximize sales dollars of KASCO services customer calls by delivering/sale of KASCO products and full line of repair services to targeted customers.Prospects independent specialty stores, small packers and small chains in territory for new business.Sell special programs created and provided by KASCO.Provide technical support to customers on proper use of equipment.Maintain control of inventory including predetermined level of inventory at each customer location. Forecast and maintain KASCO determined level of inventory in field warehouse and truck. Place reorders (per guidelines) with KASCO headquarters in a manner insuring timely and economical receipt of products. Order parts on a timely basis to have inventory available to service customers.Manage route territory according to established schedule, including the number of stops, and the amount of time spent at each stop. Keep territory on schedule.Provide special and emergency calls in a timely fashion to assure maximum service and customer satisfaction.Provide effective administration of the order processing and invoice collection. Through use of laptop computer or tablet or Palm, produce invoicing at store level. For accounts below minimum billing levels, collect payment on delivery of service and properly remit to KASCO headquarters in a timely manner.Maintain a safe work environment. Adhere to all Company and federal and state safety regulations. Operate vehicle in a safe and courteous manner. Maintains service vehicle according to Company policy. Adheres to all company policies and procedures.Provide an effective, professional and visible external professional image of KASCO in accordance with company programs and policy which includes:Uniform wearing - clean clothing, proper steel toed shoesClean and organized van, inside and out. Van stocked with proper tools, product, etcProfessional personal communicationsQUALIFICATION REQUIREMENTS: To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill and/or ability required. Reasonable accommodations may be made to enable inidividuals with disabilities to perform the essential functions. EDUCATION and/or EXPERIENCE:Accredited High School diploma, Business or trade school or GED.Excellent mechanical/electrical/electronic aptitude.Related technician repair skills. OTHER SKILLS and ABILITIES Ability to sellStrong interpersonal skills - Able to create relationshipsGood rapport building skillsSelf driven / self starter - Able to work with little direct supervisionGoal orientedHigh self esteemEntrepreneurial driveGood listenerProfessional appearanceProfessional demeanorHigh attention to detailTime SensitiveFollows through with assignmentsHigh integrity/honestyFinancially responsibleFollows directionsSafe driver Technical skills: Essentials Mechanical aptitude - able to comprehend technically KASCO's service program.Proficient with tools and demonstrated ability to repair things.Basic electrical knowledge.Ability to read and interpret machine schematic drawings.Able to orderr and deliver repair items.Ability to operate an electronic tablet, laptop computer, and a smart phone.Ability to learn new technology and repair and service procedures and specifications.Able to manage the details of van inventory maintenance and replenishment.Invoice preparation and checking mathematical aptitude.LANGUAGE SKILLS: To read and interpret documents such as safety rules, operating and maintenance instructions, and procedure manuals. To write routine reports and correspondence. Ability to speak effectively before customers. REASONING ABILITY: Ability to deal with problems involving a few concrete variables in standardized situations. Ability to define problems, collects data, establish facts, and draw valid conclusions. Ability to interpret and extensive variety of technical instructions in mathematical or diagram form and deal with several abstract and concrete variables. CERTIFICATES, LICENSES, REGISTRATIONS: Valid, clear driver's license in the state he/she resides.  PHYSICAL DEMANDS: The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  While performing the duties of this job, the employee is occasionally required to stand; walk; sit. Regularly use hands to finger, use, handle, or feed objects, tools, or controls; reach with hands and arms; stoop, kneel, crouch, or crawl; and talk or hear.  The employee must occasionally life and/or move up to 100 pounds from floor to waist and 50 lbs. from waist to chest unassisted. Specific vision abilities required by this job include close vision, depth perception, color identification and the ability to adjust focus.  The employee must be able to drive KASCO van or truck between customer stops and customer stops to warehouse.  WORK ENVIRONMENT: The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  While performing the duties of this job, the employee regularly works near moving mechanical parts and is occasionally exposed to risk of electrical shock.  The noise level in the work environment is usually moderate.  Will work in wise varying temperatures - loading / unloading van in outside non-climate controlled temps; working in refrigerated meat rooms.  Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}