{"jobID": "2759363746", "jobLocation": "Cambridge_MA", "jobTitle": "Associate Director, Product Public Relations", "companyRating": "5.0", "companyInfo": {"Website": "www.sagerx.com", "Headquarters": "Cambridge, MA", "Size": "201 to 500 employees", "Founded": " 2010", "Type": " Company - Public (SAGE) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "84000", "jobDescription": "General Scope and Summary Sage is searching for an Associate Director/Director, product public relations, who will lead public relations initiatives for brexanolone IV as a potential treatment for postpartum depression (PPD). The Associate Director/Director, product public relations, will be a key member of the Corporate Communications team and serve as a partner with the brexanolone commercial team. The ideal candidate will have had experience supporting the FDA market clearance and commercial launch of prescription drugs, will be skilled at interacting with senior leaders at a public biotech/pharmaceutical company and work successfully with cross-functional partners and key stakeholders throughout (e.g., commercial, medical, legal/regulatory). Excellent writing and presentation skills are a must.  The position requires an individual who can work productively in a fully matrixed team environment and is confident in their ability to provide thoughtful communication counsel to all levels within the organization. Roles and ResponsibilitiesPartner with the commercial, medical affairs and patient advocacy organizations at Sage to develop and drive external communications plans in support of the potential launch of brexanolone;Oversee development and implementation of branded PR plan to strengthen brand awareness and reputation among stakeholders;Manage agency PR partners to ensure activities (unbranded and branded) adhere to regulatory and legal guidelines, in line with product communication strategy, are completed on-time and within budget, and that the agency has access to the necessary tools and information to successfully complete assignments;Manage incoming media requests under deadline and conduct proactive outreach to key media stakeholders, including journalists, bloggers, and relevant influencers;Craft story angles, identify media targets and pitch stories for specific campaigns;Manage and contribute to the development of a broad spectrum of communications materials, including press releases, Q&A; documents, presentations, fact sheets, video scripts, speeches and briefing documents;Manage the internal review process for external PR communications materials;Conduct briefings with the corporate communications team (PR and IR) to ensure alignment of external messages across audiencesExperience, Education and Specialized Knowledge and Skills This position requires someone who thrives working in a fast-paced, innovative environment while remaining flexible, proactive, resourceful and efficient.  The successful candidate will have: Track record of success (including metrics) building and effectively implementing branded PR initiatives for prescription drugs; experience in central nervous system disorders, women’s health and/or mental health a plus;Ability to communicate complex issues in a simple way and identify innovative communication channels to deliver messages to key stakeholders;Working knowledge of FDA and EMA regulations as applied to the communication of investigational and marketed drugs; familiarity with drug industry reimbursement; and a good understanding of public policy challenges currently affecting the healthcare industry;Excellent interpersonal skills with significant experience working with all levels of management and consulting with key business stakeholders;Outstanding time management and organizational skills;Ability to execute on multiple activities and meet aggressive deadlines, on time and within budget;Strong skills of persuasion and ability to direct cross-functional activities to successful conclusion;An exceptional attention to detail and the ability to work individually, within a multi-disciplinary team, as well as with external partners and vendors;Exceptional team player that revels in the spirit of collaboration; practices a customer service approach in colleague interactions and is solution-orientedBS/BA with 8-10 years of experience in corporate communications, including in-house role at pharma or biotech company or healthcare agency experience.Embrace our core values: Put People First, Do Big, Be Accountable, Grow through Learning and Change, and Work Fun.Excitement about the vision and mission of Sage."}