{"jobID": "2614264218", "jobLocation": "San_Francisco_CA", "jobTitle": "Lead Data Scientist - Mobile Gaming", "companyRating": "3.7", "companyInfo": {"Website": "www.productmadness.com", "Headquarters": "London, United Kingdom", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "116000", "jobDescription": "Role Purpose Product Madness is bringing some of the best and most engaging slot machines online and to mobile and we want you to join our world class insights and analytics team. We are looking for driven and intelligent individuals to increase our data analytics capabilities, partnering with internal teams to tell a story on customer behavior and provide clarity using insights from large amounts of data. As a manager of our data science team you will lead a team of data scientists to help build and analyze customer insights, predictive analytics and behavioral modelling projects that will encourage users to play our games more often and over longer periods of time. This role will report to our VP of Marketing along with an indirect report to our Director of Data Science. This role will work with the teams here in San Francisco along with our global team located in London. Role AccountabilitiesLead deep-dive research projects, such as detailed product analysis, customer segmentation or customer lifetime value predictive modellingProvide actionable insights for product management and marketing teamsCreate new ETL jobs, build predictive models, make new data visualizationsPartner with internal teams to define analytics requirementsLead a team of 3+ Data ScientistsImprove platform performance and link between practical product outcomes and customer strategies.Work with cross functional departments to provide insights and analytical data to optimize performanceExperience & QualificationsBachelors or higher in Applied Math, Statistics, Computer Science, or related field preferred4+ years working experience2+ years of experience in quantitative analysis, specific experience with social games or mobile apps strongly preferredExperience with training and working as a team leadHighly analytical and structured thinkingExperience with PyData stack - pandas, scipy, seaborn, ipynb. Knowledge of other technologies/languages is a plus (R/Shiny, Scala, Java, Julia, Lua, etc.)SQL expertExperience with modern interactive data visualization tools, such as D3.js, Bokeh, highcharts others.Some experience with any BI tool (Tableau, Qlikview, Microstrategy, etc.)A strong disposition for data-driven decision makingA passion for analyzing consumer behavior in a fast-moving online businessOur Tech-Stack:DWH: AWS RedshiftAnalytics: SQL, jupyter/ipython notebooks, re.dash, tableauETL: Kinesis, Python, Spark, SQLDashboarding: D3.js, re.dash, TableauMachine Learning: scikit-learn, pymc3Infrastructure: Docker, EC2, Elastic BeanstalkWhy Work Here?We are located in San Francisco downtown, close to Union Square (walking distance to Bart station) in an open layout officeWe have an open, creative culture with great opportunities for growth.We like to work hard, but also have funYour work will have a direct impact. We have built most of our systems based on the inputs of our team membersCatered lunch at least once a weekUnlimited snacks and drinks provided at the office (we like to eat!)Happy hour FridaysCompetitive Health, Vision and Dental Insurance401k Retirement Plan (Includes employer match contribution) Product Madness dedication to promoting diversity, multiculturalism, and inclusion is  clearly reflected in all our content and across all our platforms. Diversity is more than a  commitment at Product Madnessit is the foundation of what we do. We are fully  focused on equality and believe deeply in diversity of race, gender, sexual orientation,  religion, ethnicity, national origin and all the other fascinating characteristics that make  us different."}