{"jobID": "2814410642", "jobLocation": "Waltham_MA", "jobTitle": "Senior Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.wolterskluwer.com", "Headquarters": "Alphen aan den Rijn, Netherlands", "Size": "10000+ employees", "Founded": " 1836", "Type": " Company - Public (WKL) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Thomson Reuters, Pearson"}, "estimatedSalary": "75000", "jobDescription": " Wolters Kluwer (www.wolterskluwer.com) is a global leader in professional information services. Professionals in the areas of legal, business, tax, accounting, finance, audit, risk, compliance and healthcare rely on Wolters Kluwer's market leading information-enabled tools and software solutions to manage their business efficiently, deliver results to their clients, and succeed in an ever more dynamic world. Wolters Kluwer combines deep domain knowledge with specialized technology. Our portfolio offers software tools coupled with content and services that customers need to make decisions with confidence. Every day, our customers make critical decisions to help save lives, improve the way we do business, build better judicial and regulatory systems. We help them get it right. Responsibilities:Function as a primary analytics and reporting specialist for the HR function by developing standard reports; design, run and maintain ad hoc queries; maintain data integrity through consistent monitoring, testing, and auditing of Human Resources dataUtilize data, research and analytical insights to improve existing and build new Human Resources programs with maximum business impactProvide analytical and reporting support and make recommendations to improve the type and quality of data availableLead Wolters Kluwer's Health Division's efforts to prepare for the implementation of a Global HCM and global payroll process, including the data collection and validation for building the pre-production and final instance of the HCMConduct data analyses, such as regression analysis, factor analysis, multilevel analysis, decision tree and longitudinal analysisDevelop a full and detailed understanding of human capital data available across the enterprise including familiarity with all the systems involved in maintaining that dataDevelop the expertise to be able to access data and report from all platforms and consolidate data into meaningful reports/presentationFunction as the point of contact for existing Global Dashboards and supporting processesA minimum of 5 years of relevant work experience, preferably in a multinational setting within finance, business intelligence, sales operations, workforce planning, actuary, or statistical analysisBachelor's degree from an accredited college/university or equivalent, relevant work experienceAbility to work in a customer-facing, consultative role building effective relationships as a partner who adds value to the businessProficient with Microsoft Office Suite applications including Word, Excel, Access and Outlook; advanced proficiency in MS Excel and MS Access including formulas, pivot tables, charts, macros, queries, and data collection/importExperience with advanced analysis (e.g. predictive) and familiarity with statistical packagesExperience using Workday and participation in an HCM implementation with a large, global organization preferredFamiliarity with business informatics and intelligence tools, such as Tableau and Business Objects preferredFlexibility to travel if required (minimal) Wolters Kluwer N.V. (AEX: WKL) is a global leader in information services and solutions for professionals in the health, tax and accounting, risk and compliance, finance and legal sectors. We help our customers make critical decisions every day by providing expert solutions that combine deep domain knowledge with specialized technology and services.  Wolters Kluwer reported 2017 annual revenues of 4.4billion. The company, headquartered in Alphen aan den Rijn, the Netherlands, serves customers in over 180 countries, maintains operations in over 40 countries and employs 19,000 people worldwide. Wolters Kluwer shares are listed on Euronext Amsterdam (WKL) and are included in the AEX and Euronext 100 indices.  For more information about our solutions and organization, visit www.wolterskluwer.com, follow us on Twitter, Facebook, and LinkedIn EQUAL EMPLOYMENT OPPORTUNITY Wolters Kluwer U. S. Corporation and all of its subsidiaries, divisions and c"}