{"jobID": "2813081949", "jobLocation": "San_Jose_CA", "jobTitle": "Associate Business Manager", "companyRating": "3.2", "companyInfo": {"Website": "www.westerndental.com", "Headquarters": "Orange, CA", "Size": "5001 to 10000 employees", "Founded": " 1903", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " InterDent"}, "estimatedSalary": "56000", "jobDescription": " Requisition Number 18-1763 Title Associate Business Manager City San Jose State CA Zip Code 95112 Descriptionhas been the fastest growing industry over the past decade and within , Dentistry is projected to be the third fastest growing sector in 2018. There has never been a better time to join the dental field. Western Dental Services is a great example of this  growth as it builds upon its expansion of offices in 2017. As we continue our growth in 2018 Western Dental Services is in need of talented, passionate and business-minded individuals to join our organization as an Associate Business Manager and help lead  one of our teams in several new and existing offices in the Northern California region.  Are you interested in getting into the healthcare industry? Would you like to work for a company focused on your success as you gain new knowledge, skills and abilities that will help you now as well as later in your career? As an Associate Business Manager  you have the opportunity to learn how to run a fully functioning dental practice before having to assume the responsibility of actually running the business.  In this role you will be responsible for learning daily non-clinical operations of an assigned office, including patient satisfaction, revenue, profitability, non-clinical team selection, performance, development and other business-related functions as overseen  by a direct supervisor. You will also greet patients, introduce them to the office, coordinate treatment services, and nurture the patient relationship. The Associate Business Manager must be a strong communicator with a passion for providing excellent customer  service. Job Responsibilities:Assisting patients to complete doctor-prescribed treatment plans; helping patients get the care they needGreet and check-in patients in a friendly manner.Schedule and confirm patient appointments.Prepare new patient electronic charts accurately and efficiently.Collect and post payments and record receipts.Balance nightly deposits and complete credit card processing.Executes patient consults to ensure patients understand doctor-prescribed treatment plans; conducts patient chart audits, performs handoffs, conducts consult according to company policies, enters and updates patient treatment plans at the direction of the  treating doctor using the company practice management software, and follows up with patients during subsequent visits to schedule open treatment.Works with the doctor and patient to ensure the patient completes the doctor-prescribed treatment plan; uncovers and removes the patient's barriers for completing treatment; alerts the doctor when the patient has clinical questions; educates the patient  regarding insurance benefits and affordable payment options, including third-party patient financing; follows up with the patient during subsequent patient visits to review completed treatment and schedule appointments for open treatment. RequirementsQualifications:2-5 years of experience in a sales or retail environment, some combination of management and sales preferredFour-year college degree required.Demonstrates the ability to solve common problems and to provide immediate solutions.Excellent organizational skills to effectively handle multiple tasks.Benefits of joining Western Dental Services:Medical, Dental & Vision plans401K retirement plan with planning assistancePaid Time OffOpportunities to advance Once the training has been completed the incumbent will be prepared to assume a Business Manager role and be assigned to one of our clinics to assume the leadership responsibility alongside the Managing Doctor of the practice and help guide the office to  operational and clinical success. Promotions are based on the availability of an open position and need of the company as well as the incumbent’s overall performance. Promotions are not guaranteed based solely on the completion of training.  We are always looking for qualified candidates to join our team. Please submit your resume to oalahmadi@westerndental.com"}