{"jobID": "2727987321", "jobLocation": "Kirkland_WA", "jobTitle": "Business Data Analyst 1 2018", "companyRating": "3.9", "companyInfo": {"Website": "www.astronics.com", "Headquarters": "East Aurora, NY", "Size": "1001 to 5000 employees", "Founded": " 1968", "Type": " Company - Public (ATRO) ", "Industry": " Construction, Repair & Maintenance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Goodrich, Ultra Electronics"}, "estimatedSalary": "65000", "jobDescription": " Astronics Advanced Electronic Systems (AES) is a division of Astronics Corporation (ATRO). AES is an industry leader in aircraft electrical power systems, including generation and distribution. Our markets include commercial transport (Boeing and Airbus), business jet (several), and military platforms. We are the world leader in in-seat power for laptops and other devices with our EMPOWER? product line. We are also a leading innovator of electronic circuit breakers and power distribution systems for business jets with our COREPOWER? product line. Astronics? revenues have grown at 28% average growth rate over the last 5 years. AES, based in Kirkland Washington, has over 500 employees, and has won awards as the best place to work on the Seattle Eastside for 11 years consecutively.  ? JOB SUMMARY? The overriding business objective for the Business Analyst I will be Metric Monitoring.? The key performance objectives for this position are described below:?Accurately measuring current status and change (positive or negative) of material driving in our business proposal/program tool (Ops Log)  ?Accurate creating/reporting of our key program metrics  ?Develop and monitor metrics  ?Monitor business proposal/program backlog and report on accuracy/changes  ?Identify opportunities for improved business systems and document scope  ?Update data packages for customers  ?Grow/maintain Sharepoint site to ensure access to information/templates/metrics etc.  ?MINIMUM QUALIFICATIONS: ? Analytical skills?Ability to see patterns and trends in data, understand underlying causes/factors, and make logical conclusions based on facts or extrapolation of data. ? Communication?Strong written and verbal communication skills. ? Mathematical skills?Moderate skill with statistical analysis and experience with tools used to calculate things such as mean/median/mode, probabilities, confidence levels, standard deviation. ? Scope identification?Ability to identify a business problem solved best by a business system and write an executable scope for information technology specialists/personnel. ? Attention to detail?Data/metrics used drive business decisions, so must have attention to detail and ability to identify possible risk/inaccuracies or level of uncertainty. ? Ability to thrive/accept ambiguity?Must be OK with dealing with complex problems with imperfect information and no clear solution. ? Process efficiency?Able to distill a business process down to its simplest elements, document the process and make it repeatable. ? Bachelor?s degree in Business, Economics, Social Science, Math, or Engineering  Applicable experience may be substituted for Bachelor?s Degree.? ? ?  In summary, the successful candidate will have a significant impact to the growth of Astronics.?? This is an exciting position within a dynamic company that is excited about the long-term growth of aircraft electrical power systems and the long-term career development that can coincide with that growth.  ?  Eligibility Requirement: Must be a US Person (under ITAR rules) to be eligible  Astronics AES is an Equal Employment Opportunity employer.? All qualified applicants will receive consideration for employment without regard to race, color, sex, sexual orientation, gender identity, religion, national origin, disability, veteran status, or other legally protected status.  ?  Astronics AES is committed to working with and providing reasonable accommodation to individuals with physical and mental disabilities.  ?  If you need special assistance or an accommodation while seeking employment, please e-mail recruiting@astronics.com or call: 425-881-1700. We will make a determination on your request for reasonable accommodation on a case-by-case basis."}