{"jobID": "2645522535", "jobLocation": "Boston_MA", "jobTitle": "Physical Therapy", "companyRating": null, "companyInfo": {"Website": "www.navy.com", "Headquarters": "San Diego, CA", "Size": "1001 to 5000 employees", "Founded": " 1775", "Type": " Government", "Industry": " Government", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " \"About This JobNavy Physical Therapists practice comprehensive rehabilitation for Sailors, Marines, their families and those in need around the globe. They enjoy the freedom to treat patients as they see fit, taking into account their best interests instead of limitations from civilian organizations or insurance companies.As an Officer and Clinical Care Provider, you will focus on preventing injuries, as well as helping people recover and recuperate from: Wartime, work-related or leisure-activity injuries  Musculoskeletal disorders or impairmentsYoull partner with first-rate health-care providers, such as physicians and occupational therapists. And youll assume a critical role in a multidisciplinary health-care team.You may even have unique opportunities to: Specialize in orthopedics, sports, electromyography and manual therapy Earn specialty certification and additional pay  Take on clinical and management positions throughout the world  Pursue advanced degrees in physical therapy or related fields, on a limited basisNavy Physical Therapists can practice physical therapy as they serve at any of more than 250 Navy and medical facilities around the globe. In some of the most dynamic environments imaginable, from Hawaii to Japan, Germany to Guam, and Washington, D.C., to Washington state.As a Physical Therapist, you could find yourself working at one of the highly acclaimed National Naval Medical Centers in Bethesda, Md.; Portsmouth, Va.; and San Diego, Calif. Or you could provide PT support to Navy and Marine Corps Special Operations Units, aircraft carriers or even aboard one of two dedicated hospital ships: the USNS Comfort and USNS Mercy.Upon completion of graduate school, those pursuing a Physical Therapist position are required to attend Officer Development School (ODS) in Newport, R.I. ODS is a five-week program that provides a comprehensive and intense introduction to the responsibilities of Navy Staff Corps Officers. Here they learn about the military structure of the U.S. Navy, its rich history of traditions and customs, leadership development and military etiquette.Promotion opportunities are regularly available but competitive and based on performance.\""}