{"jobID": "2808064051", "jobLocation": "Santa_Monica_CA", "jobTitle": "Senior Data Scientist (Contract)", "companyRating": "3.9", "companyInfo": {"Website": "www.activision.com", "Headquarters": "Santa Monica, CA", "Size": "1001 to 5000 employees", "Founded": " 1979", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Electronic Arts, Sony, Take-Two"}, "estimatedSalary": "146000", "jobDescription": "Data Scientist, Marketing AnalyticsWhat we’re looking for:Activision is actively investing in its audience capabilities in a way that will evolve the application of our data for use in product development, marketing, and monetization. We are looking for a thought-leader in analytical processes to lead this evolution.(Please note, this is a contract role, and while you will be working onsite at Activision, you will be legally employed by a third party - Volt Workforce Solutions)The Data Scientist, Marketing Analytics will work closely with Product, Marketing, Studios, Engineering and Technology organizations to deliver world-class advanced analytics analyses of marketing activities and estimating their impact on sales. These projects will include, but are not limited to, Media Mix Optimization, Analysis of Covariance (test & control), Cluster Analysis, Unsupervised and Supervised Learning, Attribution Modeling of disaggregate event-stream data. We have a tremendous amount of data on how gamers play our games. We need, however, an expert who has the passion, experience, skills and ability to turn that data into action.What you’ll do:Provide thought leadership in a number of areas, including customer segmentation, behavior based modeling (propensity, churn, LTV, etc.) data strategy and analytic approaches.Work with Sr. Management to answer strategic business questions through the use and modeling of behavioral data Develop 1-1 personalization approach utilizing a vast store of behavioral data Develop and execute testing and optimization plans for ongoing CRM campaignsIntegrate with and improve existing machine learning pipelines on propensity scoring and LTV projection to granularize the understanding of user journey and customer valueDrive the buildout and improvement of ETL pipelines in support of data aggregation, movement and analysisWork across multiple data sources (Web, in-game, CS) to develop a complete picture of gamer behaviorWhat you’ll bring:5+ years of experience in database mining/marketing with very large, complex and multi-dimensional datasets.2+ years of direct experience working in ad-tech with a proven track record of media mix optimizationThorough understanding and ability to apply supervised and unsupervised learning models.Must be able to synthesize disparate data to mine and communicate insightsExcellent collaboration and communication skills with a proven track record of working across all levels of the organization.Experience with large individual customer behavioral data sets (gaming, retail, financial services) and expertise in communication channel best practices, including multi-channel marketing.Technical mastery in advanced database mining tools such as SQL and SAS/R/Python (any of the three) with the ability to coach and train others on best practice.Preferred experience working with Data Management Platforms, such as Adobe Audience ManagerGaming experience particularly with the Call of Duty franchise a strong plusExceptional data analysis in Excel including ability to write macros Ask anyone:Who works at Activision, or with Activision, their favorite thing about it, and they’ll tell you it’s the people. We have a rigorous hiring process and a rigorous talent planning process. Our success doesn’t come from assembly lines producing widgets. Our success comes from people producing greatness. So if you’re interested in our biggest priority, it’s the people. As a company, we have world class brands, infrastructure and resources. But we are nothing without the brilliance of our talented employees.What are you waiting for?For more details and to apply for this position, visit us at www.activision.com/careers Activision is an Equal Opportunity Employer. All qualified applicant will receive consideration for employment without regard to race, color, religion, sex, national origin or protected veteran status and will not be discriminated against on the basis of disability.Great Games Start with Great People"}