{"jobID": "2810999768", "jobLocation": "Bedford_MA", "jobTitle": "Systems Test Intern", "companyRating": null, "companyInfo": {"Website": "www.irobot.com", "Headquarters": "Bedford, MA", "Size": "501 to 1000 employees", "Founded": " 1990", "Type": " Company - Public (IRBT) ", "Industry": " Retail", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Summary  iRobot is looking for a Systems Engineering Intern to join iRobot. Gain an understanding of robotics and key robotic technology conceptsManage requirements for complex electromechanical systems with a significant software componentParticipate in various phases of our product development processGet hands-on experience building, testing and debugging state-of-the-art robotic productsExperience a collaborative work environment where your fresh views are welcomeGain an understanding of the test process while helping to develop new testing approachesIncrease your data collection, data interpretation, troubleshooting, and presentation skills The internship would be approximately from September - December 2018  Essential Functions/ Job Duties Support the capture and management of product system requirementsSupport procurement, assembly and debug of prototype robotic systemsSupport testing and evaluation activities of systems composed of wireless communication systems, sensors, computation modules, mobility, and power/energy storage subsystemsParticipate in prototype integration, verification, and validation (IV&V;) as needed, including system functional and environmental testing.Starting possibly with just a rough idea of product testing needs, design, build, develop and verify new product test fixturesQualificationsCurrent student enrolled in a Science, Technology, Engineering, or Math (STEM) majorMust be comfortable using basic hand tools. Should be comfortable using power tools. Desirable to have machine shop experienceAptitude/desire to work in a dynamic environment in a self motivated, action oriented fashionComfortable exploring work tasks, seeking out answers, and working independently when necessaryStrong interpersonal skills, and excellent oral and written communication/briefing skillsComputer proficiency (Excel, Word, PowerPoint&Visio;)Familiarity with Linux (command line and scripting) a plusDemonstrated organizational, planning, and prioritization skillsBroad scholastic experience in multiple disciplines and experience with electromechanical systems and sensors desirable About Us  We are the leading global consumer robot company, designing and building robots that empower people to do more, both inside and outside of the home. Founded by MIT roboticists who had the vision of making practical robots a reality. To date, we have sold over 20 million robots and globally employ more than 600 of the robot industry's best and brightest. iRobot is committed to fostering invention, discovery and technological exploration in the pursuit of practical and valuable robot products for the home. iRobot stock trades on the NASDAQ stock market under the ticker symbol IRBT.  iRobot is headquartered in Bedford, Massachusetts, accessible by our corporate shuttle directly from Alewife Station. We also have offices in California, Europe, Japan, China&Hong; Kong. Imagine the future you could help us build as a fellow iRoboteer! Check out #LifeAtiRobot and follow us on Instagram: @irobotcareers  iRobot is an Equal Opportunity Employer"}