{"jobID": "2770200828", "jobLocation": "San_Carlos_CA", "jobTitle": "Data Scientist", "companyRating": "4.1", "companyInfo": {"Website": "www.helix.com", "Headquarters": "San Carlos, CA", "Size": "51 to 200 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "156000", "jobDescription": "We believe that everyone benefits from their biological information. It is our mission to empower every person to improve their life through DNA. With our high-quality, trusted partners and state-of-the-art lab, we have created the first platform of personalized products and services powered by genetics. From inherited cancer screening to custom fitness and nutrition plans, the world of DNA learning is becoming more accessible and more valuable than ever.  So far we have raised over $300 million from investors like Illumina (the world’s leader in genetic sequencing equipment), Warburg Pincus, Sutter Hill Ventures, Kleiner Perkins Caufield & Byers and Draper Fisher Jurvetson Growth. Our app store and marketplace include partners such as National Geographic, Admera Health, Vinome and many others, with whom we have partnered to develop applications which interpret your genome.  Our big vision comes with big responsibility. That’s why we’re building a team of experts in the field of genetics, engineering, design, business development, and beyond to help bring actionable insights to our customers. We’re looking for the best and brightest minds who are passionate about our mission and are excited to work with a truly diverse team.Our platform will serve millions of users at an unprecedented data scale—data that is the most personal kind of data you can have: DNA. We are building an app store that will be a one-of-a-kind genomics storefront, rich with partner products ranging from carrier screening to recreation to health and wellness. We are building a developer ecosystem that will unlock the creativity of the community to discover new insights that we can’t even dream of today.What’s important to us: Curiosity - we are all passionate about the possibilities enabled by having access to your own genomeResponsibility - we have an obligation to people and our partners to operate with highly credible research guided by well-respected advisors, with clear and effective communication about our productsAgility - flexibility and a desire to be nimble, smart, and effective are important to the Helix cultureExperience - we’re building a team with amazing track records of achievement in multidisciplinary environmentsThe mission of the data science team at Helix is to apply innovative machine learning and statistical techniques to one of the most fascinating and fastest growing type of data in the world today - genomics data.  Genomics data worldwide is expected to roughly double in size every 7-8 months. Helix, with its partners, is helping to turn applications of this data into a reality. As a founding member of the data science team, you will have the opportunity to work with unique genomic and operational data sets, help build the data platform, and design the machine learning algorithms that drive new insights. As a Data Scientist, you will:Design, implement, test and deploy state-of-the-art machine learning based models and deploy them into a production environment.Apply machine learning and advanced statistical methods to derive novel insights from vast amounts of genomics data.Identify novel opportunities to apply machine learning at Helix and help drive the data science roadmap.Keep up-to-date with the latest techniques and approaches in machine learning and statistical analysis.Work closely with engineering to build infrastructure for data science.Required background:M.Sc or Ph.D. in statistics, Math, Computer Science or similar field with 5+ years of experienceExperience in using SQL for advanced data analysis and visualizationProficient in Python, R or similar data-science oriented scripting languageStrong track record in building machine learning models using real-world large datasets, that work in production with positive outcomesThe ideal candidate will have:Background in genomics data analysis or association studiesPrior experience with Spark and the AWS stackWhat Helix has to offer you Aside from working alongside brilliant, dedicated, passionate, down-to-earth, curious, warm, and thoughtful people, we also provide great benefits: Competitive compensation, including meaningful equityHealth insurance, including medical, dental, and vision12 weeks of Maternity or Paternity leave4 weeks of paid Pregnancy Disability401(k) with employer matchingOn-premise nursing roomCorporate fitness rateCommuter benefitsCatered mealsFlexible PTO Helix is proud to be an equal opportunity employer, and committed to providing employment opportunities regardless of race, religious creed, color, national origin, ancestry, physical disability, mental disability, medical condition, genetic information, marital status, sex, gender, gender identity, gender expression, pregnancy, childbirth and breastfeeding, age, sexual orientation, military or veteran status, or any other protected classification, in accordance with applicable federal, state, and local laws."}