{"jobID": "2767807571", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Data Scientist III", "companyRating": "4.2", "companyInfo": {"Website": "www.counsyl.com", "Headquarters": "South San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "176000", "jobDescription": "Our goal is to make the human genome practically useful for life-altering decisions.We invented the Counsyl Test, a breakthrough diagnostic intended for parents planning to start a family. The test won the Wall Street Journal Innovation Award for Medicine, was named one of Scientific American’s “Top 10 World Changing Ideas”, was featured in the New York Times -- and is now prescribed by physicians for over 3% of all the births in the United States.Few if any have done genetics on this scale before. As a data scientist, you will play a critical role in building an efficient, reliable, and data-driven vertically-integrated genetics organization.What You'll Do Build structured reports that can be automatically re-run to monitor critical laboratory parameters for process control and regulatory compliance.Statistical modeling and process debugging to develop new assays and new technology in the lab.Assist in data analysis, modeling, and reporting for scientific publications.Cross-functional analysis: work with the business and sales development teams to optimize revenue using our large corpus of historical sales and insurance data.Coordinate between the laboratory and operations teams to optimize the cost-effectiveness of the business.About You MS or PhD in Chemistry, Biology, Physics, Engineering or a similarly quantitative field; or significant prior experience in related work.You have experience analyzing data from molecular biology or biochemistry experiments. Experience working with Next Generation Sequencing data is a plus. Interpreting exploratory analysis of data from the clinical laboratory is a core function.You have a strong background in statistics and probability.Experience writing reproducible analysis pipelines in a statistical programming environment like Python (preferable) or R is a must. Experience with modern web development is a plus. Experience with only Excel (or other spreadsheet tools) is insufficient.Process control background is a plus.Counsyl is a health technology company that offers DNA screening for diseases that can impact men, women and their children. The Counsyl philosophy is simple: screen for diseases where advanced knowledge makes a difference in health outcomes, whether it’s changing a behavior, pursuing preventative measures, or simply preparing for what lies ahead.The Counsyl team includes an accomplished group of problem-solvers — top engineers, scientists, and designers — who are taking the lead on building the modern clinical laboratory. Scientific rigor, custom robotics, and software are at the heart of every Counsyl product, resulting in better, faster and more affordable screens that are broadly accessible. Beyond the laboratory, Counsyl offers doctors and patients a technology platform for results delivery in real time, with on-demand access to board-certified genetic counselors.The company has raised a total of $102 million and is privately backed by Pilot Growth Equity, Goldman Sachs Asset Management, Founders Fund, Felicis Ventures, David Drummond, and other high profile investors.Counsyl does not accept unsolicited resumes. Further, any resumes submitted to us without a signed contract will become the property of Counsyl, Inc.Counsyl, Inc. is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: Counsyl is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Counsyl are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Counsyl will not tolerate discrimination or harassment based on any of these characteristics. Counsyl encourages applicants of all ages."}