{"jobID": "2812283095", "jobLocation": "New_York_NY", "jobTitle": "Sales - Summer Intern", "companyRating": null, "companyInfo": {"Website": "www.dfsco.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 2016", "Type": " Company - Public (DFIN) ", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Donnelley Financial Solutions (NYSE: DFIN) provides software and services that enable clients to communicate with confidence in a complex regulatory environment. With 3,500 employees in 61 locations across 18 countries, we provide thousands of clients globally with innovative tools for content creation, management and distribution, as well as data analytics and multi-lingual translations services. Leveraging advanced technology, deep-domain expertise and 24/7 support, we deliver cost-effective solutions to meet the evolving needs of our clients. Short Description  We are seeking a talented student in the New York City area to intern directly with the New York Sales and Business Development team. We are looking for an energetic & creative candidate with strong organizational and communication skills, who is eager to learn and gain hands-­on experience.  Responsibilities will range from day-to-day tasks to assisting sales and marketing in the creation of collateral.  RESPONSIBILITIES  Connected to the Marketing Analyst for the New York office, and Business Development for our SaaS solutions, your main missions will be: Gain an understanding of the US Securities and Exchange Commission and the deal making players in the global financial marketAnalyze industry and sector trends in capital markets spaceAnalyze data from our business intelligence tool to come up with market share specific marketing resources for relevant product linesInteract with Salesforce, research documents, LinkedIn, and Google to get a better understanding of business landscapeAssist the sales team with industry/client specific collateralAssist the administrative staff and business development team with projects to expand our brand in the marketplaceAttend team meetings, lend your voice and creativity to our business QUALIFICATIONS Third or fourth year undergraduate student with a major in communications or marketingTeam player, autonomous, creative and ability to multi-taskHighly organized and attentive to detailStrong writing and analytical skillsStrong knowledge of Microsoft Word, Excel and PowerPointKnowledge of social media and web searchIt is the policy of Donnelley Financial Solutions to select, place and manage all its employees without discrimination based on race, color, national origin, gender, age, religion, actual or perceived disability, veteran's status, actual or perceived sexual orientation, genetic information or any other protected status.   If you are a qualified individual with a disability or a disabled veteran, you have the right to request a reasonable accommodation if you are unable or limited in your ability to use or access jobs.dfsco.com as a result of your disability. You can request a reasonable accommodation by sending an email to AccommodationRequests@dfsco.com."}