{"jobID": "2443363578", "jobLocation": "Sunnyvale_CA", "jobTitle": "Full-time City Driver", "companyRating": "3.5", "companyInfo": {"Website": "www.upsjobs.com", "Headquarters": "Atlanta, GA", "Size": "10000+ employees", "Founded": " 1907", "Type": " Company - Public (UPS) ", "Industry": " Transportation & Logistics", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "29", "jobDescription": "Full-time City Driver$24.00 per hour for Local Drivers!Shift: Sunrise (9:00 AM - 6:00 PM)UPS Freight is hiring individuals to work as Full-Time City Drivers. This position involves the driving of a tractor-trailer and the daily pick up and delivery of freight from numerous commercial and residential customers on a given route.  City Drivers must pass a DOT physical and successfully pass a road test. Qualified applicants must have a valid Class A Commercial Driver's License with Haz-Mat, Twin Trailer, and Tanker endorsements, issued by this state. Pick-Up & Delivery Drivers are expected to comply with our appearance policy.  Applicants must be at least 21 years of age; and must be able to read, write and speak the English language. Applicants must meet the Department of Transportation (DOT) and Company mental and physical requirements; and must be physically and mentally able to safely perform the essential job functions without obvious risk of injury to the employee or co-workers.   This job posting includes information about the minimum qualifications (including the UPS Uniform and Personal Appearance Guidelines), locations, shifts, and operations within the locations which may consider my application. An applicant or employee may request an exception or change to, or an accommodation of, any condition of employment (including the UPS Uniform and Personal Appearance Guidelines) because of a sincerely held religious belief or practice.UPS is an equal opportunity employer – race/color/religion/sex/national origin/veteran/disability/sexual orientation/gender identity"}