{"jobID": "2733715671", "jobLocation": "New_York_NY", "jobTitle": "Director at Columbus Circle", "companyRating": null, "companyInfo": {"Website": "www.brighthorizons.com", "Headquarters": "Watertown, MA", "Size": "10000+ employees", "Founded": " 1986", "Type": " Company - Public (BFAM) ", "Industry": " Education", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Learning Care Group, Kindercare, Knowledge Learning"}, "estimatedSalary": null, "jobDescription": "Job Title Director  13-Apr-2018 Job Description Bright Horizons at Columbus Circle located at 910 9th Avenue in Manhattan is currently hiring a Director for their full service program. The center serves children ages six weeks through five years old and is open from 7:00 a.m. until 6:30 p.m, serving approximately 150 children. This center has a Movement Matters Zone as well as an Art Studio and multiple enrichment providers. The Director will work closely with the Office Manager and Assistant Director as well as the center teaching staff to ensure the implementation of a developmentally appropriate program that meets NAEYC Standards and Bright Horizons Family Solutions philosophy and guidelines.  At Bright Horizons, every day brings something new. As a child care director, you will have a chance to inspire the passion in your teachers, have a moment of pure connection with a child or parent, embrace an unexpected challenge that evolves into an opportunity to apply your intelligence, share your compassion and character in creating a solution – and every day, you’ll find your business focus balanced by a unique and very real sense of fulfillment.Apply now to join the Bright Horizons team as an on-site leader at one of our beautiful centers. You will play a key role in creating and refining the center’s culture by supporting teachers in the development of an innovative, hands-on, emergent curriculum designed for the children in your care and building an environment where the children, families and staff thrive.  As a center director at Bright Horizons, you will: Grow your team by hiring, training, supervising and inspiring a team of passionate, committed teachersCollaborate with families to support and share the educational needs of their childrenNurture your career aspirations and personal growth through ongoing training and supportInspire each child’s potential through our innovative curriculum, inclusive environment and strong family partnershipsPlay an integral role in continuing the Bright Horizons commitment to qualityEnjoy the support of a corporate team dedicated to helping you manage the daily operations of the center  At Bright Horizons, we support our employees in their lives both at home and at work. We ensure a work environment in which each employee's chosen path is respected, rewarded, and celebrated.Req Number70290BRState New York Zip/Postal Code10019City New York Job Category Leadership Posting Title Director at Columbus Circle FT/PT Full-Time Job Type Regular Job RequirementsBachelor’s degree required with New York State certification in N-6, 1-6, B-2, Special Education or School Building Leadership. Masters degree is preferred. 3-5 years of management/leadership experienceA combination of infant, toddler or preschool teaching experienceWell-versed in NAEYC accreditation and licensing standards Strong leadership, supervisory and customer service skills and ability to create/maintain partnerships with families and staffAbility to lead staff in implementing a developmentally appropriate curriculumStrong organizational and communication skills and the ability to handle multiple tasks or crisis situations effectivelyCapacity to understand and manage center financial dutiesComputer literacyExperience working in an inclusive work environment and managing across differencesMust meet state educational and licensing requirements for director; additional center/school requirements may apply Additional Information Bright Horizons is dedicated to creating a workforce that promotes and supports diversity and inclusion. We provide equal employment opportunities to all individuals without discrimination. Bright Horizons complies with the laws and regulations set forth in the following EEO is the Law Poster: EEO IS THE LAW.Applicants requiring reasonable accommodation for any part of the application and hiring process should contact the recruitment helpdesk at 855-877-6866 or bhrecruit@brighthorizons.com. Determinations on requests for reasonable accommodation will be made on a case-by-case basis.Having technical issues with your online application? Contact us at bhrecruit@brighthorizons.com or 855-877-6866.Job Category 2 Center and School  Apply"}