{"jobID": "2775249356", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior R/Python Expert + Software Engineering (No Data Scientists)", "companyRating": "3.7", "companyInfo": {"Website": "www.andiamoitalia.com", "Headquarters": "Warren, MI", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Restaurants, Bars & Food Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "121000", "jobDescription": " Our client is the world's premier financial data and analytics provider. For over 30 years, we have provided timely and accurate data to the world's financial institutions, including the largest banks and most elite hedge funds.  Here in our San Francisco office we've identified an opportunity to reach a new client base by building a brand new product that opens our data, core products and visualizations to data scientists, machine learning researchers, and quantitative modelers.  Our target client base uses Python to apply mathematical and statistical methods to financial and risk management problems. Our platform allows these users to bring their algorithms to our data, not the other way around. With our service, users can develop their code in a unified environment that can be tested, shared, and deployed easily.  If you want to build a brand new product that empowers users to view and interact with our data in a totally customizable way and build their own intelligence and visualization around it, join our team! We'll trust you to:Build the platform from a Python library's implementation to its packaging and distribution to clientsLearn about the Python community, data science packages, and best practicesBuild APIs for users to access Bloomberg data and analytics in intuitive and novel waysLearn and understand the variety of ways quantitative developers interact with our data; from back-testing trading strategies over years of price history information to modeling and evaluating portfolio riskCome up with ideas on how to improve the financial data science platform and help implement themYou need to have:2+ years developing Python, C or C++ packages and APIs2+ years in API design, unit testing and library architecture3+ years of computer science experienceWe'd love to see:Experience with introspecting the python interpreter with debugging tools and pluginsExperience with RExperience contributing to Open-Source projectsAn appreciation for how our data sets underpin the world's financial systems - if you don't know anything about finance, you'll pick it up by interacting with a world-class team of market experts. Andiamo is an Equal Opportunity Employer  Andiamo provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Andiamo complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.  All qualified candidates are encouraged to apply by submitting their resume as an MS word document including a cover letter with a summary of relevant qualifications, highlighting clearly any special or relevant experience.SDL2017"}