{"jobID": "2586783853", "jobLocation": "New_York_NY", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.smithhanley.com", "Headquarters": "New York, 061", "Size": "1 to 50 employees", "Founded": " 1980", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Kforce, PageGroup, Robert Half"}, "estimatedSalary": null, "jobDescription": " Smith Hanley Associates  Data Scientist  New York, NY  Salary: Up to 130k base  Contact: Sean Murphy - smurphy@smithhanley.com *OPT CANDIDATES, INTERNS OR THOSE WITHOUT 3 OR MORE YEARS OF FULL TIME, PROFESSIONAL US BASED EXPERIENCE WILL NOT BE ACCEPTED!! New York FinTech is seeking a data scientist to join the team! The Data Scientist will involve applying advanced analytical techniques to structured and unstructured data sets to solve business challenges within Risk, Finance and Operations. The responsibilities for the Data Scientist include data sourcing, hypothesis generation, and machine learning to provide solutions. The Data Scientist will be required to deliver financial results and risk insights through the use of predictive modeling and machine learning techniques. The Data Scientist will lead full cycle projects, monitor trends, provide recommendations and work with cross functional business units as well as senior leadership. Those with specialties in fraud, underwriting, or collections are especially encouraged to apply! Requirements of the Data Scientist Developer:Masters degree in Statistics, Mathematics, Computer Science or equivalent (Ph.D. Strongly Preferred)Minimum of 3 years of US Based full time business experience with predictive modeling, machine learning, and statistical techniques such as regression, decision trees, clustering, neural networks and text miningExpertise in SAS, SQL, R, Python, JavaExperience in consulting or credit card portfolios a plusSpecialties in Collections, Fraud, Data Science or Underwriting are a huge plus and highly sought after!"}