{"jobID": "2753403964", "jobLocation": "San_Francisco_CA", "jobTitle": "Software Engineer - Intern - Fall", "companyRating": "3.3", "companyInfo": {"Website": "www.yelp.com", "Headquarters": "San Francisco, CA", "Size": "5001 to 10000 employees", "Founded": " 2004", "Type": " Company - Public (YELP) ", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Google"}, "estimatedSalary": "116000", "jobDescription": "Yelp wants Fall interns to work side-by-side with our passionate, creative software developers. That's right, each intern at Yelp has a mentor and substantial projects to work on during their time here. We are looking for students who wish to gain experience at a growing company by working on projects used by millions of Yelpers and business owners. We use continuous deployment and A/B testing, so you would get to launch those projects and see results immediately. We take a lot of pride in the space we use at HQ for hosting meetup groups and tech talks. Yelp is looking for interns that want the chance to meet and greet with the best and most dynamic engineers, product managers, and leaders in the Valley. Are we looking for you? Great! Then check out our engineering teams and let us know what you are interested in working on. We would love to find out more about you.Backend EngineerDescription: Yelp is the richest source of local business data and user-generated content in the world, and our backend engineers use that data to power our websites and mobile apps. As a backend engineer you’ll be working closely with mobile and web application developers to bring our 100M+ reviews to millions of users all around the world and to ensure that data is stored, transported, and crunched effectively. Experience in JavaScript, HTML and CSS/SassWhat You Will Do: Make a huge impact on our users looking for the best local businesses; Build products for business owners to get the most out of Yelp; Tackle some of the most challenging problems in distributed computing, API design, and real time data processing.What We Are Looking For: Experience with and interest in elegant API designs; Expertise in your favorite modern programming language: Python, Ruby, Java, Objective-C, or C++.Data-Mining EngineerDescription: Our Search & Data Mining, Ads, and Trust & Safety teams see 100+ million Yelp reviews and millions of monthly unique users as one giant playground for data mining. They banter about Bandits, know their way down a Gradient, and aren’t too Naïve to kick back in our Bay(es) Area offices. We love new ideas and collaboration: don’t come here with any Prior prejudices or you will Maximize your Likelihood of getting your Posterior kicked. Our teams eat data for breakfast, chew it up, and spit out useful products. Saddle up and get on board!What You Will Do: Work with the team to come up with creative ideas for new products and signals, then carry those ideas all the way to launch; Explore data to measure the impact of your changes and come up with ideas for how to maximize that impact; Work closely with infrastructure engineers to make sure that your algorithms will effectively scale to large datasets and to ensure that their systems provide the flexibility needed for your ideas.What We Are Looking For: Passion for big data and creative ideas for what to do with it; Experience with the algorithms and data structures to make your ideas workable; Understanding of machine learning and information retrieval; Expertise in your favorite modern programming language: Python, Ruby, Java, Objective-C, or C++.Full Stack EngineerDescription: Our full stack engineers bridge the gap between backend data and the frontend websites of Yelp. Their goal is to provide the best user experience to millions of users and they’re excited to dive into any area of the web stack to make it happen.What You Will Do: Design and build new features to connect Yelp with large scale businesses; Implement beautiful layouts that work across all of Yelp’s platforms (desktop, mobile browsers, and mobile apps); Deploy projects in a Service-Oriented Architecture, all the way from backend services to fully-featured UIs; Run A/B experiments and dive into the resulting data to look for trends; Collaborate closely with product managers, designers, and other engineering teams.What We Are Looking For: Experience with at least one popular server side MVC Framework (Django, Twisted, Rails, Pyramid, Codeigniter, Play, etc.); Knowledge of JavaScript, HTML and CSS/Sass.Mobile DeveloperDescription: No service is better suited for mobile than Yelp. When amazing local content meets location-aware devices that go everywhere with us, Yelp connects you with that great local business right around the corner, lets you instantly share that experience to help the next person discover it, and allows business owners to keep business humming along while on the move.What You Will Do: Build new features in Yelp's multiple apps to connect consumers and business owners; Improve and iterate on existing functionality to reliably give our users a smooth experience; Insist on a consistent and responsive user experience; Be a key part of the larger mobile developer community at Yelp.What We Are Looking For: Expertise in Objective-C, Java or other mobile languages; Eager to embrace challenges with scalability, reliability, and performance.Infrastructure EngineerDescription: Yelp’s Infrastructure teams design, implement, and maintain scalable software architectures that are at the heart of our technology. We do everything from building performance monitoring tools, to developing libraries, to creating speedy and reliable infrastructure that’s easy to use for our relevance/machine learning developers.What You Will Do: Support and improve our tools for continuous build, automated testing, source control, and release management; Design, build, and deploy software systems that run 24/7 at increasing scale; Analyze metrics and code to discover performance regressions and opportunities for optimization, then work with teams across the organization to speed things up.What We Are Looking For: Solid foundation in data structures, algorithms and complexity analysis; A hunger for tracking down root causes -- no matter how deep it takes you -- and fixing them in systematic ways; Strong understanding of operating systems, file systems and networking; Strong understanding of web technology; Expertise in your favorite modern programming language: Python, Ruby, Java, Objective-C, or C++.Security EngineerDescription: Yelp Security works to keeps our users, employees, and their data safe. The systems we build prevent and detect security vulnerabilities across Yelp’s infrastructure - from our production infrastructure, to mobile apps, to our corporate systems. The Security team partners with all other engineering teams to develop new features in a safe and secure way.What You Will Do: Build systems that monitor, detect, and alert on anomalies and bad behavior on Yelp’s production and corporate systems; Partner with all other engineering and product teams to help develop new features securely while protecting our users’ privacy and data.What We Are Looking For: Enthusiasm for finding exploits and vulnerabilities in any internet-connected system; Expertise in your favorite modern programming language: Python, Ruby, Java, Objective-C, or C++.If your curiosity seeks past intern projects, please take a look at this posting: https://engineeringblog.yelp.com/interns/"}