{"jobID": "2827392031", "jobLocation": "Fremont_CA", "jobTitle": "Speech Language Pathologist (SLP)", "companyRating": "2.7", "companyInfo": {"Website": "www.selectrehab.com", "Headquarters": "Glenview, IL", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "84000", "jobDescription": " \"Job Description: Speech Language Pathologist (SLP)Requirements: Master of Science Degree in Speech Language Pathology, Speech and Hearing Sciences or Communication Disorders.State Licensure. (or proof of registration to complete the Clinical Fellowship year in Speech Pathology after which certification can be obtained).ASHA Certification (or proof of ASHA Certification)Supervision: Speech Language Pathologist is responsible for their direct clinical skills, documentation skills, and the compliance to all professional standards. The SLP-CCC shall supervise any SLP-CFY as assigned per ASHA supervision requirements. The SLP will report to the Regional Manager for Paid Time Off approval, staffing, daily facility and corporate operations.Job Description:  The SLP is responsible for the evaluation and treatment of residents who demonstrate disorders of speech, language, cognitive communication, voice, fluency, and swallowing. Evaluation and treatment will only be conducted after a written order is received from the physician. The SLP is responsible for the screening of residents: The SLP is responsible for the completion of all necessary documentation: The SLP is responsible for attending all required facility meetings and inservices, including Medicare meetings, patient staffings, family meetings, care plans. The SLP will in cooperation with the Regional Manager, develop programs appropriate to the needs of the residents in the facility, to assist them in achieving their highest feasible level of functioning. The SLP will assist the facility in meeting the standards necessary to obtain state, federal, and other appropriate certification. The SLP will employ and follow all appropriate facility infection control policies and procedures and will respect and follow OBRA Residents Rights Guidelines. The SLP is responsible for the appropriate scheduling of residents on caseload in addition to all required inservices and meetings. The SLP will contact the Regional Manager if productivity levels consistently fall below or exceed the standard to indicate the need for additional staffing or the need for assistance in screening and identifying residents in need of PT services. The SLP is responsible for the scheduling and completing of inservices for facility staff education. The SLP will present her/himself in a professional manner at all times including professional conduct, professional communication, and appropriate dress while in the facility. Other duties as assigned by the Regional Manager and facility. \""}