{"jobID": "2738447376", "jobLocation": "Santa_Clara_CA", "jobTitle": "Research Intern", "companyRating": "3.8", "companyInfo": {"Website": "www.intel.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1968", "Type": " Company - Public (INTC) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "135000", "jobDescription": "Job DescriptionThe Anticipatory Computing Lab ACL at Intel Labs is looking for a Research Intern for Summer in Santa Clara, CA, USA with Speech and Language Understanding expertise applying Deep Learning technologies to develop and implement algorithms for contextually aware ubiquitous computing systems.  At ACL, we develop sensing systems, algorithms and experiences to enable proactive and context aware assistive computing. Examples of several ongoing projects include multimodal emotion understanding, ubiquitous event sensing, multimodal dialog interactions, user identification, multimodal activity recognition and cognitive tutoring and recommendation systems.  Work includes research and explorations of deep learning techniques for classification of complex sets of multimedia and multimodal streams along with incorporation of feedback for continuous/online learning. Publication record in deep machine learning techniques is highly desirable for successful candidate. The ideal candidate should be comfortable in a fast-paced research environment where the set of problems and application areas change rapidly, who can create rapid prototypes, and is comfortable with practical applications and implementations of machine learning techniques. QualificationsYou must possess the minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. Relevant experience can be obtained through school work, classes and project work, internships, military training, and/ or work experience. This is an entry level position and will be compensated accordingly. Minimum Requirements: The candidate must be pursuing a PhD degree in Computer Science, Computer Engineering with specialization in Speech and NLP, ML or AI.  Minimum 6 months experience in the following: Machine learningSpeech and Audio ProcessingTensorflow or Pytorch or similar deep learning frameworks Preferred Qualifications: Programming skills in languages like C/C++, Python and or Scala/Javamodeling, automatic speech recognition, speaker recognition or audio context awarenessPrototyping and demo skillsKnowledge with dialogue systemsShowcase of projects via platforms like GitHubKnowledge in context awareness and ubiquitous computingWork experience or thesis work should demonstrate applied machine learning skills towards context aware computingKnowledge in at least one of the following subjects: human behavioral monitoring, speech understanding, topicInside this Business GroupIntel Labs is the company's world-class, industry leading research organization, responsible for driving Intel's technology pipeline and creating new opportunities. The mission of Intel Labs is to deliver breakthrough technologies to fuel Intel's growth. This includes identifying and exploring compelling new technologies and high risk opportunities ahead of business unit investment and demonstrating first-to-market technologies and innovative new usages for computing technology. Intel Labs engages the leading thinkers in academia and industry in addition to partnering closely with Intel business units.Posting Statement. Intel prohibits discrimination based on race, color, religion, gender, national origin, age, disability, veteran status, marital status, pregnancy, gender expression or identity, sexual orientation or any other legally protected status."}