{"jobID": "2683985844", "jobLocation": "San_Jose_CA", "jobTitle": "Design Engineering Summer Interns", "companyRating": "2.9", "companyInfo": {"Website": "www.toshiba.com/taec", "Headquarters": "Irvine, CA", "Size": "1001 to 5000 employees", "Founded": " 1989", "Type": " Subsidiary or Business Segment", "Industry": " Manufacturing", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Texas Instruments, Intel Corporation, Samsung Electronics America"}, "estimatedSalary": "129000", "jobDescription": " Here at TOSHIBA, our creative force in the world of Storage represent extraordinary talent of people with a diverse range of skill-sets, interests and backgrounds carefully orchestrated to architect and design innovative SSD solutions.  Our Culture, is composed of intelligent, curious people, who collaborate respectfully together and are stimulated when being stretched beyond technical comfort zones and who thrive on engineering challenges and technological diversity. Simply put, our internship program will engage students with the opportunity to experience the real work of engineering while providing a practical understanding of SSD technologies, as well our culture.  Toshiba is looking for passionate and driven students from all engineering disciplines and beyond to be a part of our summer internship. We offer an invigorating program where interns will be contributing to projects with meaningful outcomes this is not a coffee and copy internship. Our Internship runs eight to ten weeks during the summer between June and August and is open to students with a minimum of two years of college. While our goal is to groom a talent pool of future engineers we cannot guarantee an internship will transition to full-time position but you never know! Design Engineering Interns Our Interns will work closely with their mentor and other experienced design teams to contribute to the development of Toshiba Memory eSSD product. In this role, you will be responsible for the verification and design of cutting edge technologies. You will be an integral part of the design team working on planning, developing, and executing pre-silicon verification and design. The ideal candidate is a self-motivated individual, who is passionate about simulation, design and verification of memory devices.  Design using Verilog, logic simulation, functional verification, and synthesis of DSP and data conversion ICs in a mixed signal environment.Implement RTL modules and work with design team with integration and integrated functional verification.Education RequirementsCurrently pursing Bachelors, Masters, or PhD in Electrical Engineering, ECE, or Computer Science We are an Equal Opportunity/Affirmative Action Employer including: Minorities/Women/Individuals with Disabilities/Protected"}