{"jobID": "2824850240", "jobLocation": "New_York_NY", "jobTitle": "Video writing intern for science", "companyRating": null, "companyInfo": {"Website": "www.businessinsider.com", "Headquarters": "New York, NY", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Media", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We are hiring a video writing intern to join the video team at Business Insider.  The role includes pitching, researching, and producing scripts for science, innovation, and tech videos. A background in science or science writing is preferred.  Story producing interns work closely with video editors, but they do not need to have video-editing experience. We're looking for ambitious reporters who can find and chase great stories, and relay them to our audience in a compelling way. Recent examples include:What happens when you stare at the sunWhy cockroaches are so hard to killThe world is running out of sand and there's a black market for it now This internship position is at our headquarters in New York City. It starts immediately and runs for 6 months. Interns are encouraged to work full-time (40 hours a week).  Our interns are an integral part of our team. We seek out self-starters and people who are enthusiastic about collaborating with video producers, social media editors, and other team members. And who are able to work quickly and efficiently under a deadline.  APPLY HERE with your resumé and cover letter telling us why you're a fit for Business Insider and detailing your interest in science, tech, and innovation. About us: Insider Inc. is the publisher of INSIDER, Markets Insider, and 17 international editions of Business Insider, including the flagship NY-based US edition. The company pioneered a digital-native approach to news and information that is social and mobile at its core, for an ambitious and curious global audience that grew up with digital. The company launched in 2007, and in ten years, Business Insider has grown to become the most favorite business news brand in the world, when measured by reach. Insider Inc. reaches a global audience of several hundred million readers and viewers. The company also offers a subscription research service, Business Insider Intelligence (BII), that provides in-depth insight, data, and analysis of digital topics. Every year the company hosts IGNITION, an influential media and technology conferences. Insider Inc. is a subsidiary of Axel Springer SE. We are always looking for talented, curious and motivated individuals to join our growing team."}