{"jobID": "2824681429", "jobLocation": "Burlington_MA", "jobTitle": "Project Manager Intern", "companyRating": "3.2", "companyInfo": {"Website": "www.nuance.com", "Headquarters": "Burlington, MA", "Size": "10000+ employees", "Founded": " 1992", "Type": " Company - Public (NUAN) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Google, Microsoft, Amazon"}, "estimatedSalary": "53000", "jobDescription": " Company Overview  At Nuance, we empower people with the ability to seamlessly interact with their connected devices and the digital world around them. We are creating a world where technology thinks and acts the way people do by designing the most human, natural, and intuitive ways of interacting with technology.  Our nimble technology uses analytics and advanced algorithms to transform the inanimate into animate and reduce complicated processes into simple ones.  Join our Healthcare team...caring for clinicians the way they care for patients. Beyond words. We create technology that lets clinicians capture and document care quickly and easily so they can focus their attention on their patients.  Job Summary  The PMO Intern will report to the Director of Program Management Office (PMO), to provide support of critical programs in the Nuance Healthcare Division, spoecifically CDI Next Gen. The Intern will be assigned data collection/analysis tasks, status reporting tasks, creating mini-project plans and communication plans to support these programs.  This intern will work with a more senior program manager (Kathie McCue) who is responsible for the overall CDI and CAPD portfolio, but will focus on the CDI next generation offerings to support the growth of the CDI product solutions and revenue growth. Responsibilities:Business Analysis:Analyze current business requirements and map to project objectives.Identify new areas of process and communications improvementsEnsure regular status reportingMaintenance:Support existing reporting mechanisms, including Qlik, and PMO dashboardsCompile and maintain data assciated with each projectSupport:Develop processes and tracking mechanisms for projectSchedule follow-up internal meetings to identify and mitigate gaps Perform tasks related to securing and keeping the products, tools, and processes that you are responsible for secure. Qualifications:Number of Years of Work Experience:post graduate with 1 to 3 years of experience or currently pursuing a MS in Business Management, Business Administration, Information Systems or equivalentGPA of 3.0 or higher.Required Skills:Strong organizational skills and able to prioritize and coordinate.Ability to multi-task and manage time well.Trustworthiness.Work without supervision and under pressure.Show initiative and able to think 'out the box'.Ability to see the bigger picture.Good written, verbal and presentation skills.Flexible and open to change.Work with all levels of staff.Patience.Quality conscious.Willing to take ownership.Willing to share information.Preferred Skills:proficient using MS office toolsinterest in pursuing Project/Program management certification or careerTechnology or IT experienceEducation:Currently pursuing a MS in Business Management, Business Administration, Information Systems or equivalentGPA of 3.0 or higherPMP Certification is a PlusAdditional Information Nuance Communication Inc. is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, national origin, disability, veteran status, and other legally protected characteristics. The EEO is the Law poster is available here: http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf . If you need a reasonable accommodation because of a disability for any part of the employment process, please call 781-565-5000 Human Resources Department and let us know the nature of your request and your contact information."}