{"jobID": "2776073400", "jobLocation": "Redondo_Beach_CA", "jobTitle": "Police Department Intern (Unpaid)", "companyRating": null, "companyInfo": {"Website": "www.redondo.org", "Headquarters": "Redondo Beach, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Government", "Industry": " Government", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "DEFINITION Internships with the City of Redondo Beach Police Department offer students an array of opportunities that complement academic studies, enhance career growth, and foster personal development. They bridge the gap between school and the world of work and offer students an environment in which to network with professionals who are dedicated to making a positive difference with the Redondo Beach Police Department. Interns assist managers and professional staff with special projects, research and analytical assignments, community outreach, and day-to-day activities. Interns do not displace or replace employees, but work under close supervision of existing staff.  An important component of the internship experience is the partnership that exists between the intern, the academic institution and the supervisor. The internship links the world of work to the academic setting. The basis of the partnership is the shared goal of offering students/recent graduates an opportunity to broaden their knowledge and enhance their skills. Therefore, it is important to maintain a learning component throughout the internship and have staff available to guide, coach and/or mentor the student/recent graduate.  Internship opportunities provide students with professionally-oriented activities that enable them to experience work similar to that of a new entrant in the field. Assignments often relate to the intern's academic major or to a professional field where that academic knowledge can be applied. Through internships, students utilize knowledge gained in the classroom and are offered opportunities for hands-on experience.  Note: Only those applicants invited to continue in the process will receive further notification. This is an unpaid, non-benefitted position. EXAMPLES OF DUTIES, RESPONSIBILITIES AND EXPECTATIONS The following provides a sample guide to the internship program, which may include but not be limited to the following areas: Schedule/Attendance: Interns will coordinate weekly working hours with their supervisor. All interns are responsible for arriving on time for their scheduled commitments. In the event that an intern will be late or absent, the supervisor must be notified in advance. The department may determine how this is to be reported. If the supervisor cannot be reached, the intern should report absence or tardiness to the on-duty watch commander. Tracking/Reporting Hours: Interns are responsible for tracking and reporting their volunteer hours. Intern managers will set up an account for the interns and monitor hours. Proper Attire/Grooming: Interns are responsible for presenting a professional image to the public. Interns should dress appropriately for the conditions and performance of their duties as well as maintain good hygiene and grooming while working. Certain positions require specific attire/ grooming requirements which are left to the reasonable discretion of the Department and/or are covered previously in this policy.  Time Commitment  Internships are primarily offered over the summer months and require a minimum of 20 hours per week for two or more months. Schedules may vary, depending on specific tasks and intern availability. Typically, hours can be scheduled between 8 am and 5 pm, Monday through Fridays. Applicants able to schedule the minimum hours/duration listed for the internship typically gain a more in-depth experience. Benefits Available to Intern: The internship program is an unpaid internship that does not lead to permanent employment or include employee benefits. However, the position offers participants an excellent experience in working within a 24 hour police facility. It also provides an opportunity for interns to explore career options, gain knowledge and skills that complement their academic studies, build resumes and network with law enforcement professionals.  For more information on the internship program, please view the Redondo Beach Police Department's Volunteer Policy by clicking here. MINIMUM QUALIFICATIONS Those applying for an internship with the Redondo Beach Police Department are expected to have completed their third year at an accredited college or university prior to the start date of the internship. Suggested areas of study may be Administration of Justice, Social/Criminal Justice, Forensic Science, Criminology, Criminal Justice Crime Mapping and Data Analysis, Homeland Security and Emergency Management, Communications, Corrections and Case Management. Other related areas of study may be accepted. Application Process: The application process starts with a submission of a resume, cover letter or letter of interest and unofficial transcripts. All documents should be attached at the time of electronic application submission. Selected candidates will be interviewed by the project leader(s) and intern coordinator for placement.  The cover letter is an opportunity for applicants to describe career and academic goals and to elaborate upon personal interests/accomplishments related to the internship. Prospective interns shall include their GPA (must be a minimum of 2.5), preferred start and end dates for the internship along with alternate dates, number of hours that can be scheduled on a weekly basis and days/times available to schedule internship hours. In addition, the resume must include relevant education, work experience and community involvement.  Cover letters or letters of interest, resumes, and unofficial transcripts will assist in matching applicants with projects as they become available for internship placement. SUPPLEMENTAL INFORMATION Background Investigations will be conducted on applicants who have successfully interviewed for the internship and wish to pursue placement.  The background investigation shall include a background interview that requires an intensive in-person interview and LiveScan fingerprinting.  The following documents must be completed by qualified applicants during the background investigation: Personal History form (includes employment history and arrest record)Notarized Authorization to Release Information form As part of the background investigation, applicants will be required to provide five to ten references along with original copies of the following documents: Birth certificate (original or certified copy) or if applicable, naturalization certificate/resident cardValid, state issued driver's licenseHigh school and college diplomas and official transcripts (must be sealed and in unopened envelope)Proof of current automobile liability insurance coverage (listing applicant as insured driver)SDL2017"}