{"jobID": "2778729836", "jobLocation": "San_Jose_CA", "jobTitle": "Corporate Business Development Intern", "companyRating": null, "companyInfo": {"Website": "www.efi.com", "Headquarters": "Fremont, CA", "Size": "1001 to 5000 employees", "Founded": " 1989", "Type": " Company - Public (EFII) ", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Durst Image Technology, Agfa Graphics"}, "estimatedSalary": null, "jobDescription": "WE are Self-starters, WE are Passionate, WE are Relationship builders, WE are Innovative, We are Nimble, and WE are Transparent…WE are SPRINTers! We believe in challenging you, then providing you the room and flexibility to deliver.  We are looking for a Corporate Business Development Summer Intern. We pay our interns. That’s because all interns should be paid. And that’s because they’re doing work that is important. If a company has interns that aren’t doing worthwhile work, then why have them? Better yet, why does this work even need doing in the first place?! Oh and no intern gets anyone coffee. Coffee here is free and is only about 8 steps from the farthest chair. Interns do real work.  An internship position at EFI allows college students to obtain real-world industry experience by applying skills and knowledge learned through college coursework. The position will also expose the candidate to the business side of Marketing and prepare the candidate for employment after graduation Job Description: This position resides in the Corporate Business Development unit of EFI. It is a full-time paid Internship position, approximately 40 hours per week, for the summer. The Corporate Development Training Program at EFI will focus on the following major areas: Acquire in-depth knowledge of key financial performance index and company evaluation techniques including financial multiples, precedent transaction analysis, dividend discount models and discounted cash flow analysisLearn how to utilize different information sources, tools and resources to produce a compelling report on competitors, potential acquisition targets including publicly available financial reports, annual reports, analyst reports, web resources, subscriptions to online data services, market research, industry experts, trade associations, trade shows, etcTo acquire in-depth knowledge of formal multi-step process used by EFI in its mergers and acquisition processLearn how to analyze a new market segment in terms of size, growth, segmentation, customer behavior, major trends, competitive dynamics, jey success factors The participant’s training will take place in the Corporate Development group at EFI headquarters in Fremont, CA. During the program, the Trainee will also interact with other departments, such as: Accounting, Tax, Finance, Sales, Legal, Administration, Products, and external consulting firms. Job Requirements:Currently enrolled in a BA or BS program; marketing, communications, or graphic design programs preferred.Strong financial, analytical, business savviness skills.Team player with strong interpersonal and communications skills.Knowledge of variable data processing a plus.Works independently with the ability to multi-task while having excellent attention to detail.We move quickly, with the purposeful intention of solving a problem, accomplishing a goal, and ultimately making a difference for our customers, partners, colleagues and shareholders, EFI SPRINTers take action and adapt to changes in order to transform our customers businesses to be more productive and profitable through innovation in a digital print business.EFI is an “Affirmative Action/EEO/Protected Veteran/Disabled Employer”"}