{"jobID": "2785242543", "jobLocation": "Oakland_CA", "jobTitle": "Environmental Scientist, Engineering Interns", "companyRating": "3.4", "companyInfo": {"Website": "www.tetratech.com", "Headquarters": "Pasadena, CA", "Size": "10000+ employees", "Founded": " 1966", "Type": " Company - Public (TTEK) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": " Tetra Tech Inc. is currently seeking motivated individuals who would like to help improve environmental quality on and near the Navajo Nation. We will be hiring 2 or 3 interns to work on our Navajo Area Uranium Mines (NAUM) Response, Assessment, and Evaluation Services (RAES) contract. We are looking for candidates who are studying, and want to learn more about, Environmental Science, Engineering or Radiation Health.  Tetra Tech is supporting the U.S. Environmental Protection Agency (USEPA) in coordination with the Navajo Nation Environmental Protection Agency (NNEPA), to conduct site assessment, site characterization, human health and ecological risk assessment, and cleanup evaluation projects under Comprehensive Environmental Response Compensation and Liability Act of 1980 (CERCLA). The work on the contract is primarily related to historic uranium mining that may have impacted land, water, air, and structures on or within the Navajo Nation (within Arizona, New Mexico, and Utah) and within the Grants Mining District (located in New Mexico).  For more information on the RAES program please click here: http://raes.tetratech.com  Interns will work in scientific, engineering, technical, logistics, and public outreach disciplines toward the goal of protecting human health and the environment. Day to day job responsibilities may include report writing, research, field work, sample collection, data analysis, and meeting support, and other duties as needed. In addition, you will: Execute field and office assignments that have clear and specific objectives and require the investigation of a limited number of variables.Perform preliminary site assessments (PA), site inspections (SI), removal site evaluations (RSE) and expanded site inspections (ESI) on sites with radionuclide and non-radioactive hazardous substances. Tetra Tech is a leading provider of consulting, engineering, and technical services worldwide. Our reputation rests on the technical expertise and dedication of our employees16,000 people working together across disciplines and time zones to provide smart, sustainable solutions for challenging projects. We are proud to be home to leading technical experts in water, environment, infrastructure, resource management, energy, and international development. Tetra Tech combines the resources of a global, multibillion dollar company with local, client-focused delivery in 400 locations around the world. We offer competitive compensation and benefits and are searching for innovative people to join our teams The ideal candidates will:Be familiar with, or have the desire to learn, both U.S. EPA and U.S. NRC regulations and guidance documents for purposes of site characterization, including but not limited to CERCLA, RCRA, MARSSIM, and MARLAP.Be familiar with, or have the desire to learn, Geographic Information Systems (GIS) software techniques for geospatial analysis and mapping.Possess or have strong desire to learn and implement complex radiological monitoring techniques and site characterization studies.Have familiarity with naturally occurring radioactive materials (NORM) or technologically enhanced natural occurring radioactive materials (TENORM) in uranium mining, Oil and Gas, or other industries.Have experience using computer software including MS Office, Word and Excel spreadsheets is a plus.Enjoy spending long days outdoors and hiking at remote sites on and near the Navajo Nation when performing field work.Have knowledge of Native American culture and/or language is preferred.Be an undergraduate student, or non-degreed technician, learning practical scientific or environmental engineering subjects. This position requires you to drive on a regular basis and will require passing a motor vehicle record (MVR) background check.  The work involves both office and field environments. Field work is anticipated to be in remote areas of Arizona, Utah, and New Mexico. You must be able to carry field equipment (35 to 40 pounds) and don personal protective gear, as needed. You must also be able to work in outdoor areas during all seasons. This position may require up to 50% travel.  For more information on our company, please visit our website at www.tetratech.com. To apply, please submit your resume and cover letter on the Careers portion of our website at www.tetratech.com/careers.  We thank all applicants for their interest; however only those selected for an interview will be contacted. Tetra Tech is committed to creating a diverse environment and is proud to be an Equal Opportunity Employer. We invite resumes from all interested parties including women, minorities, veterans and persons with disabilities.  Tetra Tech is a VEVRAA federal contractor and we request priority referral of veterans for available positions.  EOE AA M/F/Vet/Disability - No calls or agenciesSDL2017"}