{"jobID": "2678413337", "jobLocation": "San_Francisco_CA", "jobTitle": "Software Engineering Intern", "companyRating": null, "companyInfo": {"Website": "www.shoguninc.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2016", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About Shogun Shogun (www.shoguninc.com) helps homeowners make better decisions about financing their home improvements. Although beautiful HGTV kitchens may come to mind when most people think of home improvements, many Americans unfortunately need urgent home repairs when their roof unexpectedly leaks or their foundation fails. Shogun has built technology to simplify the process of finding financing for those critical projects. We partner with contractors to ensure that their customers are able to see competitive rates, and we empower homeowners with information and technology as they make critical, time-sensitive decisions. In this effort, we are supported by 8VC, Founders Fund, and other prominent leaders in Silicon Valley. Shogun is growing fast and looking to add talented, diverse team members! About the role Shogun is seeking engineers with full-stack product or system architecture experience pursuing a degree in computer science, math or a related field (BS/MS). As part of our small, but rapidly growing team, you have opportunities to work on high impact projects that span across many departments. This is a paid internship.What we value Always be shipping Do things right the first time Simplicity over complexity Proactive rather than reactive Know when to grind Communication before codeRequirements Leadership - We surround ourselves with people who want to help each other grow. The success of any startup is a function of its teams ability to grow and learn. Fast learner - We like those who arent afraid to jump into the unknown and figure things out. Autonomous - We expect engineers to take projects from inception to production. You have the ability to make a huge impact on the success of the business. Teamwork - You should be empathetic and want to win together. You should be ready to give and receive candid feedback. Together we can build a great business. Hardworking - Jumping into the unknown takes relentlessness and an enduring courage. Hard work is at the root of a successful outcome. Excellent written and verbal communication skills - We try to always cross the t's and dot the is.Location San Francisco, CAMore About Us Shogun embraces diversity. We are proud to be an equal opportunity workplace and do not discriminate on the basis of sex, race, color, age, sexual orientation, gender identity, religion, national origin, citizenship, marital status, veteran status, or disability status. Pursuant to the San Francisco Fair Chance Ordinance, we consider for employment qualified applicants with arrest and conviction records."}