{"jobID": "2648957353", "jobLocation": "Boston_MA", "jobTitle": "Software Engineering Intern - Fall", "companyRating": "3.5", "companyInfo": {"Website": "www.datto.com", "Headquarters": "Norwalk, CT", "Size": "1001 to 5000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "58000", "jobDescription": " Software Engineering Intern - Fall 2018Boston | Norwalk | Rochester  Datto protects business data and provides secure connectivity for tens of thousands of the world’s fastest growing companies. Datto’s Total Data Protection solutions deliver uninterrupted access to business data on site, in transit and in the cloud. Thousands of IT service providers globally rely on Datto’s combination of pioneering technology and dedicated services to ensure businesses are always on, no matter what. Datto is headquartered in Norwalk, Connecticut and has offices in Monroe, Rochester, Boston, Portland, Toronto, London, Singapore, Sydney, Frankfurt, and Amsterdam. Learn more at www.datto.com.  We are seeking a Software Engineering Co-op/Intern for our top-flight engineering team. The engineering team at Datto is a highly collaborative organization consisting of engineers with the highest levels of technical depth, programming skill, and a passion for quality. As a Software Engineering Intern you will have the opportunity to write cutting edge backup solutions, and work in Agile teams side-by-side with our full-time engineers, taking on as much coding responsibility as your talents permit.  For candidates that do not have housing within a commutable distance to our Boston or Norwalk office, Datto provides low cost housing for the length of your internship/co-op or a stipend. Primary Responsibilities:Actively participate as a member of a Scrum team in collaborating, conceiving and developing scalable, performant, secure solutions for Datto’s productsProgram in a Linux-heavy (Ubuntu) environmentSupport and contribute to the improvement of the development processUnderstand and practice the team’s software development process while exhibiting Datto’s core valuesDesired Skills & Experience:Pursuing BS, MS or PhD in Computer Science or related fieldPrevious programming experience with object oriented programming languages (PHP, Java, C++, Python etc.)Deep understanding of Linux and the command line toolsKnowledge of relational databases, specifically MySQLA passion for creatively solving problems Apply NowBack to Careers Listing"}