{"jobID": "2761863041", "jobLocation": "Long_Island_City_NY", "jobTitle": "EMT - Basic", "companyRating": "2.9", "companyInfo": {"Website": "www.seniorcareems.com", "Headquarters": "Bronx, NY", "Size": "501 to 1000 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Assist Ambulance, Richmond County Ambulance, Hunter EMS"}, "estimatedSalary": "15", "jobDescription": "Job Title EMT - BasicLocation Long Island, NY SeniorLIDepartment Field OperationsFLSA Status Non-ExemptShifts hiring Part-time, Full-time, Night Shift, WeekendsACCOUNTABILITY: The EMT-B is qualified in basic prehospital emergency care and services by a competency-based educational program of clinical, didactic, and practice. The EMT-B is licensed to operate an emergency vehicle and provides prehospital basic life support (BLS). The standard of practice of the EMT-B shall be in accordance with the most current edition of the US DOT “Emergency Medical Technician: National Standard Curriculum”, as modified by the NYS DOH and NYC REMAC. DESCRIPTION OF DUTIES:Conducts a careful examination of the patient for signs and symptoms of illness/injury and assists other medical personnel as necessary.Provides prompt and efficient care of the patient and stabilization of their condition prior to transport.Provides careful handling of the patient in moving them to the ambulance.Provides safe and efficient transport of the patient while constantly monitoring the patient and providing any appropriate continuing care.Provides orderly transfer of the patient at destination.Upon arrival at destination with patient, responsible for preparing all BLS supplies and equipment to place the unit back in service.In the absence of other qualified personnel, controls the accident scene, in such a way as to minimize further danger as well as controlling the actions of bystanders.Obtains information regarding the emergency from dispatch, communicates with other emergency personnel as needed, and alerting hospital emergency department staff of the arrival of patients.Obtains and records information as well as those required by medical, legal, and health authorities. Is responsible for documenting diagnosis/illness categories and completion of all patient care related documents.Makes daily checks of the vehicle equipment and systems, and completes manifest; responsible for competent operation of all equipment and systems.Reports and relays needed repairs to supervisor.Responsible for maintaining NYS DOH certification.Administers basic pre-hospital care within the limits of certification and in accordance with approved protocols.Attends training as scheduled.Does not use professional knowledge and skills in any enterprise detrimental to the company or to the public well-being.Respects and holds in confidence all information obtained in the course of professional work unless required by law to divulge such information.Responsible for upholding standards of practice and education.Adheres to standards of personal ethics, on and off duty, which reflect credit upon the profession.Protects the public by not delegating to persons less qualified, any service which requires the professional competence of an EMT-B.Refuses to participate in unethical procedures, and assumes the responsibility to expose incompetence or unethical conduct of other to the appropriate authority in a proper and professional manner.Performs other duties as required by respective supervisor.PHYSICAL STRENGTH REQUIRED:Must be able to lift a minimum of 250 pounds with assistance from one other qualified individual.Must be able to lift and move a 50-75 lb. ambulance stretcher with the help of one qualified individual.Must be able to lift a 175 lb. patient (in various positions, i.e., while lying on the floor, the bed, in an automobile, etc.) with the help of one qualified individual onto a stretcher.Meet minimum requirements of SCEMS Physical and Physical Assessment Test.ENVIRONMENTAL CONDITIONS:Must be adaptive to work in all types of weather conditions, including, but not limited to, rain, snow, heat, etc.Due to the uncontrolled environment in which the EMT-B works, he/she may be subjected to predisposing themselves to be at risk for: A. bodily harm  B. exposure to bloodborne pathogens and other potentially infectious materials (OPIM). KNOWLEDGE, SKILLS, AND ABILITIES:Able to drive in normal and adverse conditions.Skillful in thinking and acting quickly in stressful situations.Able to function around seriously ill or injured people in a responsible manner.Able to maintain harmonious relationships with fellow crew members, public safety personnel, and the general public under stressful situations.Good knowledge of common physical illnesses, obvious symptoms, and appropriate medical terminology.Skillful in the application of BLS emergency care procedures and in the use of all equipment maintained on ambulances.Skilled in use of locator aids to find specific locations (maps, directories, etc.).Has full knowledge of rules of the road for emergency and non-emergency situations.Able to drive in accordance with SeniorCare safety standards. Passes all driver examinations, written, and road tests.Avoids driving infractions, on and off duty, in accordance with Company and insurance guidelines.Conducts themselves in a professional manner while on duty and avoids inappropriate conduct, on and off duty, that may adversely affect the reputation of SCEMS.Able to express self effectively to both medical and lay personnel orally and written in the English language.Able to deal sympathetically with patients and others.Reflects the standards of professionalism in appearance with neatness and cleanliness.Has good working knowledge of all company policies pertaining to this position.Complete knowledge of protocols and their applications.Is physically fit. Meets all physical requirements for this position.ESSENTIAL REQUIREMENTS:Has no physical disability which would prohibit the lifting and carrying of heavy weight.Has quick reflexes and superior safe driving ability.Has no established medical history or any other medical condition which may interfere with their ability to control and operate a motor vehicle or provide patient care.Must be currently NYS DOH certified EMT-B.Must possess a valid driver’s license.Current BCLS certification from AHA. TITLE: EMT- B  ORGANIZATION: Operations  EXEMPTION STATUS: Non-Exempt  SUPERVISED BY: Field Supervisor, Operations Manager"}