{"jobID": "2823993040", "jobLocation": "Palo_Alto_CA", "jobTitle": "Intern, Database and Data Management Product Marketing", "companyRating": "4.4", "companyInfo": {"Website": "www.sap.com", "Headquarters": "Walldorf, Germany", "Size": "10000+ employees", "Founded": " 1972", "Type": " Company - Public (SAP) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Salesforce, Oracle, Microsoft"}, "estimatedSalary": "79000", "jobDescription": "Requisition ID: 176343 Work Area: Information Technology Expected Travel: 0 - 10% Career Status: Student Employment Type: Limited Full Time COMPANY DESCRIPTION As market leader in enterprise application software, SAP helps companies of all sizes and industries innovate through simplification. From the back office to the boardroom, warehouse to storefront, on premise to cloud, desktop to mobile device – SAP empowers people and organizations to work together more efficiently and use business insight more effectively to stay ahead of the competition. SAP applications and services enable customers to operate profitably, adapt continuously, and grow sustainably. Intern, Database and Data Management Product Marketing    Position and Objectives  SAP is seeking a product marketing intern to join an innovative and collaborative team responsible for marketing the SAP Database and Data Management (DDM) solutions, specifically around new market opportunity analysis for the DDM portfolio. The focus is to support the DDM product marketing content, work with leaders from development and GTM organizations as well as create messaging & positioning documents. Additional responsibilities include developing content for analysts and community influences.    Responsibilities and TasksDefine portfolio positioning & messaging: Develop positioning & messaging by customer segments that identify white-space opportunities, demonstrate the business value of SAP Database and Data Management solutions, and differentiate the platform from its competitors.Develop portfolio product marketing assets: As a subject matter expert collaborating with product marketing colleagues, product management, solution management, and ecosystem, develop core SAP Database and Data Management solutions, including customer facing presentations, white papers, solution briefs, product videos, high-level demos, Web content, and so on.Develop marketing programs: Provide product expertise & content to global and regional field marketing to generate demand from the top of the funnel (e.g. awareness) to the bottom of the funnel (e.g. pipeline acceleration), including development of offers such as: 3rd party thought-leadership white papers, infographics, videos, Webinars, event-in-box, tele-guides, landing page / email content)Generate external awareness: Lead and drive the digital and social media strategy to maximize visibility for SAP Database and Data Management solutions. Ensure solutions are well represented in all digital channels (sap.com, SAP Community, search, Twitter, LinkedIn, Facebook, etc.).Influence analysts: Keep abreast of industry trends, lead response to Gartner, Forrester, and IDC vendor assessments, develop technical and business presentations for analysts and participate in analyst briefings to influence analysts and obtain leadership status.Compete effectively: Working with product management and competitive market intelligence (CMI) teams, analyze market and competition, differentiate SAP Database and Data Management capabilities, and re-frame competitive attacks to highlight the value of SAP solutions. Develop competitive marketing programs as appropriate.Enable sales: Working with go-to-market and partner teams, develop sales enablement materials, such as solution presentations, what’s new FAQs, battle-cards, objection handling, tele-sales guides, etc. Identify and promote unique use cases that demonstrate how technology innovation leads to business value.Manage the business: Support the foundational responsibilities of running the SAP Database and Data Management business including driving the integrated marketing plan, Global Campaign plan, quarterly business review, budget, reporting (pipeline, review, customer), and internal and external newsletters.    Skills and ExperienceTechnology marketing experience in one or more areas desired (data management, analytics, information management, data integration, data quality, enterprise architecture, metadata management, and master data management)Technical marketing / product marketing experience for leading-edge products (1-3 years)Proven track record of delivering successful marketing programs to technical audienceSelf-motivated with the ability to anticipate problems and offer alternate solutionsTeam-oriented willing to roll-up sleeves when needed for overall team successExcellent communication and presentation skills, both written and spokenFamiliar with market reasearch or market opportunity assessmentBachelors or above degree in engineering, business, or related field    Qualifications Working toward a Bachelors, Masters or PhD SAP'S DIVERSITY COMMITMENT To harness the power of innovation, SAP invests in the development of its diverse employees. We aspire to leverage the qualities and appreciate the unique competencies that each person brings to the company.  SAP is committed to the principles of Equal Employment Opportunity and to providing reasonable accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team (Americas:Careers.NorthAmerica@sap.com or Careers.LatinAmerica@sap.com, APJ: Careers.APJ@sap.com, EMEA: Careers@sap.com). Requests for reasonable accommodation will be considered on a case-by-case basis. EOE AA M/F/Vet/Disability: Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, gender, sexual orientation, gender identity, protected veteran status or disability. Additional Locations:"}