{"jobID": "2741716472", "jobLocation": "Boston_MA", "jobTitle": "Executive Talent Sourcer", "companyRating": null, "companyInfo": {"Website": "www.libertymutualgroup.com", "Headquarters": "Boston, MA", "Size": "10000+ employees", "Founded": " 1912", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Travelers, Allstate, State Farm"}, "estimatedSalary": null, "jobDescription": "Advance your Human Resources career at Liberty Mutual Insurance- A Fortune 100 Company!Summary:It is an exciting time for Diversity & Inclusion at Liberty Mutual Insurance. Diversity and inclusion play an important role because they are directly tied to engagement, innovation and market competitiveness. For us to continue to succeed in the global marketplace, we must attract and retain the right skills and the best, most diverse, talent. In order to do this, we are focused on building the cultural dexterity and collaboration skills of every employee.The Executive Talent Sourcer is a newly created role, and will be responsible for helping to advance the diversity recruitment strategy by identifying and building diverse candidate slates at the executive level across Liberty Mutual. The Diversity Sourcer will work closely with the executive recruiting team to produce comprehensive talent market data, which will inform our sourcing strategies, as well as identify and qualify diverse pools of candidates. The Diversity Sourcer will be passionate about helping drive our diversity and inclusion efforts, including developing innovative recruiting strategies and a network of strong, diverse talent. The Diversity Sourcer will partner closely and work in alignment with our D&I; office.Responsibilities:Sourcing Portfolio: generates talent prospects and pipelines for active and future needs for a variety of executive level roles across Liberty Mutual:Identifies and develops diverse candidate pools at the executive level across the enterprise for both active and future needsPartners with recruiters and hiring managers to problem solve, create go-to-market strategies, and define candidate identification strategy for assigned roleConducts market analysis and industry research to inform and develop sourcing strategySources potential and passive candidates through direct channels, social media, internet sourcing, extensive name generation research and relationship buildingContinually expands network and prospect pipelines through leveraging user groups, blogs and networking eventsClearly articulates and sells Liberty Mutual value proposition to candidates via networking events, professional networks and phone interactionsGenerates candidate interest through creative marketing and social media messagingEstablish regular and timely communication with the executive recruiting and enterprise sourcing teams to ensure transparency of statusUtilizes full functionality of CRM to manage and document the sourcing processIdentifies opportunities and recommends solutions to improve recruiting service deliveryCollaborates with outside network of diversity & inclusion professionals to identify best practices in sourcing talentIdentify and serve as a talent acquisition liaison with external partnerships and key diversity organizations on behalf of Liberty MutualNote: Boston is preferred location, but other locations will be consideredQualifications:Bachelors degree required5+ years of progressive diversity & inclusion and/or talent experience with demonstrated experience integrating diversity & inclusion and understanding of unconscious bias in the recruiting processPrior experience in developing targeted diversity recruiting strategies and implementing global approaches to attract and hire the right talent at the right timeProficiency and passion for research and sourcing through direct channels, social media, internet sourcing, name generation research and networkingExcellent written and oral communications skills with varied audiencesSound judgment, high integrity, and ability to maintain strict confidentialityExperience utilizing Boolean search methodology and Chrome ExtensionsResourceful sourcer and networker who derives motivation from prospecting and understands importance of cultivating diverse candidate slates for the purpose of developing long-term relationships with candidatesInfluential and creative written and verbal communication to develop appealing and tailored messaging to prospects that elicits response and effectively conveys our brandHighly collaborative, capable of developing strong working partnerships with the broader experience talent acquisition teamExperience utilizing web-based applicant tracking or candidate relationship management systemsStrong attention to detail, organizational skills and time managementAble to flex and problem solve to manage competing demands in a fast paced, metric driven environmentResults oriented self-starter with track record of personal accountability, strong work ethic and integrityBenefits:We value your hard work, integrity and commitment to positive change. In return for your service, its our privilege to offer you benefits and rewards that support your life and well-being. To learn more about our benefit offerings please visit: https://LMI.co/BenefitsOverview:At Liberty Mutual, we give motivated, accomplished professionals the opportunity to help us redefine what insurance means; to work for a global leader with a deep sense of humanity and a focus on improving and protecting everyday lives. We create an inspired, collaborative environment, where people can take ownership of their work; push breakthrough ideas; and feel confident that their contributions will be valued and their growth championed.  Were dedicated to doing the right thing for our employees, because we know that their fulfillment and success leads us to great places. Life. Happiness. Innovation. Impact. Advancement. Whatever their pursuit, talented people find their path at Liberty Mutual.Job: Human Resources Primary Location: United States-Massachusetts-Boston Schedule: Full-time Salary: $82,000-$114,900 Education Level: Bachelor's Degree (±16 years) Travel: Yes, 10 % of the Time"}