{"jobID": "2460013718", "jobLocation": "New_York_NY", "jobTitle": "Client Services Project Manager (US)", "companyRating": "3.7", "companyInfo": {"Website": "www.themindgym.com", "Headquarters": "London, United Kingdom", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "66000", "jobDescription": "The Project Managers (PM) role is to galvanise both internal and external teams to get things done while ensuring all bases are covered. Being the tenacious diplomat, the PM will use their expertise to ensure collaboration through ambiguity and sometimes conflicting goals with both internal and external stakeholders. The PM is the bridge between all stakeholders to ensure project budgets are met while exceeding client expectations.The PM will have a heavy focus on development programs and projects while maintaining strong strategic relationships with their set accounts. Having a strong commercial acumen, the PM balances the need to follow procedure and deadlines while maintaining the flexibility to exceed client expectations.Project Managers live by the mantra that the devil is in the detail but also has the ability to zoom out and see the bigger picture when necessary. To the clients the PM is the face of Mind Gym, being the knowledge keeper and promoter for the clients business as well as overall experience. Working with an Associate and the internal teams, the full client life-cycle is seamless and accurate.This will include:Account and Stakeholder Management  Acts as a trusted advisor, using an expert knowledge of Mind Gym and having a full understanding of clients industry and company needs.Ensures all sessions and programs will deliver maximum impact while meeting company constraintsForms strong strategic relationships with clients through ongoing relationship managementTakes ownership in identifying and cultivating commercial opportunities with other teams, while keeping all stakeholders informed Project Management Following the feedback loop process for all sessions, ensuring that errors are investigated and all stakeholders are communicated withUsing project management and CRM tools, build and manage project plans ensuring projects are properly resourced and deadlines are met, and creates and manages both development and delivery bookings to ensure accuracy in their impact for commercial reportingActs as the core to any project, rallying teams and ensuring projects are properly resourced throughout their lifecycle. Upon signs of failure, appropriately escalates Teamwork Take a profound interest in the well-being of all members of the Mind Gym familyMentors others through ongoing support and leading sessions in the onboarding process for new employeesCoaches and oversees other team members across all projects and programs, ensuring all KPIs are met and any performance concerns are shared with relevant managers.With a focus on continuous improvement, spots opportunities for more effective ways of working flags not only problems but also recommended solutions to Team Lead and Operations team About you Exceptional communication skills and the ability to form strong relationships with clients at all levels of organizationsExtensive experience independently managing cross functional projectsStrong written and verbal communicationHigh professional standards of excellenceExcellent ability to diffuse tense situationsAbility to sell services and products to existing client baseBachelors degree or equivalentStrong desire and keen interest to constantly be learningMeticulous and detail oriented"}