{"jobID": "2816457003", "jobLocation": "City_CA", "jobTitle": "Clinical Data Analyst (REMOTE)", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Comprehends Clinical Data Analysts are responsible for leading the technical aspects of a Comprehend product implementation. You will work closely with our customers (Clinical trial sponsors and CROs) at the executive and study team level to bring Comprehend solutions to our customers. The Clinical Data Analyst will play the role of Implementation Consultant or Solution Architect on project implementations. The primary functional of this role is to be the technical lead of the project implementation, define technical requirements to address the customer's business needs, and drive the data mapping and analytics solution design.Once you become well versed in the Comprehend product, you will be involved in pre-sales conversations to highlight how our product will help customers. This role has the potential to grow into a management/leadership position for high performers. This position will report to the VP of Customer Success.WHAT WE LIKE ABOUT YOU:You enjoy working with data and data models. Integrating, transforming, cleansing, visualizing and understanding it.You have amazing problem solving, organizational, and time management skills; along with the ability to work independently, within the team, and cross-functionally while paying close attention to detailYou are comfortable engaging in business and technical conversations in a Clinical Operations setting and can make recommendations to solve business problems with a Comprehend solution.You have experience working with and implementing Enterprise/SaaS applications.You have the ability to translate customer needs into requirements and test plan documents.You have domain expertise around Clinical Trials (Recruitment, Study startup, CRO management, Site and Medical Monitoring, Trial Closure, Database Lock) and Clinical Trial systems.Familiar with CDISC standards such as SDTM and mapping disparate data to an SDTM structure.Comfortable writing SQL and using BI tools to design and build analytic dashboards.You bring credibility when meeting with key customer contacts: Study Managers, Data Managers, System Admins and ClinOps Executives.You have an understanding of visual design principles and the ability to communicate a story with the data.You are meticulous with your verbal and written communication and communicate effectively with customers.Familiar with Data Governance, Master Data Management and Data Quality processes/concepts.WHAT YOU WILL DO:Lead the solution design of multiple customer engagements.Support Comprehend project managers as the technical advisor on the project.Work closely with customers to understand their source systems, profile their data and help make design decisions during the data mapping process.Participate in analysis and mapping of customer requirements to available Comprehend applications.Define data model extensions and customizations to meet unique customer needs.Implement the Comprehend application through configuration and customization.Create complex data visualizations using Comprehends analytics solutionBe available to offer technical expertise during pre-sales and post-sales activities.WHAT YOUVE ACCOMPLISHED:Bachelors degree, preferably with a technical bent (e.g. Information Systems).4+ years of experience in at least one of the following areas: software application implementation, Clinical data management and reporting, Packaged software solution architecture, data integration, or technology consulting, preferably in an Enterprise/ SaaS environment.2+ years of experience at one of the following strongly preferred: Clinical research organization, technology consulting firm, pharma, medical device, or biotech organization.Expertise in designing and writing SQL is required.Experience with clinical trial data is strongly preferred. Experience working with common clinical trial systems (EDC, CTMS, Labs, Safety Systems, IXRS, IRT) such as Medidata Rave, Oracle Inform, Oracle CTMS, Argus, CRO systems is preferred.Any experience with business intelligence tools (Spotfire,Looker, Good Data, OBIEE, Business Objects, Birst, Tableau, QlikView, Pentaho, Informatica) is a plus.About Comprehend SystemsComprehend, the leader in Clinical Intelligence solutions, is focused on accelerating treatments to patients. Our suite of software applications provide clinical operations, data management and medical review teams with the critical insights and automation they need to improve the speed, safety and quality of their clinical trials. Designed to unify, monitor and analyze clinical data across disparate sources in real-time, Comprehend's Cloud software delivers solutions for CRO oversight, centralized monitoring, risk monitoring, data review and medical monitoring. Comprehends investors include Sequoia Capital, Lightspeed Venture Partners and Eminence Capital. Learn more at www.comprehend.com."}