{"jobID": "2728038273", "jobLocation": "New_York_NY", "jobTitle": "Area Manager/ Trainer", "companyRating": "4.0", "companyInfo": {"Website": "www.wservices.com", "Headquarters": "Hauppauge, NY", "Size": "201 to 500 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Global Facility Management & Construction, BOSS Facilities, Kellermeyer Bergensons Services"}, "estimatedSalary": "56000", "jobDescription": "W Services Group, LLC leading North American Facilities Management organization is currently recruiting for a Area Manager/Trainer to work with direct employees in retail locations for the NY Metro & Long Island areas. The Area Manager/Trainer must have own transportation and be willing to travel throughout these territories. W Services Group has a generous reimbursement program to cover mileage expenses. The ideal candidate will assist with training, development, monitoring and inspect cleanliness to ensure that the client's scope of work is being adequately carried out.*Only candidate with experience will be considered*Field Staff Development Manager Requirements:• Must be able to work independently with little supervision• Must be Bilingual English/Spanish• Available to work weekends - Have own transportation• Positive and out-going personality; a good relationship developer -- Excellent verbal and written communication skills• Must be knowledgeable in regards to janitorial & floor care chemicals & equipment such as an auto scrubber, 175rpm buffer, chemical dilution, MSDS, OSHA safety and process efficiencies.• Previous employee training and development experience• MS Office: Proficient in Word, Excel and Outlook Responsibilities:• Identifies training and development needs within the company through job analysis, and regular consultation with Field Managers, Clients & Human Resources• Designs training and development programs based on the needs of the company, clients, and the individual;• Researching new technologies and methodologies in the workplace to meet client demands• Act as liaison with Field Managers and interview as necessary to identify and assess training and development needs• Delivering/overseeing the delivery of training to individuals or groups of employees; as well as Onboarding.• Compiles and presents information to Sr Field Ops Manager, Human Resources, and VP Client Support -- recommends promotion/termination based on employee work standards.• Keeps up to date with company & client developments/training by reading relevant journals, going to meetings, emails, job scopes and attending relevant courses;• Conducts job evaluation surveys, as needed• Manage vendor and self-performed services within the territory.• Communicates with our Corporate Office and Sr. Field Operations Manager daily.• The completion of a pre-set visitation and inspection program monthly.• Sanding & cleaning knowledge preferred.W Services Group offers a comprehensive benefit packageMedical, Dental & Vision Insurance PackagePaid PTO & Holiday Pay401K * Competitive PayAdvancement OpportunitiesExpense reimbursementW Services Group, LLC, corporate office is located in Hauppauge, NY who provides commercial cleaning, flooring and emergency services. We are founded on the principles of a family business atmosphere of caring, listening, respecting, trusting and believing in strong business morals. Our commitment to our clients is simple. Provide and execute quality services with supervised active management, while maintaining a customer centric business model. We value customer retention and relationships first and foremost. We know successful programs are created when there is understanding, communication and a partnership with both our customers and our employees. Today W Services has over 275 employees and works with 1000 plus carefully selected contractor partners. We have a full understanding of the retailers need to have high quality services performed by qualified technicians who have been properly trained and performance assessed through documented training and follow up programs. W Services Group will never waiver from these standards and our commitment to our business partners. For more information about W Services Group, LLC. visit our website www.wservices.comEqual Employment Opportunities (EEO) to all employees and applicants for employment without discrimination or harassment on the basis of race, color, religion, sex, sexual orientation, gender identity or expression, age, disability, marital status, citizenship, veteran status, genetic information, or any other characteristic protected by law."}