{"jobID": "2822537546", "jobLocation": "Boston_MA", "jobTitle": "Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.boston.k12.ma.us", "Headquarters": "Roxbury, MA", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " School / School District", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "67000", "jobDescription": " BPS is hiring a new analyst to join our team and expand our capacity to predict student enrollment trends, match academic programs to neighborhood needs, and to help the organization plan more thoughtfully. This is a unique opportunity to enter a large, urban school district and influence the way we serve our students.  The Organization  Founded in 1647, Boston Public Schools (BPS) is the oldest public school district in the country. With approximately 57,000 students from over 114 different countries, and a budget of approximately $1 billion, BPS is the largest school district in Massachusetts and is one of the most diverse as well. BPS has been recognized as one of the top urban school districts in the United States; in 2006, it was awarded the Broad Prize for Urban Education as the most improved urban school district in the nation.  The Team  The Planning and Analysis team consists of a small group of dedicated data strategists whose work focuses on how students flow throughout the district. We partner with external and internal teams to try to manage the unpredictable: where, when, for which program and at what grade level will students enroll in our schools. We need someone who can join our creative team to develop new and thoughtful ways to understand student enrollment.  We approach this work in a variety of ways, including: redesigning and automating reporting and other business processes; analyzing the impact of and making recommendations regarding potential policy changes; leading analytic projects in support of long-term planning within the district; and working with cross-functional teams to ensure new policies are implemented successfully. Our work is project rather than department based, so the new Data Analyst will have the opportunity to work in multiple areas including student assignment and choice, school and academic design, BuildBPS (the 10-year facilities master plan), and projecting future year enrollment. In addition, our work is very collaborative, so this is a great opportunity to work closely with a group of motivated and highly skilled data strategists as you advance your analytical, visualization and presentation skills.  Ideal Candidates  Candidates should have a demonstrated history of infusing the following traits into their work: Curiosity - We need people to help our organization drive improvement. We feel that this requires a healthy desire to discover how and why things work the way they do. We also want candidates to be able to look for those explanations in data and anything else that will help.Quantitative Orientation Some people think that everything is measurable, that all information can have a more precise and reliable measurement. This is who we want on our team; someone whose approach to everything is rigorous, inquisitive, and analytical.Persistence You will have to deal with messy datasets and new and evolving problems in an organization that is learning how to use data effectively. We need you to be able to work through a problem until it is solved, not until you reach a road block.Technical Skills If quantitative orientation is about a candidate's will to use data, this trait is about the skill. We need someone who is trained in computer science, statistics, mathematics, and/or economics. But we also want someone who is constantly acquiring technical skills and understands the value of a multidisciplinary approach to problem solving.Vision This role is about more than just using quantitative skills to answer other people's questions. We need someone who can help identify problems and opportunities, and who knows how to ask the right questions to address them.Teamwork We believe that excellent teams, composed of high-performing team members, can have an enormous impact. New team members are valued for their diverse experiences and commitment to service. They must also continuously seek input from a diverse set of perspectives and think critically about the impact of their work.RESPONSIBILITIES:Collaborate on and develop tools to improve the methodology for projecting future year enrollment. Review and evaluate feedback from school leaders and provide supporting analyses to help understand enrollment patterns.Inform the strategy of BuildBPS as a member of a cross-functional team tasked to review and provide supporting analysis for BuildBPS proposals.Leverage data and various databases to improve decision-making, understand trends and create management tools for school and district leaders.Partner with school leaders in understanding analyses and collecting needed data in order to develop school-specific strategic enrollment plans.Design and execute analyses to assess the impact of potential policy changes. Inform the discussion with important findings and recommendations in formal memos and/or presentations for internal and external audiences.Respond to both immediate and longer-term data requests with key insights and thoughtful analysis.QUALIFICATIONS-REQUIREDBachelor's degree required.Excellent analytical ability.Project management skills and strong orientation toward teamwork and collaboration.Experience translating data into easy-to-interpret, actionable reports, presentations, and findings.Proven Microsoft Excel skill set. Candidates should be considered at the \"intermediate\" level; for a brief working definition of intermediate, please refer to this article (https://www.linkedin.com/pulse/scale-one-ten-what-your-skill-level-microsoft-excel-charles-otoghile).Familiarity with analytical software platforms such as STATA, R, Tableau, SPSS, SQL, or at least one coding language is helpful with a preference for candidates with knowledge of STATA or R.Candidates with skills or experience in geospatial analytics, including ArcGIS or Tableau mapping, are highly encouraged to apply.Current authorization to work in the United States - Candidates must have such authorization by their first day of employmentQUALIFICATIONS-PREFERREDMaster's degree is preferred.Formal training in statistics, computer science or a related field preferred. TERMS: Managerial Tier C. This position is subject to the City of Boston residency requirement.  Please refer to www.bostonpublicschools.org/ohc (under \"Employee Benefits and Policies\") for more information on salary and compensation. Salaries are listed by Unions and Grade/Step.  The Boston Public Schools, in accordance with its nondiscrimination policies, does not discriminate in its programs, facilities, or employment or educational opportunities on the basis of race, color, age, criminal record (inquiries only), disability, homelessness, sex/gender, gender identity, religion, national origin, ancestry, sexual orientation, genetics or military status, and does not tolerate any form of retaliation, or bias-based intimidation, threat or harassment that demeans individuals' dignity or interferes with their ability to learn or work."}