{"jobID": "2614283954", "jobLocation": "New_York_NY", "jobTitle": "Associate Creative Director - Writing", "companyRating": "3.6", "companyInfo": {"Website": "www.vsapartners.com", "Headquarters": "Chicago, IL", "Size": "201 to 500 employees", "Founded": " 1982", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " R/GA, Droga5, Huge"}, "estimatedSalary": "125000", "jobDescription": " Overview  VSA was founded was a design firm more than 30 years ago with the belief that design is not only a craft, but a tool for achieving business objectives. As design thinkers, we approach business challenges holistically and aim to break down silos between branding, digital, marketing and advertising.  At the heart of VSA are great creative minds (and hands) that make artwork that works. We love what we do, and that will be our expectation during your time here - that you love what you are doing and that you make things that you are insanely proud of.  We are a collective of smart, dedicated, collaborative and kind people, who value smarts over ego. Great ideas come from everywhere but it takes an elite group of craftspeople to turn those ideas into meaningful, effective, and beautiful work. That is what we do here - we work very hard to create human inspired, human centered work that reaches people and inspires behavior changes.  The expectations for our Creative team members are high. We expect you to already have the passion for making great work, which will heighten during your time here. We value creative thinking and conceptual strength as much as we expect our candidates to have an unreal sense of what is right for each assignment and what is spot on for each application.  It goes without saying that we expect everyone who applies to VSA to have the ability to distinguish between good and great. Responsibilities Our writers solve business problems with creative solutions, so we are looking for problem solving minds that know and respect the power that words have. We are also looking for funny, focused, smart, kind and relentlessly candid (and constructive) “with the team” kind of folks.  We are looking for people who can throw the most and best solutions on the wall where each one has a different “a-ha” type of solution that solves the problem creatively and then turn around and tell them over and over until the clients can’t wait to produce them.  We are looking for candidates who possess the right combination of intelligence and insights. The people that can put the most and best solutions on the table and seek the kind of talented and generous people who can digest feedback, make adaptations and then start again.  The ability to conceptually internalize a creative brief and craft a creative solve to our clients business problems from the building blocks of the brief, with the raw assets of the brief. Qualifications7+ years of experience in communications, business, marketing, advertising or a related field.An undergraduate degree in English, Journalism, Communications, Advertising or Integrated/Strategic Communications.Experience in a client-facing role.Experience in managing, leading, and developing a team.A strong vocabulary, expertise in English usage, and comfort with multiple and often complex writing assignments, styles and disciplines.Ability to focus on user priorities and needs in structuring content, and to offer the team strategic thinking and knowledge of business, brand and marketing principles.Strong influencing skills and capability to effectively articulate, present and explain writing choices.Ability to produce work quickly, with strength in observing and managing to deadlines.Ability to interact at all levels of the company and with external parties in a professional manner maintaining effective communication, both written and spoken.Skills in complex problem solving, judgment, critical thinking and decision-making.Versatility and agility in handling multiple projects and reprioritizations.Ability to organize information, prioritize, have attention to detail, and accurately follow procedures.Ability to maintain self-motivation and to work independently in team environments."}