{"jobID": "2802495492", "jobLocation": "New_York_NY", "jobTitle": "Strategic Account Executive", "companyRating": null, "companyInfo": {"Website": "www.fourth.com", "Headquarters": "London, United Kingdom", "Size": "501 to 1000 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Strategic Account ExecutiveSalesNew York, USAThe Role We are looking for an outstanding account executive to work within our new business division with a focus on growing our customer portfolio in the US across restaurants and hotels. You’ll need to have a hunter mentality, with proven experience exceeding sales targets, built on a value led consultative approach. Someone who is not only a great account executive right now, but will be a catalyst for year on year successful growth. So what are we really offering?  Put simply, this is a career defining opportunity. Interested? Who are Fourth? Fourth is the power behind the world’s hospitality industry. Our leading technology better connects our customers with their business data giving them the visibility, insight and control they need to achieve more. Our global population is spread across the UK, US, Dubai and Bulgaria totalling 550+ employees.  We’ve evolved a lot since 1999, but one thing that hasn’t changed is our genuine passion for creating an environment where people are proud to work and products that customers are proud to use. That passion for customer and employee happiness drives us forward. Today, we have over 1200 customers including world leading brands like Hilton, Kimpton, Bar Louie, Subway, Krispy Kreme, Hyatt, Pizza Express and Jumeirah. What is the Role? Our goal is to become the market leader in the US, building upon our success and leadership position in Europe. We already successfully sell our solutions in the US but we are taking this to the next level – And you’ll be right at the heart of this journey. This role will suit someone with great experience of already selling SaaS, but possesses a desire to be part of something bigger and for the work they do every day to mean they help transform an industry, creating positive experiences for millions of people around the world.  The key responsibilities for this role are to: Devise and execute strategies to achieve multi-site strategic dealsAdopt a value-led approach to customer acquisition & new logo opportunitiesCollaborate with delivery teams and pre-sales to shape, sell and maintain new business dealsLead customer pitchesRespond promptly and effectively to RFPs, demonstrating our commitment to customer loyaltyManage and hit a your personal sales target/quotaDevelop and deliver a sales pipeline with accurate forecasting to ensure that the business is consistently hitting agreed sales quota on a rolling quarterly basisCollaborate with the lead generation team and marketing to unlock new opportunities and stay abreast of important developments within the hospitality industryReport on sales opportunities in Altify (Salesforce)Be a positive ambassador of Fourth and build a great network.Who will I be and what will I be good at?5 years+ experience of selling complex software or value-led solutions (technical systems) to global matrixed organisationsProven track record of consistently hitting target with a ‘never miss’ attitudePassion for the hospitality sector and customer excellenceHigh levels of customer empathy and engagement demonstrated at all stages of the sales processGenuine relationship builder who constantly seeks out new opportunitiesSelf-starter that relishes helping companies scale and break new groundAbility to ‘move the deal along’ in a complex sell towards completion in good timeStrong organisational skills with the ability and willingness to ‘roll up your sleeves’ and make it happen2 years+ experience of sales methodology (Desired)2 years+ experience of working with a UK headquartered organisation (Desired)Why us? Firstly we are awesome! Seriously though, Fourth is without doubt a career-defining place to work. We are a values driven company who practice what we preach living by our values and take it very seriously. Happiness drives success, not the other way round and whilst we work extremely hard to deliver, we really do enjoy life keeping it simple and delivering quality."}