{"jobID": "2819063369", "jobLocation": "San_Mateo_CA", "jobTitle": "Web Designer / Developer Intern", "companyRating": "3.1", "companyInfo": {"Website": "www.speckproducts.com", "Headquarters": "San Mateo, CA", "Size": "51 to 200 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "56000", "jobDescription": "Position Summary: Speck Products is looking for an enthusiastic Graphic Design/Web Development student or recent graduate for a paid, 3-6 month spring internship opportunity. The position would support the Marketing department in all areas of keeping an eCommerce website running smoothly: web assets, email marketing, product setup, merchandising, inventory, testing, and strategy.  We think you're great, but if you're a full-stack developer or an expert at API's - this may not be the position for you.  Recent Grads and Students that can commit to 40 hours per week are encouraged to apply. This is a paid opportunity. Position Responsibilities:Programming web assets such as hero banners, landing pages, and product features for both domestic and international regionsCreating assets for promotions and campaignsAssist in designing and building marketing emailsAssist in creating and modifying video assets for distribution to global resourcesSetting new products up for display on our eCommerce siteSupporting the merchandising of products and sustaining sufficient inventoryWebsite content updatesPosition Requirements: Creative Eye for design (enthusiasm for visual presentation)Proficiency in Adobe Photoshop (Adobe Illustrator skills a plus)Familiarity with video/audio editing, especially with Adobe Premiere nice but not required Technical Proficiency in HTML/CSS generated by hand(familiarity with jQuery, responsive design a plus)Familiarity with directory structures (experience in UNIX a plus)Familiarity with Wordpress and Wordpress development nice but not requiredFamiliarity with Google Analytics nice but not required General 0 to 2 years of work experience programming HTML/CSS with a knowledge of responsive designA Bachelor's degree in Communications, Graphic Design desired also open to Art and/or related disciplines.Detail oriented (must sweat the small stuff!)Must care about User Experience and always be thinking in terms of how the user interacts/interprets what is on screenMust be able to take direction and execute based on that directionMust be curious and always ask questions of people and thingsMust always check your work/QA!Exceptional time management and organizational skills with the ability to shift gears quickly and wear multiple hats.Flexibility, patience and self-initiative requiredFamiliarity with Microsoft Excel"}