{"jobID": "2821033701", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist, Policy Data Science, APAC", "companyRating": "4.1", "companyInfo": {"Website": "www.airbnb.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "142000", "jobDescription": " Airbnb has become a global platform that connects travelers and hosts from over 34,000 cities. As such, it has collected a diverse set of data, which our Data Science team mines for insights that will propel our community and product forward. However, information is only as valuable as it is understood by decision-makers.  We are looking for an experienced Data Scientist to join our Policy Data Science team and serve as the data science partner for our Asia Pacific (APAC) Public Policy and Communications team.  The ideal candidate has an interest in public policy and regulatory issues, an eye for detail, strong communication skills, and a keenness for problem solving. Examples of projects you would work on include, but are not limited to: Understanding the business and city impacts of various regulatory proposals in order to inform internal and external decisionsDefining key metricsCreating business critical dashboardsCollaborating with external consultants and academics on research The Singapore-based policy data scientist will partner with APAC policy and communications leadership as well as with the rest of the San Francisco-based Policy Data Science team to translate complex findings and results into a compelling narrative that directly informs business decisions and external communications. In this role, you will have tremendous upwards exposure as the Data Science team's mouthpiece to senior business partners. If you're passionate about leveraging data to drive business decisions, and shape informed city policy, we want to hear from you.  Experience Must have:Professional experience in data analysis and visualizationConfidence with analytical tools such as Excel, R, Python, Stata, or MatlabProven ability to succeed in both collaborative and independent work environmentsExperience designing and delivering presentations for senior leaders5+ years of applicable industry experienceAlso valuable:Familiarity with policy and communications domainsFamiliarity with SQL or other querying languageAbility to work with dashboarding software such as Tableau or Google AnalyticsLeadership or managerial experience1 or more APAC language capability"}