{"jobID": "2820663227", "jobLocation": "New_York_NY", "jobTitle": "Events Producer", "companyRating": null, "companyInfo": {"Website": "www.quintessentially.com", "Headquarters": "London, United Kingdom", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Events Producer - New York Job TypeFull timeLocationNew YorkReferenceProducer-06/18Quintessentially's award-winning international event division is renowned for its creative flair and cutting edge design. Quintessentially has a widespread reputation for creativity, service excellence and integrity. The company is appointed to produce seamless bespoke events around the world, working across corporate to private sectors, and are notably specialists in the luxury sector. Quintessentially USA is looking for an experienced and ambitious Producer with a proven track record of managing corporate and brand events for a minimum of 10 years. If you are an experienced, motivated and ideas driven individual with a desire to deliver high-end events for some of the world's top international brands as well as private clients, we would like to hear from you.Job summary: Reporting to the SVP, Events, the successful candidate will mainly be responsible for conceiving, planning, producing and delivering events across the US with a focus on one of our largest growing client accounts in the technology sector.Key responsibilities: -Client service lead for key account, receiving and initiating complex briefs for US wide event activations. -Support senior management with new business meetings – present and receive briefs. -Prepare pitch proposals and formulate first draft budgets. -Execute a wide range of events including product launches, exhibition stands, conferences and dinners for one of our main corporate accounts. Additional support may be required to deliver cross-sector events for other clients including private events and weddings, where applicable.  -Fully manage events from conceptualisation to execution, to include creative development, venue sourcing, design and décor production, AV and technical management, entertainment and catering management, pre and on-site event logistics and team management. -Responsible for event budgets from draft to reconciliation, ensuring events are meticulously managed and delivered on target to meet client expectations and company profit margin. -Maintain knowledge of key trends and event content to keep all solutions fresh, innovative and exciting. -Ensure the best suppliers have been sourced and are engaged at best preferential rates.  -Manage third party suppliers such as production teams and caterers in planning and onsite. -Manage more junior team members with project planning and budget management. -Resource and manage busy events calendar for key account. -Liaise with Quintessentially HQ (London) key account lead to ensure best practise / new processes are shared.Experience Required:  -Minimum of 10+ years' of event experience.  -Strong interpersonal skills with a 'can-do' attitude.  -Strong commercial acumen, proven experience in driving profit and organized growth with teams, suppliers and existing clients. -Trustworthy, discrete and sensitive to clients' needs at all times. -Creative capability to contribute event ideas to pitches and create pitch documents. -Creative problem solver and good organisational skills with attention to detail. -Deep understanding of (interpreting) business objectives into event-based solutions. -Thrives from a fast paced, ever changing environment. -Outstanding project management and negotiation skills. -Ability to multi-task within a high pressured environment. -A passion for events and delivering service excellence. -Proficient in Microsoft Office.Requirements:  -Hold a valid US work visa/ citizenship. -Occasional travel will be required for this role – mainly across the US How to apply "}