{"jobID": "2819924287", "jobLocation": "New_York_NY", "jobTitle": "Security Systems Technician", "companyRating": "3.6", "companyInfo": {"Website": "www.kentsecurity.com", "Headquarters": "North Miami, FL", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "46000", "jobDescription": " OverviewKent Services is a family-owned security, technology and building services firm with a renowned history of delivering unparalleled services through our close to 2,000 employees who cover the entire continental US. We offer an array of careers that deliver a rewarding experience, great benefits and professional growth and development. We challenge our colleagues each step of the way and provide them with the tools to succeed and accomplish their personal and professional goals. Together, we can… [more] deliver the highest quality of service to each of our customers and put you on the career path you have been looking for. [less]Job Skills / RequirementsThe Security Systems Technician is responsible for providing maintenance and tech support for the day-to-day delivery of security services, and requires minimum 2-3 years of experience with CCTV, VMS, IT, Security Technology, IP Cameras, Access Control, Alarm Systems, Blueprints, Video analytics, and testing/troubleshooting and installation of equipment and hardware.  Conduct on-site assessments, reading blueprints, collecting data, making recommendations, coordinating installation and… [more] troubleshooting, and for the coordination of the project design and implementation, providing needed assistance in accordance to company or department procedures. Assist with training new staff members, and may be asked to perform other related duties, as needed and assigned by Supervisor or Manager.Analyze, survey and evaluate on-site and on location, and make recommendations.Prepare for installation, lay out, equipment needs and plan implementation.Establish system by connecting low-voltage cables, programming and calibrating equipment and signals, troubleshooting and identifying and correcting issues.Maintain work records, document installation and equipment needs, maintain safe and secure work environment.MINIMUM QUALIFICATIONS:High school diploma or equivalent, trade/technical school training and/or experience preferred, be at least 18 years of age, must be a citizen or a legal resident alien, and provide current residence address.Must have a good working knowledge of technology and support systems, operations, safety practices, and capacity to work in varied places and locations.Ability to communicate effectively both orally and in writing with staff, company and the customer, to understand and follow standard operating procedures (SOP’s), to perform duties in a professional manner and appearance, to write reports, make independent good judgment decisions within proper policy or procedure. [less]Additional Information / BenefitsBenefits: Medical Insurance, Dental Insurance, Paid Sick Days, Paid Holidays, 401K/403b Plan  Screening Requirements: Drug Screen, Criminal Background Check"}