{"jobID": "2820447817", "jobLocation": "Redmond_WA", "jobTitle": "Research Intern - Data Management, Exploration and Mining Group (DMX)", "companyRating": "4.1", "companyInfo": {"Website": "www.microsoft.com", "Headquarters": "Redmond, WA", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (MSFT) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Amazon, Apple"}, "estimatedSalary": "72000", "jobDescription": " Empower every person and organization on the planet to achieve more. That’s what inspires us, drives our work and pushes us to challenge the status quo every day. At Microsoft, we also work to empower our employees, so they can achieve more. We believe we should each find meaning in our work and we ensure employees have the freedom and the reach to help make a difference in the world.  Microsoft Research provides a dynamic environment for research careers with a network of world-class research labs led by globally-recognized scientists and engineers. Our researchers and engineers pursue innovation in a range of scientific and technical disciplines, to help solve complex challenges in diverse fields, including computing, healthcare, economics, and the environment.  The Data Platforms and Analytics pillar currently consists of the Data Management, Mining and Exploration Group (DMX) group, which focuses on solving key problems in information management. Our current areas of focus are infrastructure for large-scale cloud database systems, reducing the total cost of ownership of information management, enabling flexible ways to query, browse and organize rich data sets containing both structured and unstructured data, and the management of database schemas and mappings.  Our research focuses on research projects that produce practical software. Our software has shipped in many Microsoft products and services, including the Database Tuning Advisor (in SQL Server), the Fuzzy Lookup and Fuzzy Grouping operators (Microsoft SQL Server Integration Services (SSIS), and used in Bing Maps and Bing Shopping), the mapping compiler for Microsoft’s ADO.NET Entity Framework, the schema-matching algorithm in Microsoft’s BizTalk Mapper, click-through prediction in Bing search, and the advertisement indexing engine in search advertising, among others.  Our research has also had significant impact in the academic community. We publish in the top conferences in the areas of systems, information retrieval, and database management (SIGMOD, VLDB, SIGKDD, SIGIR, WWW, ICDE, CIDR, etc.). Our work has spawned two VLDB10-Year Best Paper Awards, and Best Paper awards at SIGMOD, VLDB, ICDE and CIDR, and a ICDE Influential paper Award.Responsibilities"}