{"jobID": "2616497361", "jobLocation": "New_York_NY", "jobTitle": "Management Consultant", "companyRating": null, "companyInfo": {"Website": "www.berkeleypartnership.com", "Headquarters": "London, United Kingdom", "Size": "51 to 200 employees", "Founded": " 1990", "Type": " Private Practice / Firm", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "When we ask someone to join The Berkeley Partnership, it’s a big decision, for us and for them. We work with big, high profile clients, shaping and delivering complex and transformational change. Our partners and consultants help these organisations tackle their most critical challenges, often by working as an integral part of their leadership teams. Our focus is always on making change happen, making it successful and making it last.Our people focus on building trusting, long term client relationships and only selling work that clients need and want. We truly believe this is key to our success, and our repeat/referral business supports this. That’s why we can’t afford to compromise on the quality of people we hire. At Berkeley we develop talented consultants rather than hire in at the most senior levels, so it is important to us that we hire people at the right point in their career. We look for high achievers with 7 – 12 years consulting experience working in high quality, often large consulting firms. Joiners will have a proven project leadership track record, and the ability to build strong relationships with blue-chip clients.  But meeting our requirements is only part of the story. Life at The Berkeley Partnership is very different from larger firms. With freedom, trust and autonomy comes a high level of accountability. This is by no means a soft option. There’s a strong focus on personal and professional development, with a partner to consultant ratio of 1:4. We don’t do hierarchy. There are just two levels, Partner and Consultant and if the offer of Partnership comes, you’ll know it means something.  Being owner-managed, we can shape the kind of firm we want to work in. We offer our consultants the chance to develop themselves professionally and to work towards success for our clients and for the firm. Our trusting and open culture makes Berkeley both a professional and sociable place to work, with high levels of autonomy and little bureaucracy. You’ll need to be adaptable and open minded about different ways of working and projects/industry sectors that are outside of your comfort zone. Sometimes you’ll be leading, sometimes supporting. Sometimes you’ll be on your own, although there’s always support from your colleagues when you need it. The pressure can be every bit as high as you’ve experienced before but most of our people find it easier to balance their work and personal interests in a smaller, more flexible firm.  You’ll find our recruitment process thorough and demanding but friendly too. We know it’s a big time commitment, so we urge you to read our website carefully before taking the next step. If you are the right person for us and are ready for a significant career move, it’s time well spent.  If you’d like to find out more about management consultancy careers at Berkeley, please visit our website."}