{"jobID": "2802411120", "jobLocation": "Palo_Alto_CA", "jobTitle": "Senior Software Engineer, Mobile", "companyRating": "3.2", "companyInfo": {"Website": "www.gsn.com", "Headquarters": "Santa Monica, CA", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Big Fish Games, DoubleDown Interactive, Zynga"}, "estimatedSalary": "131000", "jobDescription": "GSN Games, a leading developer in mobile and social games, is seeking a Senior Unity 3D engineer. You will be working closely with a small cross-functional group of ninjas featuring engineers, artists, designers, product, and QA in our Palo Alto Studio.  As a Senior Mobile Software Engineer, you will be responsible for the design, architecture and implementation of game systems on both client mobile device and server stack. You will provide technical mentorship and guidance for our engineers. You will work closely with the game designers and artists to create a set of tools to enable the designers and artists to express their creativity within the game. You will actively suggest and implement well-thought out solutions to better the development process and improve game systems. Also you will manage your schedule and pace of work in an agile project management environment. About The GSN Games Palo Alto Studio: The Palo Alto Studio is a small, tight-knit and fun group of engineers, artists, designers and product people who pride ourselves on crafting very high quality experiences that appeal to a wide array of players. Our most successful game to date is Solitaire Tripeaks by GSN, the #1 revenue solitaire game on mobile that has grown into one of the top 50 grossing games on both iOS and Android over the last few months and is still growing fast. What You’ll Do:Express your creativity as a game developer.Design and implement core features, tools, and systems for the client and server.Game feature development for both the client and server.Strive to improve the quality of the user experience on all client platforms: graphic/rendering performance, memory usage, load times/asset management, battery performance, localization systems, audio support, etc.Service-oriented attitude with an eye for efficiency and workflow for client, server, design, art, production, and QA teams.Balance between practical and ideal engineering practices to achieve goals effectively.Analyze client/server performance, and optimize the system.Design and present new technical ideas and solutions to the team.Investigate problems with the live game and fix them on the fly. About You:Minimum of 4 years professional experience in programming software.A burning desire to help make our games the best that it can be for our players.Effective verbal and written communication with designers, artists, and other engineers.Strong, proven Unity 3D and C# skills.Strong data structures and logic skills.iOS or Android development experience.Prior development work on distributed systems and client/server architectures.Experience and/or strong desire to learn Java, Google App Engine, and Firebase.Experience with performance analysis and code optimization.High comfort level extending and improving an established code base. Bonus Points!Passion for video games with a strong familiarity in mobile.History in console or other game development platforms (Unreal, Web, etc.)Computer Science, Engineering, Mathematics, Physics, or related Engineering degree.Experience in managed C style languages (C#, Java, etc.)Experience in C style languages (C, C++, etc.)Deep understanding of 3D graphics and shaders.Experience with HTTP protocol and REST services.Experience with TDD and distributed systems.Database development experience.Experience with build servers and pipelines.About Us: GSN Games delivers social casino and skill-based games designed to fuel every player’s inner winner. Founded in 1999, the company has evolved into one of the world’s top game publishers and creators. Its collection of social casino games includes GSN Casino and Bingo Bash, both top 10 grossing iPad apps, as well as Wheel of Fortune Slots: The Ultimate Collection, Solitaire TriPeaks, Mirrorball Slots, Fresh Deck Poker and more. GSN Games also features WorldWinner.com and the WorldWinner app, where players can compete for real money in skill-adapted versions of the biggest game franchises of all time. Owned by Sony Pictures Entertainment and AT&T; Entertainment Group, GSN Games operates eight locations worldwide across Boston, San Francisco, Palo Alto, Washington, D.C., London, Barcelona, Bengaluru and Zaporozhye, Ukraine. Connect with us on Twitter @insidegsngames, on Instagram @gsngames and on LinkedIn at https://www.linkedin.com/company/gsn."}