{"jobID": "2802899183", "jobLocation": "Seattle_WA", "jobTitle": "Comcast Technology Intern - JC", "companyRating": null, "companyInfo": {"Website": "www.comcastcareers.com", "Headquarters": "Philadelphia, PA", "Size": "10000+ employees", "Founded": " 1963", "Type": " Company - Public (CMCSA) ", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " AT&T, Time Warner Cable, Verizon"}, "estimatedSalary": null, "jobDescription": " Comcast brings together the best in media and technology. We drive innovation to create the world's best entertainment and online experiences. As a Fortune 50 leader, we set the pace in a variety of innovative and fascinating businesses and create career opportunities across a wide range of locations and disciplines. We are at the forefront of change and move at an amazing pace, thanks to our remarkable people, who bring cutting-edge products and services to life for millions of customers every day. If you share in our passion for teamwork, our vision to revolutionize industries and our goal to lead the future in media and technology, we want you to fast-forward your career at Comcast.Comcast Technology InternshipComcast Center Technology ProgramComcast brings together the best in media and technology. We drive innovation to create the world's best entertainment and online experiences. As a Fortune 50 leader, we set the pace in a variety of innovative and fascinating businesses and create career opportunities across a wide range of locations and disciplines. We are at the forefront of change and move at an amazing pace, thanks to our remarkable people, who bring cutting-edge products and services to life for millions of customers every day. If you share in our passion for teamwork, our vision to revolutionize industries and our goal to lead the future in media and technology, we want you to fast-forward your career at Comcast.Program Overview:The Comcast Engineering and Technology Internship Program is a summer program based at various Comcast locations throughout the greater US. The program is designed to identify high-caliber talent to build our organization with the best and the brightest students who come from a variety of sourcing channels, including on-campus career fairs, partner organizations, and direct applications. As an intern in the program, you would expect to work a 40 hour/week schedule over the course of 11 weeks throughout the summer.Additionally, your experience will include:-Engagement: Working on creative, innovative, and thought-provoking projects within various business units at Comcast during your internship experience.-Exposure: An inside look into the day-to-day operations of an organization at the cutting edge of media and technology.-Professional development: You will be exposed to a variety of professional development topics facilitated through our partners at Comcast University and senior leaders within the organization. These sessions are inclusive of speaker series, skill-building workshops, and networking opportunities.-Mentorship: Mentoring from fellow colleagues through the Empowering Future Leaders Program (EFLP) to help you navigate your experience, provide coaching, and expand your professional network.-Fun: Continuously develop relationships with fellow interns through social activities, community building, and networking.Role Overview:Comcast has multiple internship opportunities in the following metropolitan areas: Philadelphia, PA Metro, Denver, CO Metro, Washington, D.C. Metro, Sunnyvale, CA, New York, NY Metro and Seattle, WA.Your responsibilities will vary; possible functional areas may include but are not limited to:Software Engineering:-Responsible for the development and support of applications used internally at Comcast and by our customers-Experience in this group may lead to the following full-time roles: Software Developer; Project Manager; Business AnalystNetwork Engineering:-Responsible for the architecture and design of the core Comcast network.-Experience in this group may lead to the following full-time roles: Network Engineer; Network Developer; Software Engineer.Big Data/Data Analytics:-Optimization of content feeds through metadata analysis utilizing a wide variety of products and technologies such relevancy ranking and clustering-Experience in this group may lead to the following roles: Software Engineer, Research Engineer, Video Product AnalystTesting & Quality Assurance:-Responsible for creating testing procedures, setting up testing labs and running tests on our applications and products.-Experience in this group could lead to the following full-time roles: Test Analyst; QA Engineer; Testing LeadProject/Product Management:-Responsible for developing a detailed project plan and tracking the progress, scope, project schedule, and project costs using appropriate document techniques-Responsible for partnering with business unit management and personnel to identify, define and document business needs and objectives-Experience in this group could lead to the following full-time roles: Project Manager, Project Coordinator, Business AnalystCybersecurity:-Responsible for ensuring that users of our networks have proper access credentials, as well as for safeguarding the networks from being used for malicious activities.-Experience in this group could lead to the following full-time roles: Security Engineer; Legal Analyst; Network Security Engineer; Network Analyst.Product Engineering:-Responsible for the development and creation of new customer applications, products & services.-Experience in this group may lead to the following full-time roles: Open Source Application Developer; Video Engineer; Integration Engineer.UX/UI Design:-Support the with the UX Hardware/Packaging/Retail team, focusing on strategy and conception to bring the next generation of Comcast products to life by executing around future vision-Experience in this group may lead to an entry level UX Designer RolePreferred Qualifications/Requirements:-Currently pursuing a Bachelor's or Master's degree from a United States-based college or university-Majors: Computer Science, Information Systems, Software or Computer Engineering, Digital Media, Technology or a related field-3.0 GPA or higher-Demonstrates solid decision-making skills-Proven analytical, organizational, and problem-solving ability-Strong written and verbal communication skills-Ability to work independently and in group settings.-Strong interest in the technology, telecommunications, cable and media industries-Current and future authorization to work in the United States of AmericaCore Responsibilities:- Regular, consistent and punctual attendance. Must be able to work nights and weekends, variable schedule(s) and overtime as necessary.- Other duties and responsibilities as assigned.  Comcast is an EOE/Veterans/Disabled/LGBT employer"}