{"jobID": "2829264143", "jobLocation": "Universal_City_CA", "jobTitle": "Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.nbcuni.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1906", "Type": " Company - Public (CMCSA) ", "Industry": " Media", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "142000", "jobDescription": " **Job Number** 41566BR**Job Title** Data Scientist**Business Segment** Filmed Entertainment Group**Sub-Business** Film Brand Development**Posting Category** Digital Media**About Us** At NBCUniversal, we believe in the talent of our people. It?s our passion and commitment to excellence that drives NBCU?s vast portfolio of brands to succeed. From broadcast and cable networks, news and sports platforms, to film, world-renowned theme parks and a diverse suite of digital properties, we take pride in all that we do and all that we represent. It?s what makes us uniquely NBCU. Here you can create the extraordinary. Join us.**Country** United States**State** California**City** Universal City**Responsibilities****Qualifications/Requirements**Basic Qualifications:+ 2+ years of experience performing statistical and predictive analytics+ Expert in machine learning+ Expertise in R and Python+ Must have more than a passing familiarity with Behavioral Science or Psychology or Social ScienceEligibility Requirements:+ Interested candidates must submit a resume/CV online to be considered+ Must have unrestricted work authorization to work in the United States+ Must be covered by Solutions, NBCU?s Alternative Dispute Resolution Program**Desired Characteristics**Desired Characteristics:+ Expertise in Java and C/C++ a plus+ Understanding of Big Data technologies (Cassandra, Spark, Hadoop) strongly preferred**Notices**NBCUniversal?s policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law. NBCUniversal will consider for employment qualified applicants with criminal histories in a manner consistent with relevant legal requirements, including the City of Los Angeles Fair Chance Initiative For Hiring Ordinance, where applicable."}