{"jobID": "2830898167", "jobLocation": "Sunnyvale_CA", "jobTitle": "Engineer 4, Software Dev & Engineering", "companyRating": null, "companyInfo": {"Website": "www.comcastcareers.com", "Headquarters": "Philadelphia, PA", "Size": "10000+ employees", "Founded": " 1963", "Type": " Company - Public (CMCSA) ", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " AT&T, Time Warner Cable, Verizon"}, "estimatedSalary": null, "jobDescription": " Comcast brings together the best in media and technology. We drive innovation to create the world's best entertainment and online experiences. As a Fortune 50 leader, we set the pace in a variety of innovative and fascinating businesses and create career opportunities across a wide range of locations and disciplines. We are at the forefront of change and move at an amazing pace, thanks to our remarkable people, who bring cutting-edge products and services to life for millions of customers every day. If you share in our passion for teamwork, our vision to revolutionize industries and our goal to lead the future in media and technology, we want you to fast-forward your career at Comcast. Job Summary: Responsible for planning and designing new software and web  applications. Analyzes, tests, and assists with the integration of new  applications. Oversees the documentation of all development activity.  Trains non-technical personnel. Assists with tracking performance  metrics. Integrates knowledge of business and functional priorities.  Acts as a key contributor in a complex and crucial environment. May lead  teams or projects and shares expertise.  Employees at all levels are expect to: Understand our Operating Principles; make them the guidelines for how you do your job Own the customer experience-think and act in ways that put our customers first, give them seamless digital options at every touchpoint,  and make them promoters of our products and services Know your stuff-be enthusiastic learners, users and advocates of our game-changing technology, products and services, especially our digital  tools and experiences Win as a team-make big things happen by working together and being open to new ideas Be an active part of the Net Promoter System-a way of working that brings more employee and customer feedback into the company-by joining  huddles, making call backs and helping us elevate opportunities to do  better for our customers Drive results and growthRespect and promote inclusion and diversityDo what's right for each other, our customers, investors and ourcommunities Core Responsibilities:Collaborates with project stakeholders to identify product and technical requirements. Conducts analysis to determine integration  needs. Designs new software and web applications, supports applications under development, and customizes current applications. Develops software  update process for existing applications. Assists in the roll-out of  software releases. Trains junior Software Development Engineers on internally developed software applications. Oversees the researching, writing, and editing of documentation and technical requirements, including evaluation plans, test results,  technical manuals, and formal recommendations and reports. Keeps current with technological developments within the industry. Monitors and evaluates competitive applications and products. Reviews  literature, patents, and current practices relevant to the solution of  assigned projects. Provides technical leadership throughout the design process and guidance with regards to practices, procedures, and techniques. Serves  as a guide and mentor for junior level Software Development Engineers. Assists in tracking and evaluating performance metrics. Ensures team delivers software on time, to specification, and within budget. Works with Quality Assurance team to determine if applications fit specification and technical requirements. Displays expertise in knowledge of engineering methodologies, concepts, and skills and their application in the area of specified  engineering specialty. Displays expertise in process design and redesign skills. Presents and defends architectural, design, and technical choices to internal  audiences. Consistent exercise of independent judgment and discretion in matters of significance. Regular, consistent and punctual attendance. Must be able to work nights and weekends, variable schedule(s) as necessary. Other duties and responsibilities as assigned. Job Specification:Bachelors Degree or EquivalentEngineering, Computer ScienceGenerally requires 7-11 years related experience  Comcast is an EOE/Veterans/Disabled/LGBT employer"}