{"jobID": "2517677871", "jobLocation": "New_York_NY", "jobTitle": "Tech Education Program Intern", "companyRating": null, "companyInfo": {"Website": "www.c4q.nyc", "Headquarters": "Long Island City, NY", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "POSITION SUMMARY Location: Long Island City, NY  Department: Programs & Operations  Time Commitment: Full-Time or Part-Time  Min. Experience: Passion for Tech & Education  Compensation: Paid & Unpaid Opportunities.  We are looking for dedicated and able candidates to assist in implementing our Access Code program, our intensive and inclusive tech education program. As a part of a growing and agile team, the Tech Education Program Intern will play a key role in supporting the Access Code team in successful program execution. ResponsibilitiesAssisting in the collection and organization of participant performance data and the compilation of reports on progressEnsuring that the Access Code instructors, teaching assistants, and students have the resources they need, such as lesson plans, space, and equipmentSupporting Access Code program participants’ industry immersion curricula by facilitating guest lectures, researching and compiling reading materials, and identifying key industry eventsSupporting volunteer recruitment, training, and engagement throughout the programAdministrative and operational tasksThe Ideal Candidate You are a passionate, resourceful individual who is compelled by impactful work. As part of a small but growing team, you will be expected to think across many disciplines and be open to both collaboration and critique. You should be meticulous, organized, and self-motivated. A background in software development or technology is helpful, but not necessary. Above all, we value the ability and willingness to hustle to do things well and do things right. RequirementsStrong interpersonal skillsStrong communication skillsHigh level of organizationPassion about spreading access to tech educationNice to HavesFamiliarity and/or background in computer science and web developmentSkilled in Adobe Creative SuiteBackground in program developmentExperience working with a nonprofitInterested?"}