{"jobID": "2746631769", "jobLocation": "New_York_NY", "jobTitle": "Watson Health - Leader, Business Development (Inside Sales Manager)", "companyRating": null, "companyInfo": {"Website": "www.ibm.com", "Headquarters": "Armonk, NY", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Public (IBM) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Accenture, Microsoft"}, "estimatedSalary": null, "jobDescription": "Job DescriptionLocation: will be based in IBM Watson Hubs- Boston, MA, Ann Arbor, MI, Denver, CO, Chicago, IL, Raleigh, NC, New York, NY, Dallas, TX, or Boston, MA Its time to transform health with new ways of working to improve approaches to care, productivity and well-being. Watson Healths artificial intelligence (AI) understands, reasons and learns helping to translate information into knowledge that can help drive more informed decision-making. With AI, we can see and analyze more data than ever before and achieve more than we ever thought possible.  IBM Watson Health is looking for talented individuals destined to usher in the next era of healthcare. We live in a moment of remarkable change and opportunity. The convergence of data and technology is transforming healthcare and life sciences organizations today. New opportunities are being created that never existed before to meet the demands of this transformation.  The Leader, Business Development (Inside Sales Manager) is responsible for the development and execution of essential Sales Best Practices to ensure Sales revenue growth. Examples of the practices and processes include financial and sales pipeline reporting, business development or campaign performance metrics and analyses, technology and SalesForce.com management and campaign processes. The Leader, Business Development is also responsible for managing and developing the Payer Business Development team members to assure pipeline development through effective campaigns and prospecting strategies. SPECIFIC RESPONSIBILITIES Responsibilities may include team-specific responsibilities, such as an assigned territory for Business Development, with the addition of the following responsibilities: Demonstrate a wider understanding and knowledge of the key Business Development activities (prospect identification, pipeline development, marketing campaigns and metrics tracking)Identify, manage and execute best practices, documentation or other workgroup functionsInitiate and lead cross-department meetings, conversations, and activities involving higher levels within the organizationCollaborate with other departments management teams (i.e. Account Management, Business Strategy and Operations, Analytics & Consulting, Marketing) on various activities including team feedback, team performance, best practices, and other needsManagement responsibilities for Business Development Team members, including managing annual performance review process, workload, coverage and other personnel-related issues for direct reports Required Technical and Professional Expertise 3 years of inside sales management experience in healthcare IT3 years of leadership and management skills with previous Team Lead or equivalent experience3 years demonstrated results of creating new process or practices- demonstrated change agent3 years of previous healthcare industry experience Preferred Tech and Prof Experience 5 years of inside sales management experience in healthcare IT5 years of healthcare IT experience specific to payers EO Statement  IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status. "}