{"jobID": "2822822695", "jobLocation": "Bellevue_WA", "jobTitle": "SAP Concur - Senior Data Analyst", "companyRating": "4.4", "companyInfo": {"Website": "www.sap.com", "Headquarters": "Walldorf, Germany", "Size": "10000+ employees", "Founded": " 1972", "Type": " Company - Public (SAP) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Salesforce, Oracle, Microsoft"}, "estimatedSalary": "84000", "jobDescription": "Requisition ID: 177157 Work Area: Software-Research Expected Travel: 0 - 10% Career Status: Professional Employment Type: Regular Full Time Career Level: T3 Recruiter Name: Sacha Sarieddine COMPANY DESCRIPTION As market leader in enterprise application software, SAP helps companies of all sizes and industries innovate through simplification. From the back office to the boardroom, warehouse to storefront, on premise to cloud, desktop to mobile device – SAP empowers people and organizations to work together more efficiently and use business insight more effectively to stay ahead of the competition. SAP applications and services enable customers to operate profitably, adapt continuously, and grow sustainably.     SAP Concur provides an interactive experience to millions of users daily. Understanding and improving on this experience is core to our success. SAP Concur’s UX strategy group is expanding our user analytics team with the addition of this new Senior Data Analyst role.     In this role, you will directly contribute to the success of SAP Concur Products by leading analyses and providing business insights to support data-driven decision making. You will report to the Sr Director of User Insights and partner with stakeholders across the organization to drive business results. You will work across multiple product teams globally to assess the success of our existing products, identify areas for improvement, and help measure the success of launches and provide information that shapes the product roadmap. You will be part of a very diverse and engaged team that is driving major innovations in an industry that is becoming increasingly  more complex.    Responsibilities Include:Concur Product Team Support - You will work with select teams to understand their businesses, identify their analytics needs, and provide an analytics roadmap to support their decision making. Supporting teams throughout the product development lifecycle working to drive clarity and recommendations to improve the customer experience.Analytics Expertise & Delivery -- Often times we are pathfinding with new product areas and new data sources. As a Data Analyst, you need the ability to drive and deliver an end-to-end analytics solution from ensuring good data capture, appropriate metric methodologies, information visualization/presentation and data synthesis and insights. Bringing ownership and data and analytics expertise to the teams you partner with. Being able to reach out throughout the organization to connect dots and interact with various teams. Driving Analytics Patterns & Practices -- Identifying where patterns that support one product team can be easily adapted to other teams to help scale analytics and democratize access to information. Developing solutions that balance delivery time/needs with appropriate investments for durable analytics and investments to our data infrastructure.   In order to accomplish this you will need to:Partner with stakeholders to understand the problems they’re trying to solve, and structure analyses to address their business needs. The successful candidate will have excellent business acumen and an ownership mindset. We are not looking for an order taker who will produce data without first understanding the business problem.Be able to independently extract data out of Big Data technologies such as Hadoop, and produce impactful analyses with clear, actionable business insights. You are able to synthesize complex analyses and communicate succinctly with internal and external stakeholders at all levels of the organization.Have a strong attention to detail, high standards when it comes to data quality, and the ability to discover, cleanse and merge data across disparate data sources.Substantial experience with analytical tools and techniques, and bring a solid skill-set in analyzing data and communicating recommendations.   What do you need to bring?Bachelor’s Degree in a quantitative field (e.g. Finance, Economics, Mathematics, Statistics)Proven track record (5+ years) leading successful Analytics projects that help drive business and product decisions in a fast paced and complex environment.Excellent data analytics skills using Big Data technologies such as Hadoop, Hive SQL, and Oozie. Python, Spark, and/or Jenkins a plus.Excellent reporting and data visualization skills ideally with Tableau and Excel.Excellent communication skills and the ability to effectively communicate complex analyses to internal and external stakeholders at all levels.Industry experience in hospitality and travel is a plus.Positive attitude and a team player with a “roll up your sleeves” mindset.   So who are we? SAP Concur takes companies of all sizes and stages beyond automation to a completely connected spend management solution encompassing travel, expense, invoice, compliance and risk. Our global expertise, industry-leading innovation and dynamic ecosystem of diverse partners and applica-tions unlock powerful insights that help busi-nesses reduce complexity and see spending clearly, so they can manage it proactively.       SAP'S DIVERSITY COMMITMENT To harness the power of innovation, SAP invests in the development of its diverse employees. We aspire to leverage the qualities and appreciate the unique competencies that each person brings to the company.  SAP is committed to the principles of Equal Employment Opportunity and to providing reasonable accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team (Americas: Careers.NorthAmerica@sap.com or Careers.LatinAmerica@sap.com, APJ: Careers.APJ@sap.com, EMEA: Careers@sap.com). Requests for reasonable accommodation will be considered on a case-by-case basis. EOE AA M/F/Vet/Disability: Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, gender, sexual orientation, gender identity, protected veteran status or disability. Additional Locations :apply now"}