{"jobID": "2645519288", "jobLocation": "San_Jose_CA", "jobTitle": "Biochemistry", "companyRating": null, "companyInfo": {"Website": "www.navy.com", "Headquarters": "San Diego, CA", "Size": "1001 to 5000 employees", "Founded": " 1775", "Type": " Government", "Industry": " Government", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " \"About This JobNavy Research Biochemists and Forensic Toxicologists work behind the scenes to promote the safety of military personnel. It's a wide, varied field of specialties where scientists have control over their careers. They also have the best coworkers, equipment and research laboratories in some of the most amazing places in the world.There are two distinct areas of biochemistry for Officers in the Medical Service Corps:Research Biochemists conduct and manage basic and applied research on biochemical problems of interest to the Navy. That could involve harnessing solar and sea power to fuel the Navy for years to come or developing a vaccine to battle a new disease.Forensic Toxicologists work in military forensic laboratories, Navy Research Laboratories or Environmental Preventive Medicine Units. They also teach at the Naval Academy and elsewhere.As an Officer in the Navy Medical Service Corps in the field of biochemistry, you could work with the Naval Criminal Investigative Service (NCIS) or serve as a member of a deployable Chemical, Biological, Radiological and Environmental (CBRE) Training Team, defending our nation against biological, chemical and nuclear weapons.Research Biochemists:Design studiesDevelop methodologiesCarry out research and analyze resultsForensic Toxicologists:Manage and direct operations Use state-of-the-art equipment to identify drug abuse in body fluids Evaluate crucial evidence for military court proceedings Study the effects of toxic substances on normal life processes Test and develop protective equipment for military operations Evaluate exposure limits to chemical compounds.Most of what you do in the Navy Reserve is considered training. The basic Navy Reserve commitment involves training a minimum of one weekend a month (referred to as drilling) and two weeks a year (referred to as Annual Training) or the equivalent.Biochemistry professionals in the Navy Reserve serve in an Officer role. Before receiving the ongoing professional training that comes with this job, initial training requirements must first be met.For current or former Navy Officers (NAVET): Prior experience satisfies the initial leadership training requirement so you will not need to go through Officer Training again.For current or former Officers of military branches other than the Navy (OSVET), as well as for Officer candidates without prior military experience: You will need to meet the initial leadership training requirement by attending the twelve-day Direct Commission Officer (DCO) School in Newport, R.I. This will count as your first Annual Training.With flexible training options, Medical Service Corps Officers in the Navy Reserve can comfortably balance civilian and military schedules. You can maintain your own life and your own career enriching both with the rewarding work you do for others.The Medical Service Corps in the Navy Reserve offers a truly diverse variety of operational venues. In some cases, you can even work in the same civilian location you work in now. Whats more, you will enjoy an unrivaled sense of pride and fulfillment known only to those who serve.\""}