{"jobID": "2710983269", "jobLocation": "Glendale_CA", "jobTitle": "Junior Data Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.legalzoom.com", "Headquarters": "Glendale, CA", "Size": "501 to 1000 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Rocket Lawyer, LawDepot"}, "estimatedSalary": "98000", "jobDescription": " LegalZoom.com is seeking a Jr. Data Scientist to help with our Data Science efforts. We are seeking a highly-motivated individual with experience in Python and SQL to help deliver data science at LegalZoom. Work with us to employ state of the art techniques in machine learning, deep learning, and probabilistic programming. This position will supports a number of predictive models, data solutions, data processing and manipulation, as well as other scientific functions used by data scientists and business analysts. What you’ll do:Work with the data scientists to develop a Python codebase for predictive and prescriptive modeling, along with the development of other data science capabilities.Develop data solutions using multiple sources, such as SQL, Google Analytics, and other platform API’sDevelop and maintain our Python platform codebase for LegalZoom using Python scientific packages such as Numpy, Pandas, Keras, Theano, Tensorflow, PyMC3Refactor current predictive models, and extract commonly used functions into a reusable set of packages and librariesManage the codebase using GithubManage the environment using AnacondaHelp enforce software best practices, and work with others to deploy new models to our production servers.Work with the business to apply scientific methods and to evolve data science solutionsSupport and extend existing predictive models for customer LTV, marketing forecast, subscription retention, micro-segmentation, etc.Apply agile approaches for proof-of-concept requirements. Using iterative methods to help drive and refine information requirements, mockups, and prototypingQualifications:At least a B.A., in either Computer Sciences, Mathematics, Statistics, or a similar discipline.Exceptional communication skills and an ability to effectively discuss and present technical information to analytics, engineers, and business users.At least 2 years of experience in PythonKnowledge of deep learning frameworks, Keras, Theano, TensorflowExperience with probabilistic programming using PyMC or PyMC3Good SQL experience to extract and manage data from SQL ServerExperience with Excel and/or TableauStrong analytical and quantitative skills, with strong attention to detailExperience with the software development lifecycleExperience managing projects with Github and AnacondaAbility to manage multiple, competing priorities LegalZoom is an Equal Opportunity Employer, dedicated to diversity. We are unable to accept applicants who currently or in the future will require a work Visa.Required Skills Required Experience Job Location  Glendale, US-CA "}