{"jobID": "2787890697", "jobLocation": "Foster_City_CA", "jobTitle": "Data Scientist Intern", "companyRating": "3.3", "companyInfo": {"Website": "www.bailard.com", "Headquarters": "Foster City, CA", "Size": "1 to 50 employees", "Founded": " 1972", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Bingham Osborn & Scarborough, Pzena Investment Management"}, "estimatedSalary": "94000", "jobDescription": "About Bailard Bailard is an innovative wealth management and investment management firm located in Silicon Valley and San Francisco. Built by entrepreneurs, Bailard attracts and retains talented individuals with intellectual curiosity, a passion for excellence, and a capacity for independent thought. Bailard maintains a high-trust culture that fosters professional growth and personal responsibility. We proudly serve more than 500 institutional and private clients, offering a variety of proprietary traditional and alternative investment products and extraordinary personal service. The Opportunity We are seeking a Data Scientist Intern to assist the portfolio management team in researching stock selection strategies. In particular, we are looking to create predictive models using historical data and statistical learning techniques. The intern will work directly with portfolio managers and other analysts to pursue this research project. In addition, by exposure to weekly company-wide updates, quantitative research updates, and briefings on portfolio performance, the intern will gain insight into many aspects of asset management. QualificationsPhD/Masters (or currently pursuing graduate degree) in Financial Engineering, Math, Statistics, Operations Research, Computer Science, Economics, Physics or related fieldsIn-depth knowledge of one or more data mining techniques, e.g. neural networks, local regression, random forests, support vector machinesDemonstrated skill with a variety of software programs, e.g. VBA, SQL, SAS, R, Python, scriptingCompensation: $25/hour + a great learning experience! Position type: Full-time internship; 10 weeks."}