{"jobID": "2745537261", "jobLocation": "Bellevue_WA", "jobTitle": "Senior Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.ispot.tv", "Headquarters": "Bellevue, WA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We have a product that is changing how brands, agencies and networks measure and assess the impact of TV advertising campaigns. Our software uses proprietary audio and video analysis to monitor and extract TV commercials, movie trailers and other promotional content from TV. At the same time, our software analyzes consumer interactions with TV ads on the digital screen across search, video and social. Interactions are matched with specific ads and attributed back to airings on TV. Our platform collects and analyzes massive amounts of data in real-time.  This is a rare opportunity to get equity in the early stages of a company with significant early traction and which is run by an experienced team.  We are looking for someone that is highly motivated and knows how to get things done quickly and efficiently. We are seeking a talent who will share our obsession for data accuracy; someone with an insatiable appetite for learning new things and accomplishing challenging goals in a fast-paced (and not always structured) environment.  Responsibilities: Identify, analyze, and interpret trends or patterns in complex data sets.Understand, inside and out, all data streams collected, calculated, and attributed by iSpot.Drive process improvement and efficiency gains into all deliverables and recurring work.Communicate bugs and alerts to Engineering teams, Customer Success, and management. Besides being highly motivated and valuing the significant equity opportunity, we are looking for someone who has: 3-5 years' experience with querying and analyzing data.Strong Excel skills, including deep understanding of advanced formulas, pivot tables and charting/graphing capabilities.Strong SQL skills, with a proven ability to create ad-hoc queries for various reporting purposes.Experience with MySQL preferred; Amazon Redshift is a plus!Proficiency with Python strongly preferred.Experience with Tableau or other BI visualization tools.Strong attention to detail.Strong quantitative, analytical, process development, facilitation and organizational skills required.Ability to multi-task and work well under deadlines in a changing environment.Passion for automation.Ability to independently manage and prioritize assignments.Strong communication and documentation skills.Bachelor's degree."}