{"jobID": "2768098042", "jobLocation": "New_York_NY", "jobTitle": "CORE studio Data Science Intern", "companyRating": null, "companyInfo": {"Website": "www.thorntontomasetti.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Arup, AECOM"}, "estimatedSalary": null, "jobDescription": "Thornton Tomasetti provides engineering design, investigation and analysis services to clients worldwide on projects of every size and level of complexity. We are a growing 1200+ person firm with practices in the following disciplines: Structural Engineering, Forensics, Applied Science, Renewal, Property Loss Consulting, Construction Engineering, Protective Design, Facade Engineering, Sustainability and Transportation. We work on landmarks to exhibitions from the historic to the high performing while balancing multiple objectives which include form, function, schedule, sustainability, constructability and budget. At our core, TALENT is the center of our business.  Thornton Tomasetti’s CORE studio consists of 18 dedicated engineers, architects, hackers and designers. CORE studio develops in-house applications for a >1200 person global engineering consultancy, builds free software for the AEC industry, performs research in and around the AEC industry, and provides computational modeling support on projects of all sizes within TT. Increasingly, we’re also investing in machine learning research and development in and around TT’s various practices and areas of expertise. A CORE studio Data Science Intern will support this internal R&D; effort, and would gain experience in generating/sourcing/cleaning data, building Machine Learning prediction models, managing large amounts of data, cloud computing, and crafting data visualizations to present insights. Some standard tasks include: Use finite element analysis, and other numerical methods to analyse and design code-compliant structural components and systems.Use constrained multi-objective optimization, and other computational methods for design space exploration and sensitivity analysis.Use data approximation and data interpolation techniques to fit reduced models for fast/approximate design space exploration.Use statistical inference (Bayesian and Markov Chain Monte Carlo methods) for probabilistic design space exploration.Prepare data visualizations to illustrate and explain analytical results. Valuable Attributes: Excellent communication skillsCan work in a small team settingMust have programming experience with PythonMust be pursuing a degree in Data Science, Computer Science, Engineering, Mathematics, Statistics, or a related fieldKnowledge of standard machine learning and data mining algorithmsProficiency in Finite Element Analysis (Strand7, RAM, SAP200, etc.) a plusUnderstands Design ThinkingIs a problem solver and critical thinker.Rapid PrototypingAble to Debug/Troubleshoot Thornton Tomasetti is proud to be an equal employment workplace. Individuals seeking employment at Thornton Tomasetti are considered without regards to age, ancestry, color, gender (including pregnancy, childbirth, or related medical conditions), gender identity or expression, genetic information, marital status, medical condition, mental or physical disability, national origin, protected family care or medical leave status, race, religion (including beliefs and practices or the absence thereof), sexual orientation, military or veteran status, or any other characteristic protected by federal, state, or local laws. Thornton Tomasetti Global Terms of Use and Privacy Statement Carefully read these Terms of Use before using this website. Your access to and use of this website and application for a job at Thornton Tomasetti are conditioned on your acceptance and compliance with these terms.  Please access the linked document by clicking here, select the country where you are applying for employment, and review. Before submitting your application you will be asked to confirm your agreement with the terms."}