{"jobID": "2823846098", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Research&Development; Intern Processing Support (Food Science)", "companyRating": null, "companyInfo": {"Website": "www.bstco.com", "Headquarters": "Albany, NY", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Research&Development; Intern Processing Support (Food Science)  # of job openings: 1  Location: South San Francisco, CA  Duration: Approximately 7 - 10 weeks. Target mid Jun - early Sept 2018  Hours Per Week: ~16 - 20 hours per week. This is subject to change based on workload.  Roles Summary  You are a go-getter who loves food, food science, and has the desire to learn more about the inner workings of the food and beverage business. In addition, you are reliable, self-motivated, have a positive attitude.  As part of a growing company and collaborative R&D;, QA, and operations teams, you will be integral to the continued smooth functioning of diverse teams in the lab, production, and office environments. You will assist with ingredient testing, shelf life studies, product tastings, and writing up summaries. You will gain knowledge and perspective as you observe an onsite beverage production facility.  This experience will help you build a solid foundation on your budding career in the food industry!  Key Categories of Success  Food Science: eager to build upon book learnings with real world experience. You will make a meaningful contribution to the R&D; department by helping us determine new product processing methods and investigate ingredients. You'll assist in running some of the day-to-day business in the office and the Lab.  Below are examples of common tasks and projects you will help us with. Other projects may be added as they come up. Assist with product stability and ingredient functionality studies and testingPerform analytical analyses on ingredients and products (including pH, Brix, viscosity)Data collection and reportingAssist with setting up and conducting product sensory tests and shelf life studiesGeneral lab and office maintenance and organizationInput and maintain nutritional information into the database Skills Required Communication: Active listening skills  Ask for clarification when needed  Attention to detail  Able to follow directions  Experience with collecting and organizing data similar to lab reports. Computer Skills: Microsoft Excel, Word, and Outlook; Power Point a Plus  Have Fun! Minimum QualificationsHave taken at least 3 upper division college level courses in Food Science (or related discipline)Proficient in Excel, Word, OutlookLive in SF Bay area or willing to relocate at own expenseAble to work 15 20 hours per week during normal business hours (M-F 8a-5p)Available to work from mid June through early SeptemberAbility to work in US without sponsorshipFluent in verbal&written; English"}