{"jobID": "2720143093", "jobLocation": "Boston_MA", "jobTitle": "CRNA - Relocate to Worcester, MA", "companyRating": null, "companyInfo": {"Website": "www.umassmemorialhealthcare.org", "Headquarters": "Worcester, MA", "Size": "10000+ employees", "Founded": " 1997", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Requisition #: 174280 Title: Certified Registered Nurse Anesthetist (CRNA) Department: Anesthesia Status: Exempt Shift: Days Hours: 40 Location: UMass Memorial Medical Group – University Campus With more than 1,100 physicians, the UMass Memorial Medical Group is one of the largest, integrated multispecialty group medical practices on the entire East Coast. Our physicians provide primary care and specialty services for both routine and complex health needs, and they practice at locations in Worcester and throughout Central Massachusetts.Position Summary: Assembles necessary supplies and equipment and administers intravenous, inhalational, epidural, spinal, and other anesthetics prior to surgical or other medical or dental procedures. Monitors patient's reactions and vital signs during and after anesthesia and takes remedial action when warranted. Submits postoperative report on patient's condition, and maintains records of anesthetics administered. Position Qualifications: Graduate of an approved Nurse Anesthesia Training program and eligible for the certification examination of the Council on Certification of Nurse Anesthetists. Board Certification must be obtained according to the regulatory requirements of the Massachusetts licensing Board and the guidelines of the Council of Certification of Nurse Anesthetist. Major Responsibilities: Conducts a complete physical screening assessment utilizing techniques of observation, inspection, auscultation, palpitation, and percussions, as well as proper use of instruments to aid in the evaluation.  Selects and administers pre-anesthetic medication according to established procedure.  Requests and evaluates pertinent laboratory studies, pulmonary function studies, including blood gases, respiratory therapy and other appropriate studies under established procedures.  Inserts intravenous catheters, including central nervous pressure catheters by basilic vein, external jugular vein, internal jugular vein, subclavian vein, or other recognized routs of administration.  Inserts arterial catheters and performs arterial puncture for blood gases.  Responsible for teaching student registered nurse anesthetists in their clinical training program.  Utilizes current techniques in monitoring.  Selects and administers an esthetic techniques, medications, and adjunct drugs appropriate to the individual patient with established procedures.  Performs intratracheal intubation and extubation.  Identifies and manages emergency situations including assessment of adequacy of recovery or antagonism of muscle relaxants, narcotics, and other agents and implements appropriate management techniques.  Recognizes abnormal patient responses to anesthesia or to adjunctive medication and implements corrective action.  Manages fluid, blood, and electrolyte therapy within a medical care plan.  Initiates and modifies therapies including drug and pain therapy within established procedures.  Participates in cardiopulmonary resuscitation and institutes cardiopulmonary resuscitation in the absence of a physician according to established procedures.  Provides consultation, management, and implementation on respiratory and ventilatory care.  Maintains awareness of current techniques appropriate to the conduct of anesthesia and implements these techniques with established procedures.  Complies with established departmental policies, procedures, and objectives.  Attends variety of meetings, conferences, and seminars as required or directed.  Demonstrates use of quality improvement in daily operations.  Complies with all health and safety regulations and requirements.  Respects diverse views and approaches, and contributes in maintaining an environment of professionalism, tolerance, civility and acceptance toward all employees, patients and visitors.  Performs other similar and related duties as required or directed. All responsibilities are essential job functions."}