{"jobID": "2722925333", "jobLocation": "San_Jose_CA", "jobTitle": "Technical Marketing Engineer", "companyRating": "3.8", "companyInfo": {"Website": "www.careers-continental.com", "Headquarters": "Hannover, Germany", "Size": "10000+ employees", "Founded": " 1871", "Type": " Company - Public (CTTAY) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Michelin, Bosch Security"}, "estimatedSalary": "90000", "jobDescription": "About Continental With sales of €40.5 billion in 2016, Continental is among the leading automotive suppliers worldwide and currently employs more than 220,000 employees in 56 countries. Information management in and beyond the vehicle is at the very heart of the Interior division. The product portfolio for different types of vehicles includes: instrument clusters, multifunctional and head-up displays, control units, access control and tire-information systems, radios, infotainment systems, input devices, control panels, climate control units, software, cockpits as well as services and solutions for telematics and Intelligent Transportation Systems. The Interior division employs more than 43,000 people worldwide and generated sales of approximately €8.3 billion in 2016.  Auto req ID 87611BR  Job Title Technical Marketing Engineer  Country United States  Posting Location San Jose, CA  Job Description We are looking for an experienced Technical Marketing Engineer (TME) who will work as a part of the product marketing team. You will join a dynamic and fast­paced environment and work with cross­functional teams to ensure that the products that we bring to market are successful in a wide variety of customer engagements and help roll­out products that deliver the company’s vision and strategy. The TME must be a technical expert. The TME must have the ability to clearly articulate the technical differentiators of a product and also work with the Product Management teams to continually improve the products. RESONSIBILITIES • Create design guides, installation guides, troubleshooting guides, evaluation guides, application notes, technical white papers, presentations, videos and demonstrations for our vehicle mobility solutions that includes access & vehicle data products & services. • Build and maintain a demonstration environment for our mobility services platform. • Test and qualify vehicles for solution compatibility and document specifics. • Support sales and marketing efforts as required. Some travel required to support field and marketing activity. • Support product launch activities and assist with Tradeshows, Conferences and Technical Sales Training or Partner Training activities. • Work with the Competitive Team for market and competitive analysis. • Respond to customer or field inquiries, assist with Technical RFPs and work with a cross­functional team of Product Managers, Engineers & Marketing team as required.  Job Requirements QUALIFICATIONS • Extensive customer and field experience is a must. • Exceptional written and oral communication skills required. • Extensive experience with automotive products, telematics, OBDII, connected car services. • Prior experience as a TME or Sales Engineer is a must. • Software development or scripting capabilities required • A BS (business, marketing, or engineering preferred) • Driven, with an entrepreneurial spirit and sense of urgency. Must be resourceful, proactive and aggressive. • Highly organized, detail­oriented and possessing a high level of integrity. • Team player that works well in collaborative situations and start­up environments. • Natural leadership skills and the ability to work with all teams in the company. • This position requires travel to customer and non­customer sites in North America and Europe.  EEO Statement EEO / AA / Disabled / Protected Veteran Employer. Continental offers equal employment opportunities to all qualified individuals, without regard to unlawful consideration to race, color, sex, sexual orientation, age, religion, national origin, disability, veteran status, or any other status protected by applicable law. In addition, as a federal contractor, Continental complies with government regulations, including affirmative action responsibilities, where they apply. To be considered, you must apply for a specific position for which Continental has a current posted job opening. Qualifying applications will be considered only for the specific opening(s) to which you apply. If you would like to be considered for additional or future job openings, we encourage you to reapply for other opportunities as they become available. Further, Continental provides reasonable accommodations to qualified individuals with a disability. If you need assistance in the application process, please reply to North.America.Recruiting@continental-corporation.com or contact US Recruiting at 248.209.4000.  Division Footer Text Ready to drive with Continental? Take the first step and fill in the online application. "}