{"jobID": "2829494663", "jobLocation": "New_York_NY", "jobTitle": "Tax Technology Specialist", "companyRating": "3.9", "companyInfo": {"Website": "www.crowe.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1942", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "81000", "jobDescription": "Job SummaryCrowe Tax Connect (CTC) is a custom-built service delivery platform intended to transform how Crowe delivers its tax services. Crowe Tax Connect has deployed an agile development methodology. As such, features are released incrementally. This approach requires additional education and training of our 900+ professionals around the firm’s footprint.  As a CTC Specialist, you will be the liaison between CTC support, CTC local office champions and the CTC development team. This is an instrumental role as successful implementation of CTC is critical to the tax department’s future vision.  Your duties would include obtaining a power user’s understanding of the CTC technology in its current state and its future iterations. In addition, Regional CTC Specialists will have a firm grasp of the work processes and how CTC functionality will support or replace current processes within his/her region. The CTC specialist will maintain relationships with local office champions and act as their conduit to the development team. They will also be responsible for creating user guides and answers to frequently asked questions. In addition, the CTC specialist will address support issues escalated from Level 2 support within his/her region and, in some instances, provide some tailored education or implementation within a specific office.Qualifications2-6 years tax experience in a public accounting firmCPA preferred, but not requiredSkills and experience in process changesSuperior skills in technologies such as excel, access database, CCH Axcess, GoSystem or othersExperience with supporting tax technologies, preferred but not requiredTeam oriented with a track record of success contributing in a high performance team.Passion for creating optimal work environments.Strong communication skillsAbout the Team: The Tax team at Crowe develops positive relationships with clients by providing value, knowledge and strategy focus. As part of the Tax group, you will be part of a collaborative team with deep specialization. We use proactive approaches and innovative tax technology to provide high quality tax services to our clients. If you are committed to client excellence, want to be part of a growing organization and are looking to expand your career, then Crowe is the place for you. Learn more about our Tax team Our Benefits: At Crowe, we know that great people is what makes a great firm. We value our people and offer employees a comprehensive benefits package. Learn more about what working at Crowe can mean for you!How You Can Grow: We will cultivate your talent in an inclusive culture that values diversity. You will have the chance to meet on a consistent basis with your Career Coach who will guide you in your career goals and aspirations. Learn more about where talent can prosper. More about Crowe: Crowe (www.crowe.com) is one of the largest public accounting, consulting and technology firms in the United States. Crowe uses its deep industry expertise to provide audit services to public and private entities while also helping clients reach their goals with tax, advisory, risk and performance services. Crowe is recognized by many organizations as one of the country's best places to work. Crowe serves clients worldwide as an independent member of Crowe Global, one of the largest global accounting networks in the world. The network consists of more than 200 independent accounting and advisory services firms in more than 130 countries around the world.  EOE  M/F/D/VCompany OverviewYour Journey at Crowe Starts Here: At Crowe, you have the opportunity to deliver innovative solutions to today’s complex business issues. Crowe’s accounting, consulting, and technology personnel are widely recognized for their in-depth expertise and understanding of sophisticated process frameworks and enabling technologies, along with their commitment to delivering measurable results that help clients build business value. Our focus on emerging technology solutions along with our commitment to internal career growth and exceptional client value has resulted in a firm that is routinely recognized as a “Best Place to Work.” We are 75 years strong and still growing. Come grow with us!"}