{"jobID": "2813851256", "jobLocation": "New_York_NY", "jobTitle": "Development and Communications Manager", "companyRating": "3.3", "companyInfo": {"Website": "www.jerichoproject.org", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "66000", "jobDescription": "About Jericho ProjectJericho Project is a nationally-acclaimed nonprofit ending homelessness at its roots by enabling homeless individuals and families to attain quality housing, employment and mental and physical health services. The 34-year-old nonprofit serves over 2,500 individuals, including 700 veterans, annually. Jericho has been a key partner in New York City’s initiative to end veterans’ homelessness, and is leading bold, innovative strategies to do the same for families and young adults.Our programs touch four cornerstones of a person’s life: housing, employment, wellness and family stability. We create a culture of “moving on” through a foundation of housing and supportive services provided by expert program specialists and case managers.We have over 400 units of supportive housing including 7 residences in the Bronx and Harlem, as well as scatter-site apartments throughout NYC. A new residence at Walton Avenue in the Bronx is under construction.About the PositionThe Development and Communications Department is responsible for Jericho Project’s fundraising and outreach efforts. The department raises funds from government, corporations, foundations, individual donors and special events to support Jericho Project’s work to end homelessness in New York City.The Development and Communications Manager (DCM) is responsible for supporting the work of the Development and Communications Department. The DCM is someone with major gifts experience ($10K+) who will be responsible for managing the existing pipeline of grant funders, identifying new funding prospects, assist in developing and maintaining a prospect portfolio to optimize fundraising opportunities, managing volunteer events and in-kind donations to the organization. The DCM will be responsible for preparing and writing and submitting letters of intent, grant proposals and funding reports; including compulsory follow-up reporting metrics and narratives. This position requires an individual who is detail-oriented, efficient, and accurate; with strong communication and interpersonal skills. The ability to effectively collaborate with and support internal departments, board members, key donors, government funders, and private/corporate foundations is essential. Networking and leveraging contacts are also important fundamental requirements to support the grant revenue goals. This position requires a self-starter who has high energy, takes initiative, and welcomes a challenge. It will require responding to a wide-ranging set of challenges and coordinating work across areas of this growing organization.Responsibilities:Fundraising, Grant Development & Management Actively work with the Chief Development and Communications Officer (CDCO) to set, track, and meet annual institutional fundraising goals. Assists the CEO and CDCO in identifying major gifts prospects, developing major gift strategies and a prospect portfolio to optimize funding opportunities. Writes and reviews letters of intent, concept papers, grant proposals (private, government and corporate) and funding reports. Provide project management for responses to government RFPs. Manages communications and relationships with current and prospective institutional funders. Maintain up to date information on funder grant deadlines and reporting requirements to ensure compliance with such deadlines. Solicit and oversee in-kind donations to the organization. Provides bi-weekly project status updates to CDCO.Fiscal and Program Reporting Coordinate with CFO to create grant and report budgets. Work with Chief Officers and Program staff to gather appropriate quantitative data and outcome measurements to support the creation of strong donor reports and updates.Special Events & Marketing Along with the CEO, Board of Directors and CDCO, assist with the planning and execution of organization’s annual gala, other fundraising and volunteer events. Along with CDCO, manage and create Jericho’s Email Communications via Constant Contact.Other Supervises the Development & Communications Associate. Other duties by the CDCO reasonably related to job responsibilities.Requirements: Bachelor’s Degree required. At least 5 years’ experience in grant writing, prospect research and donor cultivation. Track record of success with foundation, corporate, and government grants. Excellent oral and written communications skills ability to write clear, structured, and persuasive proposals. Experience with coordinating special events. Strong research, strategic and critical thinking skills. Proficient presentation and written communications skills. Strategic understanding of donor research, donor segmentation, and donor relations. Organized, detail oriented, with the ability to manage multiple projects and deadlines. Intermediate/Advanced knowledge of Microsoft Office (Word, Excel, PowerPoint, Outlook). Experience with DonorPerfect is a plus. A commitment to the mission and values of Jericho Project.Compensation:Salary is commensurate with experience. Jericho Project offers a comprehensive benefits package.How to Apply:Interested applicants must submit a cover letter and with salary requirements to:Human Resources DepartmentJericho ProjectJob Code: Development and Communications Manager245 W. 29th Street, Suite 902New York, NY 10001Fax 646.624.2301careers@jerichoproject.orgNo Phone Calls Please.Jericho Project is an equal opportunity employer that does not discriminate in its hiring practices and, in order to build the strongest possible workforce, actively seeks a diverse applicant pool. www.jerichoproject.org"}