{"jobID": "2816373391", "jobLocation": "New_York_NY", "jobTitle": "Onsite Service Desk Engineer", "companyRating": "4.2", "companyInfo": {"Website": "www.dataprise.com", "Headquarters": "Rockville, MD", "Size": "201 to 500 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " mindSHIFT, All Covered"}, "estimatedSalary": "17", "jobDescription": " Onsite Service Desk Engineers at Dataprise play an integral role in our success and are at the true core of our service offerings. You will get the opportunity to work with clients and provide support on a large variety of technical issues, which will keep you on your toes and expose you to learning the latest and greatest technologies all day every day. Are you up for the challenge? As an Onsite Service Desk Engineer, picture yourself:Taking ownership of customer incidents by providing onsite, telephone, and email support to a Dataprise client in the NYC (Lower Manhattan) area.Troubleshooting and resolving various technical issues related to computer hardware and software problems.Configuring and troubleshooting issues related to the following technologies (and much more!): Windows Server, DNS, DHCP, VPN Clients, Group Policy, Folder Permissions, Firewalls, VMWare servers, Printers on Terminal/Citrix servers, Printer Servers, Office 365, Macs, workstation and network connectivity issues, Exchange Server, and Microsoft Office Applications and the latest versions of the Microsoft Office suite.Collaborating with a great team to identify solutions to customer support requests and escalating to more senior team members or external resources as needed.Learning a ton, being faced with new challenges every day, and gaining exposure to all of the most cutting-edge technologies.Our ideal Onsite Service Desk Engineer has:A couple of years of related experience, ideally working with external clients in the Managed Services or IT Services industry.Strong technical aptitude and hands-on experience with the following technologies: Windows Server, Exchange Server, Active Directory, Firewalls, DNS, DHCP, VMWare, Office 365, Microsoft Office Application and Microsoft Office. Even better, if you have hands on experience with Citrix, Macs, and Small Business Server.Stellar communication and the ability to speak clearly and explain just about anything to anyone over the phone and/or in writing.A true passion and drive for creating an unmatched customer service experience.The ability to deliver excellence independently and as a team and excel in a fast-paced environment.A strong desire to learn and focus to ensure we are helping our clients win with IT.The availability to work flexible hours and onsite at customer locations.A Bachelor's Degree in a related field.Industry certifications such as A+, Network+, MTA, MCSADataprise is an Equal Opportunity Employer."}