{"jobID": "2824289319", "jobLocation": "Boston_MA", "jobTitle": "Senior Data Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.mcphs.edu", "Headquarters": "Boston, MA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " College / University", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": " Overview  For nearly 200 years, MCPHS University, formerly known as Massachusetts College of Pharmacy and Health Sciences, has been at the forefront of innovation in the healthcare world. We take pride in our history, yet are motivated by a curiosity about the future. That's why we are constantly updating our state-of-the-art labs, innovating our curriculums, and adding programs to coincide with the needs of an ever-changing healthcare landscape.  Faculty and staff continue to bring their talents and skills to MCPHS University to contribute to our mission of guiding and supporting students toward successful and sustainable careers in healthcare. Whatever position an employee holds, their efforts make an important impact on the overall quality of campus life. Employees are an integral part of a community that is proud of its heritage and the accomplishments that make MCPHS University a first-class educational institution. Responsibilities The Senior Data Analyst shares responsibility for conducting research on all aspects of the University for evidence-based decision-making and assessment based activities by offering support, information, and guidance to the Office of Institutional Research and Assessment (OIRA) Director. Develop and maintain OIRA databasesApply research methods in the collection and analysis of university dataWork closely with the Director and other University personnel to assure that data is available to support planning and decision makingComplete mandated reports and surveys for internal use and external agenciesConduct independent research and data analysisWork with other offices to understand how institutional culture affects metrics assessing institutional performanceDevelop, in collaboration with the Director, an effective vision, strategic plan and procedure for OIRACollaborate with Admissions, the Registrar, Human Resources and the Financial Aid to access data and maintain data integrityPerform job functions in a collegial and professional manner and communicate in a clear and timely fashionWork independently as a member of a team with varying skill-setsRepresent the college at State and local meetings Additional responsibilities may be assigned by the supervisor. QualificationsRequired:A Bachelor's degree in Statistical Analysis, Social Science, Operations Research or related field; a Master's degree is preferredA minimum of one year of experience in an academic setting, extracting, analyzing, and reporting dataDemonstrated ability and knowledge of research designs, statistical methods, and survey methodologiesExperience with SPSS, Microsoft Access, Qualtrics, and intermediate-advanced Microsoft Excel skillsDesired:Demonstrated experience with predictive analytics/modelling to support student enrollment, retention and success measuresDemonstrated experience using Tableau or other data visualization/dashboard toolsStrong interpersonal and writing skillsAbility to work in a fast-paced environment, set priorities and meet deadlinesGood organizational skills and attention to detail MCPHS offers a competitive salary and excellent benefits, including a substantial health/dental insurance subsidy, generous holiday/vacation policy, and a significant pension plan contribution.  Please attach a cover letter and a resume. No phone calls, please. Principals only. No relocation available. Finalist candidate(s) for this position will be subject to a pre-employment background check as a condition of employment. MCPHS University is an equal opportunity employer. Applicants who would enrich the University's diversity are welcome to apply."}