{"jobID": "2791591383", "jobLocation": "New_York_NY", "jobTitle": "Cost Controller", "companyRating": null, "companyInfo": {"Website": "www.dragados-canada.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "SummaryThe Cost Controller will supervise the monthly closing and preparation of an executive summary to be presented to the executive committee. This individual will prepare the forecast for billing, revenue and cost ensuring that all the inputs are taken into account and are analyzed for their impact in the overall project.ResponsibilitiesCost Control: supervise the preparation of various reports as well as analyzing them to accurately reflect the current situation of the project. The reports include but are not limited to monthly cost reports, weekly reports, LDR, Payroll, time cards and weekly quantities.Monthly Payments: In charge of supervising the preparation of the payment to be presented to the owner at the end for each month.Procurement Department: In charge of supervising the preparation of contracts, subcontractors agreements, service agreements, purchase orders and change orders.Claims, Change Orders, Contract Modifications, and Contractor Proposal Requests: In charge of supervising all the modifications that will appear to the original contract, estimating the billing and cost impact to the project. He will be in charge of negotiating with the owner these changes.General Schedule of Project: Will be in charge of supervising the schedule monthly updates, time impact analysis and any change in the final completion date of the project.Cash Flow Projections: Will analyze the cash situation of the project on a monthly base and forecast any needs of funds at least one month ahead of timeRequirementsBachelor's Degree from an accredited four-year college or university, Civil Engineering or Construction Management with a financial background or financial education and experience in heavy construction projects.At least 10 years of experience within a construction firm, Construction experience in heavy civil projects and some field experience preferredExcellent interpersonal skills to communicate orally and writtenKnowledge in eCMS or similar system and knowledge in HCSS and Autocad preferredCapable of handling multiple projects and assignmentsAbility to travel up to 60 - 75%Dragados USA Inc. is an Equal Opportunity Employer"}