{"jobID": "2821069336", "jobLocation": "Santa_Clara_CA", "jobTitle": "Senior Instructional Designer/Technologist", "companyRating": "3.7", "companyInfo": {"Website": "www.marvell.com", "Headquarters": "Santa Clara, CA", "Size": "1001 to 5000 employees", "Founded": " 1995", "Type": " Company - Public (MRVL) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "101000", "jobDescription": "Overview:We are Marvell Talent Management. We believe that talent reside everywhere. We want it to grow and thrive at Marvell. Our mission is to build an innovative learning platform for Marvell employees to achieve high performance and continuous growth – creating a place where talented people want to be. Come join us and help us shape the future.Responsibilities:We are looking for a senior instructional designer/technologist who can help us develop a unique roadmap and design learning innovations that meet the needs of the modern learner and incorporate the best of current and emerging design thinking, including “beyond classroom” innovations, micro learning, and on-demand learning.Key Functions:Collaborate with leadership, subject matter experts, and cross-functional peers to identify performance gaps. Analyze data, extract relevant information that addresses performance gaps, and conduct additional research to fill in any content gaps. Design a strategic global roadmap that takes into consideration business priorities and trade-offs (cost, quality and speed)Utilize technology to create a high level of employee participation through various channels that drive learning and increased knowledge through the use of mobile learning, micro learning, social learning, blended learning, video-based learning, animation, infographics, gamification and virtual instructor-led.Evaluate, leverage and integrate new technology and digital tools such as mobile learning, apps, web conferencing, microblogs, and other digital learning platforms to make learning “real-time” and to encourage continuous learningDevelop instructionally sound materials with performance support solutions for a variety of topics and applications.Structure and organize content in a way that is easy to process and engage the learner using diverse methodologies (e.g. writing, storytelling, scenarios, layout, imagery, feedback, self-discovery, and activities) that are applicable to the learner’s real world.Develop training deliverables for a variety of delivery methods, (e.g. storyboards, gaming, social networking, participant guides, facilitator guides, webinars, video/audio scripts, scenario-based learning, job aids, DIY solutions)Effectively express ideas and thoughts verbally and visually to match the audience and delivery method. Deliverables must be clear, concise and grammatically correct.Organize, prioritize, coordinate and implement multiple projects within established timelines.Accountable for managing all aspects of assigned projects. Regularly communicate with Head of Talent Management and stakeholders on defining/reviewing deliverables, providing regular dashboard updates on project status, managing changes in scope, and quickly resolving or appropriately escalating challenges.Produce high-quality deliverables in a fast-paced, dynamic, often times ambiguous, deadline-oriented business environment.Create assessment methods that foster the learner’s development by providing opportunities to demonstrate their mastery of learning goals.Use evaluation data to measure impact and assess delivery process improvement opportunities. Challenge the status quo to drive improved outcomes.Requirements:Instructional Design, Instructional Technologies or related field - Bachelor’s required / Master’s Highly PreferredMaster’s Degree in Instructional Design, Instructional Technologies or related field preferredMinimum of 7 years of professional experience in instructional design and technologiesEstablished track record for using a consultative approach to design and deliver innovate learning solutions with measurable business results that make stakeholder needs.Strong experience in adult learning theories, leading-edge instructional design methods (e.g. micro learning strategies), and measurement of training effectiveness.Experience developing learning roadmaps and solutions for a global audience."}