{"jobID": "2745237652", "jobLocation": "New_York_NY", "jobTitle": "Cyber Analytics Data Scientist, Manager", "companyRating": "3.8", "companyInfo": {"Website": "www.pwc.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "138000", "jobDescription": " PwC/LOS Overview  PwC is a network of firms committed to delivering quality in assurance, tax and advisory services.  We help resolve complex issues for our clients and identify opportunities. Learn more about us at www.pwc.com/us.  At PwC, we develop leaders at all levels. The distinctive leadership framework we call the PwC Professional (http://pwc.to/pwcpro) provides our people with a road map to grow their skills and build their careers. Our approach to ongoing development shapes employees into leaders, no matter the role or job title.  Are you ready to build a career in a rapidly changing world? Developing as a PwC Professional means that you will be ready to create and capture opportunities to advance your career and fulfill your potential. To learn more, visit us at www.pwc.com/careers. PwC Advisory helps our clients with their most challenging imperatives from strategy through execution. We combine the breadth of knowledge of over 48,000 global professionals with deep industry knowledge to deliver custom solutions for our clients. We work with the world's largest and most complex companies and understand the unique business issues and opportunities our clients face. Job Description As we aim to rapidly grow our Cybersecurity and Privacy practice, we are looking for consultants who are passionate about how strategy and technology can improve the role of cybersecurity, privacy and data protection in our digital world.  We are looking for consultants with extensive consulting, technological and industry experience who will help our clients solve their complex business issues from strategy through execution. A Cybersecurity and Privacy consulting career will provide the opportunity to grow and contribute to our clients' business issues every day, applying a collection of information and Cyber security capabilities, including security and privacy strategy and governance, IT risk, security testing, technology implementation/operations, and cybercrime and breach response.  Our Implementation and Operations services help clients smoothly and efficiently integrate new technology systems into the business, ensure that technology is properly synthesized and managed, and find and resolve unknown issues. We help clients architect, implement, and optimize security technologies to manage visibility, access, identification, and control over sensitive data and systems. We also provide differentiated, high-value managed services by supporting key security technologies through traditional operations activities with a continuous improvement mind-set.  Position/Program Requirements  Minimum Year(s) of Experience: 6  Minimum Degree Required: Bachelor's degree  Certification(s) Preferred: Certified Information Systems Security Professional (CISSP), Certified Information Security Manager (CISM). Knowledge Preferred: Demonstrates extensive knowledge and/or a proven record of success managing client engagements relating to the defining and assessing of the clientâs information security strategy, architecture and practices, including the following: Requirements analysis, strategy, design, implementation, and migration for businesses; and,Supervision and development of staff on multiple projects, business development, and communications with executives. Demonstrates extensive knowledge and/or a proven record of success in information security competencies such as Executive Dashboards, Cybersecurity Program Metrics, Endpoint Protection, Web Application Firewall, Vulnerability Scanning, Data Loss Prevention (Data-In-Motion and Data-At-Rest), VPN, Authentication Monitoring, User Behavior Analytics, Security Incident Response, IAM, and Data Lake Architecture and Integration.  Demonstrates extensive knowledge and/or a proven record of success  developing and implementing cybersecurity analytics solutions and capabilities that are clearly aligned to their business, technology and threat drivers.  Demonstrates extensive knowledge and/or a proven record of success of NIST, FIPS, OWASP, OASIS, COBIT as well as other industry recognized information security/privacy standards and industry leading practices. Skills Preferred: Demonstrates extensive abilities and/or a proven record of success utilizing the following when managing and producing deliverables for client engagements related to managing successful enterprise scale strategy and implementations within Information Security, including: Leading the planning, creation and management of security architecture, components, policies and standards for all applicable platforms within client environment;Identifying and addressing client needs: building solid relationships with clients; demonstrating flexibility in prioritizing and completing tasks; and resolving potential conflicts as a leader;Performing as a team member: understanding personal and team roles; contributing to a positive working environment; proactively seeking guidance, clarification and feedback; providing guidance, clarification and feedback to less experienced staff;Applying risk management principles on solving complex business issues involving advanced analysis and reporting of data that inform business decisions through the development of information security risk scenarios leveraging internal, external and systemic inputs;Planning security systems by evaluating network and security technologies; developing requirements for data integration, and ingesting data sources from industry standards tools;Tracking developments and changes in the threat environments to establish that they are adequately addressed in the clientâs security analytics platform;Evaluating new solutions and services, providing a business case on whether the firm should develop skills and vendor relations within new solutions and technologies within information security cybersecurity analytics industry;Utilizing skills such as SQL, MDX and mining large data sets;Managing a team and/or work stream on an engagement(s), staying educated on current trends and assisting in the development of knowledge capital;Collaborating with business development teams responsible for writing and presenting proposals to prospective clients;Managing and/or contributing to project planning, engagement administration, budget management, and the successful completion of engagement workstreams; and,Contributing to business development opportunities and/or engagements from pre-sale and initial scoping through final delivery and sign-off."}