{"jobID": "2801958519", "jobLocation": "Santa_Clara_CA", "jobTitle": "Technical Support Administrator (Temporary/Part-Time)", "companyRating": "3.9", "companyInfo": {"Website": "www.pivotinteriors.com", "Headquarters": "Santa Clara, CA", "Size": "201 to 500 employees", "Founded": " 1973", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " One Workplace, Tangram Interiors"}, "estimatedSalary": "23", "jobDescription": "SUMMARYProvide Help Desk support to internal customers (employees) for most or all applications used by the dealership, for example, Cap, AutoCAD, MS Office programs, etc. Become cross-trained in the company infrastructure such as the network, routers, servers, back-up system, etc. in order to provide back-up and eventually specialized support in various parts of the infrastructure. Some travel to Northern and Southern California offices is required.ESSENTIAL DUTIES AND RESPONSIBILITIES include the following. Other duties may be assigned.Configures, installs, and maintains local area network hardware, software, and telecommunications services such as system software, software applications, printers, servers, routers, bridges, switches, modems, cabling, and Internet service providersManages setup, deployment, administration and support of desktop workstations for new employees.Maintains company helpdesk support, demonstrates effective time management & documentation, analyzes productivity and areas for improvementProvides assistance to employees with various technical issues via email, phone and in-person at company headquartersSupports IT Director with network administration, LAN/WAN, Internet connectivity, server, and other technical projects.Assists in IT-related setup, expansion and troubleshooting in remote offices.Other projects related to the growth of our network and infrastructure.Potentially trains in and specializes in certain IT areas of responsibility, according to need and interest, which may include such areas as: Server setup and implementationLearning Management System training administration software setup and implementationBackup processes at all locations (partially online, partially tape backup)Disaster plan development and implementation.Voice over IP system administrationIT training development and implementationNew server setup and deploymentVarious programs’ administration and developmentHosted Exchange and Outlook maintenance and administrationProgramming and maintaining routers and firewallsWrites or revises user training manuals and procedures.Develops training materials such as exercises and visual displays.As proficiency increases, may train users on software and hardware on-site or in classroom, or recommend outside contractors to provide training.Calls software and hardware vendors to request service regarding defective products.Tests software and hardware to evaluate ease of use and whether product will aid user in performing work.Writes software and hardware evaluation and recommendation for management review.Keeps abreast of new and changing technologies in order to provide ideas and recommendations for improving the company’s technology.SUPERVISORY RESPONSIBILITIESThis job has no supervisory responsibilities.QUALIFICATIONS To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.EDUCATION and/or EXPERIENCETechnology Support Administrator 1 - Requires a high school diploma or GED plus design related Bachelor’s degree and up to 1 year of related experience; or equivalent combination of education and experience. Has knowledge of commonly-used concepts, practices, and procedures within field. Relies on instructions and pre-established guidelines to perform the functions of the job. Works under immediate supervision. Primary job functions do not typically require exercising independent judgment. Working knowledge of common technologies essential. Experience and demonstrated skill using software and troubleshooting common hardware.Technology Support Administrator 2 - Requires a high school diploma or GED plus design related Bachelor’s degree and up 2-5 years of related experience; or equivalent combination of education and experience. Familiarity with standard concepts, practices, and procedures within field. Relies on limited experience and judgment to plan and accomplish goals. Working knowledge of common technologies essential. Experience and demonstrated skill using software and troubleshooting common hardware.Technology Support Administrator 3 - Requires a high school diploma or GED plus design related Bachelor’s degree and at least 5 years of related experience; or equivalent combination of education and experience. Familiar with a variety of the field's concepts, practices, and procedures. Relies on experience and judgment to plan and accomplish goals. Performs a variety of tasks. May lead, train and direct the work of others. A wide degree of creativity and latitude is expected. Working knowledge of common technologies essential. Experience and demonstrated skill using software and troubleshooting common hardware.Technology Support Administrator 4 (Sr. Lead) - Requires a high school diploma or GED plus design related Bachelor’s degree and at least 7 years of related experience; or equivalent combination of education and experience. Familiar with a variety of the field's concepts, practices, and procedures. Relies on experience and judgment to plan and accomplish goals. Performs a variety of tasks. May lead, train and direct the work of others. A wide degree of creativity and latitude is expected. Working knowledge of common technologies essential. Experience and demonstrated skill using software and troubleshooting common hardware. Other responsibilities may include: leading and planning meetings, proposing ideas to improve efficiencies, facilitating implementation of standards, assisting with training and advocating growth/learning.LANGUAGE SKILLSAbility to read and interpret documents such as safety rules, operating and maintenance instructions, and procedure manuals. Ability to write routine reports and correspondence. Ability to speak effectively before groups of customers or employees of organization. Strong written and verbal communication skills.MATHEMATICAL SKILLSAbility to add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions, and decimals. Ability to compute rate, ratio, and percent and to draw and interpret bar graphs.REASONING ABILITYAbility to apply common sense understanding to carry out instructions furnished in written, oral, or diagram form. Ability to deal with problems involving several concrete variables in standardized situations.PHYSICAL DEMANDS The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.While performing the duties of this job, the employee is regularly required to sit. The employee frequently is required to use hands to finger, handle, or feel and talk or hear. The employee is occasionally required to stand; walk; reach with hands and arms; and stoop, kneel, crouch, or crawl. The employee must occasionally lift and/or move up to 50 pounds. Specific vision abilities required by this job include close vision, and ability to adjust focus.WORK ENVIRONMENT The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Equal Opportunity Employer–minorities/females/veterans/individuals with disabilities/sexual orientation/gender identity."}