{"jobID": "2823454490", "jobLocation": "Oakland_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.roseit.com", "Headquarters": "Chesterfield, MO", "Size": "1001 to 5000 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Position Title: Data ScientistPosition Number: 284293Location: Oakland, CADesired Skill Set: Analytical Skills, Healthcare, R Programming, SAS, SQLPosition Description: **C2C and STEM-OPT are not available** *Only U.S. Citizens and those authorized to work in the U.S. can be considered as W2 candidates.** Title: Data Scientist / Statistics Consultant  Duration: TBD  Location: Oakland, CA Description:Under general supervision, assists with strategic data-related decisions by analyzing, manipulating, tracking, internally managing and reporting data.This position functions both as a senior consultant and analyst and as a high-level SAS programmer.Education/License/Certification: MS or PhD in economics, finance, health care administration, public health administration, statistics, mathematics, operations research, epidemiology, or related field required, or equivalent work experience in lieu of a degree.Qualifications:3-5 years programming in SAS required. Experience with SQL, macros, AF, and SASGRAPH, PROC Report and statistical procedures in SAS preferred.Experience with analytical manipulation and interpretation of large databases required.3-5 years of related analytical consulting experience, healthcare experience preferred. Broad familiarity with medical practices, especially population management and process and outcomes measurement. Project management experience preferred.Strong analytic and critical thinking skills, writing skills, communication skills, consulting skills, and ability to work within a team. Ability to express complex analytical and technical information to senior management or to audiences with clinical training. Must be an independent self-starter.History of peer reviewed publications and successful grant applications preferred.Familiarity with Tableau, and other statistical software tools, such as R and Python preferred.Duties:Participates in the development of outcomes and process measures, including technical specifications, to enable population measurement, guideline implementation, and evaluation.Participates in the design and development of advanced analytics models and tools, such as for data science, forecasting, predictive models, statistical analysis and evaluation for population care and managementAssists with the definition of complex multi-dimensional healthcare issues and translate needs, issues, and ideas into effective analytics plans. May help formulate specific implementation plans and evaluates the effectiveness of actions/programs implemented.May assist in the determination of goals and priorities with team, clients, or project management sponsors. May develop novel applications of statistical analyses from other fields to understand increasingly complex relationships between processes and outcomes, including in time series designs.May communicate results/recommendations to project sponsors, clients, and various senior level audiences"}