{"jobID": "2789424421", "jobLocation": "Redmond_WA", "jobTitle": "Data Scientist-Digital Stores", "companyRating": "4.1", "companyInfo": {"Website": "www.microsoft.com", "Headquarters": "Redmond, WA", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (MSFT) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Amazon, Apple"}, "estimatedSalary": "139000", "jobDescription": " The Microsoft digital store is looking for a data scientist who has approved capability in designing and prototyping analytical solution to measure the incremental business impact of various marketing activities. The Microsoft Stores reach hundreds of millions of customers worldwide each month through Xbox console, microsoft.com, and windows app ---three digital storefronts as well as Microsoft physical stores. The mission of Microsoft store is to delight every customer with fantastic and unified learning and buying experience.  Our data scientist team leverages big data to empower business decisions and deliver metrics, insights and tools. We are now looking for a talented and driven data scientist to accelerate our efforts and be a major part of our data-centric culture. The marketing science data scientist is responsible for designing and prototyping highly-scalable solution to measure the incrementality of marketing activities, e.g. email/CRM campaign, seasonal promotion, launching new features to store. This individual will work closely with cross functional teams such as store marketing, product category, store feature/capability, and data engineering to develop and deliver models and analytics solution. Successful candidates will exhibit technical acumen and business savvy, with a passion for making impacts through timely actions. This individual will be scrappy, focused on results, a self-starter, and have demonstrated success in using analytics and statistics to measure business impact and create customer insights.Responsibilities"}