{"jobID": "2822682095", "jobLocation": "Quincy_MA", "jobTitle": "Senior Healthcare Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.mass.gov", "Headquarters": "Chelsea, MA", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Government", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The mission of MassHealth is to improve the health outcomes of our diverse members, their families and their communities by providing access to integrated health care services that sustainably promote health, well-being, independence and quality of life.  Massachusetts' Office of Medicaid (MassHealth) is looking for an exceptional Senior Healthcare Data Analyst to join the Office of Analytics. The MassHealth Analytics team produces quantitative and qualitative analyses to inform business decisions at MassHealth. The selected candidate will work for the MassHealth Office of Analytics, reporting to the Manager of Analytics, and will collaborate closely with other MassHealth units to identify and answer key analytic questions to inform MassHealth policy and operations.  The Senior Healthcare Data Analyst will work closely with MassHealth's Payment and Care Delivery Innovation team to monitor and report on MassHealth's new Accountable Care Organizations and Community Partner Programs. The Analyst will support key programs by using SAS and SQL to produce in depth-analyses of complex health care data, including understanding key drivers of quality, costs, and utilization measures. This role will focus primarily on quality measure reporting; the chosen individual will partner with program staff to support questions on data anomalies and calculations and interpretation of quality-related measures obtained using claims and encounter data. The analyst will also serve as SME support of vendor activities. The Senior Health Data Analyst will be required to work on multiple concurrent projects while managing to successfully complete deliverables independently. The position will be based in Quincy, MA. DUTIES AND RESPONSIBILITIESConduct analyses and produce standard reports and ad-hoc analyses through SAS and/or SQL to monitor program performance and provide insight.Analyze, interpret, and present information from multiple data sources utilizing a broad array of technology resources (SAS, SQL, Cognos, Excel, Access, PowerPoint, etc.)Manage and prioritize analytic requests from several departments within MassHealth.Liaise with external vendors and data warehouse staff to inform key analytic and reporting deliverables and ensure that development timelines crucial to program operations are met.Serve as a subject matter expert on MassHealth data, providing insight into the capabilities and limitations of MassHealth data, particularly relating to the calculation of quality and utilization measures.Effectively communicate with internal and external stakeholders and adapt aspects of the program accordingly.Manage a multitude of complex tasks simultaneously, including prioritizing various tasks, analyzing and evaluating policy and program issues and ensuring that tasks are brought to completion.Provide interpretation of data for key stakeholders and leadership, including identifying and reporting data patterns and abnormalities.Other Duties as assigned.PREFERRED QUALIFICATIONSMasters' degree in a public policy, public administration, public health, economics, health care administration, epidemiology, statistics, or a related field.At least four years of work experience in a healthcare analytics environment, including work with healthcare administrative data (claims, member enrollment information, etc.).Familiarity with industry standard Quality Measures and Specifications, such as HEDIS and NCQA measures.Proficient in SAS and/or SQL and other data manipulation tools.Experience performing successful analyses under strict timeline pressure.Strong critical thinking and problem-solving skills.Advanced understanding of health care administrative data and complex healthcare data.Knowledge of health care terminology and use of diagnoses, revenue codes, etc.Experience leading project-based teams on complex, long-term initiatives. Experience working with actuaries, clinicians, health policy experts, and other subject matter experts.Ability to develop and maintain effective working relationships with a range of stakeholders and partners.Ability to work with technical staff, including programming staff and analytic contractors.Strong analytical, organizational, interpersonal, verbal and written communications skills.Knowledge of the MassHealth Policy, key health policy issues, and Massachusetts health care industry and market dynamics.Ability to prioritize numerous tasks, under time constraints, and changing priorities.Special Requirements: Based on assignment, possession of a current and valid Massachusetts Class D Motor Vehicle Operator's license or the equivalent from another state may be required. Pre-OfferProcess: A criminalbackground check will be completed on the recommended candidate as required bythe regulations set forth by the Executive Office of Health and Human Servicesprior to the candidate being hired. For more information, please visit http://www.mass.gov/hhs/cori and click on \"Information forJob Applicants\".  Education,licensure and certifications will be verified in accordance with the HumanResources Division's Hiring Guidelines  Education and license/certification information provided by theselected candidate(s) is subject to the Massachusetts Public Records Law andmay be published on the Commonwealth's website.  For questions, please the contact the CYF Office of HumanResources at 1-800-510-4122 and select option #2.  First consideration will be given to those applicants that apply within the first 14 days. MINIMUM ENTRANCE REQUIREMENTS: Applicants must have at least (A) four years or full-time, or equivalent part-time professional experience in business administration, health care planning or administration, public health policy or administration, human services policy analyses or administration or economics, the major duties of which included financial analysis or costs, expenses and revenue and/or the development, implementation and monitoring or financial reimbursement systems, or (B) any equivalent combination of the required experience and the substitutions below. Substitutions: I. A Bachelor's degree with a major in health care administration, hospital administration, public health or health services administration, accounting, business administration, business management, public policy, public administration or economics may be substituted for a maximum of two years of the required experience.  II. A graduate degree with a major in health care administration, hospital administration, public health or health services administration, accounting, business administration, business management, public policy, public administration or economics may be substituted for a maximum of three years of the required experience.* Education toward such a degree will be prorated on the basis of the proportion of the requirements actually completed. NOTE: Educational substitutions will only be permitted for a maximum of three years of the required experience.  SPECIAL REQUIREMENTS: None.  An Equal Opportunity / Affirmative Action Employer. Females, minorities, veterans, and persons with disabilities are strongly encouraged to apply."}