{"jobID": "2694287242", "jobLocation": "Sunnyvale_CA", "jobTitle": "Vice President, General Counsel", "companyRating": "2.4", "companyInfo": {"Website": "www.support.com", "Headquarters": "Sunnyvale, CA", "Size": "1001 to 5000 employees", "Founded": " 1997", "Type": " Company - Public (SPRT) ", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " CA Technologies, Citrix, VMware"}, "estimatedSalary": "207000", "jobDescription": "Job Title: Vice President, General Counsel Location:USExternal Description:Job Title: Vice President & General CounselSupport.com, Inc. (NASDAQ: SPRT) is a leading provider of tech support and turnkey support center services, producer of SUPERAntiSpyware® anti-malware products, and the maker of Support.com® software. Support.com services and products help leading brands deepen their customer relationships. Customers want technology that works the way it's intended. By using Support.com services and software, companies can deliver a fantastic customer experience, leading to happier customers, greater brand loyalty and growing revenues.  The Vice President & General Counsel will handle all legal issues affecting Support.com. The General Counsel will report directly to the Company's President and CEO, and provide the legal viewpoint to our decision-making process. This role will also serve as the Company's Secretary. The General Counsel will consult with and retain outside counsel as needed for litigation, and other specialized matters.  Some specific responsibilities will include, but are not limited to: Provide legal oversight, solutions-oriented guidance and recommendations to stakeholders and Senior Management on all legal matters affecting the CompanyEnsure the legal rights of the Company are protected, its legal obligations and potential exposures and risks are well defined and understood by management, and that the Company complies with applicable laws and regulations.Establish and maintain effective working relationships and support for business units and provide appropriate guidance and advice as necessary.Manage to a budget and minimize unnecessary outside counsel spend.Advise the board of directors on all legal matters, including corporate governance and SEC complianceDraft, review and advise on all period reports (10Qs, 10Ks, 8ks) and Section 16 filings (Forms 3, 4 and 5) and other securities mattersSet internal governance policies and manage the impact of external factorsManage all litigation and employment law issuesReview and negotiate Company contracts.Craft solutions to legal and regulatory issues in compliance with Federal and State regulations.Manage small legal teamManage stock administrationManage the compliance programAct as Board SecretaryIdentify proactive solutions that will eliminate or mitigate risksBase your decision making process on ethics and integrityDeal with complex, significant matters in multiple disciplines with competing prioritiesYour skills and experienceRequired Experience:Corporate/Securities: Ongoing securities laws compliance, including preparation of SEC filings ( proxy statements and current reports); manage subsidiary compliance and maintenance of corporate records, including international and domestic company board and shareholder materials; create and maintain corporate records databases; coordinate and perform day-to-day activities relating to corporate governance and filings; assist in mergers and acquisitions-related matters; and support efforts to prepare for meetings and requirements of the Board of Directors and Committees. Compliance: Support company compliance initiatives and training programs; act as Records Coordinator and maintain and update legal record retention requirements in support of the corporate Secretary; and assist in the implementation, training, and maintenance of the compliance related policies, processes and procedures as needed. Intellectual Property: Review products and services to provide intellectual property clearance, compliance with applicable advertising, export and privacy laws, and compliance with company and industry standards; review marketing materials to provide intellectual property clearance, compliance with applicable advertising and privacy laws, and compliance with company and industry standards; perform trademark clearance searches and assist in management of patent, trademark and copyright portfolios. Contract Negotiation. Draft and negotiate contracts with our customers that protect the business-case margin profile and preserve customer relationships. Desired Skills:Securities and corporate governance experienceContract drafting and negotiation, particularly services, SaaS and cloud-based software licensing agreements.Intellectual property experience and expertiseInternational business experienceCorporate secretary experienceBroad legal subject matter knowledgeTechnical knowledge Support.com is an Equal Opportunity EmployerJob Description:"}