{"jobID": "2826773010", "jobLocation": "Milpitas_CA", "jobTitle": "Director, Sales Engineering", "companyRating": "3.4", "companyInfo": {"Website": "www.sonicwall.com", "Headquarters": "Milpitas, CA", "Size": "1001 to 5000 employees", "Founded": " 1991", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " WatchGuard Technologies, Fortinet, Check Point Software Technologies"}, "estimatedSalary": "178000", "jobDescription": " SonicWall Sales Engineering Director North America  Location Remote US near major airline hub  SonicWall is a leading provider of network security solutions to a broad range of clients. We are currently looking for a Sales Engineering Director - North America managing the presales engineering field organization and working closely with our channel partners and key customers.  We are looking for a senior level thought leader with outstanding technical, managerial and business skills to enable and drive a world-class, customer-driven field SE organization supporting our sales and channel teams.  Role Responsibilities: As a 2nd level leader, work closely with the executive team and first level SE managers to manage the SE organization in alignment with company goals.Help define and build foundational practices that allow SonicWall to deliver world-class presales efforts to our most important partners and customers.As necessary, travel to assist local SonicWall account teams and key partners in closing deals in competitive sales situations and service strategic customers as they consider, implement and maintain SonicWall products.Engage with partner principals and customers from the C Level to build stronger relationships and establish value.Help articulate a collective voice from the field to the strategy and product teams in order to build solutions that solve customer problems.Liaise with sales, marketing, product management, professional services, support and relevant functions to help manage the business.Work closely with the SonicWall support leadership as required to solve our most demanding support cases.Implement standard operating and enablement models, drive KPIs in order to exceed operating requirements.Manage the employee lifecycle including T&E;, staffing, operating objectives and efficiency.  RequirementsAdvanced College degree, equivalent education or experience.Attainment of CISSP or other advanced relevant designation desired.Previous experience as a 2nd level manager or above desired.5+ years of experience managing large teams strongly desired.10+ years of experience working in security and/or in related technical field organizations.Up to 60% travel requirement (up to 3 days per week average).Able to work effectively and relate with executive, management, individual contributors and partners. Comfortable managing up and down in the organization.Demonstrated ability to adapt, operate in a high-capacity and dynamic environment and thrive in demanding situations while making rational decisions focused on business objectives and best outcomes."}