{"jobID": "2678823576", "jobLocation": "Marin_City_CA", "jobTitle": "Nurse, Case Manager, Home Health", "companyRating": null, "companyInfo": {"Website": "www.hospicebythebay.org", "Headquarters": "Larkspur, CA", "Size": "201 to 500 employees", "Founded": " 1975", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Pathways Home Health and Hospice, Sutter Care at Home, VITAS Healthcare"}, "estimatedSalary": null, "jobDescription": " Incare is a full service Home Health care agency that provides a wide range of health care services that can be given in a patients home for an illness or injury. The goal of home health care is to treat an illness or injury to help patients, regain independence and become as self-sufficient as possible. Incare has been recently acquired by HBTB as is one of our service line divisions.  We are currently seeking a nurse to serve as Case Manager in the Marin County area. This person will be responsible for case management of a selected group of patients and for the coordination of home health care services for that group of patients. The RN Case Manager may also provide skilled nursing care including skilled assessment and interventions in the home under a plan of treatment. Essential Duties & Responsibilities Include:Evaluates patient care needs on admission and on an on-going basis.Plans, coordinates and implements skilled care according to established nursing standards and makes revisions as required, under the physician’s plan of treatment.Instructs and counsels patient and family regarding nursing needs and community resources.Notifies physician and other appropriate Agency personnel of changes in the patient's condition.Instructs and supervises nursing personnel regarding the needs of the home care patient.Education/Experience:One year experience as a professional nurse in the past three years or; Bachelor’s degree in Nursing from an accredited School of Nursing.Experience in home health setting preferred.Certificates, Licenses, Registrations:Current license as a registered professional nurse in the State of California.Current California Driver’s License and automobile insurance that meets State of California requirements, if driving a car."}