{"jobID": "2730089698", "jobLocation": "New_York_NY", "jobTitle": "Regional Medical Director", "companyRating": "3.6", "companyInfo": {"Website": "www.horizonpharma.com", "Headquarters": "Lake Forest, IL", "Size": "501 to 1000 employees", "Founded": " 2008", "Type": " Company - Public (HZNP) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Abbott Labs, Pfizer, POZEN"}, "estimatedSalary": "261000", "jobDescription": "Working at Horizon Pharma is more than a job – it’s personal. We define success by a different set of numbers: the number of lives touched, the number of lives changed, the number of lives saved. We’re a team of agile, out-of-the-box thinkers who are inspired to do more because we know we’re a part of something bigger. We strive to build meaningful careers at a company whose values we share because when we live up to our potential, we help patients live up to theirs. Responsibilities:Network and partner with important external customers, including medical thought leaders, academic institutions, large group practices, medical directors, managed care decision makers, and pharmacy directors is required. Must prioritize and work effectively in a self-directed manner in a constantly changing environment. Must be able to gain, integrate, and communicate customer feedback so that effective solutions can be arrived at quicklyPairing customers’ unmet needs with available internal resources will be a key success factor for this position. The RMD must be a strong team player who can effectively interface cross-functionally within Horizon.Knowledge of and responsibility for collaboration within all functional areas across the Company is requiredMust demonstrate a working knowledge of health and pharmacoeconomic outcomes research, Medical Information, Research Grant Processes, Continuing Education, and Regulatory/Compliance issues as they relate to the effective dissemination of scientific informationCollaborate with Managed Markets team, to identify opportunities and needs that can be addressed via communication of scientific, medical, and health economic informationAdd value to Horizon-sponsored external speaker programs via identification of potential new speakers and training on scientific contentDesign, develop, and implement educational events to build product awareness and advocacy and to support and facilitate medical communications and publications (e.g. abstracts, case studies/series, review articles, etc.)Organize clinical advisory boards and other scientific meetings with academic investigators, explore potential new indications, and procure input on the overall clinical development plan at the request of Clinical and Medical AffairsParticipate in international, national, and regional conferences, meetings, and other scientific venues as appropriate with Horizon Medical/Clinical strategyWorking in conjunction with the medical affairs and clinical development teams, evaluate potential external clinical research collaboration opportunities and facilitate the conduct of all external clinical investigator-sponsored trials (ISTs) and phase 4 trialsMonitor the competitive environment for advances and trends in our therapeutic areas, including new treatment management and new therapies, as well as competitive products and features and provide feedback to the senior leadership team on specific initiatives of competitorsAssure appropriate deployment of field resources and that they are compliant with Horizon legal and all applicable regulatory guidelines to ensure medical and scientific accuracy and fair balanceQualifications and Skills Required:Advanced scientific or clinical degree (MD, PhD, or Pharm D) required.Minimum of 3-5 years clinical experience with a strong current working knowledge of the healthcare and pharmaceutical environment is requiredKnowledge of and experience with nephrology preferred, but not required; rare disease experience preferred, but not requiredAt least 5 years previous pharmaceutical industry experience as an MSL or other Medical/Clinical Affairs role is requiredKnowledge of treatment guidelines, clinical research processes, FDA regulations, OIG guidelines and research or clinical experience in the management of pain and/or rheumatic disease is desiredDemonstrated ability, or potential, to excel in smaller entrepreneurial organizationsExceptional oral and written communication and interpersonal skills (including strong demonstration of ability to network)Ability to understand, integrate and effectively communicate scientific/medical and commercial value of Horizon’s products to the medical community and other key internal and external audiencesKnowledge and understanding of managed care distribution channel.Knowledge and understanding of clinical and regulatory guidelinesKnowledge and understanding of compliance in commercial settingsAbility to travel up to 60% for territory management, attend regional and international conferences/workshops to obtain new competitive information, keep abreast of clinical trends, and support and maintain relationships with key investigators and scientific researchAbility to respond appropriately to needs of key stakeholders and manage expectationsDemonstrated excellent project management skills and follow through.Must have excellent PC skills and be familiar with current clinical software and database toolsAssure appropriate deployment of field resources and that they are compliant with Horizon legal and all applicable regulatory guidelines to ensure medical and scientific accuracy and fair balanceEssential Core Competencies:Flexibility/AdaptabilityPlanning and OrganizationTechnical/Scientific KnowledgeBusiness AcumenCommunication Skills(Oral and Written)Horizon Pharma plc does not discriminate on the basis of race, color, religion, gender, sexual orientation, national origin, age, disability, veteran status, or any other characteristic protected by law. It is our intention that all qualified applications are given equal opportunity and that selection decisions be based on job-related factors. Any individual, who, because of a disability, needs accommodation or assistance in completing this application or at any time during the application process, should contact the Human Resources Department."}