{"jobID": "2709665891", "jobLocation": "New_York_NY", "jobTitle": "Learning and Capacity-Building Intern", "companyRating": "3.3", "companyInfo": {"Website": "www.wcs.org", "Headquarters": "Bronx, NY", "Size": "1001 to 5000 employees", "Founded": " 1895", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "45000", "jobDescription": "Job Title Learning and Capacity-Building Intern Location Bronx Zoo Job Type Interns Department HUMAN RESOURCES Job DescriptionWCS stands for wildlife and wild places. As the world’s premier wildlife conservation organization, WCS has a long track record of achieving innovative, impactful results at scale. We build on a unique foundation: Our reach is global; we discover through best-in-class science; we protect through work on the ground with local and indigenous people; we inspire through our world-class zoos, aquarium, and education programs; and we leverage our resources through partnerships and powerful policy influence.  Interns in our Learning and Capacity-Building team learn about the implementation and expansion of a global learning and talent management strategy. Through meaningful assignments in a collaborative environment and under the guidance and direction of Learning and Capacity-Building team members, interns will develop marketable skills relevant to a career in learning and development, talent management, or human resources.  This is an unpaid internship for academic credit. Internship openings are available in the fall (September – December), winter/spring (January – April/May), and summer (May/June – August) semesters. Applications will be considered on a rolling basis. Please indicate in your cover letter which semester(s) you are applying for.  Intern projects include but are not limited to:  •Supporting leadership development programs by preparing and collating materials, assisting with room setup, and compiling data from self-assessment forms collected in class  •Compiling and analyzing workforce demographic data, employee survey results, learning metrics, and performance management data  •Researching best practices in learning and development or talent management  •Preparing summary reports in Microsoft PowerPoint or Word to summarize data analysis or research  •Participating in group discussions, utilizing knowledge from coursework  •Documenting the notes and action items from meetings to capture and improve the implementation and expansion of our learning and capacity-building strategy  •Completing any ad hoc projects, as requested  Interns will complete an orientation program, shadow members of the Talent Management team, and receive regular feedback and coaching. Interns will be expected to summarize the learning gained during the internship as well as complete any other paperwork that may be required to obtain academic credit.  Former interns who successfully completed this internship have moved onto positions in various organizations, including but not limited to: Wildlife Conservation Society, PepsiCo, Danone North America, Achillion Pharmaceuticals, Inc., United Nations, and TransPerfect. Qualification Requirements Working towards a Master’s Degree in I/O Psychology, Human Resources Management, or a related fieldSolid Microsoft Outlook, Word, Excel, and PowerPoint skillsStrong teamwork and collaboration skillsUnderstanding of data analysis & interpretationInterest in talent management, learning and development, leadership development, and/or human resources"}