{"jobID": "2802120390", "jobLocation": "Los_Angeles_CA", "jobTitle": "CAD Drafter & CNC Programmer Intern with Versa Products inc", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The position listed below is not with LA Interviews but with Versa Products inc  LA Interviews is a private organization that works in collaboration with government agencies to promote emerging careers. Our goal is to connect you with supportive resources to supplement your skills in order to attain your dream career. Job Description CAD Drafter CNC programmer intern job description  Versa Products Inc. is a leader in niche durable goods for consumers with business revenue growth of 30% to 40% year after year!  Would you like to be a part of a High-Quality manufacturer of various American Made furniture such as computer tables, desks, adjustable beds, lighted mirrors, and a variety of other furniture made solely in the United States? If you answered yes, then we have a perfect career for you!  At Versa Products, Inc. our goal is to offer high-quality tables and computer furniture at outstanding prices, without compromising excellent customer service. Located in Los Angeles, our Avalon Blvd. office complex houses administrative offices, a 60,000 sq. ft. factory, storage warehouse, and a state-of-the-art packaging and shipping facility. We manufacture furniture for classrooms, medical environments, and offices. Our clients include top universities, military bases, hospitals, hotel chains, and movie studios. As we continue to expand, we are always looking for smart, efficient, goal-oriented people to join our team.  What’s in it for you?  · Work for a leader in their industry  · Excellent compensation package with benefits  · Career growth opportunity Responsibilities: · Take part in prototyping and designing new products by helping R D engineers in drafting technical drawings and programming machinery.  · Take part in engineering manufacturing meetings to present progress report of the tasks.  · Create or update bill of material (BOM), technical drawing packet, machinery program bank, assembly instructions user manual for current or upcoming products.  · Help manufacturing department with verifying and updating technical drawings and machinery programs.  · Be able to create CAD and technical drawings of sheet metal parts and complex assemblies with minimal supervision.  · Effectively keep the flow of released products from R D engineers to manufacturing department to minimize the implementation time.  · Effectively communicate between engineering, manufacturing, graphics design and marketing department to effectively improve and update assembly instructions and user manuals.  · Report timely project status updates and feedback to leaders and stakeholders.  Create Standard Operating Procedures and maintain the SOP database.  Maintain and update revision history and BOMs for current and upcoming products.  Maintain and update engineering database for current and upcoming products. Requirements: Over 1 year of experience in Solidworks AutoCAD is a must.  Experience with CNC machinery, Laser cutters, wood routers sheet metal panel benders is a plus.  Experience with sheet metal press break is a plus.  Deep understanding of reading and drafting mechanical drawings  Familiarity with conventional shop talk  Applicant must have obtained the high school diploma or GED. Studying towards Mechanical engineering, Manufacturing engineering Bachelor’s degree or similar disciplines is a plus.  Skilled at Microsoft Excel Word.  Familiar with google cloud based tools such as Google Forms, Sheets and Docs.  Understanding of mechanics and operations of automated fabrication machinery.  · Being self-driven, motivated and ambitious is a must.  Applicant will be subject to drug screening and background check.  Applicant must be authorized to legally work in the U.S. . Benefits: · Paid Vacation Sick Days  · Retirement Savings- 401 (K)  · Medical Health Insurance  · Tuition assistance program  · Flexible work hours in several departments  · Paid Holidays  · Product discounts for employees  · Casual Fridays—oh wait… every day is casual Friday  · Flexible Spending Account (FSA)  · Employee Assistance Program (EAP)  · Weekly Pay with Direct Deposit available!  · Professional assistance program to reimburse job related seminar attendance fees  · Recruitment and referral Bonuses  Salary - Depends on Experience  Company DescriptionVersa Products has a family of brands that designs and manufactures high-quality consumer goods which are sold both online and in brick-and-mortar stores. We have seen great success with our tried-and-true products such as the Zero Gravity Tables sit-stand desks and Vanity Girl Hollywood makeup mirrors. 2018 is an exciting year for Versa Products because we will be expanding and rebranding several of our brands, and even launching a new one.  Apply"}