{"jobID": "1413893697", "jobLocation": "Cupertino_CA", "jobTitle": "IT/Cloud/DC Solution Sales Architect", "companyRating": null, "companyInfo": {"Website": "www.huawei.com", "Headquarters": "Shenzhen, China", "Size": "10000+ employees", "Founded": " 1987", "Type": " Company - Private", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " Ericsson-Worldwide, Cisco Systems, Apple"}, "estimatedSalary": null, "jobDescription": "Huawei is a leading global information and communications technology (ICT) solutions provider. Through our dedication to customer-centric innovation and strong partnerships, we have established end-to-end advantages in telecom networks, devices and cloud computing. We are committed to creating maximum value for telecom operators, enterprises and consumers by providing competitive solutions and services. Our products and solutions have been deployed in over 170 countries, serving more than one third of the world’s population. Huawei has over 150,000 employees, approximately 70,000 of which are engaged in Research & development. Huawei operates a global network of 14 regional headquarters, 16 R&D; Centers, 28 Innovation Centers jointly operated with customers, and 45 Training Centers. Huawei is leading the way by rethinking the future. From devices to telecom infrastructure to cloud computing and convergence solutions, we are rethinking every link in the chain with ICT based innovation to deliver a better future...faster. IT/Cloud/DC Solution Sales Architect Location: Cupertino, CA (Enterprise) Req #: 5962 # of Openings: 1 Description Responsibilities  Key job responsibilities include supporting mid-size to large IT/ Cloud and Data Center related projects and engaging with customers by sharing the company solutions, strategy and future directions. The job requires interactive engagement and partnering with customers, understanding their requirements, offering optimum solutions, providing detailed product presentations to mid-level to upper management. The candidate should have excellent communication and presentation skill. The other job responsibilities include supporting customer targeted technology events, preparing technical solutions, and traveling to customer locations and regional Huawei offices supporting the account teams. The role may involve interfacing with the engineering teams to develop and present proof of concept solutions demonstrations. The job requires at least 35% percent travel and should be open to short notice unplanned travels.  For this role, we expect the candidate to have deep understanding of data center architectures both legacy and evolving SDN based multi-tenant data center architectures, extensive exposure to Data Center design and architectures for not only tier 1 operators but large and medium size cloud services providers. Other expectations to the selected candidates: Brand ambassador evangelizing Huawei IT vision and articulating the advantages of Huawei IT/Cloud/Data Center solutions and services.  Support Huawei IT/Cloud/Data Center Marketing and Branding activities (CXO visits, seminars, workshops, and forums), promote the Huawei ICT brand and develop new opportunities.  Maintain relationships with top industry analysts and journalists such as Gartner, IDC, 451, OVUM, Infonetics, Lightreading and etc.  Acquire customer, market and competitive information on daily basis in order to influence R&D;/HQ in China to make the right and timely decisions for product and solution planning. Required areas of expertise include Enterprise IT, Telecom IT, Cloud (private, public and hybrid), Virtualization, Orchestration, and Management in compute, storage, network; software defined data center/storage/network, SDN, NFV, Big Data and etc. Qualifications More than 10 years of direct Product Management/Sales Support/Sales Engagement/Sales Engineering experience in the ICT Transformation and Cloud Monetization with a proven track record within a well-known international vendor or Tier 1 operator. Comprehensive experiences with infrastructure built on Cloud and Virtualization technologies such as OpenStack, KVM, Xen, AWS, MySQL, MongoDB, SDN, NFV, Private cloud, Public Cloud, Hybrid Cloud, Cloud Management, Cloud Broker, Big Data and etc.  Solid understanding of compute, storage, and data center networking technologies and emerging trends in cloud computing, storage and networking. Deep understanding on the main IP/MPLS protocols.  Software development experience with common Web platform / language technologies such as HTTP, REST, SOAP, XML, OOP, Java, OSGI Ruby, Python, AJAX, PHP, XMPP, C/C++.  Experience architecting cloud infrastructures for web-based applications and/or web services-based applications.  Familiar with IT-related standards, with experience in IETF, ETSI and OpenStack standards activity and so on.  Quick learner and self-starter, with a willingness to dive in and learn everything required to be successful on the job.  Willingness to take ownership of customer solutions and make them successful.  Must have a strong focus on customer satisfaction.  Must have the ability to see and explain the big picture or direction of a project, as well as the ability to drill down to details depending on the audience.  Excellent interpersonal and communication skills (written and speaking) and ability to work independently.  Experience in working with various regional sales teams. Must be able to adapt to various regional’s business culture easily.  Experience in working with Chinese/Asian corporate culture is not mandatory but preferred.  Must be a team player.  MS degree in Engineering or Computer Science is highly desiredHuawei Inc. is proud to be an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Why work for us?In 2015, Huawei's revenue reached CNY395 billion (US$60.8 billion based on the year-end exchange rate), an increase of 37% (YOY)We invest in engineering and innovation - 70,000+ of our 150,000+ global employees work in R&D;Globally ranked #1 for International Patent SubmissionsWe continually invest heavily in global community involvement programsWe support green energy - Lowered CO2 emissions by 13,000 tons via Huawei’s green packaging solutionsEngaged in over 100 research projects with 50+ Universities in the United States Are you a returning applicant?Previous Applicants:Email:Password: If you do not remember your password click here. Back to Search Results New SearchCopyright © Huawei Technologies Co., Ltd. 1998-2017. All rights reserved."}