{"jobID": "2736019198", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Manager, Enterprise Applications - BI & Data Analystics", "companyRating": null, "companyInfo": {"Website": "www.axiomlaw.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Axiom, a pioneer in the legal industry and a leading, global provider of technology-enabled legal solutions, is seeking a Senior Manager of Enterprise Applications to join our team in San Francisco. Axiom Axiom, a recognized leader in the business of law, is a new category of professional services firm and the world's largest provider of tech-enabled legal, contracts, and compliance solutions for large enterprises. Axiom is pioneering change, innovation, and value in one of the world’s largest economies that has not yet fully yielded to innovation and modernization. The Financial Times ranked Axiom #1 in business of law, #1 in innovation in corporate strategy and #1 in innovation in law firm efficiency, while The New York Times said Axiom is “rewriting the law firm business model.” We’re comprised of over 2,000 passionate Axiomites who serve over half the Fortune 100 across 17 offices globally (…and growing!). The Role As a senior member of our Enterprise Applications Team, you will be responsible for defining and overseeing the multi-year data strategy and roadmap to build, establish and mature Axiom’s enterprise-wide data management, governance, and BI/analytics reporting program.  If you believe in being a team player, can collaborate and communicate well with technical and non-technical audiences while bringing a result-driven, focused, high energy, confident, curious, quirky, and most of all fun sense of self, then this is the place for you.  Specifically, this role will: Lead efforts to define and oversee a multi-year technology roadmap to create the long-term technology infrastructure and data platform to deliver BI and analytics capabilities.Provide technical leadership, operational analysis, design, and consultation in areas of enterprise data architecture, data management, and analytics on the EDW and BI Analytics reporting initiative.Play a key role on system and technology decisions in shaping Axiom’s data technology stack and visualization toolset.Partner with business functions to define, design and implement best practices/processes for data governance and management including developing change management processes for new data elements, changing existing data mappings, updating reports, archiving and storage.Maintain all data related relationships; internally with key business partners including but not limited to IT, Finance and Sales Operations and externally with 3rd party data providers.Partner with business functions to identify and execute on data projects to continuously drive Axiom’s data capabilities, inclusive of defining goals & requirements, managing project timelines, budgeting, assigning & allocating resources, coordinating third-parties, managing risks, contingency planning, and communication of status.Initially a hands-on role with opportunity to build own data team to support and drive adoption of data technologies across the company.Own, maintain and support the company’s existing (data marts) and new data solutions ensuring compliance with agreed upon SLAs.Successful Candidates Successful candidates must be fits for Axiom’s unique operating environment and culture: high-growth, innovative, lean, and values-driven. As such, successful candidates must be highly capable in each of the following dimensions (among others): adaptability, curiosity, resourcefulness, analytical thinking/problem solving, proactivity, collaboration, technological savvy, and operating with/through a lean team (for people leaders: must be comfortable in a player/coach role.)  Beyond these characteristics, here are the required skills, knowledge, capabilities, and education for this particular role: Bachelor’s degree from four-year college or university with a minimum of ten years of related post-graduate work experience in designing, implementing and supporting enterprise data warehouse and BI/data analytics reporting solutions.Familiarity with domestic and foreign privacy laws (GDPR, HIPAA) and data security best practices.Experience with modern data programming language - using it to manipulate and load data (Python) into applications & extracting from applications (Salesforce, Workday and NetSuite OpenAir).Experience with at least one leading BI/Reporting platform (Tableau, Domo).Solid knowledge of SQL (Structured Query Language), RDBMS (MS SQL, PostgreSQL, Oracle), database technologies (relational, NoSQL) and data storage capabilities and applications.Knowledge of, or experience using Amazon Web Services.Solid hands on experience in building & operating real-time and batch data pipelines and APIs. Experience with Dell Boomi or Informatica a plus.Ability to succeed in fast paced environments at a high-growth company; comfortable with tight timelines; possessing a sense of urgency.Ability to find creative solutions to problems combined with a willingness to do what one must to ensure timelines & goals are met.Ability to work as a member of a team, lead specialists, manage all aspects of projects, and provide consultancy & support to business customers.Decisiveness, good judgement, strong organization skills, project management skills, strong technical knowledge, excellent oral and written communication skills, and strong interpersonal communication skills.Ability to quickly learn new technologies and keep abreast of the latest technological advances.Exhibits Axiom’s core values:Irresistible, Fresh, Committed & Thoughtful.Legally eligible to work in the country in which the position is located.Additional Information Axiom is an equal opportunity employer and committed to a diverse workforce. Accommodation for Individuals with Disabilities: Upon request and consistent with applicable laws, Axiom will attempt to provide reasonable accommodations for individuals with disabilities who require an accommodation to participate in the application process. To request an accommodation to complete the application form, please contact us at benefits@axiomlaw.com and include “Applicant Accommodation” in the subject line."}