{"jobID": "2830878603", "jobLocation": "Jersey_City_NJ", "jobTitle": "Product Manager - Model Market Center", "companyRating": "3.6", "companyInfo": {"Website": "www.tdameritrade.com", "Headquarters": "Omaha, NE", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (AMTD) ", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Fidelity Investments, E*TRADE Financial, Charles Schwab"}, "estimatedSalary": "112000", "jobDescription": "The Model Market Center Product Leads primary function is to ensure project deliverables are being met for the launch and ongoing success of the Model Market Center. This person should be an investigative problem solver driven by the desire to understand how things work, and how to creatively get around obstacles. This person should be able to act as the product owner within an agile development team. This person will also identify and implement roles and responsibilities for product functions such as billing, compliance review, advisor and manager onboarding, and vendor integration.  The person should be analytically minded with strong business model/product experience. This individual is highly inquisitive, analytical, and uses these skills to learn and/or pivot rapidly throughout the product build and launch. The Model Market Center Product Lead possesses a roll-up-your sleeves mentality and will be able to temporarily own processes when needed while the product is in its infancy. Make sure internal development team and requirements are in line with product vision.Help review and secure vendor partners for functions like Risk Analytics. Able to help launch vendor integrations by identifying and communicating requirements, reviewing commercial agreements, partnering to create education materials.Create and execute plans to drive product adoption by working with sales, marketing, and education.Implement roles and responsibilities for cross functional teams. Test processes and technology.4 Year College Degree in Sales/Marketing/Business or equivalent experience required5+ years of experienceRIA industry experience highly preferredInvestment operations experience preferredStrong presentation skillsStrong written and verbal communication skillsExcellent organization and customer service skillsHigh level of analytical and problem solving skillsGeneral understanding of financial concepts, asset allocation and portfolio managementAbility to coordinate and translate effectively between business and technologySeries 7 preferredMilitary education or experience may be considered in lieu of civilian requirements listed"}