{"jobID": "2535244912", "jobLocation": "New_York_NY", "jobTitle": "Machine Learning Researcher - Intern", "companyRating": "3.5", "companyInfo": {"Website": "www.point72.com", "Headquarters": "Stamford, CT", "Size": "1001 to 5000 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "89000", "jobDescription": " About Cubist  Cubist Systematic Strategies is one of the world’s premier investment firms. The firm deploys systematic, computer-driven trading strategies across multiple liquid asset classes, including equities, futures and foreign exchange. The core of our effort is rigorous research into a wide range of market anomalies, fueled by our unparalleled access to a wide range of publicly available data sources. Job Description Researchers are responsible for applying, adapting, and extending existing results in the broad field of machine learning, while also conducting novel research as required. We are interested in all aspects of ML including: predictive modelling, clustering, time series analysis, natural language processing, and computer vision. Successful researchers manage all aspects of the research process including methodology selection, data collection and analysis, implementation and testing, prototyping, and performance evaluation.  Some successful researchers have joined us from similar backgrounds at other firms. Others have joined from related fields or directly from academia and have thrived with hands on guidance from our large team of experienced portfolio managers and researchers. Our most exceptional team members combine strong technical skills and a passion for problem solving with an intense curiosity about financial markets and human behavior.  Desirable Candidates Students enrolled in a PhD program in machine learning, computer science, statistics, or a related field.Superb analytical and quantitative skills, along with a healthy streak of creativity.Demonstrated ability to conduct independent research utilizing large data sets.Passion for seeing research through from initial conception to eventual application.Curiosity about financial marketsStrong scientific programming in Python, R or Matlab.Empirical, detail-oriented mindset.Sense of ownership of his/her work, working well both independently and within a small collaborative team."}