{"jobID": "2794756580", "jobLocation": "San_Francisco_CA", "jobTitle": "Project Manager-Interiors", "companyRating": "4.2", "companyInfo": {"Website": "www.webcor.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 1971", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Pankow Builders, Hathaway Dinwiddie Construction"}, "estimatedSalary": "108000", "jobDescription": " Project Manager-Interiors Location  CA-San Francisco Department  190-No CA Construction (Core & Shell) Employment Duration  Full timeApply NowWho We Are: Webcor employs people of integrity and passion to build diverse, high-profile, and innovative structures for our clients. Webcor was founded in San Francisco in 1971. We are still headquartered in San Francisco and are committed to growing throughout California (and beyond). Through career development and employee-specific rotation plans, we foster collaboration across our construction management divisions (Core & Shell and Special Projects) and self-perform groups (Concrete, Interior Construction Group, and Paramount Drywall). We provide craft professionals, experienced professionals, and new graduates with financial, health, and wellness benefits that encourage and reward individual contribution. Why Join Us?We love to build for both public and private owners. We don’t shy away from what we have never done before.We are deeply connected to continuous improvement. We welcome better ways of doing things.The U.S. GREEN BUILDING COUNCIL has recognized us with multiple LEED PLATINUM awards for our commitment to sustainable design, communities, and construction.Career tracks are clear and we encourage employee mobility and development.We pay an average of over 85% of the cost of medical benefits for employees and their families. We cover the total cost of dental, vision, life, and disability insurance. We offer a generous 401(k) match. And we offer a range of other benefits, from a wellness program to legal assistance.What You’ll Do: People don’t want bureaucratic processes slowing or preventing them from building innovative structures. At Webcor, we get things done and make projects happen.  As a Project Manager, you will oversee every aspect of a building project. You will: Manage and publish the project schedule on a regular basis.Control the budget associated with the project and negotiate best pricing.Write and distribute bid packages that clearly define the scope and general provisions.Negotiate contracts and subcontracts as needed.Mitigate risk on behalf of Webcor.Focus on continuous improvement and innovation in all you do.What You Need to Succeed:A Bachelor’s degree (preferably in Construction Management, Civil or Mechanical Engineering, or Architecture) or equivalent experience.Five-plus years managing complex projects. Prior experience managing construction projects is strongly preferred. Prior experience with building interiors required.Advanced knowledge of MS office, Adobe, and Visio.Comprehensive knowledge of cost control, budgeting, contracts, billing, and forecasting.LEED AP is preferred but not required.You love communicating! You are also a born leader and enjoy using creativity to solve problems.You are authentic and are known for going above and beyond what is asked of you. Webcor is AN EQUAL OPPORTUNITY EMPLOYER."}