{"jobID": "2796119022", "jobLocation": "Redwood_City_CA", "jobTitle": "Fall Intern: Dynamic Messaging - Player Pathing Analyst (MBA/MS)", "companyRating": null, "companyInfo": {"Website": "www.ea.com", "Headquarters": "Redwood City, CA", "Size": "5001 to 10000 employees", "Founded": " 1982", "Type": " Company - Public (EA) ", "Industry": " Media", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Riot Games, Google, Activision Blizzard"}, "estimatedSalary": null, "jobDescription": " EA is looking for an MBA or MS Student to help design and optimize enterprise-level solutions designed around automating customized player journeys.  This fall internship will be part of the Dynamic Omnichannel Messaging (DOM) team, a centralized, always-on, automated messaging program that drives acquisition, engagement and retention across EAs portfolio of games and destinations. This role will primarily drive projects to improve the efficiency at which content creation teams react to the changing needs of players over time.  One of the Dynamic Messaging teams key principles is to deliver world-class content experiences for EA players. The Player Pathing Analyst will help build out the practice of how reporting and analysis of EA games is translated into optimizations by content creation teams in order to tie together a tight bond between game and marketing experience. Summary The Dynamic Messaging teams primary goal is to motivate players to engage with EA games by delivering content against key moments in the players journey. The team focuses on leveraging behavioral and transactional data, as well as automation tools to deliver personalized messages, at scale. The team strategically delivers enterprise-wide solutions that allow for cross-channel marketing automation and power new digital business models. Responsibilities of this role include:Content impact analysis and optimizationPlayer-first strategies: partner with EAs cross-functional disciplines (global communications, brand marketing, marketing analytics & consumer insights, and publishing) to develop global player pathing strategies that anticipate players behaviors, use business rules and algorithmic programming to deliver highly relevant communications and reduce friction around gameplay.Work closely with data scientists to uncover insights as to how our players move through the EA eco-system in order to build and optimize our algorithmic strategic approach to content distribution.Data organization and manipulationProcess and resource auditingTaxonomy and metadata hygieneStrategic thinker, with the ability to clearly articulate, document and present vision to senior cross-functional leaders.Desired Skills and ExperienceGraduate student currently enrolled in an analytics-focused MBA program or MS programKnowledge and experience with CRM, marketing data, and marketing technology, a plusHigh level proficiency in data analysis and critical thinkingExperience with data analysis programing languages (e.g. R, Python)Excellent organizational, written, and verbal communication skillsComfortable in a fast-paced, dynamic, and deadline-oriented environment Success Measurement"}