{"jobID": "2825090726", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Senior Business Data Analyst", "companyRating": "4.4", "companyInfo": {"Website": "www.sap.com", "Headquarters": "Walldorf, Germany", "Size": "10000+ employees", "Founded": " 1972", "Type": " Company - Public (SAP) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Salesforce, Oracle, Microsoft"}, "estimatedSalary": "138000", "jobDescription": "Requisition ID: 188487 Work Area: Software-Design and Development Expected Travel: 0 - 10% Career Status: Professional Employment Type: Regular Full Time    COMPANY DESCRIPTION SAP started in 1972 as a team of five colleagues with a desire to do something new. Together, they changed enterprise software and reinvented how business was done. Today, as a market leader in enterprise application software, we remain true to our roots. That’s why we engineer solutions to fuel innovation, foster equality and spread opportunity for our employees and customers across borders and cultures.  SAP values the entrepreneurial spirit, fostering creativity and building lasting relationships with our employees. We know that a diverse and inclusive workforce keeps us competitive and provides opportunities for all. We believe that together we can transform industries, grow economics, lift up societies and sustain our environment. Because it’s the best-run businesses that make the world run better and improve people’s lives.    ROLE DESCRIPTION We are looking for a Product Manager/Business Analyst who can dramatically increase our insight into how customers implement and use our HR products. This is a hands-on role defining data requirements, working with development teams to implement, create and share the insight from the data and help drive action based on that insight. EXPECTATIONS AND TASKSWork closely with Product Management, Operations, and Development teams to define and implement data strategies to create insight into how our customers implement and use our products.Retrieve, manipulate and analyze data from various sources to draw relevant and actionable conclusionsContribute to the design, development, and maintenance of KPIs, reoccurring reports and dashboards to ensure high-level visibility of company performance and planningEnsure data accuracy by validating data, identify any missing data and work with engineering to start capturing the right data for analysisGather requirements from customers, prospects, engineers, sales, other product managers, and professional services consultants, and write detailed product specifications for the engineering teamPerform competitive analysis in determining and prioritizing feature requirements for existing and new productsSupport internal teams (Finance, Sales, Product, Engineering, Operations, Marketing and Customer Success) with data-driven analysis to drive key business initiatives and decisionsEDUCATION AND QUALIFICATIONS/SKILLS AND COMPETENCIESStrong execution orientation – you get stuff done • Passion for business problems and use of data to help solve those problemsStrong verbal/written communication and data presentation skills to effectively prepare and present reports, forecasts, trends and actionable insights to executive, business and technical teamsExperience working with engineers to define software productsExcellent presentation, oral, and written communication skills. Data visualization expertise a plus.Excellent quantitative analysis skills to take data as input and output actionable recommendations.Experience transforming vague business problems into data-driven questions, identifying and retrieving the relevant data set using multiple data sourcesExcellent data acquisition and manipulation skills (ability to write SQL, process data in R or Python, data warehousing, Excel)Experience with Software-as-a-Service or Cloud delivery model. • Ability to multi-task and work in a fast-paced environment.Detail-oriented self-starter with experience working on multiple projects in parallel, excellent followthrough, and the ability to solve unstructured problems5+ years’ experience as a business analyst or equivalent roleDESIREABLE SKILLS AND EXPERIENCEMBA or a Technical undergraduate degreeExperience with enterprise software such as HR/HCM processes or applications including HRIS, Goals and Performance Management, Succession, or other business applications such as CRM, ERP, or financial systemsExperience managing or marketing developer-facing products      WHAT YOU GET FROM US Success is what you make it. At SAP, we help you make it your own.  A career at SAP can open many doors for you. If you’re searching for a company that’s dedicated to your ideas and individual growth, recognizes you for your unique contributions, fills you with a strong sense of purpose, and provides a fun, flexible and inclusive work environment – apply now. SAP'S DIVERSITY COMMITMENT To harness the power of innovation, SAP invests in the development of its diverse employees. We aspire to leverage the qualities and appreciate the unique competencies that each person brings to the company.  SAP is committed to the principles of Equal Employment Opportunity and to providing reasonable accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team. (Americas:Careers.NorthAmerica@sap.com or Careers.LatinAmerica@sap.com, APJ: Careers.APJ@sap.com, EMEA: Careers@sap.com). Requests for reasonable accommodation will be considered on a case-by-case basis. Successful candidates might be required to undergo a background verification with an external vendor. EOE AA M/F/Vet/Disability: Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, gender, sexual orientation, gender identity, protected veteran status or disability.  Successful candidates might be required to undergo a background verification with an external vendor. Additional Locations:"}