{"jobID": "2747503460", "jobLocation": "New_York_NY", "jobTitle": "Account Executive - Northeast Territory", "companyRating": null, "companyInfo": {"Website": "www.eccoviasolutions.com", "Headquarters": "Salt Lake City, UT", "Size": "51 to 200 employees", "Founded": " 1983", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Mediware, Netsmart, ACT.md"}, "estimatedSalary": null, "jobDescription": " The Account Executive is responsible for managing the entire sales process from prospecting to close. They will consult with key decision makers to understand their critical business issues and strategic objectives, drive business results, and provide clients with a high return on their investment. They are an essential part of the marketing and sales team and main focus is on turning leads into quality opportunities. Essential FunctionsDevelop and enhance the opportunity funnel and bring new deals to closure exceeding forecast accuracy goals. Contribution to the team effort by accomplishing related results as needed in a defined region.Help build our business as a result of your considerable relationship-building and business skills.Manage existing accounts in a specific region.Call on and meet Executive Directors, Program Mangers, and Directors of IT on a daily basis.Identify and sponsor Proposal Opportunities (RFPs).Channel partner management within the Region.Manage incoming marketing leads.Maintain the company?s contact database management with up-to-date contact and accurate forecast details.ResponsibilitiesDevelop and enhance the opportunity funnel and bring new deals to closure exceeding forecast accuracy goals. Contribution to team effort by accomplishing related results as needed in a defined regionHelp build our business as a result of your considerable relationship-building and business skillsManage existing accounts in a specific RegionCall on and meet Executive Directors, Program Managers, and Directors of IT on a daily basisIdentify and sponsor Proposal Opportunities (RFPs)Channel partner management within the RegionManage incoming marketing leadsMaintain the company?s contact database management with up-to-date contact and accurate forecast detailsEducation & Work Experience5+ years of technical or software sales experience with a proven sales track record.Bachelor’s degree in business, marketing or a technical field and/or equivalent work experiencePreferred Education and ExperienceExperience selling into Federal and State government organizations or into Health organizations is a strong plusSuccessful/proven (verifiable) sales track record in software or technologySkills/Qualifications To be immediately and seriously considered for this dynamic sales opportunity, you must have the following: Positive attitude, excellent communication skills – verbal and written, professional appearance, and an energetic sales personality5 years of experience selling software/technology or selling to member-based nonprofits, health organizations, or government agencies. We like both; we want you to like at least one of them too.Self-starting ability is a must.Technical chops are a plus.…Killer software sales skills a must. You don’t have to code, but you need to understand SaaS isn’t an attitudeStrong (and documented) sales track record and exceptional leadership skillsGreat business acumen with ability to travel when requiredWilling to travel on frequent basisAble to work as a team memberHave negotiation skills to deal with different kinds of customersAble to meet deadlines along with working under pressure4-year technical degree would be a plusEffective verbal and written communicationGenerate opportunities and close salesEffective contract negotiations – including pricingMetrics and AccountabilityAccurate and timely forecast reportingAbility to generate opportunities and close salesEffective contract negotiations – including pricingTravel25-35%"}