{"jobID": "2802770791", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Java Software Engineer, Jobs UX", "companyRating": "4.1", "companyInfo": {"Website": "www.glassdoor.com", "Headquarters": "Mill Valley, CA", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Indeed, LinkedIn"}, "estimatedSalary": "137000", "jobDescription": " Our mission is to help people everywhere find a job, and a company they love. We are disrupting an industry by changing how people search for jobs and how companies recruit top talent.  As a Senior Java Software Engineer, you will part of our jobs search user experience team. Scaling to our growing user base and building high-performance tiers to drive all jobs search features on web and mobile will be few of the challenges for you to work through. As a Glassdoor engineer of a cross-functional agile team, you will have continued opportunity to learn and grow.  As a fast-growing late startup, we look for self-starters who thrive in a fast-paced, agile environment– which means wearing many hats, being able to change direction quickly, and showing an eagerness to learn new technologies as the need arises.  Skills and Requirements: 5+ years of software development experience on large scale, high-volume sitesStrong understanding of Java multithreading, concurrency, and memory managementExperience working with Spring, Hibernate, and SQL technologiesExperience building service-oriented solutions and RESTful microservicesExperience with writing both unit tests and integration testsExperience working with NoSQL technologies such as Redis, Riak, Cassandra a big plusExperience with Cloud Services such as Amazon AWS, Rackspace a plusFamiliarity with basic front-end technologies such as JSP, HTML, Javascript a plusWhy Glassdoor?Work with purpose – join us in creating transparency for job seekers everywhereGlassdoor gives back! Glassdoor is a Pledge 1% member; all employees receive 3 paid volunteer days per year100% company paid medical/dental/vision/life coverage, with 80% dependent coverageLong-Term Incentive PlanConveniently located office in the heart of downtown San Francisco (Embarcadero)Fully-stocked break rooms with complimentary food and drinksPaid holidays and flexible paid time offYour choice between Mac or PC Glassdoor is committed to equal treatment and opportunity in all aspects of recruitment, selection, and employment without regard to gender, race, religion, national origin, ethnicity, disability, gender identity/expression, sexual orientation, veteran or military status, or any other category protected under the law. Glassdoor is an equal opportunity employer; committed to a community of inclusion, and an environment free from discrimination, harassment, and retaliation."}