{"jobID": "2559884209", "jobLocation": "New_York_NY", "jobTitle": "Part-Time Online ESL teacher for K-12 Students", "companyRating": null, "companyInfo": {"Website": "www.51talk.com/na", "Headquarters": "Beijing, China", "Size": "1001 to 5000 employees", "Founded": " 2011", "Type": " Company - Public (COE) ", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " DaDa, TutorABC, VIPKID"}, "estimatedSalary": null, "jobDescription": "Part-Time Online ESL teacher for K-12 StudentsThe Opportunity Looking for a fun and professional online teaching position with a stable income? Look no further! At 51Talk, we believe that teaching should be as enjoyable as it is rewarding, and by putting you in control of your own virtual classroom, we bring this opportunity right into the comfort of your own home.  We are looking for motivated, go-getter individuals with teaching experience under their belts. As an independent contractor, you’ll teach Chinese children under 12 using 51Talk’s platform and curriculum - no lesson planning required! About 51Talk 51Talk was founded in 2011, and since then has expanded globally. As the first online Chinese education company to go public on the New York Stock Exchange, 51Talk continues to make headlines with its strategic partnerships across the academic world, including: Highlights, Pearson, Cambridge University Press, Oxford University Press, And the American International School of Utah.  Our founder Jack built 51Talk with an inspiring mission: love and empower every child. 51Talk is looking for motivated, engaging teachers to give Chinese children fun and fruitful learning experiences. Together, we will forge a bright future for the next generation of young learners in China. The WorkThe classes: 45-minute full immersion English language group classesThe pay: Base rate of $18 per 45-minute class, plus performance based bonusesThe curriculum: S. Common Core aligned lesson material, built from the ground up by our in-house teamThe timing: Must be available to teach during our peak hoursThe place: Conveniently teach from your own home - no commute!The necessities: All you’ll need is a computer, a strong internet connection, and a noise-cancelling headset - we provide the restThe benefits: You will receive ongoing professional development through our teacher training courses.The culture: You will learn about Chinese culture through classroom exchanges with our students.QualificationsBA degree or higherExperience teaching kids (minimum of 1 year)Experience in the U.S. or Canadian education systemsDesire to engage and inspire young learnersAt least one teaching certificate: state certifications, TESOL, TEFL, etc. (Preferred)ESL experience (Preferred)Position DetailsContract type: Independent contractorStart date: ImmediatelyContract term: 1 yearPayment details: Teachers are paid through their choice of PayPal or bank transfer each month for the previous month’s workSchedule: Lesson times must be during our peak hours on:WeekdaysEST: 6:00 AM - 10:00 AM CST: 5:00 AM - 9:00 AM MST: 4:00 AM - 8:00 AM PST: 3:00 AM - 7:00 AM Hawaii: 1:00 AM - 5:00 AM WeekendsEST: 9:00 PM - 10:00 AM CST: 8:00 PM - 9:00 AM MST: 7:00 PM - 8:00 AM PST: 6:00 PM - 7:00 AM Hawaii: 4:00 PM - 5:00 AM Group Class Training Newly launched teachers will take part in a paid group class training session that will occur over 8 working days (Monday through Friday), from 8:00 PM - 10:00 PM EST. Questions? Reach out to us anytime at teach@51talk.com. Learn About Us From Our TeachersTeacher Kelly Carson: https://youtu.be/wyU6r-14K1g Teacher Catherine Becka: https://youtu.be/TxO02zwL7Ks Teacher Laura: https://youtu.be/2DLKykoLYnA Check us Out on Social MediaFacebook: www.facebook.com/51TalkHelloWorldAA/ YouTube: www.youtube.com/c/51Talkhelloworldaa Twitter: www.twitter.com/51talkhwaa"}