{"jobID": "2643836772", "jobLocation": "Los_Angeles_CA", "jobTitle": "BI Data Analyst Lead", "companyRating": "4.2", "companyInfo": {"Website": "www.cnb.com", "Headquarters": "Los Angeles, CA", "Size": "1001 to 5000 employees", "Founded": " 1954", "Type": " Subsidiary or Business Segment", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " East West Bank, Bank of the West, First Republic Bank"}, "estimatedSalary": "77000", "jobDescription": " The Business Intelligence Lead Data Analyst is responsible for supporting the Business Intelligence team and the business users through the analysis of quantitative & qualitative data by designing database models both logical and physical. The position will perform in-depth data analysis; develop database models, database processes and functional analysis across various lines database methodologies specific to Business Intelligence. This role will provide oversight and on database design decisions, best practices, and processes for a team of data analysts. Work with a team of data analysts on a daily basis to provide input, guidance and oversight over database designs / models / processes.  Skills and Knowledge: Bachelor's degree in Computer Science or related technologies strongly preferred.Prior hands-on experience in using ETL tools, Business Objects or other related BI toolsPrior hands-on experience in using ERWin a plusPrior experience in Financial Services industry a plus.Excellent analytical skillsAble to communicate clearly and professionally with all levels of an organization.Strong interpersonal, written and verbal communication skills with demonstrated ability to work in a team environment.Ability to express complex technical concepts in business terms.Proficient in designing database models (both logical and physical) Basic Qualifications:  *Minimum of 5 years of experience working with Information technologies in a Lead role required. Minimum of 5 years of experience as a Data Analyst, preferably in a data-intensive financial company.Minimum of 5 years of experience in advanced PL/SQL and Oracle queries and analysis.  *Represents basic qualifications for the position. To be considered for this position you must at least meet the basic qualifications.  City National Bank is an Equal Opportunity/Affirmative Action Employer, Minorities/Females/Individuals with Disabilities/Veterans Note: This preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job. Note: Candidates should be advised that City National Bank does not pay interviewee travel expenses or relocation expenses for candidates who are hired unless previously agreed.Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}