{"jobID": "2746288615", "jobLocation": "Cambridge_MA", "jobTitle": "Quantitative Data Analyst (Minerva)", "companyRating": "4.0", "companyInfo": {"Website": "www.cogolabs.com", "Headquarters": "Cambridge, MA", "Size": "51 to 200 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "62000", "jobDescription": "Minerva Analytics is the latest team to be formed inside Cogos proven incubator model. As a Quantitative Data Analyst on the Minerva Analytics team, you'll be starting on the ground floor of Cogos latest team built inside the incubator. The Minerva team is building communities of users on the internet through a combination of rapid-development web property tools, scalable user acquisition, and extensive competitive and performance analysis using Cogos extensive data warehouse.You'll design and implement marketing programs, analyze performance metrics, build and test consumer internet products, and use the insights you gain to drive growth in user engagement and revenue. Your expertise, ideas, and hard work will have a direct and immediate impact on the success of your project.What to expect on the Minerva Analytics team:Independence and autonomy: You worked hard to learn what you know; were not about to stand over your shoulder and watch you work.Flexibility and novelty: Your role will define itself over time, as you learn which problems youre uniquely capable of solving.Unmatched opportunity: We believe in letting people grow as quickly as they can. Todays new-grad hires are tomorrows leaders.A fun, supportive culture: Happy employees are the most successful. We take care of our own, and not just because its good business.What we expect from you:A bachelors degree with a major that required some relatively deep analytical thinking. Using math or other pattern analysis techniques to gain insight into observed behavior or phenomena in your field, and then using that to predict future behavior would definitely qualify as relevant. Use of statistical analysis techniques is a big plus.The flexibility & drive to succeed in a dynamic, entrepreneurial culture.Interest in learning new tools, particularly query, scripting, or programming languages. These tools are all very valuable in building internet scale businesses, and we have lots of smart people whod love to teach you.The ability to gather and present relevant data when pitching an idea for additional investment will make Cogo a fun place to start your career.We rely extensively on each other to develop, focus, and refine ideas for making our businesses better. If you enjoy working in teams and sharing the glory then youre off to a good start.Curiosity and a passion for learning not just at work, but in life. Great ideas come from all over, we want to welcome and get to know the whole you, not just the work part.Prior analytical or statistical experience with web or email traffic is not required but definitely helpful!"}