{"jobID": "2810572303", "jobLocation": "San_Francisco_CA", "jobTitle": "Intern, Web/Mobile Application Development", "companyRating": "3.8", "companyInfo": {"Website": "www.cbrands.com", "Headquarters": "Victor, NY", "Size": "5001 to 10000 employees", "Founded": " 1945", "Type": " Company - Public (STZ) ", "Industry": " Manufacturing", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Diageo, Anheuser-Busch InBev, E. & J. Gallo Winery"}, "estimatedSalary": "98000", "jobDescription": "Job DescriptionPosition SummaryAssist the company to design and enhance our SW in the Mobile ecosystem which enables our salesforce to sell more Beer and Wine using:Advanced searchData science-based product recommendationsCollaboration tools facilitate sales execution and planningMobile apps for in-store executionAs part of the Mobile team, your role will be to help us build out apps/features that will help increase Sales Execution in the field utilizing a DevOps model that uses cloud-based solutions like Heroku and Salesforce.Software development lifecycle following an agile release cadenceEngage with Sales / Designers to help define new product featuresAssist with defining architectural standards and development processesParticipate in ongoing maintenance activities and support Preferred Qualifications Current student in or recent graduate of a computer science, engineering or software development undergraduate or graduate programProgramming skills in Swift, Mobile JS Frameworks like React, XC Suite.Understanding and use of REST services, JSON objects, secure coding concepts and memory management in iOS.Ability to work independently and to exercise strong technical judgmentExperience with or awareness of version control systems (GIT) and continuous integrationInterest in learning new technologies such as AR Kit, Machine Learning, BLEStrong focus on quality and timely workExcellent verbal and written communication skillsExcellent problem solving and trouble-shooting skills Physical Requirements/Work Environment  Must be able to sit and/or stand for long periods of time and work on a computer for extended periods. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  Location  San Francisco, California  Additional Locations  Job Type  Full time  Job Area  Administrative Support  Equal Opportunity  Constellation Brands is committed to a continuing program of equal employment opportunity. All persons have equal employment opportunities with Constellation Brands, regardless of their sex, race, color, age, religion, creed, sexual orientation, national origin or citizenship, ancestry, physical or mental disability, medical condition (cancer or genetic characteristics), marital status, gender (including gender identity or gender expression), familial status, military or veteran status, genetic information, pregnancy, childbirth, breastfeeding, or related conditions (or any other group or category within the framework of the applicable discrimination laws and regulations).SDL2017"}