{"jobID": "2816079431", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.kongregate.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Public", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "100000", "jobDescription": " Senior Data AnalystThe Insights and Analytics team is responsible for providing data-driven insights and analytics support across the company. As a Senior Data  Analyst you will work closely with product leaders across our different business units to provide actionable insights that will help them  better execute their strategies. You will collaborate with data engineers ensure our data pipeline is stable, efficient and effective.  You will help support a number of teams including marketing, game and platform product managers, third and first party game developers and  finance. Due to this, you should feel comfortable context switching and supporting customers from various backgrounds. As a Senior Data  Analyst you will be operating with minimal supervision.  Our ideal candidate is an avid gamer and a SQL expert with a love for analytics and statistics. Essential Job Duties and Responsibilities  Help build internal tools to automate regular data analyses.  Drive analytical projects that span across multiple business units and functions.  Provide reporting and performance monitoring to game teams, marketing, and platform product managers using data drawn from diverse sources.  Work with data engineers to maintaining data integrity and transparency to increase data confidence across all business units that rely on it.  Establishing management dashboards to provide actionable and timely business insights.  Oversee the design and maintenance of standardized schemas for tracking game events and data.  Basic and Preferred Qualifications (Education and/or Experience)  Quantitative degree (Engineering, Math, Economics, Finance, Computer Science, etc.) or equivalent experience.  5+ years of experience performing quantitative analysis, preferable for a technology company.  Expert knowledge of databases and SQL.  Related Competencies Stellar Communication: Clearly conveys information, ideas and findings through a variety of written and oral media to both technical and non-technical audiences. Visualizes data to make information accessible, approachable and actionable. Analytical Thinking: Examines problems, situations, opportunities, and data to identify causes, key factors, and potential outcomes with the desire to improve overall business results. Creative Problem Solving: Identifies novel approaches to solving problems. Discovers new opportunities or adapts solutions for problems by looking beyond current practices and uses innovative thinking. Complexity Management: Quickly integrates complex information to identify strategies and solutions. Learns new concepts quickly, demonstrates keen insights into situations. Has the ability to assimilate large amounts of information and narrow it down to the core idea or issue.  Minimum Qualifications, Job Skills, Abilities  Expert understanding of statistics.  Proficient problem-solving and analytical skills.  Proficient communication skills and ability to present data in an easy-to-understand format.  Proficient ability to explaining technical topics to a non-technical audience.  Experience supporting a B2C platform a plus.  Experience with A/B testing design and readouts.  Extensive experience querying large data sets.  Experience automating analysis using analytics packages in languages like R or Python.  Ability to execute research projects, and generate practical results and recommendations.  Self-motivated, intellectually curious, and ambitious.  Enjoy working in both individual and team settings.This position can be filled at our Portland or Montreal locations. To apply, send a resume to jobs+SDA@kongregate.com with \"Senior Data Analyst\" in the subject line. back to top ↑"}