{"jobID": "2756076638", "jobLocation": "New_York_NY", "jobTitle": "Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.nytimes.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1896", "Type": " Company - Public (NYT) ", "Industry": " Media", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "89000", "jobDescription": "Job DescriptionAbout the position: Wirecutter is seeking a Data Analyst to join our small-but-growing Finance and Data group. The data team is responsible for data analytics, data engineering, and data science for TheWirecutter.com. This is an interdisciplinary role that works with stakeholders across the company, including senior leadership. Why you should apply: We’re pioneering a new type of service journalism and if you’re savvy and experienced in web analytics, ecommerce, affiliate marketing or any combination of the above you will have a unique opportunity to help shape how we improve our readers’ lives. As the Data Analyst, you will play a key role in helping us understand our readers and informing the direction of our business by defining, monitoring and analyzing essential web analytics and business metrics and communicating appropriate findings with recommended actions to stakeholders. About Wirecutter: Founded by journalists fed up with the time and energy it takes to shop, Wirecutter developed a simpler approach to giving buying advice: just tell people exactly what to get in one single guide. The company’s purpose: to help people find great things, quickly and easily. Through rigorous testing, research, reporting, and whatever means necessary, they create straightforward recommendations that save readers from unnecessary stress, time, and effort. We then monetize these guides by enabling our readers to easily purchase the products they are interested in. Locations: Even with offices in New York City and Los Angeles, Wirecutter remains a highly remote culture, and open to employing people across the country (and in Canada!). Right now, we are eligible to hire in AZ, CA, CT, CO, DC, FL, GA, IL, IN, MA, ME, MI, MN, MO, NV, NJ, NY, NC, OH, OR, PA, TX, VA, WA. If you live outside of these states but are still interested in working with Wirecutter, you are welcome to apply, and we will keep your information on file for future opportunities. Responsibilities:Maintain ongoing reporting that paints a picture of the “pulse” of our businessProactively analyze data to answer key questions from stakeholders or out of self-initiated curiosity with an eye for what drives business performanceAbility to understand the business operations as a whole and translate questions into effective analysis based on the goals behind the specific asksCommunicate findings effectively and translate them into recommended actions appropriate for each area of the businessDesign and build automated reporting dashboards on our BI platformQualifications:Excellent verbal and written communication skillsComfortable deconstructing complex and open-ended problems which may not yield a clear cut solutionAbility to work independently and to carry out assignments to completion based on the original goals with minimal supervision4-year degree in statistics or related field3+ years of experience in a data analyst role at an affiliate marketing, e-commerce company, or online publisher3+ years of experience using SQL is required1+ year of experience designing and building automated reporting dashboards with a data visualization tool such as Tableau or similarProficient with statistical analysis tools such as R or similarGoogle Analytics certification or equivalent experienceDemonstrated ability to work collaboratively in a multi-disciplinary teamStrong interest in Wirecutter’s missionCulture and benefits at The New York Times Company and Wirecutter:Though Wirecutter has physical locations in both NYC and LA, the company promotes and encourages a remote workforce, so that our employees can work in flexible and comfortable ways.We are committed to career development, supported by a formal mentoring program as well as tuition reimbursement. The New York Times Company offers frequent panel discussions and talks by industry leaders (Sheryl Sandberg, Melinda Gates and Ta-Nehisi Coates are a few recent examples), that we encourage our employees to attend.We believe diversity fuels innovation and creativity, and we have a variety of employee groups and task forces across The New York Times Company and Wirecutter dedicated to fostering a diverse and inclusive workplace.We offer a generous parental leave policy, which was recently expanded in response to employee feedback. Birth mothers receive 16 weeks fully paid, adoptive parents and birth fathers receive 10 weeks also fully paid. Similarly, we offer competitive health and dental insurance, as well as 401k matching. #LI-HK1If you are an active employee at The New York Times or any affiliates, please do not apply here. Go to the Career Worklet on your Workday home page and View \\\"Find Internal Jobs\\\". Thank you!The New York Times Company is an Equal Opportunity Employer and does not discriminate on the basis of an individual's sex, age, race, color, creed, national origin, alienage, religion, marital status, pregnancy, sexual orientation or affectional preference, gender identity and expression, disability, genetic trait or predisposition, carrier status, citizenship, veteran or military status and other personal characteristics protected by law. All applications will receive consideration for employment without regard to legally protected characteristics."}