{"jobID": "2830928788", "jobLocation": "New_York_NY", "jobTitle": "Director of Talent Acquisition", "companyRating": null, "companyInfo": {"Website": "www.forcebrands.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About The PositionOverview Glossier is looking for a passionate and organized Director of Talent Discovery to implement a best in class recruiting process, manage a growing team, and deliver top talent in a high growth, ever changing environment. This person will partner closely with our management team to introduce and implement new processes and training, building an effective recruiting and hiring organization. This person will oversee tech and non-tech recruiting, while taking ownership of full cycle recruiting for executive roles. This person will have a proven track record diversifying teams, with an exceptional knowledge of external D&I; organizations, tools, and inclusive sourcing and hiring practices. ResponsibilitiesBuild and own the Talent Discovery strategy and team growthDevelop and implement recruiting processes to drive efficiency and ease throughout across impacted teamsCollect, analyze and report on recruiting data metrics, in addition to making prompt and thoughtful process changes based on findingsOwn the candidate experience, keeping it as a priority for the recruiting and hiring teamDevelop and implement hiring manager and interviewer training to build extraordinary hiring managers at GlossierCollaborate with management team on workforce planning initiatives, including prioritizationLead targeted executive searchesBuild a strong team of tech and non-tech recruitersDesign, develop and launch a formal summer internship programLead employer branding initiatives, including continued development of our Careers Page and Glossier presence on external platformsQualifications10-12+ years of recruiting experience that includes leading and building high performing teamsBachelor's degreeExperience with taking a high-growth organization through scaleA deep understanding of how to run a high quality, full cycle recruiting process; and the ability to lead a team in doing soA desire to hire the best - constantly working toward company goals with a strong sense of urgencyMust be able to incorporate diverse and inclusive practices into the companyPreferred QualificationsStrong NY network, especially within the tech environmentExperience building and managing a teamExperience in tech recruitingExperience in retail or volume recruitingAppreciation for all things beautyExperience in a rapidly scaling start-upA basic knowledge of immigration policies and best practices as they relate to the hiring processAbout Glossier Glossier is a beauty company that lives in NYC, is sold on the internet, and promotes a skincare-first philosophy that celebrates beauty in real life. "}