{"jobID": "2792422319", "jobLocation": "Los_Angeles_CA", "jobTitle": "Senior Data Scientist - Machine Learning Engineer", "companyRating": "3.6", "companyInfo": {"Website": "www.ibm.com", "Headquarters": "Armonk, NY", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Public (IBM) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Accenture, Microsoft"}, "estimatedSalary": "152000", "jobDescription": "Job Description We are in a data science renaissance.  Companies that embrace data science will lead and those who do not will fall behind.  To help IBM's clients lead, we are building an elite team of data science practitioners to help them learn how to succeed with data science. The team will include data engineers, machine learning engineers, operations research / optimization engineers and data journalists.  The team will engage directly in solving real-world data science problems in a wide array of industries around the globe with IBM clients and internally to IBM. The elite team of data scientist will work with other IBMers and client data science teams to solve problems in banking, insurance, health care, manufacturing, oil & gas and automotive industries, to name a few. We will teach the data scientists and sometimes people who desire to be data scientist to: Key Responsibilities:Identify a use caseBreak that use case down into discrete MVPs (minimal viable product)Work in code notebooksBuild & validate modelsDeploy models via APIs into applications or workflowsMonitor & retrain modelsUse code repositories to version and share code/notebooksVisualize the output of their data story in a way that is consumable by allCreate Machine Learning pipelines and train models.Communicate effectively with line-of-business end-users to discover pain points and use cases, lead project definitions, and convey the business value of the project Guide and mentor clients to become self-sufficient data science practitionersGuide and mentor clients to become self-sufficient data science practitioners Preferred Work Locations: New York and San Francisco  While working across all these industries, you will also get to travel the World as these engagements will require that the team spend several weeks at client sites working on data science problems with a diverse team.  As a member of the team you will have a T-shaped skill set, having a broad knowledge base in Data Science and Industry Solutions in general, but also in- depth expertise in Operations Research / Decision Optimization.  Required Technical and Professional Expertise At least 5 years experience - Computer Science, Programming skillsAt least 5 years experience - Probability and StatisticsAt least 4 years experience - Data Modeling and EvaluationAt least 4 years experience - Big Data and Machine Learning Preferred Tech and Prof Experience At least 7 years experience - programming skills in at least two of the following: Python, R, Scala or Java. preference for Python ExpertAt least 5 years experience - Ability to consume and deploy data via APIsAt least 4 years experience - in applying supervised, unsupervised and semi-supervised learning techniquesAt least 4 years experience Machine Learning pipeline - data ingestion, feature engineering, modeling including ensemble methods, predicting, explaining, deploying and diagnosing over fittingAt least 5 years experience - in model selection and samplingAt least 2 years experience - deep learning and neural netsAt least 5 years experience - Business and Leadership EO Statement  IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status. "}