{"jobID": "2824564157", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Data Scientist 1: Genomics", "companyRating": null, "companyInfo": {"Website": "www.califesciences.org", "Headquarters": "San Diego, CA", "Size": "1 to 50 employees", "Founded": " 2015", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Who we are: Calico is a research and development company whose mission is to harness advanced technologies to increase our understanding of the biology that controls lifespan and healthspan, and to devise interventions that enable people to lead longer and healthier lives. Executing on this mission will require an unprecedented level of interdisciplinary effort and a long-term focus for which funding is already in place. Position description: Calico is seeking a genomics specialist with experience in software engineering to join a small, world-class team that works in close collaboration with outstanding biologists to achieve novel discoveries regarding aging and age-related diseases.  As a member of the Data Science team you will work closely with other data scientists and software engineers on genomics-oriented projects involving analysis and software engineering. You will help to expand our software infrastructure for carrying out diverse genomic analyses (genome assembly, RNAseq, ribosome profiling, ATACseq, etc.) and apply these workflows to answer diverse problems. Position requirements:A Master's degree or a Bachelor's degree with 2+ years of work experience in genomics or a related discipline and a demonstrated focus on computational research or software engineeringExcellent coding skills in Python and/or RAbility to work independently and deliver clear results to collaborators without extensive computational experienceDetail-oriented mindsetA strong desire to be part of Calico's missionExperience with analyses and their visualizations of high-throughput biological datasets and pipeline development, which includes strong knowledge of at least one of these genomics profiling approaches: RNA-seq, ribosome-profiling, single-cell RNA-seq, ATAC-seq, and proteomicsExperience in thinking through design of biological experiments, including identifying and solving problems inherent to biological data"}