{"jobID": "2820914527", "jobLocation": "Fremont_CA", "jobTitle": "On-demand Physical Therapist", "companyRating": null, "companyInfo": {"Website": "www.getluna.com", "Headquarters": "Menlo Park, CA", "Size": "1 to 50 employees", "Founded": " 2018", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " U.S. Physical Therapy, Select Physical Therapy, ATI Physical Therapy"}, "estimatedSalary": null, "jobDescription": "Luna is redesigning the patient and physical therapist experience by providing state-of-the-art on-demand care. We enable high quality clinicians to connect with motivated patients who appreciate the convenience of care in their home, gym, or office. We're looking for experienced, compassionate and forward-thinking physical therapists that can provide care in the following areas: orthopedics, sports, spine, hand & wrist, foot & ankle, pelvic/women’s health, and balance/vestibular.Every therapist is equipped with a Luna Success field kit with essential physical therapy equipment, including a treatment bed. We also provide our therapists with tablets pre-loaded with Luna's easy-to-use scheduling app integrated with an EMR so you can set your schedule for how often you want to work and the zip code where you want to work. We match you to patients. You track and log the patient visit and get paid within the same app.If you want to:Set your own schedule.Earn an attractive rate per visit.Improve patient outcomes.Use technology that helps you cut down the amount of administrative paperwork and extraneous documentation.Work with motivated patients for orthopedics, sports medicine, vestibular, and more. We do NOT service the traditional home health patient population.Please have more than 3+ years of physical therapy experience, be licensed to practice in California, and live in the San Francisco Bay area. Our therapists must have a clean driving record, valid driver's license and reliable transportation."}