{"jobID": "2700664552", "jobLocation": "Burbank_CA", "jobTitle": "Senior BI Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.warnerbros.com", "Headquarters": "Burbank, CA", "Size": "5001 to 10000 employees", "Founded": " 1923", "Type": " Company - Public (TWX) ", "Industry": " Media", "Revenue": " $10+ billion (USD) per year", "Competitors": " NBCUniversal"}, "estimatedSalary": "94000", "jobDescription": "Posting  Job Title Senior BI Data Analyst Time Warner  Division Warner Bros. Entertainment Group WB Business Unit WB Technology Industry Film Production and Distribution Area of  Interest Technology/Information Technology Location United States - California - Burbank Requisition # 163215BR Position  Type Full Time Company Overview Warner Bros. has been entertaining audiences for more than 90 years through the world’s most-loved characters and franchises. Warner Bros. employs people all over the world in a wide variety of disciplines. We're always on the lookout for energetic, creative people to join our team. Business Unit Overview WB Technology combines Warner Bros.’ industry-leading technologists and disciplines to ensure global alignment with business strategy and accelerated delivery of innovative technology solutions studio- and industry-wide. From pre-production through archiving, the WBT organization will provide critical business and technology intelligence and services to all Studio business units. WBT manages the Studio’s enterprise systems and solutions, emerging platforms, information security, consumer intelligence, content mastering and delivery, and more. Posting Job Description Warner Bros. Technology Data Intelligence Department seeks a Senior Business Intelligence Data Analyst for the Data Analytics and Visualization team. The Data Analytics and Visualization team is responsible for collecting, aggregating, analyzing and reporting across all media data. Our goal is to provide insights and enable data driven decisions to our Warner Bros. Theatrical, Television, Home Entertainment, Digital Networking Groups, DC Entertainment and Corporate divisions.  As a Senior BI Data Analyst, you will serve as a key liaison with business clients to support their reporting and analytic needs. You will require hands-on experience working in large scale business intelligence and data platforms. You will be working with business clients and vendors to gather requirements, prototype, architect, test, and deliver high quality Business Intelligence solutions. You will be executing test plans, performing quality reviews, supporting operations in an agile environment.  You instill confidence in the solutions you deliver and ensure that the insights provided are accurate, reliable, and easy to digest at all levels. You will work directly with the WB Data Engineering Team to deliver holistic solutions against our many Data Warehouses and our Big Data Platforms.  It’s essential the analyst has passion for data and can continuously understand and anticipate the growing business needs, identify areas to where complexity can be reduced, proactively introduce new ideas that help improve process efficiency and leverage data to improve effectiveness across our platforms and business units.  The successful candidate is an innovative individual who can see beyond the obvious, think broadly and looks for opportunities to collaborate with the Business units and internal Technology Solutions Team members.  What part will you play? BUSINESS ENABLEMENT – Work with business users from all levels to elaborate and document business requirements, priorities. Define key performance indicators (KPI), and deliver BI solutions. Participate in project estimation process with cost-benefit analysis. Partner with the Data Engineering Team for developing and delivering solutions. Work with business and development teams to design, and document dashboards, alerts, and reports.BUSINESS INTELLIGENCE APPLICATONS – Drive the collection of new data and the refinement of existing data sources. Maintain the data asset catalog. Work with ETL development team to develop, understand and interpret logical and physical data models. Design security and access restriction for the database and Business Intelligence environment and manage upgrades and maintenance as needed.PRODUCTION SUPPORTS and VENDOR MANAGEMENT - Coordinate with the business users during project implementations and continue to function as a key point of contact for future analytics and data questions and issues. Oversee the ongoing development and operations of the business intelligence applications. Oversee and monitor work of 3rd party support organization, provide technical review and direction to developers. Ensure business users questions and issues are resolved in a timely fashion. Conduct audits with data warehouse to ensure accuracy of information. Keep management, project managers, team members and business stakeholders informed of critical issues, project status and system status.APPLY AND SET STANDARD – Recommend and enforce Data Warehouse and Business Intelligence standards, best practices and architecture for enterprise data warehouse, data marts and analytical applications systems. Lead knowledge management and coordinate the development of necessary project documentation.RESEARCH - Identify and provide input to new technology opportunities that will have an impact on the Enterprise wide BI systems. Apply your learnings to what you build. Rapidly deliver on concepts through prototypes that can be presented for feedback.TRAINING - Develop training materials. Educate and train users, including executives, to transform data into action oriented information and help others be successful stewards of our tools. Enable everyone at Warner Bros. to be an analyst through the Self-Service BI model. What do we require from you? Bachelor's degree in Computer Science, Information Systems, Mathematics, Business Management or specialized training/certification. Or equivalent work experience.6+ years of relevant experience:Delivering business intelligence solutions.In-depth knowledge of the Media & Entertainment industry and multiple business functional areas is a plus.Working with large scale Enterprise Data Warehouse such as Teradata, Redshift, Oracle and/or SQL Server databases.Demonstrable skills building business intelligence and advanced analytics solutions.Working in an Agile development environment.Research product and technical data in order to recommend products, technologies, and processes for ongoing projects.Expert in Tableau Data Visualization tool.Able to design, build, maintain & deploy complex reports in Tableau.Experience integrating Tableau into another application or native platforms is a plus.Expertise in Data Visualization including effective communication, appropriate chart types, and best practices.Proven ability to deliver business intelligence solutions in a fast-paced environment.Strong background in data relationships, modeling, semantic layer and mining.Proficient in data wrangling languages such as SQL or Python.Experience with Redshift, Teradata or other parallel database.Experience working with complex and large volumes of data.Experience with Hive, Spark, Scala is a plus.Experience with R and/or SAS is a plus. But Wait, There's More! At WBT we look for members who want to:Be Curious: Seek out opportunities to learn, and who aren’t afraid to ask questionsOwn It: Be the driver, and take accountabilityEmbrace Change: The technology landscape is ever changing – we’re looking for people who are ready to change along with it.Engage and Influence: Share your passion for technology, and develop great relationships with colleagues and collaboratorsResepect: Show empathy and respect to all, and operate with the best intentionsLive the #WBLife: At WBT we look for team members who want to “Contribute to Our Community”*The Warner Bros. Entertainment Group of Companies is an equal opportunity employer and considers all candidates for employment regardless of race, color, religion, sex, national origin, citizenship, age, disability, marital status, military or veteran's status (including protected veterans, as may be required by federal law), sexual orientation, gender identity or any other category protected by law."}