{"jobID": "2723096241", "jobLocation": "Mountain_View_CA", "jobTitle": "Applications Engineering Intern, Summer", "companyRating": "4.4", "companyInfo": {"Website": "www.google.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (GOOG) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Apple, Facebook"}, "estimatedSalary": "102000", "jobDescription": "Applications are now closed. Please check back next year for 2019 opportunities.As an Applications Engineer Intern, you will play a major role in developing, deploying and supporting Google’s internal business applications. You will be tasked with solving various problems over time. When the situation calls for it, you’ll be part of a team that implements vendor sourced enterprise software, configuring that software, customizing it, and integrating with other internal systems. Other times, you’ll be primarily tasked with creating custom-built software.  Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From AdWords to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another. Responsibilities Build internal solutions, with custom front-ends (web, mobile) and back-end services that automate business processes. Maintain highest levels of development practices including: technical design; solution development; systems configuration; test documentation/execution; issue identification and resolution; writing clean, modular and self-sustaining code.Help partners in their day-to-day challenges by delivering innovative and scalable solutions, and troubleshooting their problems. Understand operational workflows, identify and define tool needs to enable operational scaling, and drive the development (initial and ongoing) and deployment of these tools with Engineering.Work closely with analysts to translate business requirements into technical solutions.Integrate third-party products into internal systems as well as support and upgrade implemented systems.Partner with internal teams to define and implement solutions that improve internal business processes. Qualifications Minimum qualifications:"}