{"jobID": "2653604980", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist", "companyRating": "4.9", "companyInfo": {"Website": "www.quizlet.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "140000", "jobDescription": "Back to all jobsQuizlet is looking for an experienced, technically proficient, and highly entrepreneurial individual to work with our product and engineering teams and develop actionable, data-driven insights to support our user experience, product quality, and revenue growth efforts. We’re backed by Union Square Ventures, Costanoa Venture Capital, Altos Ventures and Owl Ventures. Our business model is strong and got us to profitability before raising venture capital money.  We’re a small team making a huge impact, running one of the fastest growing and highest quality consumer brands in education. We’re developing innovative, simple-to-use study tools that help tens of millions of students learn (over 20M users a month visit our website and mobile apps).  We have a LOT of data - study activity, performance, clickstream, demographic, subscriber data…you name it. We've logged over 30 billion answers, 8 billion flashcards, and 20 billion study sessions. And we have huge opportunities to leverage this data to improve engagement (active user growth), product quality (existing and new features), educational effectiveness (how users learn), and also grow our paid subscriber base.  In this very hands-on role, you’ll make this happen at both a conceptual and execution level. You’ll be an early member of the data team at a brand that’s already well on its way to serving a billion students and teachers across the globe.The RoleYou will: Drive greenfield research in learning science, specifically knowledge acquisition and retentionIdentify and programmatically extract content taxonomies from our study materialStay up to date on cognitive science, psychometrics, and machine learning literature and evangelize methods to the companyContribute to our open source machine learning frameworkBuild growth and revenue forecasting modelsPresent at conferences, publish blog posts, and write papers to collaborate with others tackling the same problems Qualifications and ExperienceThe ideal data team member for Quizlet should have: Computationally intensive Masters or PhD preferred, at least 5+ years of experience in industry as a data scientist otherwiseA practical mindset: you’ll be excited to wake up thinking about things like knowledge acquisition, retention, and educational engagementPrior industry experience working with data on large Internet (ideally consumer) businessesA solid academic understanding of statistics and machine learningSelf-motivated and proactive: demonstrated ability to prioritize, execute and follow through on key projects and tasksStrong communication skills: able to distill complexity and communicate insights clearlyStrong technical skills, including SQL and Python. Familiarity with libraries like sklearn, gensim, TensorFlow, and Jupyter development flows are desirable.You know what it means to work in a small company where every person is doing big, meaningful things - and you want to do this!Passion for education and/or doing good in the world - you’re excited about the impact your work could have in the lives of students and teachers every day. Quizlet’s Team CultureWe’re extremely proud of the powerful impact our study tools are having on people’s lives across the U.S. and the world. Our focus on quality, usability, and performance across all platforms has helped Quizlet grow organically to a top U.S. web brand with top-ten education apps on iOS and Android. We regularly visit classrooms across the Bay Area to see Quizlet’s users in action. We believe in teamwork and communication, and we believe in each other — every member has the confidence and flexibility to take a stab at new problems across functions. We love technology and we love helping people. Come join us!"}