{"jobID": "2720143477", "jobLocation": "New_York_NY", "jobTitle": "CRNA-AMBULATORY SURGICAL CENTER - Relocate to Worcester, MA", "companyRating": null, "companyInfo": {"Website": "www.umassmemorialhealthcare.org", "Headquarters": "Worcester, MA", "Size": "10000+ employees", "Founded": " 1997", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Requisition #: 181852 Title: Certified Registered Nurse Anesthetist (CRNA) Department: Anesthesia Posting Date: February 23, 2018 Status: Exempt Shift: Days Hours: 40 Location: UMass Memorial Medical Group 151 Main St, Shrewsbury, MA  Its an exciting time at UMass Memorial Health Care, as we undergo major transformational changes coupled with a growing Department of Anesthesiology and Perioperative Medicine. UMass Memorial Healthcare is looking for CRNAs to join our new state of the art Ambulatory Surgical Center located in Shrewsbury, MA.  As a CRNA at our Ambulatory Surgical Center, you will enjoy a supportive and collegial partnership within our shared care practice model with Anesthesiologists, CRNAs , Surgeons and Perioperative staff. We have created an environment that captures the very best of healthcare. We offer you the chance to make an impact and join our dedicated team.  The new surgical center will be one of the largest in the US that will include nine freestanding operating rooms. Qualifications: Graduate of an approved Nurse Anesthesia Training program and eligible for the certification examination of the Council on Certification of Nurse Anesthetists. Board Certification must be obtained according to the regulatory requirements of the Massachusetts licensing Board and the guidelines of the Council of Certification of Nurse Anesthetist.  Our competitive benefits package includes top-tier medical and dental insurance, paid time off (PTO) and Holidays, matching 401 (k) Flexible Spending Accounts and Pension Plan just to name a few."}