{"jobID": "2830483162", "jobLocation": "Woburn_MA", "jobTitle": "Asset Data Analyst", "companyRating": "3.0", "companyInfo": {"Website": "www.americantower.com", "Headquarters": "Boston, MA", "Size": "1001 to 5000 employees", "Founded": " 1995", "Type": " Company - Public (AMT) ", "Industry": " Telecommunications", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " SBA Communications, Crown Castle"}, "estimatedSalary": "61000", "jobDescription": "ESSENTIAL DUTIES:Ensure the integrity of asset information through analysis to identify data discrepanciesCorrelate discrepancies between multiple databases for data cleanup and then assist in the creation of, and uphold governance standards for, asset information.Work with various stakeholder business groups to ensure quality standards are met regarding data integrity; provide training on as needed basis to provide necessary feedback to business groups for governance of asset-related data.Review and interpret asset information data to ensure data quality and integrity.Understand the correlation between the asset information and ECM databases, including how that data flows into Oracle, and identify and interpret how the changes in one database affects Oracle and vice versa.Facilitate integration of acquisition-related asset information into the the system of record, including bulk uploads and individual transactions.Provide guidance and expertise to stakeholders and business groups on data capture, , and stay knowledgeable on future data integrity and capture technologies as they evolve.Analyze ECM system dataVerify data/document capture system for appropriate classification and data extraction from documents.Interface with appropriate parties to address and resolve issues pertaining to ECM system, asset information database, and document capture or other systems.Work with various business groups to ensure content uploaded to ECM system adheres to applicable quality standards.Work with IT department regarding system testing, integrations, migrations, upgrades, and fixesOTHER:Other duties as assignedSUPERVISORY RESPONSIBILITIES:NoneQUALIFICATIONS:Excellent computer skills including email and folder management, as well as reporting experienceProficient with Microsoft Office Applications and database systemsAbility to think analytically and work with large volume of dataAbility to work with functional groups and different level of employees to effectively and professionally achieve resultsStrong follow-up skills; ability to organize applicable department timelines and follow up with internal and external customer needsStrong written and oral communication skills, including the ability to present ideas and suggestions clearly and effectivelyStrong organizational skills; ability to accomplish multiple tasks within the agreed upon timeframes through effective prioritization of duties and functions in a fast paced environmentStrong track record of building and maintaining solid relationships with internal and external customers and vendors.Self-motivated, able to work independently to complete tasks and respond to department requests and to collaborate with others to utilize their resources and knowledge to identify high quality solutionsEDUCATION AND EXPERIENCE:Bachelors degree or relevant experience requiredMinimum of two years analytical experience requiredExperience with enterprise content management system preferredExperience with Excel and reporting modules preferredENVIRONMENT: Approximately 90% performed in climate-controlled internal office environment working under normal office conditions. Approximately 10% travel may be required in support of the positions responsibilities.  While performing the duties of this job, the employee is regularly required to sit, stand, walk, use hands and fingers to feel and handle, reach with arms and hands, talk and hear. While performing the duties of this job, the employee frequently is required to stoop, kneel and crouch, lift weight or exert a force up to a maximum of 25 pounds. SUMMARY: The System Information Analyst is responsible for working with various stakeholder business groups to analyze and ensure the accuracy of asset-related information. The incumbent will identify discrepancies and find the best solution using analytical procedures such as reports, cross validation of data between databases and other review of relationships and elements of data. The incumbent is also responsible for updating and maintaining asset-related information."}