{"jobID": "2797681376", "jobLocation": "Boston_MA", "jobTitle": "Research Lead, Evidence Synthesis", "companyRating": null, "companyInfo": {"Website": "www.icer-review.org", "Headquarters": "Boston, MA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "The Institute for Clinical and Economic Review (ICER) is an innovative, independent non-profit health care research organization dedicated to improving the application of evidence throughout the health care system. ICER produces influential public reports evaluating the clinical effectiveness and value of new treatments, tests, and delivery system interventions. These reports have strongly influenced insurance coverage policies and clinical guidelines while gaining prominence within the national debate over the cost of health care. ICER thrives on the entrepreneurial spirit of its employees to empower patients, clinicians, and policymakers in their quest for better care at lower costs. In everything we do, our organization seeks to foster an honest public dialogue about the evidence on effectiveness and value, and to translate this evidence into action to improve patient care.ICER is looking to expand its team, which includes a diverse set of clinicians, researchers, and policy experts. We are seeking a Research Lead, Evidence Synthesis to assist with the health technology assessment activities that serve as the backbone for all of our work. Details on the specific responsibilities and minimum qualifications are provided on the next page. Before going there, however, ask yourself the following questions:Are you interested in using comparative effectiveness research to effect change in practice and policy, even in the face of sharp criticism by those uninterested in changing?Are you able to view published research with a skeptical eye, even if published by luminaries in the field?Are you a perfectionist? Are you unsatisfied with a work product unless every last detail has been accounted for?If you’ve answered “yes” to each question, read on!Job RolesUnder direction of the Chief Scientific Officer, the Research Lead, Evidence Synthesis will participate in multiple scientific activities, including:Develop the strategy for and perform literature searches to inform evidence-based reviewsAbstract relevant data from articles, develop and maintain project databaseProduce evidence tables summarizing abstracted dataCritically evaluate the research methods and statistical findings of health outcome studies retrieved from the medical literatureUse established frameworks and tools to evaluate, grade and summarize the quality of the evidenceConduct qualitative and quantitative synthesis of evidence from literature and other sources, including meta-analyses where relevantAssist in development and estimation of analyses of budgetary impact, cost, and cost- effectivenessResearch and summarize information contained in clinical guideline statements, payer coverage policies, and health technology assessments from other organizationsIdentify and communicate with, and solicit input from patient groups, medical societies, manufacturers and other key stakeholders for each projectCoordinate and develop draft and final appraisal reports, including writing, editing, and proofreading, as necessaryEnsure that milestones and timelines are on track for simultaneously-operating projectsQualificationsBachelor’s or Master’s degree in a relevant discipline, such as public health/epidemiology, health policy, or economics1-3 years of relevant work experience, preferably as part of a team performing systematic evidence reviewsThe highest levels of personal initiative, attention to detail, and independent workExcellent organizational as well as written and oral communication skillsWord processing, spreadsheet, and database management software experience requiredExperience with techniques of qualitative and quantitative evidence synthesis in a health technology assessment environment (including meta-analysis) a plusExperience with statistical software (e.g., SAS, SPSS) a plusIt is not intended that the above listed duties reflect every job duty, responsibility or task that the employee may be called upon to perform. The employee is expected to perform all job-related duties and tasks assigned by his/her supervising manager or other authorized manager.Interested candidates should e-mail resume and cover letter; please also include contact information should we wish to schedule an interview."}