{"jobID": "2705070008", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist - Machine Learning, Global Intelligence", "companyRating": "4.3", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "141000", "jobDescription": "About Uber We’re changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now we’re a part of the logistical fabric of more than 600 cities around the world. Whether it’s a ride, a sandwich, or a package, we use technology to give people what they want, when they want it.  For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer.  And that’s just what we’re doing today. We’re thinking about the future, too. With teams working on autonomous trucking and self-driving cars, we’re in for the long haul. We’re reimagining how people and things move from one place to the next.  Are you interested in working at the intersection of growth hacking, applied machine learning, engineering, and advanced data analysis? Do you have an interest in developing and applying quantitative scalable solutions related to Uber's growth problems? If so, then this is the job for you.  Machine Learning Data Scientists on the Global Intelligence team work closely with product, engineers, marketing and operation teams to address major growth problems such as driver/rider preference, engagement and churn. You will take the lead on identifying patterns of driver/rider choices, developing the intelligent system to interact with Uber's millions of drivers and riders.  We are looking for people with advanced quantitative degrees who are comfortable enough with research methodologies to address critical business and engineering problems, and who are enthusiastic about dealing with complicated structured/unstructured data. You should also have demonstrable programming skills and be comfortable with engineering development process. What you'll needAt least 2 years of experience in research, data science, or engineering experience in creating and implementing optimization systems, machine learning models/algorithms, particularly around classification, ranking, segmentation, multivariate regression, pattern recognition, etc.Excellent programming skills - ability to prototype effective simple or complex algorithms and collaborate with engineering team to implement them in the production system.Excellent data skills - ability to extract complex data from various data systems and streamline the process.Superb quantitative background: PhDs preferred.Passionate and attentive self-starters, great communicators, amazing follow-through - you have a great work ethic and love being personally empowered.A preference for growth hacking - you resolve the problems in the most efficient and effective ways."}