{"jobID": "2678336196", "jobLocation": "San_Bruno_CA", "jobTitle": "Staff Data Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.walmartlabs.com", "Headquarters": "San Bruno, CA", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, eBay, Google"}, "estimatedSalary": "180000", "jobDescription": "Position DescriptionWe are looking for passionate data scientists and researchers to building next generation forecasting models and algorithms for Walmart. Forecasts drive $200 B + inventory replenishments annually. Improved forecast will help drive down the inventory days of supply and reduce waste for perishable grocery savings measured in billions of dollars while improving our instocks.  Effectively predicting demand involves learning from past sales and modeling the effects price, promotions, store placements, local events, weather etc. Doing this a Walmart scale over 500 M store item combinations - makes it one of the largest and most challenging problems of its kind in the world while also being the most impactful. Talk to us to if you are interested in taking up the challenge.  Responsibility  As a Data Scientist you will play a unique role in driving the future of the next generation Forecasting models researching, designing and implementing cutting edge algorithms. Responsibilities include: Conduct advanced statistical analysis to provide actionable insights, identify trends, and measure performanceBuild learning systems that monitor data flows and react to changes in customer preferences and business objectivesCollaborate with engineers to implement and deploy scalable solutionsProvide thought leadership by researching best practices, conducting experiments, and collaborating with industry leaderMinimum Qualifications• PhD in statistics or machine learning or Applied Mathematics or related technical discipline with 3+ years of experienceExperience in areas such as data-driven statistical modeling, discriminative methods, feature extraction and analysis, supervised learning.Proficient in R/ Python and SQL. Experience working with large data sets and distributed computing tools a plus (Map/Reduce, Hadoop, Hive, Spark)Additional Preferred Qualifications• Inquisitiveness and desire to learn.Strong analytical skills including the ability to structure problems for analysis, analyze the data and understand root cause.Ability to deal with ambiguity and effectively prioritize competing objectives.Forecasting experience in an online and/or retail environment is preferredExcellent written and verbal communication skills along with strong desire to work in cross functional teamsAttitude to thrive in a fun, fast-paced start-up like environmentCompany SummaryWalmart Global eCommerce is comprised of Walmart.com, VUDU, SamsClub.com, and our technical powerhouse @WalmartLabs. Here, innovators incubate next gen e-commerce solutions in real-time. We integrate online, physical, and mobile shopping experiences for billions of customers around the globe. How do we do it? We continuously build and invest in new technology including open source tools and big data innovations. Data scientists, front and back-end engineers, product managers, and web and UX/UI teams collaborate alongside e-commerce experts to envision, prototype, and bring revolutionary ideas to life in a dynamic, flexible and fun work culture.Position Summary-"}