{"jobID": "2811581679", "jobLocation": "Lexington_MA", "jobTitle": "Behavior Therapist", "companyRating": null, "companyInfo": {"Website": "www.stepstosuccessconsultants.com", "Headquarters": "Lexington, MA", "Size": "Unknown", "Founded": " Unknown", "Type": " Unknown", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Come work where you are valued, appreciated and supported every day. Work where you make a difference! Steps to Success Consultants, LLC is a behavior consultation and ABA services company based in Lexington, MA. We have served families in eastern Massachusetts since 2004. We offer home, school and center-based ABA services, social skills groups, playgroups, parent trainings and vacation events.  Now hiring Full-time and Part-Time Associate Providers!  Responsibilities include direct ABA service hours with clients, running programs (DTT, ADLs, communication programs, play, etc.), collecting data, graphing.  Assisting with social groups and ABA events  Part time: 8-19 hours/week  Competitive salaries  Salaried for full-time positions  BCBA supervision and RBT supervision  Paid vacation and sick time, health insurance, liability insurance, and continuing education opportunities included.  All cases are managed and supervised weekly by a BCBA, with extensive time for collaboration, brainstorming, training and supervision. We take great pride in our small, well-qualified, experienced, dedicated group of professionals who are motivated by the steps to success that each child makes.  Candidates must have experience with children with special needs and ABA experience. He or she should be a team player, who can follow through with behavior plans and work well with children with special needs. There will be extensive training and supervision to achieve a strong working relationship with the child and family. RBTs preferred.  Applicants should send a cover letter and resume to tkolff@stepstosuccessconsultants.com"}