{"jobID": "2815116336", "jobLocation": "San_Francisco_CA", "jobTitle": "Digital Marketing Analytics Intern Summer", "companyRating": "2.4", "companyInfo": {"Website": "www.wcgworld.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Edelman, Weber Shandwick, Porter Novelli"}, "estimatedSalary": "48000", "jobDescription": " W2O Group - Digital Marketing Analytics Intern Summer 2018  Digital Marketing Analytics Intern Summer 2018  San Francisco, CA  Marketeching Solutions Analytics & Data Science  Intern  Apply for this job  Recently ranked as The Holmes Report's #1 place to work among large agencies, W2O is an integrated marketing and communications firm powered by analytics and specializing in healthcare. We are seeking an amazing Digital Marketing Analytics Intern to join our growing team. Are you interested in the changing media landscape? Are you interested in how social media impacts people's relationships with companies and brands? Do you enjoy using science and data to understand human behavior? If so, we have an internship opportunity to learn and gain valuable real-world experience in online analytics. This is a great opportunity to join a dynamic, fast-growing global agency. JOB RESPONSIBILITIESConduct quantitative and qualitative research that guide our client's communications and marketing strategiesCreate data visualizations (e.g., PowerPoint and chart templates, interactive charts, info graphics, etc.)Participate in team brainstorms to discuss how research insights translate into actionable client recommendationsStay informed about client industries including their technologies, products, target markets and competitorsREQUIRED SKILLS AND QUALIFICATIONSMust have completed Junior year of college with a 3.5 GPA or higherMust have (or be working towards) a degree in natural or social sciences, business, marketing, communications, applied mathematics, statistics, or computer sciencesStrong writing and presentation skills, solid analytical bent to turn data into insightsExperience with Microsoft Office tools (PowerPoint, Word, Excel) and Google AnalyticsExcels at research and possesses excellent writing skillsSDL2017"}