{"jobID": "2798163420", "jobLocation": "San_Carlos_CA", "jobTitle": "Manufacturing Associate", "companyRating": "3.2", "companyInfo": {"Website": "www.nugen.com", "Headquarters": "San Carlos, CA", "Size": "1 to 50 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "19", "jobDescription": "NuGEN Technologies is looking for a talented Manufacturing Associate to join our Operations team. The successful candidate will be responsible for ensuring quality product is produced according to standard operating procedures (SOPs). The role also provides support forproduction, quality, and materials on a variety of manufacturing related activities and projects. The successful candidate will have both knowledge of manufacturing processes and excellent attention to detail. In addition, the ability to communicate and collaborate successfully with others within the production group and company is critical to success. Position will report to the Manufacturing Manager and will be located in San Carlos, California. No relocation assistance available. JOB TITLE: MANUFACTURING ASSOCIATEESSENTIAL DUTIES AND RESPONSIBILITIESProduce high quality products by following NuGEN’s Standard Operating Procedures (SOP) and Work Instructions (WI) and adhering to Quality Management System (QMS) Knowledge of good documentation and laboratory practices according to ISO guidelines; i.e., working in laboratory areas under proper gowning guidelines, handling of temperature sensitive material, and cross-contamination preventionMay initiate revision to production related quality documentation to ensure procedures accurately reflect current processesReagent manufacturing Manufacture reagent bulks by following quality documents (batch records)Label, fill, & cap subassembly vials and 96-well plates for finished goodsKit assembly Assemble finished goods kits following quality documentsAssess product inventory and initiate kit assembly as neededPrint kit product labels and kit assembly· Other manufacturing support:Transaction processes (work orders, expenses, transfers) in inventory/ERP databaseReview completed manufacturing batch recordsQuarterly physical count/cycle count of inventoryPreventative maintenance for designated equipmentRoutine maintenance, stocking, and decontamination of production facilitiesQUALIFICATIONSBachelors degree in Life Sciences or equivalent experience (3+ years)Hands on laboratory experience in molecular biology or biochemistryExcellent pipetting skills a mustKnowledge of navigating and using inventory databases"}