{"jobID": "2830414082", "jobLocation": "Boston_MA", "jobTitle": "Data Scientist", "companyRating": "4.4", "companyInfo": {"Website": "www.pixability.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "104000", "jobDescription": "Who We Are Pixability is a video advertising technology company that gives media professionals the ability to plan, buy, and report across YouTube, Facebook, Instagram, Twitter, and Snapchat.  Pixabilitys holistic solution empowers advertisers to deliver outstanding campaign performance across these premium video environments, through deep insights, patented targeting technology, verified viewability, and apples-to-apples reporting. Pixabilitys solution empowers advertisers to activate video at every stage in the consumer journey in order to deliver impactful business results. Our Award-Winning Culture Our team is at the heart of our culture. We value innovation, collaboration and curiosity, combined with a passion for getting things done. We strive to hire and develop the best and foster a culture of open communication and transparency. We are driven and hard-working, but also have fun along the way with weekly catered lunches and happy hours, team outings, and unlimited time-off.  We were named the global winner for Video Innovation in the 2017 Google Premier Partners Awards, and proud to be included in Boston Business Journal's Fast 50 awards (2018) and BostInnos list of Bostons Coolest Companies (2017), as well as named #497 on the Inc. 500 (2017). The Role Pixability brings a data-driven, scientific approach to video marketing. We are at the forefront of this revolution and use large-scale data analysis to make video content more effective. Data Science plays an important part in that effort. We build models, tools, and platforms to convert our rich data into valuable insights for our customers.  As a Data Scientist you may extend models which select the most appropriate channels to run a video ad. You may build optimization solutions which determine the best bid level across a given campaign, across all social platforms. You might also build additional functionality into our AI bot. Whatever you work on, you will have a may impact on our solutions. Who You Are Data drives you. You are motivated by having a significant impact on the company and creating differentiated solutions within the industry. You are comfortable exploring and working your way through ambiguity. You value collaborating with a team of researchers who encourage your success. What You Bring to the PartyBachelors or Masters degree in computer science, data science, information technology, economics, statistics, hard sciences, or related fields1+ years experience in several of the following:Analysis tools such as Spark, R, scikit-learn, NumPy, or similarAlgorithms and data structures for machine learningStatistical analysis methodologiesSoftware development skills in Java or Python on UNIX/LinuxSQL and NoSQL databases such as MySQL, Vertica, GreenPlum, SnowflakeDemonstrable ability to analyze large data sets and provide compelling insights to technical and non-technical peopleGeneral knowledge of online marketing, social media, SEO and Adwords is a big plusThe Team At Pixability, the Data Science team is the research and development department. We build industry leading solutions which create significant competitive advantage for the company. Some of the problems we face have very amorphous scopes and require the team to embrace an experimentation and cooperation mindset. As such we rely on each others varying expertise to scope the problem into manageable, tractable, goals. Collaboration is a central tenant of the group, we plan together, execute independently and share with each other throughout the project. Therefore we value openness, transparency and accept the best idea, wherever it originates from.  Local candidates only please no relocation is available for this position. Pixability does not accept/pay fees for unsolicited resumes from third party agencies/vendorsAs part of our dedication to the diversity of our workforce, Pixability is committed to Equal Employment Opportunity without regard for race, ethnicity, gender, protected veteran status, disability, sexual orientation, gender identity or religion."}