{"jobID": "1528215527", "jobLocation": "San_Jose_CA", "jobTitle": "Fire Alarm Sales Representative", "companyRating": null, "companyInfo": {"Website": "www.rfi.com", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Responsibilities:The Sales Person is responsible for establishing new corporate accounts and service sale opportunities. Duties may include, but are not limited to, estimating and negotiating projects with clients including general and electrical contractors through customer service and public relations.Bring new clients into RFI, and actively sell and market RFI’s services and products to achieve agreed-upon revenue goals. Regularly contact and/or meet with clients to promote business and goodwill.Develop and maintain customer relationships, promoting a lasting business partnership.Attend NFPA, manufacturer seminars and other industry functions as appropriate.Develop design and negotiate projects and service opportunities in the bid and negotiated market for the assigned discipline. Develop new sales territories as required using Chamber of Commerce, Builder’s Exchange, BOMA and other organizations as required.Develop sales goals in conjunction with the Team Leader. Strive to meet or exceed targeted goals for Quota, RMR and Profitability.Track and follow up on all Team projects to ensure profitability and overall customer satisfaction and success. Manage and monitor all project billing to ensure prompt payment and assist with change order processing.Coordinate with the Project Team to generate billing and solve any problems that might interfere with collections in a timely manner.Analyze prospective work accurately, comprehensively and timely. Ensure high quality estimates resulting in awarded projects.Qualifications:A minimum of 2 years experience in fire alarm system sales. Siemens Fire Alarm product experience is desired.Knowledge of NFPA and the California Fire Code is required. NICET Level 1 is preferred.Qualified candidates must have a clean criminal record, valid drivers license, favorable DMV report, pass pre-employment drug screening and background check.Office: San Jose and the Bay AreaHow To Apply: Download application form and return by fax or email.Download: Employment ApplicationFax: 408-882-4423Email: jobs@rfi.com"}