{"jobID": "2828124159", "jobLocation": "Boston_MA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.beaconhillstaffing.com", "Headquarters": "Boston, MA", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Aerotek, WinterWyman, Hollister Staffing"}, "estimatedSalary": null, "jobDescription": " We are actively recruiting a Data Analyst to join Beacon Hill Staffing Group and work as a consultant for a private medical school in Boston, MA. The selected candidate will be responsible for extracting data and moving it from one system to another.  Data Analysts Should Possess: Great experience with ExcelGreat experience with SQL Additional Qualities: Dataloader for SalesforceHigher-Ed industryHubspotKnowledge of Salesforce Find Us on Facebook!  Follow Us on Twitter!  Beacon Hill is an Equal Opportunity Employer that values the strength diversity brings to the workplace. Individuals with Disabilities and Protected Veterans are encouraged to apply. Company Profile: Beacon Hill Technologies, a premier National Information Technology Staffing Group, provides world class technology talent across all industries on a contract, direct (permanent), contract-to-direct and project basis. Beacon Hill Technologies' dedicated team of recruiting and staffing experts consistently delivers quality IT professionals to solve our customers' technical and business needs.  Beacon Hill Technologies covers a broad spectrum of IT positions, including Project Management and Business Analysis, Programming/Development, Database, Infrastructure, Quality Assurance, Production/Support and ERP roles.  Learn more about Beacon Hill Staffing Group and our specialty divisions, Beacon Hill Associates, Beacon Hill Financial, Beacon Hill HR, Beacon Hill Legal, Beacon Hill Pharma and Beacon Hill Technologies by visiting www.beaconhillstaffing.com.  We look forward to working with you.  Beacon Hill. Employing the Future"}