{"jobID": "2810332005", "jobLocation": "Berkeley_CA", "jobTitle": "Engineering Intern Molecular Diagnostics", "companyRating": null, "companyInfo": {"Website": "www.siemens.com", "Headquarters": "Munich, Germany", "Size": "10000+ employees", "Founded": " 1843", "Type": " Company - Public (SIE) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " GE, ABB, Philips"}, "estimatedSalary": null, "jobDescription": " **Engineering Intern Molecular Diagnostics** Locations:Berkeley, California Job Family: Internal Services New Search Apply English (US) **Job Description** **Division:** Siemens Healthineers **Business Unit:** Healthineers (HC) **Requisition Number:** ****** **Primary Location:** United States-California-Berkeley **Assignment Category:** Full-time temporary **Experience Level:** Entry level **Education Required Level:** High School Diploma / (GED) **Travel Required:** No **Division Description:** Siemens is a global technology powerhouse that has stood for engineering excellence, innovation, quality, reliability and internationality for more than 165 years. As a global technology company, Siemens is rigorously leveraging the advantages that this setup provides. To tap business opportunities in both new and established markets, the Company is organized in nine Divisions: Power and Gas, Wind Power and Renewables, Energy Management, Building Technologies, Mobility, Digital Factory, Process Industries and Drives, Healthineers and Financial Services. With 45,000 employees Siemens Healthineers is one of the worlds largest suppliers of technology to the healthcare industry and a leader in medical imaging, laboratory diagnostics and healthcare IT. All supported by a comprehensive portfolio of clinical consulting, training, and services available across the globe and tailored to customers needs. So that more people can have a life that is longer, richer, and more filled with happiness. For more information, please visit: *************************************** **Job Description:** **Position Overview** Seeking a determined internship candidate to assist an exciting project developing next generation molecular diagnostics instrumentation. Team member will participate in developing tests of instrumentation and perform data collection, as well as analyze, document and present data. Hands-on position, with a good balance of theory and practical engineering skills. **Responsibilities** Assist in designing/building test equipment for various aspects of PCR systems (thermal, optical, electrical and mechanical) Execute test protocols and record data, as instructed by supervisor. Analyze data and determine common performance metrics. Document test results in reports and presentations. Develop test scripts in Python, Matlab, C or C++ to automate test procedures. **Required Knowledge/Skills, Education, and Experience** Rising junior/senior in Electrical, Biomedical, or Mechanical Engineering Basic knowledge of PCR, analog circuits and optical imaging/detection techniques Good programming skills in Python, Matlab or C+ Strong data analysis and presentation with common tools (such as Excel, Word, Powerpoint) **Preferred Knowledge/Skills, Education, and Experience** Previous experience in a biomedical setting Previous experience working on PCR based experiments Experience with test automation and programming **Equal Employment Opportunity Statement** Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, protected veteran or military status, and other categories protected by federal, state or local law. **EEO is the Law** Applicants and employees are protected under Federal law from discrimination. To learn more, Click here at ************************************************************** . **Pay Transparency Non-Discrimination Provision** Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here at ************************************************************** . Categories - Financial Services - Healthcare - Biotechnology / Science - Engineering"}