{"jobID": "2802120505", "jobLocation": "Los_Angeles_CA", "jobTitle": "Sr. Banking Data Warehouse - Data Analyst (Remote or Onsite)", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The position listed below is not with LA Interviews but with Novum Partners  LA Interviews is a private organization that works in collaboration with government agencies to promote emerging careers. Our goal is to connect you with supportive resources to supplement your skills in order to attain your dream career. Job DescriptionJob Description The Sr. EDH Data Analyst (Lending) role serves is a key role on the team updating and implementing various lending systems for a super-regional bank. In this role, the analyst will drive the identification and mapping of data elements from the source lending systems (origination systems, servicing systems, collection systems) into an integrated data hub that supports downstream regulatory and management reporting. The successful candidate will be working closely with architecture teams in developing and/or updating data models for the lending subject area, and will serve as a bridge between the business users and the development and testing teams. In this role, the successful candidate will profile data, identify and prioritize business requirements, develop mapping specifications, develop testing and data quality criteria, and ensure that the data is being loaded correctly into the data warehouse environment.  Location  This role will be part of a team of data professionals working together on various loan-related projects. Most members of the team will be working from remote locations across the United States. Initially, some travel to the Los Angeles area may be needed for training. Most of the work will be done via secure VPN/remote connections. Candidates MUST be adept at utilizing conference calling and screen sharing services such as Webex. Requirements Excellent communication skills  Excellent documentation skills  Expert knowledge and experience working with commercial, retail, and mortgage lending lines of business within a retail banking environment. Prefer direct experience with the AFS, Shaw, ACLS, Jack Henry, Argo, Fiserve, or ACBS systems.  Experience with system/platform design and conversion  Experience accessing and profiling raw data files  Experience developing and maintaining data mapping specifications, business rules, transformation logic, and testing criteria.  Expert knowledge and experience with data warehousing and data marts in a banking environment.  Experience with every aspect of the SDLC in a banking environment Required Experience 10+ years working in banking, specifically with lending-related data/systems – must include field-level knowledge of various lending systems.  10+ years working directly with project teams within a structured project environment developing data warehouse and BI solutions– this experience must include BRD development and documentation, data profiling, data modeling, data mapping, developing test cases and quality criteria, and testing of data warehouse fields and processes.  Required Technical Skills and Experience  SQL (Oracle, SQL-Server, PostgreSQL, etc.) for data analysis, profiling, and mapping. Must include SELECT queries, joins, aggregations, window functions, etc.  Solid understanding of database and ETL processing (file and database centric) and tools.  Expert understanding of various types of data models used within retail banking  Expert MS Excel skills  Other Microsoft Office (including Visio)  Ability to perform gap analyses for both data and processes  Writing business requirements documents  Writing/designing business processes  Developing test plans: defining scenarios, developing test cases, managing/executing user-testing using tools like HP Quality Center  Front-end and Back-end experience with relevant banking systems (AFS, Shaw, ACLS, Jack Henry, Argo, Fiserve, or ACBS systems) Education Bachelor's degree required, degree in business/MIS/CIS preferred  Apply"}