{"jobID": "2798876767", "jobLocation": "San_Jose_CA", "jobTitle": "Senior Manager, Validation Engineering", "companyRating": "3.4", "companyInfo": {"Website": "www.skyworksinc.com", "Headquarters": "Woburn, MA", "Size": "5001 to 10000 employees", "Founded": " 1962", "Type": " Company - Public (SWKS) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "161000", "jobDescription": "    If you are looking for a challenging and exciting career in the world of technology, then look no further. Skyworks is an innovator of high performance analog semiconductors whose solutions are powering the wireless networking revolution. At Skyworks, you will find a fast-paced environment with a strong focus on global collaboration, minimal layers of management and the freedom to make meaningful contributions in a setting that encourages creativity and out-of-the-box thinking. Our work culture values diversity, social responsibility, open communication, mutual trust and respect. We are excited about the opportunity to work with you and glad you want to be part of a team of talented individuals who together can change the way the world communicates.  Requisition ID: 47891  Senior Manager, Validation Engineering    The successful candidate will be a World-Class expert in RF evaluation and validation test throughout all phases of RF product development. In this role you will lead a team validation engineers driving the San Jose design center’s test and validation engineering functions, working with and influencing large teams of engineers across multiple sites. This high leverage position will impact and support the development and production of PAs, RF switches and front-end modules for the extremely fast-paced and highly competitive cellular handset market.     The position is located in our San Jose Design Center and in this position you have the opportunity to make a uniquely large impact on the success of the Business Unit and Company.    Detailed Description: Our Validation Engineering Leader will be responsible for driving all aspects of the San Jose design center’s validation engineering function. You will lead a team of engineers and technicians executing the site’s validation engineering needs in a fast-paced, highly interactive environment. You and your team will engage in frequent technical meetings with design engineering both for tactical product reviews and strategic road mapping.     You will report to the San Jose Design Site Leader and will be a key member of the site’s leadership team in a highly visible leadership role.     Responsibilities will include, but not be limited to: Validation Engineering Execution, Techniques & Methodologies: Manage site validation engineering team to ensure seamless product development support and thorough data analysis. Drive new validation engineering methodologies and best practices."}