{"jobID": "2817362383", "jobLocation": "New_York_NY", "jobTitle": "Digital Analyst Intern - Fall 2018, Spring 2019, or Summer", "companyRating": null, "companyInfo": {"Website": "www.thesparkgroup.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Huge, R2integrated, Blue Fountain Media"}, "estimatedSalary": null, "jobDescription": " Company Descriptionthe SPARK GROUP (tSG) is a boutique digital marketing & creative agency headquartered in the heart of NYC. Our mission: to tell and share brand stories.. You can learn more about tSG at www.thesparkgroup.com. Were marketers by title, but storytellers at heart. With every project, our goal is to find new and compelling ways to bring brand stories to life in a way that engages the right audiences and drives action -- and do so in a way that makes them care, desire, trust, and connect. Then, we make sure that our clients, both online and offline, live up to every facet of that story.  We work with companies spanning a diverse set of industries: Financial Services, Real Estate, Technology, Lifestyle, Health & Fitness, Retail, Government, Advocacy, Non Profit, B2B, Legal, Creative If theres a story to tell, were there to tell it. ***TO APPLY PLEASE VISIT: https://thesparkgroup.com/join/Job DescriptiontSG is looking for an intern who excels in all things internet. We need someone who is interested in taking a deep dive into our digital efforts across all channels, to pull valuable data and insights that will inform our campaigns.  In return, you will gain valuable experience and training in the world of digital marketing for business. Plus, some valuable LinkedIn connects. You live for those too, right?  The right candidate should be interested in numbers, analytics, and social media. He/She should be highly organized, detail-oriented, and have knowledge in social media analytics. Mostly were looking for someone with a go-getter attitude, who can turn to Google in times of need to find solutions.QualificationsRequired Skills:Digital marketing experienceFlexibility and eagerness to identify, learn, and use new and emerging technologiesComfortable using Excel to analyze data and create reportsExperience with Google AdWords & Analytics, Facebook Business Manager, and other analytics platforms is a plusAdditional InformationTSG Perks & Benefits: Fall 2018 or Spring 2019 commitment required (minimum 32 hours per week)  Compensation: Academic Credit & Transportation Stipend  Office located right off of Madison Square Park (nice, huh?)  Taco Tuesdays. Foosball Tournaments. Nintendo Wii. Mario Kart Competitions. Nuff said.  Music plays constantly enjoy it"}