{"jobID": "2788584475", "jobLocation": "Sunnyvale_CA", "jobTitle": "Research Intern, Knowledge Graph", "companyRating": null, "companyInfo": {"Website": "www.oath.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Oath, a subsidiary of Verizon, is a values-led company committed to building brands people love. We reach over one billion people around the world with a dynamic house of 50+ media and technology brands. A global leader in digital and mobile, Oath is shaping the future of media.About Us Oath is a​ dynamic house of media and technology brands that reaches over a billion people around the world. As a center of scientific excellence within Oath, Yahoo Research delivers both fundamental and applied scientific leadership through published research, product innovations, and new technologies powering the company's most significant products.  We pioneer sciences and technologies in information extraction, knowledge management, and information retrieval, supporting innovations in personal communication, search assistance, and content discovery. Our work is innovative and impacts millions of users everyday. Your Day As a research intern, you will apply and advance state-of-the-art techniques in information extraction, knowledge management, and information retrieval.  You will prototype and evaluate new solutions for problems such as: Information extraction on the Web (i.e. table extraction, machine reading, entity type classification, etc.)knowledge base construction from heterogeneous sources (i.e. ontology alignment, entity deduplication, data fusion, QA, etc.)Semantic search (i.e. entity search, recommendation, question answering, etc.) Leveraging your scientific expertise, technical skills, and relevant data, you will: Identify, scope and formulate problemsDesign metrics and experiments to analyze problems and resultsReview state-of-the-art approaches and explore new onesPrototype and evaluate solutions based on goals and metricsGenerate intellectual property via patent applications or publicationsA Lot About YouPh.D. candidate in Computer Science, Electrical Engineering, Statistics, or related fieldExpertise and experience in machine learning, information extraction, knowledge management, information retrieval, as evidenced through solid research projects or publicationsHands-on programming skills in high-level languages such as Java, Scala, Python, or similar.Good communication, collaboration, and interpersonal skills Oath is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on, age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Oath is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. Please let us know if you need a reasonable accommodation to apply for a job or participate in the application process.  Currently work for Oath? Please apply on our internal career site. ​"}