{"jobID": "2524190806", "jobLocation": "San_Jose_CA", "jobTitle": "Management Trainee", "companyRating": "3.6", "companyInfo": {"Website": "www.go.enterprise.com", "Headquarters": "Saint Louis, MO", "Size": "10000+ employees", "Founded": " 1957", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " Unknown / Non-Applicable", "Competitors": " Avis Budget Group, Dollar Thrifty Automotive, Hertz"}, "estimatedSalary": "51000", "jobDescription": " If youre looking to jump-start your career with a clear path to advancement, then the Enterprise Management Training Program is for you. Whether you see yourself in sales, business development, customer service or operations, this program will prepare you to create your ideal career. As a Management Trainee, you can count on a defined career trajectory with a clear beginning and an open end meaning you can take your training and shape your future. And with our promote-from-within philosophy, you will have plenty of opportunities to advance without ever having to change companies.  This position is for our San Jose offices. This position offers targeted annual compensation of $51,000.Responsibilities:As a Management Trainee, youll start learning our business from day one while based out of one of our neighborhood branches. You will be entrusted to serve as both the face of Enterprise to customers and partners and the behind-the-scenes operational expert. In our structured program, you will master the knowledge and skills you need to eventually run your own branch, cultivate new business and develop your team.  In our hands-on learning environment, you will receive the guidance, mentoring, and support you need to be successful. You will also get out into the community and establish the relationships essential to building your own business.  Well teach you how to excel at customer service, sales and marketing, finance, and operations. And youll learn what it means to always put our customers first. Ours is a culture of friendly competition, which is critical to growing our business and your success. Equal Opportunity Employer/Disability/VeteransQualifications:Must be at least 18 years old.Bachelor's degree required.Must have a minimum of six months of face to face sales, customer service or management experience in a sales or service industry. Will consider demonstrated leadership in lieu of work experience including the military, organizations/clubs and/or experience as a college or professional athlete.Must be authorized to work in the United States and not require work authorization sponsorship by our company for this position now or in the future.We willconsider qualified applicants with criminal histories as required by, and consistent with, applicable law."}