{"jobID": "2746289990", "jobLocation": "Mountain_View_CA", "jobTitle": "JD Finance - AI Lab Summer Research Intern", "companyRating": null, "companyInfo": {"Website": "www.jd.com", "Headquarters": "Beijing, China", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Public (JD) ", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Description:JD Finance - AI Lab Summer Research Intern Job Location:Mountain View,USA Job Type:Contract Department:JD Finance Responsibilities: 1) Conduct state-of-the-art research in machine learning, deep learning, computer vision and natural language processing, and publish scientific papers under supervision.  2) Research and evaluate state-of-the-art AI algorithm prototype for our projects.  We are looking for PhD students with the key qualifications: Research field:Computer vision: image classification, detection, segmentation, 3D image modeling, etc.Natural language processing: text labeling and parsing, text understanding, question answering and chatbot dialogue systems, entity extraction and reasoning, etc.Machine learning: deep learning, large-scale optimization, probabilistic inference, etc.Data mining: knowledge/pattern discovery from huge-size, complex dataStrong analytical skills (probability, algebra, optimization, etc.).Ability to quickly prototype with practical algorithms and write high quality code in a programming language (such as Python, C++, Java).Preferred Qualifications:Experiences in developing new algorithms with track record on top journals/conferencesFamiliar with at least one of deep learning frameworks: Tensorflow, Pytorch, Caffe, Mxnet, etc.Self-motivated and eager to learn new things. If you are interested, please send your cv to jd.finance.hiring@jd.com. About JD Finance AI Lab: Located at the center of Silicon valley, deeply believes that AI technology will revolutionize financial products. Our current research areas include deep learning, computer vision, natural language understanding, personalization, recommendation, etc. Our team consists of 10+ world-class AI researchers, led by Dr. Liefeng Bo, who was a leading researcher of Amazon Go. About JD Finance Established in late 2013, JD Finance is one of China's leading fintech companies. It has 10 major business lines: supply chain finance, consumer finance, crowdfunding, wealth management, payments, insurance, securities, rural finance, financial technology and an international business line. As of Jun. 30, 2017, JD Finance has served more than 500,000 corporate clients and 150 million individual consumers. JD Finance leverages its big data and industry-leading technology to provide comprehensive and modularized services to various financial institutions and help the industry to increase revenues, improve efficiency and reduce costs.  JD Finance's technical capability wins global recognition. In Jun. 2017, the company won the award for Credit Risk Technology Implementation of the Year in The Asian Banker Risk Management Awards Programme, being the only Chinese fintech company to receive this honor. In Oct. 2017, JD Finance is the only Chinese enterprise that won the Treasury Award for Excellence 2017 granted by The Economist's EuroFinance."}