{"jobID": "2570000473", "jobLocation": "Los_Angeles_CA", "jobTitle": "Lead Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.zestfinance.com", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "129000", "jobDescription": " The Lead, Data Scientist will lead Zests ML team to deliver technically excellent, highly predictive yet explainable models to drive Zests businesses. The Lead, Data Scientist will also communicate and champion Zests underwriting technologies to external constituencies including conferences, press, and potential clients.  You will lead the team to develop radically new methods for manipulation and prediction that will enable us to provide fair, transparent credit. Using a combination of machine learning technology and vast amounts of data sources, we seek to transform the credit market while expanding our team into interesting and revolutionary frontiers within the credit world. In this role you will:Lead a team of 5+ data scientists in developing high-quality, robust, predictive and explainable algorithms that produce robust and scalable real-time predictionsDefine Zests modeling strategy and manage pipeline for internal and external modeling effortsTranslate unstructured business problems into well-defined machine learning projectsCollaborate with a cross-functional team of Engineers, Product Managers, and Business Analysts to identify and manage high leverage opportunities for modeling workRepresent ZestFinance in calls, meetings, conferences to advance Zests position as the worlds leading ML teamVisibly drive innovation by incorporating new modeling capabilities and/or pioneering data sourcesDevelop and evangelize best practices for scoping, building, validating, and monitoring modeling projectsRecruit, motivate and develop members of the data science teamWe are looking for:Masters/PhD Degree in Math, Computer Science, Statistics, or a related quantitative field.Expert command of statistical analysis, algorithm development, and state-of-the-art tools and methodologies for data science5+ years creating predictive models using advance machine learning techniques2+ years managing a team of data scientistsExpert command of SQL and R or Python as applied to data scienceExperience developing real-time production data pipelinesExperience interacting with external clients is a plus"}