{"jobID": "2806262064", "jobLocation": "New_York_NY", "jobTitle": "Admissions Coordinator", "companyRating": "4.0", "companyInfo": {"Website": "www.interexchange.org", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 1968", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "44000", "jobDescription": "InterExchange Career Training USA, a U.S. Government-regulated program that provides J-1 Visa sponsorship for international students and young professionals to pursue internship and training opportunities in the USA, is seeking an Admissions Coordinator. This position provides the opportunity to gain first-hand knowledge of a J-1 Exchange Visitor Visa program and to work directly with individuals from around the world on a daily basis. This position reports to the Program Manager and Program Director. The Admissions Coordinator oversees the initial intake and review of program applications and supporting documents and serves as the primary point of contact for participants, hosts, and universities/international partner organizations for the Career Training USA program. Additionally, the Admissions Coordinator will assist the team with conducting full application review for J-1 Visa sponsorship, as time permits. The Admissions Coordinator will also participate in special projects, both assigned and proposed, as time permits. As the primary program contact, this position provides significant opportunity to propose creative solutions to improving customer service and streamlining the application process. Interested candidates should be confident and willing to pitch ideas/solutions to the Program Manager and Program Director for improving overall program operations and collaborate with team members, when needed, to execute those ideas.The ideal candidate will firmly support the ideals of cultural exchange, possess exceptional interpersonal communication skills and a professional demeanor, and be a positive and energetic self-starter with strong time management skills. A high level of customer service, patience, professionalism, and attention to detail is required.Please include a resume and personalized cover letter with your application.Responsibilities:Thoroughly understand and comply with the program regulations and internal policies for the Intern and Trainee J-1 Visas (§ 22 CFR--PART 62.22 Trainees and Interns)Collect and data-enter program applications into the FileMaker database; conduct a preliminary review of applications; maintain organization of all incoming documents and payment information; and communicate with relevant parties regarding application status.Conduct full review and render final decisions on J-1 Visa Sponsorship applications, as time permits, and communicate with candidates, employers, and partner organizations as necessaryRecruit, hire, and train Site Visit Representatives; facilitate invoicing with Finance DepartmentLiaise with IT department regarding troubleshooting applicant concerns and suggesting new features to our home-grown online application system; assist IT with testing of new features.Coordinate with Office Services to print and stock program materials; coordinate with program staff to collate and ship acceptance packets, program documentation, and U.S. Government documentation, including Forms DS-2019 and DS-7002 via UPS; monitor accuracy of details within program documents and make suggestions to Program Director for updates/revisions when necessary.Coordinate with Responsible Officer and Alternate Responsible Officers to attain travel validation signatures for program participants’ DS-2019 Forms and manage return shippingField phone inquiries from interested applicants, partner organizations and employers.Other administrative projects, as assigned or proposed.Fiscal Accountability:Business development: Increase participant and host satisfaction through excellent customer service and ease of application process and guidance, allowing us to retain repeat hosts and partners and encourage alumni referrals to future candidatesQualifications:Interested candidates must have prior experience with data entry and customer service within a professional setting. The ability to work both independently as well as part of a team is crucial, as is the ability to be flexible and adaptable and to multi-task and meet deadlines. Prior experience living, studying, or working abroad is required. All candidates must also pass a criminal background check. Physical Demands:Lifting: 0-25 lbsFrequency of lifting: infrequentVisual, Hearing, Dexterity & Mental Demands:Adequate to perform the essential functions of the job such as using a telephone, answering emails, filing paperwork, viewing a computer screen, and operating office equipment.Working conditions:The duties and responsibilities are generally performed in an office environment. The position generally involves frequent standing; continuous sitting; frequent walking; light to moderate lifting; light carrying; frequent bending and reaching; keyboarding and telephone operation; in-person communication.Organization Profile: InterExchange is a private, nonprofit organization with 50 years of experience in international cultural exchange. We are dedicated to promoting international understanding through development and implementation of affordable intercultural and life experiential work/training opportunities. By participating in our programs both in the U.S. and abroad, tens of thousands of young people and their hosts have gained insight into other cultures. InterExchange is designated by the U.S. Department of State to sponsor several J-1 Visa exchange programs including Au Pair USA, Work & Travel USA, Camp USA and Career Training USA. Program participants are placed in the U.S. and abroad by InterExchange in collaboration with international cooperating agencies and government agencies. Additionally, we offer Work Abroad opportunities for Americans seeking similar experience overseas."}