{"jobID": "2789939516", "jobLocation": "San_Jose_CA", "jobTitle": "Relocation Consultant - Silicon Valley", "companyRating": null, "companyInfo": {"Website": "www.relocity.com", "Headquarters": "Los Angeles, CA", "Size": "1 to 50 employees", "Founded": " 2016", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Personal Host - Silicon Valley / San Jose area The Purpose that Drives our Personal Hosts Our clients’ employees are successful people working for today's top, most innovative companies, and who have taken up the challenge of moving to a new city to grow their career. Our Personal Hosts are trusted by our clients and their employees to help them with every aspect of their relocation, including turning an unfamiliar city into their new home.As a Personal Host, you will be supported in managing and driving the entire relocation process: from getting your client moved and settled into their new city, to helping them create a great lifestyle. As a Host, you know your city and you enjoy helping some of the hottest talents from today's best companies get off to a running start in their new role. Typically, clients rate our hosts 5 out of 5, saying that they appreciate having someone who functions as their personal concierge, proactively assisting them and their families with every possible challenge associated with relocating.Relocity is a concierge relocation service to the world’s top companies that is re-thinking the way people relocate. Bringing tech innovation to the relocation industry means our personal hosts earn $40 an hour and work as contractors who manage their own time. They often have backgrounds as personal assistants, concierges or project managers, and are looking for additional income. They also enjoy meeting and helping individuals and families move to a new city in a way that reduces stress. Relocity offers you the training and support to provide an amazing relocation service that is far beyond anything offered by a real estate agent or relocation consultant.That’s why we are growing so fast, and our Personal Hosts are growing with us!Location - Silicon Valley / San Jose. Knowledge of nearby cities like Fremont and Palo Alto is a plus. You need to know the local area well enough to find houses that are a good fit for your clients, as well as the best schools, doctors, restaurants and weekend getaways to create a desireable lifestyle.Working hours - Freelance. You are your own boss with flexible hours. Scheduling is done via our app, which lets your clients know when you are available so they can book hours with you.Compensation - $40 per hour, plus other income opportunities.RESPONSIBILITIES and REQUIREMENTS ***A four-year college degree from an accredited college is required for all roles, and you must have experience moving / relocating to a different city or town***As you are helping top professionals relocate, you won’t just be helping them find a new house to rent/ buy, but also helping them establish a new lifestyle. Some essentials include:Being trustworthy and reliableProven experience in project management and scheduling.Attention to detail and the ability to get complex projects to run smoothlyBeing proactive and taking responsibility so you can handle challenges before they become problemsKnow the greater Silicon Valley / San Jose area, including geography, resources and amenities. Knowledge of nearby cities like Fremont and Palo Alto is a plus. As you are the client's sole trusted consultant on the ground and will be working with them throughout their move, both face to face and remotely, you need to:Speak and write English fluentlyHave a cell phone and a presentable carBe able to maintain a friendly, outgoing, helpful attitude with clients and vendors at all times.Enjoy networking and getting to know new professional peopleEnjoy the satisfaction of helping newcomers to the SF Bay Area feel more at homeAs you are your own boss, you will need toBe expert at time management,Do daily reporting and record keepingBe fully commited to taking responsibility for resultsHave strong ambition and a desire to succeedHave an intensely goal-oriented attitudeHave a commitment to fulfilling contracts on a project-by-project basisBe open for learning and development to grow your career as a Personal Host or into one of our full-time management rolesHave a high level of customer empathyImportantly Being a Personal Host is a great career for someone who desires flexible hours. However, it requires commitment and dedication to fulfilling obligations on a project-by-project basis. Our clients rely on you. We are successful because we have a great professional team that is growing with us.To apply, please visit our site at: https://relocity.com/about/jobs/personal-host-silicon-valleyRelocity is an Equal Opportunity Employer and does not discriminate against any applicant on the basis of race, color, religion/creed, national origin, gender, or sex, marital status, age, disability, use of a guide dog or service animal, sexual orientation, military/veteran status, or any other status protected by Federal or State law or local ordinance. Relocity will only employ those who are legally authorized to work. Any offer of employment is conditioned on the successful completion of a background investigation, credit check and drug test."}