{"jobID": "2797657729", "jobLocation": "Los_Angeles_CA", "jobTitle": "Intern - Summer - Undergraduate - Technology - Entertainment and Media Industry Opportunity", "companyRating": null, "companyInfo": {"Website": "www.21cf.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public (FOX) ", "Industry": " Media", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OVERVIEW OF THE COMPANY20th Century FoxOne of the world's largest producers and distributors of motion pictures, 20th Century Fox Film (TCFF) produces, acquires and distributes motion pictures throughout the world. These motion pictures are produced or acquired by the following units of 20th Century Fox Film: Twentieth Century Fox, Fox 2000 Pictures, Fox Searchlight Pictures, Fox International Productions, and Twentieth Century Fox Animation. During fiscal 2017, TCFF placed 25 motion pictures in general release in the United States. The motion pictures produced and/or distributed by TCFF in the United States and international territories in fiscal 2017 included Hidden Figures, Logan, Jackie, and The Boss Baby. TCFF has released or currently plans to release approximately 23 motion pictures in the United States in fiscal 2018. JOB DESCRIPTION Fox is proud to support a culture of creativity, entrepreneurial spirit and community that attracts the industrys brightest talent. The Fox Internship Program offers an exciting opportunity for you to gain practical experience while interning for one of the biggest media and entertainment companies in the world. You will have the opportunity to participate in real-world projects, which provides valuable work experience and leadership skills.  The Fox Internship Program provides mentoring and learning opportunities to help you develop your skills, network with Fox employees, and learn more about what its like to work in the entertainment industry.  Department Overview  Opportunity to intern with a technology group within the CTO organization. The department is involved in the evaluation of new technologies for presenting Fox content and the distribution of that content to the consumer. The team evaluates these new technologies and prepares for transfer from R&D; into the production environment. The intern will: Participate in Machine Learning projects covering data, AI and cloud  Build development/test models, analyze data and performance  Contribute to development efforts (Python, PHP, JavaScript)  Read/Write technical documentation  Aid with review of English-Spanish translations Qualifications: BS degree in Engineering, Computer Science, or related disciplines  Knowledge of software engineering lifecycle support (requirements, design, implementation, testing)  Knowledge of AI and machine learning models  HTML / CSS, Python, PHP, or JavaScript language experience  Bilingual, strong verbal and written communication skills in both English and Spanish  Good analytical, problem solving, and interpersonal skills.  Self-motivated and resourceful, demonstrated ability to conduct accurate and timely research  To participate in Foxs Internship program you must meet the following criteria:  Applicants must be enrolled full-time in an undergraduate or graduate degree program at an accredited university and be sophomore status or above.  Be eligible to work in the United States without sponsorship by the Company.  Housing is not provided, so please have a housing option guaranteed before applying. Application Process: Please submit a resume and a cover letter detailing your qualifications.  We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, gender identity, disability, protected veteran status, or any other characteristic protected by law. We will consider for employment qualified applicants with criminal histories consistent with applicable law."}