{"jobID": "2776788916", "jobLocation": "New_York_NY", "jobTitle": "Business Analyst Intern", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " We believe in the power of data to transform how people make decisions. Our data and products help our broad array clients - leaders of progressive political campaigns and Fortune 100 companies - to make better decisions around buying TV advertising.  We're looking for someone for our internship program with a strong predisposition to analysis who wants to explore a potential career in business analytics. We'll teach and explain concepts to you, and you'll in turn be able to help explain these ideas to our clients. Core responsibilities would be to make and deliver clean and informative presentations and summaries for our broad range of clients.  You're the kind of person who: Loves to learn - you can't fit enough classes into your course load and are continuously reading about new disciplinesConstantly consumes information (breaking news, technology developments, the works)May have built a spreadsheet to evaluate an important life decisionRequirementsDesire to learn and developAttention to detail, pride in high-quality workFamiliarity with fundamentals of statistics and analysisStrong written and verbal communication skillsSuccinct writingPowerPoint (not just familiar, but strong)Word (not just familiar, but strong) Things that will make us really excited Excel (for data analysis and creating clean tables for presentations)Background or coursework in Business/ Economics/ StatisticsPrevious internship in marketing or consultingFamiliarity with basic tools for statistics and analysis (SQL, Python, R)Data visualization (Tableau, R)BenefitsJoin a mission-aligned team dedicated to delivering outstanding work to clients and fostering individual growthWork that provides structured projects that introduce, develop, and hone relevant industry skills, while also giving space for self-directed and collaborative exploration of new ideas, tools, and skillsExposure to a variety of high-impact business problemsEasily accessible location in Flatiron, just a few blocks from Union SquareA kitchen stocked with soda, yogurt and other snacks"}