{"jobID": "2565231983", "jobLocation": "New_York_NY", "jobTitle": "Consulting Senior Associate - RAS Bank Regulatory Compliance", "companyRating": null, "companyInfo": {"Website": "www.rsmus.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1926", "Type": " Private Practice / Firm", "Industry": " Accounting & Legal", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We are seeking an experienced consultant with AML Model Validation experience in our New York City office, who will execute technical and data validation related activities for model validation, system/technology implementation, and other related projects in the Bank Secrecy Act (BSA) / Anti-Money Laundering (AML), Sanctions, and regulatory compliance domain. This will role will focus on our financial institution clients, including banks, broker-dealers, asset management, and other financial services organizations. The Consultant will be responsible for assisting in the evaluation of the underlying technical processes and data for BSA/AML, Sanctions, and other regulatory compliance models to assess that they contain accurate and complete data and are functioning as intended. In addition to model validation work, the consultant will focus on independent testing, risk assessments and look-back engagements. Responsibilities Include:Work individually or as part of a team to provide project execution on client engagementsContribute to strong client relationships through positive client support and sound expertiseDemonstrate expertise in BSA/AML and Sanctions including model validation, BSA/AML program independent testing, and other BSA/AML advisory services  Supervise junior staff and serve as engagement in-chargeUsing proven tools and techniques, execute project deliverables in a manner consistent with our client's business objectivesBasic Qualifications:Experience with BSA/AML and sanctions requirements for financial institutions and ability to apply risk-based concepts to a variety of client scenariosExperience with data analysis, data integration and data validation activities with financial institutions.Experience using or analyzing common suspicious activity monitoring and sanctions screening systems.Experience developing written summary and analysis of technical testing and AML model validation activities.Experience with SQL, Microsoft Excel, Microsoft Access, R, and/or reporting and analytics tools.Ability to communicate and work with information technology (IT) personnel.Ability to gather and manipulate data from disparate sources and forms.Strong analytical, attention to detail, and organizational skillsBachelor's degree in Finance, Accounting or related business field of studyPrevious experience working in a consulting or professional services environmentWillingness to travel up to 60% of time annuallyMinimum 3 years of experience in a professional services firm, financial institution or financial institution regulatory agencyPreferred Qualifications:CAMS or equivalent certificationExperience working with or for financial institutions with international and/or private banking services.Excellent verbal, written and interpersonal communication skillsAbility to work individually or in small project teams; collaborate You want your next step to be the right one. You've worked hard to get where you are today. And now you're ready to use your unique skills, talents and personality to achieve great things. RSM is a place where you are valued as an individual, mentored as a future leader, and recognized for your accomplishments and potential. Working directly with clients, key decision makers and business owners across various industries and geographies, you'll move quickly along the learning curve and our clients will benefit from your fresh perspective.  Experience RSM US. Experience the power of being understood.  RSM is an equal opportunity/affirmative action employer. Minorities/Females/Disabled/Veterans. "}