{"jobID": "2756017660", "jobLocation": "Redwood_City_CA", "jobTitle": "Staff Systems Engineer - Advanced Development", "companyRating": null, "companyInfo": {"Website": "www.aurishealth.com", "Headquarters": "Redwood City, CA", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job Title: Staff Systems Engineer Advanced Development  Location: Redwood City, CA  Classification: Full-Time, Exempt  Auris is a technology company defining the future of medical intervention. By combining advancements in medical robotics, instrumentation, navigation and data science, Auris is building a platform technology capable of expanding the applicability of robotics to a spectrum of medical procedures.  Overview  The Staff Systems Engineer will have a leadership role in the requirement and design efforts of Auris most advanced robotic surgical system. The Engineer will apply interdisciplinary systems engineering approach to requirement management, risk management, architecture, as well as design, development, and verification processes, on system-level and subsystem-level of the robotic surgery platform. In addition, the Engineer will be expected to contribute significantly to establishing standard procedures and good engineering practices of above activities in the team, to meet all safety and regulatory compliance.  Core Job Responsibilities Work across engineering teams to create, verify, manage, and track system- and subsystem-levels of requirements and specificationsWork with HW and/or SW teams to lead risk analysis, design FMEA, and identify proper risk mitigation solutions to the complex robotic surgical system and subsystemsProvide technical leadership in system integration, testing, verification, and improvementsEnsure systems design and documentation meet all safety and regulatory complianceContribute significantly to establishing the best engineering practices in the full product development cycle for the entire teamOther related duties as may be assigned  Required Knowledge/Skills, Education, And Experience  • Required: systems engineering lead with at least bachelors degree in STEM and 5+ years of work experience in medical devices or other highly regulated industriesDesired: Advanced degree in systems engineering, robotics, mechatronics, or controlExperience through full product development cycle of complex electromechanical systems, from initial concept to release to marketStrong understanding of systems, mechatronics, and software integrationExpertise in design and development processes that conform to standards, including IEC 60601, ISO 14971, IEC 62304, etc., and ability to work in a regulated environment in compliance to ISO 13485 and 21 CFR 820Demonstrated technical leadership and issue ownership; proven ability of analytical problem solving and troubleshooting; ability to provide guidance and direction to less experienced technical personnel requiredExpertise in medical robotic systems is a big plus  Work Environment This position operates in a professional office environment. This role routinely uses standard office equipment such as computers, phones, and photocopiers.  Physical Demands  The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.  While performing the duties of this job, the employee is regularly required to talk or hear. The employee frequently is required to stand, walk; use hands to finger, handle or feel; and reach with hands and arms.  Position Type and Expected Hours of Work  This is a full-time position. Days and hours of work are flexible Monday through Friday, generally 8:30 a.m. to 5:30 p.m. Occasional evening and weekend work may be required as job duties demand.  Travel  This position may require occasional travel outside the local area and overnight and some of the travel may be international."}