{"jobID": "2759555369", "jobLocation": "Milpitas_CA", "jobTitle": "Maintenance Supervisor", "companyRating": "3.5", "companyInfo": {"Website": "www.essexapartmenthomes.com", "Headquarters": "San Mateo, CA", "Size": "1001 to 5000 employees", "Founded": " 1971", "Type": " Company - Public (ESS) ", "Industry": " Real Estate", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " AvalonBay Communities, Equity Residential, Irvine Company"}, "estimatedSalary": "85000", "jobDescription": " The person in this position is responsible for all maintenance aspects of the community’s operations and objectives. Accountable for: operating the property budget with the primary objective of increasing the Net Operating Income (NOI), maintaining the physical asset, providing a quality living environment for residents, and establishing a positive and productive working relationship with the staff. Depending on asset size and staffing level, the person in this position may be required to be “on-call” for after-hours emergencies. This position reports to the Community Manager or Sr. Community Manager.  Key responsibilities of this position include, but are not limited to the following: Oversees the day-to-day maintenance operations of the community, including but not limited to: work orders, unit turns, curb appeal, vendor and inventory management, and preventative maintenanceMaintains cost per turn within budget & ensure make ready days are 7 days or less or as defined by Regional Manager (for renovation properties)Manages expenses closely and within budget, communicates any overages in advance, actively pursues expense savings.Manages and/or facilitates capital and renovation projects, collaborating with corporate departmentsEffectively manages personnel throughout their employment lifecycle, i.e., selection through separation. This includes candidate selection, career planning and development, accountability and performance management, and recognitionMaintains the highest level of customer service for prospects, residents, vendors, and corporate departmentsCompliance with company standards as defined in the Human Resources Policy Manual, Operations Playbook and applicable laws, e.g., Fair Housing, Landlord Tenant, Local Building Codes, OSHA, and EEOCHigh school diploma or equivalent, college and/or trade school preferredRelevant certification (e.g., HVAC, CPO) strongly preferredTwo to five years property management experience preferred or related management experienceProven ability to supervise staff of two or more associatesProficient knowledge of electrical, plumbing, and appliance repair with hands on experienceKnowledge of environmental/industrial hazards (i.e., asbestos, lead, mold, radon) as they apply to residential housingProven organizational and time management skillsValid driver license and automobile insuranceAbility to read and write English; speak English and understand spoken EnglishCompetent understanding of the Microsoft suite, property management software preferred PHYSICAL REQUIREMENTS"}