{"jobID": "1792098000", "jobLocation": "New_York_NY", "jobTitle": "Associate Chief of Emergency Medicine", "companyRating": null, "companyInfo": {"Website": "www.pagny.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Overview ASSOCIATE CHIEF OF EMERGENCY MEDICINENYC Health + Hospitals/MetropolitanPhysician Affiliate Group of New York (PAGNY) is comprised of nearly 4,000 physicians and healthcare professionals who provide services to NYC Health + Hospitals Corporation (H + H), the largest public health system in the United States. Our practitioners are highly skilled professionals with outstanding credentials who deliver the highest level of quality healthcare to patients throughout New York City.  We are currently seeking a Board Certified Physician with superior leadership qualities to play an integral role in the daily operations in NYC Health + Hospitals/Metropolitan thriving Emergency Department. Located in a pleasant Upper East Side Manhattan neighborhood, NYC Health + Hospitals/Metropolitan is a full-service, acute care hospital emphasizing primary care medicine and utilizing the latest advances in medical science. Known for being the first hospital in East Harlem to be designated by the New York State Department of Health (NYSDOH) as an official Stroke Center, NYC Health + Hospitals/Metropolitan prides itself on delivering culturally-sensitive, compassionate, appropriate and affordable medical care to the diverse neighborhoods and communities of northern Manhattan. ResponsibilitiesProviding utilization review and denials managementActing as a liaison to Physician AssistantsOverseeing the Physician Assistants’ and Attending’s’ scheduleCoordinating Residents’ schedulesEnsuring maintenance of Stroke Center CertificationAssisting and participating in community outreachInvestigating patient complaints, customer service and recoveryParticipating on the Pharmacy and Therapeutics CommitteesQualificationsCurrent NYS licenseGraduate of an accredited medical collegeBoard Certified in Emergency Medicine (ABEM)Bilingual Spanish is a plus! We offer a competitive salary and a comprehensive benefits package. For immediate consideration, please email your CV to tristines@pagny.org, or apply online at: www.pagny.org EOE M/F/D/V"}