{"jobID": "2768374821", "jobLocation": "New_York_NY", "jobTitle": "Execution Trader", "companyRating": null, "companyInfo": {"Website": "www.worldquant.com", "Headquarters": "Old Greenwich, CT", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Execution TraderWorldQuant develops and deploys systematic financial strategies across a variety of asset classes and global markets. We seek to produce high-quality trading signals (Alphas) through our proprietary research platform to employ trading strategies focused on exploiting market inefficiencies. Our teams work collaboratively to drive the production of Alphas and financial strategies the foundation of a sustainable, global trading platform.WorldQuants success is built on a culture that pairs academic sensibility with accountability for results. Employees are encouraged to think openly about problems, balancing intellectualism and practicality. Great ideas come from anyone, anywhere. Employees are encouraged to challenge conventional thinking and possess a mindset of continuous improvement. Thats a key ingredient in remaining a leader in any industry.Our goal is to hire the best and the brightest engineers. We value intellectual horsepower first and foremost, and people who demonstrate an exceptional talent. There is no roadmap to future success, so we need people who can help us create it. Our collective intelligence will drive us there.The Role:Handle execution across equities, FX, Futures and other asset classes.Monitor automated execution flows and pursue improvements to reduce the cost of implementing WorldQuants models.Advise on algorithmic execution methods through an understanding of the underlying market structure.Analyze large data sets to guide further automation and refinement of execution.Interface directly with portfolio managers, brokers, senior management, compliance, risk and many other teams.What Youll Bring:Degree in a quantitative or technical discipline from a top tier institutionExperience in Scripting languages, Statistical analysis languages, Databases, and Linux a strong plusExperience with electronic Equities, FX and Futures trading a strong plus"}