{"jobID": "2814722128", "jobLocation": "San_Francisco_CA", "jobTitle": "Marketing Analyst Intern", "companyRating": "3.5", "companyInfo": {"Website": "www.allscripts.com", "Headquarters": "Chicago, IL", "Size": "5001 to 10000 employees", "Founded": " 1986", "Type": " Company - Public (MDRX) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Cerner, Epic, Athena Health Care Systems"}, "estimatedSalary": "55000", "jobDescription": " Would you like to join Practice Fusion, an Allscripts company, as we work together to reshape the future of healthcare? We are on a mission to help small, independent practices thrive by offering best-in-class, affordable products that allow them to focus on what matters most – caring for their patients.  Practice Fusion is a leader in the electronic health record space with over 80 million patients served by doctors using our platform. Our award-winning, cloud based ambulatory EHR platform helps physicians thrive in an increasingly complex world by coordinating patient care.  In this versatile role you will plan, organize, and execute a wide variety of marketing projects for the Payer Life Science business. You will work cross functionally with Marketing, Product, Customer Success, Life Sciences, and Legal. You will perform tactical responsibilities such as reviewing copy, creating digital assets, and tackling new tasks and challenges as the business evolves. It is an exciting role to gain exposure to all components of marketing strategy including content marketing, user acquisition, product marketing, SEO, PR and more. Develop in-depth understanding of various types of marketing campaignsUnderstand various success metrics across the funnel and use them to analyze past campaignsManipule data into useful business insights that can be used to drive future marketing strategyAssist campaign reporting and analysis across email, in-product, and web communication channelsCreate content for various social media channels including, Twitter, Facebook, LinkedIn, Google+Collaborate with various Marketing stakeholders to detail scope, and manage deliverables, required resources and timing Academic and Professional Qualifications:  Pursuing a BA/BS degree in Business, Marketing, Communication or related major Experience: Strong attention to detail; excellent verbal and written communication skillsSelf-motivated, desire to learn and work in a fast-paced environmentSome experience in Excel preferredStrong record of academic excellence Travel Requirements:  None Working Arrangements: Work is performed in a standard office environment with minimal exposure to health or safety hazards At Allscripts, our greatest strength comes from bringing together talented people with diverse perspectives to support the technology needs of 180,000 physicians, 1,500 hospitals and 10,000 post-acute organizations across the globe. Allscripts offers a comprehensive compensation and benefits package, including holidays, vacation, medical, dental, and vision insurance, company paid life insurance and retirement savings.  Allscripts’ policy is to provide equal employment opportunity and affirmative action in all of its employment practices without regard to race, color, religion, sex, national origin, ancestry, marital status, protected veteran status, age, individuals with disabilities, sexual orientation or gender identity or expression or any other legally protected category. Applicants for North American based positions with Allscripts must be legally authorized to work in the United States or Canada. Verification of employment eligibility will be required as a condition of hire.  From a \"VEVRAA Federal Contractor\" We request Priority Referral of Protected Veterans"}