{"jobID": "2819630300", "jobLocation": "Oakland_CA", "jobTitle": "Account Manager", "companyRating": null, "companyInfo": {"Website": "www.carhop.com", "Headquarters": "Edina, MN", "Size": "201 to 500 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Imagine walking a mile every time you need groceries, struggling to find a job near your home simply because you dont have a car, never knowing how to get your kids to and from school; these are the struggles our customers encounter on a daily basis.  CarHop has helped thousands of people with credit issues find a vehicle, improve their situation and turn their lives around. Were seeking someone who is passionate, motivated, and has an interest in helping others!  Based in one of our retail store locations, the Account Manager position is responsible for counseling and assisting our current customers in determining their best payment option(s) in an effort to bring their existing auto payments current, both over the phone as well as working with customers face-to-face in the branch. Responsibilities/Expectations Key duties of the Account Manager include (but are not limited to): Placing outbound calls & accepting inbound calls from CarHop/UAC customersFace to face interaction with customers regarding the status of their auto loanUtilizing your communication and negotiation skills to resolve the delinquent accountWhat makes a career with CarHop different? ·  Competitive compensation package including: Guaranteed hourly payPerformance-based bonuses- great additional earning potential!Full health benefits (Medical/Dental/Vision)401 (k) w/ an aggressive company matchPaid time off and great work/life balance 2 days off per week Closed Sundays Branch locations close at 7:00pmOpportunity for advancement- CarHop is a growing company!A fun work environment filled with awesome people!A rewarding job experience helping people drive & changing lives!We give you the tools you need to succeed with regular training and coaching!RequirementsHigh school diploma or equivalent.Previous customer service experience, face-to-face or call center, is preferred, but not required.Specific experience in the area of de-escalation, retention, or issue resolution is helpful.Strong/Advanced negotiation, counseling and problem solving skills.Must successfully complete pre-employment criminal background inquiry, and results must be consistent with company standards. This could be the beginning of a rewarding career in Customer Service & Account Management! If you would like to be considered for this role, simply click \"Apply Now!\"  CarHop is an Equal Opportunity Employer."}