{"jobID": "2805512481", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Intern, Microbiology Data Analysis", "companyRating": null, "companyInfo": {"Website": "www.secondgenome.com", "Headquarters": "South San Francisco, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Hi, we’re Second Genome. We are a fast-paced and innovative venture-backed biotechnology company developing tomorrow’s breakthrough therapeutics at the interface of complex microbial communities and their host environments. We are leaders in microbial ecology, metagenomics, and computer science. We love fresh approaches, we value process validation, and we welcome peer review. And we’re looking for a Microbiome Data Analysis Intern. We’re on the search for a computer scientist, data scientist, or computational biologist with a passion for tackling new challenges. We’d love to work with someone who is personally driven but comfortable not having all the answers; resourceful when working toward goals; accepting of the changing demands of the industry environment, and a natural multi-tasker. We deeply value team players who understand the importance of communication and the balance between compromise and assertion. Responsibilities and DutiesGain familiarity with microbiome datasets from Inflammatory Bowel Disease (IBD) used for this project.Survey and summarize clinical metadata.Determine statistical power of datasets subset by different clinical metadata features.Integrate datasets to facilitate cross-study meta-analyses with defined clinical metadata features.Visualize and communicate analysis results and conclusions.Qualifications and SkillsMicrobiology background with experience in statistics or computational biology.Proficiency in R.Experience in analysis of 16S rRNA datasets.Knowledge of multivariate statistics for 16S analysis of microbial communities.Understanding of disease-related patient metadata.Bonus QualificationsFamiliarity with RStudio.Know-how of executing bioinformatics tools and implementing bioinformatics pipelines (especially for 16S analysis).Familiarity with Amazon cloud computing.Experience with datasets related to Inflammatory Bowel Disease (IBD).Practical wet lab experience regarding sample preparation for sequencing.What’s it like to work at Second Genome? In addition to our ground-breaking technology, we believe in embodying an authentically joyful workplace. Our Core Values: We are InnovatorsWe are Driven to ActionWe are Great ColleaguesWe Work SmartWe Respect the Data We understand and appreciate the hard work and emotional investment on the part of all our team members - it takes a lot to be a contributor at a startup that’s leading its industry. We make it a priority to mindfully design our work environment and employee offerings with our unique and dedicated team in mind. Fully stocked kitchen with sandwich materials, organic snacks, coffee (Peet’s or Stumptown - take your pick!) and beverages.Our WellBiome health and wellness program: open standing desks, and weekly boot camp and yoga classes on-site.Apple computer + all its fancy accessoriesFriendly and open office environment with great colleagues and an intentional culture that drives innovation, passion, collaboration, and fun!A picture is worth a thousand words. Check out our Instagram @secondgenomelife for a glimpse into our unique team culture. Second Genome provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Second Genome complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training."}