{"jobID": "2824714500", "jobLocation": "San_Francisco_CA", "jobTitle": "Research Data Analyst III", "companyRating": "3.9", "companyInfo": {"Website": "www.ucsf.edu", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1864", "Type": " College / University", "Industry": " Unknown", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "89000", "jobDescription": "Research Data Analyst III12-Jun-2018Job Code and Payroll Title6257 Research Data Analyst III Job SummaryJOB OVERVIEWThe Research Data Analyst reports to the Director of Research in Career Education and is responsible for conducting a research project to identify some of the barriers to diversity at R1 institutions. Specifically, the Research Data Analyst will study some of the obstacles reported by UCSF biomedical graduate students, postdoctoral scholars, and City College of San Francisco (CCSF) biotechnology interns involved in the CCSF-UCSF Collaboration, either through the CCSF Biotechnology Internship program or the UCSF Mentor Training Program. The Research Data Analyst will be responsible for conducting a thorough literature review of the field of mentoring in biomedical sciences, and assist the Director of Research in Career Education in identifying the theoretical frameworks that best relate to the goals of the study. The Analyst will also be responsible for developing an interview protocol and data analysis plan, and interfacing with the UCSF Committee on Human Research (CHR) office to update the Institutional Review Board (IRB) application. The Analyst will recruit CCSF students and interns as well as UCSF graduate students and postdoctoral scholars, and conduct the interviews in-person or online. The Analyst will be responsible for managing the recording of interviews, interfacing with transcription services to transcribe recordings, and manage records and data in compliance with IRB requirements. The Analyst will also analyze data, synthesize findings in a report, and assist the Director of Research in Career Education in communicating the report findings, through conference presentations and by developing a manuscript. Please Note: This is a 50% contract position that will end on July 1, 2019. The location: Mission Bay / Remote. OFFICE OF CAREER AND PROFESSIONAL DEVELOPMENTThe goal of the Office of Career and Professional Development (OCPD) is to help UCSF biomedical and health science trainees build skills necessary for pursuing careers rich in scholarship, leadership, and discovery. This growing and dynamic office provides programs, services, individual assistance, and web and print resources, all designed to enhance the academic, professional, and career development of our students and post-graduate trainees. The OCPD also conducts research to develop evidence-based interventions, with the goal of supporting diversity in the biomedical workforce.ABOUT UCSF The University of California, San Francisco (UCSF) is a leading university dedicated to promoting health worldwide through advanced biomedical research, graduate-level education in the life sciences and health professions, and excellence in patient care. It is the only campus in the 10-campus UC system dedicated exclusively to the health sciences.OrganizationCampusReq Number49777BRLocationMission BayJob TitleResearch Data AnalystAppointment TypeContractPercentage50%Shift LengthOtherShiftDaysWork DaysMonday - Friday, 8:00 am - 12:00 pm (days/hours variable to fit needs)Required Qualifications• Bachelor's degree in related area and three to five years of directly related work experience, or equivalent experience / training• Thorough knowledge of qualitative research methodologies• Experience documenting research processes• Experience with experimental design for qualitative research• Experience collecting qualitative interview data• Demonstrated experience working with a broad range of systems and software on a regular basis, and the knowledge of, or ability to, learn a variety of technology, including Google Drive, UCSF Box, Skype, Zoom, Drupal, Qualtrics, and UCSF’s Collaborative Learning Environment, etc.• Strong analytical skills to perform data analysis of qualitative data• Project Management skills; consulting skills• Experience working in a team environment and independently• Demonstrated good judgement in selecting research methods to attain goals• Demonstrated ability to plan data analysis process• Demonstrated ability to learn to use new technology• Demonstrated interpersonal skills to work with different work stylesPreferred Qualifications• Master's degree in related area and / or equivalent experience / training• Experience working with iRIS and the Institutional Review Board (IRB)• Knowledge of bibliographic software (for e.g. Mendeley, Paperpile)• Proficiency with bibliographic review and synthesis• Experience developing and administering surveys and analyzing survey data• Experience using SPSS or other statistical software• Experience with survey design and creation using Qualtrics, including branching logic• Strong written, verbal and interpersonal communications skills with experience clearly and effectively interacting with diverse groups of individuals at all levels within an organization• Experience composing reports, correspondence, and summaries in a comprehensive and organized format• Experience writing reports of scientific contents for publication• Knowledge of education research, science education research or professional development research fieldsLicense/Certificationn/aPosition TypePart TimeDepartment NameOffice of Career & Professional DevelopmentEqual Employment OpportunityThe University of California San Francisco is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, protected veteran or disabled status, or genetic information."}