{"jobID": "1968269465", "jobLocation": "New_York_NY", "jobTitle": "High School History Teacher", "companyRating": null, "companyInfo": {"Website": "www.successcareers.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2006", "Type": " School / School District", "Industry": " Education", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "As the fastest growing, highest-performing charter school network in New York State, Success Academy has reimagined public education. Nationally recognized for achieving outstanding academic results for students from all backgrounds and zip codes, we have created an innovative K-12 school model that is preparing current and future generations of children with the subject mastery and skills to succeed in college and life. We now need leaders with an entrepreneurial spirit and a high standard of excellence to join our high school community, and propel our efforts to put thousands of New York City kids on a trajectory of educational excellence.The Success Academy High School of the Liberal Arts is our flagship high school, offering a rigorous and engaging academic experience to scholars prepared by our elementary and middle school programs. We are set apart by our intensive focus on college persistence, ensuring that our mainly minority and low-income students gain not only admission to college, but also the skills to flourish in and graduate from college in four years. We now need a results-driven High School History Teacher to join our school communityKey responsibilities include:Building a classroom culture in which students love history;Engaging students through a four-year world history sequence that integrates social science, politics, and anthropology;Fostering inquisitiveness as students grapple with the concepts of empire, expansion, inequality, and modernity;Driving academic outcomes by analyzing student work and studying data, and implementing high leverage instructional moves to ensure dramatic gains for all students; andTraining with colleagues and school leaders to receive targeted, in-the-moment feedback on instruction, as well as unparalleled support and professional development.Experiences and Qualifications:Have lead teaching experience, preferably in history, with a proven record of propelling student intellectual growth;Hold a Bachelor’s degree with an outstanding record of academic achievement and leadership;Are a person of high moral character; andAre passionate about history and learning.To join our team, please upload a cover letter and resume that outlines your candidacy. Your cover letter should explain in detail your qualifications for the position. Resumes without cover letters will not be reviewed.Success Academy Charter Schools is an equal opportunity employer and actively encourages applications from people of all backgrounds. Compensation is competitive and commensurate with experience. Success Academy offers a full benefits program and opportunities for professional growth.Apply"}