{"jobID": "2821630039", "jobLocation": "Redmond_WA", "jobTitle": "Jr. Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.excell.com", "Headquarters": "Bellevue, WA", "Size": "201 to 500 employees", "Founded": " 2001", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Kforce, TEKsystems, Robert Half"}, "estimatedSalary": "49000", "jobDescription": " Youre covered with eXcell. We offer our temporary employees full benefits. Always have. Always will. Join us!  Our client is the worlds software leader seeking a Jr. Level Data Analyst to execute project work. Responsible for:Data de-duplication: matching and merging dataData cleansing: matching, linking, updating records, such as organization records, in batch and real timeHierarchy management: identifying, creating, correcting, update, and maintaining complex relationships among parent and child recordsData conversion: changing / transforming the data based on business rules, usually done before the data is integrated into a new systemRaising escalations and communicates issues to Project Lead * * * Local Candidates Only * * * Non-Local candidates will be rejected without consideration. Relocation assistance is not on offer. Qualifications:2-3 years of job experience, preferably in some sort of analyticsUndergraduate or Master studies student with high GPAExcel (pivot tables, vlookup, some coding)SQLProficiency in English (verbal and written)Advanced computer literacyTeam-oriented attitude and excellent interpersonal skillsCommitment to accuracy, quality and attention to details W2 only, no Corp to Corp. We are unable to sponsor H1B visas at this time. **eXcell Supports Equal Employment Opportunity** eXcell, a division of CompuCom® Systems, Inc., a global company headquartered in Bellevue, Washington, provides IT staffing services and solutions to Fortune 1000 companies as well as small and medium business. For more information, visit www.excell.com."}