{"jobID": "2250810940", "jobLocation": "San_Francisco_CA", "jobTitle": "Scientific/Technical Analyst Intern (LA, PA, SD, SF, VA)", "companyRating": "3.8", "companyInfo": {"Website": "www.mofo.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 1883", "Type": " Private Practice / Firm", "Industry": " Accounting & Legal", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Latham & Watkins, Orrick, Pillsbury Winthrop Shaw Pittman"}, "estimatedSalary": "52000", "jobDescription": "Position: Patent Prosecution Analyst Intern Office: Office Location FlexibleExperience: 0 Years of ExperienceIdeal CandidateWe are seeking Patent Prosecution Analyst Interns in the Los Angeles Office, Northern Virginia Office, Palo Alto Office, San Diego Office and San Francisco Office . The ideal candidate will have a strong interest in: Preparing and prosecuting patent applicationsContributing to prosecution strategyProviding technical and legal research and analysis with respect to matters pending before the U.S. Patent and Trademark OfficeProviding technical support for patent interference and litigation proceedingsStrong technical background in engineering, life sciences, chemistry or medicine (graduate level preferred for life sciences, chemistry and medicine).Outstanding writing and analytical skills, and top academic credentials are essential.Internship period – 3 to 6 months, full-timeCandidate must be within 12 months of graduating and must complete their internship prior to graduating.Who We AreOur firm has a long standing commitment to our culture and diversity. We encourage you to learn more about who we are , and what we do . Should you find you’re ready to do the best legal work of your life, we encourage you to let us know! We are not accepting agency submissions for this position. Apply for this Position If you are a new applicant, click the \"Apply for this Position\" button. If you are a returning applicant and you have previously applied to a position or registered on our website, login to access your existing applicant data. Click the \"Add to My Jobs\" button to begin the application process. If you do not see the \"Add to My Jobs\" button, it means you have already applied for this job and we have your application on file. You may only apply to each job once."}