{"jobID": "2711475931", "jobLocation": "Seattle_WA", "jobTitle": "Sr. Data Analyst, Customer Journey Analytics", "companyRating": "3.7", "companyInfo": {"Website": "www.jpmorgan.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1799", "Type": " Company - Public (JPM) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "79000", "jobDescription": "Sr. Data Analyst, Customer Journey AnalyticsCCB’s Customer and Marketing Analytics group is looking for a talented, highly motivated individual with strong data analysis skills, data visualization expertise, and strategic thinking to join its Customer Journey Analytics program. This individual will work cross functionally with individuals across Consumer & Community Banking to provide analyses, insights, and strategic direction for initiatives that will improve and transform the experience for our customers. Customer Journey Analytics has the ability to significantly enhance our decision-making for CCB’s highest priorities (e.g., banker service reduction, call reduction, complaint mitigation) by connecting our massive and disparate cross-channel data. It gives us the ability to analytically trace root causes of specific customer outcomes (both good ones like an acquisition and bad ones like attrition, negative NPS) in hours and with minimal manual effort.Key ResponsibilitiesAs the Sr. Data Analyst on the Customer Journey Analytics team, the successful candidate will:Apply critical thinking and data analysis skills using our Customer Journey Analytics platform to develop robust journey insights and recommendations that drive change.Work with line of business partners to understand and document the data generated by their interaction systems and customer life-cycle events.Deliver strong business results through the successful application of continuous improvement principles across core customer journeys. Prioritize analyses, develop tactical approaches, and manage analyst work streams.Establish processes, document methodologies, benchmarks and key learnings for Customer Journey AnalyticsDeliver executive-level presentations that communicate business relevance of the analysis performed and recommended solutions.Qualifications:7-10 years of experience using industry standard Extract Transform and Load (ETL) applicationsExperience with new big data technologies. (Greenplum, Hadoop)Experience using Tableau or other BI tools Experience with SAS, R, and/or other data mining tools.Demonstrated relationship management skills with business partners in various lines-of-businesses, operations and IT partners with successful record influencing and leading critical business initiatives.Excellent communication, presentation and interpersonal skills to convey analytic findings, strategic implications and actionable recommendations to all levels of management and partners.Proven ability to work in a fast paced environment, meet deadlines, and perform at high standards with limited supervisionProven critical analytical and strategic skills, including the ability to quickly assimilate new information.Ability to present fact-based recommendations in a clear, logical, and concise way; “tell a story” with dataMaster’s or Bachelor's degree with equivalent work experience in Analytics/Business Intelligence fields. (Mathematics, Statistics, or related discipline)"}