{"jobID": "2806200887", "jobLocation": "San_Francisco_CA", "jobTitle": "Executive Assistant", "companyRating": null, "companyInfo": {"Website": "www.fountain.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job DescriptionFountain is looking for an Executive Assistant who will play a key role in enabling the success of a fast-growing startup. You enjoy working in a constantly changing, fast-paced environment, with passionate team members. You are focused on quality and execution and can serve as a trusted partner to the CEO in how he prioritizes his day. You will report to the CEO and help him tackle day-to-day tasks that keep him on track. This role offers exposure to different areas of tech, requires cross-functional collaboration with the leadership team, and opportunities to drive special projects and strategic initiatives for the company.ResponsibilitiesServe as the point of contact between the CEO and his internal and external partners, managing his communications and routing correspondence appropriatelyAct as the gatekeeper to his time by managing his meeting and appointmentsProduce reports, presentations, briefs and detailed notes for the CEO, ensuring preparation and follow-up for his all his meetingsCoordinate travel arrangements for the CEO and other executives for work-related travelLearn the mechanics of how each business unit at Fountain operates by working on special projects with other team leads.RequirementsProven experience as an executive or administrative assistantDiscretion and ability to maintain confidentiality around all company informationAbility to move quickly and make on-the-spot decisions without sacrificing attention to detailStrong Dropbox, Microsoft Suite and Google apps skills and familiarity with office productivity tools such as Slack, Calendly, and Zoom.Exemplary planning and time management skills with an ability to multitask and prioritizeStrong verbal and written communications skills, proficiency in EnglishCollege degree; additional qualification as a personal assistant would be considered an advantageAbility to maintain composure and sense of humor in high-pressure situations"}