{"jobID": "2631039806", "jobLocation": "San_Jose_CA", "jobTitle": "Territory Manager (Veterinary Sales Team- PVC)", "companyRating": null, "companyInfo": {"Website": "www.nestlepurinacareers.com", "Headquarters": "Saint Louis, MO", "Size": "10000+ employees", "Founded": " 1894", "Type": " Subsidiary or Business Segment", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable", "Competitors": " Mars, Hill's Pet Nutrition, Blue Buffalo"}, "estimatedSalary": null, "jobDescription": " A pet owners most trusted advisor is often their veterinarian. As a Territory Manager (Purina Vet Consultant) for our Veterinary Sales Team, you are the face behind our brand as these providers consider Pro Plan Veterinary Diets®. Proper nutrition is key to optimal dog and cat health. It is an idea carried throughout our entire line of veterinary pet foodspecialized nutrition that makes a difference. Pro Plan Veterinary Diets® include products focused on dietary management of dogs and cats with specific health problems. This role will provide you an incredible portfolio of formulas to represent, each of them backed by scientific research and Purinas unparalleled pet expertise. Globally, Nestlé has 27 research, development and technology centers along with over 500 scientists dedicated to ensuring top quality and creating innovative approaches to make the lives of dogs and cats better.  As our conduit into clinics, animal hospitals and offices throughout the veterinary channel, this role allows you to have the freedom of running your territory like your own business and provides the opportunity to become a strategic partner in enriching the lives of pets and the people who love them. Similar to our retail sales channels, youll enjoy the benefits of thought leadership and collaboration that develops within a tight-knit sales team.  Through continuous training, Territory Managers (Veterinary Sales Team) will develop an expertise in our diets and strategic sales plans, just as youll need to understand our channel partners goals, so that we are simultaneously creating a healthier pet community and gaining market share. Youll achieve this through your high level of professionalism, entrepreneurial spirit, advocacy and business acumen as you leverage Purinas advancing technology and industry-leading innovation to nurture relationships with current clients and build new client business.  We are proud of our active military service members, and our current associates who have served. We do consider military experience. Please apply for full consideration. Thank you for your service. PRIMARY RESPONSIBILITIES:Promote Pro Plan Veterinary Diet® product line.Grow the Purina Veterinary business by using innovative sales and marketing concepts to achieve assigned goals in all key measures.Call on existing and potential clients to create targeted, brand-building sales and marketing programs to drive volume and hit quantitative and qualitative sales goalsDevelop and implement strategic business plans within assigned geography to allow Purina to advance in the marketplaceCreate a positive Purina experience by providing top-tier customer services to clients through a consultative selling approachWork cross-functionally with regional team, distributor channel and counterparts across the country to consistently exceed sales expectationsInfluence with integrity by identifying each clinics business needs, and then leveraging consumer insights and trends to support your recommendationsDevelop and foster business relationships with key decision makers to gain active recommendations of Purina to veterinary clients.Provide Nutritional Pet Food Diet expertise to Veterinarians and their staff through clinic calls, product detailing/comparisons, In-Hospital Trainings and Special Events.LOCATION: Whereas some organizations will have you covering a multi-state region, our territories are more localized we want to develop and enhance the relationships with the veterinarians within the assigned territory. To ensure you are right in the middle of the action, we do require the candidates to reside within the assigned territory.  Within the West region, we currently have openings in Issaquah and Olympia, WA; and San Jose, California. You must currently reside or be willing to relocate within one of those cities or surrounding areas to be considered for this position. TERRITORY: Territory will cover your assigned city location and the surround area. Locations currently available: Issaquah, WAOlympia, WASan Jose, CATravel: Must be able to travel, including overnights as needed to manage the assigned territory.  Relocation assistance will be provided.  EQUAL OPPORTUNITY EMPLOYER  #LI-NC BASIC QUALIFICATIONS:Bachelors Degree required1+ years of sales experience requiredPREFERRED QUALIFICATIONS:Outside sales experience and Leadership experience preferredOTHER REQUIREMENTS:You are required to have a valid state drivers license, a satisfactory driving record and carry automobile insurance in the following amounts: $100,000 bodily injury liability per person$300,000 bodily injury liability per occurrence$50,000 property damageMust be able to travel, including overnight as needed to manage the assigned territory.Must have reliable transportation in order to manage the assigned territory.In order to be considered for this role, you must be willing to relocate: If you currently reside in the territory, you may need to be open to relocate for future advancement opportunities.If you currently do not reside in the territory, you will need to relocate to the territory upon offer acceptance and for future advancement opportunities.ADDITIONAL BENEFITS:401(k)Relocation assistance 50 miles outside of designated territoryExtensive on-the-job trainingCompany cell phone and computer providedAccess to Nestle Purina Credit UnionLeadership and career development opportunities"}