{"jobID": "2815416391", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist (Udemy for Business)", "companyRating": "4.4", "companyInfo": {"Website": "www.udemy.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "173000", "jobDescription": "ABOUT UDEMYWith a mission to improve lives through learning, Udemy is a global marketplace for learning and teaching online. More than 20 million students learn from an extensive library of over 65,000 courses taught by expert instructors. Whether learning for professional development or personal enrichment, students can master new skills through self-paced, on-demand courses, while instructors have a way to share their knowledge with the world. For companies, Udemy for Business offers subscription access to a collection of business-relevant courses as well as a simple platform to host and distribute their own content in one central place.We’re a close-knit bunch that enjoys problem-solving and collaboration, and we share a serious commitment to delivering the best possible learning and teaching experiences. Udemy’s culture encourages innovation, creativity, passion, and teamwork. We also celebrate our milestones and support each other every day.Founded in 2010, Udemy is privately owned and headquartered in San Francisco’s SOMA neighborhood with offices in Dublin, Ireland, Sao Paulo, Brazil, and Ankara, Turkey. Compensation includes full-time salary, equity compensation plan, and competitive benefits including healthcare, commuter benefits, parental leave, and a discretionary time off policy.JOB DESCRIPTIONIn this role you will be working on data problems that inform key business decisions for the Udemy for Business team (UFB), Udemy's enterprise offering. We’re helping companies like PayPal, Lyft, Booking.com, Capgemini, and Century 21 to solve the critical skills gap that teams increasingly face, whether it’s the latest technical skills, marketing & sales, leadership soft skills, and more. You will face questions like what courses should be included in UFB's catalog, how can we measure the likelihood of a partner company to renew and what factors of a course are most likely to drive engagement. While this role will primarily partner with the UFB team, you will be a part of a highly collaborative centralized Analytics team with opportunities to work with and influence all of Udemy.UFB is considered \"the startup within the startup\" so the need to be scrappy and work with incomplete information will be key. You will turn ambiguous problems into precise questions, work across their internal teams to extract the relevant data, and communicate results in a clear and effective way. You will be attentive to validating your approach and delivering results that are both actionable and reliable. And as a senior decision scientist, you will also be responsible for mentoring and developing less experienced analysts. Responsibilities:Support the UFB team with business analytics and insights that will drive actionCollaborate with stakeholders across Udemy to answer key business questions and find untapped opportunitiesAct as a mentor and coach to less experienced team membersConduct exploratory analyses with methodologies ranging from data mining and visualization to more sophisticated statistical modeling techniquesBuild SQL tables, metrics, and dashboards to track the health of the UFB business.Communicate clearly and effectively to stakeholders with varying business and technical backgroundsFill gaps by automating, programming, etc. to make sure the UFB team has the information necessary to make quick decisions"}