{"jobID": "2644231598", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.touchofmodern.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "152000", "jobDescription": " As the Lead of our Data Analytics team, you will be responsible for the development and execution of our business analytics strategy. You will partner with the executive leadership team to identify opportunities to grow revenue and profits, translate them into action plans, and monitor their impact. You will hire, manage, and develop a small team of high-caliber data analysts. The ideal candidate will have a proven track record of quickly developing a deep business understanding and providing actionable insight that pro-actively guides the company’s strategic direction and day-to-day operations. What you'll be doing:Be a highly analytical leader with a strong customer/vendor focus and the ability to solve highly complex business problemsGenerate actionable insight in support of decisions related to business strategy, revenue and profit forecasting, performance assessment of on- and offline marketing efforts, development of pricing strategies, logistics (shipment & fulfillment) and inventory optimizations, and customer segmentationApply advanced algorithms to large ecommerce data sets (e.g., clickstream and customer order data) in real-time systemsPerform rapid prototyping of experimental solutions and develop robust, maintainable production systems in statistical languages such as PythonHire, train, manage and develop a small team of data analystsWhat you bring to this role:Master’s or PhD in statistics, econometrics, computer science, mathematics, or similar5+ years experience as a Data Scientist or similar role for Business Intelligence projectsExperience with Redshift, large data ETL, and advanced SQLExperienced in machine learning and multivariate regressionThorough understanding of Bayesian statistics and demonstrated ability to apply that knowledge effectivelyE-commerce experience - comfortable handling clickstream data combined with a deep understanding of LTVs, contribution margins, CACs, AOVs, etc. and appropriate ways to model themA deep sense of curiosityObsession with data and algorithms to solve business problemsComfort working within a modern engineering environment (Linux, system architecture, Java, Python, R, multithreaded programming)Ability to script experimental solutions, select and use the most appropriate statistical analysis tools to answer specific business questionsThoughtful, results-driven personality, with a high level of enthusiasm, energy and confidenceExcellent analytical, communication, organizational and presentation skillsAbility to demonstrate flexibility and integrity: be able and willing to work hands on, independently or with a small team providing leadershipExperience working at a growth-stage startup companyExperience with large scale algorithm challengesTouch of Modern is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status."}