{"jobID": "2811448660", "jobLocation": "Redmond_WA", "jobTitle": "#1704/Data Scientist", "companyRating": "2.7", "companyInfo": {"Website": "www.pactera.com", "Headquarters": "Beijing, China", "Size": "10000+ employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Infosys, HCL Technologies, Wipro"}, "estimatedSalary": "105000", "jobDescription": "Company Overview:Pactera is a consulting and technology services provider with global headquarters strategically located in China and regional headquarters in North America, Asia Pacific and Europe. Since 1995, Pactera has been delivering world-class business IT consulting solutions and outsourcing services to global clients, including a wide range of Fortune 500 companies. With more than 26,000 employees worldwide, the company’s global footprint encompasses a diverse offering of technologies, services and business models focused on providing clients a holistic digital vision to drive business outcomes and transform user experience. This is a long-term contract opportunity with decent pay. Local WA and W-2 are highly preferred.Role:Exploring, modeling, mining, and experimenting with data to discover insightsUsing statistical, algorithmic, mining and visualization techniquesPartner with business functions to solve critical business issues and identify opportunities for optimizationData selection and preparation for acquisition, extraction, transformation, management, and manipulation of large and complex data sets for specific use casesPerforming highly-sophisticated data manipulation and analytics and translate insights into actionable recommendationsBuilding and deploying production analyticsWorking closely with designers, engineers, and subject matter expertsProvide thought-provoking ideas, perspectives, and research around methods, techniques and algorithms to improve decision makingMS or PhD in Operations Research, Computer Science, Statistics, Mathematics, Engineering, or related fieldsKnowledge of data modeling, data integration, and data life cycle managementExperience in data mining, large-scale data acquisition, transformation and cleaningParticipation and contribution to open source data science community also a plusExpertise with Microsoft Cosmos ecosystem Demonstrated experience with the following: Database technologies (Hadoop, SAP Hana, Oracle/Oracle Spatial, and/or MS SQL Server,)NoSQL database technologiesCloud computing, preferably with Microsoft Azure (machine learning, cognitive services, Cosmo DB, etc.)."}