{"jobID": "2730491867", "jobLocation": "San_Francisco_CA", "jobTitle": "San Francisco / Bay Area Intern", "companyRating": null, "companyInfo": {"Website": "www.protiviti.com", "Headquarters": "Menlo Park, CA", "Size": "1001 to 5000 employees", "Founded": " 2002", "Type": " Company - Public", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Deloitte, Accenture, Huron Consulting Group"}, "estimatedSalary": null, "jobDescription": " At Protiviti, we believe that a career is about more than just working, providing deliverables, and being compensated for your efforts. A Protiviti Career is about opportunities to lead, learn, grow, and make a difference.  We strive to recruit and hire the best talent. But it doesn't stop there. Once you join us, we build your career through exceptional work experiences, a culture focused on learning and development, and a commitment to the things that matter to you. Are you inspired to make a difference?You've come to the right place.JOB REQUISITIONSan Francisco / Bay Area Intern - 2019LOCATIONSAN FRANCISCOADDITIONAL LOCATIONJOB DESCRIPTIONInterns work in dynamic, team-oriented environments where they define technology system or business process issues, compile information and analyze data in order to present solutions to our clients. Interns develop an understanding of business processes, build technical skills in general risk areas, and help our clients review, document, evaluate and test controls, remediate and develop or implement action plans to improve efficiency and effectiveness of business processes.  Protiviti’s interns will work on a variety of projects, and solution offerings partnering with executives to ensure their organizations are successful, while providing our interns with a broad range of experiences. The primary solutions for interns include Internal Audit and Financial Advisory, Technology Consulting and Risk and Compliance. As Consultants progress in their careers, the focus shifts from gaining transferable experience to specializing in an industry or solution. QUALIFICATIONS AND EXPERIENCEDegree: Candidates pursing a master’s or bachelor’s degree in a relevant discipline (e.g., Accounting, Finance, MIS or Computer Science). A core curriculum of business courses, including accounting coursework, is strongly preferred. Minimum GPA: 3.0 overall, 3.0 major Visa Status: All applicants applying for U.S. job openings must be authorized to work in the United States. Graduation Status: Must be within one year of graduation at time of internship Skill Requirements: Must work well in a team-oriented environment, as well as independentlyMust work creatively and analytically in a problem-solving environmentMust possess excellent leadership, communication and interpersonal skillsMust have a desire to learn and a receptiveness to feedback and mentoringMust have an interest in finance and accounting processes as they relate to the overall business environmentAbility to Travel: The position requires travel to client sites. Consultants must have reliable transportation to and from local client sites. Out-of-town travel also may be required. Note: Students may apply for only one location. Duplicate applications will not be accepted. Protiviti is not licensed or registered as a public accounting firm and does not issue opinions on financial statements or offer attestation services.For all US & Canada Postings: You may submit your application materials online or call 1.888.556.7420 for additional ways to apply. Protiviti is an Equal Opportunity Employer. M/F/Disability/Veteran For positions located in San Francisco, CA: Protiviti will consider qualified applicants with criminal histories in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance. For positions located in Los Angeles, CA: Robert Half will consider for employment qualified Applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring.JOB LOCATIONCA PRO SAN FRANCISCO"}