{"jobID": "2811123130", "jobLocation": "Austin_TX", "jobTitle": "Logistics Intern", "companyRating": null, "companyInfo": {"Website": "www.asml.com", "Headquarters": "Veldhoven, Netherlands", "Size": "10000+ employees", "Founded": " 1984", "Type": " Company - Public (ASML) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Applied Materials, KLA-Tencor, Lam Research"}, "estimatedSalary": null, "jobDescription": " Job/Internship Description LocationAustin - TX, US LevelBachelor ExperienceStudent Available since4/16/2018 Functional area Background Referencereq2343 Introduction ASML US, LP brings together the most creative minds in science and technology to develop lithography machines that are key to producing faster, cheaper, more energy-efficient microchips. We design, develop, integrate, market and service these advanced machines, which enable our customers - the world's leading chipmakers - to reduce the size and increase the functionality of their microchips, which in turn leads to smaller, more powerful consumer electronics. Our headquarters are in Veldhoven, the Netherlands, and we have 18 office locations around the United States including main offices in Wilton, CT, Chandler, AZ and San Jose, CA. Job Description 1)Helps site engineers with administration and handling of in/out bound materials at customer site 2)If timing correct, assist local office project manager in relocating ASML office. 3)Work with logistics on data analysis related to parts stocking & levels 4)Work with local project manager on data analysis of multiple business functions, both technical & non-technical Duration 10 weeks/Two start dates available June 4 or June 18 Education Bachelors Candidates Business, Project Management, Social Sciences Context of the position The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. -While performing the duties of this job, the employee routinely is required to sit; walk; talk; hear; use hands to keyboard, finger, handle, and feel; stoop, kneel, crouch, twist, reach, and stretch. -The employee is occasionally required to move around the campus. -The employee may occasionally lift and/or move up to 20 pounds. -May require travel dependent on company needs. -Specific vision abilities required by this job include close vision, color vision, peripheral vision, depth perception, and ability to adjust focus. -Can work under deadlines. -The environment generally is moderate in temperature and noise level. -Must be able to read and interpret data, information, and documents. -Can observe and respond to people and situations and interact with others encountered in the course of work. -Can learn and apply new information or skills. Other information EEO/AA (W/M/Vets/Disability) Employer EEO/AA/M/F/Vet/Disabled"}