{"jobID": "2525854677", "jobLocation": "Cambridge_MA", "jobTitle": "Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.panjiva.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "47000", "jobDescription": "Solve important and challenging problems Work with a team of world class computer scientists and data scientists to solve hard data challenges. We’re looking for someone that can help us to solve the data problems that we know we have, as well as help to identify new opportunities to leverage our data. You’ll be working with a variety of teams across the company: engineering, business development, sales, and design to explore exciting and meaningful problems. This role is well suited for someone with technical interests, and professional experience as a Research Assistant or substantial background in primary source research.  As a data analyst, you'll analyze our data with scientific rigor. Our trade data is extremely complicated and extremely rich; your job will be to help us extract the data’s value. You’ll help us better understand our complicated international-trade data better, assure its quality, and find new opportunities for programmatic analysis.  This position is internally facing; you’re helping us move our product and technology forward. As such, you’ll be situated at our engineering office; this role is a great position to develop your analysis and technical skills. At Panjiva, you’ll work on:Research at scale into new and current datasets (available information, opportunities therein, etc.)Hypothesis vetting for product designData quality assuranceCollaborate with engineers and data scientists to develop new data analysis pipelinesRequirementsAt least 1 year of work experience.B.A. or B.S. Strong candidates often have a background in history or social sciences.Strong analytical skillsStrong communication skillsScientific rigor and diligenceAnalytical ability using SQL, statistical software, or spreadsheetsA desire to learn!Nice-to-HavesProgramming skills (even if basic). If not, we can help you develop them!Foreign languages (our data is international!)Knowledge of shipping and/or international tradeStatistics backgroundPerks and BenefitsCompetitive salary and stock optionsAn opportunity to develop your technical skills while working closely with our engineering and data science teamsCambridge MA Kendall Square office twenty-five feet from the Red Line T stopNineteen days of Paid Time Off (PTO) and 10 paid holidays annuallyWeekly tech talksHealth, dental, and vision insurance401(k) planHacker Continuing Education Wednesdays i.e., craft beer tasting, ping pong lessonsRegular off-site retreats where everybody helps to set company direction and strategyWork with a talented, focused, driven team in a growing company with opportunity for advancement and career development About Panjiva  Panjiva's technology creates insight from messy global trade data to provide powerful search, analysis, and visualizations of more than a billion shipping records from nearly every country in the world. Our platform is used by more than 3,000 customers—Fortune 500 companies, startups, government agencies, hedge funds, among others—in over 100 countries to find new suppliers and customers, monitor supply chains, make investment decisions, and much more. Better insight into global trade means better decision making and stronger connections between companies and governments around the world.  Join our team as we revolutionize a key and fascinating part of the world economy!"}