{"jobID": "2761971602", "jobLocation": "San_Jose_CA", "jobTitle": "Assistant Community Director - on the job training opportunity for a property management career!", "companyRating": "3.9", "companyInfo": {"Website": "www.fpimgt.com", "Headquarters": "Folsom, CA", "Size": "1001 to 5000 employees", "Founded": " 1968", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": " Property Name:GIRASOL-F98Full-Time/Part-Time: Full-time Years of Experience: 2 yrs preferred/will train right candidate Property Type: Affordable (LIHTC/HUD), Senior Living Valid Driver's License Required: Yes Bilingual Preference: Vietnamese Software Skills Required: Basic Computer Skills, Internet Use, Google Apps (Gmail, Drive, Docs, Sheets), MS Word, MS Excel, Adobe Acrobat Maintenance Skills Required:N/AProposed Pay Rate: $17.00 hourly (housing eligible) Job Details:FPI Management is currently looking for an Assistant Community Director to join our team! OUR IDEAL CANDIDATE has verifiable work experience in a similar Assistant Apartment Manager role. Is a dynamic leader, financial analysis genius, amazing marketing guru and super savvy with modern software applications. Must have a passion for customer service! MINIMUM REQUIREMENTS for consideration are: a High School diploma or equivalent, English language proficiency (read, speak and write), and the ability to pass a full background check and drug screening (Note: As it relates to marijuana use, FPI will consider any applicable state law when dispositioning test results). Why look at FPI for your next career step? We are the 4th largest (THE largest in Affordable communities) third-party property management company in the Nation, an industry leader, with over 700 properties (over 100,000 units) across 14 states under our management. We offer comprehensive compensation and benefits packages, on-going training and professional development, and plenty of growth opportunities. Come join Team FPI! Interested? Click the Apply button above to learn more about this great opportunity to work with an industry leader! #WeAreTeamFPIEEO/EVerify Statements FPI Management is an Equal Opportunity Employer. All qualified applicants are encouraged to apply. FPI Management participates in the E-Verify program."}