{"jobID": "2682656705", "jobLocation": "San_Mateo_CA", "jobTitle": "Senior Data Analyst", "companyRating": "4.3", "companyInfo": {"Website": "www.surveymonkey.com", "Headquarters": "San Mateo, CA", "Size": "501 to 1000 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "153000", "jobDescription": "About SurveyMonkey Founded in 1999 and based in San Mateo, California, SurveyMonkey is the world’s leading platform for turning people’s voices and opinions into actionable data — People Powered Data. Whether it’s with customers, employees, or a target market, SurveyMonkey helps curious individuals and companies — including 99% of the Fortune 500 — have conversations at scale with the people who matter most. It’s People Powered Data that allows them to understand not only “what” is happening, but “why.” SurveyMonkey’s 700+ employees throughout North America, Europe, and Asia Pacific are dedicated to powering the curious. The Role SurveyMonkey’s mission statement is to help people make better decisions with data. The Data and Analytics teams delivers the tools and technologies to make those decisions for our internal users as well as for our customers. We enable the data driven business.  As a Senior Data Analyst, you will work closely with cross-functional teams and executive leadership to define key metrics and identify opportunities to unlock new growth in our business. Using your analytical skills and business perspective, you will analyze user interactions with SurveyMonkey’s website, and create reports and tools to ensure key decision-makers in the company can easily track product performance and conduct focused analyses to make specific recommendations to optimize our business.  As we refine and expand our Business Intelligence strategy, you will play a central role in defining new standards and establishing self-service tools to expand internal access to key data and basic reporting tools. A thought-leader within the company, you will collaborate with our senior executives and technical leadership to identify and optimize opportunities for growth.  If you thrive in environments where you play a central role in driving actionable insights by solving strategic and highly analytical problems, we’d love to hear from you. ResponsibilitiesPartner with cross-functional business and technical teams to deliver data insights, identify trends and opportunities, and answer business questionsApply your expertise in quantitative analysis and business acumen to understand and analyze how our users interact with our productsAcquire, transform, manipulate and analyze data from multiple sources, ensure data quality in an Agile environmentBuild rich and dynamic dashboards using out-of-box features, customizations, and visualizations identifying new data trends and unlock impactful insights that will drive business growthCommunicate complex analysis and associated insights to broad audiences including executivesInfluence business decision making and product roadmap through data-based recommendationsWhen required, prepare ad-hoc analysis in the support of specific initiativesDemocratize data by designing and building interactive reports and dashboardsRequirementsExperienced as a thought leader in data analytics and business reportingBachelor degree in Quantitative or Computational field (Statistics, Economics, Operations Research, etc.), or other equivalent quantitative experience. Graduate or training in statistics or analytics a plusProduct and web analytics experience preferredHighly proficient in accessing data warehouses (SQL, Hive, proprietary equivalents)Familiarity with R or PythonUnderstanding of statistics (e.g., hypothesis testing, regressions)Experience building dashboards in common visualization tools (Tableau, Salesforce Wave would be a plus)Exceptional problem solving skills: demonstrated ability to understand business challenges, structure complex problems and deliver solutionsExcellent communication and storytelling skills: Ability to clearly and effectively communicate the results of complex analyses to business partners is keyAbility to work in fast paced work environment and be a self-starterBackground in consulting is a plus At SurveyMonkey, we offer competitive salaries, medical/dental benefits, PTO, 401k, paid holidays, and equity compensation.  SurveyMonkey is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees."}