{"jobID": "2645138003", "jobLocation": "New_York_NY", "jobTitle": "Medical Payments and Fee Schedules Analyst", "companyRating": null, "companyInfo": {"Website": "www.metroplus.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1985", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Medical Payments and Fee Schedules AnalystJob Ref: 34798 Category: Finance Department: ACCOUNTING-GENERAL Location: New York, NY Job Type: Regular Employment Type: Full-Time Hire In Rate: $55,176.00 Salary Range: $55,176.00 - $80,000.00Marketing StatementMetroPlus Health Plan provides the highest quality healthcare services to residents of Bronx, Brooklyn, Manhattan, Queens and Staten Island through a comprehensive list of products, including, but not limited to, New York State Medicaid Managed Care, Medicare, Child Health Plus, Exchange, Partnership in Care, MetroPlus Gold, Essential Plan, etc. As a wholly-owned subsidiary of NYC Health + Hospitals, the largest public health system in the United States, MetroPlus’ network includes over 27,000 primary care providers, specialists and participating clinics. For more than 30 years, MetroPlus has been committed to building strong relationships with its members and providers to enable New Yorkers to live their healthiest life. Position Overview Responsible for analysis of medical payment rates and fee schedules. Work with a multidisciplinary team to interpret existing and develop new fee schedules and payment rates for medical services. Perform research to aid in the development of a base fee schedule. Perform financial modeling, impact analysis and audits on variations in medical payments. Serve as subject matter expert in all areas of fee schedules/groupers, rate reimbursement, and payment methodologies. Develop workflows and business processes to ensure timely and accurate interaction with Contracting, Network Relations, Claims, Core Configuration and other related areas. Act as facilitator to aid in the translation of contract payment terms into the core processing system. Fully comprehend the downstream impact of loaded rates within the Plan’s entire claims reimbursement cycle.Job DescriptionPerform analysis of medical payment rates and fee schedulesEnsure fee schedules are loaded according to the provider contract, including audit of implemented contractsResponsible for the identification, correction, and root cause analysis of fee schedule load and reimbursement problemsAs MetroPlus moves to more value based reimbursement, ensure the impact on fee schedules and reimbursement methodologies are implemented appropriatelyServes as subject matter expert with all contract implementation for fee schedule, rate reimbursement matters, and payment methodologies.Analyzes negotiated contracts to ensure that interaction with the core systems is aligned with negotiated intentParticipate in rate testing with all impacted teams within the Plan.Minimum QualificationsB.S. degree in Business, Finance, Economics, Information Systems or equivalent.Master’s Degree a plus, but not required.Minimum 3-5 years of relevant experience, preferably in a health care environment.Strong familiarity with health plan claims/provider billing systems and interdependent applications.Experience in data and auditing functions.Experience in developing and improving business processAnalytic, problem solving, technical skills and attention to detail are required.Strong analytical skills and attention to detailExcellent understanding of contracts, especially in a provider and payer relationshipKnowledge of CMS, New York State Medicaid, and third-party fee schedules, as well as industry wide payment methodologies, and claims edit policies.Excellent communication and documentation skillsAbility to multi-taskAbility to translate business process requirements into a production environmentProfessional CompetenciesIntegrity and TrustCustomer FocusFunctional/Technical skillsWritten/Oral CommunicationHow To ApplyIf you wish to apply for this position, please apply online by clicking the \"Apply Now\" button or forward your resume, noting the above Job ID #, to:  MetroPlus Health Plan  Human Resources Department  160 Water Street 8th Floor  New York, NY 10038  Attn: Recruitment UnitThis is position is classified as a managerial title, in addition to a variety options for Health Benefits through MetroPlus, managerial employees receive vision, dental, gym reimbursement and life insurance benefits through the Management Benefits fund of the City of New York. Please view the benefits page for more detailed information."}