{"jobID": "2808628068", "jobLocation": "Brooklyn_NY", "jobTitle": "Occupational Therapist", "companyRating": "3.2", "companyInfo": {"Website": "www.tendertouch.com", "Headquarters": "Lakewood, NJ", "Size": "1001 to 5000 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "37", "jobDescription": "Occupational Therapist Job Description QualificationsGraduate of an accredited university with a B.S., MA, or M.S. in Occupational Therapy that is recognized by the AOTA.Recognized by the NBCOT as a designated OTR (if state mandated)Holds current license and/or registration in the state (as applicable) Job ResponsibilitiesProvide a comprehensive occupational therapy evaluation based on MD orders.Document findings on the standardized evaluation form neatly, timely, accurately and adhering to all guidelines.Provide a comprehensive treatment plan including long and short term goals, frequency, duration and treatment modalities.Ensure MD orders are obtained for evaluations, treatments, recertifications and discharges.Provide comprehensive treatment to patients utilizing modalities and modify patient treatment as indicated while adhering to precautions. Document patient’s progress on weekly progress note accurately and timely.Document monthly updated treatment plan on standardized form comprehensively and in a timely manner.Document patient’s discharge on a discharge summary as indicated.Document any caregiver or discharge in-services on an in-service form as indicated.Complete any and all other documentation forms required by Tender Touch.Document care plans and information needed for the MDS as deemed necessary by the facility.Attend facility and rehab meetings as indicated by supervisor and/or regional manager.Participate in facility committee meetings as indicated.Act as a rehab delegate to the interdisciplinary team.Participate in scheduling of patients.Perform screens as indicated.Complete billing logs and bill patients ethically and accurately for occupational therapy services rendered.Cover other therapists patient caseload during absence as necessary.Supervise junior staff members, students in compliance with State OT Board regulations and requirements. Co-sign notes of assistants or students. Maintain professional relationship with co-workers, facility staff, patients and patient families.Provide inservice education regarding patient care or occupational therapy services to rehab staff, facility staff, hospitals and/or and community as needed. Comply with all facility and Tender Touch safety policies and procedures.Comply with patient confidentiality and Federal Resident Rights.Report to work on time, adhere to scheduled hours and project a professional image at all times.Adhere to productivity requirements, complete productivity reports and submit in a timely manner.Comply with all Tender Touch policies re: lunch, overtime, sick and time off notification.Maintain a positive work atmosphere by demonstrating and communicating in a professional manner so as to foster positive relations with customers, clients, co-workers and managers. Perform any other duties assigned by the supervisor or Regional Manager.Adhere to any and all other Tender Touch written and oral policies and procedures.Tender Touch may request your availability to travel to facilities within reasonable distance. Physical Demands Employee should be able to transfer patients, lift weights, transport patients and perform treatment on the mat. Employee should  be knowledgeable in and exercise good body mechanics during patient treatment.  Tender Touch is an Equal Opportunity Employer"}