{"jobID": "2824101693", "jobLocation": "Boston_MA", "jobTitle": "Partner Support Analyst", "companyRating": null, "companyInfo": {"Website": "www.bluewavesolar.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "BlueWave Solar is a B Corporation on a mission to revolutionize energy with simple, powerful solar solutions. We have a rapidly growing team of experts intensely focused on increasing our solar loan footprint, refining our Solar Management Platform software, developing and managing community solar projects, and forging efficient capital partnerships that enable consumers to choose local, low-cost solar power. We are constantly innovating to keep pace with the evolving energy industry, and that spirit of innovation is what drives our company’s dynamic culture. We are an energetic, driven and welcoming group of people that is looking for our “people person” to help us build the right team to support us in meeting our goals. When you join the BlueWave community, you join a team doing all that we can to be transparent, sustainable and high-integrity. We don’t just want to do business, we want to do good business. Because of our commitment to B Corp Certification we hold ourselves to high standards when it comes to our impact on the environment, our employees, our communities, and our customers.We Seek:A highly motivated Partner Support Analyst to provide first-level support to BlueWave’s growing rooftop solar installation partner network and their customers.Is this you?Duties and Responsibilities:Provide first-level support to BlueWave’s growing rooftop solar installation partner network and their customers;Work alongside a Business Development Manager to provide top-notch customer service to BlueWave’s partners;Respond to phone and email inquiries from partners during the sales process;Coordinate communication between partners and/or customers and BlueWave’s Operations Team during the underwriting process;Assist the Business Development Manager’s during the partner onboarding process by managing the execution of key documents, including the Sales Services Agreement;Keep accurate records in Salesforce of communication between partners;Identify, prioritize and offer up new ideas and process improvements to the Sales, Sales Operations, Operations and Products Teams; andHelp with recurring sales analysis and reporting to internal stakeholders.Required Qualifications/Skills/Education:Account management experience;Strong organizational and communications skills;Result oriented, self-starter, with credibility, and integrity;Advanced modeling, excel skills and familiarity with CRM tools (Salesforce preferred);A great attitude and ability to be flexible;Ability to be a team player;"}