{"jobID": "2547897747", "jobLocation": "New_York_NY", "jobTitle": "Intensivist- Critical Care/Pulmonary", "companyRating": null, "companyInfo": {"Website": "www.pagny.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OverviewPhysician Affiliate Group of New York (PAGNY) is comprised of nearly 4,000 physicians and healthcare professionals who provide services to NYC Health and Hospitals Corporation (HHC), the largest public health system in the United States. Our practitioners are highly skilled professionals with outstanding credentials who deliver the highest level of quality healthcare to patients throughout New York City.  In partnership with NYC Health + Hospitals/Jacobi our teams accommodate more than 325,000 outpatient visits, more than 100,000 emergency room visits and more than 20,000 inpatient admissions annually. NYC Health + Hospitals/Jacobi is renowned for The Trauma Center, staffed to treat any traumatic injury or illness, the fully accredited Breast Health Center, and The Burn Center, with more than 40 years of work in burn care. The hospital also serves patients of many other needs. The hospital maintains an academic affiliation with Albert Einstein Medical College of Yeshiva University.ResponsibilitiesThe Pulmonary & Critical Care Medicine Division of Jacobi Medical Center, a major teaching affiliate of the Albert Einstein College of Medicine in NYC. seeks an academically oriented, clinically adept Intensivist to join its full time staff. NYC Health + Hospitals/Jacobi supports a very robust IM residency training program and serves as a major clinical site for Montefiore Medical Center PCCM fellowship trainees and other Medicine Sub-specialty fellows. The primary focus of this Intensivist position will be to attend in the MICU where we currently have on-site 24/7 attending coverage. In addition, this Intensivist will provide similar services to the North Central Bronx Hospital ICU (if needed).QualificationsThe successful candidate will be BE/BC in Critical Care Medicine. Additional BE/BC in Pulmonary Diseases is highly desirable which can lead to additional clinical opportunities in inpatient Pulmonary medicine and the OPD.  EOE M/F/D/V"}