{"jobID": "2658412395", "jobLocation": "New_York_NY", "jobTitle": "Messenger $2000 SIGN ON BONUS", "companyRating": null, "companyInfo": {"Website": "www.brinks.com", "Headquarters": "Richmond, VA", "Size": "10000+ employees", "Founded": " 1859", "Type": " Company - Public (BCO) ", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " G4S, Dunbar Armored"}, "estimatedSalary": null, "jobDescription": " Position Qualifications  The Skills You Need  We’re looking for professionals who fulfill the promise of our brand. A promise to uphold the integrity of our legacy and embrace our future. A promise to work with authority and confidence. A promise to respect the trust we’ve earned and pay it forward with the work we do. Messengers operate in an armed environment with armored vehicles. A valid driver’s license and satisfactory driving record are required. Additional requirements include:At least 21 years of ageCompletion of all Department of Transportation requirementsA valid firearms permit OR ability to pass applicable firearms licensing requirementsGuard card OR ability to obtain a guard card or any other required licensesChauffeur’s license OR ability to obtain one (Indiana, Louisiana and Michigan residents only)Ability to lift at least 50 pounds and all other essential job functions as measured by the Brink’s Human Performance Evaluation. The Ideal Candidate  Are you cut from the Brink’s cloth? We prefer candidates with either messenger or professional driving experience. Preference is also given to candidates with protective service or military background.  A Career Worth Building  At Brink’s, we value our team members and offer our Messengers local routes that allow them to spend more time at home. We invest in growth and opportunity by providing world-class training opportunities both locally and globally, such as Brink’s University. We also believe in cross-training our team members in order to ensure diverse skillsets.  Other benefits of building your career at Brink’s include: Insurance, including health, dental and life401(k) with company matchPaid vacation and holiday payA strong, team-oriented cultureThe strength and stability of our 150+ year history About Brink’s  Brink’s is the global leader in security and logistics services, trusted by banks, financial institutions and businesses in both public and private sectors. We deliver the currency of the world to businesses in our communities. We do it because we’re needed. We do it because we’re trusted and valued. We do it because it makes us proud. Brink’s Proud.  What’s Next?  Upon completion of the application process, you will receive an email confirming that we have received your application. We will review all candidates and notify all qualified candidates of their status. Thank you again for your interest in a career at Brink’s U.S. For more information about future career opportunities, join our talent network, like our Facebook page or follow us on Twitter. - Brink’s is an equal opportunity/affirmative action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, marital status, protected veteran status, sexual orientation, gender identity, genetic information or history or any other characteristic protected by law. Brink’s is also committed to providing a drug-free workplace.  We are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class."}