{"jobID": "2826736021", "jobLocation": "San_Diego_CA", "jobTitle": "Professional, Data Analyst", "companyRating": "2.8", "companyInfo": {"Website": "www.corelogic.com", "Headquarters": "Irvine, CA", "Size": "5001 to 10000 employees", "Founded": " 2010", "Type": " Company - Public (CLGX) ", "Industry": " Media", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "53000", "jobDescription": "Job Duties: Responsible for the extraction and the extraction process, of complex customized data sets for client requests in the Teletrack product line. Drive fulfillment & delivery process improvement through seeking out and identifying opportunities for process improvement and production by defining and documenting processes and procedures. Perform data research and deliver data extracts and information to clients.  This role needs a understanding of credit data, systems, and data operations processes in an FCRA environment. Production jobs can be complex and specialized where understanding of the production process, client needs, and knowledge of the data play equally important roles. At this level, solid data systems knowledge is important in order to create, extract and run complex and highly specialized production jobs.  Position located in San Diego CA. Monitors automated or recurring processes for customized client data sets and run productionalized customer jobs. Resolves issues and communicate trends and problems to management. Modifies/enhances data programs or creates/runs programs to load data and resolve fulfillment or delivery issues.Designs, codes, tests, debugs and documents fulfillment & delivery programs for customized client requests.Performs quality audits on fulfillment extracts, file formats, and delivery mechanism prior to delivering it from production. Reviews, researches, analyzes, makes adjustments and recommendations regarding user requests to ensure jobs will run successfully and meet user expectations.Interacts with internal and/or external customers to improve and resolve fulfillment or delivery issues. Provides appropriate analysis, follow up, notification, and solutions to managers related to issues.Continually identifies areas of process improvement opportunity to automate, streamline, and tune jobs for improved efficiency, productivity, and performance. Maintains and updates associated runbooks.Develops business relationships to ensure successful implementation, support project efforts, and/or integrate activities with other departments/groups. Does problem-solving and thinking laterally either as part of a team or individually, to meet the needs of the project.Monitors and reports to management on the status of project efforts anticipating/identifying issues that inhibit the attainment of project goals and implements corrective actions.Auto req ID11885BRPosition Type Full Time Posting Job Summary Join the team that powers the global real estate economy - CoreLogic is an innovative, future focused company whose vision is to deliver unique property-level insights that power the global real estate economy.  We are a $1.95 billion in sales company with more than 6,000employees globally serving the financial services and insurance industries. We are evolving at a rapid pace and the clients we serve are challenged from every direction, which means we are growing and innovating to help drive their success. Working together, and differentiated by our superior data, analytics and data-enabled solutions, we empower our clients to make smarter business decisions through data-driven insights. We take initiative, are fully accountable, build respect and trust, make transparency a must - and engage, include and collaborate at every turn.  We take pride in our work and believe in cultivating a work environment that supports and values our greatest asset: our talented employees. State/Region/ProvinceCA% Travel Involved None Posting Job RequirementsEducation, Experience, Knowledge and Skills:Bachelors Degree(computer science, engineering, or math)Experience with credit data in an FCRA environmentEmployees typically have 6+ years of directly related experience.Operational experience dealing with volumes and SLAs for timeliness and quality.Experience with and understanding of data elements, components, standardization, linkage and utilization of data systems programming.Understand database processing techniques and concepts including flow charting, file documentation, data analysis, and relational database principles.Strong SQL programming skills and/or other equivalent technical skill(s) for fulfillment typeSolid verbal and written communication skills. Ability to communicate effectively with business partners and/or customers is a must.Attention to detail. CoreLogic offers an empowered work environment that encourages creativity, initiative and professional growth and provides a competitive salary and benefits package. CoreLogic is an Equal Opportunity/Affirmative Action employer committed to attracting and retaining the best-qualified people available, without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, disability or status as a veteran of the Armed Forces, or any other basis protected by federal, state or local law. CoreLogic maintains a Drug-Free Workplace. We are fully committed to employing a diverse workforce and creating an inclusive work environment that embraces everyone's unique contributions, experiences and values. Please apply on our website for consideration. Category Operations City San Diego Business Segment Corporate Shared Services Country United States "}