{"jobID": "2613208695", "jobLocation": "San_Jose_CA", "jobTitle": "Private Wealth Analyst II", "companyRating": null, "companyInfo": {"Website": "www.cnb.com", "Headquarters": "Los Angeles, CA", "Size": "1001 to 5000 employees", "Founded": " 1954", "Type": " Subsidiary or Business Segment", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " East West Bank, Bank of the West, First Republic Bank"}, "estimatedSalary": null, "jobDescription": " Supports Private Banking client teams in delivering investment analysis and financial planning materials for high-net-worth and ultra-high-net-worth individuals and families within a specific region. Partners with Regional Private Client Advisor team in business development and relationship management activities to support investment management prospects and clients. At this level, produces, interprets, and prepares information about client portfolios offering solutions to more complicated problems and is proactive in planning and in delivering quality results. Assumes responsibility for decision making. *Minimum 5 years of experience in investments or other financial services industries.*FINRA Series 7 and 63 securities required.*Minimum 5 years of experience with Microsoft Excel and PowerPoint programs as well as Bloomberg, Morningstar Advisor Workstation, MoneyTree Allocation Master, and other financial databases.*Minimum 3 years of experience working in a professional team environment.Understand marketable securities, investment products and financial planning concepts.Strong analytical and financial analysis skills.Ability to perform financial and economic analyses utilizing various planning tools and software level (expert in Naviplan) and effectively explain cause and effect as well as formulate supportable conclusions.Must be able to think through problems and develop solutions.Must have strong verbal and written communication skills. *Represents the basic qualifications for the position. To be considered for this position you must at least meet the basic qualifications.  City National Bank is an Equal Opportunity Employer -- Minorities/Females/Individuals with Disabilities/Veterans.  Note: The Preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.  Note: Candidates should be advised that City National Bank does not pay interviewee travel expenses or relocation expenses for candidates who are hired unless previously agreed.  *LI-IR1Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}