{"jobID": "2816445373", "jobLocation": "Redwood_City_CA", "jobTitle": "Civic Engagement and Health Intern (see qualifications for salary range)", "companyRating": null, "companyInfo": {"Website": "www.smcoe.k12.ca.us", "Headquarters": "Redwood City, CA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Education", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Overall Job Objective  Job Title:Civic Engagement and Health Intern (see qualifications for salary range)  Closing Date/Time:Continuous  Salary:$16.00 - $22.00 Hourly  $1,280.00 - $1,760.00 Biweekly  $2,773.33 - $3,813.33 Monthly  Job Type:Intern/Fellow  Location:San Mateo County, California  Health Policy & Planning Internship ProgramThe San Mateo County Health System is seeking a dedicated and hardworking Civic Engagement and Health Intern to join the Health Policy and Planning (HPP) team, a program within the Public Health, Policy and Planning Division. The HPP Internship Program is designed to provide work opportunities and practical learning experiences in public health, policy, planning, and research, with an emphasis in health equity and place-based primary prevention. Internship position is open until filled. Applications will be reviewed as they arrive.  HPP Framework: Primary Prevention & Health Equity  There is a growing recognition that where we live, work, play, and go to school shape our health. HPP focuses on building healthy, equitable communities that prevent people from getting sick in the first place. HPP works to ensure all people have the opportunity for health and wellbeing and seeks to build health equity by addressing the root causes of poor health, such as the social, economic, and physical conditions around us. To achieve this goal, HPP employs expertise in policy, planning, research, equity, epidemiology, communications, and advocacy. HPP has a particular focus on supporting populations with higher rates of preventable health issues and in places with the fewest opportunities for health.  HPP is currently focused on four areas of work: Stable and affordable housing: protects health and provides the ability to engage in healthy opportunities.Complete neighborhoods: make it easy for residents to be healthy every day in their own communities.High quality education: creates pathways to better health.Strong local economy: builds household financial security for all. To learn more about HPP's work visit *********************. Examples Of Duties: Internship Overview: Civic Engagement and Health Intern  The Civic Engagement and Health Intern will assist Health System staff in researching the impact of civic engagement on community health and developing strategies for addressing the root causes of racial health inequities. They will conduct a literature review, analyze current conditions, synthesize model practices, and help communicate the connections between social inclusion and health. More specifically, they will work on any of the following: Conduct a literature review on the health impacts of social exclusion and civic engagementSupport analysis of local leadership development and civic engagement assets, needs, and gapsConduct an analysis of model practices that optimize civic engagement of marginalized populationsDevelop strategic communications material to share research findingsSupport stakeholder forums on racial health equity and civic engagementQualifications:The ideal candidate will have:Interest and dedication to advancing health and equity demonstrated through work experience and/or personal experience being impacted by health inequitiesBackground in public health, public policy, and/or community organizingUnderstanding of the intersection between public health and exclusion as well as knowledge of health equity principles and a systemic analysis to race issues.Knowledge of civic engagement and community organizing practicesStrong skills in public health, public policy, governance or political science researchAbility to review technical and policy documents/publications, synthesize complex data, and identify recommendationsStrong writing, communication, and people skillsStrong organization and time management skills and ability to work independently toward excellent outcomes Eligibility Current graduate level students and recent graduates from a master's level program - up to one year after graduation date are eligible to apply. You may not be a current San Mateo County employee.Successful applicants will possess a deep passion for addressing health inequities and experience working to change them. Relevant experience may include:Personal or family experience dealing with inequitable economic, social, health and educational systems and environments. For instance: being the first in your family to attend higher education, growing up in a low-income neighborhood, experiencing housing/financial instability, or facing racial/ethnic or other types of discrimination.Professional experience in program that promote equity (this can be through a multitude of intervention types and variety of locations or organizations Internship Term & Pay This HPP Internship program runs year round. The Summer Internship runs from July to September 2018, and the intern must commit to working between 32-40 hours per week. Reasonable timeframe adjustments can be negotiated. Current graduate students are paid between $20.50 - $22.00 per hour depending on experience.Application/Examination: How to Apply  Complete an application by clicking on the link here. After you have filled out an application from the link, please submit your completed application to ************************ with the following required attachments: Cover Letter: Please describe your interest in and qualifications for this internship in the cover letter including position you are applying for.ResumeCompleted application and supplemental questionnaire (see below) Required Supplemental Questions  Please limit your answers to 300 words or less per question.  1) Please describe how you meet one or more of the following eligibility criteria:  a. You have personal or family experience dealing with inequitable economic, social, health and educational systems and environments. For instance: being the first in your family to attend higher-education, growing up in a low-income neighborhood, experiencing housing/financial instability, or facing racial/ethnic or other types of discrimination.  b. You have a deep passion for addressing health inequities, and have experience working in programs that promote equity, civic engagement and/or community organizing. This can be through a multitude of intervention types and variety of locations or organizations.  Internship position is open until filled.  Only complete applications will be reviewed; please contact us if you do not receive a confirmation we received your application. If selected, you will be invited for an interview. In-person interviews are strongly preferred, but telephone or Skype interviews can be arranged if needed.  Questions  Rosa Torpis, Program Coordinator  225 37th Avenue, 1st Floor, San Mateo, CA 94403  Telephone: **************  E-mail: ************************ ********************************************************* Skills/Requirements  Job Reference #: *******  Job Status: Internship  Date Posted: 6/13/2018  Pay Rate: $33,280 to $45,760/year  Pay Comments  Salary : $16.00 - $22.00 Hourly $1,280.00 - $1,760.00 Biweekly $2,773.33 - $3,813.33 Monthly  Recruiter and Available Location Information  455 County Center, Redwood City, CA 94063"}