{"jobID": "2823451241", "jobLocation": "Redmond_WA", "jobTitle": "Senior Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.microsoft.com", "Headquarters": "Redmond, WA", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (MSFT) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Amazon, Apple"}, "estimatedSalary": "124000", "jobDescription": " At Microsoft, a great deal of effort is spent on using masses of data to guide product and business decisions. Our team is the Consumer Data and Analytics team that focuses on providing analysis and data science capabilities impacting Microsoft's consumer product and marketing efforts.  We are looking for an experienced Data Analyst who can work across a range of Microsoft consumer products using petabytes of data to discover insights to answer key product usage and business questions. The ideal candidate should be self-directed, entrepreneurial, and focused on delivering the right results.  Candidates should be able to apply a breadth of tools, data sources, and analytical techniques to answer a wide range of high-impact business questions and present the insights in a concise and effective manner. As well, the candidate should be an effective leader with a proven track record of delivering and leading complex and ambiguous projects across teams. Candidates should have solid written and verbal communication skills and need to be capable of independently driving issues to resolution and communicating insights to non-technical audiences. 5+ years of experience solving analytical problems using quantitative approachesProven technical, development, project and program management skills on large scale complex cross team projects3+ years of experience working in SQL, including working with large data sets (COSMOS, Azure, etc)Comfort manipulating and analyzing complex, high-volume, high-dimensionality data from varying sourcesSolid experience building analytics solutions, ability to understand instrumentation, and devise technical solutions (ETL, data warehouse, SQL Server Analysis Services&Data; Tools, PowerBI Reporting)Proficiency in advanced Excel functionsAbility to communicate complex quantitative analysis in a clear, precise, and actionable mannerSelf-motivated, agile and driven to think out-of-the-boxBachelor's Degree Required Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.  Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work. MLDFY18Metric and Analytical accountability and responsibility for one or more SLT consumer metrics which include ensuring accuracy, high-quality, and providing detailed analysis on metric trends and driversDevelop powerful visualization on customer behavior and usage for key analytical areasAnalyze and validate data using statistical tools to answer product and business questions that will drive product and marketing decisionsBuild and maintain learning plans for the product(s) with key analytical questionsBuild a holistic understanding of product usage, customers, data infrastructure&environments;, and business goalsLeverage industry best practices in establishing repeatable metric and analytics practices, principles&processes;Leverage team members across Microsoft Data Analytics and Science for improving insights and analytical impact"}