{"jobID": "2824847841", "jobLocation": "Seattle_WA", "jobTitle": "DATA ANALYST", "companyRating": "3.4", "companyInfo": {"Website": "www.uwmedicine.org", "Headquarters": "Seattle, WA", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Hospital", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "66000", "jobDescription": " DATA ANALYST Req #: 157458 Department: INSTITUTE FOR HEALTH METRICS AND EVALUATION Job Location: South Lake Union Posting Date: 06/22/2018 Closing Info: Open Until Filled Salary: Salary is commensurate with experience and education Shift: First Shift As a UW employee, you have a unique opportunity to change lives on our campuses, in our state and around the world. UW employees offer their boundless energy, creative problem solving skills and dedication to build stronger minds and a healthier world.  UW faculty and staff also enjoy outstanding benefits, professional growth opportunities and unique resources in an environment noted for diversity, intellectual excitement, artistic pursuits and natural beauty. All of which has allowed the UW to be nationally recognized as a “Great College to Work For” for four consecutive years.  The Institute for Health Metrics and Evaluation (IHME) is an independent research center at the University of Washington focused on expanding the quantitative evidence base for health. IHME aims to provide the best possible quantitative evidence base to policymakers, donors, and researchers in order to make decisions that lead to better health. Often that means providing as complete a picture as possible of health in a particular country, drawing upon a wide array of secondary data sources and helping prepare and execute primary data collection processes and systems. IHME has an outstanding opportunity for a Data Analyst on the Global Fund Prospective Country Evaluation (PCE). The PCE provides an opportunity to examine critical processes, outputs, outcomes, and ultimately the impact of Global Fund investments through a comprehensive country-level lens using a diverse array of data and methodologies. The IHME/PATH Global Evaluation Partnership (GEP) is working with Country Evaluation Partners (CEPs) in three countries: Democratic Republic of the Congo (DRC), Guatemala and Uganda for this study. The data analyst will contribute to the data collation, data management, and implementation of analytics to perform resource tracking studies, output/outcome measurement, and impact evaluation of Global Fund Grants in DRC, Guatemala, and Uganda.  The Data Analyst will be integral to contributing to data management, data cleaning, and the creation of graphics and tables for presentations and reports. The Data Analyst must interpret and apply complex protocols systematically, learn computer coding languages and software to help manage survey data and the surveys themselves, and develop ways to quality check the data regularly. The position requires dexterity with quantitative data and a keen attention to details. This position directly contributes to cutting-edge data collection and analysis that helps IHME establish a high bar of excellence in the field of population health metrics and evaluation.  This position may include additional work alongside other Data Analysts on complementary projects and will require knowledge, skill sharing, and collective problem-solving. Overall, the Data Analyst will be a critical member of an agile, dynamic research team. Responsibilities include:Research learningBecome familiar with substantive areas of expertise to understand the dimensions and uses of health data in complex multidisciplinary analyses.Understand fully survey items and structure and the purpose each serves in addressing study needs.Work directly with researchers to explain and modify surveys and databases to best serve the needs of evolving data collection.Create and document efficient, effective, and replicable methods to extract data, write and apply code as relevant, organize data sources, manage data quality, and produce summary results. Primary data collection quality management and extractionsLearn and apply code to develop surveys using pre-defined survey software.Develop code to perform survey-specific data verification and quality management.Communicate with individuals collecting primary data in order to troubleshoot survey problems and ensure high-quality results.Prepare summaries of data quality as well as progress toward data collection, cleaning, and analysis targets.Using standardized protocols, identify problems with survey data, rectify issues, and systematize data quality methods to ensure high-quality future analyses.Extract, format, and transform data from multiple sources according to set protocols and in consultation with researchers to best meet their needs.Execute queries on databases to respond to the needs of senior researchers and external requests from collaborators, media, policymakers, donors, and other stakeholders.Learn and apply computer coding skills as needed to clean, merge, aggregate, and format datasets and to adapt databases with needed additions.Archive, catalogue, and annotate datasets according to Institute standards to build a common library of materials for use by a wide set of researchers.Become adept with and apply data conversion and extraction tools, as needed. Publications, presentations, and data requestsCreate tables, figures, and charts for presentations and publications, drawing upon data and information from a multitude of sources.Provide referencing support for publications and presentations.Populate and maintain citation databases. GeneralCommunicate clearly and effectively while contributing as a productive member of both the relative project team and the research management team. Work closely with other team members to help them with relevant tasks, show them how to learn new skills, and help resolve emerging problems on different projects. Attend relevant meetings, adhere to deadlines, and participate in collectively advancing team-level objectives.Participate in overall community of the Institute, carrying out duties as required as team members with other Institute members.  As a UW employee, you will enjoy generous benefits and work/life programs. For detailed information on Benefits for this position, click here. REQUIREMENTS:Bachelor’s degree in social sciences or related field, or equivalent combination of education and experience. Additional Requirements:"}