{"jobID": "2814384714", "jobLocation": "San_Jose_CA", "jobTitle": "Financial Advisor", "companyRating": null, "companyInfo": {"Website": "www.pacific.massmutual.com", "Headquarters": "Walnut Creek, CA", "Size": "201 to 500 employees", "Founded": " 1851", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable", "Competitors": " New York Life, Northwestern Mutual, Lincoln Financial Group"}, "estimatedSalary": null, "jobDescription": " As a Financial Advisor, you’ll be part of our entrepreneurial system with the freedom to provide solutions for your clients from a broad portfolio of innovative insurance and financial products. You’ll have access to powerful sales tools and a large resource network so you can focus on activities that get results. A career as a Financial Advisor gives you the satisfaction of helping others to understand and analyze their financial situation and needs. You’ll do this by problem solving, helping clients manage risk and achieve financial security. Financial Advisor Responsibilities:Advise clients on investment strategies and other financial decisions.Assess clients' assets, liabilities and overall financial conditions.Prepare presentations that recommend various financial products.Review and communicate portfolio performances to clients.Network and build relationships with new and existing client base.Decide how to build your business by choosing your clients and the markets you want to pursue.You'll draw your clients from one or more of the following markets: Personal Needs Analysis Market, Small Business Market or Estate Planning Market.Our goal is to discover each client's needs and goals and help map a path to meet them.Financial Advisor Qualifications:Previous experience in banking, financing, or other related fields.Familiarity with investment products and services.Ability to build rapport with clients.Strong analytical and critical thinking skills.Excellent written and verbal communication skills.Financial Advisor Rewards:You’ll have the unique opportunity to create your own career path and determine the impact you’ll have on the lives of your clients, families and your community.Successful financial representatives experience tremendous pride and satisfaction in building a practice from the ground up.Every solution you implement helps secure the financial futures of your clients, their families or businesses.As you continue to build strong, long-term relationships with your clients, your practice will continue to grow.As your practice grows, you can expand your influence in your community.With satisfied clients comes more business, and more rewards as those clients share with their associates and friends the value of your relationship.About MassMutual Financial Group: With whole life insurance as its foundation, MassMutual provides products to help meet the financial needs of clients, such as life insurance, disability income insurance, long term care insurance, retirement/401(k) plan services, and annuities. In addition, the company’s strong and growing network of financial professionals helps clients make good financial decisions for the long-term.  By establishing enduring relationships with clients, you develop your skills in fact finding and referral prospecting. These skills are at the core of helping your clients achieve their goals and your mission. With your commitment, the assistance of our specialists and the support of your local network office, your vision can become reality. Job Type:Aggressive bonus and commission pay structure. You may also be eligible for new Advisor start up allowance plan. Allowance includes additional pay out over 3 years.Full Medical/Dental/Vison/Health benefits, 401k match, cash balance pension plan, flexible spending account, Life, Disability and Accident insurance available for qualifying Advisors.We promote from within. Management and growth opportunities available.Marketing support provided.Mentoring and on-going support from our seasoned Managers.Residual/renewal income opportunities.Significant bonus sales awards for Rising Leader, First Year Leader, Leader, Blue Chip and Council.Ongoing training opportunities with internal and external sources, one-on-one, field, online and mentoring to support your success.World class annual travel events for top producers.With our sales and marketing systems and support you could be generating leads and business quickly.Flexible schedules, this is not a 9-5 desk job. Financed agents are required to attend meetings and trainings. Otherwise enjoy field work and networking of your own natural market and make your own hours.Be in business for yourself without being by yourself.Job Location:Walnut Creek, CARequired Education:Bachelor's, or equivalent work experienceRequired Experience:Sales: 2 years in a Sales, Marketing and/or Consulting role (preferred)Financial Management: 1 year (preferred)Strong interpersonal skills and customer service focusProficient in market development and networkingProfessional, with solid organizational and presentation skillsEntrepreneurial spirit, with a commitment to personal and professional integrityRequired License or Certification: Life and Health Insurance, which can be obtained through the onboarding process  Financial Securities 6, 63, 65, 7, or 66 (we have resources & training available) Note: Financial Services Representatives are independent contractors and are not employees of MassMutual, its subsidiaries, or of General Agents with whom they contract. Benefit StatementWhat do you expect from a Fortune 500* company? How about a great benefits package that can help give peace of mind to you and the ones you love.  To recruit and retain top talent, we need to offer an outstanding array of benefits. Here are some of the great benefit** offerings: RETIREMENT PROGRAM MassMutual offers a diverse range of valuable benefits in these areas: Cash Balance Plan (Pension)Qualified Thrift/401(k) PlanNonqualified Thrift PlanHealth and welfare benefitsMedical coverageDental and vision coverage.Health Savings Account (HSA)Flexible Spending Account (FSA): dependent careDependent life insuranceDisability income insuranceShort-term disability (STD) insuranceLong-term disability (LTD) insurance * FORTUNE, May 2015  ** Eligibility applies only to those Financial Services Representatives who hold a full-time career contract with MassMutual and who satisfy certain production requirements. Eligibility for subsidized benefits and before-tax coverage is based on meeting certain production requirements. Benefit Plan provisions are subject to modification or termination. This material does not imply your eligibility for any one or all of the plans or programs described.  Financial Services Representatives are independent contractors and are not employees of MassMutual, its subsidiaries, or of General Agents with whom they contract.Financial Services Representatives become eligible for subsidized benefits as part of their contract endorsement date and remain eligible as they maintain production requirements. Must be legally authorized to work in the United States without sponsorship.MassMutual Financial Group refers to Massachusetts Mutual Life Insurance Company(MassMutual), its affiliated companies and sales representatives. Local sales agencies are not subsidiaries of MassMutual or its affiliated companies. Agency officers are not officers of MassMutual. You must be a Registered Representative of MML Investors Services, LLC. to offer securities products. Securities offered through Registered Representatives of MML Investors Services, LLC., Member SIPC (www.sipc.org) [401 Water Tower Circle Suite 201 Colchester, VT 05446 P-802-338-4500.] Financial Services Representatives are independent contractors and are not employees of MassMutual, its subsidiaries, or of General Agents with whom they contract."}