{"jobID": "2655932506", "jobLocation": "Kirkland_WA", "jobTitle": "Lead Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.servicenow.com", "Headquarters": "Santa Clara, CA", "Size": "5001 to 10000 employees", "Founded": " 2004", "Type": " Company - Public (NOW) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " BMC Software, CA Technologies, Salesforce"}, "estimatedSalary": "169000", "jobDescription": "Job Title: Senior Data Scientist - Automation Core  Location: Kirkland, WA ServiceNow is changing the way people work. With a service-orientation toward the activities, tasks and processes that make up day-to-day work life, we help the modern enterprise operate faster and be more scalable than ever before.  We’re disruptive. We work hard but try not to take ourselves too seriously. We are highly adaptable and constantly evolving. We are passionate about our product, and we live for our customers. We have high expectations and a career at ServiceNow means challenging yourself to always be better.What you get to do in this role:Apply machine learning and mathematical approaches to solving IT operations managementDevelop or enhance prototypes and acceptance tests for solutions to IT analytics problems like: Alert correlationComplex event processingAnomaly detectionNLP on IT incidentsCausal analysis and predictionAutomation of IT remediations and processesWork with product managers and engineers to develop solutions to customer problems.Design and perform experiments to analyze/validate solutions to analytics problems In order to be successful, we need someone who has:Solution oriented attitude (you see yourself as a problem solver)Real passion for dataResourceful and creative approach to problemsFlexibility and ability to live with imperfect data, problem definitions, and solutionsTeam oriented attitude (no stars please)Tenacity and patience solving problemsScientific attitude Required Skills & Experience Advanced degree in scientific or engineering discipline3+ years experience in a commercial settingStrong background in statistics, probability, and machine learningExperience with Python scientific stack or RExperience working with machine learning tools like Scikit-Learn, Orange, RapidMiner, Weka, etc.Solid software development skills and understanding of computer science fundamentalsWorking knowledge of SQL We provide competitive compensation, generous benefits and a professional atmosphere. This is a very collaborative and inclusive work environment where individuals strong on aptitude and attitude will have an opportunity to grow their professional careers through working with some of the most advanced technology and talented developers in the business."}