{"jobID": "2830571015", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.bluevoyant.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " BlueVoyant is a global cybersecurity firm that provides Advanced Threat Intelligence for larger companies, and a comprehensive Managed Security Service and Cyber Forensics and Incident Response services for smaller businesses, powered by one of the largest commercially-available cyber threat databases in the world.  With BlueVoyant companies can gain unique and far-reaching visibility into malicious activity on their networks, in the dark web and across the internet, as well as real-time, automatable remediation services. Through our unique real-time external threat monitoring, predictive human and machine-sourced intelligence, and proactive managed security and incident response, BlueVoyant offers the private sector unparalleled distant early warning and exceptional cyber defense capabilities.  BlueVoyant is driven by and dedicated to the mission of protecting our economy and infrastructure from cyber attacks. As a data scientist, you will:Formulate, develop, and evaluate of AI/ML techniques to automatically predict/detect cyber attacksDesign continuous-learning systems that augment analysts abilities to analyze data more quickly and more accuratelyHelp build a foundation for repeatable and scalable data science processesContribute code to the software suite during various elements of the software engineering lifecycleWork closely with analysts and engineersYou should have...Significant expertise with at least two of: Supervised learningTime series analysisOutlier detectionDeep learningDeep knowledge about at least three of: Experiment designHypothesis testingParameter estimationStochastic processesOptimizationUtility theoryFamiliarity with or the capability to learn quickly at least two of: Apache SparkApache BeamTensorflowKafkaExperience with or capability to learn quickly: PythonJavaScalaRMost importantly, strong problem solving and scientific mindset (PhD preferred but not necessary)Youre the kind of person who...Works with evolving goals, priorities, and code baseIs willing to learn and apply software engineering and security best-practicesDesires significant autonomy and can learn independentlyPresents ideas in a business-friendly and user-friendly languageConducts R&D; in a reproducible, systematic, and unbiased fashionLikes punsEnjoys learning and staying up to date with the literatureAbout BlueVoyant BlueVoyant was co-founded by CEO Jim Rosenthal, former Chief Operating Officer at Morgan Stanley, and Executive Chairman Tom Glocer, former Chief Executive Officer at Thomson Reuters. BlueVoyant has attracted a management team that comes from the worlds preeminent intelligence, law enforcement, and private sector organizations.  All employees must be legally authorized to work in the United States.  BlueVoyant provides equal employment opportunities to all employees and applicants without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, BlueVoyant complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities.  BlueVoyant expressly prohibits any form of workplace harassment based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status."}