{"jobID": "2425842129", "jobLocation": "Bellevue_WA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.primeteampartners.com", "Headquarters": "Seattle, WA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "5176 Data Scientist Prime Team Partners is currently partnering with client in the Greater Seattle area to expand their Data Science team. This is an emerging team in Bellevue who is in startup mode. They are working with consumer-centric data, building machine learning tools and models from scratch, and looking for Data Scientists with strong OOP software engineering skills to join the team.  The team is looking for people who are tinkerers with a math, statistics, or computer science background. If you are seeking opportunities where you can demonstrate thought leadership, develop tools, algorithms, and models, and make an immediate impact on the team, this might be the perfect opportunity for you. QualificationsEducational background in mathematics, statistics, or computer science. Bachelor of Science required, Advanced Degrees welcome3-6 years of professional experience in roles that span Software Engineering (OOP, Python) and Data Science (Machine Learning, Statistical Modeling, Data Mining, Bayesian models, Search and Recommender models, Time-Series Analysis)2 or more years of experience working with massive amounts of data and contributing to scalable real-time on-demand consumer facing solutionsAttributes that we are looking forThe kind of person who would love to participate in a mathematics, statistics, and/or computer OlympiadExperience in startup environmentCuriosity to dig into data and identify questions and relationships that no one else has noticed yetScrappiness, resilience, persistence, willingness to tip a problem over to get a better look under the good to figure out the root cause This is a full-time, direct hire opportunity in Bellevue that offers competitive salary, stock options, comprehensive benefits, and the opportunity to make an immediate and lasting impact on the team and their customers. Applicants from Washington are encouraged to apply, out of state applicants are welcome to apply.  For immediate consideration, please send your resume to ashlea@primeteampartners.com. For additional information about Prime Team Partners, please explore our careers page www.primeteampartners.com. Prime Team Partners is an equal opportunity employer. Prime Team Partners does not discriminate on the basis of race, color, religion, national origin, pregnancy status, gender, age, marital status, disability, medical condition, sexual orientation, or any other characteristics protected by applicable state or federal civil rights laws."}