{"jobID": "2545597889", "jobLocation": "Palo_Alto_CA", "jobTitle": "Senior Software Engineer - Autonomous Vehicle System Mapping", "companyRating": "2.8", "companyInfo": {"Website": "www.cyngn.com", "Headquarters": "Palo Alto, CA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "145000", "jobDescription": " Very soon autonomous machines will be everywhere, in surprising places, exciting new form factors both unexpected and delightful. From our Silicon Valley labs, the CYNGN team is bringing this world to life, animating the inanimate and delivering the future...now. All of it brought to you by top tier investors from Andreessen Horowitz, Benchmark, Redpoint, Index Ventures and others. Our Culture: We believe that the best products come from the art of open and honest collaboration. Were constantly experimenting, asking questions, listening to feedback and always ready to take action. We believe that the journey of creating and building is just as important as the final product. This curiosity and learning breeds a workplace for open creativity and trust, creating products that will make everyones lives better. About You: If you love to build, tinker and create with a team of trusted colleagues, then CYNGN is the place for you. Description: We are looking for a Senior Software Engineer to develop a mapping framework for our autonomous vehicle platform. You will be responsible for integrating vehicle sensor data to create a robust solution that is also capable of identifying and correcting map errors derived from fleet data. Skills:Ability to read and understand academic papers and can turn them into production codeExpert coding skills in C/C++ on Linux / UnixAt least 3 years of prior experience in the field of robotics, automotive engineering, or a related fieldDeep understanding of automotive or robotic sensor technologies, calibration, interfaces, and data formatsPrior experience with mapping techniques nonlinear optimization, and probabilistic filteringExperience with embedded systems design, low-level hardware interactionsFamiliar with ROSBachelor Degree in Computer Science, Masters preferredCulture Our office is located in Palo Alto. We believe in a healthy work-life balance. While we work very hard at what we do, we also want you to have room for family, friends, and, of course, yourself. At CYNGN we keep sane work hours so that we can pursue our passions outside of the office.  We offer competitive salaries and an excellent benefits package for all full-time employees. In addition to health insurance and plenty of time off, this includes fully-stocked kitchens, weekly happy hours, shiny new technology, and the occasional in house end of week party. We also offer referral bonuses and ample opportunities for education and career advancement.  #LI-RE1"}