{"jobID": "2794980871", "jobLocation": "Boston_MA", "jobTitle": "Vice President of Operations - Healthcare", "companyRating": null, "companyInfo": {"Website": "www.unidine.com", "Headquarters": "Boston, MA", "Size": "5001 to 10000 employees", "Founded": " 2001", "Type": " Contract", "Industry": " Restaurants, Bars & Food Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Vice President of Operations is a senior team member and key leader for company operations in our Healthcare group. He/she will provide the overall direction and control of our accounts to achieve operating financial results and operating standards within requirements; and will have overall accountability for setting standards, ensuring compliance, achieving profitability, and demonstrating our business values. The ideal candidate will live in MA, CT, NY or GA.  The Vice President of Operations provides guidance, training, and follow up to team members and other key operational personnel to ensure The Unidine Way is implemented and followed through at each account. Responsibilities:Plans and directs the operation of the assigned region in support the Annual Operating Plan (AOP). Develops common direction for the team. Sets priorities and makes team agenda and strategy clear to all team membersParticipates in strategic planning meetings to develop objectives of the divisionDevelops, recommends and implements policies and procedures of the region to ensure maximum income from existing accountsSupports the development and implementation of clinical and patient service programs that meet client needs, regulatory agency requirements and meet client, patient and customer satisfactionAcquires profitable new business and expands existing business within the assigned geographic area. Participates in the sales process for the acquisition of new business. Coordinates the development of proposals and contracts. Prepares and conducts presentations to prospective clientsConducts Team meetings with Regional Team Members to discuss current objectives. Prepares agendas and conducts training sessions and presentations on issues regarding quality, safety and human resourcesDevelops and maintains annual budget. Monitors financial reports of the region to ensure budgetary compliance with Regional and Corporate goalsDevelops and motivates an effective management and clinical staff to achieve Regional and Corporate goals and make efficient use of human resourcesInterfaces with existing clients to maintain client satisfaction and account retentionResolves client, patient and customer satisfaction or employee related complaints which have been elevated from District Managers. Interfaces with legal and human resources to obtain procedures for various customer and employee related chargesConducts appropriate annual and semi-annual performance evaluationsCompletes all QAs & reports as outlined in the corporate policy and procedures on a timely basis meeting all prescribed deadlineProjects and practices consistent ownership attributes, which provide a high level of customer service at all points of contactTrains, motivates and develops management personnel to achieve high level of morale and efficient use of human resourcesRequired Skills and Abilities:Proven ability to manage a team of five or more director level or above team membersStrong organizational, problem-solving, and analytical skillsAbility to manage priorities and workflowAbility to work independently and as a member of various teams and committeesProven ability to handle multiple projects and meet deadlinesStrong interpersonal skillsAbility to prepare reports and business correspondence at a CEO level; excellent presentation skills at the CEO levelAbility to deal effectively with a diversity of individuals at all organizational levelsGood judgment with the ability to make timely and sound decisionsCreative, flexible, and innovative team playerCommitment to excellence and high standardsVersatility, flexibility, and a willingness to work within constantly changing priorities with enthusiasmQualifications:Bachelor’s degree in Business or Health Care related field, or equivalent degree or equivalent related experienceProven ability to manage a team of six or more director level or above team members - REQUIREDMinimum of five (5) years’ experience in multi-unit food and nutrition service management - REQUIREDExperience managing 8+ multi-unit foodservice accounts – REQUIREDCertified Dietary Manager (CDM) certification highly desirableExperience with multi-unit food and nutrition service management with a combined managed volume of $15 million or greaterStrong track record of driving patient and customer satisfactionProven ability in developing and implementing new business models in the healthcare food service marketProven ability to work effectively in an unstructured, fast-paced and P&L; driven environmentExcellent written and verbal communication skillsMust be experienced with computers; to include Microsoft Office (Word, Excel and Power Point), Outlook, E-mail and the InternetMust be willing to participate in patient/resident satisfaction programs/activitiesServSafe certified highly desirableMust be able to successfully complete criminal background checks (State and Federal) and drug screeningsAbility to successfully navigate within varying degrees of ambiguity in a fast-paced environmentExtensive travel required in this positionWork Environment:Requires repetitive wrist motion.Unidine is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, disability status, protected veteran status or any other characteristic protected by law."}