{"jobID": "2792338555", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist, Graph Analytics", "companyRating": "4.2", "companyInfo": {"Website": "www.doximity.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "229000", "jobDescription": " Doximity is transforming the healthcare industry. Our mission is to help doctors save time so they can provide better care for patients.  We value diversity — in backgrounds and in experiences. Healthcare is a universal concern, and we need people from all backgrounds to help build the future of healthcare. Our data science team is deliberate and self-reflective about the kind of data team and culture that we are building, seeking data scientists and engineers that are not only strong in their own aptitudes but care deeply about supporting each others growth. We have one of the richest healthcare datasets in the world, and our team brings a diverse set of technical and cultural backgrounds.  Doximity’s social network has over 70% of US doctors as members and 40M connections among them. We currently are looking for a data scientist to lead a team of other data scientists, data engineers and data analysts with the goal of utilizing this medical graph to better connect and promote discussion among our clinician members.  How you’ll make an impact: Build link prediction models to recommend colleagues for our members to connect and engage with (the “people you may know” problem) to increase user engagement across Doximity’s platforms.Leverage data from Doximity’s social graph to improve the user personalization models that recommend medical and social content to our clinician members.Discover trends and new business opportunities from physician’s medical claims and referral networks.Provide technical leadership to other data scientists and data engineers working on our growth and colleaguing product teams. What we’re looking for: 4+ years of industry experience and M.S./Ph.D. in Computer Science, Engineering, Statistics, or other relevant technical field.4+ years experience with various machine learning methods (classification, clustering, natural language processing, ensemble methods) and parameters that affect their performance.Experience applying graph theory, analytics, and processing to industry problems.Solid engineering skills to build scalable solutions and help automate data processing challenges.Desire to provide technical leadership and mentorship to other data team members.Excellent problem-solving skills and ability to connect data science work to product impacts.Fluent in SQL and Python; experience using Apache Spark (pyspark)Experience working with relational and non-relational databases. Nice to have: Experience with neo4j and either Spark GraphX or GraphFrames for performing graph analytics About Doximity  We’re thrilled to be named the Fastest Growing Company in the Bay Area, and one of Fast Company’s Most Innovative Companies. Joining Doximity means being part of an incredibly talented and humble team. We work on amazing products that over 70% of US doctors (and over one million healthcare professionals) use to make their busy lives a little easier. We’re driven by the goal of improving inefficiencies in our $2.5 trillion U.S. healthcare system and love creating technology that has a real, meaningful impact on people’s lives. To learn more about our team, culture, and users, check out our careers page, company blog, and engineering blog. We’re growing fast, and there’s plenty of opportunity for you to make an impact—join us! Doximity is proud to be an equal opportunity employer, and committed to providing employment opportunities regardless of race, religious creed, color, national origin, ancestry, physical disability, mental disability, medical condition, genetic information, marital status, sex, gender, gender identity, gender expression, pregnancy, childbirth and breastfeeding, age, sexual orientation, military or veteran status, or any other protected classification. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law."}