{"jobID": "2732221248", "jobLocation": "New_York_NY", "jobTitle": "1057 A&T; Vibrations Analyst", "companyRating": null, "companyInfo": {"Website": "www.akfgroup.com", "Headquarters": "New York, NY", "Size": "201 to 500 employees", "Founded": " 1989", "Type": " Company - Public", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "General: AKF Analysis & Testing is currently  offering an opportunity for a vibration specialist to join our exciting client  oriented group within AKF. The majority of the responsibilities would  be going into the field operating a vibration analyzer, collecting  data, data review and producing a final report. We  are fast paced team visiting a multiple of different commercial and campus  facilities in a week. Responsibilities: Data acquisition via handheld data  collector and monitoring systemsPerform vibration analysis on  rotating equipmentPerform shaft ring installment on  all type of motorsPerform laser alignments on all  types of fan systemsPerform critical speed testing and  programming on all types of VFD'sPerform mechanical troubleshooting  on all types of equipmentPerform commissioning and acceptance  testing on new equipmentProvide concise and urgent reports  including recommendations for repairs of mechanical equipmentDesign data bases for each buildingAdditional tasks may involve  weekend/evening work, as well as travel and overtime work on occasionSkills/Qualifications:Machine  fault diagnosisExcellent  computer skillsStrong  understanding of machinery and electromechanical fundamentalsAble  to recognize opportunities for our clients that will benefit equipment  reliability is a definite plusUnderstanding  of how a commercial building operates along with pumps, fans, generators,  cooling towers & critical systems (not required but desired).Must  possess excellent writing and verbal skills in relation to the technical  aspects of this work.Required/PreferredCredentials:Bachelor’s  degree in mechanical / electrical engineeringMinimum  5 years applicable field experienceLevel 2  vibration analyst certification and 4 years analysis experiencePreferable  knowledge of Emerson CSI software and 2130 vibration meterJob Classification  and Scheduled work hours:Full  Time Salaried Exempt Employee. Exempt employees are ineligible for  Overtime Pay.Standard  workweek is Monday-FridayMinimum  8 working hours/day (40 hours/week Monday-Friday) within the firm’s hours of operation of  7:00a.m.-6:00p.m.You  may be required to work extra hours in order to meet client’s demands and  project delivery target dates.Travel  to client meetings and worksites may be required on occasion."}