{"jobID": "2786572792", "jobLocation": "San_Francisco_CA", "jobTitle": "Estimator", "companyRating": "4.2", "companyInfo": {"Website": "www.webcor.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 1971", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Pankow Builders, Hathaway Dinwiddie Construction"}, "estimatedSalary": "85000", "jobDescription": " Estimator Location  CA-San Francisco Department  112-No CA Estimating Employment Duration  Full timeApply NowWho We Are: Webcor employs people of integrity and passion to build diverse, high-profile, and innovative structures for our clients. Webcor was founded in San Francisco in 1971. We are still headquartered in San Francisco and are committed to growing throughout California (and beyond). Through career development and employee-specific rotation plans, we foster collaboration across our construction management divisions (Core & Shell and Special Projects) and self-perform groups (Concrete, Interior Construction Group, and Paramount Drywall). We provide craft professionals, experienced professionals, and new graduates with financial, health, and wellness benefits that encourage and reward individual contribution. Why Join Us?We love to build for both public and private owners. We don’t shy away from what we have never done before.We are deeply connected to continuous improvement. We welcome better ways of doing things.The U.S. GREEN BUILDING COUNCIL has recognized us with multiple LEED PLATINUM awards for our commitment to sustainable design, communities, and construction.Career tracks are clear and we encourage employee mobility and development.We pay an average of over 85% of the cost of medical benefits for employees and their families. We cover the total cost of dental, vision, life, and disability insurance. We offer a generous 401(k) match. And we offer a range of other benefits, from a wellness program to legal assistance.What You’ll Do: At Webcor, you will work for a builder that’s highly respected in the industry and the community. As an Estimator, you will: Interface with a wide variety of professional people including architects, owner representatives, subcontractors, suppliers, etc.Perform a variety of estimating duties including quantity take-offs, database input, coordination of bid documents for distribution to Subcontractors, research of product data and suppliers.Compare competitive bids and prepare Bid Tabs on certain scopes of work.Ensure that bidders have a complete set of bid documents, including alternates, and that their bid is filled in a timely manner.What You Need to Succeed:Bachelor’s degree (preferably in Construction Management, Civil Engineering, Mechanical Engineering or Architecture) or equivalent experience.A minimum of 2 years’ experience as a Project Engineer or equivalent.Working knowledge of design development, estimating, construction drawings, costs and principles.Strong computer skills with the ability to use MS Office with proficiency (Word, Excel, Outlook) as well as estimating software.You are authentic and are known for going above and beyond what is asked of you.You are highly analytical, versatile, extremely organized and able to handle multiple tasks simultaneously.Webcor is an Equal Opportunity Employer."}