{"jobID": "2830930436", "jobLocation": "New_York_NY", "jobTitle": "Chicago Pop-Up Manager", "companyRating": null, "companyInfo": {"Website": "www.forcebrands.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About The PositionOverview As the Chicago Pop-Up Manager, you will be supporting and leading the local team in day-to-day store operations and be responsible for team management tasks. We are looking for a quick thinker and problem solver to help us bring a unique retail experience to Chicago. In this role, you will be a present mentor and coach for the store team and manage the front-of-house and back-of-house retail operations to create the best customer experience possible. You will be a part of the Chicago pop-up team and help bring the local Glossier experience to life.  Full-time only  Start date: August 2018  Duration: 2 months ResponsibilitiesTeam ManagementStaffing: schedule shifts, create daily zone chartsManage team flow on the floor and re-assign editors based on staffing needsMonitor individual performance of each editorWork strategically with the leadership team to constantly improve the team's performanceBuild and maintain team cultureMaintenanceKeep the pop-up well stocked and clean at all timesReport any maintenance required in the pop-up to the retail teamMaintain constant stock of team supplies (food, bathroom products, etc.)Manage store uniformsStore FeedbackCollect quantitative and qualitative feedback and insights on a daily and weekly basisCollect key KPIs to help us analyze the store performance (traffic, conversion, etc.)Inventory and Back of HouseKeep the inventory room spotless and organizedMaintain inventory and supply for both back-of-house and front-of-houseCoordinate fulfillment from the warehouse with our logistics teamQualifications3+ years of experience in a fast-paced retail environment2+ years of experience leading retail teamsStrong interpersonal skills, with a developed understanding of how to lead and motivate a teamScrappy and entrepreneurial, you are a problem solver by nature and are not afraid of changeAbility to think about the big picture, especially when it comes to customer experienceDesire and willingness to roll up your sleeves and jump in when the situation requires itPassion for building an exceptional customer experience, and understanding that the devil is in the detailsAbility to work a flexible schedule, including evenings and weekendsAble to work starting in mid-August, for about 2 monthsAbout Glossier Glossier is a beauty company that lives in NYC, is sold on the internet, and promotes a skincare-first philosophy that celebrates beauty in real life. "}