{"jobID": "2750436228", "jobLocation": "San_Anselmo_CA", "jobTitle": "Director of Health Services (RN, Nurse, School Nurse)", "companyRating": "3.0", "companyInfo": {"Website": "www.sandomenico.org", "Headquarters": "San Anselmo, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "75", "jobDescription": "2018 - 2019 Academic Year(Full-Time 1.0 FTE)*On-campus housing available (1-2 bdrm depending on occupant(s))Who we are At San Domenico, we believe that what students do with their education is as important as their academic performance. Everyday we encourage our students to not just study, but also to reflect on their learning, find their purpose, and celebrate in community, because an exceptional education, where values and academics join together, creates more than just great students – it develops great people. San Domenico is a K-12, co-ed school, with international boarding and day students in our Upper School. Purpose Statement The job of the Director of Health Services supports San Domenico’s mission by managing the health services program for the assessment, evaluation, maintenance and improvement of the health of students; strengthening and facilitating the educational process by improving and protecting the health status of students; participating in the identification of and assisting in the removal or modification of health related barriers to learning in individual students; promoting the prevention of illness and disability as well as early detection and correction of health problems. The health of the larger San Domenico community, including families, faculty, and staff, is supported by the public health promotion efforts of the Director of Health Services. The Director of Health Services may live on campus in our Boarding Program housing. Job Responsibilities of a Director of Health ServicesAdministers basic health care and First Aid for the purpose of providing appropriate care for ill, medically fragile and/or injured children in compliance with the California Nursing Practice Act.Provides direct nursing services to students with special medical needs who require care during the school day for the purpose of supporting the student educational process.Supervises staff that support the health services department for the purpose of providing a full complement of services.Supports the counseling department in providing human sexuality education to students in all three divisions.Assesses and evaluates the health and developmental status of pupils for the purpose of identifying physical disorders and other factors affecting the learning process, communicating with the primary care provider, and contributing significant information in order to modify the pupil’s individualized education/health plan.Collaborates with parents, students, health care providers, and/or other agencies for the purpose of promoting needed treatment, securing information and complying with legal requirements.Conducts programs and/or activities (e.g. in-service training, hearing, vision, color vision, immunization review, scoliosis screening, etc.) for the purpose of ensuring compliance with government mandated requirements.Designs health maintenance plans for the purpose of addressing students' health needs and implementing health care directions from parents and/or physicians.Directs department functions for the purpose of prioritizing project deadlines and ensuring optimal utilization of personnel.Interprets the health and developmental assessment to parents, teachers, administrators, and other professionals directly concerned with the student for the purpose of serving as an advocate for those students with identified health problems and concerns.Maintains communication with parents and all involved community practitioners and agencies for the purpose of promoting needed treatment and securing reports of findings pertinent to educational planning.Maintains health care plans, medical emergency cards, immunization records of all site students for the purpose of ensuring compliance with state law and providing information required for intra-district transfer of records as needed.Monitors all student medications administered at school as prescribed by a physician, manages the process for preparing and delivering medications to students, and trains faculty on the principles of medication administration for the purpose of ensuring safety and compliance with state law.Prepares a wide variety of written materials (e.g. quantity reports, student activities, correspondence, etc.) for the purpose of documenting activities, providing written reference and/or conveying information in compliance with state law.Refers students and his/her parent/s or guardian/s requiring further medical attention and provides appropriate community resources of necessary services and assuring continuity of health service and care.Reports cases of suspected child abuse for the purpose of ensuring compliance with all related requirement of the lawProvides annual training to faculty and staff on a variety of health topics including anaphylaxis diabetes and blood borne pathogens to all staff for the purpose of maintaining the health and safety of both students and faculty.Tracks cases of communicable disease among students and reports to local public health authorities as appropriate for the purpose of providing infection control and complying with legal requirements. Communicates communicable disease outbreaks to families and employees.Responds to medical emergency situations for the purpose of addressing immediate safety concerns. Maintains emergency equipment, develops and reviews emergency protocols and participates in emergency preparedness planning.*School housing includes additional boarding program duties - if housing is not needed/provided, occasional availability for ‘after hours’ callsQualifications:Bachelor’s DegreeCurrent California RN LicenseExcellent written and verbal communication skillsProject management skills to oversee several projects concurrently and meet deadlines effectivelyAbility to work some evenings and weekendsProficiency of software applications including but not limited to Word, Excel, PowerPointHigh level of energy; willingness and flexibility to take on and accomplish multiple and varying assignments in a fast-paced environmentCompensation: Salary commensurate with experience, plus an excellent benefits package including medical/dental/vision/life/403b retirement plan match and daily lunch.  *Position may include housing on campus with included room & board. If provided, salary may be adjusted. How to apply: Please send a letter describing how your experience and skills will contribute to the position, along with your resume and salary requirements via email.  Or mail to:  San Domenico School  1500 Butterfield Road  San Anselmo, CA 94960  Attn: Director of Health Services position  San Domenico School is Equal Opportunity Employer and values diversity.  All qualified applicants will receive consideration for employment without regard to race, color, national origin, ancestry, sex, sexual orientation, gender, gender identity or expression, genetic information, age, disability, medical condition, religion, veteran status, marital-status or any other classification protected by applicable local, state or federal laws.  No phone calls please.Keywords: Nurse, RN, Registered Nurse, School Nurse"}