{"jobID": "2744476120", "jobLocation": "San_Jose_CA", "jobTitle": "Senior Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.hpe.com", "Headquarters": "Palo Alto, CA", "Size": "10000+ employees", "Founded": " 2015", "Type": " Company - Public (HPE) ", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Oracle, Accenture"}, "estimatedSalary": "132000", "jobDescription": " Hewlett Packard Enterprise is an industry leading technology company that enables customers to go further, faster. With the industrys most comprehensive portfolio, spanning the cloud to the data center to workplace applications, our technology and services help customers around the world make IT more efficient, more productive and more secure.  We are currently looking for a Sr. Data Scientist to join our growing Infosight Data Science and Services team. As part of the Nimble Infosight team at HPE, you will work on cutting-edge projects, with high visibility!  If you have the relevant experience, have a passion for quality and good software engineering practices, and enjoy working in a fast paced, highly rewarding environment, then HPE is the place for you. #CBHPE  InfoSight collects hundreds of terabytes of operational and diagnostic telemetry from our customers, which enables us to help them get the most out of their IT infrastructure. We are looking for an enthusiastic data scientist with an interest in deriving actionable insights from this ever-growing telemetry dataset. You will work closely with our data science, engineering, customer support and product management teams on a variety of analytics projects including but not limited to large-scale product diagnostics and studies to determine the prioritization of new product features.  Responsibilities- Design, develop, and deliver machine learning/AI enabled solutionsAnalyze large datasets in a production ready environment, using Nimbles InfoSight platformDevelop working prototypes of algorithms and evaluate using real-world data setsIdentify/develop appropriate machine learning techniques to uncover the value of the dataIdentify, analyze and interpret trends or pattern in complex data sets, including telemetry from storage arrays and other IT infrastructure componentsUse advanced machine learning techniques to predict or alert in case of failures, and recommend actions that can mitigate or resolve them.Carefully scrutinize all analyses for sources for possible bias, error, or uncertaintyAutomate data collection, pre-processing and/or analysisCommunicate findings clearly and succinctly to technical and non-technical audience.Look at trillions of sensors from customers and analyze dataUse trends to build ML models that help make predictions and/or recommendations Education and Experience Required: Ph.D., or Masters with equivalent experience, in Computer Science, Statistics, Mathematics, or related areas, with at least 3 years of experience in machine learning, data mining, and statistical analysis.Proven aptitude for writing complex SQL queries and scripting in Python, Bash, R, Perl, or similar.Ability to work independently in a fast-paced, iterative development environment.exemplary communication skills and ability to work with cross-functional teams.Experience working with large data sets, distributed computing tools (Spark, Scala), and basic understanding of systems architecture preferred. Additional Job Description Machine Learning - MustProven aptitude for writing complex SQL queries and scripting in Python, Bash, R, Perl, or similar.Strong knowledge of tools for data processing and information retrievalAbility to work independently in a fast-paced, iterative development environment.Exemplary communication skills and ability to work with cross-functional teams.Experience working with large data sets, distributed computing tools (Spark, Scala), and basic understanding of systems architecture preferredDeep Learning - plusAI plusHadoop-plusContainer technologies like Kubernetes, Docker, Mesos Docker -plus Hewlett Packard Enterprise is EEO F/M/Protected Veteran/ Individual with Disabilities. HPE will comply with all applicable laws related to the use of arrest and conviction records, including the San Francisco Fair Chance Ordinance and similar laws and will consider for employment qualified applicants with criminal histories."}