{"jobID": "2656772000", "jobLocation": "New_York_NY", "jobTitle": "Fiori HTML5/UI5 Sr. Developer", "companyRating": null, "companyInfo": {"Website": "www.tgv.com.ar", "Headquarters": "Buenos Aires, Argentina", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Unknown", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "TGV AMERICAS is looking for a Fiori HTML5/UI5 Sr. DeveloperExperience and Skills  o Front End Development with HTML5, CSS3, JavaScript, JQuery.  o Experience with MVC development model.  o Experience in SAPUI5 is preferable.  o Proficient understanding of web markup, including HTML5 and CSS3.  o Proficient understanding of cross-browser compatibility issues and ways to work around them.  o Fair understanding of JavaScript programming and DOM manipulation.  o Proficient understanding of code versioning tools, such as GIT: As part of the Delivery team, and under the supervision of ERP staff, the UI5 and HTML5Responsibilities: Develop new user-facing features · Build reusable code and libraries for future use · Ensure the technical feasibility of UI/UX designs · Optimize application for maximum speed and scalability · Assure that all user input is validated before submitting to back-end · Collaborate with other team members and stakeholders · Build HTML5 user interfaces using Javascript, JQuery, CSS3. · Effectively analyses and supports the design of User Interfaces. · Ability to use oData to consume and update data into HTML5/UI5 application. · Creates Functional Acceptance Testing Documents. · Prepares technical and user documentation for entire systems and interdependent applications; prepares training materials and detailed technical presentations.  · Keeps abreast of developments in the field and determines the need for testing and evaluating new products and technologies; provides leadership on introducing technological changes; prepares various technical reports.Project Location: New York City Long term assignmentLooking for a major career challenge?, Apply by sending your resumé to pdelareta@tgv.com.ar"}