{"jobID": "2807442163", "jobLocation": "San_Francisco_CA", "jobTitle": "Travel Registered Nurse RN Pediatrics", "companyRating": "4.0", "companyInfo": {"Website": "www.onestaffmedical.com", "Headquarters": "Omaha, NE", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "62", "jobDescription": " JOB DESCRIPTIONTravel Registered Nurse RN PediatricsLocation: SAN FRANCISCO,  California Shift: 7:00 pm - 7:30 am  includes a 30 min break Start Date: 6/10/2018 Speciality: RN - PEDS - PEDIATRICS Occupation Category: 29-1065.00 - Pediatricians, GeneralDesctiption: We. Are. OneStaff. Medical. An independently-owned, nationally-recognized and amazingly awesome staffing firm ready to work for you!  A work ethic forged in the Midwest, we’re here to stand by your side and help you find your dream assignment anywhere in this great country.  We want the same like-minded, awesome candidates to travel with us. Be bold. Enjoy work again. Let us help.  Now back to what you’re here for; we’re looking for a Travel Registered Nurse RN Pediatrics to join our family, and well, that’s you! So check this out…  Pediatric Nurses work with patients from infancy to young adulthood, giving developmental screenings, immunizations, and treating common illnesses like chicken pox and tonsillitis. They work closely with family doctors, pediatricians and other nurses, to provide preventative as well as critical care. As a Pediatric Nurse, you’ll also teach your patients’ parents and family members how to prevent childhood diseases, and about proper nutrition for growth and development. Experience Requirements:Minimum 1 year of current work experience in Travel Registered Nurse RN PediatricsCalifornia state Healthcare Provider license or willing to obtainThis position may require one or more of these certifications: BLS, PALS  & possibly othersBenefits: Are you in? Do we need to further convince you why OneStaff Medical is your ideal travel partner? How about: A dedicated expert (our recruiter) to be by your side 24/7; every step of the process, and to ensure you get exactly what you are looking for!All the good stuff like; Medical/Dental/Vision Insurance & 401KDream assignments, with guaranteed hours, all across the country; from sunny California, down to sun-kissed Florida, we got ‘em!Travel reimbursement as part of your weekly pay!Licensure and certification reimbursement to our return travelers, when needed for new assignments!Some hot-hot-hot referral bonuses! (uh hum, so travel w/ an amigo(a) and get paid $500!)  …and FREE super soft premium scrubs through our partners, FIGs scrubs, to all of our loyal return nurses! Are you in? Do you love to travel, and this sounds like an ideal fit? Stop thinking. Do it. Let’s dance! Apply now.  If you have any questions or would like to discuss a particular position please feel free to call a recruiter at 1-877-783-1483 or email  info@onestaffmedical.com  Date Posted: 6/7/2018Contract"}