{"jobID": "2821580572", "jobLocation": "Kirkland_WA", "jobTitle": "Data Scientist - Analytics Engineering", "companyRating": "3.9", "companyInfo": {"Website": "www.swisslog.com", "Headquarters": "Buchs, Switzerland", "Size": "1001 to 5000 employees", "Founded": " 1900", "Type": " Company - Public (SLOG) ", "Industry": " Transportation & Logistics", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "117000", "jobDescription": " Data Scientist - Analytics Engineering - Swisslog designs, develops and delivers best-in-class automation solutions for forward-thinking hospitals, warehouses and distribution centers. We offer integrated systems and services from a single source - from consulting to design, implementation and lifetime customer service. Behind the company's success are 2 300 employees worldwide, supporting customers in more than 50 countries. The Healthcare Solutions portfolio comprises automated material handling and drug management systems for hospital facilities that increase efficiency and enhance the patient experience in forward-thinking hospitals. Swisslog automated material handling solutions provide quick, flexible and safe transportation of medications, specimens and basic supplies throughout hospitals and across medical center campuses, while its medication management solutions address packaging, labeling, storage and dispensing for inpatient and outpatient pharmacies.Data Scientist - Analytics EngineeringLocation: Kirkland, WA The Data Scientist is a key member of our Pharmacy Automation Software Analytics team and will lead development of intelligent solutions for new analytics product offerings, as well as guide the establishment of our next generation data ingestion, transformation, and analysis capabilities, transforming our current practices to take advantage of these capabilities. Your Responsibilities  Identify important and interesting questions and challenges related to product capabilities and business operations and translate those questions into concrete analytical tasks and data systems  Recommend strategies for design and implementation of scalable, intelligent systems, setting customer or team expectations regarding project timelines and algorithm development  Provide thought-leadership in the area of analytics/data science for analytics product and future applications  Develop and support external and internal data analysis and visualization/dashboarding in Tableau  Develop the mapping, extraction, and unification (ETL) pipeline of data from numerous structured and unstructured healthcare sources into AWS for visualization and mining in novel applications  Design and implement complex queries utilizing SQL Commands, Views, Stored Procedures  Work closely with product management to plan and codify product capabilities and requirements  Assist with critical analysis of test results and deliver solutions to problem areas  Identify and research data structures and challenges with minimum documentation  Analyze process challenges and make suggestions for the prevention of future problems  Perform other duties, as assigned.Your Profile  Proven ability to assess business problems and create, investigate, and deploy new statistical and machine learning-based approaches to improve business outcomes, defining the necessary pipelines, creating required analytical datasets, and developing clear, well-documented solutions  Expertise in statistical tools like Python/R with knowledge of scientific/analytics libraries (pandas, scikit-learn, numpy, scipy, TensorFlow, Spark)  Experience visually exploring data and creating production ready dashboards in Tableau  Experience working with SQL (MSSQL, PostGreSQL, data warehousing concepts) and ability to write complex SQL queries  Migration and ETL experience with moving on-premise data in/out of AWS cloud services including S3, RDS, and Redshift  Excellent interpersonal and communications skills (both verbally and written), can effectively convey logical rationale for decisions and explain the results and implications of experiments  Advanced Degree in related quantitative fields or clear demonstration of 2-5 years of relevant experience Desirable but not essential: Experience with inventory and supply chain management is a major plus  Experience in the Healthcare industry a plus  Experience developing intelligent, prescriptive analytics applications  Experience in C#, Java, and JavaScriptWe Offer Swisslog offers challenging work in a globally networked environment as well as competitive base salary, comprehensive benefits including health/dental and above-market 401K!  OUR SOLUTIONS DELIVER RESULTS. OUR EMPLOYEES DELIVER SOLUTIONS. Swisslog is an EEO Employer, Females/Minority/Veterans/Disabled/Sexual Orientation/Gender Identity  Swisslog's FMLA policy can be found at: *********************************************************  Federal law requires employers to provide reasonable accommodation to qualified individuals with disabilities. If you require reasonable accommodation to complete the application or to perform your job, please contact Human Resources at *******************************  Contact  Andy Levine  Talent Acquisition Manager"}