{"jobID": "2831116949", "jobLocation": "San_Francisco_CA", "jobTitle": "Business & Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.thecsicompanies.com", "Headquarters": "Jacksonville, FL", "Size": "Unknown", "Founded": " 1994", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The CSI Companies is currently seeking a Business & Data Analyst to support one of our clients, a leading global health and technology provider, in their San Francisco, CA office. Essential Duties and Responsibilities: • Inventory Management in an outsourced 3PL/Hub based distribution process.  • Subcontracting process, Vendor Consignment Inventory.  • Physical Inventory, Cycle counting and daily reconciliations processes.  • Inventory Receiving, Inspections and Quality Management process.  • Inventory Controls and Transactions (Lot, Serial, FIFO, LIFO, Inter company, Returns)  • Warehousing Pick, Pack and Ship processes with Transportation/Carrier management.  • B2B XML/EDI integrations with 3PL for Logistics and Inventory process.  • Customer Facing documentations (Packing Slips, Labels, Commercial Invoices).  • Logistics KPI and Logistics reporting using BI Dashboards and Standard reports.  • Drives documentation of business processes, provides analysis and suggestions required to improve the productivity of the individuals or organizations using those processes. (NOT limited to ERP tools).  • Manage, Identify, Troubleshoot and fix issues in Production, Unit test, System integration test and user acceptance test.  • Works cross functionally to lead the effort to fix the issue and documenting what changes are needed (customizations and/or new business processes).  • Leads cross functional effort to formally document processes, procedures and user guides.  • Work with 3PL IT teams on system Integration and support.  • Onboarding of new Customers/Suppliers by working with internal teams and third-party consulting EDI service providers for integration. Knowledge & Experience: • Bachelors in MIS, Computer Science or Business.  • 1+ Year of Inventory and Supply Chain Understanding or experience through College.  • Tech Savvy and ready to learn and understand application with training provided.  • Should have a good Excel and Access hands on experience. Skills & Ability: • Strong interpersonal skills and communication skills to interact with all levels of an organization.  • Demonstrates good judgment in selecting methods and techniques for obtaining solutions.  • Ability to work independently and within a team environment.  • Strong organizational and multitasking capabilities.  • Work with minimum supervision.  • Ability to work in a fast pace environment is a plus!  • Ability to work effectively in a complex and dynamic environment.  • Ability to Multi task on all levels  • Analytical skills to solve complex problems.  • Ability to create and implement solid business process changes.  • Ability to work effectively in a team environment. Requirements:  •1+ Year of Inventory and Supply Chain Understanding or experience through College.  •Tech Savvy and ready to learn and understand application with training provided.  •Should have a good Excel and Access hands on experience.  •Ability to communicate, Run reports.  Please apply if interested!"}