{"jobID": "2676361759", "jobLocation": "Menlo_Park_CA", "jobTitle": "Data Analyst, Spam Operations", "companyRating": "4.5", "companyInfo": {"Website": "www.facebook.com", "Headquarters": "Menlo Park, CA", "Size": "10000+ employees", "Founded": " 2004", "Type": " Company - Public (FB) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Google, Snap, Uber"}, "estimatedSalary": "108000", "jobDescription": " Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities we're just getting started.Community Operations' focus is on supporting our users through both direct support interactions as well as scalable solutions, and on improving the health of our products by helping people understand how to use them. Those who join our teams are very passionate about solving peoples issues, and are strong advocates for the Facebook community. We need influencers who can align cross-functional partners to ensure the best possible experience for our platforms. If you like helping people, Community Operations is for you.  Facebook is seeking a solutions-oriented, data-savvy self-starter with a passion for helping others, protecting our community and being the voice of our users. This individual will sit within the Global Spam Operations team, and work to improve the overall user experience by delivering qualitative and quantitative insight into user behavior. By providing support to individuals in need, the Data Analyst will identify areas for process improvement, help us intelligently scale our operations by optimizing and automating processes and solve challenging problems and help to prevent them.  This position is full-time and based in our Menlo Park, CA office. Responsibilities:"}