{"jobID": "2663362526", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist, Product", "companyRating": "4.0", "companyInfo": {"Website": "www.twitter.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2006", "Type": " Company - Public (TWTR) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Facebook, Google, Pinterest"}, "estimatedSalary": "149000", "jobDescription": " Data Scientist, Product San Francisco, CAWho We Are:Twitter users generate many terabytes of data every single day; Twitter engineers run hundreds of experiments; Twitter data scientists craft increasingly sophisticated models of users and content. The Analytics team’s mission is to empower product and business through impactful and creative applications of experimentation, machine learning, and data analysis.What You’ll Do:You will be a key member of the Product Data Science group within the Analytics team working closely with our partners in engineering, product, design, and user research. Your work will directly influence the exciting new product areas that Twitter is building.As such, you will:Conduct analyses to learn from our vast amount of dataApply advanced statistical techniques to model user behavior, identify causal impact and attribution, build and benchmark metrics.Write complex data flows using SQL, Spark, Scalding, R and Python scripts.Use data visualization tools (e.g, Tableau, Zeppelin) to share ongoing insights.Communicate findings to executives and cross-functional product teams.Who You Are:You have an advanced degree with a background in quantitative analysis or possess commensurate work experience using these skills to solve problems and answer questions in an industry setting.You are a self-starter who is capable of learning on the job, takes initiative, and can thrive within a large team. You can pivot from blockers and develop a new approach when there are no precedents.You have experience owning complex projects from start to finish and influencing entire organizations with the work you do. You define a data science roadmap and execute against it in collaboration with others.You are passionate about insights, not just data. You’re a strategic thinker and are able to synthesize methodology and data into actionable business and/or product strategy from your analyses.You communicate your findings clearly and effectively to a wide audience of relevant partners, and are capable of building meaningful presentations and analyses that tell a story.You are personable, empathetic, and able to connect with each and every person on the team and throughout the company.We are committed to an inclusive and diverse Twitter. Twitter is an equal opportunity employer.We do not discriminate based on race, color, ethnicity, ancestry, national origin, religion, sex, gender, gender identity, gender expression, sexual orientation, age, disability, veteran status, genetic information, marital status or any legally protected status.San Francisco applicants: Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records. Engineering"}