{"jobID": "2587049469", "jobLocation": "San_Jose_CA", "jobTitle": "Dental Assistant- Ortho", "companyRating": "3.2", "companyInfo": {"Website": "www.westerndental.com", "Headquarters": "Orange, CA", "Size": "5001 to 10000 employees", "Founded": " 1903", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " InterDent"}, "estimatedSalary": "14", "jobDescription": " Requisition Number 17-2923 Title Dental Assistant- Ortho City San Jose State CA Zip Code 95122 Description  The qualified applicant will assist the dentist at the chair while they are engaged in treatment with patients,  anticipate dentist's needs and be prepared for next steps, and ensure all OSHA, Dental Board, and company  policies and procedures are properly followed. Come join a fun, friendly, professional company where we care greatly about our staff. Advance your career with us! RequirementsMaintain proper patient treatment recordsAbility to take Blood PressureGive pre and post operative instructions - within the limits designated by the dentistProvide oral hygiene instructions to the patientTurn on all units, switches, and water before patient sits downStocks supplies in operatories, restrooms, lab, etc. as neededInforms Floor Supervisor when supplies need to be re-orderedInforms Floor Supervisor of broken or malfunctioning equipmentPerforms all duties of a Sterilizer when deemed necessaryAbility to build good rapport with patients and staffWith the exception of bonding, etching, and appliance impressions, all orthodontic procedures permitted by law, including: placing, ligating or removing arch wires, fitting or removing bands,  curing, taking diagnostic cast impressions, power chain, placing elastics or separators and changing tiesWestern Dental – Brident offers a competitive benefit package designed to enhance the lives of our team members. Team members are eligible for benefits based on their full time status.Paid Time Off (PTO)Holiday PayMedicalDentalVisionContinuing education and advancement opportunities401 (k) plan Requirements Certification in the state you are applying as an RDA (CA, AZ, NV, TX)Must have a current X-Ray License, or be willing to sign an agreement to obtain such license within six (6) months of employmentMust have a current CPR certification, or be willing to sign an agreement to obtain such certification within one (1) month of employmentKnowledge of OSHA and safety complianceWorking knowledge of dental equipment"}