{"jobID": "2670394064", "jobLocation": "New_York_NY", "jobTitle": "Search Planner", "companyRating": null, "companyInfo": {"Website": "www.neoogilvy.com", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " 2006", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Search Planners are expected to understand, communicate and execute all things related to Paid Search, including keyword management on a global scale, bid and budget management, and integrated media leadership. The Search Planner is someone who has an entrepreneurial spirit, is passionate about all things related to paid search and digital, and cares for their team and their clients like family. You will be managing campaigns and relationships, developing big-picture business strategies and striving for client growth. You will be working with various teams, including analytics to manage bids, campaign strategy, and integration with new media and technology partners. You’ll setup and launch new campaigns, be involved with growing our search practice globally and help establish worldwide best practices.We’d like you to be highly familiar with the best industry practices of paid search. You’ll understand the core concepts behind bid and budget strategies, have knowledge of A/B and multivariate testing, and know how to pull intelligence from Excel and analytics. We also hope that you’d understand the basic concepts behind other mediachannels and be able to explain the value search brings to an overall integrated media plan. We’re looking for a digital native – someone who is equally comfortable evaluating and negotiating with vendors, developing relationships with clients, and supporting your teammates.QualificationsTwo years of paid search experienceAbility to train and motivate junior team members Maintain and build upon a large sized keyword campaign across a global footprintSolid knowledge of Google AdWords, Bing AdCenter, tracking and tagging methods, and various analytic packages. Kenshoo, DoubleClick and/or Marin knowledge is a plus.Work closely with account teams to conceptualize projects, implement campaigns, and deliver reportingAbility to work with tight deadlines and on multiple projectsStrong organizational skills with attention to detailWork on multiple projects concurrently, demonstrating a mature ability to handle many things at once under pressureWork independently to identify areas of opportunity and improvementDemonstrate an active interest in advancing the success of our clients"}