{"jobID": "2829496132", "jobLocation": "San_Jose_CA", "jobTitle": "Organization Development Leader", "companyRating": null, "companyInfo": {"Website": "www.kaiserpermanente.org", "Headquarters": "Oakland, CA", "Size": "10000+ employees", "Founded": " 1945", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " HCA Healthcare, Dignity Health, Sutter Health"}, "estimatedSalary": null, "jobDescription": " This position works under the direction of the Regional Director for Org Development and is responsible for driving region-wide OD strategies within assigned Service Area/Medical Center. This position partners with local HR Leadership and Service Area/Medical Center Leaders providing strategic change consultation, leadership team development consultation and leading initiatives associated with culture change. This position will also partner directly with Learning & Development to support and spread region-wide Leadership Development initiatives and programs. Essential Responsibilities: Duties will focus on implementation of regional OD initiatives as well as consulting to increase leadership & organizational effectiveness. The balance of work is 70% carrying out region-wide activities and 30% designing customized interventions to support local leadership & organization effectiveness.  Organizational Development Consulting - works with local HR and Service Area/Medical Center leaders to execute region-wide change initiatives, implement region-wide culture change programs, and strategic OD initiatives. Provides consulting to services area clients on change management, strategic planning, org design & integration, team development, leadership coaching, and culture & climate assessment. (70%)  Leadership Development & Talent Management - works with local area HR leadership to facilitate talent review, succession management and high potential identification. Deploys region-wide development initiatives and provides input to regional leadership development strategy. Supports HR leader to develop targeted development for high-potential leaders within the Service Area/Medical Center. (30%)  Kaiser Permanente conducts compensation reviews of positions on a routine basis. At any time, Kaiser Permanente reserves the right to reevaluate and change job descriptions, or to change such positions from salaried to hourly pay status. Such changes are generally implemented only after notice is given to affected employees. Basic Qualifications: Experience  Minimum ten (10) years of previous work experience consulting to complex organizations across a range of industries.  Minimum ten (10) years of previous work experience coaching senior level executives. EducationBasic Qualifications: BA or BS degree in organization development, organizational behavior or related fields.  License, Certification, Registration  N/A Additional Requirements: Expertise in behavioral sciences, organization development, leadership development, change management and culture change.  Knowledge of personality and social psychology, particularly in areas of motivation and change.  Outstanding written and verbal communication skills.  Demonstrated political savvy and emotional intelligence.  Must be able to work in a Labor/Management Partnership environment. Preferred Qualifications: Management experience.  Master's degree in organization development, organizational behavior or related fields."}