{"jobID": "2776803987", "jobLocation": "Long_Island_City_NY", "jobTitle": "CNC Tooling Engineer", "companyRating": null, "companyInfo": {"Website": "www.morrisgroupinc.com", "Headquarters": "Windsor, CT", "Size": "501 to 1000 employees", "Founded": " 1941", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " CNC Tooling Engineer Job ID: 863Type: Full-TimePosting Company: The Robert E. Morris CompanyLocation: Long Island, NY 11105Category: Sales « Back to List  Click Here To Apply NowDo you feel you have gone as far as you can with your current company?  Do you sometimes feel you spend more time selling your ideas internally than you do with your clients?  Do you get the support and the resources you need to be at the top of your game? Be Fearless. Be Aggressive. Be Ambitious. Join The Robert E. Morris Company. We are looking for GAME-CHANGERS who are interested in becoming Productivity Specialists! As a Tooling Sales Engineer for The Robert E Morris Company, you will:Help your client reach MAXIMUM potential of their machineUse your technical aptitude to guide your client through their business needsRecommend optimizing solutions through proposalsDevelops and deliver outstanding custom product demonstrationsPartner regularly with the Capital Sales partners regarding account knowledgeLearn and maintain a broad knowledge of the machine tool industry as well as its applications, company CORE product lines and technical requirementsAttend industry meetings, seminars, and training sessions with the BEST OF THE BEST to stay apprised of new productivity enhancements for all company core brand machine modelsShow top-level customer service by your professionalism and promptnessEnsures customer commitments are executed as planned to attain 100% customer satisfaction, each and every time!The duties listed above are intended only as illustration of the various types of work that may be performed. The omission of specific statements of duties does not exclude them from the position if the work is similar or a logical assignment to the position.QUALIFICATIONS:A two-year degree in engineering with three years of applicable experience or equivalent combination of education and experience is preferredPossess basic knowledge of industry specific machine tools and applicationsTooling and Work-holding experience a plusProven experience and ability to effectively present products and information to customers in a one-on-one or group settingRegular regional travel up to 80% required; overnight travel up to 20% is requiredMust have access to reliable transportation; a valid US Passport is requiredPossess strong presentation skills and be able to communicate professionally in written responses to emails, requests for quotes and when submitting reportsAbility is required to interpret a variety of instructions provided in written, oral, diagram, or schedule formIntermediate to advanced knowledge of Microsoft Suite and other related business programs as requiredMust be a team playerAbility to work in a fast-paced environment and manage multiple prioritiesBenefits We offer Premier Benefits including Medical, Dental, Vision, LTD, STD, Life, AD&D;, 401K Retirement, Charitable Contribution, Tuition Reimbursement, a competitive Paid Time-off Package for Work/Life Balance, Employee Recognition Events, and MORE! Morris Group, Inc., including all operating subsidiaries, is an EO Employer-M/F/Veteran/Disability. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, sexual orientation, gender identity, or any other protected class. « Back to List  Click Here To Apply Now"}