{"jobID": "2818821042", "jobLocation": "Cambridge_MA", "jobTitle": "Data Scientist II", "companyRating": "4.1", "companyInfo": {"Website": "www.microsoft.com", "Headquarters": "Redmond, WA", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (MSFT) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Amazon, Apple"}, "estimatedSalary": "130000", "jobDescription": " Join the excitement of Artificial Intelligence in the Cloud at Microsoft! We are a fast-paced data science team in the Cloud Artificial Intelligence Platform Group, building deep learning powered intelligent tools and end-to-end solutions for scenarios in diverse enterprise and consumer verticals. We are looking for data scientists who are passionate about data and want to apply machine learning techniques to solve real-world problems for enterprises and consumers. You will help develop capabilities for deep learning models and tools and solutions around it. You would also work on predictive and prescriptive modeling, text and image mining&processing;, recommendations, clustering, forecasting methods, and other advanced statistical techniques. You will work with data from diverse structured and unstructured data sources in both batch and streaming modes, and various formats including tabular, image/video, audio, text and time series. Required:1+ years of experience (including PhD research) in machine learning or deep learningPreferred:PhD /MS/BS degree in Electrical Engineering, Computer Science or an equivalent technical fieldExperience in any of the deep learning frameworks (Keras, TensorFlow, CNTK, Theano, Caffe, Torch, H2O)System-level knowledge of deep learning (such as GPU or FPGA implementations) a plusStrong software development skills in one or more high level languages (C/C++/Java/C#) and one or more scripting languages (Python/R/javascript)Publications in related fields (deep learning, machine intelligence, data mining, etc.) preferredExperience building production grade machine learning enabled solutions end to end.Strong intellectual curiosity and passion to solve real-world problems for enterprises and consumers Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:  Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.  Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.  Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.  In this role, you will interact with a team of experts in deep learning, machine learning, distributed systems, program management and partner product teams, and work on all aspects of the design, development and delivery of deep learning enabled solutions, including problem definition, data acquisition, exploration, training, testing and evaluating deep learning models, and creating end-to-end pipelines and solutions in production."}