{"jobID": "2811702540", "jobLocation": "Cambridge_MA", "jobTitle": "Senior Data Scientist I – Bioinformatics Developer", "companyRating": "3.8", "companyInfo": {"Website": "www.abbvie.com", "Headquarters": "North Chicago, IL", "Size": "10000+ employees", "Founded": " 2013", "Type": " Company - Public (ABBV) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amgen, Baxter, Bristol-Myers Squibb"}, "estimatedSalary": "138000", "jobDescription": "The Scientific Informatics group at the AbbVie Cambridge Research Center supports R&D; activities focusing on neuroscience and immunology. Our team is tasked with shaping and executing scientific data/knowledge acquisition, management and analysis in the support of discovery and development programs. We are looking for a skilled and dedicated individual to partner with the community of computational biologists and research scientists to further these goals. The candidate will collaborate with scientists and developers to identify, design, build and maintain tools and analytical workflows to streamline and strengthen the therapeutic discovery pipeline. With a special focus on operationalizing bioinformatics pipelines, multi-omics data management and visualization, we are looking for a candidate with bioinformatics / computational biology experience as well as a passion for software development. A successful candidate will be someone who enjoys applying new and emerging analytical methods and visualization technologies on real world data for the purposes of building solutions that serve both technical and scientific audiences. Key Responsibilities Includes:Collaborate with local informatics and research scientists to identify and understand their analytical and informatics needs and translate these into solutions.Conceive, design and implement business technology solutions that solve significant scientific or business problems through the integration, visualization, and analysis of large and complex data. Routinely demonstrate initiative and creativity in developing technology solutions.Demonstrate high proficiency across a wide range of technologies related to the storage, transfer, integration, visualization, and analysis of large and complex data sets. Expertise in software development, data warehousing, statistics, and machine learning.Demonstrate deep knowledge of the pharmaceutical and healthcare business, and utilize this knowledge in the rapid advancement of agile, impactful, and cost-effective solutionsHighly autonomous and productive in performing activities, requiring only minimal direction from or interaction with supervisor.May initiate new areas of investigation that are meaningful, reliable, and can be incorporated directly into a scientific or business activity.Direct mentorship of others.A primary author of publications and presentations.Understand and adhere to corporate standards regarding applicable Corporate and Divisional Policies, including code of conduct, safety, GxP compliance, and data security.Communicate and collaborate effectively with colleagues in varied scientific and technical roles.Be equally comfortable working independently and within a team depending on project needs.Present projects and systems in front of both scientific and technical audiences.Bachelor’s Degree or equivalent education and typically 10 years of experience, Master’s Degree or equivalent education and typically 8 years of experience, PhD and no experience necessary. Background in life sciences or work experience in the pharmaceutical industry preferred.Experience and/or education in bioinformatics / computational biology as well as software engineering.Proficiency in R and Python for both data analysis and software engineering, especially for the development of web applications (Shiny, Flask/Django, etc).Experience with relational (SQL) and document (NoSQL) database design, data modelling and data warehousing would be preferred.Possess thorough theoretical and practical understanding of own discipline.Proven implementation of creative technology solutions that advanced the business.Excellent written and oral English communication skills.Equal Opportunity Employer Minorities/Women/Veterans/Disabled"}