{"jobID": "2701008102", "jobLocation": "Fremont_CA", "jobTitle": "Senior Regulatory Specialist", "companyRating": null, "companyInfo": {"Website": "www.shockwavemedical.com", "Headquarters": "Fremont, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Shockwave Medical is revolutionizing the interventional treatment of advanced cardiovascular disease, creating new opportunities for patients and physicians by effectively targeting calcified plaque. Together, we are working to reshape interventional therapy with Lithoplasty® Technology for the treatment of calcified plaque.  Work closely and partner with internal departments to efficiently deliver safe and effective medical device designs in accordance with Shockwave Medical Inc. (SWMI) policies and procedures. The Regulatory Affairs Specialist combines knowledge of scientific, regulatory and business issues to ensure that products are developed, manufactured and distributed to meet regulatory requirements. Under direction of responsible Regulatory Affairs Management, acts as a decision-maker on regulatory issues, and assures that deadlines are met. Effectively communicates, prepares, and negotiates with internal customers. Occasionally communicates directly with regulatory agencies under the direction of responsible Regulatory Affairs Management. Properly interprets and applies regulatory requirements.  Strategic Planning: Participate in developing regulatory policies, processes and SOPsEvaluate regulatory risks of policies, processes, proceduresDevelop regulatory strategies and update strategy based upon regulatory changesDetermine submission and approval requirementsProvide strategic input and technical guidance on regulatory requirements to product development and operations teamsWork with product development, quality and operations functions to identify applicable regulations/standards and assist with interpretation and compliance (e.g., ISO and IEC standards, ROHS, applicable sections of 21 CFR, regulatory agency guidance documents)Evaluate import/export requirementsCommunicate identified emerging issues to the organization Influence/Leadership: Ensure personal compliance with applicable company policies and proceduresDevelop, communicate, and build consensus for operating goals that are in alignment with the companyInterface with a variety of levels on significant matters, often requiring the coordination of activity across organizational units Submission Activities: Review and approve R&D;, quality, preclinical and clinical documentation for submission filingCompile, prepare, review and submit regulatory submissions to authorities in and outside the US (e.g., EU, Canada, Australia, Japan, etc.)Under direction of responsible Regulatory Affairs Management, interact and negotiate with regulatory authorities during the development and review process to ensure approvals of submissionsCommunicate application progress to internal stakeholders Other Regulatory Activities: Evaluate and approve proposed preclinical, clinical and manufacturing changes for regulatory impactPrepare and maintain annual licenses, registrations, listings and patent informationPerform product safety evaluation and reporting (e.g., MDR/Vigilance) as required by country regulationProvide regulatory input for product recalls and recall communicationsProvide other country specific regulatory supportOther duties as assigned. These job requirements are not intended to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel.RequirementsAbility to work in a fast-paced environment while managing multiple prioritiesBachelor's degree (or equivalent experience); Bachelor's degree in science, math, engineering, or medical fields is preferred. Post-graduate degree in a technical area, M.B.A. or law is preferred.Minimum 3-5 years of experience in a regulated healthcare industry.Working knowledge of applicable domestic and international regulatory guidelines, policies and regulationsExperience with pre- and post-market medical device submissions such as 510(k), IDE, PMA, EU Technical Files, Design Dossiers, etc.Ability to define regulatory strategyAbility to write and edit technical documentsPlan and conduct meetings, create project plans and timelines, and manage projectsExercise good and ethical judgment within policy and regulationsAble to follow scientific arguments, identify regulatory scientific data needs and solve regulatory issuesEmployee may be required to lift objects up to 25lbs or more. Employees will be required to work in an air conditioned office space and possibly perform some tasks in our non-temperature controlled warehouse space.Think analytically with good problem solving skillsEffective negotiation internally and externally with regulatory agenciesAbility to perform multiple tasks concurrently with accuracyClear and effective verbal and written communication skills with diverse audiences and personnelKnowledge of business functions and cross group dependencies/relationshipsLeadership of functional groups in the development of relevant data to complete a regulatory submissionProficiency in MS Word, Excel and Power Point requiredOperate as a team and/or independently while demonstrating flexibility to changing requirements.There may be continuous sitting for prolonged periods (more than 2 consecutive hours in an 8 hour day)Benefits Shockwave Medical offers competitive salary, equity and healthcare. If you have experience and initiative for this fast paced fun start-up, please apply.  EEO Employer"}