{"jobID": "2768989351", "jobLocation": "New_York_NY", "jobTitle": "High School Associate Teacher - Science", "companyRating": null, "companyInfo": {"Website": "www.successcareers.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2006", "Type": " School / School District", "Industry": " Education", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "As the fastest growing, highest-performing charter school network in New York State, Success Academy has reimagined public education. Nationally recognized for achieving outstanding academic results for students from all backgrounds and zip codes, we have created an innovative K-12 school model that is preparing current and future generations of children with the subject mastery and skills to succeed in college and life. We now need results-driven High School Science Associate Teachers to join our school community.We welcome candidates just starting their career or considering a change and provide our Associate Teachers with intensive summer training at Success Academy’s Education Institute, as well as ongoing professional development from experienced teachers and talented school leaders. As a Science Associate Teacher, you will hit the ground running to support students in the classroom. An ideal candidate should exude professionalism and self-awareness, relish the fast-track, take and implement feedback quickly, and possess a good sense of humor. Science Associate Teachers that demonstrate their ability to effectively lead a classroom will be considered for a Lead Teacher position. Beginning in Kindergarten, our scholars enjoy a inquiry-based, hands-on science curriculum five days a week. Success Academy is disrupting the status quo so we need candidates with a deep-seated belief that all children are capable of reaching the highest bars we set for them and are excited to join the ed reform movement. If you are ready to join this elite team, your key responsibilities would include:- Teaching small groups and leading whole-class instruction using an inquiry-based, rigorous curriculum that inspires intellectual curiosity, reinforces the joy of learning, and enables all students to thrive;- Facilitating scholars’ increasing independence in developing their own scientific processes, from basic skills, to analyzing data, to fully internalizing the scientific method;- Preparing scholars to take the Biology SAT II, Biology AP Exam or Physics AP Exam in May;- Working collaboratively with other teachers, assuming increased teaching responsibilities while progressing towards the Lead Science Teacher role;- Engaging in training with school leaders to benefit from targeted, in-the-moment feedback on instruction, accelerating learning and growth with unparalleled support;- Developing meaningful relationships with students and parents that drive students to love learning and make exceptional academic gains; and- Joining a highly motivated team committed to education reform, parent choice, and the building of exemplary schools.Successful candidates have the following:- Bachelor’s degree in Biology, Chemistry, Physics or related field, with an outstanding record of academic achievement and leadership;- GPA of 3.0 or above;- High moral character;- Passion for science;- Flexibility and openness to feedback;- Grit and perseverance; and- Interest in working in a collaborative environment.To join our team, please a submit your application including a resume and short essay on why you want to join the Success Academy team (500 words).Success Academy Charter Schools is an equal opportunity employer and actively encourages applications from people of all backgrounds. Compensation is competitive and commensurate with experience. Success Academy offers a full benefits program and extraordinary opportunities for professional growth.Apply"}