{"jobID": "2823986219", "jobLocation": "Boston_MA", "jobTitle": "Principal Data Scientist - Artificial Intelligence, Machine Learning & Big Data", "companyRating": "3.8", "companyInfo": {"Website": "www.fidelity.com", "Headquarters": "Boston, MA", "Size": "10000+ employees", "Founded": " 1946", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Charles Schwab, Vanguard, Citi"}, "estimatedSalary": "122000", "jobDescription": "The Expertise Were Looking ForPhD (or working towards similar) in Engineering, Computer Science, Mathematics, Computational Statistics, Operations Research, Machine Learning or related technical fields.Hands on experience developing supervised and unsupervised machine learning algorithms (regression, decision trees/random forest, neural networks, feature selection/reduction, clustering, parameter tuning, etc.), using relevant programming languages (Python, PySpark, Scala, Java, C++, C#, C, etc.), mathematical/statistical/ML languages and platforms (R, H2O.ai, Octave, Matlab, Weka, SAS, etc.) and big data tools and languages (Spark, MapReduce, SQL, Hive, etc.).Advanced knowledge in model evaluation, tuning and performance, operationalization and scalability of scientific techniques and establishing decision strategies. Experience in evaluating and making decisions around the use of new or existing tools for a project.Proven track record of strong verbal/written communication and presentation skills, including an ability to effectively communicate with both business and technical teams.Experience in projects involving large scale-multi dimensional databases, complex business infrastructure, and cross-functional teams. Three to five successfully launched ML projects.5+ years of relevant employment experience.The Purpose of Your RoleYou will partner with business stakeholders to identify/prioritize top AI opportunities, create business/technical requirements, transform large volumes of data into AI-driven solutions using creative, cutting edge open source methods/technologies, lead ML strategy and road map planning, work across teams and influence the direction of external teams. The ideal leader will combine expert AI/ML/Open Source/Tech knowledge with hands on experience building algorithms/models/programming and outstanding business skills (revenue/cost drivers, customer experience, customer journey, communication, etc.) to manage and deliver complex/critical projects driving significant value to Fidelity.The Skills You BringExperience with TensorFlow, Keras, Theano, CUDA, and/or DSSTNE.Experience with advanced ML techniques (RNN, CNN, LSTM, GRU, Genetic Algorithms, Reinforcement Learning, etc.).Experience with voice recognition, natural language processing, and computer visionExperience building and delivering complex systems that leverage various machine learning algorithms or technologies that integrate well with other organization-wide systems and can scale effectively.Experience in developing and/or launching ML algorithms/frameworks using cloud infrastructure.Previous experience in digital-native organizations (Google, Facebook, Amazon, etc.) and/or the Financial Services industry.The Value You DeliverWe work closely with business stakeholders, collect requirements and deliver high value AI/ML solutions that drive customer and business value.. Those of us who love to work with data see this as the pinnacle of opportunities that you cannot find anywhere else in the industry.How Your Work Impacts the OrganizationThe AIML (Artificial Intelligence and Machine Learning) team contributes to the vitality and growth of the organization through researching and building complex, cutting edge and scalable AI algorithms, models, platforms and technologies to significantly improve customer experience and drive business results. Our team of high caliber scientists, mathematicians and statisticians use rigorous quantitative approaches to ensure that we are efficiently building algorithms and technology relevant to the business or customer experience issue at hand.Company OverviewAt Fidelity, we are focused on making our financial expertise broadly accessible and effective in helping people live the lives they want. We are a privately held company that places a high degree of value in creating and nurturing a work environment that attracts the best talent and reflects our commitment to our associates. For information about working at Fidelity, visit FidelityCareers.com.Fidelity Investments is an equal opportunity employer."}