{"jobID": "2735676079", "jobLocation": "San_Diego_CA", "jobTitle": "IT Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.rchsd.org", "Headquarters": "San Diego, CA", "Size": "1001 to 5000 employees", "Founded": " 1954", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "62000", "jobDescription": " IT Data Analyst-50067  San Diego, California  ApplyJob ID 98 Date posted 04/16/2018 Schedule Full-Time Shift Regular Hours Full-Time Department RCSSD AdministrationJOB SUMMARY: Looking for a talented report writer to play a vital role in our Clinical Operations Team at Rady Children's Specialists of San Diego. If you thrive in dynamic, creative environments and are passionate about data and the opportunity it provides to organizations to impact families, we'd love to chat with you. With 90% of the regional pediatric market, Rady Children's is the place where families want to come for healthcare, physicians want to practice, and employees want to work. The successful candidate will have a passion for business analytics and the capability to transform data into meaningful insight that drives productive business decisions. This person will work closely with business analysts, other report writers, physicians, and leadership and help them better understand and improve (1) appointment access, (2) clinic operations including effectiveness and efficiency of services, care-giving team, and operation processes, and (3) patient and family engagement. MINIMUM QUALIFICATIONS: Bachelor's Degree in relevant field (7 years of directly related work experience equivalent)  Minimum of 3 years in programming queries, report writing and data analysis using data management software  Extract data from online databases, program automatic reports, and create analytic tools to solve business challenges  Interpret data in Epic EMR and other large data warehouses, advanced structured query language (SQL) techniques, and other common reporting tools such as BOE Crystal  Manipulate data, identify trends, provide insights and recommendations  Develop graphs and tables to communicate analysis of problems/trends and offer data-driven solutions or recommendations PREFERRED QUALIFICATIONS: Certification in relevant EMR data module(s)  Strong critical thinking and problem solving skills with an ability to work under pressure and balance competing requests  Advanced Excel experience using pivot tables, v-lookup, conditioning formats, macros, etc.  Be nimble, agile and comfortable with evolving changes as reports and tools are being developed and re-defined  Produce deliverables that reflect exceptional attention to detail and high standard of quality in work products Apply"}