{"jobID": "2693063407", "jobLocation": "New_York_NY", "jobTitle": "OCCUPATIONAL THERAPIST", "companyRating": "3.3", "companyInfo": {"Website": "www.birchfamilyservices.org", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Non-Profit", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "42", "jobDescription": "Job DetailsLevel ExperiencedJob Location Riverdale Early Childhood Center - Riverdale, NYPosition Type SeasonalEducation Level 4 Year DegreeJob Shift DayJob Category EducationDescriptionRegistered occupational therapists in educational systems are considered to be related service personnel. The Occupational therapist is responsible for assessing student's motor skills, developing and implementing goals designed to enhance the student’s learning potential, to assist the student in acquiring those functional performance skills needed to participate in and benefit from the educational environment as well as help the student function independently. Evaluation • Make observations during preliminary screening of new students, and/or ongoing evaluations of students enrolled in the school. • Based on clinical observations and formal evaluations, write a full description of the child’s performance and behavior during evaluation referencing his/her sensory processing, perceptual skills and/or deficits in addition to the student’s fine and gross motor coordination as they impact on the student's ability to participate and benefit from the educational environment. • make suggestions for approaches and activities that might enhance the student's ability to Professional Training • Take part in developing staff development and parent workshop opportunities around the development of gross motor, fine motor, and perceptual skills, and related underlying sensory and motor functions, leading to successful participation in the educational environment and more independent functioning. • Demonstrate approaches and activities to be implemented by educational staff that will improve children’s abilities to participate in the classroom • Help the staff identify children's specific sensory and motor skill levels. Individual and group related service provision and documentation. • Develop a series of developmentally-graded activities based on evaluation, designed to improve sensory processing, fine and gross motor skills, and perceptual skills. • Carry out medical prescriptions for occupational therapy. • Maintain mandated documentation of treatment and progress (e.g., individual treatment session and quarterly progress notes, Related Service Attendance, etc.). • Submit a written report of the progress of the children at the end of each school year. • Make recommendations for IEP goals and participate as required in IEP conferences. • Explain findings and program aims to parents, and recommend activities, physical positioning and/or adaptations that might facilitate increased independence in the home. • Maintain O.T. equipment and supplies, and recommend ordering them as required by IEP mandates or needed clinically. • Attend departmental meetings, supervision and school meetings, as well as any additional meetings, • Comply with regulatory requirements and school policy and procedures in all areas, and maintain • Maintain appropriate and effective interpersonal relationships with team and department members, parents, other staff, supervisors, administrators, and outside agencies. Demonstrate: • open communication, flexibility and the ability to learn and utilize team building strategies • the ability to self-evaluate, to utilize supervision and problem solveQualificationsEducation Bachelors or Master’s degree in Occupational TherapyExperience Minimum of six months of supervised experience; prefer 1-3 years of related work experience.SKILLS & ABILITIES Certificates & Licenses The occupational therapist must have completed an accredited education program and all field-work requirements. All O.T. programs are accredited by the American Medical Association and the American Occupational Therapy Association. Must be certified by the Occupational Therapy Certification Board (OTCB) following successful completion of the national certification exam. The O.T. must be licensed."}