{"jobID": "2754995940", "jobLocation": "San_Jose_CA", "jobTitle": "Sr. Financial Services Security Executive (Cloud Solutions)", "companyRating": "3.6", "companyInfo": {"Website": "www.ibm.com", "Headquarters": "Armonk, NY", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Public (IBM) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Accenture, Microsoft"}, "estimatedSalary": "65000", "jobDescription": "Job DescriptionCandidate MUST LIVE in the Chicago area. Join the largest startup, and proven global leader, in the Security industry to protect our planet from emerging cyber threats. Tell the world how you, Watson and IBM Security fight to defend businesses, institutions and governments across 130 countries. Make a difference in everyday lives by safeguarding our most valuable information from corporate intellectual property to your family photos. Be a part of IBMs rich history of innovation and research to deliver solutions built on the foundation of over 3,500 security patents. Are you ready to put on your cape and help us fight the bad guys?  Duties of Sales Executive: Must have security background, must have cloud background, must understand IBM landscape, track record of making number year over year. Must have a hunter mentality. Preferred Background: ability to work in a fast pace environment, understanding of cloud contracting , security background, background in IT. Experience in the following:SaaSSecuritySoftware SalesSolution SalesCloudFinancial Services or Banking exp. Candidate Must live in the Chicago area!  #ReferSaaSSellers  Required Technical and Professional Expertise Background in Sales Preferred Tech and Prof Experience 3 years in Software SalesBackground in Financial Security Sales. EO Statement  IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status. "}