{"jobID": "2570780528", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Software Engineer: Scala + REST API", "companyRating": null, "companyInfo": {"Website": "www.stridehealth.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " HealthSherpa, Intuit, eHealth"}, "estimatedSalary": null, "jobDescription": "Stride Health seeks a Sr. Software Engineer to help shape its bright, bright future! You're a seasoned technologist with nimble fingers and a love of resilient, well-architected systems. We're a high-energy, forward-thinking team that's empowering consumers to make decisions about their health coverage in a way unparalleled by anyone else. Data, beautiful UX, and a high-performance backend service layer compose the core of our product experience, and we need you to take a great thing and make it better.You'll focus on architecting and maintaining our core API services, which include our search recommendation algorithm and transaction engine. You'll also help manage our build and code-review process and lead integrations with key external partners. An emphasis on reliable high-performance computing and a distributed data architecture are absolute must-haves for this job. A passion for public health is icing on the cake. Your Mission Develop and maintain core API services, and oversee ongoing integration with our front-end clients, data layers, and third party systemsDevelop methods and code to facilitate purchase transactions, including key user management methods and transaction processingDevelop services to integrate with third party systems, including partner payment, identity verification, fraud-detection, and communication systems (email, sms)Design system architecture for high-concurrency, fault-tolerant, event-driven servicesDesign and code secure software, ensuring all utilized methods and technologies meet industry requirements and known best-practicesWrite test and benchmarking codeWork with a collaborative and agile engineering team to define technical requirements and development roadmaps Recipe for Success BS or MS in Computer Science or Engineering5+ years working in an Engineering team for a software product companyIn-depth experience developing REST API web services with Scala and a core related JVM http-layer and RPC technologies (Spray/Akka, Play, Scalatra, Finagle, or other)Experience developing with functional languages (Python/Ruby/Erlang/Clojure)Deep experience with both relational database systems (Postgres) and NoSQL systems (CouchDB, Riak, Dynamo, Redis), including experience with replication and clusteringExperience developing secure software to facilitate transactions and payment processingStrong practical knowledge of data structures and algorithm complexity in distributed systemsDeep experience working within a Linux operating and development environment Cherries on Top Experience developing core services for high-volume SaaS or PaaS consumer technologiesExpertise in developing shopping-cart and related transactional technologies for consumer e-commerce sitesWe make software that helps the 100+ million people who work for themselves be more productive and successful, giving them economic security to thrive.For the past couple of years weve been solving really important problems for them like getting the right health coverage and simplifying their tax bills. Now were focused on building the worlds first all-in-one productivity platform designed to help them manage their business and make smart decisions every day.Our products are integrated into the worlds largest work-for-yourself platforms including Uber, Etsy, TaskRabbit, Postmates, Care.com, and others, and were backed by leading investment firms including Venrock, New Enterprise Associates, and F-Prime Capital Partners.Come help us take the work out of working for yourself!"}