{"jobID": "2796361013", "jobLocation": "Brooklyn_NY", "jobTitle": "Senior Technical Architect", "companyRating": null, "companyInfo": {"Website": "www.nuxeo.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Alfresco Software, OpenText, M-Files"}, "estimatedSalary": null, "jobDescription": " AboutNuxeo provides a Hyperscale Digital Asset Platform that helps enterprise organizations unlock the full value of their digital assets. Leading organizations use Nuxeo for digital asset management, document management, knowledge management, and other content-centric business applications. Our mission is to empower your digital transformation by unlocking the value of your digital assets. What you will doEnjoy working with the best open source technologies to solve real world problems? Are you someone who thinks code yet speaks business? Can you ‘talk tech’ to customers in the morning and use your IDE in the afternoon?  As a Senior Technical Architect on the Nuxeo professional services team, you will lead and work with other outstanding engineers to solve complex business problems using our extremely modern open source stack and architecture. As an expert in the Nuxeo platform, you will provide technical guidance and architectural leadership to the customer and implementation team to configure, customize, and integrate the Nuxeo platform to meet rigorous business and technology goals. You will collaborate closely with customer stakeholders and other Nuxeo implementation engineers, providing leadership and mentorship to help ensure the highest standards of technical delivery from design through roll-out. Working both at the keyboard coding and directly with customers you will bridge the gap between business and technology. This role is client facing and will require about 40% travel. Responsibilities you will have: • Lead requirements elaboration and architectural design sessions with customers, this is a client facing role Identify and assess business, functional, and technical requirementsRecommend solutions that resolve functional and technical requirements using the Nuxeo platformDevelop implementation designs using the Nuxeo PlatformDevelop integrations and add-ons to the Nuxeo platformConfigure and customize the Nuxeo platform for customer implementationsAuthor client deliverables (e.g. specifications, test cases, user stories, and design documents)\u2028Participate in the development and delivery of training for customers and teamsLead technical implementation teamsMentor and train team members\u2028Relay product feature requests to product managementMust be able to travel within North America approximately 40% of the time"}