{"jobID": "2764831182", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist - Games", "companyRating": "3.5", "companyInfo": {"Website": "discover.king.com", "Headquarters": "London, United Kingdom", "Size": "1001 to 5000 employees", "Founded": " 2003", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "79000", "jobDescription": " Support the game team with developing hypotheses and execute qualitative and quantitative tests to understand what resonates with the target audience  Identify potential business opportunities and scope/design approaches to capture those opportunities  Translate business needs to technical requirements and AB-tests, then work with development teams to ensure correct implementation and tracking  Develop an analysis strategy and perform analysis of complex scenarios and AB-tests, both systematically and on a one-off basis.  Carefully check, debug, and problem solve issues to ensure you deliver accurate and clear analysis and reports, even when confronted by subtle data complications  Provide an analytics perspective to discussions and helping to drive the priorities within your team  Be the pro-active owner of the entire data chain for your game(s)  Skills to create thrills  You have a passion for quantitative analysis, understanding player behaviour and will have the ability to draw business insights which will add real value to King. You will need to demonstrate the ability to learn quickly and will have worked in a fast paced and collaborative environment. This role will involve working with teams and individuals across King - such as Game Developers, Business Performance Managers and Marketeers, so excellent communication skills are essential.  Experience working on mobile games or in a live games environment  Business Insight: The ability to understand the problems and issues our games and business wants to solve, and then defining the right data, analysis or interpretation to lead to the right recommendations and decisions  Player behavior: Understanding the players’ motivation is key to design valuable tests and interpret results  SQL: The ability to write complex SQL queries to analyse our databases with 300+ million players, and work effectively with both Hive and relational database systems  Analytical coding: Using tools such as R, Python (and also Excel) for analytical purposes  Stats: Understanding the appropriate statistical techniques to use in different circumstances  Communication: Designing good ways of communicating, visualising or reporting your results/analysis so they are clear and unambiguous  Bonus points  There is plenty of scope at King for you to learn from your colleagues in the areas where you have less experience, and to share your own skills where you are stronger.  Specific experience that might be helpful, includes:  experience in the games industry or similarly sophisticated customer-facing digital businesses  experience in \"big data\" systems such as Hadoop, Hive  experience in behavioural psychology/economics; robust understanding of more advanced statistical techniques suitable for analysis of highly skewed populations  experience in predictive analytics, segmentation, and related areas  experience in experimental design; software engineering skills in Java and other languages (beyond R and Python which we use most frequently)  skills with standard reporting tools such as QlikView/Tableau/Looker/etc."}