{"jobID": "2692905268", "jobLocation": "Campbell_CA", "jobTitle": "Assistant General Manager", "companyRating": null, "companyInfo": {"Website": "www.burgerlounge.com", "Headquarters": "San Diego, CA", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Restaurants, Bars & Food Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Doing a Common Thing Uncommonly Well.Burger Lounge grew out of the idea that a hamburger should not only taste great, it should also utilize healthy ingredients produced in a sustainable environment. We provide a simple quality menu that appeals to health-conscious diners, vegetarians, salad lovers and those simply \"hankering for a great hamburger\".The most important person at Burger Lounge is our employee. When our employees feel truly appreciated and rewarded our guests leave happier than when they arrived. Our goal of exceeding guests' expectations at every opportunity is reached when our team members have the training and personality to deliver authentic hospitality.We have 21 locations currently and are scheduled to open 3 more in 2018! We are now accepting applications for our ASSISTANT GENERAL MANAGER position in Campbell, CA as we continue to expand in the Bay Area. Management experience required.AGM JOB DESCRIPTIONReporting to the General Manager, the AGM assists in administrative responsibilities while leading the team and cultivating a fun, positive work environment. Restaurants are in their DNA. AGM's can expect to make competitive pay + tips.We're looking for someone with:• Recent hands-on restaurant management experience in a high-volume location• Leadership skills that focus on serving quality food and building an amazing guest service team,• Strong organizational abilities and time-management• Computer skills at above average (we use Outlook, ADP, Cornerstone, CTUIT, HotSchedules and Aloha).• Experience in opening a restaurant a plus.Your work-life balance is important to us; you won't work 70 to 80-hour work weeks with us like in other restaurant management positions. For the right person, this position has the potential to grow into a General Manager role as our company expands.COMPANY PERKS• Comprehensive benefits package offered after 60 days at a fair cost (Medical, Dental, Vision, Life, Long term disability)• Free Shift Meals - and our food is awesome!Burger Lounge is proud to be an Equal Opportunity Employer, and participates in E-Verify. These positions are subject to a criminal background check."}