{"jobID": "2811515739", "jobLocation": "Long_Beach_CA", "jobTitle": "ADMINISTRATIVE INTERN (NON-CAREER) - SECURITY DIVISION", "companyRating": null, "companyInfo": {"Website": "www.polb.com", "Headquarters": "Long Beach, CA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Government", "Industry": " Transportation & Logistics", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " DESCRIPTIONThe Port of Long Beach is one of the world's busiest seaports and is a leading gateway for international trade. Credited with moving $180 billion in trade, the Port serves as a critical hub for international commerce and is a major transportation center. Port-related international trade has wide-ranging economic impact, supporting millions of jobs that benefit the region and entire country.  Safety and security are top priorities at the Port of Long Beach. Since September 11, 2001, the Port and the other government agencies responsible for security have greatly expanded their efforts to protect the Port complex and surrounding communities. The Port takes a leadership role in the development of strategies to mitigate security risks in the port complex, working closely with multiple partners, both public and private, to plan and coordinate security measures.The Security Division is seeking Administrative Interns to perform routine, non-professional work. This is an unclassified (Non-Civil Service) position. Non-career positions typically average 29 hours per week, up to a total of 1040 hours in a year for a maximum of two years. To learn more about the Port of Long Beach, visit our website: www.polb.comEXAMPLES OF DUTIESThe Security Intern will perform a variety of administrative and professional duties in the Security Division. Under supervision, the incumbent will: Assist with administrative, professional and technical support functions. Gather and compile data for analyses and reports. Write, edit and prepare written reports. Develop presentations including charts, photos, videos, etc. Assist with the tracking and monitoring of equipment. Assist management with the development of policies and procedures manuals and instructions. Assist with the project management for the Technical Security Section. Perform other duties as necessary.REQUIREMENTS TO FILEQUALIFICATIONS: A current student attending an accredited college or university with at least senior standing or recent graduate or in a graduate program*. A major in public administration, public policy, cyber security, computer science, homeland security or closely related field is preferred. Excellent research and writing skills. Excellent verbal communication skills. Knowledge of principles and practices of local government administration, project management, grant administration, contract administration, budgeting and financial management. Knowledge of disaster management/principles and methodologies A general understanding of maritime and security terminology. Proficiency with general computer applications. Capacity to manage multiple projects, meet competing deadlines, and work in a team environment as well as individually.*This recruitment is open to currently enrolled or recently graduated students (within past 12 months) at an accredited college or university, with at least senior standing. Preference will be given to candidates possessing or pursuing a degree in public administration, public policy, homeland security or a closely related field. Both graduate and undergraduate students will be considered; a valid motor vehicle operator's license and successful completion of a background check and physical examination will be required.SELECTION PROCEDURETo apply, please click on the \"Apply\" link and submit your application on-line. Please be sure to attach a cover letter and resume.   NOTE: In the cover letter, please outline your previous experience conducting research, analyzing data, and reporting findings in writing to senior-level management; information should be incorporated into the letter, which should be no longer than 2 pages.  Applications will be accepted until 11:59 p.m. on Monday, June 25, 2018. The Port reserves the right to extend the filing period, without notice, in order to accept additional applications.  Following the close of the filing period, the Port will review the applications to determine the most qualified candidates. Those determined most qualified will be invited to continue in the selection process.   The Port of Long Beach intends to provide reasonable accommodations in accordance with the Americans with Disabilities Act of 1990. If a special accommodation is desired or if you would like to request this information in an alternative format, please call (562) 283-7500 or email humanresources@polb.com.  The Port of Long Beach is an Equal Opportunity Employer."}