{"jobID": "2704655143", "jobLocation": "New_York_NY", "jobTitle": "Architect III (Senior Project Architect)", "companyRating": "3.7", "companyInfo": {"Website": "www.ewingcole.com", "Headquarters": "Philadelphia, PA", "Size": "201 to 500 employees", "Founded": " 1964", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "107000", "jobDescription": "Office Location: New York, NY FT/PT Status: Full Time Department: ArchitectureJob Description: A growing NYC Architectural and Interior Design firm in Penn Station area is offering a long-term career opportunity for an Architect III with 8-12 years experience. As part of the Architecture Discipline, the Architect III works independently in directing and supervising a staff for project specific solutions for design, program and technical requirements for projects. The Architect III develops medium to large scale projects with many complexities and may oversee a large staff of architects, technicians and interns. The Architect III is responsible for interpreting, organizing, executing and coordinating assignments. The Architect III supervises the coordination with other disciplines, in the production of drawings and construction documents which fulfill the design concept, meet the client's expectations and the firm's goals of design excellence, financial viability and quality service. The Architect III develops projects that advance the firm’s position in the marketplace and may explore new subjects, scope, concepts and methods. The office is currently primarily involved in health-care project types and healthcare experience is preferred. Professional degree required, NY registration preferred. Collegial environment, excellent compensation and benefits package including 401k and choice of healthcare plans. Job Duties:Ensure the design intent is maintained while supervising and in preparing the construction documents.Supervise small, medium and large size teams of professional and technical support personnel in project situations.Manage and deliver the production of the construction documents for small, medium and large sized projects.Provide technical support to project team members.Marketing Assist market segment leaders and the marketing department in the preparation of design documents and presentations material.Schematic Design and Design Development Work with the Project Manager and the Project Designer in creating buildings which serve the client’s needs and responds to their desired image, space, and aesthetic.Develop code compliant designs.Participate with design presentations to the client.Participate with the projects’ design review presentation.Direct and supervise project coordination meetings for medium and large sized projects.Direct the development of the building design by testing it in relation to program, budget, codes and other issues that emerge in the Design Development phase.Construction Documents Supervise the project team in articulating design principles that help govern the detailing phase of the project.Oversee the coordination effort with the engineering disciplines (inclusive of civil and landscape) and Interiors in order to ensure a consistent development of the project towards the design concepts established in earlier phases.Develop project specifications and other technical requirements of projects.Construction Administration Manage submittal responses, shop drawing review and construction site visits.Prepare site visit reports.Supervise the technical team in preparing construction phase design directives.Mentor Architects, Technicians and Interns.Perform other duties and responsibilities as required or requested.Job Requirements:Bachelor of Architecture (minimum).Registered Architect in at least one state (preferably NY) with suitable credentials for registration in other states.Prior experience as architect for components of projects with a demonstrated technical and organizational proficiency.8-12 years of experience.Demonstrated superior graphic design and building design and conceptualization skills.Proficiency with AutoCAD/ADT, Revit, etc.Proficiency with adobe suite – Photoshop, In-design, Illustrator.Microsoft Office Suite.Experience hand drawing and sketching.Excellent written and verbal communications skills.Familiarity with NYC regulatory environment including Building Codes, Zoning, DOB.Familiarity with NYDOH submission process and compliance.Experience in design and documentation of exterior envelope construction and sophisticated architectural interiors."}