{"jobID": "2767663057", "jobLocation": "New_York_NY", "jobTitle": "Enterprise Sales Development Representative", "companyRating": null, "companyInfo": {"Website": "www.similarweb.com", "Headquarters": "Tel Aviv-Yafo, Israel", "Size": "201 to 500 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " comScore, App Annie, Alexa Internet"}, "estimatedSalary": null, "jobDescription": "SimilarWebs market intelligence solutions provide customers with insights to help them understand, track and grow their digital market share.At SimilarWeb we bring together the industrys top talent to work together and create a product that will transform the way that businesses make decisions. We believe in a bottom up approach, wherein every role has the power to create impact and offers opportunity to grow with the company.What makes the SimilarWeb Enterprise Sales Development team awesome?We love market intelligence! At SimilarWeb you have the opportunity to work with the world's biggest brands and offer a solution that has the power to have a huge impact on their business!As part of our global team you will work alongside the industrys top talent where you will have the chance to not only learn but also grow professionally.Work at the forefront of marketing technology and big data - where the product is constantly evolving and improving with each new iteration.As an Enterprise Sales Development Representative at SimilarWeb:You will be responsible for prospecting, qualifying and creating sales opportunities for SimilarWebs global sales teams.You will be dedicated to pursuing some of the largest and most recognized brands in the world, like our clients Adidas,Tumblr, eBay, Louis Vuitton and many more.Ultimately, you will represent the front line of the companys sales and marketing efforts, playing an important role in growing the business by starting the sales process and helping set up the sales teams for success.What will I bring to the team?Previous experience in a sales related functionOverall understanding of web concepts and online marketingExperience with CRM (Salesforce)Excellent spoken and written EnglishWorking days Monday-FridayOccasional travelAdditional Languages- AdvantageFamiliarity with SaaS- AdvantageExperience working with Enterprise -AdvantageExperience generating your own leadsPhone sales experienceWhy choose SimilarWeb?Impact: We are changing the way decisions are made. We provide insights that help businesses understand the digital world, their market and their competition. With our digital market intelligence businesses can put their own data into context and make real data-driven decisions.Talent: We bring together the industrys brightest minds. We recruit only the most talented ambitious professionals who are eager to work hard, take chances and share ideas. Our passion, enthusiasm and drive for success are why we win together.Opportunity: We are the perfect place to grow. SimilarWeb has been named one of 15 Israeli Startups to watch in 2017 and one of Business Insiders Top 50 Enterprise Startups to bet your career on. Were expanding our global team rapidly while taking pride in developing our people and promoting from within."}