{"jobID": "2804622746", "jobLocation": "Boston_MA", "jobTitle": "Data Scientist (Crypto)- Flipside Crypto", "companyRating": null, "companyInfo": {"Website": "www.foundhuman.com", "Headquarters": "Boston, MA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Who you are- You're a lover of data and statistics who knows Machine Learning and some Computer Science - You're creative and you aren't afraid to be wrong. A lot. - You know your way around SQL-like databases (e.g. PostGres, Impala, MySQL), even better if have experience with Spark - You are intimately familiar with R and/or Python for analysis, exploration, and model-building- You build interactive prototypes of experimental solutions - You take pride in your code, and it's readable, functional, and reproducible - You know how and when to apply different algorithms and technical approaches to many problem types - You can describe a complex problem (or solution) in a way that doesn't put people to sleep, and doesn't leave them scratching their headsWhat You'll Actually Work on- Collaborate with other data scientists to explore and visualize our cryptocurrency data - Work directly with the engineering team to identify and implement the best approaches for storing and accessing our data - Create models that contribute to our broader understanding of the market - Assist in the construction of a high level model that characterizes the value and health of particular crypto-assets - Propose and design experiments or tests to evaluate new models, methods and data productsDesired Experience- Graduate-level data scientist, statistician, or machine learning engineer - Ideally a minimum of 4 years in a data science, ML engineering, or statistician role, developing algorithms, building models, and constructing visualizations & prototypes - Experience working with product teams, developers, and data engineers"}