{"jobID": "2309737902", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist", "companyRating": "4.6", "companyInfo": {"Website": "www.grandrounds.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "204000", "jobDescription": "The Role:Data Scientists at Grand Rounds work on problems that are core to the company’s mission. Major challenges include developing systems and models to identify the highest quality doctors in the country as well as methodologies to uncover the subtle differences between each physician’s clinical expertise. Additionally, patient-level modeling allows us to understand the specific healthcare needs of every person. With a high fidelity understanding of both patients and physicians we are able to route patients to both appropriate and high quality care.In addition to developing the company’s core technologies, data scientists provide decision support analysis for many teams across the organization including product development, sales, marketing, and strategy. Data scale ranges from small data sets that fit on a single laptop to large multi-terabyte clinical information in distributed database systems.About Us:Grand Rounds’ vision is to create a path to great health and health care, for everyone, everywhere. Founded in 2011, the company provides an employer-based platform that delivers improved outcomes for patients and their families. It does this through an end-to-end solution that connects patients with care informed by the latest and best practices—preventing and correcting misdiagnoses and unnecessary or failed treatments. Named second among Glassdoor’s 2016 Best Places to Work, Grand Rounds helps restore individual health and quality of life, and offers employers lower health care spend and higher employee productivity.In your first 30 days, you will: Onboard with the Grand Rounds team in San Francisco, setup your dev environment, get access to data systems, and become familiar with the tech stackLearn about on-going initiatives involving data scientists, product managers, and engineersSpend time with members of the Analytics, Medical, and Patient Care teams and learn how our teams collaborateBecome familiar with the data landscape and hit the ground running on a primary projectIn your first 60 days, you will: Accelerate on-going development efforts around physician quality and expertise modelsMaster the ins and outs of claims data: ICDs, CPTs, and all thatCollaborate with engineers to improve the claims warehousing infrastructureCollaborate with engineers to develop a process/pipeline for model updates that seamlessly flows data to production systemsIn your first 90 days, you will: Integrate into long-term multi-data-scientist ventures and deliver on one or several short-term individual projectsDevelop internal tools and codebases that are useful for other data scientists and/or engineersSpend time with Staff Physicians and other medical domain experts to learn about the world of healthcareDevelop an understanding of both immediate business objectives as well as longer term company aspirations to develop intuition around prioritization and trade-offs between short-term deliverables and longer term R&D; effortsResponsibilities:"}