{"jobID": "2649329177", "jobLocation": "Redwood_City_CA", "jobTitle": "RVT or Veterinary Assistant - Emergency -", "companyRating": null, "companyInfo": {"Website": "www.sagecenters.com", "Headquarters": "Concord, CA", "Size": "201 to 500 employees", "Founded": " 1992", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " United Veterinary Specialty & Emergency, VCA Animal Hospitals, BluePearl Veterinary Partners"}, "estimatedSalary": null, "jobDescription": "Registered Veterinary Technician or Assistant Bay Area - Emergency - ER - Full TimeWho we are: We at SAGE Centers are growing every single day! Our incredible teams are dedicated to providing the highest level of specialized, compassionate, and collaborative veterinary care in the industry.We are looking for a new RVT or Assistant for our ER Department at our gorgeous Redwood City Hospital! Who you are: If you are an RVT or Veterinary Assistant looking for the next step in your career we want to meet you. You will be challenged, you will learn, your compassion, skills, and ambition will be rewarded.Basic required qualifications:High school diploma and clinical experience in the veterinary industryStrong interpersonal skills to effectively interface with staff and clients using tact, patience, professional courtesy, and exhibit confidentiality and discretion where appropriateConsistent and reliable ability to perform mathematical calculations for drug doses, CRIs, client invoices and estimates, and other position-related calculationsMaintain the California Veterinary Assistant Controlled Substance Permit (VACSP); must obtain within 60-days of hire or transfer into this role; (this requirement is waived if incumbent holds a valid CA-RVT license)Valid California drivers license with proper vehicle registration and Californias minimum automobile insurance coverage requirementWork Schedule:Full-Time4/10 ScheduleDay or Swing ShiftSAGE Centers, a nationally recognized veterinary specialty hospital system in the Bay Area (Concord, Dublin, Campbell, and Redwood City), employs 350+ employees and veterinarians in a 24/7 setting. Our doctors and outstanding support staff have created a unique environment emphasizing high caliber, compassionate and ethical service to our patients, clients, and referring veterinarians, as well as a continued commitment to the growth and welfare of everyone involved in our organization.We offer competitive compensation and a benefits package with generous employer cost sharing that includes medical, dental, and vision, flexible spending, commuter benefits, and a 401(k) retirement plan that can include company contributions of up to 4% each year. We also offer a generous educational assistance program that supports ongoing learning and development, three weeks of paid time off, plus paid holidays.It is the policy of SAGE Centers to afford equal opportunities for all qualified persons, regardless of their actual or perceived: race, religious creed, color, national origin, ancestry, physical or mental disability, medical condition, genetic information, marital status (including registered domestic partnership status), sex (including pregnancy, childbirth, lactation and related medical conditions), gender (including gender identity and expression), age (40 and over), sexual orientation, Civil Air Patrol status, military and veteran status, and any other consideration protected by federal, state, or local law (sometimes referred to, collectively, as protected characteristics).Visit our careers page to view all current openings! http://www.sagecenters.com/careers/"}