{"jobID": "2830608374", "jobLocation": "San_Mateo_CA", "jobTitle": "Sr. Data Scientist - Health Data Platform", "companyRating": null, "companyInfo": {"Website": "www.humanapi.co", "Headquarters": "San Mateo, CA", "Size": "1 to 50 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Were hiring Sr. Data Scientist to join our team of data scientists and engineers to take on difficult problems in navigating benefits and in health and wellness outcomes. This team has already leveraged data science and machine learning techniques to build critical, revenue-driving products for the business. We are actively engaged in bringing research prototypes into production, performing basic research on new initiatives, and developing multiple new products.Our consumption of health data is growing at an exponential rate -- as our Data Scientist, you'll make sense of it all. We ingest clinical data (eg: medical history, allergies, test results) from hospitals and labs, and wellness data (eg: physical activity, sleep, nutrition) from devices and apps. Collectively, these data sets create a more detailed understanding of an individuals health than anything else today. The data recorded from these sources are both continuous and discrete.Using this data, you will contribute to research to enhance and personalize existing products and to develop new products. You will also work closely with data and infrastructure engineers as well as other product teams (e.g. user experience, search) to develop stable, scalable production systems to deliver machine learning driven products to our users.The ideal candidate will be an entrepreneurial, motivated data scientist who is eager to learn new things and make an impact on the industry. Health data experience is a plus, but it's not necessary - the team includes clinical experts who can supply the necessary medical background. You should be interested in solving very tough problems and pragmatic enough to figure out what can be solved now and what should be saved for later.You will:Build our deep normalization pipeline, creating medical models, and developing structured APIs with the engineer.Drive the machine regression / classification and normalization pipeline.Develop the NLP required to clean noisy unstructured data.Create machine learning models in situations where the data is sparse and high-dimensional.Improve the models ten times before an expert can label the dataDevelop normalization algorithms.Build algorithms required to gain deeper insights on the clinical data from thousands of hospitals.Important attributes:This position is for someone who has built at least one large classification system, dabbled with medical data sets, is well versed with NLP and Machine Learning, and is comfortable coding in languages such as Scala, Java, and Python.You've likely built your own parsers when the open source NLP parsers couldn't do the job and you've built machine learning pipelines.At Human API, our mission is to create health data liquidity through consumer empowerment. To do this, weve built the worlds first real-time health data network.We help organizations collect, and make sense of, health data on their consumers. Our network reach is 200 million U.S. lives and includes hospitals, clinics, pharmacies, labs, mobile applications, and devices. Human API is a data platform that delivers a comprehensive, longitudinal view of a consumers health in real-time. We empower our current customer base, of Fortune 500 companies, with the normalized clinical data they need to build the next generation of products. Human API currently powers products for life insurance underwriting, health insurance clinical analytics, pharmaceutical clinical trial recruitment, and a variety of other digital health products and platforms.We are headquartered in San Mateo, California and venture-backed by Andreessen Horowitz and Blue Run Ventures.We're looking for independent thinkers who care deeply about the problems we're trying to solve.At Human API, we believe that a diverse variety of people makes us better, and so we welcome people of all backgrounds.Want to build the future of health data with us? Apply today."}