{"jobID": "2730327768", "jobLocation": "Kirkland_WA", "jobTitle": "Intern - Marketing Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.sonobello.com", "Headquarters": "Kirkland, WA", "Size": "201 to 500 employees", "Founded": " 2008", "Type": " Private Practice / Firm", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Are you looking for a paid internship where you will be able to gain practical and real-world experience in measuring campaign effectiveness? Do you enjoy digging into Google Analytics? Can you conduct analysis, create and present your findings? Are you looking for an internship where you can learn from a small team of pretty amazing marketers? If so, then Sono Bello has a great opportunity for you.  Working in our National Support location located in Carillon Point in Kirkland, the Marketing Data Analyst Intern is responsible for supporting measuring and communicating the effectiveness of television, radio, digital, mobile, web, social media, and direct marketing campaigns and programs to cross-departmental stakeholders. The role will conduct analysis of campaign effectiveness, through the development and maintenance of automated dashboards, and present ad-hoc analysis related to lead behavior and patient activity. RESPONSIBILITIESSupport development of monthly and quarterly reports that highlight key insights and strategic learnings. Drive ongoing efficiencies in how metrics are pulled/analyzed.Drive analysis of campaign performance and collaborate with extended teams to identify new methods to effectively measure performance.Drive thorough analysis of key audience segments to identify opportunities for increased ROI.Collaborate closely with performance media managers to strengthen the effectiveness of campaign testing. This includes the development of a robust test plan, improving the usability of reporting, and the management and integration of key learnings. Analytical findings and innovative suggestions will drive test decisions.Collaborate and share learnings within the Marketing team and with wider teams to drive ongoing business strategy. Translate analytical findings into clear, easily understandable, actionable insights that drive strong business strategy.Drive improvements and enhancements of current reports and propose additional metrics to broaden the lead/ patient story and effectively showcase the overall impact of Marketing channels over time.Measure and communicate the effectiveness of digital, mobile, web, social media and direct marketing campaigns/programs.Perform deep-dive analyses of program and campaign effectiveness. Build data queries and create reports.Develop, publish and maintain automated dashboards for the division."}