{"jobID": "2802103878", "jobLocation": "New_York_NY", "jobTitle": "Account Manager, Enterprise", "companyRating": null, "companyInfo": {"Website": "www.wayup.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "WayUp is the go-to platform for millions of early-career professionals to explore job and internship opportunities, receive advice, and get discovered by employers. Top companies from startups to Fortune 500s use WayUp's platform to reach, recruit and engage with the new generation of early-career talent. Since launching in 2014, WayUp has helped millions of candidates launch their careers.  WayUp is at a pivotal point in its development. Now experiencing its most rapid growth to date, the company needs an Account Manager for our Enterprise Clients, reporting to the Director of Customer Success. Our ideal candidate is someone who thrives in a fast-paced environment and has experience growing existing client relationships as well as meeting and exceeding quota on a book of business. RESPONSIBILITIESManage a book of business of our Top 30-40 Enterprise ClientsBuild and nurture Fortune 500 client relationships with Key Decision MakersMeet and exceed renewal and upsell quota while maintaining an active pipelineDeeply understand our product suite; you should be able to identify a customer challenge and how our technology can help solve that problemStrategic identification of upselling and expansion opportunitiesWork closely with our branded content, video and design teams to manage timelines, relay client feedback and help bring to life a variety of custom content executions for our clientsSet KPIs with customers and analyze campaign success by holding quarterly business reviews and reporting against KPIsAct as a trusted advisor and thought leader in the HR technology and recruitment spaceKeep clients happy; there is NO problem that cannot be solvedBe comfortable interfacing internally with Sales, Product/Engineering, Marketing, Branding, Operations and moreThink outside the box and love what you do!REQUIREMENTSYou have 5+ years of experience in a client-facing sales roleYou have experience working at a B2B SaaS or technology company in a client-facing roleYou meet and exceed sales quotas and have managed $500,000+ in Annual Contract ValueYoure exceptionally organized and have the ability to manage evolving priorities and sales pipelineYou have experience with strategy-based client managementYoure a self-starter that can work independentlyYou have executive presence and excellent written and verbal communication skillsYou have top-notch presentation skills and consider yourself an expert at presenting to Key Decision MakersYou enjoy entrepreneurial environments and are adaptable to your role extending past traditional functionsYou welcome change and the opportunity to build something meaningfulPERKS & BENEFITSComprehensive Healthcare Plan (Medical, Dental, Vision)401k Plan through MassMutualWeekly Catered Team LunchMonthly Lunch & Learns with Industry Leaders, CEOs, VC's and moreUnlimited Sick DaysPre-Tax Commuter & FSA BenefitsContinuous Education StipendOffice Snacks, Cold Brew and Lots of Dogs! By submitting your application, you agree to submit a list of references as part of the interview process and consent to WayUp contacting these references.  The Company values the array of backgrounds, talents and perspectives that a diverse workforce brings. All qualified applicants will receive consideration for employment without regard to actual or perceived race, religious creed, color, national origin, ancestry, physical or mental disability, medical condition, genetic information, marital or familial status (including registered domestic partnership status), sex and gender (including pregnancy, childbirth, lactation and related medical conditions), gender identity and gender expression (including transgender individuals who are transitioning, have transitioned, or are perceived to be transitioning to the gender with which they identify), age, sexual orientation, Civil Air Patrol status, military and veteran status, certain arrest or conviction records, domestic violence victim status, and any other consideration protected by federal, state or local law (collectively referred to as \"protected characteristics)."}