{"jobID": "2786575389", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.kenshoo.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Marin Software, Adobe, IgnitionOne"}, "estimatedSalary": "102000", "jobDescription": " About The Position Are you ready to take your career to the next level?Kenshoo is looking for the best and the brightest to join our rapidly growing team. We’re proud of our industry-leading digital marketing software but we’re even prouder of the people behind it. That’s where you come in!Our work environment is very fast-paced and entrepreneurial. We work hard, we play hard, and we always do whatever it takes to delight our customers! Kenshoo Analytics is hiring!  The role of the Analytics team is to empower customers to leverage Kenshoo’s suite of algorithmic products such as bid optimizers and to demonstrate and test the value of these algorithmic products internally and externally.  The ideal candidate should have strong data analysis skills as well as programming skills and good understanding of statistics and hypothesis testing.  The ideal candidate will show an intuitive understanding of digital marketing, a strong grasp of business models and statistics, excellent analytical and problem solving skills and the ability to coherently describe complex mathematical concepts to a layman audience.  The candidate should also demonstrate a consultative approach to addressing client needs. This role will report to Director of Analytics. Responsibilities:Have a full understanding of Kenshoo’s bidding capabilities and relevant products, for customers’ and internal training and support.Work closely with our research team to provide both client feedback and analysis to help guide data driven decisions to improve our products.Perform analysis of customer data to provide clients with an understanding of how the test is performing vs. control, attribution strategies and more.Help build internal tools that allow the automation of data analysis to provide both proactive and reactive support for Kenshoo’s optimization products.Build POCs ( proof of concept ) that will be tested in production to solve for clients optimization needs using machine learning tools.Represent Kenshoo Research in conversations with clients and partners. Advocate for our algorithmic solutions, testing approaches and view of digital marketing and provide consultation how how to best set up and leverage Kenshoo’s optimization products.Requirements Skills/Attributes Required:Good working knowledge of statistics and modeling (be able to explain as well as setup tests)Strong analytical and problem solving capabilitiesStrong SQL capabilities - experience querying data from relational DB engines.Experience with advanced analytical tools (at least on of these : Python scientific libraries, R, Matlab)Strong written and verbal communication skills - be able to take complex math and analytical concepts and explain to working teams and client executivesStrong teamwork - internally with our teams as well as with clientsStrong written and verbal communication skills - be able to take complex math and analytical concepts and explain to working teams and client executives.Prior experience in the internet marketing industryKnowledge and experience in A/B testing would be a strong plusEducation/Experience:BS/BA required, ideally in a relevant field to analytics (finance, business, engineering, information systems, math, science, etc)1+ years in consulting/business analytics rolesMS in Machine Learning, Data Science, Statistics, Information Systems, Business Intelligence a strong plusExperience with and understanding of the big data technology stack (HDFS, MapReduce, Spark, Hive) - A strong plusHaving worked at Google, MSFT, Facebook, or other top internet company in an analytics/business intelligence role a strong plusHaving worked in internet marketing analytics at a top advertiser a strong plusMBA a plus but not required"}