{"jobID": "2799341189", "jobLocation": "Framingham_MA", "jobTitle": "Intern - Artificial Intelligence for IT Operations", "companyRating": null, "companyInfo": {"Website": "www.huawei.com", "Headquarters": "Shenzhen, China", "Size": "10000+ employees", "Founded": " 1987", "Type": " Company - Private", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " Ericsson-Worldwide, Cisco Systems, Apple"}, "estimatedSalary": null, "jobDescription": "Huawei is a leading global information and communications technology (ICT) solutions provider. Through our dedication to customer-centric innovation and strong partnerships, we have established end-to-end advantages in telecom networks, devices and cloud computing. We are committed to creating maximum value for telecom operators, enterprises and consumers by providing competitive solutions and services. Our products and solutions have been deployed in over 170 countries, serving more than one third of the world’s population. Huawei has over 180,000 employees, approximately 80,000 of which are engaged in Research & development. Huawei operates a global network of 12 regional headquarters, 14 R&D; Centers, 36 Innovation Centers jointly operated with customers, and 45 Training Centers. Huawei is leading the way by rethinking the future. From devices to telecom infrastructure to cloud computing and convergence solutions, we are rethinking every link in the chain with ICT based innovation to deliver a better future...faster. Intern - Artificial Intelligence for IT Operations Location: Framingham, MA (R&D;) Req #: 9655 # of Openings: 1 DescriptionWe have an exciting internship opportunity in AIOps (Artificial intelligence for IT Operations). The role of the intern is to conduct technical research on different machine learning algorithms for different AIOps examine the whole life cycle of high quality software development of the Next Gen Inteligent IT. The intern will have the opportunity to work with team of experts in the field and also develop practical technical skills in AI (machine learning, deep learning), big data, IT systems and operations which will be valuable in tackling complex IT issue. Job ResponsibilitiesResearch and develop machine learning algorithms for storage media fault predictionsRun experiments to measure algorithms’ effectiveness and performanceOptimize algorithms for real-time performanceInvolve in full stack software development for AIOps projects/products including data collection, data process, big data, machine learning services and visualization technologies by using state-of-art technologies including development/deployment in cloud, containers, microservice, Hadoop, NoSQL, large scale messaging systems, machine learning services, and visualization of big dataWrite documentation and tests for codeWork in a team environment by following Agile software development processRequirements for position:Currently enrolled in an MS or PhD program in Artificial Intelligence, Computer Science, Information technology, or related fieldexperience in developing software system with machine learning services Experience programming in Python and JavaExperience in designing and development of data collection and pipelinesExperience in designing and development of big data systemsExperience in development on cloud platformExperience with standard machine learning frameworks such as TensorFlow and CaffeWork authorization in the USHuawei Inc. is proud to be an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Why work for us?In 2017, Huawei's revenue reached CNY600 billion (US$92 billion based on the year-end exchange rate), an increase of 15% (YOY)We invest in engineering and innovation - 80,000+ of our 180,000+ global employees work in R&D;, and we invest roughly 10% of our annual revenue in to R&D.; U.S. R&D; efforts are carried out by Futurewei Technologies, Inc.Futurewei’s commitment to R&D; is a major reason why Huawei holds one of the largest patent portfolio’s in the world: Since 2008, Huawei has been a top five international patent filer, per the World Intellectual Property Organization.We support green energy - Lowered CO2 emissions by 13,000 tons via Huawei’s green packaging solutionsFuturewei works with leading universities to further R&D; efforts, investing more than $10million USD each year to support programs at Harvard, MIT, Stanford and Yale, among others. Are you a returning applicant?Previous Applicants:Email:Password: If you do not remember your password click here. Back to Search Results New SearchCopyright © Huawei Technologies Co., Ltd. 1998-2017. All rights reserved."}