{"jobID": "2747013973", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Analyst, Attractions and Rentals", "companyRating": "3.4", "companyInfo": {"Website": "www.tripadvisor.com", "Headquarters": "Needham, MA", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Company - Public (TRIP) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Priceline.com, Airbnb, HomeAway"}, "estimatedSalary": "107000", "jobDescription": "At TripAdvisor Attractions and Rentals, the only thing we love more than travel is data. We slice it, we dice it, and we use it to empower our decision making. In fact, most would be surprised at just how many people in our office can write their own SQL queries.  The Attractions and Rentals Analytics Team is seeking a Senior Analyst, Business Analytics who has the analytical skills and business experience to support numerous end users from an analytics and measurement perspective and is looking to join a fast-growing all-star team dedicated to providing the highest quality data driven insights. What Will DoLead analysis/reporting of current business operating metrics, focused on developing the capability to provide insight into TripAdvisor's attractions and rentals’ products and improving TripAdvisor's understanding of its market-by-market customer propositions and competitor positioningProvide timely insights and analytical support to different internal stakeholders to support effective business decision-makingCreate concepts, justify business cases and manage the implementation of changes to the website experience to improve customer engagement and value metricsEmploy/automate reporting tools to measure customer interaction (such as acquisition of members, engagement metrics, and member and user value) and competitor positioning (such as reach and page impression growth, content feature set, and marketing activities)Lead analysis of consumer and member behavior across the websites, using web analytics tools and internal warehouse data to identify source of traffic and which areas of the site, content and functionality users are engaging inIdentify key success indicators and determine best practices for measurement and reportingAssist with ad hoc queries and provide analytical support to our fast-growing business as it evolvesWhat you will bring to the team3-5 years of experience in an analytical role (ideal backgrounds include: a similar business analyst role at a web company, a data-based consulting role, or other data strategy type positions)Education: Bachelor's Degree in an analytical field (math, economics, engineering, statistics, etc), Master’s Degree a plusExcellent problem-solving and analytical skills, involving data analysis and predictive modelingAbility to work with large dataset and summarize findings in a clear formatCombine creative and pragmatic use of insight and data with attention to detailYou live in Excel, a SQL client, and a few other useful tools of the data tradeProactive not reactive, with ability to work independently in a fast-paced environmentAbility to take in loose requirements, work independently, ask smart questions, and produce high quality actionable insightsConfident with learning new tools, technologies, and methodologiesAbility to work at all levels including senior management; and across multiple functions/departmentsSmall company experience with hands on / can-do mindsetSome programming/scripting ability a huge plusExperience with statistical packages such as SAS, R, SPSS, etc. a plus"}