{"jobID": "2684400704", "jobLocation": "New_York_NY", "jobTitle": "Security Client Executive, Financial Services - NY or NJ", "companyRating": null, "companyInfo": {"Website": "www.ibm.com", "Headquarters": "Armonk, NY", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Public (IBM) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Accenture, Microsoft"}, "estimatedSalary": null, "jobDescription": "Job Description IBM Security Solutions is looking to hire a Security Client Executive to focus on the Financial Services Sector in the Northeast US Region. It is preferred that the candidate resides in New York or New Jersey.  The Security Client Executive (SCE) is the lead sales executive for complex security opportunities that integrate multiple custom security offerings including security software, security services, and cross line-of-business & partner solutions. The Security Client Executive has the responsibility for successfully selling Software, SaaS, and Security Services. The SCE is responsible for the overall sales strategy that drives closure of selected security solutions. These are normally large, complex and highly competitive sales situations with IBM's strategic customers. Executive communication and coordination is critical to the success of these engagements. In this role you will:Lead sales engagements, selling solutions to complex IT and business requirements.Manage the customer relationship, participate in strategic solutioning, establish beneficial pricing that is highly competitive, and close the opportunity.Work closely with Software Client Leader (SCL) teams to financially engineer offers that leverage existing Enterprise License Agreement contractsDemonstrate a clear understanding of the customers business, organization, culture and the compelling reasons to act and manage the third party consultant relationship (if applicable).Devise and articulate a unique and compelling value proposition (which typically leverages IBM and creates value), so that customer decision-makers clearly grasp the short and long-term business and financial value of a relationship with IBM.Lead the development of detailed opportunity win plans including leveraging IBM senior executive client coverage plans, consulting resources and the broader IBM team to progress and close complex opportunities.Apply both Security (Security Software Products, SaaS and Services) and Industry Expertise to discuss client's current and future priorities and pain points. Describe the impact and value of Security solutions to the client's business and the client's capability to manage security risks.Key Skills:Experience identifying and driving to closure strategic sales activities for Software, SaaS, and ServicesProven track record of effective account penetration, account development, and account growthTeam player with the ability to leverage and collaborateSolid track record of consistently achieving/over-achieving quota targetsAccurate forecasting skills and good command of marketplace Required Technical and Professional Expertise At least 3 years' experience in Security Software Sales Preferred Tech and Prof Experience At least 5 years' experience in Security Software SalesExperience in Financial Services Security Software Sales strongly preferred EO Statement  IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status. "}