{"jobID": "2649907613", "jobLocation": "Santa_Clara_CA", "jobTitle": "Senior System Software Engineer", "companyRating": null, "companyInfo": {"Website": "www.nvidia.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1993", "Type": " Company - Public (NVDA) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We are now hiring a Senior System Software Engineer.  NVIDIA is looking for a world-class engineer to join its GPU Resource Manager team. In this position, you will be part of a dynamic crew that develops and maintains systems software for complex heterogeneous computing systems that power disruptive automotive products. Our offerings to the automotive industry begin with navigation and infotainment systems, back seat entertainment systems, instrument clusters and move into the exciting field of autonomous computing, deep neural networks and self-driving cars. Our team plays a vital role in realizing the vision behind these products by building core technologies and platform solutions that are not only competitive but industry-first. Whatyou’llbedoing:Focus on doing development work on our line of SOC hardware, with a strong emphasis on the automotive marketDesign, implement and optimize the driver stack that controls NVIDIA's GPU hardware, the heart of our discrete and SOC devicesWork on user space and kernel space software controlling complex and sophisticated hardware that does graphics rendering, multimedia encoding and decoding, parallel computation, bus control, and resource managementWrite code for high end ARM processors, running Linux, QNX, and other embedded OSesWhatweneedtosee:CS/EE/CE with at least 6 years of experienceExcellent C programming skillsDeep understanding with embedded systems architecture, operating system fundamentals, and bus protocols (PCI-E)Experience with memory management, cache operations and optimizationsLow level programming such as HW abstraction layersExperience with reading and interpreting hardware specsExperience with programming complex, high performance hardwareWaystostandoutfromthecrowd:Understanding of GPU architectures, and associated programming techniques.Experience with assembly language Academic and commercial groups around the world are powering a revolution in artificial intelligence using deep learning techniques running on NVIDIA GPUs, enabling breakthroughs in problems from image classification to speech recognition to natural language processing.  Intelligent machines powered by AI computers that can learn, reason and interact with people are no longer science fiction. Today, a self-driving car empowered by AI can meander through a country road at night and find its way. An AI-powered robot can learn motor skills through trial and error. This is truly an extraordinary time. The era of AI has begun.  NVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most brilliant and talented people in the world working for us. Do you have real passion for technology? Are you creative, autonomous and seeking a challenge in the autonomous auto / self-driving car space? If so, we want to hear from you.NVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression , sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law."}