{"jobID": "2710910964", "jobLocation": "Newark_NJ", "jobTitle": "Physician - Center Medical Director", "companyRating": null, "companyInfo": {"Website": "www.cleanslatecenters.com", "Headquarters": "Northampton, MA", "Size": "201 to 500 employees", "Founded": " 2009", "Type": " Private Practice / Firm", "Industry": " Health Care", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " This coordinated care approach means fewer administrative duties and upfront access to important patient data. In addition, it allows you to practice at the top of your license to focus on what matters most - the patient. Withhigh-quality, company-provided training, you will never have to turn away a patient who needs your help.  Additionally, as a Physician with CleanSlate, you will enjoy a great work life balance with clinics closed for holidays and closed early on Fridays. You will be immersed in an environment ofcontinual learning and collaboration. Most importantly, you will be taking a stand in the battle against opioid addiction and helping solve one of the most challenging epidemics in our nation's history. You willsave livesand help people suffering from addiction achieve the lives they want and deserve.  Join us in our mission to bring effective, quality treatment to tens of thousands of patients across the country!Apply today.Job Duties& ResponsibilitiesProvide medical review for patientsMedication managementHelp patients develop their knowledge and understanding of their conditionHelp patients learn to utilize the tools they need to recover and avoid relapseProvide oversight and direction for other practitionersFoster a team of compassionate care providers who effectively treat patients to recoveryOversee and ensure program adherenceQualifications Required: Valid medical license in state of practiceBoard Certified. IM, FM or EM preferredControlled Substance Registration Certificate and DEADEA X Waiver (company will assist you in obtaining this if needed)Experience using electronic medical records (EMR) softwareWhen applicable, willingness to obtain board certification in Addiction Medicine within two years of hire (training and testing paid by company) Preferred: Previous experience in a chemical dependency treatment environment"}