{"jobID": "2796365079", "jobLocation": "Boston_MA", "jobTitle": "Operations Manager - Overnight", "companyRating": "4.2", "companyInfo": {"Website": "www.crothall.com", "Headquarters": "Chesterbrook, PA", "Size": "10000+ employees", "Founded": " 2001", "Type": " Subsidiary or Business Segment", "Industry": " Restaurants, Bars & Food Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "45000", "jobDescription": "Crothall Healthcare is a Compass One Company that provides specialized, high-quality, innovative, and responsive support services exclusively to the healthcare industry. Crothall serves many of the Top 100 Hospitals among their 1200 healthcare clients and across the nation in 39 states. Crothall has earned a spot on the Top 100 Best Places to Work in Healthcare in 2013, 2014, and 2015, and a Becker’s Healthcare Top Places to Work in 2016. Our core services include: Environmental Services, Patient Transport, Laundry & Linen, Facilities Management, Healthcare Technology Solutions, and Ambulatory Services. For more information, go to www.crothall.com.Operations Manager - OvernightWorking as an Operations Manager, you are responsible for assisting senior EVS leaders in directing and overseeing the operational needs of the Housekeeping Department. You will coordinate the tasks of the front-line staff. You will serve as a liaison between administration and hospital departments and provide the highest possible level of service. Key Responsibilities:Establishes and annually reviews standards and work procedures for all Housekeeping staffPlans work and staffing schedules and areas of work to ensure adequate services are renderedAssists in the hiring process; interview, hiring and training of new associatesOrients, develops, and supervises all supervisory/housekeeping staffConducts regular inspections and makes recommendations to the facilityMonthly reporting of goals, accomplishments, and future plansStaff education and trainingCommunication with staff, administration, and other departmentsCoordination of outside services (i.e. Pest Control, Window Cleaning, Medical and Solid Waste, Document Destruction, and Recycling program)Preferred Qualifications:Four year college degree, military experience, or equivalent work experience requiredAt least one year of supervisory experience in housekeeping or service-related field with high customer/client contact requiredDemonstrated progressive growth in the field of health care housekeeping or facility maintenance preferredAbility to communicate effectively in written format and oral presentationsAbility to multi-task and establish prioritiesAbility to maintain organization in a changing and stressful environmentExhibit initiative, responsibility, flexibility, and leadershipPossess a thorough knowledge of contract administration and office proceduresMilitary Transferrable Skills:Non Commissioned Officer E4+ with experience in Planning, developing and directing logisticsAll military branches with experience of supervising a group of soldiers of 15 or moreTroubleshoots, isolates and identifies causes of equipment malfunctionTeaches technical skills to lower grade soldiersPrepares costs and labor estimatesApply to Crothall today! Crothall is a member of Compass Group USA Click here to Learn More about the Compass Story   Compass Group is an equal opportunity employer. At Compass, we are committed to treating all Applicants and Associates fairly based on their abilities, achievements, and experience without regard to race, national origin, sex, age, disability, veteran status, sexual orientation, gender identity, or any other classification protected by law.Req ID: 178658  Crothall Healthcare   JANELLE C ALLEN   SALARIED EXEMPT "}