{"jobID": "2770578435", "jobLocation": "San_Jose_CA", "jobTitle": "Flexible 1-on-1 Tutoring Opportunities: Great Pay, Rewarding Work!", "companyRating": "4.8", "companyInfo": {"Website": "www.nurturingwisdom.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "25", "jobDescription": "WhyTutor With Nurturing Wisdom?You Will Receive:A Flexibleschedule: You'll set your own schedule and decide where you're willing to tutor.Greatstudents: We'll match you with students who we believe are a great fit for you.A Top-notch curriculum: You decide what you're willing to tutor and we'll teach you our highly effective tutoring strategies.Resourcesandsupport: You will have a dedicated tutoring coach to answer your questions and help you develop your tutoring skills.Competitivepaywithopportunitiesforincreases: You will earn a higher hourly rate when you tutor more students.CareerOpportunities: You might have the opportunity to join us as a full-time staff member; many of our tutors are now part of our team.About Us: Since 2005, Nurturing Wisdom Tutoring has provided one-on-one, in-home tutoring throughout Chicagoland. Our customized academic, test prep, and executive functioning tutoring has helped thousands of students achieve their educational goals. From our tutoring directors to our test graders to our coaches, our team works together to provide the best possible experience for our tutors and students. You Have:A completed bachelor's degreeExperience instructing, mentoring, tutoring or working with students in some capacityReliable transportation to your students' homesA dedication to students' growth.You Are Passionate About Tutoring One or More of These Subjects:Test Prep (ACT, SAT, high school entrance tests, achievement tests)All levels of reading and writingMath (algebra two, trigonometry, calculus)Science (biology, chemistry, physics)Executive functioning (organization, study skills, time management)We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, gender identity, age, marital status, veteran status, or disability status."}