{"jobID": "2781454510", "jobLocation": "New_York_NY", "jobTitle": "Healthcare/Biotech Analyst Internship, Business Development", "companyRating": null, "companyInfo": {"Website": "www.schrodinger.com", "Headquarters": "Portland, OR", "Size": "51 to 200 employees", "Founded": " 1990", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Schrödingers mission is to revolutionize drug discovery through the use of breakthrough computational methods applied to drug design. We are currently looking for outstanding interns to join our Business Development team. The participants will be responsible for leading research and market analysis on a series of key therapeutic areas for the development of novel medicines by Schrödingers drug discovery group. The intern will assist in generating recommendations regarding marketability of potential therapeutics and appropriate business models that should be pursued. Our drug discovery group of over 50 scientists includes designers, modelers, computational chemists, medicinal chemists, crystallographers, biochemists, and biologists with many years of combined drug discovery experience. The group is supported by more than 100 software developers and engineers. Three of the programs Schrödinger has worked on in the past 5 years have progressed into the clinic and one received FDA approval earlier this year.Responsibilities Perform a market assessment to identify areas of unmet medical need within select therapeutic areas Collect and analyze data on clinical development pipelines and recent acquisition/licensing deals to assess the competitive landscape and build a model to determine potential value of novel medicines Interpret data from public industry reports and private databases and identify key market metrics to be monitored Work closely with the internal drug discovery team and network with industry experts to gather insightsQualifications Currently completing a Masters in Public Health or Masters in Business Administration with Healthcare focus Bachelors in Life Science or other relevant science experience Strong analytical and critical thinking skills with ability to interpret large amounts of data Some familiarity with market research techniques and financial modeling Strong communication and presentation skillsAs an equal opportunity employer, Schrödinger hires outstanding individuals into every position in the company. People who work with us have a high degree of engagement, a commitment to working effectively in teams, and a passion for the company's mission. We place the highest value on creating a safe environment where our employees can grow and contribute, and refuse to discriminate on the basis of race, color, religious belief, sex, age, national origin, citizenship status, marital status, union status, sexual orientation, or gender identity. To us, \"diversity\" isn't just a buzzword, but an important element of our core principles and key business practices. We believe that diverse companies innovate better and think more creatively than homogenous ones because they take into account a wide range of viewpoints. For us, greater diversity doesn't mean better headlines or public images - it means increased adaptability and profitability."}