{"jobID": "2829743007", "jobLocation": "San_Jose_CA", "jobTitle": "Heterogeneous Multicore Simulation Expert", "companyRating": null, "companyInfo": {"Website": "www.xilinx.com", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 1984", "Type": " Company - Public (XLNX) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Qualcomm, Intel Corporation, AMD"}, "estimatedSalary": null, "jobDescription": "Description Xilinx is looking for a world class Senior  Systems Engineer to help us build the next-generation, parallel  programming environment for current and future Xilinx FPGA devices. You will be  working in a team responsible for building production quality compilers, simulators,  debuggers and performance analysis tools to support heterogeneous systems  consisting of multi-core processors and FPGA fabric.  As a senior member of the team, you will be  responsible for design and implementation of parts of a heterogeneous, multi-core  SystemC simulator. You will get a chance to tackle cutting-edge, interesting  and challenging problems working on simulators for heterogeneous multicore  systems. Job  requirements ·  BS/MS (PhD preferred) in CS/EE with a minimum of 8 years  experience in parallel programming/simulation environments.  ·  Extensive experience with various aspects of implementing  simulators for parallel and heterogeneous architectures. Good understanding of parallel  programming models.  ·  Experience in implementing many of  the following in production simulators:  o  Instruction-set  and pipeline simulation, memory hierarchy modeling. Experience with ARM-based  SoC is a plus.  o  Event-driven  and cycle-based simulation, compiled simulation.  o  SystemC  development experience.  ·  Solid understanding of machine architectures and  micro-architectural performance considerations.  ·  Knowledge of SystemC 2.0 language, TLM,  architecture modeling using SystemC and SystemC-RTL co-simulation a plus.  ·  Demonstrated C/C++/SystemC programming skills  with production system software.  ·  Leads and mentors other engineers.  ·  Must  be a hands-on person who takes initiative and does whatever is necessary to make  a project successful.  ·  Excellent  written/verbal communication skills.  ·  Proven  ability to work with cross-functional and geographically distributed teams.  ·  Team  player with ability to work across a diverse team.  ---- x ---- Education RequirementsBS/MS (PhD preferred) in CS/EE Years of Experience+ 8 years experience  developing parallel programming/simulation environments"}