{"jobID": "2723222613", "jobLocation": "New_York_NY", "jobTitle": "Senior Technical Designer for Missy Brands", "companyRating": "3.0", "companyInfo": {"Website": "www.ojg.com", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "90000", "jobDescription": " QualificationsTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. 10 years’ experience as a technical designer in Denim, Woven and Cut & Sew knits for Missy, Petite and X sizes.Qualified to revise pattern blocks and instruct factory on how to correct their pattern.Computer literate and have communication skills.CAD drawing skills.Strong knowledge of fit and how to execute and improve the fit of a garment.Strong construction knowledge.Must have good retention of facts and department systems.Attention to detail and accuracy is a required skill.Able to make decisions independently.Minimum 3 years of experience supervising junior staff in the measuring and preparing fit samples for fitting on model along with supervising taking notes in the fit sessions.Must have first-hand knowledge of sewing and factory processes.Must have knowledge of denim washes and processes as it pertains to the fit and execution of denim product. We are an EEO/Affirmative Action Employer. All qualified applicant swill receive consideration for employment without regard to race, color, religion, sex, national origin, disability or protected veteran status.  We are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class."}