{"jobID": "2825157303", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst", "companyRating": "2.3", "companyInfo": {"Website": "www.costarcareers.com", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 1987", "Type": " Company - Public (CSGP) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " First American, Xceligent, PropertyInfo"}, "estimatedSalary": "86000", "jobDescription": " Data Analyst Job Description The Data Analyst/Database Marketer is responsible for supporting the most heavily trafficked commercial real estate marketplace online with clear and insightful analyses on sales and marketing data, and will be responsible for developing and maintaining key data sets for Direct Mail Campaigns, Email Campaigns, and Critical Business Decisions. In addition, the Analyst will be responsible for data mining and A/B testing against different hypotheses which impact different Key Performance Indicators. The Data Analyst should be highly skilled in working with SQL databases, Google Analytics, Excel and Tableau and/or Power BI. The role requires a well-developed business acumen and the ability to ask the required questions, and based on the data, suggest marketing options to increase visitors, on site activity, conversions and revenue. Qualifications:BS/BA degree (preferably in a technical or research/marketing field)1+ years of experience in analytics focused on turning questions into insight and owning and maintaining data setsExperience in SQL, Excel, relational databases, database concepts, and database design.Ability to develop useful analytical tools and effectively communicate complex findings and ideas in plain languageExperience communicating the results of analysis clearly in writing, verbally and visuallyAbility to work on multiple projects simultaneously and to provide regular status updates proactivelyEssential Functions: Work with the Marketing and Business Intelligence Groups to deliver the right message, to the right person, at the right time in the right channel (interpret the need, gather the data, present the data, measure success, then based on the outcome, suggest next paths to go down, and changes to be made)  Partner with Marketing Team to develop engaging content and messaging for campaigns  Work with Marketing and Business Intelligence to expand personalization through use of segmentation and targeting  Drive process efficiencies through continuous improvement of personal workflows, datasets and tool sets.  Identify opportunities and implement actions to increase visitors to the site, increase key activities on the site (searching, lead submission etc.), and ultimately increase Ecom and Sales Team Revenue  CoStar Group is an Equal Employment Opportunity Employer; we maintain a drug-free workplace and perform pre-employment substance abuse testing  Apply on Company Website  Job ID: R16405  Help us improve CareerBuilder by providing feedback about this job: . CAREERBUILDER TIP For your privacy and protection, when applying to a job online, never give your social security number to a prospective employer, provide credit card or bank account information, or perform any sort of monetary transaction. Learn more.  By applying to a job using CareerBuilder you are agreeing to comply with and be subject to the CareerBuilder Terms and Conditions for use of our website. To use our website, you must agree with the Terms and Conditions and both meet and comply with their provisions.  CoStar Group  CoStar Group, Inc. (NASDAQ CSGP) is commercial real estate's leading provider of information, analytic and marketing services. Founded in 1987, CoStar is the primary provider of websites for commercial real estate information, analytics and marketing services. The company conducts expansive, ongoing research to produce and maintain the largest and most comprehensive database of commercial real estate information. Contact Info 101 California Street San Francisco, CA 94111  View Company Profile  Don't miss out on new jobs like this  Get the latest jobs delivered to your inbox. Unsubscribe at any time.  Create Job Alert  Saving Your Job Alert  Job Alert Created  Well, this is embarrassing. We are having trouble saving your search. You can try again or come back at a later time.  Maximum Email Alerts  This email address has reached the maximum of 5 email alerts. To create a new alert, you will need to log into your email and unsubscribe from at least one."}