{"jobID": "2831228580", "jobLocation": "Bellevue_WA", "jobTitle": "Senior Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.valencelevel.com", "Headquarters": "Bellevue, WA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "At Valence, were all about building potential. That goes for our clients as well as our co-workers.  Our mission is to help our customers advance through transformative technology, and we are looking for amazing people to make that happen.  Are you ready to dive in, with all your best ideas and creative vision? With Valence, you will work with cutting edge technology in a collaborative environment where you can influence direction and see the impact of your contributions. And we always celebrate as a team when weve just delivered something awesome.  From our beautiful, modern office space, to our Innovation Studio that encourages everyone to think broadly and experiment with new ideas, we are constantly looking for ways to make Valence an amazing career home for our employees.  Our culture is about open communication, open doors, mutual respect at all levels, promoting innovation, and embracing creative ideas from everyone. From our open recruiting process to fun-filled onboarding days with team members and company executives, we want our employees to feel seen and heard even before joining our team.  We offer fully paid medical benefits, 401(k) matching, 3 weeks of PTO plus paid holidays, flexible work schedules, 12 weeks paid parental leave, training, and numerous company and team building events. Valence is a dynamic place to build your career, innovate and learn. Come join us lets build potential together!  OVERVIEW:  Would you like to work with a team where the answer is actually Because Science!? Get your analytical geek on with us as our Senior Data Scientist! As a senior technology leader at Valence, you will provide both high-level recommendations to our clients as well as detailed guidance on the application of data science methods. Technical leadership across artificial intelligence, machine learning, and statistical analysis in a variety of application domains is expected to successfully deliver end-to-end client solutions. Furthermore, as a member of the overall organizational technology leadership team, you will help to shape the growth, vision and focus of Valence. With Valence, you will be able to work with cutting edge technology and explore state-of-the-art methodologies in a collaborative environment to influence direction and see the impacts of your contributions. We love to innovate and are looking for people with a passion for building solutions to hard problems - and love science!  DAY-TO-DAY: Provide data science expertise, vision and strategy to a variety of engineering teams focused on client solutions.Provide overall leadership in the fields of artificial intelligence, machine learning and statistical analysis for engineering teams to design, build and deploy end-to-end solutions.Build and evaluate prototype, problem-specific data science models as a baseline for engineering efforts.Act as technical liaison for sales and marketing teams, supporting ideation sessions with clients as well as for internal teams.Support project teams in developing technical strategies, roadmaps, and feasibility studies relating to data science applications.Lead authorship of technical aspects of business proposals, whitepapers, case studies and conference publications.Take smart risks and champion new ideas. WED LOVE TO HEAR FROM YOU IF: You have a deep interest in knowing the latest trends and techniques in the industry. You will have the opportunity to actively contribute to Valence assets publications, whitepapers, case studies, etc.5+ years quantitative experience applying modern machine learning and statistical methods to solutions ranging from prototype to production-grade.Deep understanding of foundational concepts in the machine learning and statistical analysis spaces.Experience using a wide range of techniques and models, including Deep Learning approaches.Practical experience evaluating models in context of real business scenarios and translating those models into standard software engineering products.Experience processing data using distributed analytical platforms such as Hadoop, ElasticSearch, Spark, various AWS or Azure services, etc.Influential publication record in scientific publication venues such as NIPS, AAAI, KDD, ICDE, ICDM, or similar.Proficient in one or more of Python, Java, C#, R, SQL, or Matlab.Bachelors or Masters degree in Computer Science, Statistics, Math, Computer Engineering, or a related technical discipline. WHAT WILL MAKE YOU SUCCESSFUL AT VALENCE?  You have a passion for innovation and technology. You have a sense of humor. You believe in the potential in everyone. You are ego-free. Youre collaborative and value a work culture where great ideas can come from anyone.  We are an equal opportunity employer and value diversity and inclusion at our company. We do not discriminate based on race, gender, religion, color, nation"}