{"jobID": "2829166652", "jobLocation": "New_York_NY", "jobTitle": "Accounting Manager", "companyRating": "3.8", "companyInfo": {"Website": "www.youvisit.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": " YouVisit is an immersive technology company powered by Aria, the leading enterprise platform that enables brands and organizations to engage and convert audiences through interactive 360° experiences.  YouVisit combines the power of Aria with an award-winning production studio to drive measurable results for nearly 1000 clients across mobile, desktop, Virtual and Augmented Reality. We work with some of the biggest brand names in the world such as Cisco, Deloitte, Harvard University and countless others.  We are expanding our finance team and were currently looking for an accounting manager responsible for managing the accounting function, which includes all facets of managing revenue, billing, collections, expense management, account reconciliations and financial reporting. Here are a few examples of the work youll perform:Establish procedures, strengthen internal controls and accounting policies and ensure flawless executionCreate deferred revenue schedules and monthly revenue recognition bookingsWork closely with credit analyst to ensure timely collection of outstanding balances and payout of liabilitiesManage the general ledger, monthly closing and financial statement preparation for review month-end + 5 business days with the executive teamReconcile Balance sheet accounts on a monthly basisPrepare banking reconciliationsOversee the expense reporting process to ensure timely disbursements and accurate reportingAssist in the preparation of the budget and financial forecasts and report variancesReview budgets monthly with CFOEnsure quality control over financial transactions and financial reportingManage payroll and benefit plan and complianceWork with outside CPAs to ensure timely filing of taxes as well as accurate reporting of financial statementsCommunicate effectively with all levels of management and third-party providersTo be successful in this role you: Have A Growth-Mindset:  At YouVisit we're always pushing the boundaries of what's possible through new technologies and new storytelling methods. As an accounting manager you will have a passion for constantly learning about our space and find new ways to help scale the business through process improvement or software system implementation.  Are Persistent:  Working with VR and AR requires us to constantly evolve our processes at every level and become infinite learners. As a result, we are looking for teammates that will strive to find solutions to challenges that come with scaling growing companies  Communicate Persuasively:  You will have communication skills to guide the senior leadership team through budget reviews, establishing strong controls and managing growth  Have great organizational skills:  You are able to manage competing priorities and operate under short deadlines while maintaining perfect accuracy  Have the following hard skills Bachelors Degree in accountingDemonstrated regulatory and compliance knowledgePublic accounting experienceMinimum of 7 years of hands-on accounting managerial experienceQuickbooks Online is requiredProcess driven and a proven record of establishing strong controlsDemonstrated ability in scaling up accounting functionCPA certification strongly preferredPrior role in a SaaS technology company preferredAdvanced knowledge of modeling in Excel YouVisit is an equal opportunity employer"}