{"jobID": "2828425349", "jobLocation": "Bellevue_WA", "jobTitle": "SAP Concur- Senior Data Scientist", "companyRating": "4.4", "companyInfo": {"Website": "www.sap.com", "Headquarters": "Walldorf, Germany", "Size": "10000+ employees", "Founded": " 1972", "Type": " Company - Public (SAP) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Salesforce, Oracle, Microsoft"}, "estimatedSalary": "151000", "jobDescription": "Requisition ID: 180951 Work Area: Software-Development Operations Expected Travel: 0 - 10% Career Status: Professional Employment Type: Regular Full Time Career Level: T3 Recruiter Name: Holly Zancanaro COMPANY DESCRIPTION As market leader in enterprise application software, SAP helps companies of all sizes and industries innovate through simplification. From the back office to the boardroom, warehouse to storefront, on premise to cloud, desktop to mobile device – SAP empowers people and organizations to work together more efficiently and use business insight more effectively to stay ahead of the competition. SAP applications and services enable customers to operate profitably, adapt continuously, and grow sustainably. Position Description: SAP Concur, a part of SAP, imagines the way the world should work, offering cloud-based services that make it simple to manage travel and expenses. By connecting data, applications and people, Concur delivers an effortless experience and total transparency into spend wherever and whenever it happens. SAP Concur services adapt to individual employee preferences and scale to meet the needs of companies from small to large, so they can focus on what matters most. The company serves more than 30,000 clients representing more than 27 million users in over 150 countries.    Job Overview:    Ready to demonstrate your marketing analytics and data sciences skills? We’re looking for a Senior Data Scientist to lead our global marketing data modeling and analysis efforts. In this newly created role, you will meet with internal customers to understand their problems, design experiments, model solutions, visualize data and present insights to leadership. You’ll have access to large B2B data sets from source systems like Marketo, Salesforce.com, and Adobe.     You will own projects from discovery to delivery as you lead SAP Concur’s global marketing organization from a descriptive reporting framework to predictive analytics mindset. Typical projects include: Attribution modeling to quantify marketing impactForecasting models to predict propensity to win dealsBasket analysis to optimize product / pricing bundlesEngineering tool to help prioritize marketing spend As a member of the Marketing Business Insights team, the Senior Data Scientist will play a key role in building the vision of a predictable, efficient, scalable growth engine. This role reports to the Senior Manager, Marketing BI. The ideal candidate will be familiar with a broad suite of data science tools and processes and can confidently own and deliver projects of varied scope and duration across the Marketing Organization.    Position Requirements:Bachelor’s Degree or above in Data Science, Statistics, Computer Science, Math, or similar quantitative field5+ years of professional experience with machine learning, statistical analysis, predictive modeling, and time series analysisEffective communication skills (written, verbal and presentation)A genuine desire to organize data and make it accessible with the technical skills to bring your ideas to realityPrevious hands-on exposure to statistical software packages like R, SciPy, Matlab, SPSS, SAS)Experience with a variety of relevant data manipulation languages (Python, Java, SQL)Experience in deploying models into a marketing environmentStrong data discovery and analysis skillsMentor aspiring data scientistsMust be eligible to work in the U.S.   Value Competencies:   Displays passion for & responsibility to the customerDisplays personal & corporate integrityHires, develops & rewards great peopleDisplays leadership through innovation in everything you doDisplays a passion for what you do and a drive to improveDisplays a relentless commitment to win *LI-HZ1    SAP'S DIVERSITY COMMITMENT To harness the power of innovation, SAP invests in the development of its diverse employees. We aspire to leverage the qualities and appreciate the unique competencies that each person brings to the company.  SAP is committed to the principles of Equal Employment Opportunity and to providing reasonable accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team (Americas: Careers.NorthAmerica@sap.com or Careers.LatinAmerica@sap.com, APJ: Careers.APJ@sap.com, EMEA: Careers@sap.com). Requests for reasonable accommodation will be considered on a case-by-case basis. EOE AA M/F/Vet/Disability: Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, gender, sexual orientation, gender identity, protected veteran status or disability. Additional Locations :"}