{"jobID": "2791299253", "jobLocation": "Seattle_WA", "jobTitle": "Sales Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.lightercapital.com", "Headquarters": "Seattle, WA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Lighter Capital is a Seattle based fintech company that has created a new fundraising path for early-stage tech companies. Our transparent, data-driven, tech-enabled process provides entrepreneurs revenue-based financing quickly without making them give up equity or board seats. We work with hundreds of visionary startup CEOs each year and our products are truly disrupting the start-up finance industry. Business is booming and we are looking for a talented Sales Data Analyst to join our Investment team. This position plays a key role in uncovering valuable sales pipeline and channel insights. This position reports into the Chief Investment Officer and is a great opportunity to grow your career in business operations and analytics!WHAT YOULL DO Collaborate with BI Analysts and Investment team leads and to develop dashboards for various datasets including sales pipelines, partnerships & referrals Collaborate with colleagues, leadership, and internal stakeholders to design, test, and analyze innovative initiatives Conduct descriptive, exploratory, and predictive analytics for the purpose of informing policy development, internal and external organizing campaigns, communications, and strategic decision making Utilize Salesforce and other data repositories to access, clean, prepare, analyze, and visualize data while carefully documenting all programs, datasets, and methodologies Prepare and deliver written and visual presentations, reports, or memos for internal stakeholders that communicate qualitative research and quantitative analysis in a simple, concise, and interpretable manner Maintain efficient QA processes to ensure the accuracy and quality of dataDESIRED SKILLS & EXPERIENCE 2+ years experience with data and analytics Analytical, data-driven mindset, with the ability to derive actionable insights from data Ability to apply insights to key business objectives Strong Excel skills including pivot table management and various binding functions Self-starter, strong sense of ownership, getting things done Strong written and verbal communication skills Bachelors degree, preferably in business, marketing, economy or statistics Passion for start-ups and an interest in sales and business operationsABOUT US We are smart, passionate and ambitious group of professionals who love coming to work every day - we hope you will too! We offer competitive salaries, pre-IPO equity, 100% covered medical insurance for employee and dependents, ORCA passes and a well-stocked office just steps from Westlake Center and Pike Place Market. Founded by Andy Sack, a Seattle-area entrepreneur and mentor to early-stage companies, Lighter Capital was one of the first lenders to use revenue-based financing to fund tech startups. Since 2012, weve provided over $110 million in growth capital to almost 250 startups.  Our goal is to revolutionize the business of startup finance and help founders maintain control of their companiesand their destinies. Check out more about how it works here."}