{"jobID": "2682516693", "jobLocation": "San_Francisco_CA", "jobTitle": "Associate Recruitment Consultant", "companyRating": null, "companyInfo": {"Website": "www.sthreecareers.com", "Headquarters": "London, United Kingdom", "Size": "1001 to 5000 employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Back to search results Associate Recruitment Consultant Job type: PermanentSalary: competitiveLocation: San FranciscoReference: VN3198 Specialist Staffing Group, the US division of SThree, is looking for an experienced agency recruitment professional to join our Life Sciences division, Real Staffing, which focuses on Pharma, Biotech, and Medical Devices. The San Francisco Real Staffing team is one of the highest earning teams across our US offices! The team works with exciting clients such as Genentech, Roche, Intarcia, etc. What this role entails:Work the entire 360 recruitment cycle: a blend of business development, sales and recruitingBecome an expert in your specific division of the Life Sciences marketOpen up new client accounts by pitching your specialized recruiting services to big name companiesFulfill clients' hiring needs by recruiting top-tier candidates for niche rolesGet out of the office to meet with high-level clients and candidates face-to-faceDeveloping and building your own business and brand within our companySkills we're looking for:Business development, sales, or account managementExcellent cold/warm calling and in-person networking skillsStrong relationship building skillsA great sense of ambition and resilienceWhat we have to offer:22 days PTO (+1 day each year you are with the company)Base salary + uncapped commission: your earning potential truly is in your handsA clear, merit-based career progression with fast-track opportunities into managementMonthly lunch club incentives at high end restaurants for our top performersIncentive trips to popular destinations like Vegas and MiamiModern office located on the 39th floor in the heart of the Financial DistrictAward-winning training programs (Training Magazine, 2017 & 2018)Medical, dental, vision, and 401k benefits If you think you'd be a good fit, reach out to us today! Must be able to work in the United States without a sponsor* Learn more about this opportunity on our USA careers page:  https://www.sthreecareers.com/en/our-locations/usa/  Sthree US is acting as an Employment Agency in relation to this vacancy."}