{"jobID": "2830935663", "jobLocation": "Issaquah_WA", "jobTitle": "Jr. Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.mossadams.com", "Headquarters": "Seattle, WA", "Size": "1001 to 5000 employees", "Founded": " 1913", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Deloitte, PwC, EY"}, "estimatedSalary": "52000", "jobDescription": "Why Moss Adams Why Moss Adams? Moss Adams brings more West to business. At Moss Adams, were excited by the greatness of possibility and the extraordinary potential for companies and individuals to prosper. With more than 2,600 professionals across 30-plus locations in the West and beyond, we provide the worlds most innovative companies with specialized accounting, consulting, and wealth management services to help them embrace emerging opportunity Introduction to the team Welcome to the Business Solutions Group (BSG) within Moss Adams. We are currently seeking a Jr. Data Analyst to join our IT consulting group as part of our Advisory Services practice specializing in business intelligence. This is an excellent opportunity to work with our clients to implement financial reporting, planning and forecasting systems and tools. This position helps our clients select, implement, configure, test and maintain financial reporting, planning and forecasting tools. Responsibilities: Participates in the selection, implementation, configuration, testing, support, customization and optimization our clients financial reporting, forecasting and planning systems.Develops and maintains accurate financial reports to meet client needsDevelops, configures and maintain accurate forecasting and planning models to meet client needsDevelops and maintains detailed technical knowledge of the specifications, operation, and diagnostics of reporting, forecasting and planning systemsImplements and coordinates organizational/tree/outline maintenance that impacts reporting. Implements process and report automation using systems capabilitiesConducts and contributes to client financial forecasting and planning projects and recommends business process improvement effortsParticipates in process improvement projects, identifies and implements reporting and data efficiencies to reduce client time compiling dataPlans and conducts training sessions for usersCommunicates with colleagues and peers regarding new technologies that could effect, improve or benefit clients of the firmDocuments procedures, reports, and operationsQualifications: Bachelor's degree or equivalent experience required; major in accounting or information systems preferredMinimum of 1 year of experience in a data analysis role requiredDetailed knowledge and understanding of business intelligence functions including, but not limited to analytics, data mining, reporting, report conversion, data cleansing, data modeling, and relational databasesExperience with SQL, T-SQL requiredExperience with Microsoft Reporting Services - SSIS, SSAS, SSRS preferredExperience with Power BI, Tableau, Adaptive Insights preferredBackground with relational databases, table designs, complex joins preferredStrong background in financial reporting & corporate performance management preferredStrong background with financial report systems and data flows preferred.Strong analytical and problem solving skillsEffective written and verbal communication skills. Able to articulate business value of systems enhancements or process change. Able to communicate technical information to a non-technical audience.Strong interpersonal skills. Able to work effectively with people and in teamsDemonstrated superior level of client serviceProficiency with Microsoft Office (Excel, Word, Outlook)Strong organizational skills and attention to detailExperience with process improvement and root cause analysisAble to think creatively, highly driven and self-motivatedAbility to travel up to 30%Moss Adams is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, sexual orientation, gender identity or any other characteristic protected by law."}