{"jobID": "2795713652", "jobLocation": "Sunnyvale_CA", "jobTitle": "Pricing Manager", "companyRating": "3.4", "companyInfo": {"Website": "www.infinera.com", "Headquarters": "Sunnyvale, CA", "Size": "1001 to 5000 employees", "Founded": " 2001", "Type": " Company - Public (INFN) ", "Industry": " Telecommunications", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Ciena"}, "estimatedSalary": "137000", "jobDescription": "Brief Description The Pricing Manager will influence Infinera’s business strategy working with Sales and partnering with Product Management to set pricing structures for key strategic opportunities and prepare financial analysis that facilitate executive decisions.  Candidate must be a team player and have equal balance of left and right brain for a highly visible and critical role: Passionate and curious to dive into complex spreadsheets with dexterity to create and understand multiple sensitivity analysisBusiness acumen with technical understanding of how telecommunications networks work and equipment is configuredManage meetings with company's top executives and prepare complex analysis to be succinctly and easily understoodExcellent communication skills to lead discussions with Sales, Product Management, Sales Ops and other teamsProject manage multiple competing assignments. Resourceful, flexible and be able to connect the dotsEntrepreneurial to continuously improve process and add value to the teamDescriptions Essential Functions/Key Responsibilities: Responsible for transacting pricing approval and strategy requests.Assist the pricing approval process and run the Pricing Committee meetings.Internal consultant to Sales and partnering with Product Management on pricing strategy for key customers.Create pricing initiatives to stimulate demand while maximizing profitability.Knowledge/Skills/Abilities:Natural leader.Comfortable speaking to company executives.Excellent quantitative and analytical skills. Expert knowledge of Excel.Excellent presentation and communication skills.Must be able to \\\"up-level\\\" complex data into concise actionable information.Very strong team player - role requires teamwork to provide best results.Results-driven. Success is measured through the quality of the deliverables.Creativity – needs to enhance role through innovation.Education Requirements:Technical Degree degree required strongly preferred MBA a strong plus5+ years of experience in hardware systems manufacturing companyExperience with optical networks a strong plusEducation Requirements: Technical Degree degree required strongly preferred MBA a strong plus5+ years of experience in hardware systems manufacturing companyExperience with optical networks a strong plusInfinera is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, age, status as a protected veteran, or status as a qualified individual with disability. EEO Employer/Vet/Disabled."}