{"jobID": "2804322498", "jobLocation": "New_York_NY", "jobTitle": "Per Diem Pharmacy Intern", "companyRating": null, "companyInfo": {"Website": "www.mountsinai.org", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 2013", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Strength Through DiversityGround breaking science. Advancing medicine.  Healing made personal.Dept Name-PHARMACY INTERNS AND  RESIDENTS REQ #75159Job  Title: PER DIEM PHARMACY INTERNRoles &  Responsibilities:A. Clinical/Technical/Service·  Demonstrates the ability to perform  clinical/technical/service/administrative tasks:· Audits the records of controlled  substances, ensures compliance with hospital, state, and federal regulations  as directed by a pharmacist, manager, or director; advises nursing and  pharmacy managers of discrepancies; assists in discrepancy resolution; maintains  the files of all completed controlled drug records; and ensures proper  storage.·  ·  Issues controlled substances and  prescription pads as per departmental policy under the direct supervision of  a pharmacist. Processes controlled substances returns and receives product  into inventory. Ensures appropriate inventory on hand at all times and  maintains required balances. Assists in discrepancy resolution.·  Obtains appropriate signatures when  issuing/delivering controlled substances and prescription pads.·  Maintains a file of all receipts for the 24  hour period prior to the return of the disposition records.·  Performs Kit-Check tray filling and tray  exchange functions on an accurate and ongoing basis.·  Routinely checks for and removes expired  medications from inventory.·  Returns re-useable medications to stock  before the end of the shift.·  Prepares medication orders for review by a  pharmacist.·  Assists in accurately filling med orders  and performs statistical data collection/reporting as needed.·  Conducts all required deliveries and other  patient care area rounds in a timely fashion.·  Repackages medications as per departmental  policy.·  Prepares parenteral and extemporaneous  products under the direct supervision of a pharmacist. Prepares labels and  affixes to product as required.·  Maintains work environment in a clean, neat  and orderly fashion.·  Required to enter specific data on  departmental records [Temperature readings, expiration date checks, etc.]·  Completes all required documentation.·  Conducts nursing unit inspections.·  Places main pharmacy stock order. Places  stock into inventory and maintains adequate inventory at all times, including  Pyxis units.·  May be required to  perform other duties as assigned or perform other duties when necessary. Requirements: ·  Currently registered & attending an  accredited PharmD program. English proficiency, oral and written.  ·  Previous pharmacy experience preferred.  ·  Valid NYS Pharmacy Intern Permit required.  Must provide permit for display in workplace.. 9436 - PHARMACY  INTERNS AND RESIDENTS Strength  Through Diversity The Mount Sinai Health  System believes that diversity is a driver for excellence. We share a common  devotion to delivering exceptional patient care. Yet were as diverse as the  city we call home- culturally, ethically, in outlook and lifestyle. When you  join us, you become a part of Mount Sinais unrivaled record of achievement,  education and advancement as we revolutionize medicine together.  We work hard to acquire  and retain the best people, and to create a welcoming, nurturing work  environment where you can develop professionally. We share the belief that all  employees, regardless of job title or expertise, can make an impact on quality  patient care.  Explore more about this  opportunity and how you can help us write a new chapter in our story! Who  We AreOver 38,000 employees  strong, the mission of the Mount Sinai Health System is to provide  compassionate patient care with seamless coordination and to advance medicine  through unrivaled education, research, and outreach in the many diverse  communities we serve.Formed in September  2013, The Mount Sinai Health System combines the excellence of the Icahn School  of Medicine at Mount Sinai with seven premier hospital campuses, including  Mount Sinai Beth Israel, Mount Sinai Beth Israel Brooklyn, The Mount Sinai  Hospital, Mount Sinai Queens, Mount Sinai West (formerly Mount Sinai Roosevelt),  Mount Sinai St. Lukes, and New York Eye and Ear Infirmary of Mount Sinai. The Mount Sinai Health  System is an equal opportunity employer. We promote recognition and respect for  individual and cultural differences, and we work to make our employees feel  valued and appreciated, whatever their race, gender, background, or sexual  orientation. EOE  Minorities/Women/Disabled/Veterans"}