{"jobID": "2801610949", "jobLocation": "Redwood_City_CA", "jobTitle": "Probation Intern", "companyRating": null, "companyInfo": {"Website": "www.smcoe.k12.ca.us", "Headquarters": "Redwood City, CA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Education", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Overall Job Objective  Job Title:Probation Intern  Closing Date/Time:Fri. 06/15/18 11:59 PM Pacific Time  Job Type:Intern/Fellow  Location:San Mateo County, California  San Mateo County Probation Department - Internships in Probation Program  Application Deadline: Friday June 15, 2018 at 12 noon  Interview Date: Interviews will be in the second week of July 2018.  Description  The San Mateo County Probation Department has a challenging opportunity for a college juniors and seniors who are interested in making an impact in their community while gaining valuable on-the-job training and experience in a criminal justice environment.  Positions are non-paid. Academic credit can be provided for students applying for an internship position for units at any college, university, certification program, work-study or cooperative education program.  Interns must work a minimum of three months with a minimum of six hours per week.  After three months, interns are given a mid-point evaluation. With adequate performance, at the three month mark interns may request to continue their internship during the next academic semester/quarter for a total intern duration of one academic year.  Positions may be available (not guaranteed available every semester) at the following locations: ADULT/ JUVENILE DIVISION - HOJ ADULT/JUVENILE DIVISION - SSF400 COUNTY CENTER, 5TH FLR 1024 MISSION ROADREDWOOD CITY, CA 94063 SOUTH SAN FRANCISCO, CA 94080ADMINISTRATION - YSC ADULT DIVISION - BRIDGES222 PAUL SCANNELL DRIVE 680 WARREN STREETSAN MATEO, CA 94402 REDWOOD CITY, CA 94063ADULT DIVISION - PRE-TRIAL JUVENILE DIVISION - YSC601 ALLERTON 222 PAUL SCANNELL DRIVEREDWOOD CITY, CA 94063 SAN MATEO, CA 94044INFORMATION TECHNOLOGY - YSC ADMINISTRATION - YSC222 PAUL SCANNELL DRIVE 222 PAUL SCANNELL DRIVESAN MATEO, CA 94402 SAN MATEO, CA 94402JUVENILE DIVISION - GIRLS PROGRAM ADULT/ JUVENILE DIVISION - EPA222 PAUL SCANNELL DRIVE 2415 UNIVERSITY AVENUESAN MATEO, CA 94044 EAST PALO ALTO, CA 94303Examples Of Duties: Probation Duties Including but not limited to:Generate legal and official documents for dissemination to criminal court, defendants, and cooperating agencies.Assist in interviewing and documenting assessments of defendants to determine appropriate supervision.Perform routine field work assistance with officers visiting treatment providers and home visits (must participate in mandatory training before participating).Perform research, data collection and administrative duties to support the probation officer in management of their caseload. Legal Office Intern Research and compile a variety of informational materials from sources both inside and outside the office to which assigned.Type drafts and a wide variety of finished documents from stenographic notes, minutes from meetings, brief instructions or printed materials; transcribe dictation from tapes; may use word processing equipment and input or retrieve data or prepare reports using an on-line or personal computer system.Organize and maintain various departmental files; purge files as requested.Follow up on projects, transmit information, and keep informed of unit activities.Prepare agendas and summarize meeting results as required.Organize own work, set priorities and meet critical deadlines.Maintain Office supplies.Perform related duties as assigned.Answer department phone calls and transfer phone calls when needed. Information Technology Intern Understand and use methods of systems and procedures to analyze data processing principles.Analyze, and develop systems and procedures for data processing applications.Create, update and manage department websites as assigned.Understand and apply departmental business needs and policies in the area of Information Systems and data processing methods.Use specific computer techniques in the area of graphic design.Use modern office methods, including record keeping, storage and retrieval.Communicate clearly and concisely orally and in written form.Establish and maintain effective and cooperative working relationships with others. Data Analyst Intern Ability to communicate effectively orally and in writing.Ability to develop and make effective presentations.Effective and creative problem solving skills.Ability to work independently.Ability to analyze and interpret data related to complex problems.Performs analytical procedures to test the validity of the cost components.Analyzes volumes and trends as compared to benchmarks, best practices and strategic goals.Assists in preparation and presentation of preliminary and final presentation materials.Maintains data and systems for budget tracking, reporting and generate reports.Qualifications: Minimum Requirements Must be at least 18 years of age.Must be a current college junior or senior.Must be able to verify U.S. citizenship or legal residence.Must not be on any formal, informal or DMV probation.Must not have a felony conviction.No pending criminal matters.Must not have any illegal or legal recreational substance use within the last two years.Must be able to pass a standard background and fingerprint investigation. Desired Knowledge, Skills and Abilities Knowledge of modern principles of organization and record keeping.Knowledge of basic Microsoft Windows programs and applications (i.e. Word, Excel, PowerPoint).English reading, writing and speaking skills equivalent to a high school graduate.Ability to establish and maintain effective working relations with others and work in a team-oriented environment.Ability to adhere to safety precautions and protocol, listen and obey direct orders from superiors, especially when in non-routine situations.Ability to adhere to Department policies and criminal laws regarding confidentiality and privacy of highly sensitive information.Ability to speak, read and write a second language (i.e. Spanish) desired, but not required.Application/Examination: How to Apply  To apply for an internship with the San Mateo Probation department, send the information listed below in one (1) attachment to ****************. In the subject line type: Full Name_ FallInternship2018. Applications that are not received by the deadline or are not in the requested format will not be considered. A brief statement (300 words maximum) regarding how your education or aspirations align with Probation work as you understand it. In your statement, include the probation internship opportunity that most interests you from the descriptions above i.e., Supervision/Reporting Intern, Legal Office Intern, Information Technology Intern, Data Analyst Intern).Two references with contact information.A current resume.An unofficial copy of your academic transcript. Selection Process: Applicants who matriculate in Criminal Justice, Sociology, Psychology and Public Administration will be given priority to internship opportunities. Finalists must complete and clear a background investigation prior to starting. Specific assignments will be made based on the best fit between the applicant's skills, interests and available schedule, and the specifics of each assignment.  Contact INTERNSHIPS IN PROBATION PROGRAMATTN: DR. BRIDGET LOVESAN MATEO COUNTY PROBATION DEPARTMENT 222 Paul Scannell Drive SAN MATEO, CA 94402************* Skills/Requirements  Job Reference #: *******  Job Status: Internship  Date Posted: 6/1/2018 Pay Rate: Recruiter and Available Location Information  455 County Center, Redwood City, CA 94063"}