{"jobID": "2829259027", "jobLocation": "Redmond_WA", "jobTitle": "Senior Data Scientist", "companyRating": "4.1", "companyInfo": {"Website": "www.microsoft.com", "Headquarters": "Redmond, WA", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (MSFT) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Amazon, Apple"}, "estimatedSalary": "155000", "jobDescription": " Join the Microsoft Identity division and use petabytes of data to drive data-driven strategic decisions that directly impact millions of users. The Identity division is at the center of Microsoft?s cloud strategy, providing authentication and authorization services that are used by over a billion Windows, Office, XBOX and Azure users worldwide. Identity services handle millions of requests per minute from our data centers worldwide, collecting high value telemetry data. You can turn this data into actionable insights and enable the business to reach into the new heights. The Identity Data, Experimentation, and Analysis (IDEA) team is growing and looking for motivated, fun team members.  We are looking for an expert in the field of data science experienced in leveraging big data from varying sources to drive business success. Current projects in the team range from anomaly detection algorithms, clustering, predictive modeling, and word embeddings with NLP. As a senior data scientist, you will provide technical leadership and mentoring within our growing data science team. Leveraging your creativity and expertise you will discover new problems and create opportunities for yourself and the team.  Your data driven insights guide one of Microsoft?s fastest growing businesses, while at the same time help our customers become more secure and productive in the cloud. *Responsibilities**Responsibilities + Understand complex business problems and break them down into actionable investigations and experiments  + Formulate and apply effective algorithms and statistical modeling  + Interpret results of data experiments and derive meaningful actions to grow the business and increase adoption  + Work with data engineers to operationalize multipurpose and reusable data models  + Engage in the peer review process and act on feedback to continually improve our craft *Qualifications**Qualifications + Degree in Statistics/Math/Computer Science/Economics/Business or Engineering  + At least 5 years hands on data science or analytics experience with proven quantitative orientation  + Proven ability to implement statistical models (forecasting, clustering, regression models)  + Proficiency in data oriented programming or scripting languages (SQL, Python, Perl, JavaScript)  + Skilled in analytic and reporting tools (R, Excel, Power BI, SSRS)  + Exceptional problem solving, technical and data analysis skills  + Solid verbal and written communication  Preferred Qualifications  + Advanced algorithms (Machine Learning, AI, Natural Language Processing, Anomaly Detection)  + Proficiency with one or more of the following Big Data technology stacks: Azure Data Lake, Hadoop, Cosmos, Spark, Hive, etc.  + Experience with modern data warehouse systems: Azure SQL DW, Redshift, Snowflake  + Knowledge of Active Directory, authentication and cloud security is a big plus  Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.  Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form at https://careers.microsoft.com/us/en/accommodationrequest .  Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work."}