{"jobID": "2755917262", "jobLocation": "New_York_NY", "jobTitle": "Agency Lead", "companyRating": null, "companyInfo": {"Website": "www.centro.net", "Headquarters": "Chicago, IL", "Size": "501 to 1000 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Mediaocean, The Trade Desk, MediaMath"}, "estimatedSalary": null, "jobDescription": "We’re here to ensure the advertising industry and the people in it are healthy and engaging positively and effectively with those around them. We’re here, ultimately, to improve the lives of people working in the media industry. And we take our responsibility seriously.ABOUT THE ROLECentro’s Agency Lead will develop relationships with new and existing agency partners to fulfill their digital media needs and maximize their potential on our platforms. The ideal candidate will have strong sales skills with a proven track record of exceeding revenue targets through active selling, account management, product implementation, and managing client terms and expectations. Additionally, successful candidates will showcase thought-leadership and intellectual curiosity to seek out innovative tactics to solve business challenges. Knowledge of digital media solutions and the ability to communicate from junior to top level executives is a must.CORE RESPONSIBILITIESDevelop a strong understanding of Centro’s technology and media solutions, and take a tech first approach in helping agency partners grow their businessGrow platform spend to meet and exceed individual and regional sales goalsIdentify additional revenue opportunities with existing clients while continuously prospecting new businessWork collaboratively with cross functional teams, including Centro’s Media Services, Marketing, and Product teams, to drive revenue growth with new and existing clientsProvide ongoing client management to agency partners including quarterly business reviews, proactive media packaging of publisher opportunities, and client entertainmentQUALIFICATIONS3+ years in sales or business development in the digital industry; experience at ad agencies, publishers, ad networks/sales houses, SSPs, DSPs, and ad exchanges preferredEstablished relationships with agencies and companies with automated buying platformsExperience selling online advertising; knowledge of programmatic buying and selling including: pricing models, optimization tactics, audience trends, and buying technologies is preferredExcellent communication, negotiation, and presentation skillsStrong quantitative aptitude including proficiency in excel and the ability to communicate complex technical concepts in simple termsDriven and goal-oriented with the ability to contribute to a highly collaborative team environmentCentro is an Equal Opportunity Employer and does not discriminate against any employee or applicant on the basis of race, gender, age, disability or any other basis protected under the law.Centro is an Equal Opportunity Employer and does not discriminate against any employee or applicant on the basis of race, gender, age, disability or any other basis protected under the law. "}