{"jobID": "2750403728", "jobLocation": "Oakland_CA", "jobTitle": "Senior Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.kaiserpermanente.org", "Headquarters": "Oakland, CA", "Size": "10000+ employees", "Founded": " 1945", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " HCA Healthcare, Dignity Health, Sutter Health"}, "estimatedSalary": "85000", "jobDescription": " The Data Analytic Consultant provides support in making strategic data-related decisions by analyzing, manipulating, tracking, internally managing and reporting data. These positions function both as a consultant and as a high-level data analyst. The position works with clients to develop the right set of questions/hypotheses, using the appropriate tools/skills to derive the best information to address customer needs. Essential Functions: Provides direction for assigned components of project work.  Coordinates, team/project activities & schedules.  With some feedback and mentoring, able to develop proposals for clients, project, structure, approach, & work plan.  Given scope of work, minimal feedback/rework is necessary.  Evaluates effectiveness of actions/programs implemented.  Researches key business issues, directs the collecting and analyzing of quantitative and qualitative data.  Proactively records workflows, deliverables, and standing operating procedures for projects.  Developing specified QA procedures to ensure accuracy of project data, results and written reports & presentation materials. Basic Qualifications: Experience  Minimum two (2) years of work experience. Education Bachelor's degree in related field, OR four (4) additional years of experience in a directly related field.  High School Diploma or General Education Development (GED) required.  License, Certification, Registration  N/A Additional Requirements: Working knowledge of policies, practices and systems.  Frequent use and general knowledge of industry practices, techniques, and standards.  General application of concepts and principles.  Full use and application of standard principles, theories, concepts, and techniques.  Must be able to work in a Labor/Management Partnership environment. Preferred Qualifications: Master's degree.  Knowledge of health care industry preferred.  Familiarity with Kaiser Permanente health care system preferred. "}