{"jobID": "2493074682", "jobLocation": "New_York_NY", "jobTitle": "Technical Account Manager", "companyRating": "4.5", "companyInfo": {"Website": "www.actifio.com", "Headquarters": "Waltham, MA", "Size": "201 to 500 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "107000", "jobDescription": " You will be the primary technical go-to-person for Actifio’s customers in the post-sales stage of the customer’s lifecycle. Your core mission is to help our customers maximize the value of their Actifio investment. You will work closely with customers to ensure that system is configured optimally and is being used within deployment guidelines at all times. During customer service events, you will serve as the primary contact between the Customer and Actifio’s services, support and engineering teams to ensure speedy resolution of technical issues. You will work with the account team to identify new growth and sales opportunities based on technical observations.Responsibilities/Key Tasks Conduct monthly technical health checks of the customer’s Actifio environmentMonitor and review incoming support casesWork with the customer’s technical team to ensure that the system is being maintained and managed well according to Actifio’s best practicesEnsure that Customer is running the most latest stable version within 3-6 months of releaseEngage with a new Customer during the deployment phase to ensure that you have a good understanding of the environment and the Actifio implementationIdentify knowledge gaps in the Customer’s technical staff and leverage training and development resources to help close these gapsIdentify new use cases and other growth opportunities and work with the account team to define new opportunitiesIn this role you may also be called upon to assist in pre-sales activity as required, including sales presentation, product demonstration, configuration creation and management as well as the creation of proposal and RFP response documentation.”Provide regular customer health reports to sales and executive management Requirements/Qualifications Bachelor’s or Master’s degree in Computer Science/Engineering6+ years of experience in a technical account management or similar role at a storage companyHands-on experience with Storage Area Networks and Linux/Unix operating systemsSolid understanding of backup, replication & DR conceptsStrong knowledge of VMWare and databasesLeadership qualities to drive customer solutions and handle customer issues/escalations independentlyStrong troubleshooting skillsExcellent verbal, written, and interpersonal skillsStrong organizational, analytical and planning skillsProven project management skills About Actifio, Inc.Actifio is the world’s leading Enterprise Data-as-a-Service (EDaaS) platform. It enables thousands of companies around the world deliver their data just as they deliver their applications and infrastructure… as a service available instantly, anywhere. An enterprise-class software platform powered by patented Virtual Data Pipeline™ technology, Actifio frees data from traditional infrastructure to accelerate adoption of hybrid cloud, build higher quality applications faster, and improve business resiliency and availability. For more, v"}