{"jobID": "2826716956", "jobLocation": "Milpitas_CA", "jobTitle": "Staff Software Quality Engineer", "companyRating": "4.0", "companyInfo": {"Website": "www.jnj.com", "Headquarters": "New Brunswick, NJ", "Size": "10000+ employees", "Founded": " 1887", "Type": " Company - Public (JNJ) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Abbott Labs, Novartis, Covidien"}, "estimatedSalary": "115000", "jobDescription": " Johnson & Johnson Vision Care, a member of Johnson &  Johnson's Family of Companies, is recruiting for a Staff  Software Quality Engineer- NPD/Capital Equipment to be located in  Milpitas, CA.  Johnson & Johnson Vision (JJV), is a worldwide company  with operations in the United States, Japan, Latin America, Asia-Pacific and  Europe/Middle East/Africa regions. Research, innovation and new-product  development are the focus of our organization. Since we introduced soft  disposable contact lenses in 1988, and through the acquisition of Abbott  Medical Optics in 2017, no other manufacturer has matched the aggressive  expansion of our wide-ranging Surgical Vision (Cataracts and Lasik portfolio)  and Vision Care (ACUVUE and Consumer Eye Health solutions) family of products.  Our associates around the world are committed to expanding the J&J; Vision  brands brand, and fortifying our position as the worldwide leader in total eye  healthcare solutions.  Caring for the world, one person at a time has inspired and  united the people of Johnson & Johnson for over 125 years. We embrace  research and science -- bringing innovative ideas, products and services to  advance the health and well-being of people. Employees of the Johnson & Johnson  Family of Companies work with partners in health care to touch the lives of  over a billion people every day, throughout the world.  You, the Staff Software Quality Engineer-  NPD/Capital Equipment provides quality and technical leadership to  ensure new medical devices (Capital Equipment) meet their intended use.  You, the Staff Software Quality Engineer- NPD/Capital Equipment provides: Quality leadership on new product project teams to  ensure that medical devices and stand-alone software systems are being designed  and validated to meet their intended use.Subject matter expertise in requirements  gathering, facilitating software risk assessments, defining test strategies,  and guiding project teams on design controls and defect analysis. You, the Staff Software Quality Engineer- NPD/Capital Equipment will: Partner with R&D; to define the white-box  testing and black-box testing strategy.Ensure effective risk management by working with  R&D; to define risk control measures.Lead/manage/conduct SW relevant product validation  activities on projects.Develop testing strategies based on requirements  and designs.Create/review and/or approves product/  equipment/ software validation documentation.Conduct and drive CAPA root cause  investigations.Refine the Design Controls and other supporting  processes.Review test case execution results and manage  defects.Perform other related duties as assigned by  management.Support the development of more junior staff and  advise management on technical matters.Proactively examine processes to identify areas  for review, change, or elimination.QualificationsA Bachelors Degree in Computer Sciences, Software  Engineering or other related disciplines is required.A Masters degree is preferred.A minimum 6 years of work experience supporting  the testing of systems that are controlled by software.Experience working in the Medical Device  industry is required.Excellent understanding of requirements  management, configuration management, Product Software V&V;, defect  management and software risk analysis is required.The ability to document system requirements, and  understand system architecture and software designs is required.Experience designing test strategies based on  software architecture, requirements and design is required.Programming background is preferred.Knowledge of ISO 14971, 21 CFR 820, and 21 CFR  210 and 211 is required.Excellent communication, interpersonal and  leadership skills is required.This  position will be located in Milpitas, CA and may require up to 10% domestic  and/or international travel. Johnson & Johnson Family of Companies are  equal opportunity employers, and all qualified applicants will receive  consideration for employment without regard to race, color, religion, sex,  sexual orientation, gender identity, genetic information, national origin,  protected veteran status, disability status, or any other characteristic  protected by law.Primary Location United States-California-Milpitas Organization AMO Manufacturing USA, LLC (6240) Job Function Quality (Eng) Requisition ID6249180316"}