{"jobID": "2827708129", "jobLocation": "New_York_NY", "jobTitle": "Intern, Master Data Creation&Maintenance-; IT- Part-Time", "companyRating": null, "companyInfo": {"Website": "www.automatic.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Metromile"}, "estimatedSalary": null, "jobDescription": " Temporary  Position Type: Internship  Session: Fall 2018 (September 17 - December 7, 2018)  Location: New York, NY Position Summary: SiriusXM interns don't just make coffee, they're on-air, on projects and making valuable contributions to SiriusXM. Join our internship program and learn about the radio world and get hands-on experience in your field of study.  SiriusXM is looking for a data-wiz to help analyze data and support the team's daily functions. Duties and Responsibilities:Take part in master data creation and maintenance in support of business processes.Support projects to analyze, cleanse, enrich and monitor master data elements.Perform analytic activities to ensure data completeness and accuracy.Ensure best practices.Participate in root cause analysis, including problem definition, investigation and developing correction and prevention processes.Assist in analyzing conceptual, logical and physical data models and document business concepts, data entities, data elements and the relationship between them.Review master data against the presently used data in various business processes to identify the gaps, discrepancies and the opportunities to further improve quality of master dataParticipate in documenting systems and processes interactions within a functional scope.Perform various data quality functions for data from multiple systems such as: Profile, cleanse, validate and audit.Take part in master data quality improvement activities through analysis and remediation of data quality issues.Supervisory Responsibilities:None.Minimum Qualifications:You must be 18 years of age or older.Must be enrolled in a U.S. based college, university or trade school to qualify. Students who have completed at least two years of college are preferred.Pursuing Bachelor's degree in Computer Science, Information Technology, MIS, CIS or related technical discipline with an IT focus.Requirements and General Skills:Ability to work both independently and on a team.Communicate clearly and concisely both orally and in writing.Ability to work independently multi-tasking in a deadline-driven environment.Exhibits strong interpersonal, organizational, time management, multi-tasking, and analytical/problem solving skills.Takes initiative to accomplish business objectives, seek new assignments, and request to learn more about the business.Must have legal right to work in the U.S.Technical Skills:Thorough knowledge of MS-Office Suite (Word, Excel, PowerPoint, Access).Basic working knowledge of SQL and familiarity with DBMS concepts (Oracle) required.Working knowledge of SAS and Informatica ETL a plus. Please note that all SiriusXM internships are paid.  As an EEO/Affirmative Action Employer all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status.  The requirements and duties described above may be modified or waived by the Company in its sole discretion without notice."}