{"jobID": "2524274515", "jobLocation": "San_Jose_CA", "jobTitle": "Data Analyst, Entry Level (Graduate Degree)", "companyRating": "3.6", "companyInfo": {"Website": "www.paypal.com", "Headquarters": "San Jose, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (PYPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Square, Amazon, Apple"}, "estimatedSalary": "87000", "jobDescription": " Job Description Summary:At PayPal, we’re literally reinventing how the world pays and gets paid. We understand that it’s about our customers. We connect individuals to let them shop, get paid, donate and send money using today’s technology with the confidence that comes from the security and control PayPal enables. Are you ready to help us change the world?  The world’s leading payments company, PayPal brings together a family of brands that are revolutionizing the way people move money. At PayPal you will be immersed in an amazing community with a vibrant culture that thrives on innovation, collaboration, inclusion and wellness.Job Description:  The position will part of a global analytics organization with many options for future career growth at PayPal. We're looking for analysts that go above and beyond simply providing reports and analyses to consulting on product design and customer experience. This person will generate insights by conducting extensive analyses of PayPal’s rich data. In the process, this person will develop a deep understanding of the payments businesses, our site functionality, further strengthen their analytic, leadership, and presentation skills, and gain exposure to a wide variety of functional teams within PayPal.  Qualified candidates will graduate with their Master's degree between December 2017 and August 2018.  Basic Requirements: Master's degree in Computer Science, Math, Statistics, or related field from an accredited college or university4+ years Java experienceExpertise required in object-oriented design methodology and application development in Java.Excellent understanding of computer science fundamentals, data structures, and algorithms.Excellent problem solving skills.Solid data mining and machine learning expertise required, DB/data warehouse expertise desired.Familiarity with search/recommendation/classification applications and domains preferred.Information Retrieval (search/recommendation/classification) experience or Human Judgment/User Interface experience.Position Location: Varies Subsidiary:  Travel Percent:0Primary Location:San JoseAdditional Locations:Austin, Boston, New York, Scottsdale, Timonium"}