{"jobID": "2778939521", "jobLocation": "Fremont_CA", "jobTitle": "Global Practice Recruiter", "companyRating": "4.0", "companyInfo": {"Website": "www.jnj.com", "Headquarters": "New Brunswick, NJ", "Size": "10000+ employees", "Founded": " 1887", "Type": " Company - Public (JNJ) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Abbott Labs, Novartis, Covidien"}, "estimatedSalary": "90000", "jobDescription": "Johnson & Johnson is currently recruiting for a Global Practice Recruiter Health Technology within the Johnson & Johnson Talent Acquisition to be located in Cincinnati, OH or Fremont, CA, or New Brunswick, NJ.Caring for the world, one person at a time has inspired and united the people of Johnson & Johnson for over 125 years. We embrace research and science -- bringing innovative ideas, products and services to advance the health and well-being of people.With $71.9 billion in 2016 sales, Johnson & Johnson is the world's most comprehensive and broadly-based manufacturer of health care products, as well as a provider of related services, for the consumer, pharmaceutical, and medical devices markets. There are more than 265 Johnson & Johnson operating companies employing approximately 126,500 people and with products touching the lives of over a billion people every day, throughout the world. If you have the talent and desire to touch the world, Johnson & Johnson has the career opportunities to help make it happen.Thriving on a diverse company culture, celebrating the uniqueness of our employees and committed to inclusion. Proud to be an equal opportunity employer.The Global Practice Recruiter will be responsible the delivery, execution, and assessment of our newly imagined, Talent Acquisition Practice Model that will provide J&J; with a daring recruiting advantage. You will be a Talent Advisor as you utilize industry & business acumen to translate the enterprise and business strategy while crafting the talent priorities for a particular Practice. You will bring deep expertise and market knowledge while staying on top of trends, market changes, and talent competitors, while delivering optimal candidate experience through the engagement and connection of critical and scarce talent pools.ResponsibilitiesServe as a strategic talent advisor by actively establishing a collaborative relationship with hiring managers and business leaders by providing recommendations and talent insights using deep technical acumen, Health Technology market knowledge (Data Science, Big Data, Machine Learning, AI ect), and a strong network.Develop a keen understanding of J&J;'s long and short-term strategies, with special focus on its different growth drivers and innovation pipeline.Represent the company as a trusted professional in the Health Technology market among the practice community by showing technical expertise, attending events and remaining largely connected.Drive a best-in-class candidate experience by acting as a career coach who cultivates long term relationships and builds a sustainable candidate pipeline.Promote a culture of agile thinking through a fast, adaptive, and iterative recruiting approach.Work on the complete end to end recruitment process internal clients. Advocate for the Global D&I; Strategy and constantly look for self and process improvement opportunities.Use business data, technology, and other operational metrics to \"sell\" qualified diverse candidates to hiring managers and \"sell\" the company to passive and active talent. Understand internal talent availability and merge with external trends to influence talent strategies.Collaborate in the development of the Talent Sourcing plan utilizing Global Talent Management strategies in partnership with Talent Intelligence.Demonstrate ability to effectively profile Health Technology requisitions by learning details of organization, team dynamics and abilities required for the positions.Actively use both internal and external digital platforms to develop & execute sourcing strategies, build sustainable candidate pipelines, and develop relevant relationships.QualificationsHas a minimum required Bachelors degree; Preferably in Sciences.Has a minimum of 6 years of direct, relevant and recent business experience in a specialized Practice field is required.Has preferred background in corporate environment or in recruiting executives in either a retained search firm, agency or corporation.Preferred background in strong understanding of the Health Technology space, including Data Science, Big Data, Machine Learning, AI.Has a required global talent perspective and experience working in a highly matrixed environment.Has knowledge of disruptive technologies that impact healthcare industry and their implications in the business and talent landscape is required.Has validated ability to recruit diverse individuals and ability to negotiate and advise on complex compensation packages is required.Has excellent communication (both written and verbal), influencing and negotiation skills are required, as is strong project management, analytical and critical thinking skills with thorough attention to detail.Preferably has excellent assessment and interviewing skills and strong command of assessment and selection methodologies, instruments and processes is preferred.Has preferably knowledge of HR recruitment practices including compensation, global mobility, employment law, interviewing and sourcing strategies preferred.Preferably has proficiency in the use of social media use (i.e., LinkedIn/job boards etc.) and software like MS Word, Outlook and Excel is required; experience with Taleo or a similar applicant tracking system and with a talent relationship management system is preferred.Preferably has experience utilizing metrics regularly to assess and maintain performance is preferredHas to be willing to travel, as neededDo you strive to join an outstanding team that is dynamic and ever-changing? Is career growth and opportunity appealing to you? Apply to this opportunity today.Johnson&JohnsonFamilyofCompaniesareequalopportunityemployers,andallqualifiedapplicantswillreceiveconsiderationforemploymentwithoutregardtorace,color,religion,sex,sexualorientation,genderidentity,geneticinformation,nationalorigin,protectedveteranstatus,disabilitystatus,oranyothercharacteristicprotectedbylaw.Primary Location United States-Ohio-Cincinnati Other Locations North America-United States-New Jersey-New Brunswick, North America-United States-California-Fremont Organization Johnson & Johnson (6067) Job Function Employment Requisition ID0733180507"}