{"jobID": "2740952851", "jobLocation": "New_York_NY", "jobTitle": "Information Security Intern", "companyRating": null, "companyInfo": {"Website": "www.otcmarkets.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 1997", "Type": " Company - Public (OTCM) ", "Industry": " Finance", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OTC Markets Group's IT Infrastructure team is now hiring an Information Security Intern. This paid summer internship is a great opportunity to learn the ins and outs of a corporate workflow. The candidate will be exposed to several aspects of financial technology, and perform tasks focusing on: Work on improving the infosec posture of a SEC/FINRA regulated financial institutionInvestigate strategies for ensuring data confidentiality and integrity as it relates to compliance and data loss prevention.Outline anything that is missing in the companys infosec resiliency and come up with suggestionsGain experience working in a corporate IT department that supports OTC trading and internal usersLearn how Infosec works in a business environmentLearn what it takes to protect an organization from security related intrusions.Gain experience with Information Security compliance requirements as they relate to Alternative Trading Systems (ATS) and RegSCI. Requirements: Computer Literacy, interest in Information Security, knowledge of operating systems (Linux, Windows, etc.), knowledge of how to penetrate/defend systems, networks.College student majoring in Computer Science, Information Systems or Information Security. OTC Markets Group Inc. (OTCQX: OTCM) operates the OTCQX® Best Market, the OTCQB® Venture Market, and the Pink® Open Market for 10,000 U.S. and global securities. Through OTC Link® ATS, we connect a diverse network of broker-dealers that provide liquidity and execution services. We enable investors to easily trade through the broker of their choice and empower companies to improve the quality of information available for investors.  To learn more about how we create better informed and more efficient markets, visit www.otcmarkets.com.  OTC Link ATS is operated by OTC Link LLC, member FINRA/SIPC and SEC regulated ATS.  OTC Markets Inc. offers a casual working environment in an airy loft office space in SoHo part of Manhattan, one of the most exciting and creative places in the world. We are committed to building a company where highly talented, creative people thrive. Therefore, we invest heavily in employee satisfaction and we offer a competitive compensation package designed to entice the best.  Please note that we will neither sponsor nor relocate individual for this position. No calls or e-mails please. No third party recruiters.  OTC Markets Group is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, creed, color, religion, gender, national origin, age, marital status, political belief, physical or mental disability, sexual orientation, military or veteran status, genetic information, gender identity, pregnancy, including childbirth or related medical condition, or any other characteristic protected by federal, state, or local law."}