{"jobID": "2776406108", "jobLocation": "West_Hollywood_CA", "jobTitle": "INTERN - CITY COUNCIL OFFICES / CITY MANAGER'S DEPT", "companyRating": null, "companyInfo": {"Website": "www.weho.org", "Headquarters": "West Hollywood, CA", "Size": "201 to 500 employees", "Founded": " 1984", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " JOB SUMMARY  This is an excellent opportunity to gain valuable experience working in a politically active environment. You will be responsible for assisting the various Council Offices and City Manager's Department with research and development of policy, projects and/or programs. The ideal candidate is a self-starter who is able to work independently and is comfortable seeking guidance/direction when necessary.  Click here for job flyer: https://www.weho.org/Home/ShowDocument?id=36365 *If you have problems creating a user account or submitting your online application, please contact NEOGOV applicant support directly at 855.524.5627   (Please note: Applicant Support Hours are Monday through Friday, 8am - 5pm Pacific Time and, depending on call volume, may be an automated voicemail system or live support).  EXAMPLES OF DUTIESResponsibilities may include: Preparing written documents such as staff reports, letters and resolutions. Researching policy issues and analyze data for studies and other functions. Assisting with meeting preparation and staffing for Commission and City Council meetings. Assisting with the coordination of City special events and programs. Providing administrative support to staff and may provide relief for reception desk. Work cooperatively with City employees and the public. Assist in collecting and analyzing data for performance measures, financial forecasts and other department functions and/or projects. MINIMUM QUALIFICATIONS REQUIREDApplicants must currently be pursuing a degree in Public Administration, Public Policy, Political Science, Government, Law, Urban Planning or a closely-related field. Graduate student is preferred.  Eligibility to remain in the program is contingent upon school enrollment.Must be able to work up to 20 hours per week. Must be able to work a flexible schedule including occasional evenings and weekends.  KNOWLEDGE, SKILLS, AND ABILITIES In order to achieve the maximum benefits of the internship program, we prefer students who are interested in at least a year commitment. Must demonstrate excellent writing and communication skills, and have the ability to think creatively, work independently, and handle multiple projects. Possess research and analytical skills."}