{"jobID": "2805337897", "jobLocation": "Seattle_WA", "jobTitle": "Data Scientist, Analytics - NLP Search", "companyRating": "4.5", "companyInfo": {"Website": "www.facebook.com", "Headquarters": "Menlo Park, CA", "Size": "10000+ employees", "Founded": " 2004", "Type": " Company - Public (FB) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Google, Snap, Uber"}, "estimatedSalary": "139000", "jobDescription": " Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities we're just getting started.People issue over 2 billion searches on Facebook every day to find people, pages, videos, and connect with the communities and interests that matter to them. Facebook Search team is working to build a global, general-purpose search engine that leverages the unique content and social connections on Facebook. By unlocking the unique information and connections available on Facebook, we believe we can provide a more meaningful experience for people around the world, especially in mobile-first countries. To achieve our goal, we need to solve some of the most challenging engineering problems in the industry, across areas such as Infrastructure, Product, Mobile, Machine Learning and Natural Language Processing (NLP).  Being a complex engineering system, Facebook Search depends on several machine learning models and heavy natural language processing. Understanding the user's search intent from their search query is crucial to retrieving and matching the right content from Facebook's vast amount of social data. NLP team focuses on developing various machine learning technologies to process and transform a search query into a form that is utilized by the subsequent systems for retrieval and ranking. Context of the search query and its implicit and explicit semantics play an important role in satisfying the searcher's information need. Similar technologies are utilized to decipher the meaning and intent of the content in Facebook to create the matching between user intent and content.  A Data Scientist in this role will leverage his knowledge and understanding of these technologies along with the vast and powerful search dataset in order to: (1) provide tactical engineering systems development guidance by bridging lower level NLP system components' performance to higher level product performance (2) perform various forms of opportunity analyses to influence NLP systems development roadmap and (3) collaborate with software engineers to help develop better ways of understanding search queries and content on Facebook. This is a key role within the greater search team and it requires heavy involvement with technical aspects of the core search technology. Join us, if you like getting involved in the details, think big and want to take Facebook Search to the next level! Responsibilities:"}