{"jobID": "2767295073", "jobLocation": "Redmond_WA", "jobTitle": "Cybercrime Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.microsoft.com", "Headquarters": "Redmond, WA", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (MSFT) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Amazon, Apple"}, "estimatedSalary": "95000", "jobDescription": " Do you have a passion for snooping through big data in innovative ways to not only root out online fraud, but also catch the cybercriminal behind the computer? Do you fancy yourself as a CSI Investigator who loves nothing more than to search for the missing pieces that will solve the mystery? If so, we may have the right job for you.  Microsoft is seeking to hire an experienced cybercrime data analyst/investigator to join its Fraud Investigations Team. This team finds and drives closure of vulnerabilities that fraudsters exploit across all Microsoft’s ecommerce businesses and also identifies and disrupts groups and individuals who defraud Microsoft and its customers. We need a self-starter with drive and tenacity who will find unique and creative ways to disrupt fraud. You’ll work with one of the most forward-thinking teams in the industry to find and disrupt fraudsters around the world. You’ll support the fraud prevention team with data and intelligence to enable anti-fraud systems to perform at their peak effectiveness. You’ll also work with Microsoft attorneys, law enforcement, private investigators, and industry peers to take disruptive actions against cybercriminals and prevent future fraud.  This is not a role for dashboard-generating automatons or flighty data academics. The cybercrime data analyst will square off against sophisticated and persistent fraudsters, mindbogglingly massive data sets, and a fast-paced and dynamic environment where the path to results is often ambiguous and always challenging. For the tenacious, inventive, and hard-working data sleuth; dueling in this arena can be loads of fun.  Come join our team and help make Microsoft the safest place for people and companies all over the globe to buy and sell online!Responsibilities"}