{"jobID": "2775756871", "jobLocation": "Sunnyvale_CA", "jobTitle": "Platform QA Intern", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Join the leader in entertainment innovation and help us design the future. At Dolby, science meets art, and high tech means more than computer code. As a member of the Dolby team, you'll see and hear the results of your work everywhere, from movie theaters to smartphones. We continue to revolutionize how people create, deliver, and enjoy entertainment worldwide. To do that, we need the absolute best talent. We're big enough to give you all the resources you need, and small enough so you can make a real difference and earn recognition for your work. We offer a collegial culture, challenging projects, and excellent compensation and benefits.  Dolby Labs is looking for talented individuals to help develop the next generation of motion picture experiences what we call Dolby Vision. The Platform Development Team is centered in Sunnyvale, California, and is responsible for delivering industry-leading algorithms and packages for video compression and color management. Of particular interest is enabling the creation and distribution of motion picture content containing wider color gamut and higher luminance levels far beyond anything that is available today. Above all, we strive to deliver a unique \"In Dolby\" experience that is immediately obvious to all viewers. Our interns will be conducting a series of testing-related tasks involving research, development and customer support. ResponsibilitiesValidate the functionalities of the Dolby Vision Encoder SIDK software components that are used in the workflow for the Dolby Vision content encodingImplement and execute the objective test cases for the Dolby Vision Encoder SIDK test planImplement test automation for the objective test cases using scripting languageUse Jira to report and track issues discovered during test plan executionWork with developers to help duplicate, isolate, track, and resolve issuesProvide analytical report based on test/verification resultsDocument your own work to transfer knowledge to team membersQualificationsPursuing a BS or MS degree in Computer Science and/or Electrical Engineering or related fieldA concentration in image processing with fundamental digital video processing knowledge is desired but not requiredProficient in using scripting languages such as Python, csh shell script, bash shell script, etc for testing/analysis-related tasksExperience in analyzing test results and generating statistical reports is desiredAbility to deal with fast-paced, frequent-changing tasksMust be self-motivated and able to work independentlyEqual Employment Opportunity: Dolby is proud to be an equal opportunity employer. Our success depends on the combined skills and talents of all our employees. We are committed to making employment decisions without regard to race, religious creed, color, age, sex, sexual orientation, gender identity, national origin, religion, marital status, family status, medical condition, disability, military service, pregnancy, childbirth and related medical conditions or any other classification protected by federal, state, and local laws and ordinances.  #LI-AS1SDL2017"}