{"jobID": "2668290126", "jobLocation": "New_York_NY", "jobTitle": "Senior Dev Ops Engineer", "companyRating": "4.9", "companyInfo": {"Website": "www.cloudtp.com", "Headquarters": "Boston, MA", "Size": "201 to 500 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Accenture, Slalom, Cloudreach"}, "estimatedSalary": "134000", "jobDescription": "Help us solve the world’s most challenging cloud computing problems and build a great company along the way! Cloud Technology Partners™ (www.cloudtp.com) is growing! We are expanding our team and actively recruiting for our growing enterprise consulting practice. Here are a few reasons why to consider CTP for your next career move: You want to be on the leading edge of a monumental change in ITYou enjoy venturing into new territory and think of yourself as a “builder”You appreciate the balance of a dynamic and entrepreneurial culture led by an experienced management teamYou want to contribute to the success of a growing companyYou are committed to the success of clients and your colleaguesAbout the Senior Dev Ops Engineer Although we are headquartered in Boston, our clients are located across the US. We are flexible on location – you may work remotely from any US location, as long as you are able to travel to client locations at least 50%.  As a Senior Dev Ops Engineer, you will: Help transform traditional IT to modern DevOps processes.Use cutting edge technology to create innovative solutions.Implement automation for deployments, IasC, CI/CD, security, and cloud operations.Travel and work onsite at client locations (typically 50%).Education and Experience RequiredBachelor's degree in Computer Science, Engineering, Technical Science, or equivalent experience3+ years’ experience with coding or scripting languages – with at least two of the following: Ruby/JRubyPerl, PythonPowerShellJavaGoC#JavaScriptBashExperience in executing Agile, Lean, and Continuous Delivery best practices.Strong technical foundation in a number of the following tools and technologies: Windows and/or Linux (Ubuntu/Debian and/or RedHat/Centos/Fedora)Desktop Virtualization, Development tools (VMware, Hyper-V or VirtualBox)5+ years Cloud computing experience: AWS, Google – GCP/GAE/GCE, Rackspace Cloud, Azure3+ years’ experience in infrastructure automation ChefPuppetSaltAnsibleCloud FormationTerraformVagrantPackerARMHeatBuild tools: Maven, Gradle, Ant, NAnt, MSBuild, Rake, GNU MakeContinuous integration tools: TeamCity, Jenkins, Cruise Control, Bamboo, AWS CodePipelines, TravisCIGit SCM toolsApplication servers, servlet containers, and web servers: WebSphere, Tomcat, Jetty, Nginx, Mongrel, Microsoft IIS, Apache HTTP serverLogging – Splunk, SumoLogic, Graylog, Kibana, Logstash, AWS CloudWatch LogsMonitoring – AWS CloudWatch, Nagios, New Relic, Alert Logic, App Dynamics, BoundaryProven ability to thrive and succeed in a dynamic, fast growing, startup environmentMust have the ability to travel and work onsite at client locations (typically 50%)Added BonusSense of humorMeet CTPhttps://cloudtp-1.wistia.com/medias/5hamchrxyywww.twitter.com/cloudtpPerks and BenefitsCompetitive compensation (mix of fixed base and aggressive incentive plan) and equityComprehensive benefit plan offerings to keep you healthy401(k) plan so you can plan for the futureGenerous paid time off plans so you will have a healthy work life balanceFitness Club reimbursement to keep you movingWork remote opportunities to keep your commute nice and easyCareer growth opportunities to keep your career moving in the right directionTraining and certifications to keep you an expert in your fieldAbout Cloud Technology Partners Join an Amazing Team!  Cloud Technology Partners (CTP), a Hewlett Packard Enterprise company, is the premier cloud services and software company for enterprises moving to AWS, Google, Microsoft and other leading cloud platforms.  We’re not learning a new way of doing things – we’re defining the best way to do them. Our architects and engineers have been designing, building and implementing IT solutions for enterprise customers across industries for an average of more than 20 years. We focus solely on cloud-based technologies and are the preferred partner for companies seeking to rapidly achieve mission critical business goals through cloud transformation.  We know enterprise cloud. You can too. Come join us!  If you are passionate about teamwork, innovation and working with a group of top talent like yourself, then apply today! About Hewlett Packard Enterprise Tomorrow belongs to the fast, and Hewlett Packard Enterprise is in the acceleration business!  To help companies accelerate, we’ve created a new company, one that defines transformation—and defies “business as usual”. In the fast-paced, quick-release environment of the future, you need to be constantly ready for change, be resourceful, and be highly adaptable to the ever-changing business landscape.  HPE is an industry leading technology company that enables customers to go further, faster. With the industry’s most comprehensive portfolio, spanning the cloud to the data center to workplace applications, our technology and services help customers around the world make IT more efficient, more productive and more secure.  Hewlett Packard Enterprise is not only the company best equipped to build a bridge from where enterprise IT is today, to where it needs to be, but HPE is also an incredible place to build a career. As the only company that brings it all—software, hardware, services, and talented people with the right mindset—we help organizations innovate, stay competitive, and quickly turn ideas into value.  Please note the above statements describe the general nature and level of work only. They are not a complete list of all required responsibilities, duties and skills. Other duties may be added, or this description amended at any time.  Hewlett Packard Enterprise is EEO F/M/Protected Veteran/ Individual with Disabilities. HPE will comply with all applicable laws related to the use of arrest and conviction records, including the San Francisco Fair Chance Ordinance and similar laws and will consider for employment qualified applicants with criminal histories."}