{"jobID": "2737164134", "jobLocation": "New_York_NY", "jobTitle": "Vice President, Clinical Operations-Long Term Managed Care", "companyRating": null, "companyInfo": {"Website": "www.vnsny.org", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1893", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Overview Created in 1998, VNSNY CHOICE is the managed care affiliate of the Visiting Nurse Service of New York and shares its mission of compassion and care for the poor, the chronically ill and elderly. Our guiding principle is to help the most vulnerable among us live safely and independently for as long as possible in their own homes and communities. VNSNY CHOICE has 700 employees, including 227 care management staff. On any given day, VNSNY CHOICE coordinates care for more than 40,000 members through its array of Medicare and Medicaid health plans, including Medicaid Long Term Care, Medicare Advantage, and a HIV/Special Needs Plan. With offices in Manhattan, Brooklyn and upstate New York, VNSNY CHOICE health plans are available in the New York City metropolitan area as well as on a plan basis in selected counties throughout New York State. Develops, implements and oversees cost-effective, quality focused services that meet or exceed all regulatory and corporate standards for VNSNY CHOICE Health Plans. Ensures regulatory compliance in all aspects of clinical operations including medical management, utilization management, and UAS assessments for all product lines. Provides leadership in the development and oversight of plan-wide initiatives that form the basis for continuous improvement and customer satisfaction. Works under limited direction. Collaborates with CHOICE leadership on the development of healthplan strategies, initiatives, services and guidelines across the continuum of managed care product lines. Proposes programmatic changes and innovative strategies to improve healthcare quality and outcomes based on assessment of current practices and professional clinical/operational skills. Recommends plans for implementation of new/revised programs. Develops and oversees HIT (health information technology) Systems that support the coordination of services and analysis of utilization. Guides management team in selection of performance indicators/outcome measures. Oversees Assessment unit and external delegated vendor partners to ensure timely assessments of each members medical, behavioral health, long-term services and supports, and social needs. Ensures the assessments are provided within the standards of nursing practice and in accordance with established guidelines and DOH/CMS regulations. Provides leadership and direction to the Care Coordination management team. Ensures that high quality, culturally sensitive and cost effective services and benefits are provided to members by staff and/or contracted vendors. Monitors departmental compliance to changing regulatory requirements at Federal and State level and insure that all indicators meet or exceed requirements. Updates leadership and management on pertinent clinical services issues and/or federal, state regulatory changes impacting care management and utilization processes. Prepares presentations for committee/Board of Directors. Ensures that all subcommittee chairs are held to the charter vision and accountable to the Plan Quality Improvement Committee. Develops Utilization Management/Care Management program in expansion counties and staff that conform to State and Federal Regulations. Represents the Plans Medicare/Medicaid UM/CM at professional meetings. Coordinates and develops Models of Care incorporating VNSNY Care Coordination. Keeps up to date on the latest issues and trends relating to Health Plans and advances in the industry through networking, professional memberships, and select journal reading. Synthesizes trends and determines application and integration into department. Performs all duties inherent in a senior managerial role. Approves staff traininghiring, promotions, salary actions and terminations. Prepares and ensures adherence to department budget. Recommends and monitors productivity and staffing ratios to achieve administrative cost ratio targets. Responsibilities Education: Bachelor's Degree in Business or a related discipline or the equivalent work experience required. Licensure: New York State license and current registration to practice as a Registered Nurse Preferred. Experience: Minimum ten years of clinical experience and a minimum of five years of Utilization Management experience in a managed care/HMO organization required. Minimum five years managerial experience required. Experience with State and external accreditation managed care audits and reviews required Experience with writing and implementing program level policy and procedures required. Proficient with computer and software programs (e.g.; Microsoft Word, Excel) and the Internet required. Experience applying medical management treatment guidelines, such as InterQual / McKesson, Milliman, or other practical management guidelines required. CA2018"}