{"jobID": "2696100820", "jobLocation": "Oakland_CA", "jobTitle": "Clinical Case Manager Rising Oaks", "companyRating": "3.5", "companyInfo": {"Website": "www.fredfinch.org", "Headquarters": "Oakland, CA", "Size": "201 to 500 employees", "Founded": " 1891", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Lincoln, Seneca Family of Agencies"}, "estimatedSalary": "44000", "jobDescription": "Job Summary: The Clinician is responsible for providing high quality, trauma-informed therapeutic services and/or case management to a diverse population of at risk youth, young adults, and families who may be experiencing barriers to receiving office-based behavioral health services. These developmentally appropriate, individualized services may occur in the community, school, office, or residential setting. Essential Functions (Duties and Responsibilities):Clinical Practice: 1) In a manner consistent with FFYC core values of family-centered, strength-based, co-occurring capable, trauma-informed, and needs-driven practice, provides and is responsible for all aspects of participants? clinical program. This includes but is not limited to completing culturally mindful comprehensive behavioral health evaluations and assessments, treatment planning, discharge planning, participation in family conferencing when appropriate, provision of individual and collateral therapy, crisis management and coordination of care including working with adjunctive resources such as group home staff, therapeutic behavioral service providers, teachers, and/or psychiatrists. 2) Delivers services to participants with an awareness and integration of the developmental milestones of children, youth, or young adults, including those impacted by trauma. 3) Performs a full therapeutic schedule of participant contact hours based on supervisor directives. 4) Provides clinical leadership and consultation to other treatment team members, within and outside FFYC. Case Management/Coordination: 1) Provides comprehensive and individualized clinical case management and coordination of services, resources and referral services. 2) Communicates collaboratively and regularly with essential team members to keep them informed and to facilitate continuous open lines of communication. 3) Collaboratively works with collateral contacts to assess participant/family needs and to identify appropriate natural supports and community services to meet those needs. 4) May serve as case manager, as well as a community liaison for placement workers, professional and community resources, parents and significant others. Documentation/Administrative Duties: 1) Maintains participant records in an orderly and timely manner. 2) Utilizes the Electronic Health Record system(s) or other computer-based means to effectively complete all clinical documentation. 3) Demonstrates knowledge of and meets all charting and billing deadlines. 4) Adheres to administrative and productivity goals (up to 65% depending upon program). 5) Participates in internal and community based quality assurance as assigned. 6) Verifies all aspects of documentation meet or exceed county, state and federal guidelines. 7) Meets all HIPAA standards including but not limited to in exchanging information, keeping Protected Health Information (PHI) secure, and following procedures to protect electronic transmission/access to PHI at the agency and in the community. Professional Development: 1) Participates in weekly individual and group supervision meetings as assigned. 2) Maintains current license or waivered status with the BBS which includes promptly completing Continuing Education or examinations as required. 3) Participates in trainings and provides training as assigned. Community Leadership: 1) Represents FFYC professionally in every community situation. 2) Participates in community committees and presentations as assigned. Compliance: 1) Maintains excellent professional boundaries and adheres to all professional ethical standards including abuse reporting, and maintenance of participant confidentiality. 2) Adheres to all agency and program policies including Boundary Code of Ethics, Core Competencies, Code of Conduct, Employee Handbook and state and federal regulations. Additional Duties: 1) Other related duties as assigned by Supervisor 2) May drive on agency business as required. 3) Participates on a rotating basis, in providing clinical 24 - hour on call services, if applicable. 4) May participate on agency Continuous Quality Improvement Committees. Competencies: 1) Demonstrates knowledge of child/adolescent/young adult development and emotional disorders as relevant to program?s target population. 2) Demonstrates knowledge of individual and family assessments, diagnosis, differential treatment approaches and interventions including intensive case management services. 3) Demonstrates knowledge of documentation standards and capacity to meet documentation expectations. 4) Provides developmentally appropriate treatment services consistent with program model and involving multiple systems planning and coordination. QualificationsRequired 1. M.A. Degree in Social Work or Counseling from an accredited college or university.  2. Registered intern or associate with the Board of Behavioral Sciences. Some programs may consider candidates who are able to obtain registered status within first 6 months after hire. Registered PCC intern (PCCI)* with relevant experience with target population eligible in San Diego/Alameda/San Mateo Counties (If working in a program licensed by Community Care Licensing must meet minimum training and experience requirements). For more information please see http://www.cdss.ca.gov/cdssweb/entres/pdf/CCR/STRTP_ILS.pdf  3. Licensed (LCSW or MFT; or, in San Diego/ Alameda/San Mateo County Licensed Professional Clinical Counselors (LPCC). A license may be preferred based upon program need.  4. Certified to conduct a CANS/ANSA assessment within 90 days of employment if the work assignment is in a County program that requires CANS/ANSA certification.  5. Demonstrated understanding of the developmental milestones of children, youth, or young adults to provide to provide care, treatment and services.  6. Supervised experience in providing counseling and/or psychotherapy services  7. Demonstrated knowledge in the areas of diagnostic assessment, individual/family/group behavioral treatment methods for target population of program.  8. Experience with or knowledge of designing, supervising, monitoring, changing, and discontinuing individualized behavioral interventions for staff delivering behavioral services (e.g., TBS).  9. Demonstrated cultural responsiveness in working with diverse families and communities.  10. Clean driving record; current CA Driver’s License or ability to obtain within 10 days after hired.  11. Must have access to dependable transportation; personal car insurance meeting minimum liability coverage required if position requires driving for work or transporting participants.  12. Basic computer and keyboarding competence with the ability to use Microsoft Office Suite and/or competency with electronic clinical documentation systems. Preferred 1. One year post-graduate school experience with program target population (Example: intellectually disabled, homeless, teens or young adults, seriously emotionally disturbed).  2. One year experience with program modality (example: school-based, residential, mobile/community-based, assertive community treatment, wraparound, etc.)  3. Demonstrated ability to assess, triage and organize work.  4. Applies a strength-based, culturally responsive, trauma-informed approach to supervision, participant and community service.  5. Experience with relevant evidence-based practices (e.g., CBT, DBT, trauma-informed interventions).  6. Exhibits strong behavioral, crisis management and family/individual/group therapy skills.  7. Fluency in prevailing language(s) of the community. (*) For LPCC/PCCI’s, the county-specific eligibility must be verified by the hiring manager including certification by the BBS to work with families, as required. Physical Demands:  The physical demands and work environment described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals to perform the essential functions. The noise level in the work environment is usually quiet and, at all times, maintained within safe California Division of Occupational Safety and Health (CAL/OSHA) standards.  Communication  1. Communicates clearly and effectively, both verbally and in writing, with co-workers, supervisors, and participants.  2. Prepares clearly and concisely written reports and summaries.  3. Must be able to comprehend, follow, and clearly convey instructions to others.  4. Must be computer proficient and be able to work on a computer for up to 20 hours per week.  Physical Activities  1. Possesses the ability to actively participate in and supervise participants’ recreational activities, including noncompetitive sports.  2. Must be able to bend, lift as much as 25 lbs., and walk up to a mile at one time.  3. Must be able to operate office equipment requiring repetitive hand movement and fine coordination including use of a computer keyboard.  4. Must be licensed and have the ability and skill to drive cars, vans, or other vehicles.  5. Must be able to respond quickly to emergencies, and to learn and implement Pro-ACT (or other agency approved training).  6. Must be able to physically monitor youths to ensure they do not hurt themselves or others.  7. The job has potential for injury or harm, and the ability to assess and avoid threats posed by participants and the community is necessary to maintain safety. CHECK OUT WHAT OUR BENEFITS INCLUDE! Medical, Dental, and Vision insurance (PPO or HMO options)  Employer matching 401(k) retirement plan  Employer paid life insurance  Employee Assistance Program  Flexible Spending Account (both medical and dependent care)  8 Paid holidays  21 days of Paid Time Off"}