{"jobID": "2829221230", "jobLocation": "Needham_MA", "jobTitle": "Summer Analyst", "companyRating": "4.7", "companyInfo": {"Website": "www.treacy.co", "Headquarters": "Needham, MA", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " McKinsey & Company, Bain & Company, Boston Consulting Group"}, "estimatedSalary": "73000", "jobDescription": " Summer Analysts are integral to T&Co; consulting teams and participate in all aspects of project work including, but not limited to, conducting primary and secondary research, analyzing data, summarizing findings, developing presentations, and managing project logistics. Successful candidates will have a strong desire to take on additional responsibilities, including presentation of findings to clients, and management of individual pieces analysis in work streams. Summer Analysts are each paired with a T&Co; Analyst with 1+ years of experience to provide opportunities for true on-the-job mentoring and feedback throughout our ten- week summer internship program. Summer Analysts also receive unparalleled access to our Engagement Leaders, Principals, and members of our Senior Leadership team. Successful Summer Analysts may receive offers for full-time employment upon graduation.  Summer Analyst positions for the summer of 2019 are available in both our Needham, MA (Boston) and Chicago, IL offices.  Desired Skills & Experience:Current junior at a top-tier university – 2020 graduatesMaturity, drive, intellectual curiosity, strategic intuitionAbility to interact with poise at the senior executive levelDemonstrated success in a rigorous academic program and in previous intern/work experienceThe ability to work effectively on a small team where all members are expected to take on significant responsibilityOutstanding quantitative and qualitative analytical skillsSuperb written, oral, and interpersonal skillsAbout Treacy & Company: Treacy & Company is a management consulting firm that is dedicated to helping its client grow faster, more profitably, and more steadily than before. We believe that the measure of our success is results – not pretty PowerPoint presentations, not gotcha! analyses, not 2x2 frameworks – but, results measured on our clients’ income statements and share values. We help our clients to build stronger growth capabilities by convincing their people to adopt a disciplined approach to capturing growth opportunities and by ensuring that the necessary management systems are in place to help their people achieve peak growth performance. That’s what we do.  The talent of our people is the foundation of Treacy & Company. Over the years, we’ve accumulated a lot of insight about what it takes to drive growth, but our customers benefit from our knowledge only when it is delivered through our skilled and experienced project teams. It is in all our interests to help our team develop skills and accumulate experience as effectively and as rapidly as possible. Whatever your aspirations are in business, we believe that the knowledge you gain in how to grow an organization will put you at the head of the pack no matter where your career takes you. We’re all in on helping you to become the best consultant you can possibly be. Treacy & Company is distinctive in the work we do, the clients we serve, and the people we attract. Consultants join our firm because we offer:An exclusive focus on Strategy, Growth, and Innovation engagementsProven intellectual capital that integrates creative qualitative skills and quantitative techniquesAn ability to personally influence the growth and development of the firmAn entrepreneurial and collaborative culture"}