{"jobID": "2726122605", "jobLocation": "San_Jose_CA", "jobTitle": "Senior Software Engineer", "companyRating": "4.4", "companyInfo": {"Website": "www.thetradedesk.com", "Headquarters": "Ventura, CA", "Size": "501 to 1000 employees", "Founded": " 2009", "Type": " Company - Public (TTD) ", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "150000", "jobDescription": "Raise your hand if you LOVE ads! Yeah, we feel the same So come be a part of the solution, by joining the team that is changing the face of advertising for the better. Founded by the pioneers of real-time bidding (RTB), The Trade Desk has become the fastest growing demand-side platform (DSP) in the industry by offering agencies and their advertisers a best-in-classtechnology platform that focuses on delivering meaningful and relevant engagement with consumers.  With integrations into every major advertising exchange, we handle well over 2 trillion requests every month and growing that's more page views and queries than Facebook, Google Search, and Google's entire network of websites combined all serviced in single-digit-ms response times. Are you interested in working with big data? Do you want to push the edges of scale and responsiveness? It doesn't get much bigger or faster than this!  We are looking for full-stack SOA engineers with grit. Every day we're solving problems that have either never been solved before, or have never been solved at this scale. We run our team very fast and very lean, which means every engineer has a high degree of ownership and potential impact and we are looking for candidates with the chops to handle it.  Recently named one of the top 10 most promising companies in America by Forbes Magazine and one of the \"Best Places To Work\" in the nation by Outdoor Magazine, The Trade Desk offers a culture of \"relaxed intensity\" one that comes from working alongside one of the most talented teams in our industry, and leading in a race that is ours to lose.  You might be a great fit for The Trade Desk development team if: You are a full-stack SOA engineer / generalist. Experience and (just as important) interest in working in a variety of layers and technologies within a SOA is a must for our team. This includes (walking down the stack): AngularJS SPA development, MVC-based web architecture, external RESTful APIs, distributed (and in our case, highly scaled) request handling services, no-SQL and relational SQL databases, big data processing (e.g. data bus architecture, Hadoop / MPP data warehouse, etc.), and data visualization (e.g. Tableau). Experience in all these layers is not strictly required, but we do like to see experience working in more than one, as well as eagerness to work on projects that might slice through them all (because they often will).You have a track record of significant, specific, and self-directed contributions to large and challenging projects. What we're getting at here is \"grit\" or \"street cred\" some proof that this isnt your first rodeo, and you have learned some lessons the hard way.You lead withhumility and confidence. Our engineers have the opportunity (and are expected) to exercise a high degree of leadership and expertise in their daily work, having strongly held and defensible ideas, and advocating for what they believe is right. But they also need to be eager to hear differing opinions, adept at identifying and evaluating tradeoffs, willing to be proven wrong, and quick to walk through fire to help out their follow teammates.You have 8+ years of product-driven software development experience using a modern, object-oriented language. Memory-managed languages are best -- .e.g. C#, Java, Python, Ruby, etc. We do a lot of development in C#/.NET, but specific experience here is not required. We also hope you'll take some time to learn more about The Trade Desk and what it's like to work here. Here are a few links to help get you started: Learn more about our mission to transform the global advertising industrySee what it's like to be an engineeron one of the world's most highly scaled Internet applicationsExperience a taste of our global cultureGet to know a few members of our teamRead the Glassdoor reviewsthat got us named one of the top 20 best places to work in North AmericaNOTE: Do your best to apply to the one role and location you believe best fits your skills, needs, and interests. There's no need to apply to more than one if you're qualified, we'll find the right role and location for you.  The Trade Desk does not accept unsolicited resumes from search firm recruiters. Fees will not be paid in the event a candidate submitted by a recruiter without a contract in place is hired; such resumes will be deemed the sole property of The Trade Desk. The Trade Desk is an equal opportunity employer. All aspects of employment will be based on merit, competence, performance, and business needs. We do not discriminate on the basis of race, color, religion, marital status, age, national origin, ancestry, physical or mental disability, medical condition, pregnancy, genetic information, gender, sexual orientation, gender identity or expression, veteran status, or any other status protected under federal, state, or local law."}