{"jobID": "2816549059", "jobLocation": "Seattle_WA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.traderinteractive.com", "Headquarters": "Norfolk, VA", "Size": "201 to 500 employees", "Founded": " 2017", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Trader Interactive is looking for a Data Scientist to help transform our flagship online marketplace products. Data is at the core of our products. As a Data Scientist you will leverage and evolve Trader Interactives Big Data infrastructure and help to create a state-of-the-art machine learning capability. You will play a key role in developing data-driven products to propel the growth of our business. You will collaborate with a strong team of engineers, product managers, business managers and fellow data scientists, in defining future innovation for data products in our marketplaces. You should be a sophisticated user of advanced quantitative techniques for answering business questions, and an expert at synthesizing and communicating insights and recommendations to audiences of varying levels of technical sophistication. Sample project areas that you will work on include pricing models, recommendation engines, churn predictions, NLP models for lead quality, and fraud analysis. We are in a fast-evolving yet nascent market, as far as the use of data is concerned. As a result you will have the opportunity to go beyond the ordinary and work on high impact, innovative solutions.Your primary focus will be on: Constructing innovative solutions for enhancing consumer experiences by deeply understanding and exploring data Bringing to life creative applications of statistical, mathematical and machine learning techniques, to solve real business problems Working with medium-to-large datasets using R, Python and SQL Collaborate with a team of engineers and other Data Scientists to Integrate statistical and machine learning models into large scale web products This is a full-time role in our Seattle, WA office.About Trader Interactive At Trader Interactive, we view the world from the outside in, putting our users first, focusing on solving their problems and delivering products they value and love. We run the worlds biggest marketplaces for lifestyle vehicles (RV, motorcycles, ATV, Snowmobiles) and commercial equipment. Some of our sites include RV Trader, Cycle Trader, Commercial Truck Trader and Equipment Trader. Collectively, we reach millions of consumers, power thousands of dealer websites, and offer smart tools to assist dealers in more effectively running their businesses and serving their customers. At our core we are a fast-growing technology company, at the intersection of physical and digital economies. Our products are powered by an innovative AI powered Cloud platform which has been the enabler for the digital transformation of traditional markets such as RVs, Motorcycles, and Commercial Equipment and is now helping transform these further by participating in the new sharing economy."}