{"jobID": "2770936742", "jobLocation": "New_York_NY", "jobTitle": "Strategic Account Executive -Washington, DC", "companyRating": null, "companyInfo": {"Website": "www.screenvisionmedia.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Company Overview:  Screenvision Media is a national leader in cinema advertising, offering on-screen advertising, in-lobby promotions and integrated marketing programs to national, regional and local advertisers and providing comprehensive cinema advertising representation services for its theatrical exhibitor partners. The Screenvision Media cinema advertising network is comprised of over 14,000 screens in over 2,200 theatre locations across all 50 states and 93% of DMAs nationwide. Responsibilities: As a Screenvision Media Strategic Account Executive based in the Washington, D.C. region, you will be responsible for strategically selling on-screen advertising to local, regional, and agency businesses. Strong communication and selling skills combined with a can-do attitude are essential. Media background and experience in contacting regional accounts are required. The ideal candidate will have established relationships with federal government agencies regarding marketing and grant programs.  Screenvision Media offers a fun, fast-paced environment that recognizes and rewards its employees with a variety of benefits: Base salaryGenerous commission planCar allowanceExpense reimbursementExecutive producer recognition programMedical, dental and vision insurancePaid vacation401(k) plan  Experience Required:TV/Cable advertising sales experience requiredA proven track record in outside sales.Experience selling in Federal segmentFosters strong relations with various advertising & marketing agencies and clients in education, government, defense, and tourism.Ability to work independently from a remote officeHighly motivated and results-orientedAbility to build strong, long-lasting client relationshipsExcellent verbal and written communication skillsBachelor’s degree preferredTravel will be requiredGenerate new business from Regional businesses and agencies.Achieve or exceed annual sales targets.Develop and maintain relationships with existing accounts to generate continued revenue.Ongoing new business prospecting using Company’s strategies including cold calling and setting face to face appointments with Agencies and businesses.Analyze client needs and propose advertising solutions to help business achieve their objectives.Maintain up to date client and prospect lists to assist in development of sales forecasts for Management. Screenvision Media does not discriminate in hiring or employment on the basis of race, color, religious creed, national origin, sex, ancestry, employment status, age, disability or veteran status or any other basis prohibited by federal, state and local laws. AA/EOEApply"}