{"jobID": "2780481750", "jobLocation": "Oakland_CA", "jobTitle": "Endangered Oceans Intern", "companyRating": null, "companyInfo": {"Website": "www.biologicaldiversity.org", "Headquarters": "Tucson, AZ", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " At the Center for Biological Diversity, we believe that the welfare of human beings is deeply linked to nature - to the existence in our world of a vast diversity of wild animals and plants. Because diversity has intrinsic value, and because its loss impoverishes society, we work to secure a future for all species, great and small, hovering on the brink of extinction. We do so through science, law and creative media, with a focus on protecting the lands, waters and climate that species need to survive.  We want those who come after us to inherit a world where the wild is still alive.  The Center is currently looking for a full-time Edangered Oceans Intern for our Oceans Program. This position is located in Oakland, California. General position overview: The Center for Biological Diversity's Oceans Program seeks a motivated, creative and experienced organizer/intern dedicated to protecting the oceans. The Intern will work with our Oceans Campaigner to execute campaigns to stop the expansion of offshore drilling and fracking in California as well as in the Arctic, Atlantic and Gulf of Mexico. The Intern will assist in developing a network of activists to engage in the oceans program's campaigns, as well as in building a broad, diverse coalition working to protecting our coast from offshore drilling. Main duties: The Endangered Ocean Intern will work with our Oceans Campaigner to create a dynamic work plan to implement the Oceans Program's priority campaigns. Duties will include: Helping with rallies and creative actions against offshore drilling and fracking.Conducting outreach and engaging and tracking volunteers.Coordinating with ocean activists along the California coast to pass local resolutions in their cities opposing offshore drilling and fracking.Outreach to Indigenous peoples, environmental justice, frontline and other underrepresented communities impacted by offshore oil and gas development.Accurately managing large data sets.Writing action alerts, phonebanking Center supporters and conducting research.Coordinating logistics for events and travel.Qualifications and skills desired:Experience in community organizing or campaigning.Strong verbal and written communication skills.A high comfort level in talking to people in person and by phone.Experience working with a team and independently.Knowledge about ocean acidification, plastic pollution, and/or offshore drilling.A passion for protecting the biodiversity of the oceans.Experience managing data sets.A detail-oriented personality.Familiarity with Google Docs and spreadsheets.Areas in which skills and experience will be gained:Community organizing.Coalition building.Advocacy and outreach.Planning and executing mobilizations.Application process: Please apply online by submitting a cover letter, a resume and a short writing sample. The position will remain open until filled. No telephone calls, please. Only candidates selected for interviews will be contacted.  The Center for Biological Diversity deeply values, and is committed to sustaining and promoting, both biological and cultural diversity. We welcome, embrace and respect diversity of people, identities and cultures. We are committed to fostering an organizational culture of diversity and inclusion. The Center believes staff and board diversity is critical to saving life on Earth. We are an equal opportunity employer.Job Posted by ApplicantPro"}