{"jobID": "2827137415", "jobLocation": "San_Francisco_CA", "jobTitle": "(USA-CA-San Francisco) User Experience Writer Intern, Summer", "companyRating": "4.4", "companyInfo": {"Website": "www.google.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (GOOG) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Apple, Facebook"}, "estimatedSalary": "94000", "jobDescription": " Applications are now closed. Please check back next year for 2019 opportunities.  Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; New York, NY, USA; San Francisco, CA, USA  As a User Experience (UX) writer, you are an advocate for Google design, working to shape product experiences by creating useful, meaningful text that helps users complete the task at hand. You help set the vision for content and drive cohesive product narratives across multiple platforms and touchpoints. As a stellar writer, you have a portfolio of work which demonstrates content that simplifies and beautifies the overall user experience.  You work with people in a variety of UX design-related jobs including researchers, product managers, engineers, and marketing and customer operations personnel. Collaborating with each, you strive to establish cohesive language and a unified voice across products and platforms. You regularly use empathy, logic, and hard data to inform content choices, and are an expert in your product. You provide content recommendations that include the right words and sometimes complementary data and images.  Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From AdWords to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.  ## Responsibilities Write clear, concise user-interface text for products.Develop a vision for product content across a given domain. Ensure tactical execution to drive cohesive product narratives across all digital touch points within the product (and work with marketing and operations on touch points outside the product).Collaborate with designers, researchers, prototypers, product managers, and engineers to define requirements.Develop concepts for early stage products. Provide data-informed insights to improve existing experiences.Help coordinate translations, improve writing tools and processes, format documents, and generally assist as needed to produce world-class software and hardware products. ## Qualifications Minimum qualifications:Currently pursuing a BA/BS degree in English, Literature, Communication, Journalism, Science Writing, Creative Writing, Digital Humanities, HCI or a related field, and graduating in winter 2018, 2019, or 2020.Must be currently enrolled in a full-time degree program and returning to the program after completion of the internship.Authorization to work in the United States.Preferred qualifications:Currently pursuing a MS degree program in English, Literature, Communication, Journalism, Science Writing, Creative Writing, Digital Humanities, HCI or a related field, and graduating in winter 2018, 2019, or 2020.Relevant work experience, or personal project experience outside the classroom in technical writing, UX writing, fact-checking, copywriting or content/creative strategy.Knowledge of online technology and related technology and products.Ability to manage multiple competing priorities in a fast-paced, constantly changing environment.Analytical, creative and visual thinker with excellent communication skills, both verbal and visual as well as effective writing, editing, and project management skills.* * At Google, we dont just accept difference - we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you have a disability or special need that requires accommodation, please let us know.  To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees or any other company location. Google is not responsible for any fees related to unsolicited resumes."}