{"jobID": "2788175561", "jobLocation": "Sunnyvale_CA", "jobTitle": "Cloud Regional Sales Manager - Cyber Security - Sunnyvale, CA or Seattle, WA", "companyRating": null, "companyInfo": {"Website": "www.radware.com", "Headquarters": "Tel Aviv-Jaffa, Israel", "Size": "501 to 1000 employees", "Founded": " 1996", "Type": " Company - Public (RDWR) ", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "CareersCloud Regional Sales Manager - Cyber Security Sunnyvale, California or Seattle, WA  / SalesCloud Regional Sales Manager - Cyber Security  Position SummaryRadware is a fast growing public company providing both network and data security systems to hosting providers. We are looking for a Cloud Sales Manager to manage a multi state area selling in the Pacific North West to Cloud/Hosting, Colo and ISP accounts. These accounts both purchase product for internal infrastructure as well as act as channel partners to resell our client's technologies as a service to tenant clients. Initially focusing on network and data security solutions, the candidate will also focus on creating channel partnerships with Hosting/Colo and ISP accounts and the cross selling of all our client's technologies including Server Load balancing, Web Acceleration and Application performance monitoring.Requirements Experience selling to large enterprises ($1B+ in sales) and/or Cloud and Service ProvidersSkill Set should either be around: Cloud Enterprise Managed Services (hosting, etc…), Infrastructure Services and Solutions (i.e.: VMWare, HP, IBM, Sun, etc…), Security SolutionsHave 10 years of IT sales experience with 5+ years direct sales success in the IT Managed Services, Hosting, or Cloud Services marketsMust work well in a team environment, with multiple resourcesDemonstrated understanding of our industry, customer needs and competitive landscapeBS/BA or equivalent degree"}