{"jobID": "2755009198", "jobLocation": "San_Jose_CA", "jobTitle": "Senior Software Platform Applications Manager", "companyRating": "3.7", "companyInfo": {"Website": "www.xilinx.com", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 1984", "Type": " Company - Public (XLNX) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Qualcomm, Intel Corporation, AMD"}, "estimatedSalary": "153000", "jobDescription": "DescriptionXilinx is the world's leading provider of All Programmable FPGAs, SoCs and 3D ICs. These industry-leading devices are coupled with a next-generation design environment and IP to serve a broad range of customer needs, from programmable logic to programmable systems integration. Our All Programmable devices underpin today's most advanced electronics. Among the broad range of end markets we serve are:Aerospace/DefenseAutomotiveBroadcastConsumerHigh Performance ComputingIndustrial / Scientific / Medical (ISM)WiredWirelessPlatform Applications Engineering group is a fast paced and dynamic group with a charter to deliver high quality “go to market” collateral like System Platforms, Reference Designs, Demos, Application Notes and Documentation. Collateral targets key end markets that include Video, Embedded Vision, Data Center Acceleration, Automotive and Industrial with increased focus on emerging technologies like Network Acceleration/Virtualization and Machine Learning. Team is also actively engaged in solving customer issues and enhancing customer experience.  We are looking for a strong leader who can lead the software aspects of the solutions in above markets by being the voice for the team representing the group in cross functional engagements. The role requires the candidate to manage a team of software engineers in San Jose and provide leadership and guidance to a team located in Hyderabad, India. Candidate will be responsible for developing/architecting/delivering System Platforms, Applications and solutions. Candidate will participate in forums to help define solutions. Candidate will work with a cross functional team on enhancing customer experience by solving customer issues for Xilinx’s All Programmable System on a Chip Product line.  Responsibilities: Guide and direct the vision for software and system components for the groupLead and manage a team of software engineers in San JoseProvide cross-functional leadership and guidance to a team of software engineers in Hyderabad, India.Represent Platform Applications Engineering in all key Xilinx forums providing a voice and influence decisions on architecture and solutionsWork cross-functionally with marketing and other engineering groups to architect software framework solution that meets or exceed customer requirementsCo-develop key software components of platforms, reference designs and solutionsParticipate and resolve critical customer support casesDevelop and review critical customer facing documentation (User Guides, Application Notes, White Papers) to enhance user experienceIdeal Candidate will haveExperience in leading and managing teams developing software and systemsExperience in architecting systems with awareness of software/hardware partitioningSource management experience with GITGood communication skills and methodical working practices.One or more of the following Knowledge of other Embedded OS such as RTOSKnowledge of symmetric and asymmetric multi-processing systems and standards such as openAMPKnowledge of Embedded HypervisorsKnowledge of mixed/heterogeneous processor environmentsKnowledge of Embedded Media Processing applications (video processing, encoding/decoding, vision, V4L2)Knowledge of Trusted Execution EnvironmentFamiliarity with software frameworks like Gstreamer, OpenCV, OpenGL, OpenCLKnowledge of ARM based Embedded Systems #eyQualifications:Master’s Degree in Computer Science or Computer Engineering10+ years experience in Software/System development, 4+ years in Embedded Software System Design"}