{"jobID": "2719850841", "jobLocation": "New_York_NY", "jobTitle": "Senior Software Engineer", "companyRating": "4.7", "companyInfo": {"Website": "www.asynchrony.com", "Headquarters": "Saint Louis, MO", "Size": "201 to 500 employees", "Founded": " 1999", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "123000", "jobDescription": " Requirements/Job Duties:Asynchrony Labs, a subsidiary of WWT, has opportunities for Senior Software Engineers encompassing responsibilities along all areas of application development. This includes detailed software design, pair-programming code with unit tests to implement the design, and enterprise architecture integration. Candidates will be responsible for the analysis of business, engineering, and scientific problems, as well as the documentation and development of well-defined methods, procedures, and programs in the delivery of practical systems solutions. Candidates with experience developing for the cloud would be preferred.Qualifications: Senior engineer with specialized experience in databases and software.Requires experience with relational and non-relational, as well as distributed databases.Works with leadership as well as functional and technical subject matter experts to build a holistic view of the organization's database strategy, processes, information, and technologyDetermines gaps and misalignments between the Enterprise strategy and its processes, information and technologyLinks the organization’s Operational Strategy and processes to its Data strategy, Cyber strategy and IT strategy. Documents this using multiple architectural models that illustrate how the organization can realize those strategies in an efficient, sustainable, agile, and adaptable mannerDrives common approaches and exposes information assets and processes across the enterpriseDevelops architectural products and deliverables for the enterprise and operational business linesAdvises leadership in matters of feasibility and risks of potential future projectsCollaborates with the functional community to develop high level architecture solutions to fill enterprise-wide capability gapsProvide subject matter expertise to high level decision makers on architecture issues and solutionsDevelop or lead the development of architecture artifacts to support those technical solutionsCollaborate with user community representatives, government personnel, other Architects and Enterprise Engineers to develop technical solutions"}