{"jobID": "2796134845", "jobLocation": "San_Jose_CA", "jobTitle": "Client Service Associate", "companyRating": "3.5", "companyInfo": {"Website": "www.fishercareers.com", "Headquarters": "Camas, WA", "Size": "1001 to 5000 employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "55000", "jobDescription": " OverviewInvesting can be one of the most important and nerve-racking things in people’s lives– having capable, talented people providing great service helps our clients have confidence in the firm and their future. In the Client Service Associate (CSA) role, being of service to others is seen as a privilege—one where your efforts have a direct impact on our firm and the clients. You will help set our clients at ease through competently managing all of the operational aspects of our relationship with them. It’s not just a job; it’s a great jumping off point within the finance industry—building a strong foundation for your career. You’ll matter… Start your career in a place you can truly impact people’s lives. You will be responsible for making each client’s life easier by handling the operational tasks between Fisher Investments and our custodians. This is an amazing opportunity to communicate over the phone and through writing with wealthy individuals, building your professional skills that will be a firm foundation for future career growth.  As a CSA, you will become an expert in those operational necessities, allowing clients to have peace of mind, knowing their accounts are being handled with care and accuracy. This entry level position is the perfect way to get a foot into the world of finance and capital markets while maintaining a personal connection with the individuals Fisher manages money for. You’ll be equipped… The CSA position works in an open environment as part of a team, with individuals you’ll be able to turn to for support and clarity if you have questions.  As a new CSA, you will spend your first few months learning the role through corporate and role specific training. You’ll be assigned a mentor who will be there for support and guidance as you get up to speed. After the first few months, you will gain your independence and be able to help clients. Everything you learn will help you build toward success in this fast-paced business environment, where we like to promote from within.  You don’t need to know anything about Finance or the Investment Industry to work for Fisher Investments—we hire all majors, because we believe we’re better off with the diversity it brings. What you do need is a desire to succeed and a willingness to learn. We’ll provide you all the training you’ll need to do your job well and you can participate in additional trainings to develop professionally and prepare for future opportunities. If you already know quite a bit about Finance and Investing and are excited to work in it, then this is also a good place for you to start your career—in fact you’ll be surprised to learn even more than you thought possible.  So, what are you waiting for? Apply now and launch your career!  We believe in providing the training needed to be successful in our entry-level roles. Accordingly, none of our entry-level jobs require the highly specialized knowledge needed for us to sponsor an H-1B visa and we therefore do not provide sponsorship for entry-level positions. Fisher Investments is an equal opportunity employer. #LI-FI1  #PDN"}