{"jobID": "2821914933", "jobLocation": "San_Mateo_CA", "jobTitle": "Market Analyst Intern", "companyRating": "3.1", "companyInfo": {"Website": "www.speckproducts.com", "Headquarters": "San Mateo, CA", "Size": "51 to 200 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "46000", "jobDescription": "Position Overview: Speck's Market Analyst Intern will support the Product Management team including research and analysis of market and product trends, gathering insights for new product briefs, and developing analytical dashboards and reports. The opportunity may evolve beyond what's listed below so we are looking for someone who can adapt to new responsibilities quickly with a can-do, jump-right-in attitude.  This is a 3 to 6 month full-time paid internship opportunity. Recent graduates and final year students are encouraged to apply assuming you can work a minimum of 40 hours per week. What You'll Do:Conduct business analysis - develop reporting systems to monitor key metrics and provide updates for team and internal customersAnalyze NPD, Sell-in, and Sell through data to provide insights and identify opportunities for businessCreates analytic dashboards in Microsoft Excel for management and upper level executivesCreate high level business analytic reports via Microsoft power pointCollect and compile comprehensive reports on product opportunitiesConduct competitive analysis and benchmarking documentsConduct research on new unexplored industries and outline business opportunitiesAbout You:You are a senior or a recent graduate with a Bachelor Degree in Business, Economics, Marketing, Mathematics, Statistics or related fieldYou have had some awesome internship experiences! Marketing, data analytics, or other related internships or equivalent projects will be consideredAnalytical, curious and are a geek about synthesizing data and trends in a digestible way to help anticipate opportunities and solve problemsProficient with Microsoft Excel and Microsoft Power Point.Ability to create pivot tables, dashboards and robust presentationsStrong organizational, problem-solving, and analytical skills; able to manage priorities and workflowSelf-motivated, strong work ethic and able to work independentlyStrong communication and interpersonal relationship skills"}