{"jobID": "2776090652", "jobLocation": "San_Francisco_CA", "jobTitle": "Advertising Data Analyst", "companyRating": "2.9", "companyInfo": {"Website": "www.twitch.tv", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2011", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "97000", "jobDescription": "The Advertising Data Analyst will be responsible for monetization reporting and strategy analyses to further maximize the value of Twitches Ads Business. They will work to develop standardized reporting, business analysis and ensure that all data is collected and tracked in an accurate and timely manner. Analytically-minded and extremely detail-oriented, our ideal candidate has a passion for learning and intellectual curiosity that will lead them to ask questions beyond their given daily tasks.Responsibilities Compiling daily figures by collecting data from multiple UIs, creating reporting, and highlighting trendsDesigning metrics and build, monitor, and maintain dashboards to track key revenue/monetization metrics for upper managementAnalyzing lost bid and advertiser bid landscape reports for missed opportunitiesContributing to the development of best practices for the Yield teamAd hoc reporting as neededRequirements Knowledge of display advertising exchanges, behavioral targeting and performance-based optimizationAdvanced problem-solving, math, and Excel skillsStrong oral and written communication skills2-5 years of experience in analyst roleProficiency in SQLWorking knowledge of data modelingAbility to work with cross functional teamsExperience developing sales, product strategies, and go to market plansAbility to facilitate and align roadmaps, and manage disparate tasks with varying priorities.Bonus points Solid understanding of digital advertising concepts and termsProficiency with DFP, Ad Exchange/SSP UIsProficiency in one or more web analytics tools - Mode, Adobe Analytics/Omniture, Google AnalyticsAmazon data stack experiencePerks Full benefits, including medical, dental, vision and life401(k) savings plan with a company matchCatered daily lunch and dinners (and hearty breakfasts three times a week)Unlimited snacks and drinksMonthly in-office massagesCorporate gym membershipCommuter benefitsFlexible time off policyTop of the line technology to help you build your own workspaceAbout TwitchTwitch is the world’s leading video platform and community for gamers, with more than 100 million visitors per month. We connect gamers from around the world by allowing them to broadcast, watch, and chat with each other. Twitch’s live and on-demand video platform forms the backbone of a distribution network for video game broadcasters including pro players, tournaments, leagues, developers and gaming media organizations. Twitch is leading a revolution in gaming culture, turning gameplay into an immersive video experience. Learn more at http://twitch.tv.We are an equal opportunity employer and value diversity at Twitch. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.#LI-KB1"}