{"jobID": "2792299814", "jobLocation": "San_Francisco_CA", "jobTitle": "Sr. Data Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.ebayinc.com", "Headquarters": "San Jose, CA", "Size": "10000+ employees", "Founded": " 1995", "Type": " Company - Public (EBAY) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Apple"}, "estimatedSalary": "156000", "jobDescription": "Primary Job Responsibilities StubHub, an eBay company, is the worlds leading online tickets marketplace providing fans a safe, convenient place to get tickets to the games, concerts, and theater shows they want to see, and an easy way to sell their tickets when they can't go.  Your impact will have a large measurable impact on StubHubs bottom line. In this role, you will develop, improve, and test algorithms to address business needs for ticket pricing and distribution, as well as other applications of Data Science as they arise. You will work with our SW Development team to ensure the scaled production algorithms replicated and maintained in the factory deliver maximum fidelity to those you and the team developed in the lab.  You will also advise on, or directly design, controlled experiments on a wide variety of marketing and product alternatives.  You will maintain a high standard of rigor that gains StubHub competitive advantage by going beyond mere exercise of machine learning and multivariate statistical techniques to a deep understanding of the underlying drivers of the phenomena you discover in the data.  The role is based in StubHubs San Francisco headquarters. It reports to the Sr. Data Science Manager and sits side-by-side with our integrated Data Development, Analytics, and Reporting functions. Key Responsibilities:Apply machine learning and statistical modeling techniques via Python programming skills on Apache Spark, as well as sound business judgment and communication skills.Design and evaluate the results of controlled experiments to optimize elements of our offering; advise others with respect to their experimental designs.Engage with others in specifying improvements to our Big Data analytical environment.Collaborate with others in Data Science and Analytics, and other adequately-prepared power users elsewhere in the company on Data Mining and Predictive Modeling as required.Regularly attend key initiative standups, proactively advising on opportunities to apply and the best approach to apply underlying empirically-developed algorithms.Job Requirements:Authoritative quantitative analysis skills, particularly in machine learning, multivariate statistical modeling, and data mining.Strong communication skills and experience distilling and presenting complex quantitative analysis into action-oriented recommendations.Experience designing and evaluating the results of complex controlled experiments.Strong communication and interpersonal skills, with a strong emphasis on teamwork, initiative and integrity.Passion around live sports and the live entertainment industry is preferred.Basic Qualifications:PhD in Math, Statistics, Operations Research, Physics, Economics, Computer Science or equivalent quantitative field from a top tier school.>=8 years personally developing statistical and/or machine learned models and algorithms based on data generated by consumer behavior. IoT also possibly relevant. This website uses cookies to enhance your experience. By continuing to browse the site, you agree to our use of cookies  View our privacy policy  View our accessibility info eBay Inc. is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at talent@ebay.com. We will make every effort to respond to your request for disability assistance as soon as possible.  For more information see:  EEO is the Law Poster  EEO is the Law Poster Supplement"}