{"jobID": "1804856031", "jobLocation": "New_York_NY", "jobTitle": "Service Desk Support Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.firstrepublic.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 1985", "Type": " Company - Public (FRC) ", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Silicon Valley Bank, City National Bank (Texas)"}, "estimatedSalary": "20", "jobDescription": " OverviewFirst Republic is an ultra-high-touch bank that provides extraordinary client service. We believe that one-on-one interactions build lasting relationships. We move quickly to serve our clients’ needs so that their financial transactions are handled with ease and efficiency. Client trust and security are paramount in our line of business. Ultimately, our goal is unsurpassed client satisfaction which will lead to personal referrals – our number one source of new business. We recognize that our competitive advantage starts with our people and our culture. At First Republic, we work hard and move quickly as a very coordinated team. If you are looking for an opportunity to grow and contribute in a fun, fast-paced environment, First Republic is the place for you. We have exceptional people focused on providing extraordinary service.  The Service Desk Analyst provides front-line technical support to the Bank by responding to incidents and requests reported by users through multiple channels; voice, email, IM, social media, etc.  Support includes but is not limited to: documenting all relevant information into the system of record; troubleshooting the issue within the parameters of best practice ITSM models adopted by the IS department; reviewing and resolving assigned tickets; communicating and escalating issues using sound judgment and self-initiative; and deliver the highest level of customer service at all times with all users.  First Republic Bank delivers friendly, personalized, high touch, banking services including a variety of personal and business deposit products, private banking, and wealth advisory services to meet our client's needs. As specialists in luxury home lending, we offer the broadest range of lending options — from traditional fixed-rate and adjustable-rate residential mortgages to customized construction and renovation loans.Responsibilities Provide front line technical support to the Bank by responding to incidents and requests reported by users through multiple channels; voice, email, IM, social media, etc.Provide superior, high-touch service by engaging mature interpersonal, communication and telephone handling skills.Provide highest levels of availability within the ACD system during scheduled working hours while applying performance behaviors aligned with guidelines and standards designed to enable agents to consistently deliver effective results and to ensure the highest level of productivity and user satisfaction.Provide troubleshooting support for a wide variety of 3rd party applications, Microsoft Office 2010, PCs, Laptops, Peripherals, IP Phones, Network, Internet Browsers, Outlook 2010, Active Directory and Exchange, XP and Win7 operating systems, etc. and engage escalation support processes in a timely fashion using sound judgment and self-initiative.Support the team; be highly collaborative. Seek and share knowledge among colleagues throughout the End User Services team. Leverage Level 2 and Level 3 teammates for troubleshooting and procedural support.Strive to achieve resolution of all interactions on first call whenever possible while proactively and conscientiously balancing competing demands in a fast-paced environment.Perform duties & responsibilities specific to department functions & activities including but not limited to: timesheets, special projects, meetings with staff and 1:1’s with supervisors.Responsibilities include the following: 1) adhering to and complying with all applicable, federal and state laws, regulations and guidance, including those related to Anti-Money Laundering (i.e. Bank Secrecy Act, USA PATRIOT Act, etc.), 2) adhering to Bank policies and procedures, 3) completing required training, 4) identifying and reporting potential suspicious activity to the BSA/AML Officer, and 5) knowing and verifying the identity of any customer(s) that enters into a relationship with the Bank. Assist with special projects as assigned.Critical features of this job are described under the items above. They may be subject to change at any time due to reasonable accommodation or other reasons. This job description reflects management’s assignment of essential functions; it does not prescribe or restrict the tasks that may be assigned. Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.QualificationsMust demonstrate mature interpersonal and communication skills and behaviors.Experience successfully delivering technical support via telephone in a high-call volume environment is strongly desired.Must have excellent organizational and multitasking skills, including the ability to meet deadlines, follow written procedures, while maintaining superior customer service at all times with all users.Requires the disposition and ability to adapt to ongoing changes and the adoption of new technologies in a rapidly evolving IT environment.Familiarity with service management frameworks strongly desired. ITIL Certification or similar, a plus.Requires the ability to learn to effectively triage core banking applications and know when to escalate.Requires the ability to attain a general knowledge of all bank operations.Requires the ability to exercise a reasonable amount of independent judgment.Must support the team, share knowledge, ask questions and act continually on behalf of service improvement.Must possess problem solving and troubleshooting skills related to Windows XP, Windows 7 operating systems, Microsoft Office 2010 applications, Active Directory, Exchange, Peripherals, PC, Laptop, Network, and IP Phone systems.Experience working with an enterprise-class incident/request ticketing system desired (Service-Now a plus).Knowledge of using Ghost imagining software a plus.Remains informed of job-related issues through networking, training programs, seminars and trade publications.Attend weekly team meetings and scheduled group- and firm-wide meetings.Work designated shift between 7:30AM PDT and 7:00PM PDT weekdays, designated weekend shifts (Saturday and/or Sunday), and on-call when assigned.Perform other duties when assigned.Mental/Physical Requirements:The ability to learn and comprehend complex instructions; understand the meanings of words and respond effectively; and perform basic arithmetic accurately and quickly.Vision must be sufficient to read data reports, manuals and computer screens.Hearing must be sufficient to understand a conversation at a normal volume, including telephone calls and in person.Speech must be coherent to clearly convey or exchange information, including the giving and receiving of assignments and/or directions.Position involves sitting most of the time, but may involve walking or standing for brief periods of time.Must be able to travel as position requires."}