{"jobID": "2805052179", "jobLocation": "Redmond_WA", "jobTitle": "Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.decisivedata.net", "Headquarters": "Seattle, WA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "64000", "jobDescription": " Our organization delivers top-notch business intelligence solutions to our clients. The team is agile, lean, and composed of hard working, smart, self-starting individuals. We prize ingenuity, allow chances to push the envelope, and more than anything we prize critical thinking and excellence.  Whether you're a recent grad or an experienced consultant who's done it all, we're looking for a multi-talented data analyst who's looking to make a big impact. Projects include sales pipeline measurement, healthcare efficiency reporting, and sales/competitive intelligence product development.  We are looking for an individual with a natural ability to understand our client's business questions and use data to quantify and gain knowledge required to answer the questions at hand.  Practical work experience background with database design, SQL development/data extraction, and Excel/Tableau report design will put you ahead of the curve.  A background in computer science and data driven applications is preferred. However, if you are a recent graduate of a program such as Applied Mathematics, Physics, or Management Information Systems, and think you are a good fit, then we'd love to hear from you. Duties and Responsibilities:Partner with clients to learn their business and build valuable new reportsCapture requirements and collaborate with BI developers to deliver new metrics and reportsBe a high-horsepower contributor delivering, standardizing, and organizing data for business usesTake initiative where appropriate to drive project architecture and processesRepresent our company and build great relationships with clients in various industries.Requirements:Understand the problem at hand, study possible solutions, and find creative answersCompose clear, concise and well formatted emailsCommunicate issues and questions as soon as they become apparentExcellent problem solving, analytical, communication and customer-facing skillsTeam player and excellent collaboratorWillingness to dive into new technologiesSelf-motivated, able to work independently, active participant in career growthBasic experience with report design and delivery using Excel/Tableau/Pivot TableWillingness to travel 25%Beneficial Background and Skills:SQL database development; T-SQL; and complex query developmentBusiness Intelligence Training with emphasis on SQL Server Analysis Services Cubes / Tabular / TableauUnderstanding of ETL principles such as meta-driven ETL, table driven business rules, and dimensional modelingBusiness acumen around software and high-tech manufacturing business processesBS degree in Computer Science/ACMS/MISMicrosoft SQL Server certifications (i.e. MCDBA, MCSD, MCSE) Decisive Data is an Equal Opportunity Employer. Decisive Data prohibits discrimination and harassment against any employee or applicant for employment because of race, color, age, religion, sex, national origin, sexual identity or expression, sexual orientation, disability, veteran, military or marital status, genetic information or any other protected status.SDL2017"}