{"jobID": "2822120796", "jobLocation": "San_Jose_CA", "jobTitle": "Privacy Assurance Specialist", "companyRating": null, "companyInfo": {"Website": "www.stanfordhealthcarecareers.com", "Headquarters": "Stanford, CA", "Size": "5001 to 10000 employees", "Founded": " 1957", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Sutter Health, UCSF Medical Center and UCSF Benioff Children’s Hospitals, Kaiser Permanente"}, "estimatedSalary": null, "jobDescription": " Job Summary  This paragraph summarizes the general nature, level and purpose of the job.  The Privacy Assurance Specialist efficiently manages a portfolio of privacy-related inquiries, complaints, and concerns to ensure they are handled appropriately and in a timely fashion. Develops and implements action plans for investigative cases, and provides written communications and reports to hospital department managers and Human Resources. Conducts interviews with clinical and non-clinical staff and gathers facts to develop the case file using methodologies appropriate to the case to include but not limited to patient or staff interviews, medical record reviews, system audit log reviews, Internet searches, regulation searches, policy and procedure reviews, and liaising with Information Security staff, the Security Office, and clinical and non-clinical department management as needed. Assists patients in exercising their patient privacy rights; assists the Privacy Office with its proactive education program, to include but not limited to developing educational material and presenting training and educational sessions to clinical and non-clinical staff whenever necessary. Assists the Privacy Office with its electronic medical record monitoring program, to include but not limited to on-site audits, the evaluation of clinical association patterns and investigations of potential inappropriate access to patient information, investigatory interviews of staff, faculty, and others, and development of investigatory reports. Works collaboratively with hospital departments, and builds strong working relationships.  Essential Functions  Analyzes complaints against available facts; makes case determination in consult with Privacy Assurance leadership. Documents case findings in a clear, logical, and meaningful fashion; writes case reports to involved parties to include but not limited to department managers and Human Resources representatives; prepares written summaries of high risk cases for Privacy Assurance leadership.  Assists patients in exercising their patient privacy rights, including amending their medical records, receiving an accounting of the disclosures of their medical records, requesting restrictions on access to their medical records and other civil rights related to patient privacy; communicates directly with patients and meets directly with patients to assist with patient privacy or rights concerns; prepares formal correspondence to patients in compliance with applicable privacy rights requirements.  Assists the Privacy Office with its electronic medical record monitoring program, to include but not limited to on-site audits, the evaluation of clinical association patterns and investigations of potential inappropriate access to patient information, investigatory interviews of staff, faculty, and others, and development of investigatory reports.  Assists the Privacy Office with its proactive education program, to include but not limited to developing educational material and presenting training and educational sessions to clinical and non-clinical staff whenever necessary.  Conducts effective interviews with clinical and non-clinical staff; asking appropriate questions to the issue, following up appropriately on responses provided by the interviewee; identifying opportunities during the interview to obtain additional detail and to clarify the accuracy of the information presented; asks questions in a non-accusatory manner but with sufficient probing to complete the fact-gathering mission.  Conducts thorough investigation related to patient privacy matters and moves quickly to conduct on-site response to reports of potential privacy risks.  Contributes to the achievement of Compliance Department goals and objectives and adheres to departmental policies, procedures and standards; complies with governmental and accreditation laws and regulations.  Effectively maintains collaborative working relationships to achieve increased satisfaction with and participation in the Compliance and Privacy Program.  Exercises independent judgment to investigate, resolve, and document privacy complaints from patients, staff, faculty, and others including hotline complaints related to patient privacy; communicates and corresponds with patients regarding privacy complaints by sending timely acknowledgement and closing response letters.  Identifies and documents the specific privacy allegation(s) to be addressed, develops and executes an action plan for investigative proceedings; determines the information that needs to be gathered and the methodology for obtaining needed information which might include but not be limited to patient or staff interviews, medical record reviews, system audit log reviews, Internet searches, regulation searches, policy and procedure reviews, and working with Information Security staff, the Security Office, and clinical and non-clinical department management as needed.  Participates in the development of the Privacy Office\"s long-term and short-term goals, objectives, plans, policies and procedures. Works with the Privacy Assurance leadership to identify and manage changing priorities.  Prepares the case file for closure ensuring that the file is presented in methodical fashion; the file is easily read by a third party reviewer and pertinent case documents can be easily found; when necessary for ease of reading, prepares a timeline of events relevant to the issue and the steps taken for resolution of the issue.  Pager coverage is required to meet business needs and may include coverage during evenings, weekends, and holidays. After hours business functions may include pager coverage, incident containment and monitoring, and other business activities in support of the Privacy Program. Equal Opportunity Employer Stanford Health Care (SHC) strongly values diversity and is committed to equal opportunity and non-discrimination in all of its policies and practices, including the area of employment. Accordingly, SHC does not discriminate against any person on the basis of race, color, sex, sexual orientation or gender identity and/or expression, religion, age, national or ethnic origin, political beliefs, marital status, medical condition, genetic information, veteran status, or disability, or the perception of any of the above. People of all genders, members of all racial and ethnic groups, people with disabilities, and veterans are encouraged to apply. Qualified applicants with criminal convictions will be considered after an individualized assessment of the conviction and the job requirements.Minimum Qualifications Any combination of education and experience that would likely provide the required knowledge, skills and abilities as well as possession of any required licenses or certifications is qualifying. Education: Bachelor\"s degree in a work-related field/discipline from an accredited college or university Experience: Four (4) years of progressively responsible and directly related experience  Preferred Qualifications: Certification as a privacy professional preferred, such as CHPC from HCCA or CHPS from AHIMA. JD preferred.  Knowledge, Skills, and Abilities These are the observable and measurable attributes and skills required to perform successfully the essential functions of the job and are generally demonstrated through qualifying experience, education, or licensure/certification.  Ability to communicate effectively, demonstrating excellent verbal and written communication skills  Ability to maintain confidentiality of sensitive and private information in accordance with applicable laws, policies and rules  Ability to plan, organize, and prioritize multiple tasks and work independently to meet deadlines and exercise sound professional judgment  Ability to work effectively with individuals at all levels and with varying backgrounds both within and outside the organization  Knowledge and understanding of federal and state compliance program requirements and ability to plan and implement the elements of an effective compliance program in relation to hospital and healthcare  Knowledge and understanding of general state and federal requirements pertaining to patient privacy and confidentiality  Knowledge of and ability to use a personal computer and standard business software applications for word processing, spreadsheets, databases, presentations and e-mail  Knowledge of and ability to use department-specific and enterprise computerized information systems to support compliance functions  Knowledge of and demonstrated ability to use logical, analytical, and problem-solving based methodologies to investigate complaints and concerns from patients, staff, faculty, and others, preferably experience in investigating privacy-related complaints and concerns #LI-RL1 ~LI~"}