{"jobID": "2748659145", "jobLocation": "Framingham_MA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.globoforce.com", "Headquarters": "Framingham, MA", "Size": "201 to 500 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The CompanyPioneer of the WorkHuman movement, Globoforce makes work more human for millions of people and organizations worldwide. Today, Globoforce is the leading provider of human applications, including its award-winning Social Recognition solution. Through its WorkHuman Cloud suite of products, companies can strengthen employee performance and relationships between people and teams on a more positive, socially connected level – in tune with how work gets done today. Founded in 1999, the company is headquartered in Framingham, Mass., and Dublin, Ireland.The JobThe Data Scientist, People Analytics conducts analytics and research to uncover insights related to employee social recognition, business outcomes, and HR industry trends. This person will contribute research for clients, providing custom analysis of social recognition program effectiveness relative to business outcomes, as well as broader original analytics that uncovers how organizations can make their workplaces more human.  This role works closely in partnership with the Globoforce Customer Success, HR, Sales, Marketing and Product teams, providing consultation to drive thought leadership in support of our mission to move our industry forward by striving to become leaders in thought, technology, innovation, and global ability.  This position reports to the Data Analytics Manager, WorkHuman Research Institute.Responsibilities, Skills & Qualifications Contribute to continuing development of thought leadership in employee social recognition and the employee experience as part of the WorkHuman Research InstitutePartner with other internal cross-functional teams, as well as external clients and partners to gather research questions, analyze data, and provide results and interpretationPrepare, manage, analyze, and visualize data from a range of internal databases and external datasets, including data from HRIS, structured and unstructured databases, and survey instrumentsContribute to company, product and services positioning and key messages relevant to our existing customers and to defining industry advancements and innovationsAssist in the development of advanced analytics and reporting provided to clients and third-party partnersContribute to ad-hoc projects in the capacity of subject matter expert as neededCollaborate with team members and others within Globoforce to ensure latest and most relevant industry findings and customer results are presented in an adult educational, and appealing way.Other related duties and projects as assigned.Required Skills & Experience:Proactive and creative approach to problem solving, developing solutions or new approaches in a very fast-moving environmentDemonstrated ability to effectively manage multiple projects and deadlines in support of various business units and client priorities3+ years of experience in an analytics role. Experience within the HR industry preferred.Bachelor’s degree in a quantitative, scientific or related field (e.g., business, psychology, computer science, mathematics). Master’s degree preferred.True passion for organizational development and people analyticsExperience working with and managing large datasets, from both quality and linkage perspectivesProficiency with data science tools (e.g., R, Python, etc)Intermediate knowledge of basic statistical analyses (including linear and logistic regression, cross-tabulations, and ANOVAs)Strong interest and understanding of people (HR) data and systemsEffective written and oral communication skillsPrevious experience with statistical software (SPSS, SAS, R) or database languages (SQL)Familiarity with statistical techniques (clustering, decision trees, etc.) are a plus"}