{"jobID": "2812947624", "jobLocation": "Milpitas_CA", "jobTitle": "Staff Software Enineer", "companyRating": null, "companyInfo": {"Website": "www.hgst.com", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 2003", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Fusion-io, Seagate Technology, Toshiba"}, "estimatedSalary": null, "jobDescription": " Staff Software Engineer – My Cloud Home Device API  We are about creating a personal cloud experience that seamlessly pulls all of your content together (pictures, music, video, documents) into your personal device and makes it available on any screen, any place and any time. A key part of the platform is our REST API which powers all of our mobile, web and desktop experiences. We are looking for a highly motivated engineer to join this critical core team.  Responsibilities:  Independently design and develop features for My Cloud Home Android platform  Work in a cross-functional team with PM, UX and QA to deliver high quality end to end features  Be technically adept to deep dive into SQL, performance profiling, threading and access patterns.  Work in a fast paced, agile environment that continuously delivers value to our customers  Minimum Qualifications  5 years of professional software development experience  Strong programming experience in Go or Java or C++  Experience with SQL.  Experience building highly optimized software under tight device resource constraints  Experience in building REST API services  Strong communication, analytical and problem solving skills.  Preferred Qualifications  Knowledge of multi-threading, concurrency, and scalability constructs.  Demonstrated deep understanding of REST, services, monitoring, and the tenants of horizontal scalability  Experience developing complex and highly available services running in a production environment  Experience developing on consumer devices powered by Linux or Android."}