{"jobID": "2808519979", "jobLocation": "Bellevue_WA", "jobTitle": "Senior Data Scientist, Ordering", "companyRating": "2.9", "companyInfo": {"Website": "www.postmates.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "132000", "jobDescription": " Why compromise? Finally, an opportunity that your data science heart, your career, your mentor and your family can be excited about at the same time! Yes, a job that has it all, i.e., explosive growth, ground-floor product, cutting-edge technology, a highly visible charter and a cool vision that you can boast about. Who are we?Postmates is disrupting local commerce by providing a marketplace where consumers can purchase goods from any local restaurant or store and local couriers deliver the goods to their home in minutes. Postmates has unlocked on-demand local shopping providing consumers the convenience of super fast delivery for the largest selection of goods (anything in the whole city!); the benefit and scale of e-commerce for local merchants; and more flexible work for couriers.  This is a tall order, and Postmates relies heavily on our data applications and systems to realize this vision. Even though we are already a billion dollar business with millions of customers in 300+ US cities trusting us with more than 2M orders every month, we have only just started our technical journey to build our technology stack in a way that can keep up with our rapid growth. What does this team do? It's challenging to place orders to all merchants in the city reliably and efficiently on the massively expanding Postmates marketplace, and its impossible without the most intelligent science and technology. The mission of Ordering at Postmates is to automate and scale order placements to every merchant. We develop high-quality distributed systems and are ready to explore ML and NLP techniques to take our mission to the next level. What will you do? As the first Data Scientist on the team, your responsibilities not only include analysis, modeling and coding, but also defining the strategic direction for our products. We are building the systems from ground up, so we are not tied to any one technology. Mastering the latest trend of data science and artificial intelligence, selecting the right methodologies and envisioning a long-term architecture is part of the role. So is recommending the next set of big bold bets we shall tackle based on insights from data. Finally, this being a new team, youll have lots of opportunities to help us build & grow the team via mentoring, hiring & training.  To accomplish this, you are expected to have an established background in building highly intelligent algorithms in a production environment, great analysis and reporting skills, excellent project management skills, strong product & technology vision, and a motivation to achieve results in a fast-paced environment. You should be somebody who enjoys working on massive data, is customer-centric, and feels strongly about creating good models as well as delivering the impact of them to the end users. Basic QualificationsBachelors in Computer Science or a related field7+ years of industry experienceProven experience in building machine learning models in a large-scale distributed system environment, from opportunity inception to impact deliveryStrong coding skills in Python/Go/Java/C++/C#Extensive experience defining and delivering on complex analytical deep dives to unblock insights from dataDemonstrated experience in articulating ambiguous business questions and developing differentiating metricsExcellent communication skills with both technical and non-technical audiencesStrong sense of ownership and drivePreferred QualificationsAdvanced degree in Computer Science or a related fieldExtensive experience in building voice-bot, prediction, forecasting and/or automated phone systems.BenefitsCompetitive salary and generous stock option plan (stay aligned with the long-term value you create)Medical, dental and vision insuranceWhatever computer, monitor, standing desk, keyboard mouse you needImpact-first work environment (no politics, no pandering)Huge company vision (we need you to build the future, not just maintain the status quo)"}