{"jobID": "2725444614", "jobLocation": "New_York_NY", "jobTitle": "Desktop Artist", "companyRating": null, "companyInfo": {"Website": "www.fbbrands.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1901", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "POSITION SUMMARY:  This position is in the Creative Services Department of a Woman’s Fashion catalog. The Desktop Artist is central to building catalog pages and helping with layout and design. By working with smaller details including print size and photo size, the desktop artist assures that the page works.  DUTIES/RESPONSIBILITIES: Create print/digital files based on art director/designer instructions, mostly from existing materials and templatesDesign, build, and do revisions on new and previous layouts for catalog and digital/web marketing projects with InDesignAcquire deadlines and specifications in order to integrate layouts and designs into production ready files in a timely fashion. Perform quality control at the proofing stage.Mark up, retouching and follow through on rounds of retouching revisions.Oversee quality control and maintain consistency on all images in all channels of print, promotion and ecommerce.Update, maintain and organize copy documents, images and additional assets and keep all these materials organized on company server.Manage daily communication and implementation of requests and approvals,Resolve differences between layout and actual photos.Balance type and photos to make the page layout work.Develop Bind-in order forms.Collect and print images for layout artist for designing pages.Strong typographic and layout skillsStrict attention to detailProficient in Illustrator CS6, Photoshop CS6 and InDesign (Mac platform)Proficient in preparing final press-ready files based on supplied specificationsStrong organizational skillsProject management, file organization and archiving skills are a mustCommunicate and partner effectively and interact well with colleaguesAttend appropriate meetings on the projects assigned (team and production meetings)Required Skills Required ExperienceMINIMUM QUALIFICATIONS:Bachelor’s Degree3-5 years catalog project management experienceStrong problem solving and analytical skillsStrong collaboration skillsExcellent interpersonal and communication skills.Candidates must be proficient in InDesign.Photoshop and Illustrator a plus. FULLBEAUTY Brands™ offers a competitive salary and a comprehensive benefit package, a fun work environment, a generous merchandise discount and realistic growth potential. We value a culture of inclusion and diversity within our workforce. We are committed to maintaining a workplace free from prohibited employment conduct, including discrimination or harassment on the basis of race, color, national origin, sex, age, religion, disability, genetic information, sexual orientation, gender identity or expression, marriage and civil partnership, pregnancy and maternity and any other characteristic protected by law. FULLBEAUTY Brands™ is an equal opportunity employer, M/F.Job Location  New York City, US-NY "}