{"jobID": "2794379530", "jobLocation": "Seattle_WA", "jobTitle": "Senior Data Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.lab126.com", "Headquarters": "Sunnyvale, CA", "Size": "1001 to 5000 employees", "Founded": " 2004", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "144000", "jobDescription": " As a Sr. Data Scientist, you will analyze large amounts of business data, discover and solve real world problems, and develop metrics and business cases that will enable us to continually delight our customers worldwide. You will also work with a team of product managers, BIEs, and software engineers to automate and scale the analysis, and to make the data more actionable to manage business at scale.  Amazon is an Equal Opportunity-Affirmative Action Employer - Female/Minority/Disability/Veteran/Gender Identity/Sexual Orientation BASIC QUALIFICATIONS · Bachelor or Masters degree in Statistics, Applied Mathematics, Operation Research, Economics or a related quantitative field  · 5+ years of experience with data querying languages (e.g. SQL), scripting languages (e.g. Python), or statistical/mathematical software (e.g. R, SAS, Matlab, etc.)  · Experience articulating business questions and using quantitative techniques to arrive at a solution using available data PREFERRED QUALIFICATIONS · Excellent written and oral communication skills  · Experience processing, filtering, and presenting large quantities (Millions to Billions of rows) of data  · Depth and breadth in quantitative knowledge. Excellent quantitative modeling, statistical analysis skills and problem-solving skills. Sophisticated user of statistical tools.  · Ability to quickly adapt to changing priorities and generate innovative solutions in an extremely fast-paced environment.  · Combination of deep technical skills and business savvy enough to interface with all levels and disciplines within our customer’s organization  · Experience in gathering requirements and formulating business metrics for reporting.  · Experience working with data related to causal analysis (e.g. estimating causal lift) or experiments"}