{"jobID": "2735204537", "jobLocation": "Sunnyvale_CA", "jobTitle": "Data Scientist- Growth Analytics", "companyRating": "3.1", "companyInfo": {"Website": "www.oath.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "136000", "jobDescription": " Oath, a subsidiary of Verizon, is a values-led company committed to building brands people love. We reach over one billion people around the world with a dynamic house of 50+ media and technology brands. A global leader in digital and mobile, Oath is shaping the future of media.A Little About OathOath, a subsidiary of Verizon, is a values-led company committed to building brands people love. We reach over one billion people around the world with a dynamic house of 50+ media and technology brands. A global leader in digital and mobile, Oath is shaping the future of media.Our MissionBuild brands consumers loveBuild platforms customers loveBuild a company talent lovesA Little About UsJoin Oath and make amazing things happen for 1 billion people around the globe every day. Oath is the world’s largest start-up. We move fast, show our personality, and are relentlessly focused on inspiring and delighting our users everyday.Our Communications+ products are daily habits used everyday worldwide. As a Data Scientist focused on Growth Analytics, your goal is to find opportunities to drive growth in key metrics: reach, retention, and referrals, by deeply understanding these daily habits.Our mission is to reimagine and create the most essential communication services (Mail, Messenger, Groups, Contacts, and Flickr/Photos) that unlock productivity, enable connections with those who matter most, and serve an indispensable role in people’s daily lives.From developing consumer insights and hypotheses; to guiding product innovation; help build Oath’s Communications+ products into the most personalized, inspiring, and entertaining experiences that everyone uses everyday and everywhere – across their devices worldwide.A Lot About YouYou get people. You have a unique blend of skills in developing deep consumer insights and competitive intelligence through data that drives product innovation to create the right experiences for peoples’ daily lives that achieve our goals to acquire, engage, and retain them.You get data. You have a thirst for knowledge and insight. You thrive and strive to present data in ways that product, design, engineering, marketing, and executive teams understand and act upon. Your data is 100% accurate and credible. Your reports are always clear and actionable.You get growth. You are a consumer-focused, data-driven, and growth-enabling analyst who has supported Growth strategies, roadmaps, scrums, and final product rollouts, across the analytics/insights, acquisition/referrals, activation/onboarding, and adoption/retention loop.You get mobile/digital. You have significant industry experience – and a strong understanding of the mobile/digital ecosystem – from apps to advertising and analytics. You have successfully applied the latest mobile/digital tools to help drive reach, retention, and revenue growth.You get it done. You have successfully worked with product, design, engineering, marketing, and executive teams to understand requirements, translate business needs into data requests, develop methodologies/plans, analyze data, and present findings that are embraced/enacted.Your DayAnalyze user needs and identify/prioritize the problems, pain points, and pleasure points (via analytics, behaviors, clicks/conversions, funnels, etc.)Build models to gain insights on what drives performance in terms of reach, retention, referral, and revenue growthCreate dashboards and reports that provide analysis and commentary, explaining product, marketing, and business trends for Executive reportingInform and update executives and stakeholders on product performance, plans, and progress towards metricsDefine data testing plans and create methodologies that help teams to iterate fast and release new features for testing and, if successful, rollout to all users globallyFocus the product roadmap on achieving the metrics that matter and making ruthless decisions about what to do (and almost as importantly what not to do)Generate and go deep on consumer insights and competitive intelligence to help teams drive product innovation and iterationHelp teams understand/internalize consumer insights, choices, and preferences – and how these influence the product/testing roadmap to drive growthBuild strong partnerships with product, design, engineering, and marketing teams and enable them to launch new Growth initiatives for testing/iterationProvide feedback to product and engineering teams on impact of product launches: target launch metrics, A|B testing, post-launch metricsDistill all metrics from statistically significant deviations that will impact reach, retention, referral, and/or revenue metricsInvestigate data and monitor data quality – partner closely with and provide requirements to the Data Engineering teams that can be clearly acted uponFrame business problems into questions that can be answered through data analysis, and translate business needs into requirementsDesign and lead time-sensitive strategic research projects involving methodology development, analysis, strategic recommendations and presentation of findings to Senior ManagementYou Must HaveBS/MS in highly-quantitative field (Computer Science, Statistics, Mathematics, Analytics, Data Science)Data analysis, generating insights for consumer-focused companiesExperience with statistical programming languages such as Python or RFamiliarity with Unix/Linux environment highly recommendedFamiliarity with query optimization and data ETLExperience with big data technologies such as Hive, Hadoop, MapReduce, Spark etc.Machine Learning skills, including cluster analysis, neural networks, predictive modelingExperience using Statistical techniques including correlation analysis, design of experimentation, linear and nonlinear regressions, logistic regression, sampling and resampling methods, time series, and longitudinal analysisSignificant experience, proficiency in, and passion for Mobile and/or Web productsTrack record of proactively establishing and following through on commitmentsBlend of consumer insights, competitive intelligence, and technical knowledgeDemonstrated use of analytics, metrics, and benchmarking to drive decisionsExcellent interpersonal, organizational, creative, and communications skillsTeam player in driving growth results combined with a positive attitudeStrong work ethic and strong core values (honesty, integrity, creativity)Problem solver who never stops thinking about ways to improveSelf-motivated, results-driven, and team-oriented leaderKiller consumer instincts and data sensibilitiesDemonstrated success in previous rolesPassion for Yahoo and cool products Oath is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on, age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Oath is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. Please let us know if you need a reasonable accommodation to apply for a job or participate in the application process.  Currently work for Oath? Please apply on our internal career site. ​"}