{"jobID": "2817695698", "jobLocation": "Seattle_WA", "jobTitle": "Clinical Data Analyst, RN", "companyRating": "3.8", "companyInfo": {"Website": "www.virginiamason.org", "Headquarters": "Seattle, WA", "Size": "5001 to 10000 employees", "Founded": " 1920", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "71000", "jobDescription": " Job Number: ******  Department: Stroke Center  Hours: 08:00 - 17:00  The Clinical Data Analyst, RN reviews clinical documentation utilizing quality indicators to meet requirements of external regulatory agencies and to support VMs quality improvement and patient safety programs. Keeps abreast of applicable quality standards and quality measure abstraction and data submission requirements; provides education to VM departments regarding clinical quality metrics and trends. Responsible for generating and interpreting abstracted clinical data against established parameters to determine whether information meets criteria; as necessary, accesses additional/alternate sources to obtain required information. Validates and enters data into online databases. Also works with IT staff to interpret specifications for  electronic clinical quality measures (eCQM) and to validate eCQM builds.  Collects, analyzes, and submits clinical quality measure data for databases including CMS and Joint Commission core measures, PQRS/MIPS quality measures, and Surgical Clinical Outcomes Assessment Program (SCOAP) and other clinical registries.  Works with various clinical areas to coordinate and improve data collection, and to provide data and analytics support to front-line clinical quality improvement initiatives and service line Quality Committees.  Analyzes clinical data, identifies trends, patterns, and profiles, and reports findings. May make recommendations for clinical and operational process improvements. Also works directly with Clinical Information Systems and Business Intelligence staff to build and validate electronic clinical quality measures (eCQM) and underlying clinical data assets and analytics infrastructure.  On an on-going basis, keeps abreast of quality reporting standards and quarterly changes in requirements for quality measure data abstraction. Participates in conference calls and/or list serves, and reads literature on abstraction rules/guidelines, to ensure understanding of applicable information.  Supports improvement metrics efforts pertaining to VM corporate goals. Conveys information and current data to project workgroups on a monthly basis to explain data trends; report on ways in which VM meets, or does not meet, guidelines pertaining to metrics; and clarify how data must be recorded to meet guidelines.  As assigned, participates in medical center initiatives/activities (e.g., quarterly advisory meetings, KPO report-outs, Grand Rounds).  In response to directives from external regulatory agencies (e.g., JCAHO, CMS) regarding information collection, abstracts clinical information from electronic patient charts, scheduling systems, billing systems, and reports generated from internal data marts. Interprets abstracted information against established parameters to determine whether information meets criteria; as necessary, accesses additional/alternate sources to obtain required information. Inputs abstracted data into online database.  With numerous awards and distinctions, including our recognition as Top Hospital of the Decade by The Leapfrog Group, Virginia Mason has transformed health care through our innovations in patient safety and our ability to provide patients in our community with easier access to our high-quality care. Consisting of a 336-bed hospital in Seattle, WA, and an extensive network of primary and specialty care clinics throughout the Puget Sound region, joining Virginia Mason is an exceptional opportunity to partner with nationally recognized physicians and peers, and an organization recognized as the benchmark for health care.  As a member of our team, you will contribute to the strength of our Team Medicine approach to collaborative medicine. You will also help to further our commitment to continuous improvement through our Virginia Mason Production System, and our philosophy of empowering you to facilitate real change in the delivery of care. Join us, and find out how many ways Virginia Mason offers you the chance to focus on what really matters - your patients.  Virginia Mason offers much more than competitive compensation and benefits. With continuing education opportunities and the added potential of relocation assistance, you will find our commitment to your well-being is both rewarding and refreshing.  There is also the lifestyle benefit that comes with finding yourself in the heart of the Pacific Northwest. Surrounded by the vibrancy and sophistication of one of the most livable cities in the country, finding the perfect urban or outdoor pursuit will instinctively and pleasurably become second nature.  We are an equal opportunity/affirmative action employer. QUALIFICATIONS: Bachelors degree in Nursing required.  Current, valid licensure as a Registered Nurse in the state of Washington required.  5 years nursing experience including routine use of Cerner PowerChart, EpicCare, and/or other commercial electronic health records systems.  Intermediate level in Excel  Strong analytical and organizational skills; aptitude for detail; strong communication skills; and ability to work independently required.  Skill in entering data using web-based forms, and navigating online databases required.  Prefer Masters degree in nursing. Intermediate level proficiency with SQL and/or PowerBI and experience in an inpatient setting strongly preferred. Alternately, nursing experience in a team-based high-volume primary care setting."}