{"jobID": "2745542124", "jobLocation": "Pasadena_CA", "jobTitle": "Data Scientist", "companyRating": "3.9", "companyInfo": {"Website": "www.kaiserpermanente.org", "Headquarters": "Oakland, CA", "Size": "10000+ employees", "Founded": " 1945", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " HCA Healthcare, Dignity Health, Sutter Health"}, "estimatedSalary": "133000", "jobDescription": " Performs advanced data design and analysis using the Electronic Medical Record (EMR) to create new knowledge useful to KP and outside organizations. Extracts and cleans large volumes of healthcare data across dozens of sources. Applies expert statistical methodologies to clinical outcomes. Partners effectively with physicians, other clinicians, software engineers and business managers to communicate findings using data visualization techniques. Essential Functions: Works with physicians, epidemiologists, statisticians, business managers, and software engineers, to formulate and scope questions and translate knowledge into care transformation.  Develops algorithms and predictive models to solve critical health service problems.  Influences a general audience to understand the quality, completeness, and appropriate use of data.  Provides advice about choice of statistical approaches, performs statistical analysis.  Develops tools and libraries to create efficiencies for future work.  Develops systematic approaches to assure data validity.  Identifies new sources of data within the electronic medical record that will improve information about target diseases and clinical processes.  Establishes links across existing data sources; processes large volumes of data needed for complex research/operational studies.  Trains Data Consultants and other data workers. Basic Qualifications: Experience  Minimum eight (8) years of work experience using medical or healthcare data.  Minimum eight (8) years ofworking with relational databases and SAS or R.  Minimum eight (8) years of experience in multivariate data analysis commonly used in epidemiology, including logistic regression, linear regression, cluster analysis, Cox proportional regression, GEE, and hierarchical models.  Minimum eight (8) years of experience writing and executing complex SQL queries to extract/process/report data.  Minimum eight (8) years of experience with statistics software (e.g., SAS, R).  Minimum eight (8) years of experience building and validating algorithms.  Minimum five (5) years of experience with text search and Natural Language Processing.  Minimum five (5) years of experience with visual analytic tools (e.g., SAS VA, Tableau).  Minimum five (5) years of experience using tools and applications for very large, complex datasets (e.g., Hadoop, Python, Java, Spark).  Minimum eight (8) years of experience with sampling methodologies, including resampling (e.g., boot-strapping).  Minimum eight (8) years of experience with very large datasets (millions of patients; thousands of variables). Education Master's degree required in a quantitative health field (epidemiology, math/statistics, bioinformatics).  License, Certification, Registration  N/A Additional Requirements: Demonstrated ability to design and lead complex analytic projects  Demonstrated understanding of clinical care, health outcomes, and medical terminology  Advanced training in statistics (degree or continuing education) Preferred Qualifications: Minimum five (5) years experience using the Epic electronic medical record for research studies; experience linking across tables and across Epic and measurements from other clinical instruments.  PhD in a quantitative health field (epidemiology, math/statistics, bioinformatics).  Training in data visualization.  Certified in SAS 9.0  Strong skills in advanced SQL programming "}