{"jobID": "2821752366", "jobLocation": "Austin_TX", "jobTitle": "Environmental Services - Supplies & Logistics Intern", "companyRating": null, "companyInfo": {"Website": "www.jegroupcompanies.com", "Headquarters": "Rancho Cucamonga, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " JECSI is a mid-sized company of environmental consultants and engineers and technical, scientific, and business software application developers and engineers that provides environmental, health and safety services to large industrial companies. JECSI has an immediate opening for a Supplies & Logistics Intern.  The Environmental Specialist Supplies & Logistics Intern deals with various environmental regulatory compliance issues (primarily international). This position is responsible for the preparation of safety kits, inventory maintenance, data collection and input and other aspects of office support.  Essential Duties Building safety kits and stocking safety supplies.Provides assistance with file management and database management.Assists in preparing environmental reports and other technical documents.Generate proposals and cost estimates.Research possible marketing opportunities and track marketing campaigns.Assist with developing new leads and prospects through phone calls, email and web.Prepare requisitions and purchase orders for products and supplies.Reconcile purchase orders.Assist with sourcing new products and supplies.Document management including transcribing site notes or inventories, scanning files, and maintaining file folders and document repositories.Open projects at the discretion of managers and associates and modifying existing projects using project management software. Position Requirements Must be in college for 2 years with courses in Business, Marketing, Environmental Sciences, Chemistry, or related field.Strong working knowledge of MS Office Suites and Adobe.Ability to interact with many different types of individuals, including executives, scientists, engineers, and other business professionals.Excellent written and oral communication skills with the ability to effectively communicate ideas and properly describe problems and solutions.Critical thinking, reasoning, and problem solving ability are an essential part of this position. Excellent time management and organizational skills Working Conditions  The job is performed in an office environment with minimal exposure to safety hazards. The job requires some physical exertion, including sitting, standing, occasional light lifting (up to 50 lbs.), carrying, pushing and pulling. The job requires operation of standard office equipment, including computers, telephones, copiers, etc. The job requires following written and oral instructions, attention to detail, ability to multitask, ability to work with others and ability to meet deadlines. The job requires following established policies and procedures, meeting quality and safety standards and regular attendance. The job requires making decisions based on experience and knowledge without supervision and requires responsibility for results.  Salary Range  $15.00 per hour  Additional Notes  Salary is based on experience and qualifications. We offer excellent benefits, including health, dental and pension, and opportunity for career growth, training and continuing education. Please do not apply if you live more than 40 miles away and do not plan on relocating."}