{"jobID": "2764479731", "jobLocation": "San_Francisco_CA", "jobTitle": "Director of Member Experience", "companyRating": null, "companyInfo": {"Website": "www.stridehealth.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " HealthSherpa, Intuit, eHealth"}, "estimatedSalary": null, "jobDescription": "Were looking for a Director of Member Experience (MX). Strides MX team strives to deliver a best-in-class experience at all points of the member lifecycle, across all of our products (health, dental, and vision insurance, tax support, financial services). As we continue to develop amazing products for our customers, were seeking a leader with the entrepreneurial experience, business acumen and innovation track record to create a nimble, responsive and highly differentiated customer experience. The Director will lead innovation of the human-to-human aspects of our customer experience, set priorities for our customer experience roadmap across the product, and provide leadership and direction the team to execute on that vision while working cross functionally with our product, engineering and marketing teams. Youll work closely with our leadership team and report directly to the CEO.Your Mission Create and deliver best-in-class support across multiple channels (phone, chat, text, social media, AI, self-service)Formulate and execute strategic initiatives to continuously improve the customer experienceInfluence product roadmap and development to better assist customer needs and solve issuesLead and manage the team who leads our internal and external member experience functions to maintain quality of support as we scaleBuild the strategy to support our users as we expand our product suiteDevelop processes to increase efficiency and drive down cost/ticket through automation and self-serviceOwn vendor relationships and implementation of support tools and external flexible teamsServe as part of the leadership team and think broadly on how we improve the overall customer experience while delivering on key company metricsDefine the customer experience vision and use this to set and communicate team goals and strategy Recipe for Success You have a passion for the people we serve. Youll go above and beyond to delight our customer. Youll help us make business decisions with the customer in mindEvidence of startup execution skills and ability to rapidly build and scale high-performing teams in a fast-paced environment - ideally 4 years+Strategic and analytical thinker with the desire to constantly improve from the status quo to drive improved customer engagementExceptional emotional intelligence, intrinsically-motivated, energetic & intellectually fearlessExcellent written and verbal communication skills. A cross-functional whizz with the ability to make quick judgments and defend decisionsKnowledge of call center technologies, vendor management, offshore call centers, and best practices in customer support Cherries on Top Experience working in a consumer software startup during a key inflection pointInsurance or financial industry experience and/or deep knowledge and affinity for the future of workConsumer or small business ecommerce experienceExperience managing remote staff and operationsAbout usWe make software that helps the 100+ million people who work for themselves be more productive and successful, giving them economic security to thrive.For the past couple of years weve been solving really important problems for them like getting the right health coverage and simplifying their tax bills. Now were focused on building the worlds first all-in-one productivity platform designed to help them manage their business and make smart decisions every day.Our products are integrated into the worlds largest work-for-yourself platforms including Uber, Etsy, TaskRabbit, Postmates, Care.com, and others, and were backed by leading investment firms including Venrock, New Enterprise Associates, and F-Prime Capital Partners.Come help us take the work out of working for yourself!"}