{"jobID": "2813080726", "jobLocation": "New_York_NY", "jobTitle": "Policy Analyst", "companyRating": "4.2", "companyInfo": {"Website": "www.nrdc.org", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " 1970", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": " The Natural Resources Defense Council (NRDC) is the nation's most effective environmental action organization. We use law, science and the support of 3.1 million members and online activists to protect the planet's wildlife and wild places and to ensure a safe and healthy environment for all living things. NRDC was founded in 1970 and our staff helped write some of America's bedrock environmental laws, including the Clean Water Act, and many of the implementing regulations; our water enforcement cases played a major role shaping current water policy throughout the country. Today, our staff of more than 500 lawyers, scientists, economists, policy and communications experts, and others, work out of offices in New York, Washington, Chicago, Los Angeles, San Francisco, Bozeman, Montana and Beijing. Position Summary: NRDC is looking for a Policy Analyst to join our Climate & Clean Energy team in New York City or Washington, DC. The Policy Analyst will conduct detailed analyses of the impacts of environmental policies and other solutions on the power sector and broader U.S. economy, at both federal and state levels. The Policy Analyst will collaborate within the Policy Analysis Group, with other NRDC colleagues in various programs, as well as with external consultants. Perform power sector analysis of the impact of emerging regulations and policy proposals on the electricity sector.Collaborate with consultants performing economic modeling of federal, regional, state and local impacts of regulations and policy proposals.Draft material pertaining to national, regional, and state impacts, including fact sheets, blogs, policy briefs, and primers in various forms including presentations, graphs, tables, and other visual and report formats.Conduct economic and financial analysis on matters of interest to the Policy Analysis Group, such as costs of renewable energy technologies, energy efficiency, technological improvements in key economic sectors, ITC, PTC.Support the Policy Analysis Group as needed with tasks related to federal regulations, including for methane, vehicles, refineries, boilers, and cement.MPA, MBA or Masters in Economics, or other policy or law degree in relevant field1-2 years of relevant work experience in business, energy, or environmental fieldExperience working on clean energy or climate-related policies, particularly pertaining to policy implementationKnowledge of project economics and finance related to power plants, renewable energy, and energy efficiencyKnowledge of economic modeling of the electric powerand transportation sectors, as well as economywide modelingUnderstanding of federal and state policies related to the electric power and/or transportation sectorsAbility to analyze complex, multi-dimensional problems and make actionable recommendationsFamiliarity with publicly available data sources and databasesAbility to advocate for public policiesExcellent verbal communication, strong writing, and confident presentation skills NRDC is committed to workplace diversity and inclusion. We are equal opportunity employers and do not discriminate in hiring or employment on the basis of race, color, religion, national origin, gender identity and expression, marital status, sexual orientation, age, disability, veteran status, or any other characteristic protected by federal, state, or local law. We offer competitive salaries, excellent benefits, and a pleasant working environment. Salary is based on a nonprofit scale and commensurate with experience.  Pursuant to the San Francisco Fair Chance Ordinance, for positions based in San Francisco, CA we will consider for employment qualified applicants with arrest and conviction records.  To apply, please visit www.nrdc.org/careers and upload your resume and cover letter through our online portal. We would like you to upload any additional papers or project work that you think would showcase your abilities. Please no phone calls, emails, faxes or in-person resume drop-offs. Please reference where you saw this posting. NRDC is an Equal Opportunity Employer.  If you are having technical difficulty while applying, please reach out to Customer Care by dialing 1-800-889-4422.  For further information about NRDC, please visit www.nrdc.org."}