{"jobID": "2710237469", "jobLocation": "New_York_NY", "jobTitle": "Software Development Intern", "companyRating": "4.0", "companyInfo": {"Website": "www.arkadium.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Apester, Graphiq, Carambola"}, "estimatedSalary": "61000", "jobDescription": " After being featured on the cover of Inc. Magazine’s 2016 “Best Workplaces” issue, Arkadium followed up in 2017 by making the “best places to work” lists of Inc., Ad Age, Crain’s and Digiday. Since 2001, we’ve been creating engaging, revenue-generating content used by hundreds of global publishers including USA Today, tronc, Comcast, Microsoft, and CNN. Our newest product, InHabit, innovates the newsroom by delivering relevant interactive visualizations to any article instantly — enhancing editorial and boosting user-interaction, all while delivering a premium ad experience to focused and active users. Overview Working from our beautiful, bright headquarters in New York’s Flatiron, your focus will be on developing tools, solving programming problems, and helping to build fun, compelling interactive content to live on the company’s new flagship engagement platform. Our ideal candidate will bring bold ideas, a proven ability to execute, a deep interest in learning new technologies, positive energy, and fierce drive. Responsibilities:Developing new internal tools that help solve a wide variety of problemsHelping create new interactive content that range from fun games to editorial web apps with support from experienced developersHelping develop front ends in HTML5 and other web tech that’s highly responsive and visually excitingWorking with the team in ideation and brainstorming for new market-defining interactive contentIntegrating with recommendation engines, analytics products, and big data solutionsWorking in an Agile environment as part of a multi-disciplinary team that values speed and autonomyEffectively utilizing and understanding shared technical modules and templatesRequirementsCurrently studying or have received a bachelor’s degree in Computer ScienceExperience with Javascript, C#, and/or PythonExperience with REST API development and MEAN stackExperience developing front-end UI solutions using React/Inferno, SASS/LESS, or similarYou MUST include a link to your Github or online portfolio with previous web/game/interactive projects that you’ve worked on. Candidates without portfolios or links to their projects will NOT be considered. This internship will run from June 2018 through August 2018. Please include your work availability when applying. BenefitsA unique culture of teamwork and funA beautiful Flatiron studio located in the heart of NYC's Silicon Alley, just steps from Madison Square ParkSummer Fridays: our office closes at 3pm every Friday between Memorial Day & Labor Day WE'VE BEEN RECOGNIZED!Inc Magazine's Best Workplace - 2016, 2017Crain's Best Places to Work - 2017Ad Age Best Places to Work - 2017Digiday Worklife Award - 2017 By applying for an open position, you grant Arkadium permission to store and process your personal data. Without this permission, we cannot consider your application and your personal data will be deleted. If you have any questions, please contact Arkadium's Data Protection Officer, Dmitriy Naugolnykh – dpo@arkadium.com"}