{"jobID": "2822385292", "jobLocation": "Flushing_NY", "jobTitle": "Retail Store Manager, Bilingual - Mandarin", "companyRating": "4.0", "companyInfo": {"Website": "www.tmobile.careers", "Headquarters": "Bellevue, WA", "Size": "10000+ employees", "Founded": " 2001", "Type": " Company - Public (TMUS) ", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " Verizon Wireless, Sprint, AT&T"}, "estimatedSalary": "52000", "jobDescription": "Job Description:Heres to the leader in you. Its time to do something you love, work with a purpose, and take on a challenge like never before. Meet T-Mobile, Americas Un-carrier, serving 50 million wireless subscribers and growing. When you join our team, you can make an incredible difference to your customers, and your co-workers. Were looking for boldness, enthusiasm, and a whole lot of passion. In exchange, we offer real career growth opportunities in a place where awesome work is rewarded. Responsibilities: You know retail sales inside and out, and youre ready to make that next move to a leadership role like no other. In this role, youll manage talent, inspire your team, and make sure every customer comes away with a great experience. Its not easy, but its the kind of challenge that can make your career. Take a closer look at what the job entails: When it comes to the customer experience at your store, the buck stops with you, as you ensure that each person gets an unforgettable experience and a custom-fit solution to their wireless needsYoull help your associates to build strong relationships with their customers, make expert recommendations, and help onboard customers like a proWell look to you to hire, train and develop your team, making staff adjustments as neededYoull also ensure that your store meets or exceeds sales goals, and that means overseeing all store functions, from sales and inventory to the implementation of new store programs and initiativesAlong the way, youll stay current on all our technology so that you can be an expert for your team, and your customersFinally, youll make sure your store always looks its bestQualifications: This is the big leagues. Youve got a lot of responsibility and people looking to you for guidance and leadership. Ready to bring it? Good. Heres a little more on what were looking for: Youve got prior sales and sales management experience with a customer focused retailerThis includes previous consultative sales in consumer technology, coupled with a demonstrated record of high achievementYouve also got experience in operational, financial and performance management, having previously managed site profit and lossYouve also got a unique ability to lead and coach people to deliver great resultsPeople who know you would say youre an amazing communicator, both with customers and teammatesBilingual speakers wanted: youre fluent in English and also able to communicate effectively in MandarinYouve got solid computer proficiencyA high school degree or GED is essential, while a Bachelors degree is preferred Youre ready for this. So lets talk about all the generous rewards we can offer for your outstanding work. Our compensation includes: Competitive base pay plus unlimited commissionsBenefits for part-time and full-time associatesMedical, dental and vision benefitsMatching 401(k)Generous paid time-off programsPhone service discountsEducation reimbursementSerious growth potential for your career This is the opportunity to do something special and be a leader with a company revolutionizing the wireless industry. And we couldnt do it without someone like you. So what do you say? Isnt it time you explored what could become the career move of a lifetime? We invite you to apply today! Minimum Qualifications:At least 18 years of age.• Legally authorized to work in the United States.• High School Diploma or GED.• Pre-employment background screen.Company Profile: As Americas Un-carrier, T-Mobile US, Inc. (NASDAQ: TMUS) is redefining the way consumers and businesses buy wireless services through leading product and service innovation. The companys advanced nationwide 4G and 4G LTE network delivers outstanding wireless experiences for customers who are unwilling to compromise on quality and value. Based in Bellevue, Washington, T-Mobile US provides services through its subsidiaries and operates its flagship brands, T-Mobile and MetroPCS. For more information, please visit http://www.t-mobile.com EOE Statement: We Take Equal Opportunity Seriously - By Choice  T-Mobile USA, Inc. is an Equal Opportunity Employer. All decisions concerning the employment relationship will be made without regard to age, race, ethnicity, color, religion, creed, sex, sexual orientation, gender identity or expression, national origin, marital status, citizenship status, veteran status, the presence of any physical or mental disability, or any other status or characteristic protected by federal, state, or local law. Discrimination or harassment based upon any of these factors is wholly inconsistent with our Company values and will not be tolerated. Furthermore, such discrimination or harassment may violate federal, state, or local law. "}