{"jobID": "2831131252", "jobLocation": "San_Jose_CA", "jobTitle": "Project Manager", "companyRating": null, "companyInfo": {"Website": "www.acemb.com"}, "estimatedSalary": null, "jobDescription": "About Aurum Consulting Engineers Aurum Consulting Engineers, a leading Bay Area and Central Coast electrical engineering firm that focuses primarily on electrical engineering ranging from Commercial, Education, Health Care and Government projects. Position Summary: Project Managers are responsible for designing, developing, producing permit and construction documents for electrical systems and managing engineering projects from beginning to end. Project Managers are also responsible for acquiring and managing Aurum’s projects in line with Aurum’s goals and within the project’s timeline and specifications with purpose of optimizing revenue growth. Duties & Responsibilities:Power distribution and lighting design.Single line diagrams and panelboard schedules.Lighting fixture selection and schedules.Lighting control diagrams.Title 24 compliance calculations.Voltage drop, load and demand calculations.Develop project specifications.Review shop drawings and specifications.Review, comment and process equipment and system submittals.Visit job sites for field investigations.Coordination with other construction trades and disciplines.Back check of own work for accuracy and completeness before submission.Attend project design team meetings.Research and resolve drawing interpretation problems, conflicts, interferences and errors. Required Education and/or Experience:Bachelor of Science degree in Electrical Engineering.PE License a plus.5 Years of electrical construction project management experience.Reasonable knowledge of the NEC/CEC as well as building codes and ordinances.Understanding of sustainable design and LEED Documentation a plus.Proficient MS Word & Excel and AutoCAD.Experience with Fire Alarm Design a plus.Experience with Low Voltage Systems Design a plus.Experience with Revit a plus.Good time management, communication and people skills.Excellent written and verbal communication skills.Self-starter and able to work with minimal supervision. We offer competitive salary, benefits package, retirement plan, a dynamic work environment and a chance to grow professionally. Please email resume to najib@acemb.com "}