{"jobID": "2575489557", "jobLocation": "Alameda_CA", "jobTitle": "Entry-level Intern Women in STEM", "companyRating": null, "companyInfo": {"Website": "www.iwitts.com", "Headquarters": "Alameda, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "This position is open as of October 31, 2017:Entry-level Intern Women in STEM (Alameda) Description: Non-profit seeks an entry-level Intern to support our small, close-knit team. We value communication, teamwork, and reliability. 10-16 hours per week between the hours of 7:30 am – 2:30 pm Monday - Thursday in a beautiful waterfront office. This is an excellent opportunity for a college student to gain practical workplace experience.  You will work with a nationally-recognized organization that is helping U.S. schools and colleges increase the number of women and girls in science, technology, engineering and math (STEM) programs. The Institute for Women in Trades, Technology and Science (IWITTS) is a leader in gender equity in education and was highlighted by the National Science Foundation for program effectiveness. Our Executive Director has testified before Congress, appeared extensively in the news media, and keynotes at conferences throughout the country. Responsibilities:Online Marketing: Research and create Social Media profiles on sales prospects; help manage company contact lists, data mining, Facebook postsMultimedia: Input emails in marketing automation software (Active Campaign)Admin: Maintain electronic and hardcopy filing system; scanning, support Executive Director, Training Coordinator, and Program Coordinator as neededSocial Media Project: Build awareness of IWITTS’s programs by more widely publicizing its positive client feedback across the education industry. The Intern would be responsible for coordinating and publishing training participant testimonials in the LinkedIn platform. The Intern would be responsible for reaching out to 100+ educators who have given positive testimonials in order to convert the comments into LinkedIn recommendations. The intern would need to create a project plan; reach out to past training participants via email, social media, and phone; work within a small team; report on progress; and manage the database.All other duties as neededRequired Skills:Quick learner, team player, self-directedBasic skills in Word, Excel and PowerPoint. We will train in Active Campaign and Excel if necessary.Tech savvy, detail-orientedGood Internet research skillsCompensation / Hours / Location:Starting Salary: $10 per hourSchedule: 10-16 hours, M-Th 7:30 am – 2:30 pm PT (hours negotiable).Location: Onsite in our beautiful Alameda waterfront office.Deadline to Apply: ASAP.Websites: www.iwitts.org * https://www.linkedin.com/in/iwitts (See our Linked-in Profile to review recommendations from past interns).To Apply:Send a cover letter and a résumé via email to jobs[at]iwitts.org. Subject line should read: Women & STEM Intern.Describe your experience in each of the above areas. Let us know if there are areas you have limited experience with and how you would come up to speed.Indicate your available start date and preferred schedule.Include your LinkedIn profile if you have one.Please let us know how you heard about this position."}