{"jobID": "2822798174", "jobLocation": "Cambridge_MA", "jobTitle": "Posting Title Data Analyst, CX Index", "companyRating": "4.2", "companyInfo": {"Website": "www.forrester.com", "Headquarters": "Cambridge, MA", "Size": "1001 to 5000 employees", "Founded": " 1983", "Type": " Company - Public (FORR) ", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": "Data Analyst, CX Index Job Locations US-MA-Cambridge  Category Advisory - Data  Overview  Fuel your intellectual curiosity and professional growth. Forrester is an idea company, where smart, motivated, curious people bring a diversity of opinions and the courage of their convictions to collaborate on ideas that change the course of business. Most of all, bring a point of view; here, every voice has value. At Forrester, you'll work with innovative clients at emerging and established brands; these are the business and technology leaders we inspire and who inspire us. The Forrester experience is built on a singular, powerful purpose: to challenge thinking and lead change. About This Role: The Customer Experience Index (CX Index) product team supports our clients with the most complete and powerful proprietary CX tool in the market today. The CX Index evaluates over 600 brands across 20 industries in North America, Europe, and Asia Pacific. It gives our clients a deep and actionable understanding of the quality of their customer experience; competitive benchmark data so that our clients know how they stack up against their peers; and the ability to model which improvements will have the biggest impact on our clients' revenue.  The Analyst is a critical member of the CX Index product team; her/his overarching goal is to support our CX Index clients, advise them on how to raise the quality and performance of their customer experience, and guide them on how to transform their organization around the customer. She/he will achieve this by analyzing CX Index data and delivering actionable advice through client inquiries and engagements as well as written deliverables and reports.  Candidates need to be leading experts in the customer experience space with a deep understanding of the challenges that companies face today in the age of the customer. This individual must stay abreast of these issues, link them to our CX Index data and insights, and advance our thought leadership in this space. The Analyst will also play an integral role in guiding and supporting future innovations of the CX Index product globally. The Analyst works as part of a growing, high-performance team of other analysts, researchers, and program managers, collaborating with team members in all aspects of the job. ResponsibilitiesCreate and maintain intimate, trusted relationships with our CX Index clients, pushing their thinking, coaching and advising them, and delivering actionable recommendations.Develop high-quality, visually engaging deliverables for executives and their teams that discuss appropriate and tactical CX recommendations and best practices based on the CX Index data.Lead our CX Index Engagement Program and ensure that it delivers the value our CX Index clients require; uncover new ways to evolve the program; and address any challenges or issues uncovered during the engagements.Lead our initiatives to identify new areas of inquiry with our CX Index data that will add incremental value to our clients alongside developing impactful reports and/or deliverables that showcase the CX Index data and our thought leadership.Significantly contribute to the evolution and expansion of the CX Index products based on CX thought leadership, client feedback, and unmet needs.Support the CX Index product team and associated sales team in achieving its booking and revenue goals as well as answering inquiries about CX Index with CX Index clients and prospects.Create strong partnerships with Forrester's CX research analysts and CX consultants to keep abreast of CX research, best practices, and thought leadership; identify how to align and integrate this with the CX Index product.Identify and support multiple ways of advocating for the value of the CX Index framework and products through conference presentations, webinars, blogs, and media/press interviews.QualificationsA strong academic record of achievement; an MBA is strongly preferred.A minimum of three to five years of domain experience with customer experience practices and principles.Significant knowledge of the challenges that companies face and the appropriate best practices that can improve their CX - both in the B2C and B2B spaces.An insatiable intellectual curiosity combined with superior problem-definition and problem-solving skills.Strong analytical capabilities with a good understanding of advanced statistical analyses, especially regression modeling.A demonstrated ability to articulate advanced analytic results to a non-quantitative business audience.Significant experience and skills in preparing top-quality, actionable deliverables and delivering dynamic and engaging presentations to executives and the C-suite.The ability to work independently without day-to-day supervision.The ability to collaborate effectively with others in high-pressure situations and handle multiple tasks.Sharp attention to detail and high personal standards for quality and thoroughness.The ability to travel 25% to 30% of the time."}