{"jobID": "2816756265", "jobLocation": "Newark_CA", "jobTitle": "Marketing Events Manager", "companyRating": "3.3", "companyInfo": {"Website": "www.rms.com", "Headquarters": "Newark, CA", "Size": "1001 to 5000 employees", "Founded": " 1988", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " AIR Worldwide, EQECAT, Verisk Analytics"}, "estimatedSalary": "90000", "jobDescription": "Marketing Events Manager  Newark, CA RMS is seeking a superstar to join the Corporate Marketing team. The Marketing Events Manager is responsible for working effectively with clients, internal teams, industry organizations and external vendors to deliver top notch event programs that drive successful results. The Events Manager will report to the Senior Manager, Marketing Events and work within the Marketing team to enhance and execute our programs. Our ideal candidate should thrive under pressure and have a passion for event production and logistics. Key Accountabilities & Deliverables:Support/Manage the planning and execution of assigned event programs of various size and scale.Develop and manage external partners and vendors for multiple events.Support the field marketing team on our client facing events.Create/Manage an internal speaker bureauCreate/Manage a worldwide industry events calendarPartner with internal cross-functional teams to create event agendas and content that meets engagement objectives.Develop and manage planning tools; i.e. budget tracking, project timeline, production schedules, event specs, meeting agendas, notesetc.Lead creation of event communications and promotion for assigned programs to drive meaningful attendance.Track budget costs throughout the course of project and communicate scope changes that effect budget in a clear manner. Reconcile budgets and lead internal and external project debriefs.Establish, maintain and enhance relationships with all team members and departments (product marketing, creative, operations, client development and support, finance, legal, etc).Drive negotiations and project management of critical events and deliver flawless event plans.Gather and track ROI, engagement analytics and feedback to consistently assesses opportunities for improvement.Be a team player that is willing to build out and manage processes internally and cross functionally that will ensure the success of our events with our global production partners.Experience Required:3+ years of event management and planning experienceStrong competencies: client focus, accountability for results, team effectiveness. Strong time management and multi-tasking skills, flexibility and professional confidence.Strong project management and decision-making skills.Must be self-motivated, highly organized, articulate and possess excellent verbal and written communications skills.Ability to see the big picture as well as strong attention to detail.Possess a strong teamwork ethic; must have the ability to work both independently and as part of a larger team.Ability to work smart under pressure and efficiently on multiple project requests simultaneously in a fast-paced environment where tight deadlines and unexpected complexities can crop up.Flexible work schedules and the willingness to travel (including potential evening, weekend and holiday work).Motivated, positive attitude, and results-oriented.Excellent computer skills: familiar with Google, Microsoft and Apple applications, Microsoft Office suite, Social Networking sites, collaborative team project software, etc.High-tech industry experience is preferred but not required.Education: Bachelor´s (BA/BS) degree from accredited four-year college or university or equivalent experience About RMS: Theres a 5% chance that a hurricane will cause $60 billion of insured losses next year and a 1% chance an earthquake will cause $50 billion of insured loss in the next 12 months. At RMS, we build the simulation models that allow insurers and investors to understand portfolio risks due to catastrophes: natural catastrophes (hurricane, earthquake, flood), terrorism, pandemic, and changes in life expectancy.  We are one of the most exciting companies youve probably never heard of, unless youre one of our hundreds of clients in the (re)insurance, banking or hedge fund sector. We lead an industry we helped pioneer and ultimately our work makes a true impact on the world at large. How we understand and manage risk affects everybody and our passion is nothing less than creating a more resilient world through a better understanding of catastrophic events.  We are evolving our vision by delivering future solutions in the cloud, our cutting-edge risk management platform RMS(one) for the global risk market. RMS(one) will create a holistic and integrated view across the enterprise with one platform for all models, all points of view, and all data. All will be run as equal partners on RMS(one).  RMS has 1,200 employees in 11 countries, including offices in Newark (CA-USA), Noida (India), London (UK), Hoboken (NJ-USA), and Zurich (Switzerland).  To find out more, visit www.rms.com or follow us on Facebook, LinkedIn or @rmsjobs on Twitter. RMSis proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity without regard to race, color, creed, gender, religion, marital status, registered domestic partner status, age, national origin or ancestry, physical or mental disability, genetic characteristics, sexual orientation, or any other classification protected by applicable local, state, or federal law.RMS is enrolled in E-Verify® and will be participating in E-Verify in addition to our Form I-9 process.www.dhs.gov/E-Verify.To all recruitment agencies:RMS does not accept unsolicited agency resumes and will not responsible for the payment of placement fees related to unsolicited resumes submitted to open positions, job aliases, or to our employees."}