{"jobID": "2830443520", "jobLocation": "Redmond_WA", "jobTitle": "Data Scientist", "companyRating": "4.1", "companyInfo": {"Website": "www.microsoft.com", "Headquarters": "Redmond, WA", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (MSFT) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Amazon, Apple"}, "estimatedSalary": "139000", "jobDescription": " Team intro/culture statement  In the AI Perception and Mixed Reality team, peoplenot devicesare at the center of everything we do. Our tech moves beyond screens and pixels, creating a new reality aimed at bringing us closer togetherwhether that's scientists \"meeting\" on the surface of a virtual Mars or some yet undreamt-of possibility. To get there, we're incorporating diverse groundbreaking technologies, from the revolutionary Holographic Processing Unit to computer vision, machine learning, human-computer interaction, and more. We're a growing team of talented engineers and artists putting technology on a human path across all Windows devices, including Microsoft HoloLens, the Internet of Things, phones, tablets, desktops, and Xbox. We believe there has to be a better way. If you do too, we need you!  What you'll need Basic Qualifications:A Bachelor/Master's/PhD degree in Computer Science, Mathematics, Statistics, or a related technical discipline.2+ years of relevant data analysis and/or applied ML experience in the context of Data ScienceStrong customer focus and passionate about doing the right thing for the customerExcellent communications skills able to present and discuss data models and analysis to a range of audiences, in a concise and effective manner Bonus points Preferred Qualifications:Experience with large scale (structured and unstructured) data processing and analysis tools (like Cosmos/Scope, ElasticSearch/Kibana, HDInsight, Hadoop, SQL, etc.)Experience in statistical packages and standard libraries in Python and/or RExperience in machine learning using frameworks such as Python's scikit-learn or PySpark's mllibAbility to integrate a wide range of data sources and analysis to answer core business questions Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.  Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.  Role description  Build products customers love is our obsession! Our team works on data analysis and machine learning problems, enabling Analog to make the best possible decisions about its business, experiences and technology. We partner with business owners and PMs to translate their questions/goals into a data science project, determine sources of data, conduct the analysis that will reveal actionable insights, and develop/operationalize models. We fully embrace Microsoft's growth mindset, our team does our own explorations and encourages hackathons, enabling us not only to innovate but to also bring insights proactively to our customers.  What you'll do· Manipulate and analyze complex, high-volume, high-dimensionality data from varying sources using a variety of tools and data analysis techniques· Use data analysis, intuition, and creativity to research and discover answers to key questions around user engagement and business growth opportunities· Analyze usage data and identify useful cohorts to spot problems, important patterns, and growth opportunities· Present findings, recommendations and collaborate with key stakeholders at various management levels"}