{"jobID": "2618771986", "jobLocation": "San_Jose_CA", "jobTitle": "Part Time Jobs for University Students in Product Supply Chain", "companyRating": "4.0", "companyInfo": {"Website": "www.pg.com", "Headquarters": "Cincinnati, OH", "Size": "10000+ employees", "Founded": " 1837", "Type": " Company - Public (PG) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unilever, Colgate-Palmolive, Henkel"}, "estimatedSalary": "97000", "jobDescription": "Do you want to start a professional career while you're finishing your studies? We are seeking penultimate/last year students who are leaders who make things happen, analytical thinkers and problem solvers, and excellent communicators for a 6 month - 12 months’ internship at P&G; Costa Rica, which offers you the opportunity to test your knowledge and management abilities in real-life situations in a fast-moving consumer goods company.  As a Supply Chain Intern you’ll become an important member of one of our Planning Service Center Teams, working directly with different plants in Latin America. You will assume responsibility for your project(s), working closely with colleagues from Planning Service Center and other functions internally (e.g. Finance, Logistics, and Purchasing) and externally (costumers and suppliers).  Available areas: Demand Planning, Logistics positions, Supply Network Operations, Distribution Requirements Planning, International Trade Operations.If you’re a good fit, you’ll have:Active Student (bachelor/university degree) in your penultimate/last year of study (6-18 months to graduation)Intermediate English Skills (B2 or above in CEFR)If you’re a really good fit, you’ll also have:Evidence of passion and achievements in academic and/or non-academic activities.Short work experience, internships and studies abroadStrong verbal and writing communication skillsStrong Leadership Capabilities BenefitsReal Work Life experienceCompetitive SalaryLife InsurancePrivate Medical InsuranceFlexible Schedule (20-40 hours per week)Free transportationAccess to GYM, Cafeteria, Bank on site, wellness clubs and others"}