{"jobID": "2699544991", "jobLocation": "Cambridge_MA", "jobTitle": "Quantitative Data Analyst", "companyRating": "4.4", "companyInfo": {"Website": "www.jobcase.com", "Headquarters": "Cambridge, MA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "87000", "jobDescription": " One of the Boston area's fastest growing technology companies, Jobcase is the only social media site dedicated to empowering America's workforce. Jobcase.com is a platform for managing the future of work where members have one place to manage all things job-related, especially access to the knowledge, connections and wisdom of over 80 million other Jobcasers. Jobcase is an industry-affiliated partner of MIT's Computer Science and Artificial Intelligence Laboratory, CSAIL, and Jobcase technology also powers over 100 job sites in the Jobcase Network. Jobcase is a mission-driven company that is focused on harnessing the power of Machine Learning, Big Data and Blockchain technology to empower people in their worklife.Responsibilities:You’ll focus on database and online marketing economics and associated revenue drivers that maximize customer lifetime valueLeverage data generated by an array of analytical tools to determine performance and recommend changes to campaignsUse quantitative methods and tools including A/B testing, multivariate analysis (MVA), and optimization techniques to analyze and optimize campaign performanceConstantly hypothesize and experiment with changes to websites and marketing programs to increase business impactBe a brand leader with responsibility for improving the bottom lineSkills:Bachelors or Masters degree required with strong academic credentials in Mathematics, Economics, Engineering, Computer Science, or MarketingAdvanced Excel skills and proficiency with SQL are requirementsAnalytical and a tenacious problem solver. Quickly assimilates data and grasps the essence of where the data is leading us1+ years of experience in data analysis, statistical analysis and modelingExcellent written and interpersonal communications skillsPractical experience using R and/or TableauOnline marketing analytics, predictive analytics, or machine learning"}