{"jobID": "2805060473", "jobLocation": "Los_Angeles_CA", "jobTitle": "Loan Analyst", "companyRating": null, "companyInfo": {"Website": "www.marcusmillichap.com", "Headquarters": "Calabasas, CA", "Size": "1001 to 5000 employees", "Founded": " 1971", "Type": " Company - Public (MMI) ", "Industry": " Real Estate", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Gathering of property and borrower information to underwrite and reviewAnalyzing of financial statements and financial dataAnalyzing and summarizing historical property operationsPreparation of financial analysis of properties and marketsOrdering third party reports and reviewing reports upon receiptUnderwriting of all property typesCreating quote sheets, marketing packages, and proposals, and work collaboratively with other team members to provide debt quotes in a timely mannerSite visits and market research for potential financingsDeveloping and maintaining relationships with the analysts that work for lendersRequirementsBA or BS Degree1-2 years of Finance experienceProficient in Microsoft ExcelReal estate experience preferredExcellent team player, problem solver, and critical thinker Founded in 1971, Marcus & Millichap (NYSE: MMI) is a leading commercial real estate brokerage firm focusing exclusively on investment sales, financing, research, and advisory services, with more than 1,700 investment sales and financing professionals in offices throughout the United States and Canada and IPA Capital is MMI's institutional platform.  Marcus & Millichap and IPA close 4.5 transactions every business hour more than any other real estate investment brokerage firm in the nation. In 2016, the firm closed 8,995 transactions with a sales volume of approximately $42.3 billion.  \"At Institutional Property Advisors, our mission is to develop a long-term advisory relationship with major private and institutional investors to help them maximize total returns and meet their broader objectives.\"  Marcus & Millichap provides equal employment opportunities to all employees and applicants for employment without discrimination with regard to race, religious belief (including dress or grooming practices), color, sex, sex stereotype, pregnancy, childbirth or related medical conditions (including breast feeding), age, national origin, ancestry, sexual orientation, gender identification and expression, transgender status, physical or mental disability, medical condition, genetic characteristics, genetic information, family care, marital status, enrollment in any public assistance program, status as military, a veteran or qualified disabled veteran, status as an unpaid intern or volunteer, or any other classification protected by law. We also prohibit discrimination based on the perception that anyone has any of those characteristics, or is associated with a person who has or is perceived as having any of those characteristics. In addition to federal law requirements, Marcus & Millichap complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.SDL2017"}