{"jobID": "2830894953", "jobLocation": "San_Jose_CA", "jobTitle": "Food Service Manager", "companyRating": "3.1", "companyInfo": {"Website": "www.guckenheimer.com", "Headquarters": "San Mateo, CA", "Size": "1001 to 5000 employees", "Founded": " 1965", "Type": " Company - Private", "Industry": " Restaurants, Bars & Food Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "60000", "jobDescription": "CONNECTING PEOPLE THROUGH REAL FOOD Working at Guckenheimer as a Food Service Manager is not your typical foodservice experience. To start, our people are simply the best. Our fair, team-based culture encourages our teams to work hard, collaborate and have fun. Our chefs are compulsive creators and that energy flows throughout the company; everyone works together to improve, innovate and be the best. WHO WE’RE LOOKING FOR: Not only are you creating imaginative (and delicious!) menus each and every day, you also know how to make your customers feel at home. You are a people person and a culinary wizard all in one.  If food dreams keep you up at night, we encourage you to apply to our Food Service Manager position.SCOPE OF RESPONSIBILITY AND AUTHORITY:Site Managers are the representatives of Guckenheimer. They are responsible for the effective and efficient functioning of their operations within the guidelines established by the client organization as well as the Corporation. They are further responsible to provide the highest professional standards possible. They are given the authority necessary to accomplish these objectives.DUTIES AND RESPONSIBILITIESA. To satisfy the needs of the client and customer by providing high quality, cost effective food service.B. To develop, in conjunction with Guckenheimer food standard programs, attractive menus meeting the needs of the customers at that particular location.C. To interview and hire unit staff employees in accordance with corporate, client, Federal, State and local regulations.D. To participate and lead in establishing corporate employee training and development programs as instructed by Area Manager.E. To supervise, direct and schedule the activities of unit food service personnel following the tradition and values of the Guckenheimer organization.F. To maintain accurate and timely accounting and financial records.G. To prepare and monitor unit operating budgets.H. To maintain sanitary and safe operation in accordance with Federal, State and local health regulations. This includes following HACCP guidelines to prevent food borne illnesses.I. To establish effective communication channels with customers and client management which provides a system of feedback on the overall success of the operation. This feedback should lead to the implementation of operational improvements that better meet the needs of both clients and customers.J. Achieve the highest standards in food, utilizing recipes and programsJOB SKILLSFORECAST AND PLAN OPERATING NEEDS FOR FOOD AND SUPPLIESORDER, RECEIVE, AND INVENTORY OF ALL PRODUCTS AND SUPPLIESSUPERVISE FOOD PRODUCTIONENSURE PROPER MERCHANDISING OF FOOD AND FACILITIESMAINTAIN SERVICE STANDARDSMAINTAIN SANITARY CONDITIONS FOR EMPLOYEES AND CUSTOMERSMAINTAIN SAFE ENVIRONMENTS FOR EMPLOYEES AND CUSTOMERSINTERVIEW AND HIRE EMPLOYEESTRAIN EMPLOYEESSCHEDULING OF EMPLOYEESCOUNSEL AND DISCIPLINE EMPLOYEESCONDUCT PERFORMANCE APPRAISALSCONDUCT EMPLOYEE MEETINGSCOMPLETE AND REPORT PAYROLLMAINTAIN FINANCIAL RECORDS AND CONTROLSMAINTAIN RECORDS FOR COMPLIANCE WITH FEDERAL, STATE AND LOCAL REGULATIONSIMMEDIATE SUPERVISOR: Area Manager or Foodservice Director  Guckenheimer embraces equal opportunity employment  Guckenheimer participates in the E-Verify Program, as required by Law"}