{"jobID": "2824807101", "jobLocation": "New_York_NY", "jobTitle": "Account Executive (Financial Services)", "companyRating": null, "companyInfo": {"Website": "www.kinetica.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Company DescriptionWhen extreme data requires companies to act with unprecedented agility, Kinetica powers business in motion. Kinetica is the instant insight engine for the Extreme Data Economy. Across healthcare, energy, telecommunications, retail, and financial services, enterprises utilizing new technologies like connected devices, wearables, mobility, robotics, and more can leverage Kinetica for machine learning, deep learning, and advanced location-based analytics that are powering new services. Kineticas accelerated parallel computing brings thousands of GPU cores to address the unpredictability and complexity that result from extreme data.  For more information and trial downloads, visit kinetica.com or follow us on LinkedIn and Twitter.Job DescriptionKinetica is looking for an accomplished sales professional to add to our growing team. This person will be responsible for transforming named accounts into real-time enterprises within the NYC metropolitan area. We are more than doubling annual revenue year-over-year, and our enterprise customer list is growing at a steady clip. We are seeking proven high-tech sales executives who can help define and create an emerging market (GPUs).  The Enterprise Account Executive will develop, manage, and close sales opportunities at Fortune 500 accounts within the NYC metropolitan region. You will have the opportunity to over-achieve and earn uncapped commissions and accelerators. Your success will largely hinge on your ability to generate pipeline, qualify prospects early, drive successful technical evaluations and negotiate favorable commercial terms while aligned with appropriate executive sponsors.  Role and Responsibilities Develop and execute territory account plans to achieve (and ideally exceed) individual software quota responsibility.Lead multiple customer sales cycles and close effectively (you should be a hunter, not a sales order taker).Quickly learn new software product(s) and clearly communicate the value proposition.Manage effective working relationships with Technical Sales Engineers, Consulting Professionals, and Inside Sales Reps.Develop strong relationships with key decision makers, influencers, and partners within your territory.Successfully operate in a fast-moving, entrepreneurial environment without requiring a lot of overhead support (You can produce your own territory plan, presentations, quotes, etc.).Ability to travel within your assigned territory. QualificationsRequired Skills and Experience Proven track record of successfully selling new enterprise solutions (large software, big data, analytics solutions) and increasing revenue through new customer acquisition.8+ years of successful software sales experience with a focus on Technology and Solutions Selling of one or more of the following technology products: RDBMS, Middleware, Analytics, Data Warehouse, Business Intelligence, Big Data.Consistent track record of surpassing sales targets.Strong understanding of how to grow a greenfield territory.Excellent written and verbal communication skills combined with very strong presentation skills.Demonstrated ability to sell to CXO or line of business, successfully emphasizing business value versus product.Strong ability to connect with customers by actively listening to determine their needs.Bachelors degree Additional InformationAll your information will be kept confidential according to EEO guidelines."}