{"jobID": "2645520725", "jobLocation": "San_Jose_CA", "jobTitle": "Information Technology", "companyRating": "4.0", "companyInfo": {"Website": "www.navy.com", "Headquarters": "San Diego, CA", "Size": "1001 to 5000 employees", "Founded": " 1775", "Type": " Government", "Industry": " Government", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "51000", "jobDescription": " \"About This JobIn the Navy, information technology (IT) plays an important role in everything from electronic mail systems to shipboard control systems to Special Intelligence (SI) systems. Navy Information System Technicians (IT specialists) are Enlisted Sailors who engage in a broad range of responsibilities including network administration, database management and computer hardware and software implementation. Their responsibilities include:- Operating and maintaining Navy global satellite telecommunications systems- Serving as admin on mainframe computers and local and wide area networks- Implementing micro-computer systems throughout the Fleet- Serving as an important part of the Information Dominance Corps in its mission to gain a deep understanding of the inner workings of adversaries and developing unmatched knowledge of the battlespace during wartimeAs an Information Technology professional, you will help ensure the viability of essential communications links. Youll provide administrative support for the equipment that keeps records on everything from personnel training to health care to promotions. And offer technical support and training to fellow personnel. Your role may also include:- Writing programs to handle data for a wide variety of applications- Operating and coordinating automated networks, datalinks and circuits- Applying diagnostic, corrective and recovery techniques to information systems- Analyzing communication signals- Providing telecommunications and computer-related training and assistance- Performing preventive and corrective maintenance on state-of-the-art equipment- Operating and maintaining global satellite telecommunications systems- Working under the oversight of Information Professionals Officers (four-year degree required) who serve as managers of information networks.Information Systems Technicians serve in versatile roles both afloat and ashore on ships or at communications stations in the United States or overseas. Typical work involves mental analysis and problem solving and takes place in clean, air-conditioned electronic equipment space or computer rooms. Duties may be performed individually or as part of a team.\""}