{"jobID": "2803701650", "jobLocation": "San_Jose_CA", "jobTitle": "Senior Software Engineer", "companyRating": "4.0", "companyInfo": {"Website": "www.lookingglasscyber.com", "Headquarters": "Reston, VA", "Size": "201 to 500 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " FireEye"}, "estimatedSalary": "179000", "jobDescription": "LOOKINGGLASS CYBER SOLUTIONS is hiring for an experienced, dynamic and technically versed Senior Software Engineer. The chosen candidate is to join our Threat Mitigation engineering organization in San Jose, California.  The Senior Software Engineer position requires a thorough understanding of concepts and methodologies to perform assignments of significant difficulty. This position requires ability to perform in-depth analysis of highly complex client situations and the application of the principles of the discipline to satisfy client requirements  The applicant needs to be self-driven and have the ability to work in a team designing and developing high quality customer driven ready to ship solutions. A candidate has strong working knowledge of software lifecycles including the design, development, test & implementation of systems solutions touching on a wide variety of technologies. OVERVIEW OF POSITION:Develops systems and software solutions by studying information needs; studying systems flow, data usage, and work processes; investigating problem areas; write software meeting specifications and requirements;Documents and demonstrates complex solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code while working within the Agile Scrum software development methodology.Improves operations by conducting systems analysis; recommending changes in policies, processes and procedures.Updates job knowledge by studying state-of-the-art development tools, programming techniques, and computing equipment; participating in educational opportunities; reading professional publications; maintaining personal networks; participating in professional organizations.Accomplishes engineering and organization mission by completing related tasks as assigned.QUALIFYING REQUIREMENTS:B.S. or higher degree in Computer Science or Computer Engineering;10+ years of experience in developing complex system solutions;Linux system experience required;Virtualization experience in technologies such as KVM or Docker;Proficiency with C or similar programming language;Excellent verbal and written communication skills required;Strong collaboration skills are a must.DESIRED QUALIFICATIONS:Experience in relational database, MySQL and MariaDB preferableBackground in security and network productsUnderstanding of low level network protocols (TCP/IP, UDP, DNS, etc.) a plusExperience in Regex technologies and tools a plusExperience working in an Agile Scrum development environment strongly desired EOE/AA/M/F/Vet/Disability Employer"}