{"jobID": "2513422431", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Architect", "companyRating": null, "companyInfo": {"Website": "www.3blackdot.com", "Headquarters": "Los Angeles, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Arts, Entertainment & Recreation", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " 3BLACKDOT is looking for a Data Engineer Intern for the fall of 2017. This person would work alongside our Business Intelligence team to collect, store and process data. The ideal candidate will have familiarity with big data collection techniques, integration and curation of data from multiple sources. What we need you to do:Work closely with Business Intelligence team to implement best practices in collecting, tracking and storing data from various sourcesAutomate data ETL processBuild a distributed web crawler systemRequirementsWhat we are seeking in you:Currently enrolled in a M.S program with a degree in Computer science, Data Analysis, or the equivalent.1-2 years programming experience with Python 3, MySQLDeveloped and implemented at least 1 web crawler project (>1 million data entries)Knowledge of Amazon Web Service, including API Getaway, Lambda, Elastic Beanstalk, EC2, S3Working knowledge of distributed systems.Bonus points for:Experience with big data tools, i.e. PySpark, HIVEExperience with web development, i.e. Flask, ReactJSBeing a gamer and playing a lot of games The ideal candidate is excited by the prospect of working within a focused team that is passionate about innovating.  We value collaboration, communication and a burning desire for self-improvement. You should be self motivated and comfortable in a dynamic, energetic, and innovative environment that will empowered you to create and challenge you to learn. BenefitsTraining & DevelopmentFree Food & SnacksWork From HomeFlexible HoursGood MusicCool LocationDiversityEqual OpportunityFlat Team Structure"}