{"jobID": "2558963808", "jobLocation": "Boston_MA", "jobTitle": "Events Coordinator Intern (Summer 2018)", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Overview: IVY unites rising leaders and introduces them to the most inspiring people, ideas, and experiences in the world. Over the last three years, weve built a dynamic team of 100 rock-stars, and established IVY as the leading community of entrepreneurs, artists, and innovators in the USA. IVY currently has 20,000 members and 300,000 supporters, with seven chapters across New York City, Los Angeles, San Francisco, Chicago, Washington DC, Boston, and Miami (with plans to expand across 50 global cities). We host more than 1,000 experiences per year to bring our curriculum to life, including dinner and seminars with leading thinkers, art immersions, film screenings, global trips, and social impact activities. Led by two Harvard Business School graduates, we are backed by a renowned group of investors, including early investors in Facebook, Spotify, and Uber, as well as serial entrepreneurs with numerous successful exits.  We believe everyone has limitless potential, and our vision is for IVY to be the catalyst for achieving unprecedented human unity, progress, and fulfillment. Our curriculum enables rising leaders to elevate the world through experiential learning and collaborations focused on entrepreneurship, arts, social impact, policy, wellness, science, and philosophy. In the coming years, we will transform every global city into an immersive lifelong campus that provides everyone with the ideas, experiences, and connections they need to make a lasting positive impact on the world. The inspiration for IVY was strongly influenced by our Founders experiences at institutions like Harvard Business School, and the ways in which collegiate communities are able to accelerate ones social, professional, and intellectual development. We are obsessed with creating a global community that provides the same benefits throughout life. Job Description: Our network is growing rapidly and we are looking for highly entrepreneurial and motivated applicants for an internship support role for our Events Team. The ideal candidate is organized, enthusiastic, and able to see opportunities in obstacles.  Interns should be able to commit 20 hours per week, although there is room for more flexible hours/duration and off-site opportunities. Interns would have the opportunity to attend all IVY events, network with some of the top professionals in Boston, and be strongly considered for open full-time positions after graduation. To make the most of your internship, we encourage attendance at as many events as your schedule allows. Responsibilities:Event Planning & Execution Responsibilities:Continue to build database of venue contacts and informationResearch appropriate venues forCocktail parties, Lectures, Talks, Art Gallery Receptions, Film Screenings, etc.Assist with event concept building and theme developmentAttend and take notes at site visitsOrder, distribute, and manage all event materials and execution itemsSource, secure, and manage necessary staffing includingHostesses, Security, Photographer, DJ, Vendors, etc.Assist with menu and drink customization for eventsAssist with post-event recaps, data collection, and expense organizationAssist with all other event preparation, from inception to day-of execution to post-event wrap-up, including managing guest lists, bar tabs, moving event materials, and running the event on-siteQualifications:Effective organizational skillsOutstanding interpersonal and phone skillsEffective verbal and written communications skillsProficiency with MS Word, Google Drive, and ExcelLove of learning and pride in resourcefulness - if you don't know how to do something, you figure it out or you know who to askMotivated and hardworking, interested in start-up cultureAble to work two nights a week from 5 pm - 11 pm as needed, able to work two days a week for at least four hours in the officeMust be 21+ by the start of the internship periodPerks: This internship is unpaid. However, here are a few perks that come with the internship. Free entrance to all IVY produced eventsAccess to one of Boston's highest caliber professional networksAbility to attend some of Boston's most exciting eventsFirst-hand learning experience into the world of event planningFree snacks, unlimited coffee, and lunch once a week We are dedicated to getting people to dream bigger and do more together, and we believe that starts right here with our own team. We are committed to hiring individuals with a diversity of perspectives, backgrounds, and beliefs who can use their passion to help us build a world-changing community and thrive along the way. Join IVY for the chance to collaborate with an engaged team working provide learning and growth opportunities for all.  IVY is an Equal Opportunity Employer and does not discriminate on the basis of race, color, gender, sexual orientation, gender identity or expression, religion, disability, national origin, protected veteran status, age, or any other status protected by applicable national, federal, state, or local law."}