{"jobID": "2605386694", "jobLocation": "Boston_MA", "jobTitle": "Software Engineer Intern, Summer 2018", "companyRating": "3.8", "companyInfo": {"Website": "www.cra.com", "Headquarters": "Cambridge, MA", "Size": "51 to 200 employees", "Founded": " 1983", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "58000", "jobDescription": "Internship Description: We are looking for enthusiastic software developer interns for our Human Effectiveness, Socio-Cognitive Systems, Sensor Processing & Networking, and Decision Management divisions. We are seeking students with an interest in learning about and a successful academic background in the following areas: software engineering, computer science, cognitive engineering, artificial intelligence, or applied mathematics.  You will use a variety of technologies, such as cognitive modeling, graphical user interface (GUI) development, natural language processing, machine learning, probabilistic reasoning, data fusion, and planning and optimization. You will work in small project-oriented groups of scientists and software engineers to build working prototypes of intelligent decision-support tools. Requirements:U.S. CitizenshipProven proficiency in Java and a solid background in designing, programming, and documenting complex software systems.Demonstrated ability to rapidly learn new programming languages (Java, Perl, Prolog, Scala, C/C++), technologies, and programming tools.Demonstrated ability to rapidly learn new scripting languages (JavaScript, Ruby, Python)Candidates should have demonstrated capability to work independently as well as effectively within a team environment.Additional Skills:Mobile development/Web-Based Development/UI DesignBehavioral psychologyOntologyGame Development (e.g. Unity)Agent-based modelingInformation VisualizationAlgorithms (Artificial Intelligence, Optimization, Machine Learning)Natural language processingSemantic technologyAutonomous agentsProbabilistic modeling and reasoning (e.g., Bayesian networks)Cyber securityComputational economics or game theoryConcurrent/distributed application development, particularly with Scala"}