{"jobID": "2583176647", "jobLocation": "Santa_Monica_CA", "jobTitle": "Marketing Data Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.24seventalent.com", "Headquarters": "New York, NY", "Size": "201 to 500 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Aquent, The Creative Group, JBCStyle"}, "estimatedSalary": "54000", "jobDescription": "CompanyOverview: Ourclient is an innovative and well-known skincare line dedicated to bringingeffective and high-quality products to their consumers. This award winning company redefines thefuture of skincare by eliminating any invasive procedures or needles andbringing their beauty secrets to you at home. Founded by a couple of pioneers in the dermatological field, they arethe experts when it comes to skin and the trailblazers in at-home treatments. PositionOverview: Inthis role you will be responsible for analyzingdigital data sources, becoming intimately familiar with performance metricsacross our suite of digital products, drawing strategic insights and partneringwith team members to design optimization plans. Responsibilities: •Manage, organize and present data in a clear, concise and actionable format Work with analytics product manager to design& deliver proper measurement strategy from product through to business ROIIdentify gaps in data capture/integrity &partner; with technology teams to collaboratively implement enhancementsPartner with digital peers to develop annual,scientific-based channel/product KPIsManipulate and mine data across digitalproperties and from various sources to discover insightsPerform practical, action-oriented andcomprehensive data analysis from multiple data sources to aid in thedevelopment of digital marketing strategies Key Qualifications: • 3+ years of relatedexperience with web analytics tools, business strategy & digitaltechnologiesBachelor’s degree in business, marketing, mathor a related analytical field - MBA preferredAdvanced financial and statistical modelingskills and understanding of how they apply to web analytics and testingExperience analyzing large data sets generatedfrom multiple sources, including Web analytics, site crawls, and third-partydatabasesExpert-level proficiency in Google Analytics,Mixpanel & ExcelExperience with technical analyticsimplementation, including website tagging, campaign tracking &classification;, debugging, etc.) a plus"}