{"jobID": "2795972098", "jobLocation": "New_York_NY", "jobTitle": "Associate Consultant, Intern", "companyRating": null, "companyInfo": {"Website": "www.konradgroup.com", "Headquarters": "Toronto, Canada", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Konrad Group Konrad Group is a next generation digital consultancy. We are dedicated to solving complex business problems for our global clients with creative and forward-thinking solutions. Our employees enjoy a culture built on innovation and a commitment to creating best-in-class digital products in use by hundreds of millions of consumers around the world. We hire exceptionally smart, analytical, and hard working people who are lifelong learners. Associate Consultant, Intern As an Associate Consultant, Intern you will work in a multifaceted role and will work in collaboration with our Strategy, Project Management, User Experience (UX) Design, and Technology teams. You will support senior team members on our projects as you build up your experience in the role.  You enjoy solving complex business problems by creating smart, intuitive, and human-centered experiences. You have an excellent eye for detail, love to learn, and enjoy new challenges. ResponsibilitiesAssist in the creation of digital solutions for a variety of clients and verticalsGain expertise as a design and technology thought leader in a number of industriesSupport the broader team in understanding and interpreting our clients business challenges and goalsCollaborate with our Design and Technology teams to deliver elegant user experiencesGather information on our clients business processes, critical success factors, marketplace, and competitive standing through interviews and researchCoordinate and participate in user experience design thinking workshops, technology architecture workshops and, project planning and delivery activitiesStructure presentations, documentation, request for proposal responses, and other collateralSuccessful candidates will havePrevious experience in consulting, user experience and/or software development is an assetA demonstrable passion for and understanding of great user experiences and technologyExcellent writing competency and communication skillsA constant desire to learn more about the latest technology trendsStrong problem-solving abilitySelf-motivated individual with a desire to do their best every dayAbility to work in a team environment and independentlyComfortable with presenting and public speaking is an assetPerks and BenefitsFlexible Vacation PolicyHealth & Wellness ProgramsCulture of Learning & DevelopmentFully-Stocked Kitchens & LoungesNew Shiny Device UpgradesMonthly Socials & Team OutingsBonus Points: Have you taken any courses at BrainStation? A lot of our design and development best practices and processes are taught during our courses - make sure to highlight this experience in your cover letter if you have! Konrad Group is committed to maintaining a diverse work environment and is proud to be an equal opportunity employer. All qualified applicants, regardless of race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status will receive consideration for employment. If you have any accessibility requirements or concerns regarding the hiring process or employment with us, please notify us so we can provide suitable accommodation. While we sincerely appreciate all applications, only those candidates selected for an interview will be contacted."}