{"jobID": "2829879905", "jobLocation": "New_York_NY", "jobTitle": "Director of Digital Marketing", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Director of Digital MarketingVoIP/TelecommunicationsNew York City/NJ Metro AreaOur client continues to expand and is adding to their Management team a Director of Digital Marketing to be hands on and visionary leader of marketing and possibly sales. Our client is a fast growing VC backed, cloud-based phone service provider that serves over 25,000 SMB customers across the US. The Director of Digital Marketing will be a key player in scaling their business to the next level.Compensation: Base salary $120-$140k plus performance based bonus (based on experience), plus Comprehensive benefits (including free phone service and fullypaid healthcare benefits including dental).Position Overview:The ideal candidate must have a proven track record of solid marketing success with experience at a high growth, VC funded company with very strong e-commerce and digital marketing experience. A few years of management experience of a small and growing team, some experience working with agencies and a team player that blends solid execution with strategic vision and hands on leadership.Responsibilities: ·  Successfully execute the digital marketing strategy from campaign launch to measurement that will meet the company’s current and future sales goals and objectives  ·  Lead, motivate, develop and manage a small team of marketing professionals  ·  Manage and drive website strategy, optimization, e-commerce, shopping cart and customer journey  ·  Inbound and outbound marketing strategy development  ·  Manage digital marketing and online media campaigns  ·  Manage partner agency relationships  ·  Social Media and Customer engagement strategy and management  ·  Creation of some collateral marketing materials on an ongoing basis  ·  Metrics Focused: Data analytics, campaign metrics and management/board level reporting Qualifications: ·  7+ years experience in various marketing roles with successful career trajectory.  ·  A few years in marketing roles for a technology company with a SaaS Solution focused on the SMB market-A Must · 3+ years experience in a manager/director role, preferably at a VC backed or fast growing tech. co.  ·  Strong background of e-commerce/internet marketing targeted at B2B and commercial customers  ·  Shopping cart management and optimization experience with measureable success  ·  Experience working in a fast-paced, high growth , multi-cultural team oriented environment  ·  Superb presentation and communication skills and experience preparing for board meetings  ·  Prior experience managing or working close with sales and account mangers-A plusEducation: Bachelor’s degree in relevant discipline, MBA or MS in Marketing-strongly preferredLocation: New York City/NJ Metro Area with possibility of some remote/virtual work Travel: Up to 20% Reports to: CEO Direct Reports: A small team of marketing professionals and external agency partners"}