{"jobID": "2830871855", "jobLocation": "Boston_MA", "jobTitle": "Patient Care Technician", "companyRating": "3.7", "companyInfo": {"Website": "jobs.bidmc.org", "Headquarters": "Boston, MA", "Size": "10000+ employees", "Founded": " 1996", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "16", "jobDescription": "Department Description: Farr 6 Neuroscience Intermediate Care Unit (NIMU) is a 14 bed adult neuroscience specialty unit for patients with highly acute neuroscience diagnosis. Patients include those with stroke, neuromuscular illness, TBI, or recent neurosurgery. The unit is located just steps away from the Neuroscience ICU, and admits neuroscience patients from the ICU, ED, PACU, or general floor Job Location: Boston, MA Req ID: 25790BR Job Summary: Collaborates with a nursing team to provide quality patient care. Essential Responsibilities:Collaborates with a registered nurse on developing a patient's care plan.Develops and maintains competencies as delegated by a registered nurse, including sterile dressing changes.Maintains the safety of patients who have been identified at risk for preventable injury by the implementation of nursing safety interventions or the use of protective devices/equipment under the supervision of the registered nurse.Reports all patient activity to the registered nurse in a timely manner.Required Qualifications:High School diploma or GED required.0-1 years related work experience required.Patient care experience required through any of the following areas:  CNA (or LNA), MA, EMT, PCT certificate or currently enrolled nursing student who has completed at least one clinical rotation.  Completion of BIDMC in-house training program. Allied Health and Physician Assistant program candidates. Home Health Aide.Basic familiarity with computers. Ability to navigate at a basic level within web-based applications.Competencies:Decision Making: Ability to make decisions that are based on specific instructions, standard practices and established procedures which generally require little or no supervision.Problem Solving: Ability to address problems that are routine, somewhat repetitive and generally solved by following clear directions and procedures and by identifying opportunities for process improvements.Independence of Action: Ability to follow general instructions and procedures as provided. Work is monitored by supervisor/manager.Written Communications: Ability to read, and write in English in order to understand basic safety instructions and take direction from supervisors; communicate effectively with patients, families and other medical center staff; and respond to basic questions.Oral Communications: Ability to understand spoken English in order to follow basic safety instructions and take direction from supervisors; communicate effectively in basic English with patients, families and medical center staff in response to routine questions.Knowledge: Ability to demonstrate basic knowledge of fundamental concepts, practices and procedures with the ability to use them in routine situations. Specialized knowledge not required.Team Work: Ability to interact respectfully with other employees, professional staff and/or external contacts to offer ideas, identify issues, obtain information or deliver services.Customer Service: Ability to demonstrate a positive attitude and respond to requests in a timely and respectful manner.Age based Competencies: Employees in this job must be competent to provide patient care to the following age groups: Neonatal:Birth to 6 months, Young adult: 16-30 years, Middle Age: 30 - 60 years, Elderly: 60 -. Physical Nature of the Job: Medium work: Exerting up to 50 pounds of force occasionally and or up to 20 pounds of force frequently. Job is physical in nature and employee needs to stand and/or move around through the majority of their shift."}