{"jobID": "2771458273", "jobLocation": "San_Francisco_CA", "jobTitle": "Biological Data Scientist / Statistician", "companyRating": null, "companyInfo": {"Website": "www.foresitecapital.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Foresite Capital is a multi-stage healthcare and life sciences investment firm that applies rigorous scientific and data-driven approaches to investment analysis. The firm has $2 billion under management. Foresite Capital takes a collaborative approach to investing with its portfolio companies by providing a multidisciplinary team of scientists, engineers, analysts, and clinicians who understand the unique business models in healthcare in addition to capital. The company aims to address areas of great unmet clinical need over the long term by funding promising healthcare and life sciences businesses at all stages of their life cycles. Its portfolio also emphasizes companies that are employing the tools of data science and machine intelligence in healthcare. Foresite Capital is based in San Francisco with an office in New York. If youre a data scientist with a strong background in statistics and biology, lets talk.Role Foresite Capitals data science team are the companys internal experts on the interface of biology and data science, engaging in applied research to advance the standard of biological data science, providing insights to drive the company's investment decisions, and collaborating with our portfolio companies. We develop methods and practices that set standards for rigor in the field, combining cutting-edge techniques with biological understanding and statistical rigor. We are looking for biologically-minded data scientists to bring their skills to our team. We offer a flexible work environment, a diverse set of projects, and a best-in-class peer group to learn from. This is a great opportunity to tackle a unique set of problems while shaping the future of healthcare.Responsibilities Analyze large-scale biological data to produce novel, high-confidence insights Collaborate with portfolio companies to solve core quantitative and scientific problems Evaluate potential investments through deep technical diligence Develop methods that combine cutting-edge machine learning techniques with deep statistical rigor Distribute tools and results through software and publicationsQualifications PhD or equivalent in a quantitative field (e.g., statistics, computer science, computational biology, bioinformatics, or mathematics) 5-10 years of relevant work experience, including postdoctoral fellowships and relevant engagements outside of class work during PhD. Some industry experience preferred but not essential. Experience with statistical software (e.g., R, pandas, sklearn), scripting languages (e.g., Python), and database languages (e.g., SQL). Experience with C/C++ relevant but not essential. Applied experience with machine learning on biological datasets, including deep engagement with biological subject matter and validation. Experience with human genetics, functional genomics, and cellular phenotyping particularly relevant. Rigorous statistical intuition, deep understanding of core statistical principles, and extensive experience with core methods (e.g., linear regression, GLMs, dimensionality reduction, tree-based models, bootstrapping, maximum likelihood estimation, and Bayesian modeling) Track record of published collaborative research in biology or related fields preferred Foresite Capital is an equal opportunity employer. We thrive on diversity and collaboration.  Please submit a complete CV, not an abbreviated résumé."}