{"jobID": "2829909765", "jobLocation": "Fremont_CA", "jobTitle": "Auto Body Technician", "companyRating": null, "companyInfo": {"Website": "www.calibercollision.com", "Headquarters": "Lewisville, TX", "Size": "5001 to 10000 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Caliber Collision is the largest, fastest-growing collision repair company in America. Right now, we're looking for highly talented, dedicated, and quality-focused teammates to help restore the rhythm of our customers' lives.  To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to ensure individuals with disabilities to perform the essential functions. Complete disassembly of vehicle in order to assist Service Advisor with preparing a 100% Repair PlanEnsure all needed repairs identified to eliminate supplements and minimize repair timePlan work procedure: follow work order for all operations listedRemove upholstery, accessories, electrical and hydraulic window and seat operating equipment and trim to gain access to damaged area of vehicle if needed. Store parts on carts or cover to eliminate potential damageMend damaged body and fenders by hammering out or filling in dents and welding broken parts; insure all gaps and fits are to industry standardsOperate a variety of hand and power tools (e.g. welder, soldering equipment, cutting torch, blocks, hammers, wrenches, sander, spray guns, etc.)Fill depressions with body fillerRemove damaged fenders, panels and grills; and bolts or welds replacement parts in position and reassemble after parts are painted; insure all gaps and fills are to industry standardsFile, grind, and sand repaired surfaces with 120-grit paper before turning vehicle over to the Paint Dept.Aim headlamps and repair or replace defective partsInspect and test drive repaired vehicles to check for compliance with safety and quality standardsAssist Service Advisors in assessing damage to vehicles prior to repairComply with all Caliber safety rules, guidelines and standardsPerform other related duties as assigned to ensure an efficient and effective repair"}