{"jobID": "2682587175", "jobLocation": "Seattle_WA", "jobTitle": "Intern", "companyRating": null, "companyInfo": {"Website": "company.here.com/here", "Headquarters": "Eindhoven, Netherlands", "Size": "5001 to 10000 employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Google, TomTom, Apple"}, "estimatedSalary": null, "jobDescription": " Who are we?HERE Technologies, the Open Location Platform company, enables people, enterprises and cities to harness the power of location. By making sense of the world through the lens of location we empower our customers to achieve better outcomes – from helping a city manage its infrastructure or an enterprise optimize its assets to delivering drivers to their destination safely. To learn more about HERE, including our new generation of cloud-based location platform services, visit http://360.here.com.  The Open Location Platform Big Data Processing team believes the value of a platform is directly related to the convenience of the platform. Our goal is to enable developers to easily conflate HERE Reality Index content with their own data using off the shelf batch or stream processing technologies. We will achieve this by providing a self-serve Apache Spark and Apache Flink managed cloud service for developers to run their batch or stream location based data processing jobs.  We are looking for a full time intern with strong background in Computer Science or Software Engineering to join the Platform Big Data Processing team in Summer 2018. The candidate must be able to work effectively in a multidisciplinary team environment focused on innovation and be able to learn and integrate complementary technologies outside their specific area of expertise.What's the role? Work closely with engineers to design, implement, test and deploy software projects.Participate in design discussions and code reviews of your work.Participate in agile scrum ceremonies like daily standup, sprint planning, sprint review and retrospective.Presenting and demonstrating your work to co-workers. Who are you? Enrolled in an undergraduate Computer Science or equivalent college program.Developed software with Java or Scala.Knowledge of basic data structures and algorithms.Familiarity with Web Services, HTTP and JSON.Knowledge of Spark or Flink big data processing frameworks is nice to have.AWS experience is nice to have.Great communicator, both in spoken and written form.Willing to learn and take on challenges. HERE is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, age, gender identity, sexual orientation, marital status, parental status, religion, sex, national origin, disability, veteran status, and other legally protected characteristics."}