{"jobID": "2610743913", "jobLocation": "New_York_NY", "jobTitle": "Attending Psychiatrist - Psych ER", "companyRating": "3.3", "companyInfo": {"Website": "www.pagny.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "196000", "jobDescription": " Overview Physician Affiliate Group of New York (PAGNY) is comprised of nearly 4,000 physicians and healthcare professionals who provide services to NYC Health + Hospitals, the largest public health system in the United States. Our practitioners are highly skilled professionals with outstanding credentials who deliver the highest level of quality healthcare to patients throughout New York City. NYC Health + Hospitals/North Central Bronx is a modern, state-of-the-art community hospital located in an attractive and safe residential Bronx neighborhood just 20 minutes north of Manhattan.  It is a North Bronx Healthcare Network hospital affiliated with Jacobi Medical Center and a teaching site and academic affiliate of the Albert Einstein College of Medicine. It offers a full continuum of acute care inpatient and outpatient services in diverse medical and surgical specialties , including psychiatry.  The department of Pychiatry has 70 adult and geriatric acute inpatient beds, a partial hospital program, psychiatric emergency and consultation-liaison services, an adult ambulatory practice, and a community-based assertive community treatment program. The department employs evidenced-based best practices in providing the highest quality care to its patients, in a patient-centered approach that is respectful of their individuality, culture, and community. Responsibilities The Staff Psychiatrist will have responsibility for clinical and educational activities on a 24-bed acute adult inpatient unit, including participation in a multidisciplinary treatment team.  He/She will participate in activities related to clinical care and documentation of care, performance improvement regulatory compliance and student education.  He/She will report to their Unit Chief and Inpatient Director.  He/She will also participate in our innovative integrative care activities. QualificationsBoard Certified in Adult Psychiatry (or Board Eligible & Within 5 years of completing residency training).Graduated from an ACGME or AOA approved medical school.Completion of an approved Psychiatry residency training program.Eligible for NYS license and DEA.EOE M/F/D/V"}