{"jobID": "2791826136", "jobLocation": "San_Francisco_CA", "jobTitle": "Lead Data Scientist", "companyRating": "5.0", "companyInfo": {"Website": "www.philo.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "139000", "jobDescription": "Philo is a small and ambitious San Francisco-based startup building the future of television. We're an underdog fighting for a seat at the table with the big cable providers. Our product lets you watch your favorite shows on all the devices you care about with intelligent search, insightful discovery, and effortless sharing. Our leadership consists of founding team members from Facebook and Meraki, and brings deep industry experience to the team. Philo is backed by NEA and industry partners including HBO, Discovery, AMC, A&E;, and Viacom. Necessity is the mother of invention Philo was born in a Harvard dorm room, where cable TV wasnt offered and the over-the-air broadcast couldnt penetrate the walls of the 300-year-old brick residence halls. The founders of Philo wanted to watch TV around campus, so they wrapped their room in aluminum foil to boost the signal, and connected it to a server to stream it over the campus network. Weve moved from aluminum foil to silicon Our technology may have changed, but our mission is the same. At Philo, we are building the TV experience we wanted for ourselves. Today, hundreds of thousands of students can use Philo to watch all the live and recorded television they love on all of their favorite devices, and thats just the beginning. Company and Culture Were a small team that puts our product experience first. We foster a flexible work environment that is supportive but allows for autonomy so that everyone on the team can help us build towards our vision. Philo engineers own what they build from start to finish. We ship to production multiple times per day and keep unnecessary process to a minimum so we can maintain our pace of rapid development. We value pragmatism, having pride in our work, and deep transparency at all levels. Qualifications Philo is seeking a Data/Analytics Lead with demonstrated experience in statistical modeling, SQL, and independently developing data driven insights. This data science enthusiast would have the opportunity to leverage massive structured, unstructured, transactional and real-time data sets from a variety of sources, analyze financial and customer usage patterns, and make actionable recommendations using statistics, business understanding and common sense. The resulting insights will be a critical component of Philos decision making around product innovation and marketing spend.  Responsibilities:Collaborate with the engineering team on data structure to support advanced analysis of customer acquisition and retention efforts (influenced by product features and marketing activity)Collaborate on KPIs, own and manage regular reports and scorecards around funnel performance and marketing initiatives, some include: LTV measurement and optimizing CACDesign, build, and maintain automated dashboards that connect data from internal and external data sources to support reporting, data discovery and statistical analysis that inform product priorities and marketing decisionsDevelop customer propensity models, with an emphasis on logistic regression to understand key drivers of high value customer behavior and support personalization initiativesMaintain standards for tracking and measurementDeliver quick insights on ad hoc projects and analyses as necessaryKey Qualifications:Passionately analytical and innately curious creative thinkerSolid technical database knowledge and experience optimizing SQL queries on large data setsExperience in logistic regression, with preference for experience also applying other modeling techniques and data classification (e.g. cluster, factor, decision trees, etc.)Ability to explain and present analytical methodology and results to non-technical audiencesHands-on experience with statistical (e.g. SAS, R, Python)3-5+ years experience in business and data analytics after graduationBS or MS degree in Statistics, Math, Data Science, CS or related disciplineNice-to-have:Hands-on experience with BI and visualization tools (e.g. Tableau, Periscope, Domo)Programming skills, in particular experience with statistical libraries in pythonProjected Start Date: ASAPStatus: Full-time Location: San Francisco, CA Compensation: Includes competitive salary, company stock options and health benefits.  Philo is an equal-opportunity employer."}