{"jobID": "2796369959", "jobLocation": "Redmond_WA", "jobTitle": "SENIOR DATA SCIENTIST", "companyRating": "4.0", "companyInfo": {"Website": "www.eurest-usa.com", "Headquarters": "Charlotte, NC", "Size": "10000+ employees", "Founded": " 1974", "Type": " Subsidiary or Business Segment", "Industry": " Restaurants, Bars & Food Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "148000", "jobDescription": "Position Title: Senior Data ScientistHay Grade 17Reports To: Business Intelligence Solutions Architect As the leader in business and industry dining, Eurest is the company to join if you want a rewarding career packed with limitless opportunities. We feed the employees of the nation's largest and most-prestigious companies -- in every state and across all industries. As a member of Eurest's leadership and professional support team, you will help our 16,000 chefs, and in-unit associates excel as they deliver world-class meals in corporate cafes and executive dining rooms with on-site catering through vending innovations and more.  Our company is innovative, high performing and fast growing. Our teammates are enthusiastic, committed to quality and thrive on consistently delivering unparalleled results. And did we mention we work with exciting companies and at interesting locations? Come grow your career with Eurest. This position is eligible for an Employee Referral Bonus! If you know someone that is qualified for this role, please use the “job search” in MyOpportunity to refer your referral and email them a link to apply. Your referral will be able to apply by clicking the link in the email then you can check the status under Careers in MyOpportunity by clicking on “referral tracking.” For Employee Referral guidelines, FAQs and the Compass Employee Referral Policy, emailMyReferral@compass-usa.com. Job Summary  The Senior Data Scientist, Business Intelligence is responsible for synthesizing and leveraging data using a variety of advanced tools and methodologies to enhance the business’ capabilities for overall, data-driven, goal achievement. This role is instrumental in helping the business continue to remain competitive and fulfill the expectations of an extremely data-driven client on the cutting edge of technology within the industry.  The role will be exposed to a wide spectrum of high visibility projects in areas as diverse as sales and marketing effectiveness, competitive excellence, operational efficiency, sourcing and procurement, waste reduction, supply-chain optimization, and financial analysis.  You will work in a multidisciplinary team and oversee junior data scientists in exploring, connecting and mining internal data sources and will develop data models using algorithms for pattern detection and forecasting. In this position you will be managing projects that use advanced analytics techniques, such as predictive modeling, computer vision, machine learning, and statistical analysis, to develop solutions that help deliver significant value to the organization’s businesses vision and functions Key Responsibilities:Design experiments, test hypotheses, and build modelsIdentify what data is available and relevant, including internal and external data sources, leveraging new and existing data collection processesConduct advanced data analytics and create highly complex design algorithmsApplies advanced statistical and predictive modeling techniques to build, maintain, and improve on multiple decision systemsCollaborate with organization subject matter experts to determine relevant sources of informationMake strategic recommendations regarding, and work with IT team on, data collection, integration, and retention requirements incorporating business requirements and knowledge of best practicesPreferred Qualifications:Master’s Degree in Statistics, Mathematics, or related quantitative field, with Ph.D. preferred7+ years’ practical experience with data processing, database programming, manipulating data sets, and building statistical models5+ years’ experience with designing, optimizing, and implementing advanced machine learning algorithms and training modelsComprehensive understanding of machine learning techniques and algorithms (such as clustering, k-NN, Naive Bayes, SVM, Decision Forests, reinforcement learning, and artificial neural networks), and their real-world advantages/drawbacksExperience with the Microsoft Cognitive AI stack, including computer vision, text analysis, and NLPSuperior ability with R, Python, C#, and SQLApply to Eurest today! Eurest is a member of Compass Group USA Click here to Learn More about the Compass Story   Compass Group is an equal opportunity employer. At Compass, we are committed to treating all Applicants and Associates fairly based on their abilities, achievements, and experience without regard to race, national origin, sex, age, disability, veteran status, sexual orientation, gender identity, or any other classification protected by law.Req ID: 173955  Eurest   ANNMARIE B MCSHEA   SALARIED EXEMPT "}