{"jobID": "2710111999", "jobLocation": "Burlington_MA", "jobTitle": "Financial Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.crd.com", "Headquarters": "Burlington, MA", "Size": "501 to 1000 employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " BlackRock, Bloomberg L.P."}, "estimatedSalary": "75000", "jobDescription": "Financial Analyst The primary purposes of this position is to prepare financial materials and perform analysis for a variety of complex processes supporting budgeting, forecasting and long term financial modeling and planning of a global technology organization.  Essential Functions: Perform multiple financial and scenario analysis.Develop financial models and scenario analysis to support valuation, planning, and forecasting.Assist in managing the annual budget process.Assist in developing short and long-term forecasting capabilities.Support the annual budgeting and monthly forecasting processes, including detailed analytics and financial recommendations related to the assumption and goal setting process. Produce and/or enhance internal management reporting and analyses both on a regularly scheduled and ad-hoc basis. Perform periodic operational and financial reporting and analysis.Perform analysis to support the monthly and quarterly metrics reporting process and distribution to key stakeholders.Logically structure complex issues and communicate conclusions and alternatives to a range of senior executives including the CFO.Research large amounts of data that requires consolidation to allow for concise analysis.Anticipate financial planning needs by providing monthly, quarterly and year-end reporting and analysis as needed.Utilize current documentation and tools/methodologies and recommend new solutions to improve/automate existing and new processes and support new initiatives. Requirements and Qualifications: A BA/BS degree required, preferably in Finance, Accounting, Business Administration, or another related major.A minimum of 0-3 years of progressively responsible experience in business, finance or similar relevant experience.Previous experience as an Intern or a Co-op is desirable if there is no post-graduate related work experience.Demonstrated proficiency in a quantitatively-heavy position.Strong fluency with Excel formulas and logic functions.Basic understanding of financial statements.Data driven and detail oriented.Strong quantitative and analytical competency.Self-starter with excellent interpersonal communication as well as written skills.Demonstrated analytical and problem-solving skills.Demonstrated ability to interact effectively with senior management.Ability to manage multiple, simultaneous priorities.Proven organizational skills with attention to detail.Ability to achieve results without close supervision.Self-motivated with the ability to operate independently and also has the strong desire to work as a member of a team.Demonstrated practical, hands-on, “can-do” approach, and the ability to work efficiently and creatively.Travel is unlikely to be required.Flexibility with schedule and ability to work beyond regular business hours."}