{"jobID": "2724699923", "jobLocation": "Fremont_CA", "jobTitle": "Outside Sales Associate (Base Salary Plus Commission)", "companyRating": null, "companyInfo": {"Website": "www.ontariorefrigeration.com", "Headquarters": "Ontario, CA", "Size": "51 to 200 employees", "Founded": " 1958", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "If you are seeking a career with a company that provides a supportive, stable, and fun, work environment—and a sales structure that compensates individuals according to their efforts, then Ontario Refrigeration may be the place for you.In this our 60th year, we have a proven approach to attract new customers, and an experienced sales management staff to provide coaching and ensure success.Job DescriptionWe seek an ambitious Outside Sales Associate to join our Sales Team in Fremont. You will be responsible for attracting new customers, driving sales, and office growth. Target market is existing commercial buildings, and position requires a resourceful sales professional.$55,000 starting salary plus commission, vacation, holidays, 401K with 30% match, medical, dental, life, company vehicle, and Hawaiian vacations! First year $100k+ earning potential!We are California’s premier provider of HVAC services and are looking for someone who is ready to jump in, and help our fast-growing business grow even faster.Job Functions and Responsibilities:Call-on and develop relationships with commercial building owners and managers. Generate and present cost-effective HVAC maintenance programs to qualified prospects—and secure annual maintenance agreements. Continually enhance sales skills and industry knowledge, to promote professional image. Coordinate with operations to ensure the delivery of legendary service.Required Experience:2+ years of successful outside sales experienceEmail your resume to luke@ontref.com AND call (909) 509-8849 to leave a voicemail for Luke describing why this position may be right for you! We look forward to hearing from you!"}