{"jobID": "2698794360", "jobLocation": "San_Jose_CA", "jobTitle": "Nursery Level II - RN II", "companyRating": "2.6", "companyInfo": {"Website": "www.regionalmedicalsanjose.com", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 1965", "Type": " Hospital", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "65", "jobDescription": "Regional Medical Center of San Jose is an acute care  hospital with a Level II Trauma Center. The hospital provides a host of  technologically-advanced services including Cardiovascular,  Neuro, Orthopedic,  Bariatric and General Surgery, Interventional Pulmonology  and services for Women. Regional holds Joint Commission  advanced certification as a Comprehensive Stroke Center and  a Get with the Guidelines- Stroke Gold Plus Performance  Achievement Award from the American Heart Association/American Stroke  Association. It is a certified Chest Pain Center,  county-designated STEMI (heart attack) Receiving Center, designated Lung Cancer  Screening Center, a member of Extracorporeal Life Support  Organization (ECMO) and is certified by The Joint Commission in  Sepsis care.The Nursery / NICU Nursing team are dedicated, healthcare providers with excellent services for patients at San Jose Regional Medical Center. Interested in joining this team? Apply online now.Schedule: .6 (24 Hours per week) Shift: Nights with Rotating WeekendsPOSITION SUMMARY: Coordinates total nursing care for acutely ill NICU patients. Primary patient population served include, but not limited to, those admitted for prematurity, sepsis, respiratory distress, neonatal substance exposure, hyperbilirubinemia, genetic syndromes. An RN II functions as an experienced clinically competent nurse who provides safe and effective nursing care and may work as a clinical preceptor in providing mentorship and guidance to new employees. Participates in patient/family teaching and provides leadership by working cooperatively with members of the health care team to maintain standards for professional nursing practice in the clinical setting. Participates in organizational and unit based  quality improvement activities. LICENSE/CERTIFICATION REQUIREMENTS:Minimum: CA RN, BCLS and NRPPreferred: RNC, PALSEXPERIENCE REQUIREMENTS:Minimum: 1 to 2 years of acute care nursing in a Level II NICU setting.Preferred: Experience in Level III NICU settingEDUCATION REQUIREMENTS:Minimum: High School Graduate or equivalent. Graduate of an accredited nursing program.KNOWLEDGE/SKILLS:Minimum: Ability to use critical thinking skills and prioritize aspects of patient care; possess good interpersonal and intrapersonal communication skills. Ability to calculate medication dosages and safely administer medications."}