{"jobID": "2826532386", "jobLocation": "New_York_NY", "jobTitle": "Assistant Cook - Hawaii Cruise Ship (Shipboard)", "companyRating": "3.4", "companyInfo": {"Website": "www.ncl.com", "Headquarters": "Miami, FL", "Size": "10000+ employees", "Founded": " 1966", "Type": " Company - Public (NCLH) ", "Industry": " Travel & Tourism", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Royal Caribbean Cruises, Carnival, Mark Steel"}, "estimatedSalary": "10", "jobDescription": " Assistant Cook - Pride of America APPLY ONLINE If you’re interested to be considered for this position, please apply with the link provided to get started. All candidates must complete an on-line application to be considered. https://career8.successfactors.com/sfcareer/jobreqcareerpvt?jobId=20748&company;=NCLPROD&username;=&st;=9D573AA24351E8EE4C46A2650D26742379DA4696THE BRANDS OF NCLH Norwegian Cruise Line Holdings Ltd. is a diversified cruise operator of leading global cruise lines spanning market segments from contemporary to luxury under the brands Norwegian Cruise Line®, Oceania Cruises® and Regent Seven Seas Cruises®.  www.ncl.com www.oceaniacruises.com www.rssc.com BENEFITS OF WORKING AT SEA ·  You can save $$$!! (bi-weekly pay / direct deposit).  ·  Room & board is covered. Flights & transportation are covered.  ·  Linens, towels are provided. Uniforms & laundry service are provided.  ·  Opportunity to live and work in a multi-cultural environment.  ·  Internal opportunities to advance your career.  ·  You will gain invaluable life skills while working at sea.  o  Safety skills & awareness  o  Unique training & learning opportunities  o  Mariner skills & credentials  o  Teamwork & communication *** PLEASE READ PRIOR TO COMPLETING THE APPLICATION***PER UNITED STATES COAST GUARD REGULATIONS, CREW MEMBERS ONBOARD THE PRIDE OF AMERICA MUST BE UNITED STATED CITIZENS OR PERMANENT RESIDENTS RESIDENT ALIENS(GREEN CARD HOLDERS). FAILURE TO MEET THIS REQUIREMENT WILL AUTOMATICALLY DISQUALIFY YOU FOR EMPLOYMENT CONSIDERATION ONBOARD THE PRIDE OF AMERICA. Are you looking for a fantastic job on the high seas? Apply to live and work on Norwegian Cruise Line M/S Pride of America which has a year-round Hawaiian itinerary. Inaugurated in 2005, the Pride of America is the only large passenger US-flagged vessel. To take a 360 virtual tour of the ship, click here: http://bit.ly/1TGOyGW POSITION SUMMARY / ESSENTIAL FUNCTIONS The Assistant Cook is responsible for delivering products of the highest quality in terms of freshness, taste, and consistency, with strict adherence to USPH/FDA guidelines. Assistant Cooks are responsible for batch, a la minute, and line cooking techniques. He/she reports directly to the Chef Tournant. The Assistant Cook is responsible for following all standardized recipes and notifying the Chef Tournant or Cook of any shortages or discrepancies in products or ingredients. The Assistant Cook is responsible for keeping their immediate work area clean at all times.  ·  Maintains an organized and efficient flow of production, with regards to changes in forecasts and menus  ·  Responsible for mise-en-place, and food service for station  ·  Consistently checks temperatures in foods and follows proper procedures in regards to chilling, re-heating, and holding food.  ·  Reports waste to supervisors on a daily basis  ·  Checks station upon arrival to determine status of outstanding safety, or equipment issues  ·  Checks station prior to leaving to ensure cleanliness, proper disposal/removal of food, and proper storing and labeling  ·  Maintains USPH/FDA standards for station  ·  Performs other related duties as assigned or as directed. The omission of specific duties does not preclude the supervisor from assigning duties that are logically related to the position.  ·  Must be familiar with the Safety and Environmental Protection Policy and the SEMS, and carry out the policies and procedures appropriate for his/her position. QUALIFICATIONS / REQUIREMENTS ·  Advanced level English verbal and writing skills, including the proper use of English grammar is required.  ·  Minimum one year experience preparing food in the following methods is required: roast, broil, braise, sauté, fry and grill (including breakfast items  ·  Minimum one year experience working in a food production and/or line capacity is required.  ·  Minimum one year experience in a high volume hot production operation is required. Formal culinary training may substitute at an equivalent rate  ·  Minimum of six months experience in basic cooking techniques and skills, such as knife skills, basic cuts, and all cooking methods is required.  ·  Minimum of six months experience in using/operating basic culinary equipment such as a steamer, fryer, kettles, and robocoup is required. EDUCATION ·  High School Diploma or foreign equivalent is required.  ·  Two year degree from a recognized culinary education establishment or foreign equivalency is preferred. REQUIRED ATTRIBUTES ·  Proactive, Team Player, Problem Solver  ·  Passionate about hospitality and customer service driven  ·  Must have a professional appearance and good hygiene  ·  Able to work 7 days a week  ·  Ability to live in close quarters, share limited space with other cabin-mates  ·  The U.S. Coast Guard (USCG) requires all crew members employed with NCL America aboard the Pride of America to hold a Merchant Mariner Credential (MMC). In order to qualify for a MMC, applicants must demonstrate specific physical abilities necessary to perform shipboard duties per USCG guidelines (COMPDTPUB 16700.4 NVIC 04-8). Shall have a Body Mass Index (BMI) of 40.0 or less. Blood Pressure as per USCG a maximum 160/100. ABOUT NORWEGIAN CRUISE LINE Norwegian celebrates a corporate history of industry firsts, including being the first cruise line to offer weekly departures to the Caribbean from Miami and the first to offer youth-specific onboard programs and also onboard WiFi. In an ever-changing world, Norwegian remains a leader in the industry for providing premium guest experiences on cruises across the globe. Nobody does it better. Norwegian introduced Freestyle Cruising, which revolutionized the industry by giving guests more freedom and flexibility on a relaxed, resort-style cruise vacation. Our award-winning fleet of purpose-built ships – the youngest and most innovative at sea –visits more than 230 destinations worldwide.  As our company adds new destinations, itineraries and ships, there are wonderful opportunities for new crew to join our family!  We’ll proudly welcome Norwegian Bliss to our fleet in Summer 2018, with several more vessels are scheduled through 2025. Recently, Norwegian was named “Europe’s Leading Cruise Line” for the ninth consecutive year, as well as “Caribbean’s Leading Cruise Line” for the fourth time and “World’s Leading Large Ship Cruise Line” for the fifth year by the World Travel Awards. Norwegian Cruise Line is officially listed on the NYSE, trading under the ticker symbol “NCLH” (Norwegian Cruise Line Holdings, Ltd).  Read more about Norwegian on our website: http://www.ncl.comGET SOCIAL WITH US! Facebook: https://www.facebook.com/NorwegianCruiseLineJobsandCareers/  LinkedIn: https://www.linkedin.com/company/norwegian-cruise-line  Instagram: ncljobs  Twitter: @NCLjobs EQUAL OPPORTUNITY EMPLOYER It is Norwegian Cruise Line Holding’s policy not to discriminate against any employee or applicant for employment because of race, color, religion, sex, national origin, age, disability, and marital or veteran status.  The above statements are intended to describe the general nature and level of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel so classified. All personnel may be required to perform duties outside of their normal responsibilities from time to time, as needed."}