{"jobID": "2824380641", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist - Machine Learning", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Data Scientist - Machine Learning - San Francisco  An innovative start-up in the Bay Area are rapidly expanding and looking to take on experienced Data Scientists to focus on machine learning technologies and statistics.  This exciting new role will give the Data Scientist an excellent opportunity to work on some really exciting and cutting edge products within the machine learning and statistics fields. As this is a relatively small team, you will need to take a hands-on approach and career progression opportunities, although based on merit, will be ample.  This will give you the opportunity to thrive within one of the fastest growing sectors within technology. On a day to day basis you will use your skills and expertise to develop and test new technologies aimed at text and data mining across thousands of sources.  We are looking for people who love solving complex problems and like to work on ground-breaking technologies.  To be considered for this exciting role you will need to have a degree in Computer Science, Electronics or relevant field as well as experience with machine learning technologies and statistics. You will also need to have a genuine passion for this sector and a relevant masters and have significant experience in Python. Any experience with financial modelling would be extremely advantageous.  In exchange for your skills and expertise, the company offer a highly competitive package as well as providing excellent career progression. The company also offer excellent training to further develop your skills.  For more information, please call Matthew Lowdon of Newton Colmore Consulting on 0044 121 268 2240 or make an application and one of our team will be in touch.  Newton Colmore Consulting is a highly specialist recruitment consultancy operating within the medical devices, Scientific Engineering, Scientific Software, Robotics, Science, Electronics Design, New Product Design, Human Factors, Regulatory Affairs, Quality Assurance and Field Service Engineering sectors throughout Europe and the US.  Key words: Data Scientist, Data Science, Machine Learning, Python, financial modelling, statistics, deep learning, image processing."}