{"jobID": "2831150680", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.vizio.com", "Headquarters": "Irvine, CA", "Size": "201 to 500 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Samsung Electronics, LG Electronics, TCL"}, "estimatedSalary": "155000", "jobDescription": "VIZIO, Inc., headquartered in Irvine, California, is America’s #1 Smart TV and Sound Bar Company. VIZIO's mission is to be the industry leader in Consumer Electronics by consistently delivering the latest technologies at the most affordable price. VIZIO's brand promise is to deliver innovative, premium-quality consumer electronics with an unwavering focus on the needs of our consumers.  Inscape (an Affiliate of VIZIO Inc.) is an industry leader in advertising solutions through automatic content recognition. We capture live viewing data from content sources across millions of Smart TVs and devices. Our comprehensive metrics deliver highly accurate, cross-platform viewing behavior. We enable advertisers and content producers with important insights that help them develop a deeper understanding of audiences, make more intelligent ad-buying decisions and be better prepared for changes in the market place. We are currently seeking a Senior Data Scientist to be based in our San Francisco, CA offices.  The Senior Data Scientist will be responsible for designing, developing algorithms, programs, methods, processes, and systems to consolidate and analyze structured and unstructured, diverse “big data” sources to generate actionable insights and solutions for client services and product enhancement. The Senior Data Scientist will:Be responsible for designing, developing algorithms, programs, methods, and processes.Be responsible for designing systems to consolidate and analyze structured and unstructured, diverse “big data” sources to generate actionable insights and solutions for client services and product enhancement.Explore a data set previously unavailable at such scale or granularity.Be responsible for data visualization, report creation, and dash-boarding.Research, develop, and test supervised and unsupervised learning models.Requirements:Bachelor’s Degree required in a quantitative discipline such as Statistics, Engineering, Computer Science, Applied Mathematics, etc. Master’s Degree preferred.2+ years of relevant work related experience working with large data setsStrong data analytics skills. Demonstrated proficiency with SQL, Python, and PandasComfortable writing code in python. Must be able to test and execute algorithms and modelsAbility to understand business problems, draw conclusions from data and recommend actions on how best to solve these problems.Experience with TV viewing data, the TV industry. Ad Tech Industry experience is a plus.Excellent communications skills, ability to document requirements and work collaboratively.Self-starter, willing to get hands dirty with own products, and “make it work”Required Skills:Advanced SQL, ideally on RedshiftPython and pandasData visualization, report creation, and dashboardingAbility to research, develop, and test supervised and unsupervised learning modelsExperience with other data analysis tools such as Tableau and SparkProfessional/polished communicatorTeam playerExtremely detail oriented and organizedResourcefulEnthusiastic and positiveMaintains an extreme high level of confidentialityAbility to catch on quickly and thrive in a very fast paced environmentProfessional demeanor with a very high level of integrity VIZIO, Inc. offers excellent career opportunity as well as a competitive compensation and benefits package. We are an equal opportunity, drug-free employer committed to diversity in the workplace. Minority/Female/Disabled/Protected Veteran."}