{"jobID": "2803330291", "jobLocation": "Austin_TX", "jobTitle": "Intern - Supply Chain Analytics", "companyRating": "3.2", "companyInfo": {"Website": "www.itron.com", "Headquarters": "Liberty Lake, WA", "Size": "5001 to 10000 employees", "Founded": " 1977", "Type": " Company - Public (ITRI) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Landis+Gyr, Silver Spring Networks"}, "estimatedSalary": "69000", "jobDescription": "Itron is at the forefront of a rapidly evolving global industry. Through innovative technology and services, we are working to create more insightful utilities, smarter cities and a more resourceful world. Join us.  Within this role you will build an analytical mindset to help data science related projects. Use big data to build econometric models for supply chain operations. Will require handling/manipulating large data sets regularly and summarize findings to business audience. Job Duties and ResponsibilitiesCreate a predictive model for Itron revenue and inventoryCreate predictive model for commodity price changesIdentify leading indicators to Itron’s profitabilityHelp drive results for the Supply Chain organizationExperienceThis position requires a minimum of 0-1 year of related experienceBasic coding knowledge (R, C++, and Python)Basic machine learning concepts (linear regression, decision trees, cluster analysis, time-series modeling)Comfortable using big data sets to solve business challengesEducation: Must be enrolled in a accredited degree program.Preferred EducationEconomics, Statistics, Mathematics, or Computer ScienceStudents who have completed 3-4 years of their degree program or students currently enrolled in a Master's level program.Travel: 10 - 30% Physical Demands: This is a typical office job, with no special physical requirements or unusual work environment.  Itron is an Equal Opportunity, Affirmative Action Employer. Qualified applicants are considered without regard to race, color, religion, sex, age, national origin, citizenship, sexual orientation, marital status, pregnancy, medical condition, veteran status, disability, genetic information, gender identity or other characteristics protected by law. If you require an accommodation in order to apply to this position, please contact your local recruiting representative at 1-800-635-5461 or email Accessibility@itron.com. #LI-DS1"}