{"jobID": "2794571754", "jobLocation": "Cambridge_MA", "jobTitle": "Data Scientist - Direct Hire - 14617", "companyRating": null, "companyInfo": {"Website": "www.syllogisteks.com", "Headquarters": "Chesterfield, MO", "Size": "Unknown", "Founded": " 1992", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Our client is a pre-IPO start up that is VERY HEAVILY funded and well managed, with a proven track record in launching successful companies. Our client is in the in the data analytics software space and they have carved out a niche market in a global multi-billion dollar industry. Doubling in headcount this year with plans to quadruple in 2018, they have locations in St. Louis, Missouri and Cambridge, Massachusetts. They offer paid relocation, stock options, cash bonuses, medical benefits, etc. Data Scientist -Qualifications Experience across and significant work in at least one of clustering and classification; multivariate regression, prediction, and forecasting; and dimensionality reduction and feature engineering  Experience applying the scientific method to complex, multivariate unstructured problems to produce rigorously-defendable conclusion in prose and graphics  Experience or interest in Bayesian methods of crafting generative probabilistic models; engineering informative priors; and solution via MCMC  Experience engineering production-level software systems evidenced by having built a parallel/distributed system, using software best practices, performance optimizations, or an automated pipeline to interpret other data science experiments  Experience collecting, curating, structuring and retrieving large data sets in relational databases.  Additional experience with NoSQL preferred  Basic background in computer science including the use of foundational data structures; programming and languages types; and essential discrete math and calculus. Bonus Qualifications (Not Required) We would be additionally excited that you have any of the following:  Experience or keen interest in FP {Scala, Haskell, Clojure, Erlang, OCaML/SML, Elm, F#}  Experience with Bayesian non-parametrics (CRP, IBP, etc.)  Experience with advanced MCMC techniques such as DREAM, Hamiltonian-MC, variational approximations, etc.  Experience with either time-series or spatial statistics, especially Gaussian Processes  Experience creating complex data visualizations for multivariate data  Experience with AWS or other programmatic distributed computing environments such as MPI or LSF"}