{"jobID": "2807407861", "jobLocation": "Fremont_CA", "jobTitle": "Assistant Store Manager", "companyRating": "3.3", "companyInfo": {"Website": "www.petfoodexpresscareers.com", "Headquarters": "Oakland, CA", "Size": "501 to 1000 employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Petco, PetSmart"}, "estimatedSalary": "45000", "jobDescription": " Assistant Store Managers are at the heart of our unique customer and employee experience. As an Assistant Manager, youll work closely with field leadership to make our core values real for the store. Teamwork is at the heart of PFE, and youll help lead the team with creativity, a passion for people, and a service-driven leadership style. Our success comes from the trusting relationships we build with customers. Our customers come to us for expert advice, the biggest part of your job will be getting the whole story and helping customers find the best solution for their pet problems. Because in the end, our bottom line is building meaningful relationships to help pet families thrive. What youll do:Lead by example to provide exceptional customer service and drive salesLead store opening and closingCreate sales games that drive your team to meet specific sales goalsParticipate in training and educational programs to enhance your product knowledge and communication skillsTrain your Sales Associates to tell compelling product storiesWhat youll need:We value potential over experience. We hire great people, pay them well, and train them on what they need to know. If youre unsure about whether you meet our qualifications, just apply.A passion for pets and peopleLeadership experience required (Retail and/or pet experience is a plus)Eagerness to learn, drive and lots of ambition. Were growing at 10% a year, so we need people who can grow with usAbility to work evenings and weekends regularlyAbility to regularly lift and carry up to 50 lbsWhat youll love:Pay starting at $17.25 with opportunities for growthSenior leaders who care about your passion and developmentFormal leadership trainingA generous employee discountCompetitive sick, holiday, and vacation payHealth insurance, 401k match, profit sharing, and other great benefits--even pet insurance!*Bring your well-behaved dog to workAbout the Company One of Business Insider Magazines 25 companies that are revolutionizing retail, we at Pet Food Express pride ourselves on offering high quality, innovative and unique pet foods and products. Since 1986, our commitment to purpose over profits has driven our decades long history of continuously strong growth. But dont take our word for it: in addition to our national industry awards, youll find us and our founders on lists like the National Retail Federations People Changing Retails Future (15) and Top Bay Area Workplaces (7 years running). You love pets, so do we. Join us.Pet Food Express is an Equal Opportunity Employer and does not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class."}