{"jobID": "2645522770", "jobLocation": "Boston_MA", "jobTitle": "Podiatry", "companyRating": null, "companyInfo": {"Website": "www.navy.com", "Headquarters": "San Diego, CA", "Size": "1001 to 5000 employees", "Founded": " 1775", "Type": " Government", "Industry": " Government", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " \"About This JobAs a Navy Podiatrist, your skills will treat the feet, ankle and the lower extremity issues of servicemembers, their families, and those in need. Besides normal issues, youll treat bunion deformities, torn ligaments, and stress fractures.Youll partner with first-rate health-care providers, such as orthopedic surgeons and physical therapists, and have the opportunity to use your direct-access skills and practice as a critical part of a distinguished, professional medical team.Serving part-time as a Reservist, your duties will be carried out during your scheduled drilling and training periods. During monthly drilling, Podiatrists in the Navy Reserve typically work at a location close to their homes. This gives you the flexibility to expand your profession in the Navy without compromising your civilian practice at home.For annual training, Podiatrists may serve anywhere in the world, whether at sea, in hospitals stateside, or on bases in countries around the world.Take a moment to learn more about the general roles and responsibilities of Reservists.Most of what you do in the Navy Reserve is considered training. The basic Navy Reserve commitment involves training a minimum of one weekend a month (referred to as drilling) and two weeks a year (referred to as Annual Training) or the equivalent of that.Podiatrists in the Navy Reserve serve in an Officer role. Before receiving the ongoing professional training that comes with this job, initial training requirements must first be met.For current or former Navy Officers (NAVET): Prior experience satisfies the initial leadership training requirement so you will not need to go through Officer Training again.For current or former Officers of military branches other than the Navy (OSVET), as well as for Officer candidates without prior military experience: You will need to meet the initial leadership training requirement by attending the twelve-day Direct Commission Officer (DCO) School in Newport, R.I. This will count as your first Annual Training.With flexible training options, Medical Service Corps Officers in the Navy Reserve can comfortably balance civilian and military schedules. You can maintain your own life and your own career enriching both with the rewarding work you do for others.The Medical Service Corps in the Navy Reserve offers you a truly diverse variety of operational venues. In some cases, you can even work in the same civilian location you work in now. Whats more, you will enjoy an unrivaled sense of pride and fulfillment known only to those who serve.\""}