{"jobID": "2667690442", "jobLocation": "Austin_TX", "jobTitle": "Senior Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.homeaway.com", "Headquarters": "Austin, TX", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Airbnb, TripAdvisor, 9flats.com"}, "estimatedSalary": "131000", "jobDescription": "About us: HomeAway, based in Austin, Texas, is the world leader in vacation rentals with more than 2 million unique places to stay in 190 countries, and is a part of the Expedia, Inc. family of brands.  HomeAway offers an extensive selection of vacation rental homes that provide travelers with memorable experiences and benefits, especially more room to relax, for less than the cost of traditional hotel accommodations. The company also makes it easy for vacation rental owners and property managers to advertise their properties and manage bookings online.  We are looking for excellent Data Scientists to join our growing 20+ strong team. This position focuses on the measurement and optimization of our search relevance and ranking algorithms, so it is a good fit for those with backgrounds in information retrieval, recommender systems, economics and learning to rank. This role will work closely with our ranking development team to improve conversion originating from traveler searches. The statistical learning algorithms you develop will impact tens of millions of traveler searches a year.< Challenges to work on: Modifying ranking algorithms to support a healthy marketplace with dynamic commissions.Create models to understand traveler preferences with respect to price, geography, traveler preferences, images, and amenitiesSpatial modeling of supply valueResponsibilities:Work on larger programs/initiatives encompassing several projects that have a company-wide impactApply best-in-class machine learning techniques to solve the business problem at handProduce novel insights with machine learning to inform company strategyAssist others with data discovery and data preparation phaseHelp build the core feedback loops and incentive structures in our marketplace.Attend conferences and read papers to stay on top of advancements in the fieldQualifications:2+ years of experience in Data Science and analytics fieldsExperience with programming languages such as R, Python, or ScalaExperience in processing and analyzing large scale data volumes, semi-structured and unstructured data and near real-time throughput Experience applying the right ML model to solve business problemsAbility and passion to learn new techniques to stay on the cutting edge.Experience working in the AWS and Hadoop ecosystemsStrong database knowledge and expertise in SQLGood storytelling and presentation skills i.e be able to present business side of the story that data presents to c-team and business leadersMasters or Ph.D in Statistics, Math, Computer Science, Economics or other quantitative fieldBenefits:Competitive health and insurance benefits.Competitive salary.Annual target bonus or commission.Paid vacation and sick time.Vacation rental on a yearly basis (taxable benefit).Employee Stock Purchase Program.Free snacks and beverages.Frequent company update talks with our leadership team.Free listing on HomeAway.comElectronic, adjustable stand-up desk.Discounted Metro & Rail pass. We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}