{"jobID": "2804006383", "jobLocation": "Seattle_WA", "jobTitle": "DATA ANALYST - RESEARCH SCIENTIST 3", "companyRating": "4.1", "companyInfo": {"Website": "www.washington.edu", "Headquarters": "Seattle, WA", "Size": "10000+ employees", "Founded": " 1861", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": " University of Washington  Location Seattle, Washington, United States  Salary Not specified  Job type Employee  Category Administrative / Office,Bio-Tech / Sciences,Health Care  Job status N/A  Posted on Jun 04, 2018  Job code N/A  Print  DATA ANALYST - RESEARCH SCIENTIST 3 Req #: ****** Department: Appointing Department Web Address: ********************************* Job Location: University District Job Location Detail: UW Tower Posting Date: 03/14/2018 Closing Info: Open Until Filled Salary: Salary is commensurate with experience and education Shift: First Shift The University of Washington (UW) is proud to be one of the nation's premier educational and research institutions. Our people are the most important asset in our pursuit of achieving excellence in education, research and community service. Our staff not only enjoys outstanding benefits and professional growth opportunities, but also an environment noted for diversity, community involvement, intellectual excitement, artistic pursuits, and natural beauty.  The University of Washington's Department of Biostatistics has an outstanding opportunity for a full time Research Scientist.  The Genetic Analysis Center (GAC, ************************************************ in the Department of Biostatistics develops and applies statistical methods to genetic and health-related data, to discover how genetic variation contributes to human well-being and disease. The genetic data include variations assayed by whole-genome sequencing and micro-arrays, and the health data cover a broad range of traits, including complex diseases such as diabetes, asthma, atherosclerosis, and cancer; as well as responses to drug treatments. The projects are funded by various parts of NIH, but also non-profits and industry. Current major projects are the Trans-Omics for Precision Medicine (TOPMed) Data Coordinating and Analysis Centers (****************) and statistical/analytic support for the National Institutes of Health - Center for Inherited Disease Research (NIH-CIDR) program (************************************************* RESPONSIBILITIES: Provide data analysis, programming, and reporting of results for statistical genetics/genomics projects, both independently and in collaboration with other staff of the GAC. Two current project examples: (1) In the NIH-CIDR program, we collaborate with investigators at CIDR and with clinical study investigators to perform quality control and analysis of genotype data obtained from next generation sequencing and/or micro-array assays performed at CIDR. This involves data management, quality control procedures, estimating genotyping error rates, imputing genotypes for unmeasured variants, and performing genotype-phenotype association analyses. Presentations are given regularly to our collaborators, documenting progress, interpreting results, and discussing issues that arise. A written report is provided at the end of the project. (2) In the TOPMed program, we perform quality control of genotype data, estimate relatedness and population structure in genotypes from whole-genome sequencing, harmonize phenotypes across multiple studies and perform pooled genotype-phenotype analyses. We also use genome annotations to select rare variants for aggregate testing. Results of these analyses are QC'ed and presented to TOPMed investigators, with interpretation of results and discussion of relevant issues. In both projects, we participate in preparing manuscripts for publication, writing and editing methods descriptions, designing and creating figures and tables, and undertaking revision after peer review. These responsibilities involve the following activities: Work with clinical collaborators and GAC staff to develop goals for data analysis.  Create, manipulate, and merge large and complex data sets.  Program statistical data analysis of large data sets efficiently using R and parallel computing.  Write reusable functions in R, document and package code and follow standards for reproducible research.  Summarize and communicate results of analyses to GAC staff and clinical collaborators.  Assist in preparation of manuscripts for publication.  Training for these activities will be provided through working closely with experienced team members. The GAC provides a highly collaborative and collegial environment in which team members across the group share expertise and mentor each other. Continuing education opportunities include attending workshops, short courses and conferences.  As a UW employee, you will enjoy generous benefits and work/life programs. For detailed information on Benefits for this position, click here. REQUIREMENTS: BS or MS in BIOSTATISTICS (or related field such as computer science or quantitative  genetics) AND three years of related experience.  Knowledge of or willingness to learn specialized statistical skills for projects  relating to translational, genetic, or genomic research.  Experienced in statistical software packages (e.g. SAS, R, STATA, S-Plus, SPSS) and  knowledge of or demonstrated ability to learn specialized software packages for the  analysis of genetic and genomic data.  Excellent communication skills and ability to translate complex genetic or medical  research questions into statistical questions.  The University of Washington is a leader in environmental stewardship & sustainability, and committed to becoming climate neutral.  The University of Washington is an equal opportunity, affirmative action employer. To request disability accommodation in the application process, contact the Disability Services Office at ************ / ************ (tty) or **********. Apply for this job  Print"}