{"jobID": "2803600857", "jobLocation": "Boston_MA", "jobTitle": "Big Data Analyst - Developer", "companyRating": "4.2", "companyInfo": {"Website": "www.poweradvocate.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": " Do you want to join the world of Data Science in the fast-growing energy market?  Do you love to turn large datasets into meaningful stories and actionable knowledge? Do you want to be involved in delivering the next generation of analytic solutions using Statistical/Machine Learning methods and a range of Big Data technologies? Join a team where you are encouraged to explore, learn, and push boundaries.  We are currently developing several applied Machine Learning solutions with the goal of scaling and automating the classification of millions of records of our clients’ supply chain data. For ten years, we have been classifying our clients’ purchasing transactions into our industry-specific categorization schema. This gives us an inordinate amount of training data – millions of rows of classified transactions representing over $2+ Trillion of spend. That’s not a typo – two trillion dollars! Our efforts are focused on deploying fully-integrated Machine Learning algorithms to assist our industry experts in leveraging their knowledge at greater scale and efficiency. We have a fertile ground of training data, a can-do entrepreneurial spirit and appreciation for robust and effective analytics approaches to delivering value. Come join our team!  PowerAdvocate leads the energy data industry by providing energy companies with clarity into their complex data. Our Energy FactBase, currently at $2+ Trillion and growing, helps customers to create operational and financial excellence. We help our clients to understand how they can leverage our unique view of the marketplace to reduce costs and manage operation risk working with executives on the cutting edge in the power, oil and gas, and renewable energy sectors. JOB TITLE: Big Data Analyst - DeveloperDEPARTMENT: Data Science LOCATION: Boston SUMMARY: As a member of PowerAdvocate’s Data Science team, the Big Data Analyst - Developer actively participates in all aspects of the algorithm testing and development process—from data extraction and wrangling, through effective database integration solutions to model development and implementation. The Big Data Analyst - Developer contributes as part of an Agile Scrum team, in a fast-paced environment with high visibility to the rest of the company. He or she also participates in broader aspects of each project including communicating ongoing results and outcomes via effective visualizations and other presentation tools, as well as gaining a deeper understanding of the results produced and their applicability to our internal customers.Job Responsibilities: In addition to the following, other duties may be assigned to meet business needs: Extract, clean, audit and prepare data for analysis, relying on well-structured procedures and maintaining reproducibility of resultsDesign experiments to answer targeted questions and conduct exploratory data analysisAnalyze and judge the quality of data produced and proactively develop and implement solutions to data quality issuesPresent and visualize interim and final results of analysesImplement and test algorithms and techniques relevant to achieving project objectivesMaintain and develop, as needed, databases relevant to analytic solutions being developedInterface with primary team members to construct, maintain, and automate client-related data to support other analyst teams in the Spend Intelligence GroupTranslate business objectives into actionable analysisProvide insight into the development of new customer products and internal uses for PowerAdvocate’s vast database of information."}