{"jobID": "2814722290", "jobLocation": "San_Francisco_CA", "jobTitle": "Clinical Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.juul.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "THE COMPANY: JUUL's mission is to improve the lives of the worlds one billion adult smokers by driving innovation to eliminate cigarettes. JUUL is the number one US-based vapor product. Headquartered in San Francisco and backed by leading technology investors including Tiger Global, Fidelity Investments and Tao Invest LLC, JUUL Labs is disrupting one of the worlds largest and oldest industries.  Were an exceptional team with backgrounds in technology, healthcare, CPG and biotech, and were growing rapidly to deliver on our mission. Were actively looking to hire the worlds best scientists, engineers, designers, product managers, supply chain experts, customer service and business professionals. ROLE AND RESPONSIBILITIES:Looking for local San Francisco Bay Area applicants. We are looking for a Clinical Data Analyst (CDA) to turn data into information, then information into insight and  observations, with the goal for our business unit to review the pattern of these observations and use  this information when making business decisions. The candidates need to be very curious , who  enjoy diving deep into the material to find observations into a yet unknown question. They need to  have a natural desire to go beneath the surface of a problem. They need to be thinkers who can ask  the right (business) questions. Well ask this CDA to collect and study data to reveal ways to  improve our business, or databases. The data would involve almost surveys, marketing, sales,  research or resources databases. This position involves problem-solving, mathematics, computer  skills and studying sets of both unstructured and structured data.  We will supply the CDA with data sets, a scenario or problem, and the analyst must regularly  pour through data and make observations. The analyst will analyze information from various sources  that might help us better understand our situation and then study the information to uncover patterns  and outliers. They must be able to identify and interpret patterns and trends, assess data quality and  eliminate irrelevant data.  The CDA communicates the results of their analysis as a comprehensive report to company  decision makers. He/She designs the report and includes tools that can help those involved easily  digest the data, such as statistics, graphs, images and lists. He/She wouild distribute the report via a  face-to- face meeting presentation to SME.  The CDA could provide database design services (nice to have, not need to have). They also  collect data using a variety of methods, such as data mining and hardcopy or electronic  documentation, to improve or expand databases. Additionally, the data analyst should be able to  make recommendations about the methods used to collect, analyze and manage data to improve  data quality and the efficiency of our systems. Interpret data, analyze results using statistical techniques and provide ongoing reportsImplement strategies that optimize statistical efficiency and data qualityAcquire data from primary or secondary data sources and maintain databases/data systemsIdentify, analyze, and observe trends or patterns in structured and unstructured data setsFilter, clean and normalize dataWork closely with management to prioritize business and information needsLocate and define new opportunities for process improvementPERSONAL AND PROFESSIONAL QUALIFICATIONS:Education: BS in Mathematics, Economics, Computer Science, Information Management or Statistics; MS preferred. 5+ working experience as a clinical data analyst with experience with clinical trialsTechnical expertise regarding data models, data mining and segmentation techniquesStrong knowledge of and experience with reporting packages (SAS, Viseo, Tableau, Qlickview) and  programming (JSON, Javascript, or Python)Knowledge of statistics and experience using statistical packages for analyzing large datasets  (Database Logic/SQL)Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracyAdept at queries, report writing and presenting findingsGood verbal communication skills. Strong written and verbal communication skillsAbility to work in a fast-paced environmentBasic understanding of how a business and strategy workAbility to work autonomouslyJUUL LABS PERKS & BENEFITS:A place to grow your career. Well help you set big goals - and exceed themPeople. Work with talented, committed and supportive teammatesEquity and performance bonuses. Every employee is a stakeholder in our successBoundless snacks and drinksCell phone subsidy, commuter benefits and discounts on JUUL productsExcellent medical, dental and vision benefitsLocation. Work in the heart of San Francisco, one of the worlds greatest cities Vapor, JUUL, Work Culture, Fast Paced, Start-up, Growth, Vape, Technology, Software, Hardware, Consumer Electronics, Manufacturing, Design, Product, Disruptive, Revolutionary, Cutting Edge, App, Android, eCommerce, B2C, San Francisco, Bay Area, IoT, San Jose, Los Angeles"}