{"jobID": "2749381272", "jobLocation": "San_Jose_CA", "jobTitle": "Member Solution Specialist (Personal Banker)", "companyRating": null, "companyInfo": {"Website": "www.patelco.org", "Headquarters": "Pleasanton, CA", "Size": "501 to 1000 employees", "Founded": " 1936", "Type": " Nonprofit Organization", "Industry": " Finance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OverviewWe’re here to help people in communities throughout Northern California build financially healthy lives. We do this by being attentive and partnering with our members to understand what is financially best for them. We thrive on change, and we put people first. If you’re looking to use your skills and knowledge to make a difference in the lives of others, we look forward to hearing from you. About Patelco Credit Union Patelco is a not-for-profit credit union, serving the financial needs and aspirations of more than 300,000 members. What we earn, we return to our members in savings from lower loan rates, fewer fees, and personalized service that focuses on transparency, simplicity, and trust. Our mission remains the same as when we started in 1936, to provide products, services, education and expertise that will empower our members to rise up and achieve financial freedom. The Opportunity We seek to hire a Member Solution Specialist to serve our members in the San Jose - Almaden branch. As a Member Solution Specialist (MSS) in our branches you will have the chance to make a difference in the lives of every member you serve. This is an individual contributor role which reports into the Manager, Retail Branch.ResponsibilitiesAs a MSS you will have the chance to:Offer best in class customer service to our members.Open accounts for new and existing members, as well as service those accounts.Assist member with complex financial transactions and accounts.Lead by example and train new team members.Partner with Branch Management to achieve service level integrity and increase member participation.Adopt new and existing tools that will enhance the member consultation process.Consult with members in order to assess their known and unknown needs and identify the appropriate products, solutions and services; such as Insurances, Wealth Management, and Home Loan Consultation.Initiate, process, and fund consumer loans such as credit cards, car loans, HELOCs, personal lines of credit, etc.Exercise informed judgement as appropriate to accommodate members.Promote member adoption of new technology, campaigns, promotions and digital products.Understand and comply with all applicable federal and state laws and banking regulations (including those related to OFAC and Bank Secrecy Act / Anti-Money Laundering compliance) and Patelco Credit Union’s policies and procedures. QualificationsYou offer:Service Passion, Integrity, and Resourcefulness.Eagerness to learn and a drive for continuous improvement.Five years of prior experience in financial services.Technically savvy with smartphone operating systems, PCs and email systems.Excellent consultative and written communication skills.Ability to be professional and empathetic in all interactions.Flexible work schedule, including Saturdays.BA or BS in business, finance, or associated field, or equivalent work experience.Ability to stand or walk for extended periods of time.We offer:Empowerment, Engagement, and Teamwork.An inspiring career that benefits both you and your community.Competitive compensation packages with bonus opportunity.Full Medical/Dental/Vision benefits with minimal eligibility waiting period.Generous 401k with 3% Safe Harbor and 5% employer match.Discounts on loan products.Tuition Reimbursement.Community Outreach Opportunities.Patelco Credit Union is an EO Employer - M/ F/ Veteran/ Disability Key words: Banking, Credit Union, Banker, Personal Banker, Relationship Banker, Senior Personal Banker, Financial Advisor, Bank, Finance, Full-Time"}