{"jobID": "2808401890", "jobLocation": "Boston_MA", "jobTitle": "Onboarding Consultant", "companyRating": null, "companyInfo": {"Website": "www.crimsonhexagon.com", "Headquarters": "Boston, MA", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OverviewCrimson Hexagon helps global brands better understand their consumers. With instant access to the world’s largest volume of unstructured text and images across social, online public, and enterprise-held data sources, Crimson Hexagon’s AI-powered consumer insights platform allows clients to analyze audiences, track brand perception and campaign performance, and even detect competitive and market trends. Our clients include Anheuser-Busch InBev, Adidas, General Mills, Paramount Pictures, and Twitter. We’re a high growth software company headquartered in Boston with offices in Chicago, New York, San Francisco and London. Find us on Twitter and on LinkedIn.  We are seeking an Onboarding Consultant to work closely with our customers to help with product adoption and onboarding. The ideal candidate will have prior experience managing customer expectations and helping them succeed. We are seeking an excellent problem-solver with proven analytical skills. This role works collaboratively with the Client Services team and relevant stakeholders to drive excellence and efficiency for our customers.Responsibilities Become a power user of the Crimson Hexagon’s platform and products and conduct complex analysesProvide technical and consultative support to our client base on a daily basisSupport clients as they learn how to use our platform by leading onboarding sessions and presentationsCarry out training needs analysisDesign course materials and other documents such as handouts, manuals and exercisesDevelop training and onboarding programs appropriate to the skills needed for target audienceAssist with the onboarding of new Onboarding ConsultantsQualificationsBA/BS General Studies, Liberal Arts or Business related disciplinesPrimary English language required; secondary language(s) a plus3-5 years of experienceExperience in managing brand and agency customersDemonstrable critical thinking and creative problem solving skillsExcellent written and verbal communication skills with the ability to communicate technical ideas to non-technical audiencesAbility to prioritize, multi-task, and perform effectively under pressureCapacity to learn new analytics tools, software platforms and industries quicklySelf-starter with a positive attitudeExcellent attention to detail and an interest in developing analytical skillsStrong interest in software technology and social mediaAbility to learn new analytics tools, software platforms and industries quicklyTeaching/instructional experience (software ideally)Flexibility to travel up to 20% within the United States"}