{"jobID": "2808531654", "jobLocation": "New_York_NY", "jobTitle": "Paralegal - Trial and Global Disputes - NYC", "companyRating": null, "companyInfo": {"Website": "www.kslaw.com", "Headquarters": "Atlanta, GA", "Size": "1001 to 5000 employees", "Founded": " 1885", "Type": " Private Practice / Firm", "Industry": " Accounting & Legal", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Alston & Bird, Vinson & Elkins, Gibson Dunn & Crutcher"}, "estimatedSalary": null, "jobDescription": "Paralegal Trial and Global Disputes NYCThis position performs a variety of duties to assist Trial & Global Dispute litigation lawyers with a focus on toxic tort and environmental disputes practice. The individual will maintain positive contact with clients, observe confidentiality of client matters, and must be a team-oriented paralegal.  Candidates will have the following responsibilities: Working knowledge of the litigation process, especially large case tracking and management.Manage all facets of case from discovery through trial. Prepare and maintain issue, subject-matter, witness and deposition files.Review and analyze discovery requests and assist lawyers with discovery responses.Coordinate document reviews with legal team, clients, and vendors.Assist with document reviews for responsiveness, case issues, and privilege responses to discovery requests and to identify privileged documents, documents for redaction, case issues in context.Organize and maintain case files; coordinate with Legal Practice Assistants and other staff.Prepare and maintain document databases in various formats.Prepare court filings and service to counsel; experience with e-filing.Keep accurate time records. Requirements: Bachelor's Degree with a 3.5 cumulative GPA.At least one year of defense litigation experience in a mid- to large-size law firm.Mass/Toxic tort experience preferred.Able to work and perform in a high-stress team environment.Strong project management skills.Excellent research and analytical skills.Strong, concise communication and written skills.Able to work overtime, including weekends; flexible for travel.Proficient in Excel, PowerPoint, and Adobe Acrobat.Proficient in litigation applications / databases such as Relativity and IPRO.Proficient in cite checking, Shepardizing, and Bluebooking.King & Spalding LLP (K&S;) is committed to providing equal employment opportunity to all applicants and employees in full compliance with all state, federal, and local laws prohibiting discrimination on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, genetic information, age, disability or any other status protected by applicable law."}