{"jobID": "2802973191", "jobLocation": "Cambridge_MA", "jobTitle": "Commercial Data Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.akamai.com", "Headquarters": "Cambridge, MA", "Size": "5001 to 10000 employees", "Founded": " 1998", "Type": " Company - Public (AKAM) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Level 3 Communications, Mirror Image Internet, Limelight Networks"}, "estimatedSalary": "115000", "jobDescription": "About the TeamThe Sales, Marketing, and Finance Operations teams manage the operational aspects of Akamai's product and go to market organizations. These include such activities as revenue and productivity planning, reporting and analyzing key performance metrics, and developing processes within the organization to drive efficiency gains. The Reporting and Analytics team in Marketing Operations is responsible for business performance metrics, attribution metrics, and predictive models that drive our marketing initiatives.  About the JobAkamai is growing fast, and so is the volume of data we manage. We need someone with the experience to apply sophisticated data analysis techniques in our fast-changing, entrepreneurial environment. If you love being the detective, analyzing business problems, predicting the future, eliminating the status quo, and testing whether your hypotheses were right, then this role is full of opportunity for you.  This scientist will work closely with Marketing, Sales, Finance, and IT analyzing hierarchical data, predicting and optimizing sales, and determining the best marketing and sales plays and when to launch those plays. A successful scientist in this role will know how to connect and leverage existing, but disparate, data inside and outside of Akamai. An outstanding scientist will see what they are missing, creating and testing out new solutions – including getting your hands dirty, and cleaning data to reveal patterns.  If you enjoy taking a business problem and turning it into actionable output into a system for others to act on and use, then you’ll like this job. This really isn’t a job for the faint of heart – you must be persistent – you must be someone that never surrenders and never retreats; someone with a “relentless forward motion…Thrilled by small victories, undeterred by setbacks” until finally reaching your goal. ResponsibilitiesHelp business leaders in Sales and Marketing formulate critical questions that may be answered through analyticsScope out, create, deliver and implement analyses and predictive models on timeUse critical thinking skills to define and validate ambiguous business objectives and concepts such as customer lifetime valueTranslate jargon into EnglishTake initiative to keep up with developments in the field of data science, and to independently learn on the job."}