{"jobID": "2671241232", "jobLocation": "Palo_Alto_CA", "jobTitle": "Member of Technical Staff: Intern", "companyRating": "4.2", "companyInfo": {"Website": "www.thoughtspot.com", "Headquarters": "Palo Alto, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "171000", "jobDescription": " Are you passionate about building systems and software that lasts and will make an impact? Do you relish in the satisfaction of solving challenging problems? Do you want to build complex systems from the ground up? If these questions resonate with you, you’ve come to the right place!  ThoughtSpot is disrupting the Business Intelligence world in a big way and to do so, we need and welcome ideas from many areas within computer science: information retrieval, distributed computing, large-scale system design, networking, security, data compression, user interface design and more.  ThoughtSpot relational search appliance brings the ease of search to enterprise data analysis. It includes a new kind of search engine, tightly integrated with large-scale, in-memory computing. The result is a consumer-class user experience combined with enterprise-class scalability while maintaining enterprise data governance and manageability for IT. We are looking for highly motivated individuals who want to make a big impact in their work.  What it takes to be a Software Engineer at ThoughtSpot:  Strong coding skills in modern languages such as C++/Javascript/Python  Strong problem solving skills, algorithmic thinking and a strong foundation in how systems work.  Very strong computer science fundamentals  Bachelor/Masters in Computer Science, PhD preferred  Experience in designing and developing scale-out, high-performance systems OR experience with database design OR experience in building search engines including areas such as search relevance, aggregation and indexing OR full stack/frontend development experience in building complex web/mobile applications is a plus. Education : Computer Science degree graduating in 2018  About ThoughtSpot  ThoughtSpot’s AI-Driven analytics platform puts the power of a thousand analysts in every business person's hands. With ThoughtSpot, you can use search to easily analyze your data or automatically get trusted insights pushed to you with a single click. ThoughtSpot connects with any on-premise, cloud, big data, or desktop data source and deploys 85 percent faster than legacy technologies. BI & Analytics teams have used ThoughtSpot to cut reporting backlogs by more than 90 percent and make more than 3 million decisions - and counting. ThoughtSpot’s customers include Amway, Bed Bath and Beyond, Capital One, Celebrity Cruises, Chevron Federal Credit Union, De Beers, Insurethebox and Scotiabank.  ThoughtSpot was co-founded in 2012 by its CEO Ajeet Singh and six other technical co-founders from Google, Microsoft, Amazon, and Oracle. The company is based in Palo Alto, CA and is currently expanding operations in North America, Europe and Asia-Pacific. Backed by investors Lightspeed Venture Partners, Khosla Ventures, General Catalyst Partners, Geodesic Capital and Capital One Growth Ventures, ThoughtSpot has raised over $160 million to date. ThoughtSpot’s mission is to enable analytics at \"human scale\" and put search and AI-driven analytics in the hands of 20 million users by 2020. For more information please visit thoughtspot.com"}