{"jobID": "2797094616", "jobLocation": "Needham_MA", "jobTitle": "Senior Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.btatour.com", "Headquarters": "Beijing, China", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " TripAdvisor is looking for an experienced data scientist to join a growing team within its Attractions and Rentals division. As a Senior Data Scientist, you will process massive amounts of user data and build advanced machine learning models to solve a variety of complex business problems, such as recommender systems, fraud-detection, text/image processing, online advertisement, and ranking algorithms. You will deploy your solutions online and be able to observe the impact of your work in real time as you help the company grow.  We are looking for someone who is a fast learner, independent, and curious, who is passionate about data science and machine learning. You will be working in a diverse environment where you’ll collaborate with a multidisciplinary team of data scientists, analysts, software engineers, and product managers. You’ll be encouraged to take ownership of your projects and to find new opportunities and problems where machine learning could be applied to improve the business.  This position requires previous industry experience. As a Senior Data Scientist, you will be expected to lead projects, tutor junior members of the team, and bring in new technical knowledge.  What you will do:  Process massive amounts of structured and unstructured data using Spark/SQL/Hive.  Build advanced supervised and unsupervised machine learning models (e.g., auto-encoders, recurrent/convolutional networks, XGBoost, etc.)  Research new machine learning solutions to complex business problems  Write production code in Python  Carry out A/B test experiments  Communicate findings to non-technical audience  What you will bring to the team:  PhD or Masters in Computer Science, Engineering, Statistics, or related field (PhD preferred).  Excellent communication skills  Strong background in machine learning and statistics  Solid foundation in data structures and algorithms  Proficiency in Python for numerical/statistical programming (including Numpy, Pandas, and Scikit-learn)  Experience training deep neural networks  Experience with natural language processing  Ability to write complex SQL queries  4 years of industry experience"}