{"jobID": "2827096539", "jobLocation": "San_Diego_CA", "jobTitle": "Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.resmed.com", "Headquarters": "San Diego, CA", "Size": "5001 to 10000 employees", "Founded": " 1989", "Type": " Company - Public (RMD) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Philips, CareFusion, Drive DeVilbiss Healthcare"}, "estimatedSalary": "66000", "jobDescription": "Data AnalystLet’s talk about the team: As part of the largest provider of connected healthcare solutions, our Advanced Analytics team is uniquely positioned to help drive improvements in patient care and outcomes. We are a passionate team of innovative problem solvers that supports business units across the globe, providing opportunities to engage with new and challenging projects. Our goals are to leverage ResMed’s best-in-class data to provide actionable insights across the company and to help drive the healthcare industry forward. Let’s talk about you: At ResMed we focus on capability and passion. Collaborating with the Data Analytics team, you will be responsible for acquiring, managing, manipulating, and analyzing information stored in and created by ResMed Healthcare Informatics systems. You will conduct research to determine best means of obtaining and transforming data into information to be provided by key stakeholders.  To ensure success in the role, you will be able to demonstrate that you are a driven, self-starter who can identify and interpret patterns and trends from data. You will be able to communicate your analysis effectively with internal and external stakeholders at all levels of the organization. You will be motivated to help improve and support the data analytics for ResMed’s suite of HI applications.  Your passion for leaning will be demonstrated by your initiative to learn new tools and products as well as identify opportunities to improve current processes and standards. Responsibilities:Acquire and combine primary or secondary data from existing internal or external data sourcesInterpret data results and identify risks, areas for improvement and opportunitiesContribute to the quality of data systems through feedback, documentation, and knowledge transferAnalyze and make recommendations for compliance program improvementsPerform statistical analysis to produce new information with business valueDevelop graphs, reports, and presentationsCreate and present quality dashboards as well as routine and ad hoc reportsWork directly with teams to understand their informational gaps and determine the analysis and reports that will be of most benefit to themLet’s talk qualifications and experience Your enthusiasm, ability to think outside the box and mental agility ensures you make an impact within your role quickly. You will demonstrate grit, initiative, have the ability to learn fast and to work effectively within the team environment. You will have solid business acumen and be able to easily manage the detail, as well as drive a “big picture” perspective. You will have the ability to work autonomously, flexibly and focus on delivering results to ensure success in the role.  Requirements:Bachelor’s degree in computer science, statistics or a relevant discipline requiredMust have a minimum of 3 years of professional experience performing data analysis; combination of education and experience will be consideredTechnical understanding of XML, data models and database designProficient at writing SQL queries and experienced with one or more OLAP toolsExperience using R, SAS or other statistical software is desirable for analyzing large datasetsProgramming skills strongly preferredAdept at queries, report writing, and data visualizationExperience in statistical techniques and procedures, and knowing when their use is appropriateAbility to present complex information in an understandable and compelling mannerOk, so what’s next? Joining ResMed is more than saying “yes” to making the world a healthier place. It’s discovering a career that’s challenging, supportive and inspiring. Where a culture driven by excellence helps you not only meet your goals, but also create new ones. A role where each day you’ll uncover a new reason to love what you do. If this sounds like the workplace for you, apply now!  We thank all applicants, however, only those who are selected for an interview will be contacted. Overview: ResMed is the industry leader in providing innovative products and services that improve the lives of millions of people worldwide who have respiratory disorders. We are looking for an individual with the drive to help manage the rapid growth of ResMed’s systems and technologies. If you think you have what it takes read on.  To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed above are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  ResMed is an Equal Opportunity Employer – Minority/ Female/ Disability/ VeteransResMed participates in E-Verify. The Notice of E-Verify Participation and the Notice of Right to Work are available for your review.ResMed is a smoke-free workplace.Please note: Unsolicited resumes from employment agencies or other third parties will not be considered."}