{"jobID": "2831496894", "jobLocation": "Long_Beach_CA", "jobTitle": "Jr. Application Developer Intern", "companyRating": "3.2", "companyInfo": {"Website": "www.moffattnichol.com", "Headquarters": "Long Beach, CA", "Size": "501 to 1000 employees", "Founded": " 1946", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "40000", "jobDescription": "Moffatt & Nichol is actively searching for a Jr. Application Developer Intern to join our close-knit Product Engineering team out of our Corporate Long Beach office.In addition to developer responsibilities, this position will be responsible for in-depth troubleshooting and resolution of performance and stability issues in the production environment. Employee will consult with product owner and other team members to ensure applications are developed according to specifications in a Scrum environment.Duties and responsibilities:Author and maintain clean, consistent, and elegant code to create scalable and reliable systemsGathering and create testing scenarios, analyze, troubleshoot, and resolve production system issues and defectsConvert test cases into an automated approachProvide production support and documentation for the application and its subsystemsRegular status updates to all assigned sprint tasks in daily stand-up meetingsOther Duties:Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.Qualifications:Pursuing a Bachelor’s Degree in Computer Science (or relevant degree) with emphasis on Software EngineeringKnowledge of Relational Databases and SQLTechnical Skills:Microsoft .NET framework specifically in C#JavaScript specially AngularJS FrameworkHTML, CSS, XML, JSONAbility to write test cases well using a testing framework (i.e. NUnit, MSTest, dependency Injection)Moffatt & Nichol is a global infrastructure advisory firm of approximately 700 employees in 36 offices and 7 countries. We provide practical solutions to clients in the marine terminal, transportation, energy, environmental, federal, and urban development markets around the world. We are a multidiscipline professional services firm with specialized expertise in structural, coastal, and civil engineering; environmental sciences; economics analysis; inspection & rehabilitation; and program management solutions.Moffatt & Nichol’s EEO StatementAs a global business, Moffatt & Nichol relies on diversity of culture and thought to deliver on our goal of Creative People, Practical solutions serving our client needs, and ensures nondiscrimination in all programs and activities in accordance with Title VI and VII of the Civil rights Act of 1964. We continuously seek talented, qualified employees in our world-wide operations regardless of race, color, sex/gender, including gender identity and expression, sexual orientation, pregnancy, national origin, religion, disability, age, marital status, citizen status, protected veteran status, or any other protected classification under country or local law. Moffatt & Nichol is proud to be an Equal Employment Opportunity/ Affirmative Action Employer/ Federal Contractor desiring priority referrals of all protected veterans for job openings. "}