{"jobID": "2796781370", "jobLocation": "San_Francisco_CA", "jobTitle": "Staff Intern", "companyRating": null, "companyInfo": {"Website": "www.errg.com", "Headquarters": "Martinez, CA", "Size": "201 to 500 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " ECC, Tetra Tech, CH2M"}, "estimatedSalary": null, "jobDescription": "SUMMER INTERNSHIP for STAFF ENGINEER, GEOLOGIST or SCIENTISTSummary: Assist with planning and performing environmental work involving collection of environmental data from site investigations and oversight of construction activities. Essential Duties and Responsibilities:Conduct field work and support ERRG project staff as requested.Acquire and analyze data as directed.Communicate effectively with others; ask appropriate questions to clarify expectations and promote learning.Work effectively, both independently and as part of a dynamic team.Accept responsibility for meeting standards of quality required by ERRG.Manage multiple tasks with changing priorities.Accept responsibility for meeting standards of quality required by ERRG.Take ownership of assignments and follow through to completion.Meet internal deadlines.Adhere to project-specific and corporate-wide safety policies.Thorough and accurate when reviewing/checking own work.Manage field records and maintains adequate documentation.Forecast personal utilization and notify group leader / project manager of availability. Minimum Qualifications:2-3 years higher education in Engineering, Construction Management, Geology, Environmental Science or related field.Knowledge of MS Word Office Suite Products.40 hour HAZWOPER training and 8 hour HAZWOPER Refresher. (Company sponsorship may be available for HAZWOPER training)May be required to travel up to 25 to 50% of the time to project sites. ERRG is proud to be an affirmative action / equal opportunity employer. All qualified applicants will receive consideration without regard to race, creed, gender, marital status, sexual orientation, citizenship status, color, religion, national origin, age, disability, veteran status, or any other status protected under local, state or federal laws."}