{"jobID": "2815697053", "jobLocation": "New_York_NY", "jobTitle": "Warehouse Person", "companyRating": null, "companyInfo": {"Website": "www.rcn.com", "Headquarters": "Princeton, NJ", "Size": "1001 to 5000 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Telecommunications", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Requisition Number 18-0184 Post Date 6/14/2018 Title Warehouse Person City New York State NY Description RCN, a growing leader in telecommunications is seeking dynamic individuals to join our team as a Warehouse Associate. We are a \"Triple Play Provider (cable, internet, phone)\" offering superior customer service and advanced technology to our residential  clients. Responsibilities:The ideal candidate for this position will provide general warehouse and distribution support. Receives, stocks and issues materials as needed by technicians.Load and unload delivery and supply vehicles.Assist in monitoring inventory levels, conducting cycle counts and physical inventories. Deliver and pickup materials from other locations, in and out of state travel.Ability to perform one, some or all of the following functions: - test, screen, clean, activate, set top converters, modems, and any similar equipment - Remove bad equipment from inventory and prepare for return to manufacturer or repair facility - Monitor inventory levels, conduct cycle  accounts, and physical inventories Ability to drive large warehouse delivery vehicle.Other duties as assignedQualifications:High school diploma or equivalent is necessaryAbility to lift 75 pounds is necessaryValid driver’s license is necessaryComputer literate is necessaryAbility to operate a forklift is required for some marketsPrevious experience is preferredMinimum one (1) year of Warehouse Technician or related experience necessary Ability to do CPE work as outlined aboveWill also require driving warehouse box truck to deliver and pick up items.Ability to work overtime and weekend work.The ideal candidate must possess strong verbal skills and be a self-starter. RCN offers ongoing training, tuition reimbursement, competitive salary & benefits package, 401K and much more!  We are proud to be an EEO/AA employer M/F/D/V. We maintain a drug-free workplace and perform pre-employment substance abuse testing. Requirements - High school diploma or equivalent is necessary Ability to lift 75 pounds is necessaryValid driver’s license is necessaryComputer literate is necessaryAbility to operate a forklift is required for some marketsPrevious experience is preferredMinimum one (1) year of Warehouse Technician or related experience necessary Ability to do CPE work as outlined aboveWill also require driving warehouse box truck to deliver and pick up items.Ability to work overtime and weekend work.The ideal candidate must possess strong verbal skills and be a self-starter."}