{"jobID": "2796367398", "jobLocation": "San_Francisco_CA", "jobTitle": "Lead Data Analyst, Experimentation", "companyRating": "4.5", "companyInfo": {"Website": "www.sojern.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "103000", "jobDescription": "The Company Want to be part of a fantastic and fun startup that's revolutionizing the online travel advertising space? Want to join a data science team that's growing fast and making a big impact on the business? Come join us at Sojern!  On the Deloitte Fast 500 for five years running, Sojern applies technology to the travel advertising space, delivering $10B in bookings for the thousands of hotel, airline, and cruise companies that make up our customer base. The Team It is an exciting time to join the data science team at Sojern: business is booming, and the team plays a key role in Sojern's mission by automating, analyzing, modeling, testing and optimizing the way we target potential travelers with the most relevant and timely travel ads. The Role We are looking for a data analyst with experience leading A/B testing efforts to: Develop a deep understanding of Sojern media products, optimization algorithms, and audience building techniques across programmatic display, video, native, SEM, facebook, and meta search.Work closely with product and operations teams to identify and prioritize performance optimization experiments and lead ideation, design and implementation of A/B tests.Own the backlog of experiments and communicate the test and learn roadmap along with key findings to leadership teams.Document, design, properly setup, and execute experiments within and across multiple digital advertising platforms to drive incremental performance.Analyze Sojern's rich travel data sets using SQL and Python/R to help understand customer behavior, develop POV's, motivate experiments, and drive decision-making.Be our go to expert on controlled experiments including power analysis and significance tests.Become a key part of our data science team, bridging our product goals and the science of controlled experiments.RequirementsDemonstrated Project Leadership Experience -- You will drive multiple testing initiatives, prioritizing tests, planning next steps and taking business context into considerationTechnical Proficiency -- SQL and one of Python/R are necessary. Experience with Tableau is a bonus.MS in CS/STEM or another Quantitative DisciplineExcellent Communication Ability -- including experience with presenting experimental findings to leadershipCollaborative Spirit -- Working with and influencing teammates, customers, and partners from different cultures and backgrounds to execute against shared goalsAd Tech or E-Commerce Experience -- 4+ years of experience with data science and controlled testing techniques as applied to Ad Tech or E-CommerceTest and Learn Mentality -- Leading A/B testing means that you're open to everyone's input, and letting the results of a well-crafted experiment inform next stepsCompany Culture At Sojern, culture is king. We keep the stress low, the dress casual, and the work interesting. No one is counting your vacation days, we trust (and encourage!) our employees to take the time they need. We regularly eat out as a team, provide the hardware you'll need, and otherwise let you dig in!  Recognized on the Top Company Cultures list by Entrepreneur Magazine, Sojern is headquartered in San Francisco, with teams based in Dubai, Dublin, Hong Kong, London, Mexico City, New York, Omaha, Paris, Singapore, and Sydney. For more information, visit www.sojern.com."}