{"jobID": "2733762623", "jobLocation": "New_York_NY", "jobTitle": "Named Account Sales Executive, Security Software - NY / NJ", "companyRating": null, "companyInfo": {"Website": "www.microfocus.com", "Headquarters": "Newbury, United Kingdom", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (MCRO) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " SAP, EMC, Oracle"}, "estimatedSalary": null, "jobDescription": " NAMED ACCOUNTS SALES REP, IDENTITY & SECURITY PRODUCTS  Micro Focus  New York Metro Area  Opportunity abounds at Micro Focus now the worlds 7th largest pure-play software company. The robust offerings of Micro Focus and HPE Software have been brought together to create a bigger, better software-focused company that is unparalleled in the depth and breadth of our portfolio. Take charge of your future and join our dynamic, motivated Sales team as we make a powerful impact on the worlds software landscape. About the Role Micro Focus is seeking an energetic, self-driven enterprise software Named Account Executive to lead large and strategic named accounts throughout the West Pacific Territory in the NYC/NJ area for Enterprise Security Products (ESP).  In this role, you will: Apply understanding of Micro Focus strategy and portfolio to customer priorities and build a plan that drives revenue growth and customer success.Initiate sales activities to drive pipeline growth, close deals and ensure revenue goals are exceeded.Be a subject matter expert who understands the market and competitive landscape to deliver winning solutions for our customers.Qualifications5+ years successful of software sales experience in similar space/accounts with proven track record in: Developing deep customer relationshipsCreating strong business relationshipsNegotiating large enterprise software dealsDemonstrated, verifiable achievement of consistent, over quota attainment.Great communication skills, collaboration, and ability to navigate a matrixed organization.Bachelors degree preferred.Locations: NYC / NJ area  If you want to be part of what's next and find out more about our available opportunities, visit Micro Focus Careers. The Unique Value of Micro Focus At Micro Focus we provide our customers with a best-in-class portfolio of enterprise-grade scalable software with analytics built in. We put customers at the center of our innovation and build high quality products that our teams can be proud of.  Through our breadth of solutions, we are uniquely positioned to help our customers solve business problems and deliver against the needs and opportunities of Hybrid IT, from mainframe to mobile to cloud. Were a pure-play software company we have a level of focus that other technology companies dont have, we are designed from the ground up to build, sell and support software.  We also have the strong operational foundation, proven over a combined 40 years of experience, to deliver on our commitments to our customers. Our scale is globalwe have the reach and the capabilities to support customers in a global market. We are the 7th largest software company in the world, and the largest technology company listed on the FTSE. With 4,000 employees working on R&D;, we can focus on innovating in solving the most complex technology problems for customers.  At its heart, Hybrid IT is about letting customers choose whats right for them, without the need to compromise. Our job is to help them, and to enable that hybrid model to bridge the old and the new to maximize the value of existing investments.  *LI-JG1"}