{"jobID": "2745598047", "jobLocation": "Santa_Clara_CA", "jobTitle": "Senior ASIC Design Engineer", "companyRating": "3.7", "companyInfo": {"Website": "www.marvell.com", "Headquarters": "Santa Clara, CA", "Size": "1001 to 5000 employees", "Founded": " 1995", "Type": " Company - Public (MRVL) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "116000", "jobDescription": "The Data Storage SOC Mobile is exciting, rewarding and dynamic, with many opportunities for professional growth for a motivated candidate. As part of Marvell's Data Storage division we develop and implement the leading edge System-on-Chip solutions. You work closely with your peers, test engineers, field application engineers and product engineers to find the optimal and most cost efficient solution for our customers. Responsibilities include design and integrate IPs for System-on-Chip solution using state-of-the-art IC design methodologies and design flows. Perform RTL coding.Perform functional verification of design on block and system level.Perform synthesis and timing closure.Perform ATPG and test pattern generation.Provide design documentation, description and information to application engineers, test engineers, production engineers, and customersRequired Qualifications:BS in Electrical Engineering/Computer Engineering and at least 10 years of experience in ASIC/SOC designFamiliar with digital IC design methodologies, understands all stages of ASIC design flows, and is experienced with state-of-the-art design tools.Strong in logic design and verification, and has solid knowledge of related VLSI architectures.Knowledge of HDL and experience in behavioral and RTL coding, Verilog preferred.Knowledge of verification of design at block and system level.Knowledge of logic synthesis and timing analysis.Knowledge of SCAN/DFT.Preferred Qualifications: •10 + years of experience in ASIC/SOC design  •Knowledge of CDC#LI-DS1#GLDR"}