{"jobID": "2729611333", "jobLocation": "Mountain_View_CA", "jobTitle": "Big Data - Big Data Platform Intern", "companyRating": null, "companyInfo": {"Website": "www.jd.com", "Headquarters": "Beijing, China", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Public (JD) ", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Responsibilities: We are looking for interns who are passionate about big data and machine learning technologies. In this internship, you will mainly work on one or more of the following areas: Research and design efficient and reliable resource scheduling algorithm to run big data analysis, machine learning stacks and online serving jobs.Research advanced performance optimization for big data analysis technologies, e.g. Spark, Flink.Research and implement strong resource isolation mechanisms with container technique.Research for distributed object and file storage system.Research, design and implement machine learning platform on top of big data.Publish top-tier conference papers or technical report.Qualifications:PhD candidate in Computer Science or related disciplines.Background: expertise on distributed/high performance computation, distributed storage and database, operating system, or resource scheduling, etc.Experiences with big data technologies, e.g. Hadoop/Yarn, Spark, Flink.3 + years programming experiences in at least one of C++, go, python, Java/Scala.Proved track records of publication on top tier conferences and journals.Passionate about computer system research work.Team player and self-starter with a positive attitude.Experience with containers and its orchestration is a plus.About JD Big Data Platform Group By leveraging vast amounts of rich data and our internal computational resources, our team is able to deliver continuous innovation to our big data platform and all of our products/services for the JD Group. Some of our innovations include, but are not limited to, state-of-the-art computer vision-based AI services, enhancing the JD.com website experience and optimizing JDs supply chain, warehousing and overall global operations. JD.com is an Equal Opportunity Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class."}