{"jobID": "2767713731", "jobLocation": "San_Jose_CA", "jobTitle": "Facilitator II", "companyRating": "4.1", "companyInfo": {"Website": "www.unitycare.org", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 1993", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "47000", "jobDescription": " Job Title  Facilitator II  Position  ID 27076580 Duration  Location  San Jose,  CA 95126 Other Location  DescriptionOVERVIEW: Under the general direction of the Clinical Program Director, the Facilitator II develops and implements Individualized Child and Family Plans for youth and families/caregivers referred from the Juvenile Probation Department and Department of Family and Children’s Services to Unity Care Group’s Wraparound services. This position develops a mental health assessment and treatment plan and assures that they are being implemented through the Individualized Child and Family Plan, Wraparound team, therapists, and other service providers. The Facilitator II works from a strengths-and-needs-based philosophy, assuring that families have voice and choice, and that public mandates are met. Responsibilities and duties require the ability to assess and strategize with the team, lead individual teams, explain and lead others, and influence and negotiate in matters of complexity. DIRECT REPORTS:NoneQUALIFICATIONS:RequiredMaster’s Degree in Mental Health/Social Services field or license-eligible intern.Demonstrated Bilingual/bicultural (Spanish/English) MANDATORYAbility to be licensed-waivered (registered intern status as a MSW Intern, MFT Intern, or Registered Psychologist).Minimum 2-3 years’ experience working with high-needs children and their families.Good verbal & written skills. Strong computer experience with MS word and Excel.Proficient and timely in the proper documentation of direct services consistent with MediCal regulations and Agency/Program Policies and Procedures. Documents necessary information as required within the program, including but not limited to client demographics and progress documentation, report writing and accurate data collection to assess progress and outcomeParticipates in internal audits.Attends all mandatory meetings and trainings.Maintains excellent time-management skills. Effective personal organizational systems for ensuring paperwork/information management (filing, updating community resources, flex fund paperwork management) are developed and maintained to support timelines and priorities.Maintains a high level of direct and proactive communicationMaintains a positive attitude during work hours and seeks out support to problem-solve self-care matters.Utilizes and seeks out supervision opportunities, consultation and training as necessary to provide high quality services to children and their families as effectively and efficiently as possible.Maintains professional standards regarding Client’s Rights. Demonstrates an understanding of and adherence to laws, ethics and policies regarding mandated child abuse reporting, duty to warn, confidentiality, dual relationships and the protection of the welfare of the client, family, and community.PreferredLicensedExperience working in mental health setting emphasizing a family systems perspectiveSkills in crisis intervention, suicide assessment, conflict resolution, and interpersonal communicationSkills and experience in dealing with substance abuse, gang involvement, and domestic violence issuesSpecialized knowledge and/or abilities in positive behavioral management, recreational, art therapyExperience with MediCal billing policies and procedures, and processing MediCal billing in a timely mannerExperience interfacing with schools, County Probation, Dept. of Social Services, the Mental Health, Child Welfare and/or Juvenile Probation SystemsExperience working with the Wraparound process and in facilitationRESPONSIBILITIES INCLUDE (but not limited to):Provides quality, culturally relevant Wraparound services to approximately 6 high-needs youth and their families/caregivers, utilizing the Wraparound approach, service supports and best practices in both community and in-home settings.Coordinates the Wraparound process, and leads teams in engaging with the youth and family, building the family team, identifying strengths, developing outcomes and identifying needs in domain-based areas. Assures the resources are accessed to necessary to meet those needs.Develops an initial safety plan, and refines it on an ongoing basis.Develops an initial Respite plan and keeps it viable and updated.Works with a team for each youth/family, and guides the Family Specialist and Parent Partner in meeting identified needs.Advocates and empowers families in identifying/creating permanent connections, helping the Team create goals and strategies to enhance youth’s well-being and their self-determined quality of life.Assists the youth and family in transition planning for graduation from Wraparound service and referral for aftercare services.Incorporates best practices into the plan i.e. may utilize a functional behavioral assessment along with the traditional strengths based assessment and wrap approach, incorporating behavioral or cognitive-behavioral strategies into the plan, along with accessing informal and culturally oriented resources and activities, always outcome focused.Works collaboratively with other agency staff and with individuals and agencies in the community to ensure relevance, accessibility, and quality of service provided to youth and their families. Participates in the development and implementation of such collaborative programming.Monitors therapy and other interventions in the plan to assure that they are EBT or best practice, culturally relevant, and with measurable outcomes.Documents necessary information as required within Unity Care Wraparound Program standards, and State and County requirements, in a timely manner. This includes the MH assessment and treatment plans, opening forms, the Family Support plan, progress notes, accurate and timely data collection, and updating of Family Plans as necessary to assess progress in specified strategies and outcomes.Collects evaluative data as requested by the agency.Maintains professional standards regarding client rights.Demonstrates an understanding of confidentiality policies, mandated child abuse reporting and duty to warn procedures. Utilizes clinical supervision in any case where these issues are in question.Participates in the 24-hour on-call response team rotation together with other Family Specialists and Facilitators as a resource to families.Prepares presentations for Santa Clara County Departments of Probation, Social Services and Mental Health regarding the families with whom they work, for community team plan review, community team oversight committee etc.Utilizes supervision, consultation and training as necessary to continue to provide high quality services to youth and their families as effectively and efficiently as possible.Adheres to Wraparound principles with regards to financial support and the use of program Flex Funds.Utilizes community linkage resources to best meet the needs of the youth and families served.Follows agency standards.Other duties as assigned.ESSENTIAL DUTIES: To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform essential job functions. Ability to read and interpret documents and procedure manuals. Ability to write routine reports and correspondenceAbility to speak effectively before groups of students or employees of organizationAbility to apply common sense understanding to carry out instructions furnished in written, oral, or diagram form.Ability to deal with problems involving several concrete variables in standardized situationsAbility to identify negative disruptive behaviors and redirect behavior using mediation techniquesWhile performing the duties of this job, the employee is occasionally required to stand; walk; sit; use hands to handle, or feel objects, tools or controls; reach with hands and arms; climb stairs; balance; stoop; kneel, crouch or crawl; talk or hear; taste or smell.The employee must occasionally lift and/or move up to 50 pounds.The employee may be required to make and/or receive physical contact in the process of delivering First Aid/CPR or Handle with Care, or in training to those methods.Specific vision abilities required by the job include close vision, distance vision, color vision, peripheral vision, depth perception, and the ability to adjust focus.Ability to get CPR and First Aid certificate within 30 days of start date, and maintain a current certificateMust clear a Department of Justice (DOJ) and Federal Bureau of Investigation (FBI) background check including fingerprinting before start date and maintain clearanceMust clear a health screening, including TB before start date and maintain clearanceMust be at least 21 years of age and able to work in a Community Care Licensed FacilityMust be able to drive, have a valid driver’s license, clean driving record and maintain a clean driving record.Meet and maintain the minimum vehicle liability and property insurance limits (in order to be insured by our insurance carrier for transportation of residents)COMPENSATION: We value our employees’ time and efforts. If you are committed to helping others, we work to maintain the best possible environment for our employees where people can learn and grow with the organization. Plus we are committed to your success and offer competitive compensation and an excellent benefits package which includes paid vacation and sick time, medical, dental, vision and life insurance for all full time staff. We strive to provide a collaborative, creative environment where each person feels encouraged to contribute to our processes, decisions, planning and culture. TO APPLY: Please send a resume and compelling letter of interest indicating how your skills, knowledge and experience match the responsibilities articulated in the job description in confidence to:  Deepika Bettadapura  dbettadapura@unitycare.org  408-971-9822Openings  2"}