{"jobID": "2807256973", "jobLocation": "San_Jose_CA", "jobTitle": "Sales Manager - Mercedes-Benz", "companyRating": null, "companyInfo": {"Website": "www.autonation.com", "Headquarters": "Fort Lauderdale, FL", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public (AN) ", "Industry": " Retail", "Revenue": " $10+ billion (USD) per year", "Competitors": " Sonic Automotive, CarMax, Asbury Automotive"}, "estimatedSalary": null, "jobDescription": "Position Overview The Sales Manager has the opportunity to lead a sales team to create an exceptional experience for customers. This role is responsible for selecting, training, coaching, developing and retaining the very best Sales Associates for the store and driving a high-level of performance among the sales team to increase market share, achieve targeted unit sales and profit margins while delighting every Customer along the way. Who Would I Interact With? This position interacts daily with Customers, Sales Associates, other Managers, Financial Services Manager, and support staff, just to name a few.  What are the day-to-day responsibilities?Leading yourself and the team in a way that supports AutoNation’s Vision and MissionSetting a clear vision and goals for the sales team to achieve targeted performance in new and used vehicle sales and profitEngaging and motivating the team to achieve key goals, performance expectations and AutoNation best practice processesDriving the business through a high-level of involvement in the day-to-day operationsManaging the negotiation process with Sales Associates ensuring that customers understand their vehicle purchase options and pricingAppraising vehicles for tradeManaging all three areas of customer traffic: Showroom, E-Commerce, and PhonesPartnering with General Manager and/or General Sales Manager to plan and manage new and used vehicle inventoryAssisting in managing controllable expense elements for the New and Used Vehicle DepartmentsAnalyzing the business to determine shortfalls and developing action plans to improve performanceHow will I know if I am successful?The performance of a Sales Manager is measured by achieving:Targeted unit sales and gross profitTargeted Associate retentionTargeted Customer Satisfaction IndexWhat are the requirements for this job?High School diploma or equivalentProven success in auto retail salesProven leadership ability to mentor and train othersAbility to set and achieve targeted goalsAbility to drive an exceptional Customer experienceDemonstrated communication and interpersonal skillsOrganization and follow-up skillsExperience and desire to work with technologyValid in-state driver’s license and have and maintain an acceptable, safe driving recordWhat are the opportunities for career growth?Our Sales Managers have a few options for career growth and development after success in this role. Opportunities may include:Used Vehicle ManagerFinancial Services DirectorAutoNation is an equal opportunity employer and a drug-free workplace."}