{"jobID": "2814251874", "jobLocation": "San_Francisco_CA", "jobTitle": "Fraud Analyst", "companyRating": null, "companyInfo": {"Website": "www.platphormcorp.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Platphorm is looking for an experienced Fraud Analyst with a strong background in credit card processing, billing and fraud with a passion for catching the bad guys! Platphorm builds innovative multi-modal information exchanges, and provides a soup-to-nuts system that allows businesses to build scalable, reliable marketplaces where buyers pay sellers for information delivered by voice, mail, chat, SMS, or recorded phone message.  The marketplace we've built enables anyone to provide fee-based advice in their area of expertise, at a price of their choosing, and for others to find them and pay for a conversation. The interaction can take place over the phone, email, text, or chat. We are a growing company offering a great opportunity for the right candidate! Responsibilities: Conduct manual review of transactions that have been identified as high risk and suggest changes to streamline the review processProcess chargebacks and cardholder claims of fraudReview member account activity for potential fraud and/or abuseIdentify and investigate potential fraudulent transactions and money laundering ringsEnsure fraud levels remain well below the limits required by Visa, MasterCard, DiscoverCreate and maintain weekly reports on fraud rates and chargeback ratesMonitor internal and industry-wide fraud trends and make recommendations to address themQualifications: Bachelor's degree or equivalentMust be comfortable with adult content1+ years experience working with CNP transactions and credit card risk. Experience with digital goods and payment processors preferable but not requiredStrong understanding of the card-not-present transactions including the Visa Chargeback Monitoring program, MasterCard’s Excessive Chargeback Program, fraud trends and best practicesComfortable working in G Suite with a strong understanding of Google Sheets and ExcelWorking knowledge of SQL with the ability to edit and execute basic queries. Ability to write advanced queries a plusProactive in identifying problems and using initiative to resolve themEnjoy being part of a small team and willing to help out with duties outside the scope of your jobBenefits:Health/dental, vision, insurance401KGreat work/life balanceMacBook Pro and 2nd monitorAdjustable work desksSnacks and Friday Happy Hours!Great location! Our San Francisco office is steps from the Powell BART/Muni station!"}