{"jobID": "2820907432", "jobLocation": "San_Jose_CA", "jobTitle": "Financial Services Rep. I - Contact Center, San Jose, Req", "companyRating": "4.1", "companyInfo": {"Website": "www.meriwest.com", "Headquarters": "San Jose, CA", "Size": "201 to 500 employees", "Founded": " 1961", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "50000", "jobDescription": "Financial Services Representative IContact CenterSan Jose Position SummaryProvides personalized service to members via alternate channels (phone, email, web, fax, chat and in person) in order to attract, enhance, and retain member relationships. Incorporates Service Plus into all aspects of member contacts and continually builds relationships with members in order to retain and increase memberships. Further enhances these relationships through the cross-selling of products and services to meet all the members' financial needs. Understands the detailed features and benefits of all products and services available and presents them in a professional manner. Strives to meet assigned goals, including but not limited to share, deposit, lending and referral partner goals. Supports the Credit Union in all initiatives with a positive attitude and a willingness to get the job done.  Essential Duties and ResponsibilitiesEffectively makes presentations to members on all deposit, loan and business banking products in an understandable manner.Ability to analyze member's financial needs and ask leading questions to effectively cross-sell products and services.Assist members in opening all checking, savings and certificate products and provide members with dividend projections by the use of the system calculation form.Answers questions about accounts and troubleshoots any problems/concerns that may arise during the conversation.Performs other duties as assigned.  Minimum QualificationsMinimum of one to three years prior Credit Union or Banking Experience highly preferred, at least one of which should be in new accounts and product sales.Must be sales oriented and have a strong desire to continually surpass goals and sales targets.Must have excellent communication skills in order to make professional and effective presentations to members. Ability to promote all credit union products and services to members and overcome objections and concerns.Strong customer service focus with previous experience in a service industry.NMLS SAFE ACT compliant. This position requires that you obtain, and maintain, a National Mortgage Licensing System (NMLS) number as required by SAFE Act.Must be PC literate; experience with banking software a plus.Ability to work 9am - 6pm shift.Do you want to be valued as an employee?Employees are Meriwest’s most valuable resource. We provide competitive wages and a supportive environment that promotes career advancement. We also offer an excellent, fully comprehensive benefits program, including: Medical/Dental/Vision on the first day of employment for full-time employeesFree Long Term Care Insurance for employeesEducation AssistancePension Plan/401KBonus and incentive potentialGenerous Paid Time Off (PTO)/Holiday programCareer growth support and planning programsIn-house fitness centerDiscounts on new Mortgage after 6 months of employmentWe are an EOE. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of disability or veteran status.To apply please reference Req. #3170 "}