{"jobID": "2736072406", "jobLocation": "Boston_MA", "jobTitle": "CLINICAL DATA ANALYST, Student Health Services", "companyRating": "4.2", "companyInfo": {"Website": "www.bu.edu", "Headquarters": "Boston, MA", "Size": "10000+ employees", "Founded": " 1839", "Type": " College / University", "Industry": " Education", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "55000", "jobDescription": " CLINICAL DATA ANALYST, Student Health ServicesTracking Code  5849/D1718  Job DescriptionThe Clinical Data Analyst will manage reporting projects end-to-end including requirement gathering, collaboration with team members, data integrity and quality assurance, production of final report and dashboard packages, and identifying trends and communicating these results to leadership. This individual will work with both technical and clinical teams to fully understand and influence clinical processes, and use this information to create and maintain clinical templates and reporting standards for all departments. The successful candidate must demonstrate critical analysis skills and an understanding of clinical data and processes. Candidate should have experience with Electronic Medical Records and reporting and analytics tools.Required SkillsBachelor's degree in computer science, analytics, or health sciences related field. Master's degree preferred Analytical problem solving skills to review, identify, and resolve clinical issues that would potentially affect quality of care and organization of useful data. Knowledge in theory and application of the quality improvement process as well as general knowledge of and use of the EMR/EHR for data mining and reporting. SQL programming and reporting services (SSRS) experience preferred EHR/EMR experience preferred Qlik experience a plus Boston University Student Health Services is an Essential Service to the university.  We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law. We are a VEVRAA Federal Contractor.Job Location  BOSTON, Massachusetts, United States  Position Type  Full-Time/RegularSalaryGrade 74"}