{"jobID": "2619032208", "jobLocation": "Campbell_CA", "jobTitle": "Manager, Physical Plant Operations", "companyRating": "3.7", "companyInfo": {"Website": "www.upliftfs.org", "Headquarters": "Campbell, CA", "Size": "501 to 1000 employees", "Founded": " 1867", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": "Title: Manager, Physical Plant Operations Classification: Exempt Job Code: 317 Job Summary Works within the vision, mission and philosophy of the agency. Is responsible for the daily oversight of agency facilities, buildings, and locations to ensure quality cleanliness, maintenance, and safety. Ensures all agency facilities, buildings, and locations are in compliance with federal, state, county, and local codes, rules, and regulations. Manages the mobility, relocation, and storage of agency equipment, hardware, materials, and supplies. Maintains strong cooperative working relationships with external vendors. Essential DutiesManages the Buildings Maintenance, Housekeeping, Janitorial Maintenance, and Grounds Maintenance crews.Plans and supervises the work of supervisory, skilled, and semi-skilled workers in the operation, maintenance, and new construction of agency facilities.Manages and instructs custodial personnel in maximum utilization of labor using power equipment and efficient work techniques.Conducts staff meetings, team building and employee evaluations.Evaluates and verifies employee performance through the review of completed work assignments and techniques.Trains employees in job skills, work regulations, cleaning methods, use of equipment, safety practices, firefighting, and hazard prevention.Plans and oversees response system for building emergencies. Determines and coordinates with Safety Manager for the management of specific emergency situations or issues.Ensures that all facilities’ operations and maintenance repairs are completed safely and according to federal, state, county, and local regulations, including electrical and building codes. Inspects completed work for conformance to blueprints, specifications, and standards.Plans and implements short-term and long-term operations and building maintenance schedules for activities including, but not limited to carpentry, electrical, masonry, painting, and plumbing.Manages and maintains the daily operations of the agency’s facilities, buildings, locations, and maintenance to ensure an aesthetic quality, safe, and healthy environment.Manages inspections of agency facilities to ensure proper maintenance, health cleanliness and sanitation, and safety.Manages and enforces agency compliance with emergency evacuations and building, fire, and safety guidelines and regulations.Manages and coordinates all internal/external storage, moves, relocations, and construction projects; interacts with onsite providers; and maintains strong cooperative working relationships with vendors.Maintains and documents the complete inventory of equipment.Develops, implements, and monitors preventative maintenance schedules to ensure maximum longevity of equipment.Develops plans for new equipment installations and the rehabilitation or modernization of existing facilities.Develops and disseminates policies pertaining to the construction, operation, maintenance, materials handling, and safety of the agency facilities, buildings, and locations.Assists with the management of the facilities budget and performs cost analysis, cost avoidance, and cost projections.Works with Fund Development to come up with projects for volunteer groups.Coordinates all donation pickups for agency.Performs other related responsibilities, as assigned, to support specific department/business needs.Education RequirementsHigh School Diploma or General Education Development (GED) required.Preferred QualificationsBachelor’s Degree (BS) in Structural Engineering preferred.Experience RequirementsFour (4) years of experience gained through increasingly responsible positions in facilities, plant operations, or construction required.Two (2) years of facilities management experience that includes maintenance, repairs, and safety required.Three (3) years of experience in trades Preferred Other Specific Requirements Must be available to respond on weekends and during the evening for emergencies and in the event of any break in security.May be placed on-call to work extended hours, as required by agency management or facility needs.Excellent verbal and written communication skills required.Competent in Microsoft Office applications such as Word, Excel, Access, and Outlook required.Good negotiation and decision-making skills required.Excellent knowledge of Building, Health, and Safety Codes, in compliance with federal, state, county, and local rules and regulations required.Preferred QualificationsThree (3) years of experience in the trades preferred.Prior employment as a Journey Level in a minimum of one trade such as Electrician, Carpenter, Plumber, Heating, Ventilation, and Air Conditioning (HVAC), or related fields preferred.Strong knowledge of AutoCAD preferred.Strong knowledge and understanding of Geometry or Trigonometry preferred.Highly Desirable QualificationsLicensure as a Professional Engineer (PE) by the National Council of Examiners for Engineering and Surveying (NCEES) preferredSpeak, read, and/or write another language preferred.Other Specific RequirementsMust pass Department of Justice (DOJ), Federal Bureau of Investigations (FBI), and Child Abuse Index Check (CAIC) background clearance.Valid California Driver's license with two years of experience driving and clean driving record may be required.Work Environment/Conditions Reasonable accommodations may be made to enable qualified individuals with disabilities to perform the essential functions.  While performing the duties of this job, the employee may be required to use hands to handle or feel objects, tools or controls; reach with hands and arms; and taste or smell. Specific vision abilities required by the job include close vision, distance vision, color vision, peripheral vision, depth perception and the ability to adjust focus.  In addition this position requires sitting, standing, walking, kneeling, and climbing. Employee Statement of Understanding I have read and understand the job description for my position. I am able to perform all of the essential functions of this position. I agree to successfully complete all required training indicated for this position. I agree to keep all of my required certifications and licenses current and up to date and provide proper documentation of the same to the Human Resources Department. I agree to comply with all Agency policies and procedures. I agree to comply with the agency compliance plan and all laws, rules, regulations and standards of conduct relating to my position. As an employee, I understand my duty to report any suspected violations of the law or the standards of conduct to my immediate supervisor. As an employee, I will strive to uphold the mission and vision of the organization. All employees are required to adhere to the values in all their interactions with youth and families and fellow employees."}