{"jobID": "2814718306", "jobLocation": "New_York_NY", "jobTitle": "Junior Data Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.forafinancial.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "45000", "jobDescription": " Fora Financial, located in NYC, is a leading financial services company providing working capital to small and mid-size businesses nationwide.  Established in 2008, we support small businesses in need of financing to sustain or grow their enterprise by providing innovative, customized, and flexible working capital solutions. We operate through a consultative approach, listening to customers and providing what best meets their needs in an ever-changing financial market. To date, Fora Financial has funded over 22,000 individual transactions to more than 15,000 unique customers. The company has funded over $750 million in working capital solutions for small businesses since its inception. A Day in the Life of an Junior Data Analyst:Coordinate and collect input data from different departments, check data integrity, summarize and analyze data to communicate output to senior management.Work with stakeholders from all departments to define metrics, capture data, and build informative dashboards and reporting.Assist with preparation of month-end close materials and assembly of reporting for the CFO and board of directors.Research and prepare additional ad-hoc analyses needed by senior management, including risk analyses, product profitability, unit economics, ROI analyses, etc.Track news and trends on industry competitors and convey relevant qualitative and quantitative findings to senior management.What You Have: Bachelor's degree in Statistics, Data Science, Economics, Finance, or related field1+ year of professional work experience as a business/data analystStrong analytical and problem-solving skills, including ability to mine large datasets and draw meaningful conclusionsAdvanced Microsoft Excel proficiency( INDEX, MATCH, VLOOKUP, HLOOKUP, SUMIF, etc.)Experience with SQL and other advanced analytical tools is a strong plusExcellent communication skills with the ability to summarize and present data driven insights to technical and non-technical stakeholdersComfortable working independently in a fast-paced, entrepreneurial environmentDesire to impact company growth plan by developing and performing critical analysesSelf starter who has intellectual curiosity, shows initiative and is capable of driving a project from start to finishThe Benefits of Working for Fora Financial:Competitive Base SalaryMedical, Dental, Vision Coverage401K MatchLife Insurance at No Cost to EmployeesGenerous Time Off Plan Including Rollover Vacation DaysCommuter BenefitsHealth Care and Dependent Care Flexible Spending "}