{"jobID": "2829163906", "jobLocation": "Chestnut_Hill_MA", "jobTitle": "Senior Data Analyst", "companyRating": "4.2", "companyInfo": {"Website": "www.bc.edu", "Headquarters": "Chestnut Hill, MA", "Size": "1001 to 5000 employees", "Founded": " 1863", "Type": " College / University", "Industry": " Education", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "57000", "jobDescription": "Boston College Introduction Founded in 1863, Boston College is a Jesuit, Catholic university located six miles from downtown Boston with an enrollment of 9,150 full-time undergraduates and 4,420 graduate and professional students. Ranked 31 among national universities, Boston College has 758 full-time and 1,096 FTE faculty, 2,750 non-faculty employees, an operating budget of $956 million, and an endowment in excess of $2.2 billion. Job DescriptionThe Senior Data Analyst is a key contributor to the advancement analytics function of the Prospect Development team, and reports to the team’s Director. This role is critical to the delivery of data analytic insights to support University Advancement (UA).  As Boston College endeavors to advance the priorities of its strategic plan, deeper engagement of its constituents and greater philanthropic support to the University will be critical. At the same time, effective management of its resources to achieve such advancements will be necessary. To this end, UA is prioritizing data-driven decision making among its many measures to ensure success.  The Senior Data Analyst will play an important role on data analytic projects that directly support the senior leadership of University Advancement, leaders and managers of all development and Alumni Relations teams, Advancement Marketing & Communications, and others. These projects aim to harness the power of data and analytics to drive strategic decisions, identify process improvements, and measure progress and success. The Senior Data Analyst will need to understand key issues in the organization, help define the scope of analyses, acquire the relevant data, perform statistical modeling or other analyses, and prepare reports and presentations that are accurate, insightful, and actionable. The Senior Data Analyst will support the Director in presenting and disseminating results, and providing thought partnership and consultation on actions and decisions.  The Senior Data Analyst has accountability over the maintenance and upkeep of specific processes that have been put in place, or will be put in place, to sustain a culture of data-driven fundraising and decision making across UA. This involves on-going review of performance and other organizational metrics, establishing quality control processes, and providing insights to the relevant parties in UA on their metrics. S/he will need to work closely with the Data & Reporting team to maximize data available for analytics, and to develop critical reports to support the implementation of data-driven decisions; identify innovations and new applications of data analytics to support advancement; and collaborate with the broader Prospect Development team. Sample projects include:Development growth strategy and planning: Support the senior leadership’s need to understand how, how much, and from whom significant growth in philanthropic resources will be achieved by analyzing prospect pools, donor behaviors, and University resources.Marketing effectiveness: Quantify the value and impact of marketing actions to guide resource allocation and strategic decisions.Predictive modeling: Leverage advanced statistics to identify the best prospects for a given development team based on the team’s goals and operational needs.Process improvement: Provide data-centered solutions to complex business processes to improve effectiveness and efficiency.  Position Details: Department: 031081 - Prospect Development  Position: 00015313 - Senior Data Analyst Hiring Range: $62,920 - $$78,650  Salary commensurate with relevant experience.Requirements This position requires a Bachelor’s degree in a quantitative field (e.g., statistics, economics, operations research, mathematics) or from a highly-quantitative academic program. To be eligible for the Senior Data Analyst position, the candidate must show evidence of aptitude in quantitative analytic techniques, self-direction, initiative and problem-solving, and have had a minimum of three years of related professional experience preferably in a client-service environment.  The candidate must be skilled at working with real-world data and executing quantitative techniques (e.g. multivariate analyses, machine learning, forecasting, and predictive modeling), with guidance from a manager, to drive towards meaningful insights that solve business problems or support decision needs; have a strong desire to improve the effectiveness and efficiency of processes and systems; have deep respect for data and analytic integrity; have experience with various analytic techniques and data types; be organized and capable of executing or leading multiple short- and long-term projects simultaneously; be a curious, independent learner.  Proficiency in statistical software (e.g., R, SAS, SPSS), programming language (e.g., Python, Java), and data visualization software (e.g., Tableau) will be valued. To be successful, must be a team player who is highly motivated and dedicated to the goals of advancing higher education. An appreciation for Jesuit Catholic education and the goals and values of Boston College is critical. Closing Statement Boston College conducts background checks as part of the hiring process.  Boston College is an Affirmative Action/Equal Opportunity Employer and does not discriminate on the basis of any legally protected category including disability and protected veteran status. To learn more about how BC supports diversity and inclusion throughout the university please visit the Office for Institutional Diversity at http://www.bc.edu/offices/diversity."}