{"jobID": "2822817325", "jobLocation": "San_Mateo_CA", "jobTitle": "Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.feedzai.com", "Headquarters": "San Mateo, CA", "Size": "201 to 500 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "131000", "jobDescription": " We want your incredible talent to drive growth and help our customers be successful. You are a curious person, driven by the willing of wanting to learn and looking for answers for challenging problems. You are a good-humored team player, someone who’s reliable and accountable. You care for the quality of your work and for the success of the product you help developing.  Your day–to–day As a Data Scientist, your main role is to do Data Science work on projects for our clients. Occasionally this can be done from our offices, but often this will be done at clients premises for security reasons, so there is a significant travel component involved (in some cases more than 30%)Understanding the data which our clients provide to usCleaning that data and validating that it is correctPreprocessing the data, usually by using a mixture of shell scripts and a programming language such as Python, Java, Scala, etcIteratively computing features and tuning parameters to improve the quality of the modelCommunicating your findings to the project manager and assisting him/her in decision making on the Data Science part of the projectWork together with the data scientists and engineers from our clients You know how: A PhD degree is valued but its not mandatoryPhDs from Machine Learning, Natural Language Processing, Image Processing, Signal Processing, Speech Processing, Optimization, etc are encouraged to apply. We speak your language. :)MScs from Computer Science, Electrical Engineering, Physics, Biomedical Engineering, etc, are also encouraged to applyYou should be proficient in some language, enough that you can handle data processing and algorithm implementation in that language. Most of us use Python, Java, Scala or C++. Any of those is fine, among othersYour main task will be researching new algorithms for fraud detection with Machine Learning methodsOccasionally, you will have the opportunity to travel to our clients to help implement the algorithms you developed and/or to help set up our existing ML solutions\"Publish or perish\" doesnt exist here. If you develop something novel, publication is allowed and encouraged. If its not novel but solves the problem, thats fine too"}