{"jobID": "2830649425", "jobLocation": "South_Amboy_NJ", "jobTitle": "Software Engineer Intern - Data", "companyRating": null, "companyInfo": {"Website": "www.teltech.co", "Headquarters": "South Amboy, NJ", "Size": "1 to 50 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Telecommunications", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " At TelTech, our mobile apps and services help people do new and useful things with their smartphones, such as revealing blocked callers, putting an end to spam calls, protecting the privacy of their phone number and recording phone calls. But we see our ten-year success story so far as just the beginning of our journey. We are looking to expand our team with creative, talented and passionate people who will be committed to the growth of our existing products as well as new products we intend to launch.  We are looking for an enthusiastic Data Engineering Intern to join our organization. In this role you will work closely with our data engineer and data analysts to develop and optimize our data warehouse, data pipelines, and data ingestion processes. The right candidate will be excited about learning and implementing various data technologies to power our data-driven analytics efforts.  Responsibilities: Assist data engineer with data architecture/pipeline design and maintenance initiatives.Assist product-marketing, data science, and engineering teams with data-related technical issues and support their data infrastructure needs.Participate in data governance practice to document, profile, and manage data quality across multiple products. Qualifications: Currently working towards a BS or MS in a relevant program.Proficient in SQL and programming languages (Python strongly preferred).Hands-on experience with a relational database (MySQL, PostgreSQL).Eager to learn and try various data engineering technologies.The ability to work effectively in a team environment. Pluses: Experience with cloud services (e.g. GCP/AWS).Knowledge of dimensional data warehouse modeling.Familiarity with data pipeline/workflow management tools like Airflow.Previous internship and/or project experience is a plus. What you can expect: Opportunities to growAn awesome, collaborative, fun place to workCo-workers who will make you feel like family, but challenge you to be your best In Headquarters: A well-stocked kitchen with breakfast and lunch options almost every dayAn on-site gym facility with a wellness programA game room and lounge so you can relax and recharge as needed We want “A” Players, who are driven to achieve, but know that teamwork is the key to their own success. We are a successful, self-funded company, with a fantastic Silicon Valley style office and a culture-first personality. If you think you are a good fit, please first take a close look at our RoboKiller, TrapCall, TapeACall and SpoofCard products and tell us how your story and experience can help shape TelTech’s future."}