{"jobID": "2748602055", "jobLocation": "Danvers_MA", "jobTitle": "Data Scientist I", "companyRating": "2.7", "companyInfo": {"Website": "www.hms.com", "Headquarters": "Irving, TX", "Size": "1001 to 5000 employees", "Founded": " 1974", "Type": " Company - Public (HMSY) ", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "94000", "jobDescription": " HMS makes the healthcare system work better for everyone. We fight fraud, waste, and abuse so people have access to healthcare—now and in the future. Using innovative technology and powerful data analytics, we help government and commercial payers reduce costs, increase quality, and achieve regulatory compliance. We also help consumers take a more active role in their own health. Each year, we save our clients billions of dollars while helping people live healthier lives. At HMS, you will develop new skills and build your career in a dynamic industry while making a difference in the lives of others. We are seeking a talented individual for a Data Scientist I who is mainly responsible for responding to questions from internal clients, and providing insights gathered from the data after data onboarding. The Data will work closely with business users, product owners, and others in the organization to clearly define problems and articulate questions. The incumbent would accurately answer those questions from the data and perform complex analysis to generate models that could provide potential solutions. The incumbent must be able to clearly communicate the results to non-technical users and be detail-oriented. The incumbent is also responsible in maintaining a reputation for quality and trustworthiness.Essential Responsibilities: Work with stakeholders to identify the business requirements and the expected outcome Collaborate with subject matter experts to select the relevant sources of informationWork closely with data engineers to identify gaps in data availability and qualityBecome an expert in our healthcare datasetsDesign experiments, test hypotheses, and build modelsDevelop analytic studies with an aim of delivering immediate and actionable insights to business users Work in iterative processes and validates findingsPresent findings in a clear and compelling format using visualization and storytelling, where necessary Produce new and creative analytic solutions that will become part of our core deliverablesProvide expertise on mathematical concepts for the broader analytics team and inspire the adoption of advanced analytics and data science across the entire breadth of our organizationNon-Essential Responsibilities: Performs other functions as assignedKnowledge, Skills and Abilities:Ability to translate business customer problems and questions into clear requirements for analysisAbility to write complex and efficient SQL code freehand from scratchAbility to wrangle and analyze data using Python or RStrong understanding of statistics and probabilityProficient in Microsoft Power Point, Outlook and WordAbility to work under pressure while managing competing demands and deadlinesWell organized with meticulous attention to detailGood understanding of Agile methodologyStrong sense of ownership, urgency, and driveExperience with machine learning is a plusWork Conditions and Physical Demands Primarily sedentary work in a general office environmentAbility to communicate and exchange informationAbility to comprehend and interpret documents and dataRequires occasional standing, walking, lifting, and moving objects (up to 10 lbs.)Requires manual dexterity to use computer, telephone and peripheralsMay be required to work extended hours for special business needsMay be required to travel at least 10> of time based on business needsMinimum Education:Bachelor’s Degree in CS, Statistics, Applied Mathematics or relevant major requiredMinimum Related Work Experience:2 years of work experience in a data analytics role required2 years of experience with SQL preferred2 years of experience with R or Python preferredWorking experience with BI and visualization tools Experience identifying data quality issues and working with data engineer to resolve issuesNothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time."}