{"jobID": "2790332075", "jobLocation": "Tiburon_CA", "jobTitle": "Marketing Research Intern", "companyRating": "3.3", "companyInfo": {"Website": "www.digitalfoundry.com", "Headquarters": "Belvedere Tiburon, CA", "Size": "1 to 50 employees", "Founded": " 1992", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "49000", "jobDescription": "Marketing Research InternApplyFull-Time, Tiburon, CADigital Foundry, Inc., a leading business and software consulting firm, is looking to bring on a talented sales team member at its waterfront campus in sunny Tiburon, CA. Successful candidates will sell innovative software planning and implementation services to Digital Foundry's target clientele.The CompanyDigital Foundry focuses on architecting and developing elegant, user-centric software solutions for global industry leaders. We pride ourselves on maintaining a positive, fun environment and provide a competitive benefits package to all full time employees.The PeopleWe are composed of a diverse group of intelligent, fun people who will push your thinking at every turn. Everyone here shares an intense passion for innovation and a propensity to thrive in a highly dynamic, agile working environment.ResponsibilitiesBusiness Development Associates at Digital Foundry are responsible for identifying and reporting on pure consulting opportunities with new clients. Business Development Associates are expected to be self-starters with excellent communication skills on the phone, in person, and via PowerPoint, Word, Excel, Visio and e-mail. Successful Business Development Associates make lots of prospecting calls to identify and build relationships with buyers of Digital Foundry services.Responsibilities include:zMastering the scope of Digital Foundry's business and software consulting serviceszIdentifying, building, and documenting relationships with prospective buyers of Digital Foundry serviceszUncovering, qualifying, and documenting opportunitieszAssisting business development executives, managers, and consultants with the sale of Digital Foundry serviceszReporting on prospecting activities and deal statuszProviding feedback from sales calls and customer comments to help shape sales and marketing initiativesCompensationzSuccess in the Business Development Associate position is measured by the number of opportunities identified and pursued, customer/prospect satisfaction, pipeline visibility and forecasting accuracy, financial justification, and sales team development.zDigital Foundry offers a comprehensive compensation and benefits package including a competitive salary and performance bonuses; medical, dental, and vision benefits; and a matching 401(k) retirement program. All employees get up to three weeks of time off in their first year!LocationThis position is located in Tiburon CA, a short drive or ferry ride from San Francisco.Thank you for your interest in Digital Foundry. We look forward to hearing from you!"}