{"jobID": "2787461098", "jobLocation": "New_York_NY", "jobTitle": "Sr. Systems Engineer (with Cloud Experience)", "companyRating": "3.5", "companyInfo": {"Website": "www.mindbodyonline.com", "Headquarters": "San Luis Obispo, CA", "Size": "1001 to 5000 employees", "Founded": " 2001", "Type": " Company - Public (MB) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "122000", "jobDescription": " The Systems Engineering team is responsible for end-to-end delivery of infrastructure solutions to all our SaaS customers. Individuals within this role are responsible for the operations of secure and highly available computing platforms, servers, and networks. They also maintain the ongoing reliability, performance, and support of the infrastructure. This includes monitoring the operating environments; responding to incidents, problems, and planning for growth. Individuals in this job family are also responsible for the overall operation and maintenance of the data center. Delivery of the infrastructure solution which includes a variety of skills including, hands-on build-out and configuration of the infrastructure. A high degree of collaboration with Development and other teams is required to provide the right level of agility within a defined delivery process. The ideal candidate will exhibit strong technical skills, will be forward thinking, and will be able to work effectively in a diverse, highly talented team, continuously striving for excellence.  The role of a Sr. Systems Engineer is to supplement the Operations team, supporting development and production environments. Responsibilities include ensuring the operations of the Booker SaaS product remain highly available, expanding the infrastructure to facilitate rapid growth, and ongoing troubleshooting and optimization. This position requires flexibility and passion for the success our product. Someone who can offer creative, cutting-edge solutions to problems is key.MINIMUM QUALIFICATIONS AND REQUIREMENTS:"}