{"jobID": "2582274656", "jobLocation": "Cambridge_MA", "jobTitle": "Mid-Level Data Analyst", "companyRating": "2.6", "companyInfo": {"Website": "www.cghtech.com", "Headquarters": "Washington, DC", "Size": "51 to 200 employees", "Founded": " 1989", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": "CGH Technologies, Inc. (CGH) is a business solutions firm, specializing in Data Management, Software Engineering, and Business Intelligence solutions. Located within the Washington corridor, CGH has worked successfully with Government, Commercial and International sectors, providing management, development and maintenance, and support of large and complex environments. CGH has an exciting opportunity for a seasoned Mid-Level Data Analyst to join the CGH Team. Purpose: Responsible for implementing the day-to-day needs of the data governance and data quality program. Participate in recommending and implementing policies and procedures for data governance approved by the Data Governance council and Data Governance team. Identify data quality opportunities and drive compliance with data governance and quality initiatives. Ensure data governance opportunities are identified and addressed throughout the project life cycle. Responsibilities:Participates in the execution and implementation of approved DOT data definitions, policies, standards, process data access, and dashboard statistics.Supports requests to change configurations, use, or design of data elements for specific area of influence. Conducts testing and user acceptance of new system functionality.Analyzes and identifies data sources, data, redundancy, and implements processes to remediate data issues and /or data clean-up efforts.Supports governance principles, policies, and stewardship within the business.Assists in the development and distribution of data quality dashboard.Scopes, resources, and manages data quality initiatives.Participates in the review of all system enhancements and new technologies for data needs, use, and redundancies.QualificationsNumber of Years Experience Required:5+ years in a document analyst or document writing position.Minimum Education and Certifications Required: Bachelor's degree in Business, I.T., Finance, Communication, or similar field of study is required.Technical Skills Required:Computer Skills:Proficiency in MS Office Suite, high proficiency in Excel.Strong experience in MS SuiteOther Knowledge, Skills, and Abilities Required:U.S. Citizen or person with valid U.S. Work Visa who has lived in the U.S. for three or more yearsPreference exposure to Hazardous Material Safety and related documentationDemonstrated creation and standardization of procedural documentationUnderstanding of process mapping.Strong presentation skills, both verbal and written.. Candidates selected will be subject to a Government background investigation and must meet eligibility requirements.  CGH offers a comprehensive benefits package to include medical, dental, short- and long-term disability insurance, life insurance, commuter benefit, and flexible spending account. Other benefits include 401K, paid government holidays, and Paid Time Off (PTO).  CGH is an Equal Opportunity Employer 0 Job Posted by ApplicantPro"}