{"jobID": "2828991393", "jobLocation": "New_York_NY", "jobTitle": "Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.healthsolutions.org", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " 1957", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "57000", "jobDescription": " Data Analyst Location  New York City Project Name  Department of Health and Mental Hygiene (DOHMH) Employment Status  full-timeApply NowWith an annual budget of $1.6 billion and more than 6,000 employees throughout the five boroughs, the New York City Department of Health and Mental Hygiene (NYC DOHMH) is one of the largest public health agencies in the world, serving 8 million New Yorkers from diverse ethnic and cultural backgrounds. With over 200 years of leadership in the field, we're also one of our nation's oldest public health agencies. The challenges we face range from obesity, diabetes and heart disease to HIV/AIDS, tobacco addiction and substance abuse, and the threat of bioterrorism. We're tackling these issues with innovative policies and programs and getting exceptional results, but our work is never finished. The breadth of our innovative programs provides the widest range of choices for every member of our team. Program Overview: The Bureau of Vital Statistics manages, analyzes and grants access to vital event data used for surveillance and research regarding health factors pertaining to births, death and terminations of pregnancy in New York City. Vital event data are used by most health department programs (including infectious and chronic diseases, community health, environmental/occupational health, and health care access) and reported to national agencies. Responsibilities: • Respond to data requests and data-checking to ensure high quality vital event data for analysis and provide data analysis service.  • Assist with production of Annual Summary of Vital Statistics to disseminate vital statistics data for public health use.  • Assist with analyses for Special Projects to better understand and use vital event data.  • Contribute to peer-reviewed manuscripts to provide scientific data analysis and explore answers to the questions pertain to public health. Qualifications: • Master’s degree or higher in Epidemiology, Statistics, Public Health, or a closely allied field.  • Experience using statistical analytic programs, such as SAS, R, or STATA; familiarity with Adobe Illustrator and InDesign.  • Experience with vital event data; attention to detail.  • Good oral and written communication; ability to work collaboratively.  • Strong familiarity with Microsoft Office programs, including Excel and PowerPoint.  It will take approximately 9 to 12 months to become proficient at this job. PHS is proud to be an equal opportunity employer and encourages applications from women, people of color, persons with disabilities, lesbian, gay, bisexual and transgender individuals, and veterans."}