{"jobID": "2815962264", "jobLocation": "Watertown_MA", "jobTitle": "CRM Business Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.tuftshealthplan.com", "Headquarters": "Watertown, MA", "Size": "1001 to 5000 employees", "Founded": " 1979", "Type": " Nonprofit Organization", "Industry": " Insurance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "60000", "jobDescription": " As an Analyst on the CRM team, you will be responsible for execution of administrative tasks and data management within SalesForce. You will support the continued advancement of user experience to optimize production, data collection and data cleanup. CRM BDA will support the identification of system performance gaps via user experience and feedback that impact growth, regulatory and margin goals. You will participate on project teams to execute the implementation of new functionality and updates to SFDC. This position requires strong technical aptitude and problem-solving skills, attention to detail, collaboration, positive professional attitude, and the ability to work in a matrixed team environment.  KEY RESPONSIBILITIES/ESSENTIAL FUNCTIONS* (in order of importance)  General administration functions including but not limited to campaign implementation/build out, develop lists for mail, reports etc, lead assignment and lead scoring, collaboration with the analytics team, help with user support, managing SalesForce questions from functional areas, assessment and tracking of persona behavior against profiles, help with event/sales meeting setup in CRM, upload product information, upload eligible file data, upload talking points and knowledge related documents  Maintain data quality and data cleanup in SalesForce via constant data analysis, scheduled reports, data loads and validation rules.  Collaborate with internal clients (Marketing, Analytics, Sales and Product) to optimize performance to support growth, margin and regulatory goals. Identify and solution performance gaps within SalesForce. Work with the business units to align SalesForce updates with process change. Enhance the user experience across all platforms and roles  Obtain SalesForce certification to advance capabilities EDUCATION:BS in Computer Science, Information Management or StatisticsEXPERIENCE:2 years plus experience as a Business Analyst supporting growth and margin objectivesExperience working with Sales and Marketing preferredExperience with CRM systems preferredExperience in Medicare/HealthCare preferredSKILL REQUIREMENTS:Good analytical and problem solving skillsShould be highly motivated and self-directed. Has the ability to develop excellent relationships with key stakeholders including collaborative decision makingEffective communication skills are criticalSkilled at aligning business requirements with CRM functionality WORKING CONDITIONS AND ADDITIONAL REQUIREMENTS: (include special requirements, e.g., lifting, travel, overtime) Fast paced office environment handling multiple demands. Must be able to exercise appropriate judgment as necessary.Weekends may be required during Annual Election Period (Q4) CONFIDENTIAL DATA: All information (written, verbal, electronic, etc.) that an employee encounters while working at Tufts Health Plan is considered confidential. Exposed to and required to deal with highly confidential and sensitive material and must adhere to corporate compliance policy, department guidelines/policies and all applicable laws and regulations at all times.  Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}