{"jobID": "2768522920", "jobLocation": "Jamaica_Plain_MA", "jobTitle": "Toddler/Preschool Teacher", "companyRating": null, "companyInfo": {"Headquarters": "Jamaica Plain, MA", "Size": "Unknown", "Founded": " Unknown", "Type": " Unknown", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We are looking for some \"Amazing Toddler/Preschool Teachers\"to teach in our older toddler class (mixed age). The children are 2.3 month-3.3years old. This is a very fun class that likes routines, structured play, age-appropriate academics, potty training, and lots of redirection. We love teachers that can think out the box for curriculum, loves to give hugs and kisses to the children, that's experience and ready to teach teach teach!!!!! Must be creative and willing to join a family-like team. We would love a teacher with Lots & Lots of experience with toddlers, EEC,& NEAYC. Must hold AA/BA degree in early education and be EEC-certified. If you have an AA you must be willing to go back to school.  *Responsibilities and Duties Of the Toddler /Preschool Teacher Plan both long and short-range activities in accordance with curriculum objectives developmentally appropriate practice, and program philosophy.Meet the emotional, social, physical and cognitive needs of each childEncourage assistants to contribute to curriculum planningCoordinate field tripsPrepare monthly planning chartsComplete bi-annual assessment of children's developmentReport progress of children to parents in bi-annual reports and through parent-teacher conferencesMaintain daily open communication with parentsKeep accident reportsMaintain anecdotal recordsMaintain confidentialityReport any suspect abuse to supervisorArrange a classroom environment in accordance to program goals and philosophyMaintain a safe and healthy environmentInspect and replace damaged or lost materialsAttend in-service and staff meetingsSupervise assistants, aides, and volunteers in the classroomKeep all appropriate records such as records, attendance, and time sheetsMeet all applicable licensing regulations"}