{"jobID": "2732788276", "jobLocation": "New_York_NY", "jobTitle": "Data Science Intern", "companyRating": null, "companyInfo": {"Website": "www.mountsinai.org", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 2013", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "The Mount Sinai Health SystemDo you have what it takes to wear  the badge? The Mount Sinai Health System’s  commitment to excellence extends beyond delivering world-class health care. The  System’s ongoing success is dependent upon our highly motivated, nonclinical  professionals working to improve business operations. Our leadership team is  driven to provide exceptional service by cultivating a workforce that is  dedicated to upholding Mount Sinai’s mission of delivering innovative,  breakthrough medicine with compassion and integrity. Are  You Ready? Are you ready to discover the  limitless possibilities of big data analytics and machine learning on improving  the patient’s care? Are you interested in learning and developing machine  learning data product? Duties and Responsibilities:The Data Scientist Intern will  work on learning and developing predictive machine learning and deep-learning model  for accelerating translational research  and improving clinical care.Learn and build machine learning model using Spark MLlib,  and PythonWork on creating deep learning model using Tensor Flow and  other open source technology.Work on deployment and  maintenance of machine learning modelAdditional responsibilities include developing prototypes  and proof of concepts for the selected use cases, and implementing complex machine  learning algorithmsBasic Qualification:Master/PhD  degree in engineering (e.g. computer science , Biomedical Informatics, Physics,  Statistics)Completion  of at least first semester of degree programBasic  knowledge with at least 1 programming languages among Scala/Python Java.Must  be flexible and fast to pick up new languages.Basic  Knowledge Supervised Learning , Unsupervised learning and ClusteringBasic  Knowledge of Deep LearningPreferred Qualification:Knowledge  of Hadoop, Spark, Kafka and other big data technology stacks and streaming  tools.Familiarity  with and the ability to leverage a wide variety of open source technologies and  tools.Knowledge  of cloud architecture and implementation on Azure or AWS is a big plus.Who  We Are: Over 35,000 employees  strong, the mission of the Mount Sinai Health System is to provide  compassionate patient care with seamless coordination and to advance medicine  through unrivaled education, research, and outreach in the many diverse  communities we serve.  Formed in September  2013, The Mount Sinai Health System combines the excellence of the Icahn School  of Medicine at Mount Sinai with seven premier hospital campuses, including  Mount Sinai Beth Israel, Mount Sinai Beth Israel Brooklyn, The Mount Sinai  Hospital, Mount Sinai Queens, Mount Sinai Roosevelt, Mount Sinai St. Luke’s,  and New York Eye and Ear Infirmary of Mount Sinai."}