{"jobID": "2782387737", "jobLocation": "Boston_MA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.akiliinteractive.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "The jobAkili is seeking a hungry Data Scientist to join our innovative data research team. This is a unique opportunity to play a key role in unleashing the value of novel, rich behavioral data from our gamified cognitive treatments and assessments, to improve patient outcomes.Here's what it entailsYou will conduct statistical analyses on behavioral data to evaluate study/experiment results and inform product development;Develop and implement algorithms underlying everything from targeted treatment interactions to rapid insight delivery;Be an impactful part of a high-energy team focused on delivering a new paradigm in mobile health.Here's what you needA degree in statistics, software engineering, or computer science5+ years of experience analyzing dataDemonstrable experience applying statistical analysis to experimental results, in a scientific, psychological, or user behavior contextDemonstrable experience producing presentations and reports, especially authorship on journal publications and abstractsDemonstrable competency with one or more programing languages (especially Scala, Python, or Julia), ideally in the form of working examples of programs with accompanying source codeDemonstrable experience using statistical analysis software, preferably RFamiliarity with Bayesian approaches to inference and hypothesis testingFamiliarity with a broad range of machine learning techniques for predictive modelingExperience with some the following tools and technologiesSQL, Cassandra, Elasticsearch, Apache Spark, Zeppelin, JupyterWeb-Visualization packages such as D3.js, Chart.js, Matplotlib, or similarAkili - The company Akili Interactive (www.akiliinteractive.com) is creating an entirely new class of medicine that combines rigorous scientific validation with engaging video game mechanics.  We are pioneering the field of digital therapeutics, creating, producing, and validating digital medicines designed to directly treat disease. Akili's flagship product, Project: EVO, is based on technology developed at UCSF that was featured as the cover article in Nature under the headline \"Game Changer\".  Akili was founded by leading neuroscientists and top-tier game design veterans to create gaming experiences that are designed to have measurable health impacts in multiple patient populations. Akili has partnerships with top pharmaceutical companies, and has received recent recognition in major media outlets including the Wall Street Journal, CNBC, Fast Company, and The Verge."}