{"jobID": "2731383880", "jobLocation": "New_York_NY", "jobTitle": "Manager Tech Support- New York Proton Center", "companyRating": "2.9", "companyInfo": {"Website": "www.prohealthcare.com", "Headquarters": "Lake Success, NY", "Size": "1001 to 5000 employees", "Founded": " 1997", "Type": " Subsidiary or Business Segment", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Northwell Health, Stony Brook University Medical, Catholic Health Services of Long Island"}, "estimatedSalary": "59000", "jobDescription": "Located in Manhattan, The New York Proton Center (NYPC) is one of the most unique and respected clinical partnerships in the world of proton therapy. The collaboration between Memorial Sloan Kettering Cancer Center, Montefiore Medical Center and Mount Sinai Health System brings state of the art proton therapy treatment to the patients of New York and the surrounding areas. The Consortium is managed by ProHEALTH Medical Management, LLC.Our team at NYPC is comprised of highly motivated, passionate, professional and engaged individuals working together as a dynamic team to deliver an exceptional level of patient care, providing the most advanced proton therapy technology. We offer our employees a competitive compensation and benefits package with flexibility for growth and career advancement.The Help Desk Manger will manage IT Help Desk personnel, problem escalation, Ticket Management System, and reporting.Responsibilities:Manage IT Helpdesk employeesSupport All IT ProjectsEscalate problems/issues to appropriate resources in a timely mannerManage Ticket Management System, Reports, Team ReviewManage during/after-hour, weekend, holiday scheduling of team to ensure coverage for 24x7x365 with SLAMentor helpdesk techs to include: providing demonstrations, training, and process reviewUtilize appropriate incident tracking tools to track issue progress and resolutionAdhere to enterprise process/procedure standards and requirements related to documentation and tracking of incidentsEnsure that escalated incidents are documented, resolved and closed as needed (e.g., impact to the business has been eliminated)Create change requests as needed to provide resolution for problems/issues, and communicate to managementContact users to obtain needed information related to problems/issuesCommunicate problem/issue status, progress and resolution to end users in a timely mannerCollaborate with other technical teams to help resolve problems/issues, as neededDocument the processes used and steps taken to resolve and close incidentsPreparing, maintaining weekly and monthly information technology performance metric reportsOther projects as assigned. A wide degree of flexibility, creativity and latitude and professionalism is expectedRequired Qualifications:Experience with the following technologies:Windows operating systems (server and workstation)Linux operating systemServiceNow ticketing systemAbility to multi-task while maintaining attention to detailAbility to perform travel to facilitiesAbility to prioritize workload, perform under pressure in a fast-paced environment Experience supporting end users in a technical capacityAdditional technical certificationsUnderstanding of networking standards including Ethernet, protocols, ports, servicesStrong sense of teamwork, integrity and respectEducation:Bachelor degree or 5+ years of demonstrated experience managing help desk. ITIL certification preferredThe New York Proton Center (NYPC) strives to maintain a workplace that accepts and appreciates the differences among our employees. The company will not discriminate against any applicant or employee based on age, race, gender, color, religion, national origin, ancestry, disability, marital status, covered veteran status, sexual orientation, gender identity and/or expression, genetic information, status with respect to public assistance or any other characteristic protected by state, federal, or local law. "}