{"jobID": "2697962559", "jobLocation": "New_York_NY", "jobTitle": "Casual Staff (Graduate Intern)", "companyRating": null, "companyInfo": {"Website": "www.yu.edu", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1886", "Type": " College / University", "Industry": " Education", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " ABOUT USFounded in 1886, Yeshiva University (YU) has a strong tradition of combining Jewish scholarship with academic excellence and achievement in the liberal arts, sciences, medicine, law, business, social work, Jewish studies, education, psychology, and more.  We are a leading global educational institution that employs 2,000 people across our various campus locations -- Wilf Campus, Beren Campus, Brookdale Center, Resnick Campus in the Bronx, the Gruss Institute in Jerusalem, the Boys High School in Manhattan and the Girls High School in Queens. From the distinguished faculty who teach here, to the dedicated staff, we work to fulfill our mission: to “bring wisdom to life” through all that we teach, by all that we do and for all those we serve. We seek to attract and retain engaged and committed individuals who contribute to an exciting working environment, where there is a sense of community and belonging, balanced with a significant cross section of people from diverse backgrounds working and studying together.  The University offers an excellent compensation package, and a broad range of employee benefit plans, including immediate participation in the University’s retirement plan. Staff members are typically eligible for four weeks paid vacation each year and have access to a shuttle to nearby subway locations.  The Position:  The Katz School is seeking a graduate intern. This assistantship is an opportunity work with higher educations professionals in a start-up environment with a rapidly growing student population – specifically in the areas of student programming, new student orientation, international student events, academic support services, and career services.  This position runs in conjunction with New York University’s MA Steinhardt School of Education’s Higher Education and Student Affairs program and is a 2-year commitment. This is a part time position working less than 20 hours per week.POSITION RESPONSIBILITIES Support the development, planning, marketing and facilitation of school-wide programming – such as new student orientation, student run events, admissions events, etc.Work with the Katz staff to develop and implement student services for our online and on-campus student populationOutreach to student organizations on behalf of the Katz School AdministrationPromote student clubs and assist in implementing new clubsAttend mandatory, regularly scheduled departmental meetings and trainingsCollaborate with Katz staff on event data collection and assessmentBuild and maintain an inventory of materials and resources for student groups and organizationsCultivate and maintain good working relationships with staff, faculty, and studentsAdditional duties as assignedQUALIFICATIONSBachelor’s Degree and full-time enrollment in NYU’s Higher Education and Student Affairs Graduate Degree program.Candidates should be detail-oriented problem-solvers; self-starters and be able to work alone and in team settings. Knowledge of campus activities is desirable.Knowledge of event planning and marketing and experience working with students is also desired.A successful candidate will have creativity, enthusiasm, strong computer skills, excellent communication and organization skills as well as a sense of direction and follow through"}