{"jobID": "2798419324", "jobLocation": "New_York_NY", "jobTitle": "Intern - Data Security", "companyRating": null, "companyInfo": {"Website": "www.mountsinai.org", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 2013", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Strength Through DiversityGround breaking science. Advancing medicine. Healing made personal.Data Security - Req #2287320InternRoles & Responsibilities: The Trainee is an entry level individual or student who is generally engaged for a limited time to learn specific administrative and operational processes, depending on department or program. The Trainee is used for various entry positions or support in both Hospital and School locations. Day to day responsibilities include: Acquire basic knowledge of IT concepts, processes, operations, and functions.Assist with creation, updating, and preparation of final versions of documents, including Policy, Standard Operating Procedures (SOP), Work InstructionsEngage and interact with Subject Matter Experts (SMEs) as required to gather, record, and document information about processes, procedures, and operationsDevelop and maintain records of documentation, including dates, sources, versions, authors, etc. as appropriate and/or requiredUse tools and platforms to store and archive documents and artifacts producedCoordinate with IT Security and other teams as needed to identify areas of improvement for processes, procedures, workflowsGood communication and writing skills; organization and time management skills also important; ability to work semi-independentlyRequirements: Education: HS/GED minimum; Associates or greater depending on department and role.  Experience: Entry level or student.Strength Through DiversityThe Mount Sinai Health System believes that diversity is a driver for excellence. We share a common devotion to delivering exceptional patient care. Yet we’re as diverse as the city we call home- culturally, ethically, in outlook and lifestyle. When you join us, you become a part of Mount Sinai’s unrivaled record of achievement, education and advancement as we revolutionize medicine together.We work hard to acquire and retain the best people, and to create a welcoming, nurturing work environment where you can develop professionally. We share the belief that all employees, regardless of job title or expertise, can make an impact on quality patient care.Explore more about this opportunity and how you can help us write a new chapter in our story!Who We AreOver 38,000 employees strong, the mission of the Mount Sinai Health System is to provide compassionate patient care with seamless coordination and to advance medicine through unrivaled education, research, and outreach in the many diverse communities we serve.Formed in September 2013, The Mount Sinai Health System combines the excellence of the Icahn School of Medicine at Mount Sinai with seven premier hospital campuses, including Mount Sinai Beth Israel, Mount Sinai Beth Israel Brooklyn, The Mount Sinai Hospital, Mount Sinai Queens, Mount Sinai West (formerly Mount Sinai Roosevelt), Mount Sinai St. Luke’s, and New York Eye and Ear Infirmary of Mount Sinai.The Mount Sinai Health System is an equal opportunity employer. We promote recognition and respect for individual and cultural differences, and we work to make our employees feel valued and appreciated, whatever their race, gender, background, or sexual orientation.EOE Minorities/Women/Disabled/Veterans"}