{"jobID": "2831147622", "jobLocation": "El_Segundo_CA", "jobTitle": "Sr. Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.aerospace.org", "Headquarters": "El Segundo, CA", "Size": "1001 to 5000 employees", "Founded": " 1960", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "147000", "jobDescription": "Requisition ID: 40259All Locations: El Segundo, CA (California) A trusted partner. A national resource. A leader in national security space. We are THE Aerospace Corporation. A team that takes pride in our readiness to solve some of the most complex technical challenges in existence. With challenges spanning clandestine to commercial, you’ll have the unique opportunity to work on projects that are literally evolving our nation&apos;s space and launch capabilities. We all share a common passion and aspiration – to serve a mission much bigger than ourselves. When you join our team, you’ll be part of a rare collection of thought leaders and game-changing innovators. Are you ready to launch your career?ResponsibilitiesIndependently conduct long-range technical studies and report findings that provide value to the customer. Initiate studies designed to solve new technical problems and provide new technical solutions within data science and machine learning. Expected to exhibit exceptionally high levels of innovation, creativity, initiative, lead technical teams, procure funding, interface between customers and Aerospace technical and management staff, and mentor less experienced staff and serve as role model.Key FunctionsArchitect, develop and demonstrate software for data science and machine learning systems. Build and prototype analysis pipelines iteratively to provide new insights.Research and develop analysis, forecasting, and optimization methods to improve the quality of The Aerospace Corporation’s analytic softwareLeadership of cross-organizational teams and organize interfaces with customers and/or Aerospace program offices.Provide ongoing technical consultation and advice to management, customers, and contractors in area of specialization and other areas aligned with organizational goals as specified by the customer/management.Take initiative to inform management of perceived technical problems and recommend courses of action.Act as organization’s designated representative at technical meetings, presentations and symposia.Act as senior technical authority, consultant, primary investigator, or team leader.Lead or organize interfaces between customers’ and Aerospace technical and management staff. Initiate and obtain funding for tasks and projects beyond personal activities from internal and external sources. Tasks and projects should align with organizational goals as specified by the customer/management. This applies to existing customers as well as to seek and develop relationships with new customers.Maintain and grow knowledge of specific customer programs.Establish and maintain effective working relationships with customers and management.Widely recognized internally and externally by peers, management, program office, Air Force, and contractorsCoordinate large-scale technical efforts across program/project lines.QualificationsBASIC QUALIFICATIONS Bachelor’s degree or higher in computer science, computer engineering, data science, mathematics or related technical field. Lead teams to propose, develop and provide data science solutions for customers in various engineering, research and business initiatives.Ability to effectively communicate (written and verbal) and work in a team Ability to quickly troubleshoot problems.Must be detailed oriented and able to prioritize tasks and projects.Must possess strong organizational skills.Ability to handle multiple priorities and projects at a time.Effective interpersonal skills to coordinate efforts and work with other internal and external organizations.Required12 or more years of increasingly responsible professional engineering/scientific experience.The ability to obtain and maintain a security clearance, which is issued by the U.S. government. U.S. citizenship is required to obtain a security clearance.Strong academic record.Experience in image/signal processing.Strong programming skills.8 or more years experience with statistical modeling tools (R, Python, Octave/Matlab, etc..).Experience with statistical tests, distributions, maximum likelihood estimators, etc.Proficiency in at least one visualization tool and/or library (D3, Matplotlib, MS Excel).PreferredAdvanced degree(s) in engineering, computer science or another technical related field.8 or more years experience in statistics, data mining, and predictive modeling.Strong programming skills in Python and/or C++.Strong programming skills utilizing Scikit-learn, OpenCV, Keras and/or Tensorflow libraries.Experience with machine learning methods like random forests, logistic regression, neural networks, k-nearest neighbors, etc…Fluency in SQL, NoSQL and other big data querying languages.Experience in collecting data from/exposing data to various data sources and services (API, XML, JSON)Familiarity with Amazon Web Services for data analytics.Experience in implementing real-time machine learning and data mining algorithms in large scale environments.Strong analytical and creative problem-solving skills.Participation in extracurricular activities related to data science (e.g. Kaggle competitions).Experience with big data frameworks (e.g. Hadoop, Spark, etc.).Transcript RequirementNoneAdditional Requisition DetailsSystem Job Title: ENGRG SPCLST SR Clearance Requirement: Secret Access: None Polygraph: None Relocation Available: Yes Employment Type: Regular Work Schedule: Full Time Company StatementThe Aerospace Corporation has provided independent technical and scientific research, development, and advisory services to national security space programs since 1960. We operate a federally funded research and development center (FFRDC) for the United States Air Force and the National Reconnaissance Office, and support all national security space programs. We also apply more than 50 years of experience with space systems to provide critical solutions to technologically complex systems in such areas as communications, shipping, law enforcement, and cyber, among others.From our inception, our highly skilled technical staff has focused on ensuring the success of every mission and developing the most effective and economic space-related hardware and software in the world. Our greatest asset is the technical expertise of our people. Our state-of-the-art laboratory facilities are staffed by some of the leading scientists in the world.Equal Opportunity CommitmentThe Aerospace Corporation is an Equal Opportunity/Affirmative Action employer. We believe that a diverse workforce creates an environment in which unique ideas are developed and differing perspectives are valued, producing superior customer solutions. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, gender, gender identity or expression, color, religion, national origin, sexual orientation, protected veteran status, or disability status.You can also review The Equal Employment Opportunity is the Law poster and the supplement, as well as the Pay Transparency Policy Statement."}