{"jobID": "2827610175", "jobLocation": "Boston_MA", "jobTitle": "Data Analyst I", "companyRating": "4.0", "companyInfo": {"Website": "www.massgeneral.org", "Headquarters": "Boston, MA", "Size": "10000+ employees", "Founded": " 1811", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " CareGroup, Beth Israel Deaconess Medical Center, Boston Medical Center"}, "estimatedSalary": "53000", "jobDescription": "GENERAL SUMMARY/ OVERVIEW STATEMENT: The Corrigan Minehan Heart Center at Massachusetts General Hospital is seeking exceptional candidates to join the lab of Dr. Steven Lubitz in the Cardiovascular Research Center. The candidate will join an interdisciplinary team of epidemiologists, statisticians, and clinicians, computational biologists, and bioinformaticians who are working together to identify the causes of heart disease and identify methods to improve health outcomes. The candidate will work with robust human health data linked to electronic medical records from 7 academic hospitals spanning records for over 6 million individuals to study cardiovascular disease. Tasks will include development of computational tools, management of large-scale databases, conduct of statistical analyses to examine relations between risk factors and disease, and manuscript preparation. Projects will focus on the identification of factors related to cardiovascular disease and on modeling strategies to improve outcomes in patients. The candidate must thrive in an academic/professional atmosphere, where interdisciplinary teams are central to project success. A high level of maturity is essential, as the analyst is given access to personal and confidential medical information. Strong organizational and interpersonal skills, attention to detail, and the ability to prioritize multiple tasks are essential. The candidate must be self-motivated, independent in task completion, and comfortable accepting feedback and guidance from colleagues.  This position is ideal for either individuals with a Masters degree in Biostatistics, Epidemiology, or Public Health, or exceptionally skilled individuals without advanced degrees planning to pursue medical school or graduate studies in biostatistics or clinical research with 1 to 2 years of real-world analytic experience. PRINCIPAL DUTIES AND RESPONSIBILITIESActively lead the development and refinement of computational scripts for working with electronic health record data related to heart disease.Design and implement natural language processing scripts to parse free text electronic health record data.Apply traditional epidemiologic and statistical methods to analyze relations between risk factors and health outcomes.Apply analytic techniques for high dimensional data, including machine learning and clustering analyses, to identify patterns and improve risk profiling using electronic health record data.Develop computer-based decision analytic models to inform the optimal effectiveness of management approaches.Regularly communicate accomplishments and progress at project team meetings.Proactively communicate with data analysis groups to help ensure analytical goals are achieved.Coordinate and interact closely with other collaborating scientists on data quality and file management.Actively participate in the preparation of manuscripts for publication, scholarly reports and present at scientific conferences.Share expertise, provide training and guidance with other team members as needed.Participate within a team of scientists to foster a culture of scientific excellence.QualificationsSKILLS/ABILITIES/COMPETENCIES REQUIRED:Bachelor or Masters degree in Biostatistics, Epidemiology, or Public Health, or related discipline such as Computer Science, Engineering, Physics, Math, Bioinformatics..Must have demonstrated experience designing computational methods and tools, including prior experience with algorithms relevant to high dimensional data analysis.Experience with prediction modeling is strongly preferred.Must have demonstrated proficiency with at least one of the following computer languages/environments: R, Python, Unix, Java, HTML, Matlab, R, C, C++, SAS, SQL.Ability to work independently while making necessary connections with experts in various computational analysis groups.Willing to commit to a two-year position.Self-starter, highly motivated.Entrepreneurial spirit.Excellent communication skills.Excellent organization and time management skills.EDUCATION: Masters degree preferred. Coursework in advanced-level math or science. EXPERIENCE: Experience 1 or 2 years working in an office environment preferred. WORKING CONDITIONS: Regular office conditions. Remote office work also possible. EEO Statement We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law  Partner's Healthcare is acting as an Employment Agency in relation to this vacancy."}