{"jobID": "2828484944", "jobLocation": "Westford_MA", "jobTitle": "Software QA Engineer Intern", "companyRating": null, "companyInfo": {"Website": "www.mutualink.net", "Headquarters": "Wallingford, CT", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Software QA Engineer Intern Westford, MA Qualified candidates must be lawfully authorized to work in the U.S. DescriptionThis is no ordinary job. We’re on a mission to transform America’s emergency communications.  We have an affordable way to solve America’s emergency communications problems and improve emergency preparedness. Mutualink is an affordable, revolutionary interoperable emergency communications solution that links police, fire, schools, hospitals and other critical assets together into seamless community-wide emergency preparedness networks. In addition, we support domestic and international Homeland Security agencies as well as US Defense and Coalition Partners.  We are a nimble, fast moving, small company with innovative technologies. We are looking for team members who see our vision and who have the motivation and belief that they can help us transform crisis communication effectiveness around the world. Mutualink is ideal for individuals who would like to make a lasting contribution to improving America’s community safety and emergency preparedness in a way that can save lives. To learn more, please visit: www.mutualink.net.  We are currently seeking Software Quality Assurance Engineering interns for the fall of 2018 to work at our research and development facility in Westford, MA and be part of our innovative and dynamic team.Specific responsibilities include:Working with automated testing systemsExecuting test plans for all core productsWorking knowledge of Bash scriptingWorking with the team to automate the Mutualink UI using QA test toolsParticipating in QA team meetings Desired QualificationsCurrently pursuing or have recently graduated with a bachelor’s degree in computer science or a related software engineering disciplineKnowledge of the Linux operating system including commands, utilities, configuration, and bash scriptingUnderstanding of relational databases and data access (SQL Server)Excellent problem solving and analytic skillsSelf-motivated team player with a strong sense of accountabilityAbility to work in a fast-paced dynamic team-oriented environmentWe offer a competitive compensation, a great team to work with and a mission that you can be part of that will absolutely make a difference. Interested candidates should submit a resume to: careers@mutualink.net. Equal Employment Opportunity and Affirmative ActionMutualink, Inc. (“Mutualink or Employer”) is an equal employment opportunity and affirmative action employer, dedicated to the policy of nondiscrimination in employment on any basis prohibited by law. Mutualink is committed to providing equal employment and advancement opportunities without consideration of race, color, religious creed, age, sex, sexual orientation, gender identity or expression, marital status, national origin, ancestry, veteran status, mental retardation, genetic information, disability, or other legally protected status, unless there is a bona fide occupational qualification under applicable Connecticut statute excluding persons in one of the foregoing protected groups. Additionally, Mutualink will take affirmative action to ensure workplace equality, avoid all forms of discrimination, and develop a workforce that is representative of all segments of the population.Interested in this position? Email your resume and cover letter to careers@mutualink.net."}