{"jobID": "2633758760", "jobLocation": "Cupertino_CA", "jobTitle": "ARO- Enterprise Account Manager", "companyRating": null, "companyInfo": {"Website": "www.huawei.com", "Headquarters": "Shenzhen, China", "Size": "10000+ employees", "Founded": " 1987", "Type": " Company - Private", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " Ericsson-Worldwide, Cisco Systems, Apple"}, "estimatedSalary": null, "jobDescription": "Huawei is a leading global information and communications technology (ICT) solutions provider. Through our dedication to customer-centric innovation and strong partnerships, we have established end-to-end advantages in telecom networks, devices and cloud computing. We are committed to creating maximum value for telecom operators, enterprises and consumers by providing competitive solutions and services. Our products and solutions have been deployed in over 170 countries, serving more than one third of the world’s population. Huawei has over 150,000 employees, approximately 70,000 of which are engaged in Research & development. Huawei operates a global network of 14 regional headquarters, 16 R&D; Centers, 28 Innovation Centers jointly operated with customers, and 45 Training Centers. Huawei is leading the way by rethinking the future. From devices to telecom infrastructure to cloud computing and convergence solutions, we are rethinking every link in the chain with ICT based innovation to deliver a better future...faster. ARO- Enterprise Account Manager Location: Cupertino, CA (Enterprise) Req #: 9191 # of Openings: 1 Description2.1 ResponsibilitiesIndependently develop accounts in his territory and follow the LTC process.Knowing the High Tech market including EDA industry and chipset design industry.Better has existing customer basis or channel partners basisHas knowledge of IT solution, such as Server, Storage, Cloud and NetworkingOut going personality, aggressive for success, eager for sales credit.2.2 Position requirementsBasic Requirements Education background N/A, better have CS/EE background Work experience 4 years + Language English Skill appraisal (Requirements on the standardized test score of related professional skills, e.g., 60 points for C++) Professional certifications from third parties (Requirements on professional titles, such as PMP, Cisco Certified Network Associate, and CPA)Professional Knowledge Professional knowledge (Required professional knowledge)1. Server2.Storage3.CloudKey Skillset Professional skills (Required professional skills)1.Communication2.Presentation3.Project Management4.CoordinationHuawei Inc. is proud to be an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Why work for us?In 2015, Huawei's revenue reached CNY395 billion (US$60.8 billion based on the year-end exchange rate), an increase of 37% (YOY)We invest in engineering and innovation - 70,000+ of our 150,000+ global employees work in R&D;Globally ranked #1 for International Patent SubmissionsWe continually invest heavily in global community involvement programsWe support green energy - Lowered CO2 emissions by 13,000 tons via Huawei’s green packaging solutionsEngaged in over 100 research projects with 50+ Universities in the United States Are you a returning applicant?Previous Applicants:Email:Password: If you do not remember your password click here. Back to Search Results New SearchCopyright © Huawei Technologies Co., Ltd. 1998-2017. All rights reserved."}