{"jobID": "2749033971", "jobLocation": "Oakland_CA", "jobTitle": "Structural Engineer, 2-6 years", "companyRating": "4.8", "companyInfo": {"Website": "www.coffman.com", "Headquarters": "Seattle, WA", "Size": "201 to 500 employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": " The right team is more than an advantage, it’s a game changer! Come work with a team of Structural Engineering professionals dedicated to excellence at Coffman Engineers’ Bay Area office.  We are seeking a Structural Engineer to assist in the design of commercial, institutional and industrial structures for our Bay Area office. The successful individual will be a structural engineer with two to six years of experience who wants to work and grow as a team player within our progressive, multi-discipline firm. Requirements Include:A four-year degree in engineering or a related fieldRegistration as an EIT requiredRegistration as a P.E. or ability to obtain a P.E. license (preferred)2-6 years of experience in the structural design of buildings or similar structuresMotivation towards advancement and responsibilityConsulting experience with architectural firms and project ownersExperience putting projects together independentlyAbility to work independently or on a teamAbility to market and build businessExceptional verbal and written skillsOutstanding leadership, supervisory and organizational skillsWhy You Want To Work Here You could choose to work anywhere, so why work at Coffman Engineers? Because we are different – our culture sets us apart. Simply stated, we are a group of creative, high-performing people who like working together and believe that what we do makes a difference. Employees say that it feels like working with a group of friends in a small office while enjoying the benefits and perks of working for a large firm. Our culture isn’t the only thing that makes us different, but it drives everything we do.  Coffman offers comprehensive benefits, including a flexible PTO program and a fun office environment. Our Bay Area office is conveniently located near Lake Merritt and 20th Street, just three blocks from BART. Whether it is delivering the best possible service to our clients, or competing in an office-wide curling competition, we welcome the dedicated and the driven. Join us.  Don’t take our word for it. Check out what others are saying:  http://www.glassdoor.com/Reviews/Coffman-Engineers-Reviews-E409809.htm Coffman at a Glance:39 years in business460 employees in 10 offices located in 6 states and 1 territoryMulti-discipline engineering services plus fire protection, corrosion control, commissioning and project/construction managementMP 18 Mainline Investigation Team, Atigun Award - Environment, Alyeska Pipeline Service Company, 2017#198 Top 500 Design Firms, Engineering News-Record, 2017Best Firms to Work For - Multi-Discipline, Zweig Group, 2017Finalist, Best Places to Work, Hawaii Business Magazine, 2017Zweig Group Hot Firm List, Zweig Group, 2017Applying You must apply online for this position. If you are unable to complete our online application process, or if you need assistance to do so, let us know so we can provide a reasonable accommodation.  As part of the application process, you will be asked to create a user profile that allows you to manage the application process, answer a few questions, attach your resume and other documents, and then submit. We look forward to learning more about you! If you are accessing this from outside our website, go to http://www.coffman.com/home/careers/openings/oakland-openings/ and open the appropriate position posting. If you are experiencing problems applying through our system, please try again using a different browser or an updated version of your current browser. If that doesn't work, please contact us directly. This position is direct with Coffman Engineers; we are an Equal Opportunity and Affirmative Action Employer of Minorities/Females/Veterans/Disabled individuals.  Coffman Engineers will consider qualified applicants with a criminal history. Follow us! www.coffman.com  Twitter: @CoffmanEngineer  Instagram: @CoffmanEngineers "}