{"jobID": "2709985251", "jobLocation": "Boston_MA", "jobTitle": "Systems & Analytics Intern", "companyRating": null, "companyInfo": {"Website": "www.enernoc.com", "Headquarters": "Boston, MA", "Size": "1001 to 5000 employees", "Founded": " 2001", "Type": " Company - Public (ENOC) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " EnerNOC, a leading provider of energy intelligence software (EIS) and Demand Response (DR), has a need for a intern to join our DR Systems & Analytics team in its Boston office. The DR Systems & Analytics team contributes to EnerNOCs mission by developing and maintaining tools that evaluate performance, financials and risk in DR events. In addition, DR Systems & Analytics provides support and quantatative analysis to many other departments such as Energy Markets, Operations, Marketing, Regulatory Affairs, Sales, and Finance. The internship will last for 6 months and is a full time and paid position.  The ideal candidate will have excellent computer skills, including mastery of at least one major programing language, as well as strong problem-solving and analytical capabilities. An intern will support code development, reporting, analytics, process improvements, documentation, business transactions, and train team members on tools and processes.  This full time (40 hours/week) co-op will run from July - December. Responsibilities:Ensure that the R-based code being developed by the team produces accurate resultsImprove and maintain documentation of shared codeCreate processes to streamline standard operationsDevelop R-based tools to drive automation and data acquisition effortsProvide results and derive insights on ad-hoc analytical projectsAnalyze our systems and identify process/tool improvements that enable scalable and repeatable resultsCollaborate with others on cross-functional initiativesQualifications:Background in a quantitative/analytical field (Physics, Chemistry, Mathematics, Computer Science, Operations Research, Engineering, Statistics, Economics) or another field with demonstrated ability to work with and derive insights from large amounts of dataWorking knowledge of C-based programming language such as R, MATLAB, Python, etcAbility to introduce new concepts into an existing processAttention to detail and an inquisitive natureExcellent time management skills and ability to balance conflicting prioritiesExcellent oral and written communications skillsDemonstrated ability to work independently and in a team-driven contextExcellent problem-solving and organizational skillsAbility to manage high stress situations calmly and effectivelyDemonstrated skills in data analysis, visualization, and statisticsPrior experience with process improvement and controlsHands-on experience working with Salesforce a plus"}