{"jobID": "2803185821", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst/Engineer", "companyRating": null, "companyInfo": {"Website": "www.jumpshot.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Jumpshot is a marketing analytics company that helps marketers understand their customer's entire online lives by analyzing clickstream data from its 100-million customer panel, covering active users in 188 countries on both desktop and mobile. From the key sources of traffic to a site, to the browsing and buying behavior on a site, to where customers go once they've left a site, our products reveal the entire customer journey. Jumpshot tracks more than 160 billion monthly clicks, helping companies know what their customers are doing anywhere, anytime they're online.  We are seeking a Data Analyst/Engineer who will utilize strong analytical and programming skills to provide data used to execute and optimize Client and Customer acquisition. The position deliverables include insights from big data deep dives, development of a wide variety of automated reporting structures, analysis of consumer browsing behavior, and more. A strong programming background is a must, along with a passion for data with seemingly unlimited potential. Responsibilities:Extract, validate, transform and summarize data generated from databases and big data structures such as the Hadoop distributed file systemAnalyze business metrics in order to correlate and model data against itSupport team members with translating customer requirements into detailed implementation approachDesign/create data repository as needed to store and track dataDeliver data and insights for customersReview other's code to quickly diagnose incorrect and inefficient queriesOversee and manage the work of othersRequirements:Bachelor's degree; Computer ScienceAt least 3 years of programming/scripting languages Scala, Python and SQLExperience with business development and business metricsExperience with visualization tools such as TableauExperience with database structures, SQLExperience working on the command line, LinuxUnderstanding of internet fundamentals such as URL structure, HTML is a plusExceptional communication skills; ability to communicate solutions clearly and effectivelyCan-do attitude with a service-oriented approach, curiosity and investigative mindsetEnjoys working with others to help them identify and overcome roadblocks in their progress advanced working knowledge of SQL (HQL a plus) Jumpshot is located in the heart of SOMA in San Francisco, right near AT&T; Park, Caltrain, Muni, and lots of restaurants and bars. Benefits include medical, dental, vision, 401(k), regular lunches, and more! We offer the opportunity to be part of a successful, fast growing company. To learn more about us, please visit our website at www.jumpshot.com.  If you are interested in applying for this opportunity, please submit your resume or CV, cover letter and salary requirements. All submissions will be evaluated and interviews will be conducted for those applicants who most strongly fit our needs. If you are not contacted for an interview, your resume will remain on file and active for available positions for a period of one year.  No phone calls please and no agencies or recruiters."}