{"jobID": "2776178480", "jobLocation": "New_York_NY", "jobTitle": "Mid-Market Solutions Consultant", "companyRating": "3.4", "companyInfo": {"Website": "www.crimsonhexagon.com", "Headquarters": "Boston, MA", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": " OverviewCrimson Hexagon helps global brands better understand their consumers. With instant access to the world’s largest volume of unstructured text and images across social, online public, and enterprise-held data sources, Crimson Hexagon’s AI-powered consumer insights platform allows clients to analyze audiences, track brand perception and campaign performance, and even detect competitive and market trends. Our clients include Anheuser-Busch InBev, Adidas, General Mills, Paramount Pictures, and Twitter. We’re a high growth software company headquartered in Boston with offices in Chicago, New York, San Francisco and London. Find us on Twitter and on LinkedIn.  Reporting to the VP, Global Solutions Consulting, you will assist our Mid-Market Sales team in achieving quarterly revenue and bookings targets. The position’s focus is to partner with the Mid-Market sales organization to uncover a customer’s current and future objectives in order to best position Crimson Hexagon’s solutions. You will prepare and present innovative product demonstrations to Mid-Market clients, deliver compelling proofs of concept, and manage trials to highlight the potential impact to a customer’s organization through using the Crimson platform.ResponsibilitiesYou are analytical, creative, and able to adapt to facilitate the pre-sales process. In this role you will be expected to: Become a master user of Crimson Hexagon’s ForSight and HelioSight platforms.Perform social analyses across a spectrum of topics to demonstrate the capabilities and features of the platform to end users.Participate in sales calls and meetings primarily virtually, deliver demos with a methodological and meticulous approach and execution.Create compelling presentations and collateral that demonstrate our solutions and the value proposition they provide based on customer requirements.Assist with high-level requirements gathering and RFI/RFP process.Take ownership of continuous improvement and refinement of discovery process, demo scripts, and value add use cases.QualificationsPossesses Undergraduate degree.Has 2 - 5 years of pre-sales experience.Prior experience working with SaaS applications, marketing technology, data services, or analytics software preferred.Strong grasp and/or interest in social insights industry.Demonstrates excellent critical thinking and analytical abilities.Possesses great communication and interpersonal skills, along with strong attention to detail.Strong remote selling skills (discovery, demo’s, presentations, etc).Thrives in a deadline driven environment and is able to manage many opportunities at once.Domestic travel is between 10- 20%."}