{"jobID": "2811110650", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst II Quality Improvement", "companyRating": "3.5", "companyInfo": {"Website": "www.ipro.org", "Headquarters": "N New Hyde Park, NY", "Size": "201 to 500 employees", "Founded": " 1984", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "65000", "jobDescription": " The Quality Improvement (QI) Data Analyst collaborates with Centers for Medicare and Medicaid Services (CMS) and End Stage Renal Disease (ESRD) providers to maintain national ESRD databases which accurately and effectively record ESRD treatment records and the current status of all ESRD patients receiving Renal Replacement Therapies in IPRO's ESRD Network of the South Atlantic and the ESRD Network of New York. The QI Data Analyst supports quality improvement activities through the development and implementation of data collection systems and utilizing data from primary or secondary data sources to create comprehensive databases to support data analysis. The Data Analyst will function as the primary data source in support of the Network quality improvement activities, interpreting data and analyzing results including creating robust reports to assist with driving measuring trends toward meeting improvement objectives QUALIFICATIONS:Strong analytical and communication skills (written and verbal) with the ability to present data and findings to audiences with varying technical backgrounds.Must be proficient in MS Office Suite, particularly in use of Access and Excel for data collection, tracking, analysis, and presentation.Strong knowledge of web based data collection systems and program management systems.Proven knowledge of statistics and experience using statistical packages for analyzing datasets (Excel, SPSS, SAS, etc.)Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracyAbility to work with minimal supervision, as well as in a team environment.Ability to prioritize tasks in a fast-paced, multi-project environment.EDUCATION & EXPERIENCE:Bachelor's degree in Mathematics, Economics, Computer Science, Information Management, Statistics or related discipline, required.A minimum of (1) one year of related experience, required.Previous experience with statistical packages (SPSS, SAS, Access, Excel, etc.), required. IPRO offers a comprehensive benefits package.  IPRO is an Equal Opportunity/Affirmative Action Employer; Minority/Female/Disabled/Veteran.  Job Requirements  See above.  on Company Website  Job ID: 18027  Help us improve CareerBuilder by providing feedback about this job: . CAREERBUILDER TIP For your privacy and protection, when applying to a job online, never give your social security number to a prospective employer, provide credit card or bank account information, or perform any sort of monetary transaction. Learn more.  By applying to a job using CareerBuilder you are agreeing to comply with and be subject to the CareerBuilder Terms and Conditions for use of our website. To use our website, you must agree with the Terms and Conditions and both meet and comply with their provisions. IPRO IPRO is a national organization providing a full spectrum of healthcare assessment and improvement services that foster more efficient use of resources and enhance healthcare quality to achieve better patient outcomes. Founded in 1984, IPRO is highly regarded for the independence of its approach, the depth of its knowledge and experience, and the integrity of its programs. IPRO holds contracts with federal, state and local government agencies, as well as private-sector clients, in more than 33 states and the District of Columbia. A national not-for-profit organization, IPRO is headquartered in Lake Success, NY and also has offices in Albany, NY, Hamden, CT, Camp Hill, PA, Morrisville, NC, Hamilton, NJ, San Francisco, CA.IPRO's staff of more than 400 professionals includes physicians, registered nurses, mental health professionals, epidemiologists, biostatisticians, data analysts, medical record reviewers, health policy experts, pharmacists, coding professionals, claims analysts, auditors, programmers, systems analysts, web technology experts and healthcare communications specialists. IPRO also retains a network of more than 300 board-certified physician consultants. Contact Info Beachwood, OH 44122 View Company Profile  Don't miss out on new jobs like this  Get the latest jobs delivered to your inbox. Unsubscribe at any time.  Create Job Alert  Saving Your Job Alert  Job Alert Created  Well, this is embarrassing. We are having trouble saving your search. You can try again or come back at a later time.  Maximum Email Alerts  This email address has reached the maximum of 5 email alerts. To create a new alert, you will need to log into your email and unsubscribe from at least one."}