{"jobID": "2705945695", "jobLocation": "San_Jose_CA", "jobTitle": "Software R&D; intern", "companyRating": null, "companyInfo": {"Website": "www.nokia.com", "Headquarters": "Nokia, Finland", "Size": "10000+ employees", "Founded": " 1865", "Type": " Company - Public (NOK) ", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " Ericsson-Worldwide, Huawei Technologies, Microsoft"}, "estimatedSalary": null, "jobDescription": "Nokia is a global leader in the technologies that connect people and things. With state-of-the-art software, hardware and  services for any type of network, Nokia is uniquely positioned to help communication service providers, governments,  and large enterprises deliver on the promise of 5G, the Cloud and the Internet of Things. Serving customers in over 100  countries, our research scientists and engineers continue to invent and accelerate new technologies that will increasingly  transform the way people and things communicate and connect. Nokia is an equal opportunity employer that is committed  to diversity and inclusion.  At Nokia, employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual  orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics  protected by law.  Summer term May to August 2018 internship.  Job responsibility:  As an intern of business strategy, you will support and work with Business Strategy PLM in CloudBand on topics such as market analysis, competition analysis, pricing and creating sales programs. During this internship you will learn about building scenarios and alternate business models.  Your responsibility will be to support business & strategy PLM around following topics:  - Detailed analysis of market reports from various sources to build business view of CloudBand (market size, segments, etc)  - Based on analyst reports, correlate information to create market and competition intelligence  - Build ideas based on such analysis that can lead to specific sales programs and increase our market share  - Research pricing strategies and price points of competition and propose strategic pricing ideasBachelor’s or Master’s in Engineering / ManagementAbility to extract meaningful information from huge collection of internal and external business dataGood knowledge of office tools such as XLS and Power Point"}