{"jobID": "2786805343", "jobLocation": "New_York_NY", "jobTitle": "Data Scientist, Customer Operations", "companyRating": "3.8", "companyInfo": {"Website": "www.squarespace.com", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " GoDaddy"}, "estimatedSalary": "130000", "jobDescription": " Customer Operations Data Scientists formulate the analytical frameworks and provide the technical rigor to measure the efficacy of, and predict demand for, Squarespaces award-winning Customer Operations team. In close partnership with management, youll identify the fundamental questions we need to ask and have ownership over the data-driven means of addressing them.  Depending on your area of focus, challenges you may tackle in a typical day include: Forecasting demand for customer serviceSurfacing insights about how and why customers request support and partnering with stakeholders on initiatives related to ticket deflectionIdentify and analyze performance and efficiency opportunities with Customer Operations leadershipBuilding dashboards to allow management to understand operational efficiency and performance in real timeTesting and measuring the effectiveness of new support offeringsOptimize ticket queueingUnderstanding gaps in our Knowledge Base and suggesting improvements as our product evolvesSegmenting customers to predict the most effective communication or remediation methodBridging customer interactions with business outcomes and product usage We are seeking multiple Data Scientists who demonstrate sharp intellectual curiosity, data fluency, and a collaborative work ethic. These roles report to an Analytics team lead in New York. RESPONSIBILITIESCollaborate with business partners and manage stakeholdersEmpower data-driven decision-making across the org by defining analytical frameworks to guide key business decisions; develop and maintain dashboards to provide visibility into relevant metricsSurface insights from terabytes of proprietary user, product, and marketing data; communicate compelling recommendations to key stakeholdersFormulate innovative hypotheses; design and implement rigorous methodologies for testing themUtilize cutting-edge statistical/machine learning techniques to build models furthering the orgs understanding of and ability to predict consumer behaviorContinuously get better - seek out opportunities to further develop your analytical, engineering, statistical, etc. toolkitQUALIFICATIONSAn MS in a relevant technical field or 3+ years of relevant analytical experienceExperience with human resources and performance forecasting a plusStrong competency with SQL; additional competency with Python preferredAbility to communicate effectively with wide-range of audiencesComfort working on open-ended problems with limited guidanceStrong data intuition and ability to apply statistical concepts to quick moving initiativesAbility to devise data-driven solutions to business problemsABOUT SQUARESPACE Squarespace makes beautiful products to help people with creative ideas succeed. By blending elegant design and sophisticated engineering, we empower millions of people from individuals and local artists to entrepreneurs shaping the worlds most iconic businesses to share their stories with the world. Squarespaces team of more than 800 is headquartered in downtown New York City, with offices in Dublin and Portland. For more information, visit www.squarespace.com/about.PERKSHealth insurance with 100% premium coveredFlexible vacation & paid time offEquity plan401(k) plan with employer matchFree lunch and snacksDog-friendly workplaceAnd moreToday, more than a million people around the globe use Squarespace to share different perspectives and experiences with the world. Not only do we embrace and celebrate the diversity of our customer base, but we also strive for the same in our employees. At Squarespace, we are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender, gender identity or expression, or veteran status. We are proud to be an equal opportunity workplace."}