{"jobID": "2813905516", "jobLocation": "Santa_Clara_CA", "jobTitle": "Marketing Analytics Intern", "companyRating": null, "companyInfo": {"Website": "www.agilent.com/go/careers", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1999", "Type": " Company - Public (A) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Thermo Fisher Scientific, Illumina, Danaher"}, "estimatedSalary": null, "jobDescription": " Agilent inspires and supports discoveries that advance the quality of life. We provide life science, diagnostic and applied market laboratories worldwide with instruments, services, consumables, applications and expertise. Agilent enables customers to gain the answers and insights they seek ---- so they can do what they do best: improve the world around us. Information about Agilent is available at ***************.  Help define the scientific lab of the future! Agilent is rethinking how we interact with laboratory instrumentation and the high value data that it produces. As a part of this effort we are seeking a talented Intern to support the OpenLab Marketing team in turning this new vision into reality. Through a focused hands-on project, you will gain and apply knowledge about Agilent's industry, infrastructure and products.  You will work with the Strategic Planning Manager and the OpenLab Product Managers to analyze market, sales, and voice-of-the-customer data to get deeper insights. You will develop dashboards that enable decisions about product positioning, channel development, customer applications, and product enhancements. }, { label: Schedule Full-time }, { label: Requirements Your Qualifications:  Pursuing a bachelor or master's degree in business, life sciences, or biotechnology, you must be completing your junior year at an accredited 4 year university.  The ideal candidate should possess expertise in the use of Microsoft Office products including Excel, Word and PowerPoint. Experience with analytics / business intelligence software such as Tableau would be a big plus.  Excellent written and verbal communications skills are a must and you should enjoy working in a fast paced, dynamic team environment.  Must live near Santa Clara, CA and have ability to commute to the Agilent office at this location. }, { label: Travel Required No }, { label: Secondary Locations }, { label: Duration 0-3 months"}