{"jobID": "2802119309", "jobLocation": "Los_Angeles_CA", "jobTitle": "Senior Data Scientist with Glocomms", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The position listed below is not with LA Interviews but with Glocomms  LA Interviews is a private organization that works in collaboration with government agencies to promote emerging careers. Our goal is to connect you with supportive resources to supplement your skills in order to attain your dream career. Job Description Senior Data Scientist $130,000 - $160,000 We have partnered with a global technology company in LA in full expansion mode, as part of their growth strategy a new Data Science team is being created to drive business innovation through Machine Learning and Analytics focused on business innovation. This is a unique opportunity to affect the growth and operations of a reputable business with a global footprint at an enterprise level.  The role reports to the head of the business unit and will play a strategic role in the development of the team through mentoring and future management responsibility. RESPONSIBILITIES: · Leveraging Data Science and Machine Learning techniques to create business analytics designed to improve enterprise performance  · Working alongside business leadership to affect change across multiple cross functional teams to reduce inefficiency and improve utilization of resources  · Partner with Key business stakeholders to implement enterprise wide tools to facilitate expansion of existing projects and create opportunity for new business ventures  · Utilize data to drive insights and strategy on a global level to automate process · QUALIFICATIONS: · 5+ years experience in data science, analytics and modeling methods in a professional environment  · High level of technical proficiency with SQL, Python and R – further statistical and BI packages are advantageous  · Education in statistics or computer science with familiarity working in a cross functional environment focused on data science and machine learning insights.  · Experience in Supervised and Unsupervised learning with experience in Risk Modelling and Business Intelligence  · Strong communication skills and experience building relationships with non technical stakeholders  ​Company DescriptionGlocomms is a security and technology specialist recruitment firm. Our experts focus exclusively on areas such as ethical hacking, data science, SaaS sales, and software engineering and service clients across North America.  We are broken down into micro-specialized markets so as to provide the most amount of value possible for our clients and candidates. We offer a flexible approach for contingent and retained searches and have teams focused on both permanent and contract openings.  Apply"}