{"jobID": "2823681184", "jobLocation": "Gardena_CA", "jobTitle": "Software Developer Intern - EMT", "companyRating": "3.3", "companyInfo": {"Website": "www.faradayfuture.com", "Headquarters": "Gardena, CA", "Size": "501 to 1000 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable", "Competitors": " NIO, TESLA, Ford Motor Company"}, "estimatedSalary": "57000", "jobDescription": "The Company:Faraday Future (FF) is a California-based mobility company, leveraging the latest technologies and worlds best talent to realize exciting new possibilities in mobility. Were producing user-centric, technology-first vehicles to establish new paradigms in human-vehicle interaction. Were not just seeking to change how our cars work were seeking to change the way we drive. At FF, were creating something new, something connected, and something with a true global impact.Your Role: During this internship, youll be working with some of the industrys brightest minds to build tools and manage processes needed to bring a vehicle to market. Basically, youll ensure that people understand what theyre supposed to do and when theyre supposed to do it--all while they use tools you helped develop.Basic Qualifications:· Pursuing a Bachelors Degree in Computer Science, MIS (or equivalent field)· Passion for developing real-world, practical software· A willingness to ignore the Agile/Waterfall labels and develop processes that work for the businessPreferred Qualifications:· Experience with Python, Java, or equivalent· Experience with HTML, CSS, JavaScript· Interested in RESTful API· Interested in Jira· Strong interest in project management and process· Work/school related experience working on collaborative projects· Ability to work well under pressure and changing deadlinesPerks + Benefits· Engineering orientation + onboarding· Daily catered lunches onsite (nominal cost)· Healthy snacks + beverages 24/7· Free parking + carpool reimbursement · Casual dress code + relaxed work environment · Culturally diverse, progressive atmosphere· Soul of Faraday community outreach team"}