{"jobID": "2678823629", "jobLocation": "San_Francisco_CA", "jobTitle": "Nurse, Provider Relations Liaison", "companyRating": "3.3", "companyInfo": {"Website": "www.hospicebythebay.org", "Headquarters": "Larkspur, CA", "Size": "201 to 500 employees", "Founded": " 1975", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Pathways Home Health and Hospice, Sutter Care at Home, VITAS Healthcare"}, "estimatedSalary": "57000", "jobDescription": "Hospice by the Bay is currently seeking a registered nurse to act as our Provider Relations Nurse Liaison at UCSF based out of our San Francisco office. The successful candidate will provide clinical education to medical providers on pain and symptom management, collaborative care planning and comfort care. This nurse will determine patient's eligibility for hospice care and meet immediate admission needs of patients as requested by medical providers. Essential Duties & Responsibilities (include but are not limited to): Develop relationships, maintain regular contact, and resolve issues with referral sources including physicians, hospitals, nursing facilities, residential care facilities for the elderly, senior housing, and community service agencies to ensure ongoing quality of care and referrals.Determine patient's eligibility for hospice care.Admit patients, obtain informed consent(s) for service, inform patient/family of rights and responsibilities.Assist with the implementation and coordination of services required for the discharge of patients from hospitals into agency’s hospice program.Education/Experience:Associates Degree or Bachelors of Science Degree in Nursing from an accredited School of Nursing.Minimum of one year experience in a home health/ hospice setting.Certificates, Licenses, Registrations:Current license as a registered professional nurse in the State of California.Public Health Nursing certification highly desirable.HPNA certification preferred.Current California Driver’s License and automobile insurance that meets State of California requirements, if driving a car.This full time position offers competitive pay, generous benefits and a supportive work environment and a $5000 sign on bonus.Are you a hero?"}