{"jobID": "2811395585", "jobLocation": "New_York_NY", "jobTitle": "Senior Data Scientist, Ad-Tech", "companyRating": "3.6", "companyInfo": {"Website": "www.dailymotion.com", "Headquarters": "Paris, France", "Size": "201 to 500 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "167000", "jobDescription": " Company DescriptionDailymotion is the leading video discovery destination & technology that learns about your tastes over time, constantly surfacing the best, most relevant content on the web. Our mission is to provide the best video user experience for consumers on the market, connecting publishers and advertisers to engaged viewers who turn to dailymotion for their daily fix of the most compelling music, entertainment, news and sports content around.  Through partnerships with the world&apos;s leading publishers and content creators, including CBS, CNN, Fox Sports, GQ, Mashable, Universal Music Group, VICE and more, dailymotion commands 4 billion monthly pageviews across its mobile app, desktop and connected TV experiences. Dailymotion is owned by Vivendi, one of the largest mass-media corporations in the world.Job DescriptionMake a huge impact for dailymotion by joining our team as a Senior Data Scientist. You will be responsible for building models to make data-driven decisions and shape the future experience for all dailymotion viewers. Work with fast-paced initiatives, overseeing projects from idea conception and strategy development to deployment, production, and operationsLeverage petabytes of video, audience engagement and advertising data to build customized experiences for users and advertisers at scaleResponsible for full cycle development of models from data collection and cleansing to feature engineering to model selection, prototyping and validation to A/B testing to deployment on managed cloud platforms to documentation and maintenanceDevelop data collection, forecasting, and reporting procedures that instantly highlight business opportunities, flag potential issues, and ease reporting to all business stakeholdersWork with a global team on data science challenges related to online advertisingQualificationsMasters or PhD in computer science, statistics, or a related fieldHave a deep understanding of online advertising technologies and ecosystem, with a focus on revenue forecasting and inventory management3+ years experience building end-to-end models for real-world internet scale systemsExcellent software engineering fundamentals (programming, data structures, complexity analysis, testing, etc.)Experience with data science tool kits (Pandas, NumPy, Scipy, NLTK, Spark, Weka, Docker) and platforms (Google Cloud, AWS, etc.)Proficient in query languages (SQL, Hive, Pig) and in MySQL or NoSQL databasesExcellent business sense and communication skillsAdditional InformationFlexible Time Off/HolidaysFitness Club Membership100% Healthcare CoverageCommuter Benefits401k ContributionPaid Parental LeaveFully Stocked Kitchen with Food & Beverages"}