{"jobID": "2641032343", "jobLocation": "San_Jose_CA", "jobTitle": "Senior Graphic Designer", "companyRating": "3.9", "companyInfo": {"Website": "www.janmarini.com", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Obagi Medical, SkinMedica"}, "estimatedSalary": "77000", "jobDescription": " Senior Graphic Designer | San Jose, CA  We are a quickly expanding aesthetic skin care company based in California that offers its employees a truly entrepreneurial experience with great value on individual input and creative thinking. The company offers amazing marketing and support tools ranging from B2B sales collateral to in-office merchandising for physician offices to DTC marketing through print, web, email video and social media. The ideal candidate is highly motivated, is experienced in a range of graphic design areas and revels in a fast paced environment where everyone is expected to have fun, contribute and take part in the creative direction of the company. Join our team of highly motivated professional and experience the thrill of being a part of a leader in the medical skincare industry.  Jan Marini Skin Research, Inc. was founded in 1994 and is a recognized leader and innovator in skincare that is committed to continually expanding and improving the professional skincare market. JMSR's two primary focuses are to provide innovative technologies that deliver proven measurable results and an unwavering commitment to the ongoing success of our customers.  We are looking for candidates who want to make a career in the medical skincare industry and have the desire to be a part of a dynamic atmosphere. This candidate is responsible for the art direction, creative design and production of digital and print marketing materials to be used through social media, direct mail campaigns, print ad collateral, B2B sales collateral and more! Reports to: VP Marketing Responsibilities and Requirements:Work with the entire marketing team to develop and transform sales, marketing and product positioning concepts into dynamic visual representationsDesign and execute graphic concepts to meet product or campaign visionsProvide creative direction and oversight on digital, print and video graphic projectsWillingness to own designs from initial concept creation to final sign-offDesign for a wide variety of mediums including email, online banner ads, social media graphics and ads, lifestyle images, printed sales collateral, in office patient collateral, direct mail campaigns and more.Ability to carry sales or marketing concepts across multiple pieces as part of a complete campaignInterface frequently with the VP of Marketing, Sales and Education to constantly evaluate the quality and impact of past, present and future collateralWork closely with the entire marketing team to provide photo and graphic outputs for a wide range of projectsParticipate or lead small-scale photoshootsConsistently deliver fresh ideas and concepts to keep the brand current and dynamicUpdate and maintain marketing, and sales collateral to ensure brand consistencyCreative problem solver: be able to define challenges, collect relevant information, draw insightful conclusions and develop marketing and graphic concepts to address the challengeBe a leader and provide design guidance to peers and developing designersStay up to date with latest trends to keep the company in the forefront of design.Requirements:10+ years graphic and digital design experienceBachelor's degree in graphic design or related fieldProven history and portfolio of digital, social media and print collateralAble to prioritize many tasks and deadlines with multiple departmentsStrong communicatorAre passionate about branding and graphic storytelling to creating compelling marketing campaignsAre proficient in Adobe Creative SuiteKeen understanding of graphic / web design principles and current web technologies (HTML / CSS)Experience in retail and aesthetic industry a plus Are you ready for a career in the skin care industry? Start here and apply today: h.r@janmarini.com. An HR representative will reach out to you directly. We look forward to hearing from you and thank you for your interest in Jan Marini Skin Research. Connect with us on LinkedIn"}