{"jobID": "2664044863", "jobLocation": "San_Jose_CA", "jobTitle": "Student Intern/Graduate Student Intern - Citywide", "companyRating": "3.6", "companyInfo": {"Website": "www.sanjoseca.gov", "Headquarters": "San José, CA", "Size": "5001 to 10000 employees", "Founded": " 1846", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "32000", "jobDescription": "The City of San José hosts approximately 80 student interns annually, from majors that include finance, graphic design, information technology, accounting, urban planning, political science, public administration, and many others. Applicants must be a current student enrolled in a college or university to apply and must continue to be enrolled during their employment/service with the City of San José. Interns at the City have flexible hours to work around their school schedules. Undergraduate interns generally work between 20-30 hours per week and graduate interns work between 25-40 hours per week.Departments that most frequently offer internship opportunities are listed below. For more information on all City departments, click here. The City Clerk’s Office also has opportunities for unpaid interns and volunteers; for more information, click here.San Jose International Airport (SJC) is now accepting applications for its 2017 Summer Internship Program. Student Interns at the Airport will learn and gain practical experience in multiple areas of airport operations and management. Interns will also be exposed to various airport industry careers while enriching their personal and educational goals.The Public Works Department’s mission is to provide excellent service in building a smart and sustainable community, maintaining and managing the City’s assets, and serving the animal care needs of the community. Interns can expect to perform substantive work, develop professional relationships, and help make a positive impact in the City of San Jose. With 9 divisions providing a diverse array of services, the Department offers a unique variety of opportunities across a number of fields of study for students to enhance their academic learning with real world knowledge, receive valuable training while providing public service to the community, and experience a professional work environment where they can develop both work and life skills. Internship opportunities include: Administrative Services, Animal Care & Services, City Facilities Architectural Services, Development Services, Engineering Services, Equality Assurance, Facilities Management, Fleet Management, and Transportation and Hydraulics Services.The Environmental Services Department (ESD) has established a national reputation for environmental leadership and innovation with award-winning recycling, water conservation, water quality protection, and wastewater treatment programs. Its major initiatives are: healthy streams, rivers, marshlands and bay waters; reliable water, garbage, and recycling services; clean and green air, land and energy policy development; and community education aimed at environmental sustainability. Interns in ESD can work on fun projects, make presentations, create and prepare training materials, do valuable research, use tech savvy skills to help market materials and provide overall team support.The Department of Transportation (DOT) maintains and operates the City of San José's transportation network of roadways, traffic signals, street lights, bicycle lanes, sidewalks, street trees and landscaping in addition to the public sewer system and storm drains. DOT's goal is to provide a transportation system that is safe, efficient, and convenient for all users, and that supports the City's livability and economic vitality. San José has adopted bold policy goals to be a leading city in the areas of environmental sustainability, innovation and fiscal efficiency. San José's DOT is organized into the following four divisions:Infrastructure MaintenanceTransportation and Parking OperationsTransportation Planning and Project DeliveryDirector's Office / Administration ServicesSan Jose Public Library is the largest public library system between San Francisco and Los Angeles. A proud recipient of the Gale/Library Journal Library of the Year Award, the library is an acknowledged leader in providing innovative services to meet changing customer needs. The San Jose Public Library enriches lives by fostering lifelong learning and by ensuring that every member of the community has access to a vast array of ideas and information.Housed within the Office of the City Manager, the Office of Economic Development (OED) leads the implementation of the City of San Jose Economic Strategy by working with other City departments, private businesses, and community partners. OED has four integrated divisions: Business Development, focused on job creation, business attraction, expansion and retention; Business Operations and Real Estate, focused on revenue generation, management of city owned property, and Department administrative support; Cultural Affairs, responsible for arts and cultural development; and work2future, the federally funded workforce development program serving Silicon Valley.The Information Technology Department's (ITD) mission is to enable the service delivery of its customers through the integration of City-wide technology resources. ITD consists of four core service areas:Enterprise Technology Systems and Solutions- Business Systems, Database Administration, Financial Management Systems, HR/Payroll, Integrated BillingInformation Technology Infrastructure- Core Network Infrastructure, Information Security, Telecommunications, Servers, Desktop Support, EmailCustomer Contact Center- Utility Billing, Internet Self-Service, General Information RequestsStrategic Support- Budget/Fiscal Management, Procurement, Contract Administration, Human Resources Analytical Support.The mission of the Parks, Recreation and Neighborhood Services Department (PRNS) is to cultivate healthy communities through quality programs and dynamic public spaces. Through proactive, strategic work plans, the Communications team develops, creates and implements outreach that is creative, articulate and engaging while telling a story of “Building Community Through FUN”.Interns' skills and talents will contribute to the creation and activation of community-building places, programs and people. Interns will gain experience and build their portfolio as interns provide general support, assist in event production and work on specific programs and projects important to PRNS and the City.  The Planning Division in the Department of Planning, Building and Code Enforcement (PBCE) is responsible for both long range planning--which involves guiding the City’s future by stewarding Envision San Jose 2040 (the City’s General Plan) and preparing Urban Village plans and other area plans--as well as current planning through the review of development proposals. The Planning Division implements policies and plans that determine where and how the City will grow and how that growth will be balanced with the availability of infrastructure and services.  The PBCE internship program is designed to offer professional learning opportunities to undergraduate and graduate students who are interested in the urban planning field. Interns may be assigned to specific projects in the sub-disciplines of urban village planning, development review, zoning, urban design, transportation, economic development, housing, sustainability, historic preservation, Geographic Information Systems, and data analytics. Interns will gain exposure to the operations of a planning department and have the opportunity to work on “real life” projects.Salary Information Student Intern Salary Range - $11.48 - $16.38/hr (unbenefitted)  Graduate Student Intern Salary Range - $14.84 - $21.92/hr (unbenefitted)Minimum Qualifications STUDENT INTERN: Current enrollment in an accredited college or university in an undergraduate or graduate program.  GRADUATE STUDENT INTERN: Completion of a Bachelor's Degree and current enrollment in a Master's degree program from an accredited college or university.  LICENSE: Possession of a valid driver's license authorizing operation of a motor vehicle in the State of California may be required for some positions.EMPLOYMENT ELIGIBILITY: Federal law requires all employees to provide verification of their eligibility to work in this country. Please be informed that the City of San Jose will not prepare or file a labor condition application with the Department of Labor.Selection ProcessAs opportunities arise, the selection process will consist of an evaluation of applicants’ training and experience based on the application and responses to the Job Specific Questions. Only those candidates whose backgrounds best match a specific internship opportunity will be invited to interview."}