{"jobID": "2705638495", "jobLocation": "Cambridge_MA", "jobTitle": "Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.hopper.com", "Headquarters": "Montreal, Canada", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "91000", "jobDescription": "About Hopper Hopper is the smart way to book travel on your phone. Combining massive amounts of data and advanced machine learning algorithms, Hopper predicts and analyzes airfare and accommodation to save users money and enable them to travel more often.  Since its launch in 2015, Hopper has become one of the fastest growing travel apps ever with over 25 million installs to date. It is now the most downloaded flights booking app in North America and travelers have booked hundreds of millions of dollars in flights and hotels around the world using Hopper.  The app has received accolades such as Fast Companys Most Innovative Company in Travel 2018, the Google Play Award for Standout Startup of 2016, and Apples App Store Best of 2015. The Role At Hopper, every dataset tells a story. Do you have what it takes to decipher the clues? bit.ly/2q6U8dq  Were looking for a data-savvy individual to join our team as a data scientist, to support data-centric product development and create consumer-focused research content based on our real-time feed of billions of flight search results along with an archive of several trillion data points.  You may be a great fit for our team if you are excited about exploring huge (and sometimes messy) data sets and finding effective ways to simplify and communicate the results to a non-technical audience. In this role you willTransform complex analyses into short, compelling, and easy to understand studies to share with journalists aimed at a consumer audienceFrame and conduct complex analyses and experiments using tremendously large (e.g. 10^6 to 10^10 records), complex (not always well-structured, highly variable) data setsDesign and implement ad hoc and automated analysis scripts, design and deliver appropriate summary tables, charts and interactive tools to present your resultsA perfect candidate has:A degree in Math, Statistics, Computer Science, Engineering or other quantitative disciplineExtremely strong analytical and problem-solving skillsProven ability to communicate complex technical work to a non-technical audienceA strong passion for and extensive experience in conducting empirical research and answering hard questions with dataExperience with relational databases and SQL, especially HiveExperience working with extremely large data setsExperience in Pandas, R, SAS or other tools appropriate for large scale data preparation and analysisExperience with data mining, machine learning, statistical modeling tools and underlying algorithmsProficiency with Unix/Linux environments Sound like a fit? We can't wait to hear from you. BenefitsWell-funded and proven startup with larger ambitions, competitive salary and stock optionsDynamic and entrepreneurial team where pushing limits is everyday businessAccess to comprehensive medical, dental, vision, disability and life insurance, all on usIn Cambridge, work in a historic factory building near Kendall Square; in Montreal, work in an artists loft in the Mile EndEasy commute with a paid-for public transportation or paid parkingIATA Travel Agent Card for discounts in the travel industryFully stocked kitchen with: coffee/tea, beer, bagels and healthy snacksTeam lunches, off-site activities and much more!"}