{"jobID": "2759412627", "jobLocation": "Santa_Clara_CA", "jobTitle": "Graphic Designer", "companyRating": "3.5", "companyInfo": {"Website": "www.oneworkplace.com", "Headquarters": "Santa Clara, CA", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "80000", "jobDescription": "Graphic DesignerBased in Santa Clara or San Francisco*Overview/Position Summary Responsible for working on a wide variety of project types: RFP’s, presentations, print, signage, marketing events, etc., in cooperation with the One Workplace Marketing and Sales teams. Receives direction and guidance from One Workplace’s Creative Brand Manager. Responsibilities:Develop and maintain key marketing and branding materials, including but not limited to RFP’s, presentations, brochures, magazines and event graphics.Work as part of a team with designers, copywriters, executives, etc.Prepare rough drafts of materials and present to the team for feedback and revisions.Amend final designs to internal feedback and gain full approval.Qualifications: Education/Experience  Bachelor’s Degree (B.A.) from a four-year college or university, plus at least 3 years related professional Graphic Design experience, with a strong portfolio. A combination of education and experience will be considered.  Knowledge/Skills/Abilities Demonstrated ability to think creatively and develop new design concepts and execute them through both print and digital mediums.Possess a creative flair, versatility, conceptual/visual ability and originalityHighly proficient in all design aspects, with demonstrable graphic design skillsExcellent verbal and written communication skills with ability to interact and present ideasExpert knowledge of InDesign, Illustrator, Photoshop and PowerPoint, as well as a strong knowledge of Word and Excel requiredHigh attention to detail and accuracyMust be able to multi-task in a fast-paced environment, prioritize tasks, and have strong organizational skillsProfessionalism regarding time, costs and deadlinesAbility to absorb and apply feedback from peers and clients Physical Requirements Seeing, hearing, color perception, clear speechAbility to move distances within the office and warehouseComplex reading and writing, basic math skills Working Environment  Regularly works alone and with others in person, over the phone and via email. Generally, works in an office environment around moderate noise. May work around moving and/or sharp objects. Has the flexibility to work out of our offices in Santa Clara, San Francisco or both. Job Status – Non-Exempt*If based in San Francisco, must be able to work from the Santa Clara office periodically."}