{"jobID": "2645519111", "jobLocation": "San_Jose_CA", "jobTitle": "Aerospace Physiology", "companyRating": null, "companyInfo": {"Website": "www.navy.com", "Headquarters": "San Diego, CA", "Size": "1001 to 5000 employees", "Founded": " 1775", "Type": " Government", "Industry": " Government", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " \"About This JobSince World War II, Naval Aerospace and Operational Physiologists have used the principles of physics, biology, and engineering to provide education and training; human performance support; human systems integration; and research, development, test and evaluation (RDT&E;) in support of Navy and Marine Corps operations. Aerospace and Operational Physiologists are experts in human factors and physiological threats related to the military operations, physiological elements which enhance mission performance, mitigation factors that prevent mishaps, procedures for surviving mishaps and hostilities, application of aircrew systems, and procedures for emergency egress and rescue.As a Navy Aerospace Physiologist, you may also participate in: Survival training Personnel selection and training  Research, Development, Test and Evaluation (RDT&E;) aimed at improving aviator performance and aircrew survivability Aeromedical operational and safety programsAs an Aerospace and Operational Physiologist, you could work at Aviation Survival Training Centers, Naval Medical Research Units, Marine Aircraft Groups, and Navy Air Wings, among other commands spread across the country from Washington to Florida and across the Pacific from Hawaii to Japan.Upon graduation from graduate school, those pursuing an Aerospace and Operational Physiologist position are required to attend Officer Development School (ODS) in Newport, R.I. ODS is a 5-week program that provides a comprehensive and intense introduction to the responsibilities of Navy Staff Corps Officers. Here they learn about the military structure of the U.S. Navy, its rich history of traditions and customs, leadership development and military etiquette.Aeromedical Officer training is then conducted in Pensacola, FL over the course of 6 months. The training fosters development of a strong and positive identification with the collective personality, lifestyle, and professionalism of Naval Aviation. It includes educational training in altitude physiology, aeromedical aspects of flight, sensory physiology, aviation life support systems, acceleration physiology, emergency egress, water survival, aircraft mishap procedures. Students must demonstrate aeronautical adaptability by successful completion, within given time constraints, of the prescribed curriculum of the Primary Flight Training at NAS Whiting Field, Florida.The Naval Aerospace and Operational Physiology warfare designation is obtained after successful completion of the aeromedical officer training; however, a two-year internship is required to complete the initial training and serve in the Fleet as an Aerospace and Operational Physiologist.Promotion opportunities are regularly available but competitive and based on performance.Your experience could: Give you the chance to work in the field as an Aeromedical Safety Officer Help you become an Aviation Life-Support Systems Specialist focused on RDT&E; activities Put you in line for an executive role advising high-ranking Navy and Marine Corps officials on current policy and procedureWherever you are in your professional career, the Navy can help ease your financial burdens and advance your career with generous financial assistance and continuing education programs.Through the Navy Health Professions Loan Repayment Program(HPLRP), you may be eligible to receive financial assistance to pay down the cost of your graduate education.\""}