{"jobID": "2731965967", "jobLocation": "Boston_MA", "jobTitle": "Director of Performance Marketing", "companyRating": null, "companyInfo": {"Website": "www.klaviyo.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "This position is responsible for marketing activities that enable our sales team to close new business; support our product team through regular market and competitive intelligence; and empower our success team to better understand and service Klaviyo customers. This is a central role responsible for developing and driving core components of Klaviyos go-to-market strategy.Your responsibilities include:Competitive intelligence. Segment and track the ecommerce marketing automation vendor landscape. Regularly monitor, report on, and develop training around our competitors positioning; go-to-market efforts; products; and market share.Audience segmentation and research. Refine and develop materials around our buyer personas. Regularly collect quantitative and qualitative data around customer profiles; motivations; perceptions; and business value. Synthesize and distribute your research to different teams across the organization.Sales enablement. Ensure our value proposition is communicated in a clear, compelling and consistent way across our sales and marketing efforts. Make sure key use cases and core benefits are communicated clearly in all product-specific messaging. This includes things like introductory demos for prospects; case studies; sales collateral; and internal training sessions.Positioning and messaging development. Translate your understanding of the competitive landscape, the audience, and our sales challenges and opportunities into compelling, segment-specific messaging. Ensure our core messaging is communicated regularly to your peers in marketing and across the organization; and reflected accurately across all external-facing materials.Program management. We supplement a strong inbound channel with select direct marketing programs, including search marketing; retargeting campaigns; and sponsorships. Youll be responsible for directing efforts across these channels to ensure they are cost-effective and reliably supporting our new customer acquisition efforts.Your success requires close collaboration with the sales, customer success, and product management team. As the command center for the rest of the sales and marketing team, your ultimate success will be measure by MRR. But there are several leading indicators youll be in a position to influence, including the lead conversion rate and high value customer retention.Getting Started / Key OutcomesIn the first 30 days, youll have: Gotten up to speed on our product.Done an initial analysis of the competitive landscape.Contributed your first blog post.Within 90 days, youll have:Overhauled internal sales collateral for our top 5 competitors.Refined our core messaging framework and translated it into sales-facing collateral.Revamped & presented the Klaviyo pitch deck to the sales, marketing and success teams.Developed an initial lead nurturing plan. Before you hit your first year anniversary, youll: Released new product messaging matching our customer profiles, and ensured it is reflected across the Klaviyo website.Built out a directory of sales assets, including battlecards; case studies; and testimonials.Built out an automated, segment-specific lead nurturing stream.Hit a regular monthly cadence of lead reactivation and/or conversion campaigns in partnership with sales.About YouYou pay close attention to the details, and youre also deadline-driven. You rock at organizing and motivating your peers across the company to drive home the value we deliver to our customers. You have exceptional communication skills, both written and face-to-face: youre succinct but compelling, and understand how to get the point across. Youre an exceptional analyst: youre not just comfortable with qualitative AND quantitative data, you know how to tell the story behind it. You love getting into the details, but youre a big picture thinker. Youre familiar with marketing automation and email marketing. And most importantly, you have a sincere passion for helping ecommerce founders and marketers grow their businesses by improving the way they target and communicate with their customers."}