{"jobID": "2757806884", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Joymode is making access better than ownership by creating a world where what we do isn't limited by what we own. We believe stuff shouldnt hold you back. Your annual summer bash shouldnt fall short because you dont have room for a margarita maker. You (and your space) shouldnt feel weighed down by the stuff you only ever use once or twice. So, go ahead. Live large. Well lend you everything you need to make it happen. And own little. Because the only things youll keep are the stories.  Data is a first-class citizen at Joymode and we collect it at every opportunity. We are building our own internal tools so we control the data and can use it to to guide the teams to make data driven decisions. Your work will have direct impact on how we manage our warehouse and how we communicate to our users through marketing. This is where you come in. We have data and we need to make sense of it and make it actionable. Whowearelookingfor: You will be joining the Data Science team as the second member and be in a position to make a huge impact to the company. You will use your machine learning knowledge to build recommendation engines to ensure our users discover the experience that will help them live the life they imagine. You will help every department (marketing, product, merchandising, warehouse operation, etc.) in the company make better decisions by doing ad-hoc analyses, building predictive models, and building dashboards with the key performance metric each team needs. You will build internal tools and integrate models into the existing Ruby on Rails code base. You will use machine learning to enhance our ability to forecast demand and decide what products to buy. You will help us make our warehouse and delivery routes more efficient. There is no end to the interesting and challenging data projects at Joymode. Come join us! Responsibilities:Work with each department to identify opportunities to leverage data to improve an outcome of the business by mine and analyze data from company database and third party sourcesBuild recommendation algorithmsWork closely with the performance marketing team to identify best high performing marketing campaigns and channelsBuild dashboards for company and individual teamsBuild a predictive demand model used to decide how much inventory to buy and how to staff up warehouseBuild tools to enable teams to be self serving in discovering data and making data based decisionsQualifications:Experience using statistical computer languages (R, Python, SQL, etc.) to manipulate data and draw insights from large data setsExperience working with and creating data architecturesKnowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacksKnowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applicationsExcellent written and verbal communication skills for coordinating across teams3-5 years of experience manipulating data sets and building statistical models, Masters or PHD in Statistics, Mathematics, Computer Science or another quantitative fieldBonus: experience with Ruby, Ruby on Rails or Vue.jsJoymode is an equal opportunity employer and we value diversity. We are committed to finding talent that is not determined on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}