{"jobID": "2645520900", "jobLocation": "Boston_MA", "jobTitle": "Medical Technology", "companyRating": null, "companyInfo": {"Website": "www.navy.com", "Headquarters": "San Diego, CA", "Size": "1001 to 5000 employees", "Founded": " 1775", "Type": " Government", "Industry": " Government", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " \"About This JobHeading up laboratories in support of medical and scientific specialists. Ensuring medical test accuracy for servicemembers and their families. Medical Technologists play an integral role in the Department of Defense health care team.They supervise the efficient operation of laboratory facilities in the United States and many foreign countries. They also carry responsibility for assets and personnel, and enjoy career-long opportunities for continuing education and training.As a Medical Technologist and Officer in the Medical Service Corps, you may: Work with highly skilled members of Navy medical teams to maintain the health and readiness of our servicemembers, their dependents and those in need around the globe Perform and manage a full range of laboratory services, with responsibility for ensuring the accuracy of results and compliance with the industry's highest standards Provide clinical laboratory and blood bank support to deployed forcesNavy Medical Technologists may serve wherever the Navy has labs at any one of more than 250 Navy and medical facilities around the globe, from Hawaii to Japan, Germany to Guam, and Washington, D.C., to Washington state.As a Medical Technologist, you could work at one of the highly acclaimed National Naval Medical Centers in Bethesda, Md.; Portsmouth, Va.; and San Diego, Calif. Or you could provide support to pilots and air crews aboard one of two dedicated hospital ships: the USNS Comfort and USNS Mercy.Upon graduation from college, those pursuing a Medical Technology position are required to attend Officer Development School (ODS) in Newport, R.I. ODS is a 5-week program that provides a comprehensive and intense introduction to the responsibilities of Navy Staff Corps Officers. Here they learn about the military structure of the U.S. Navy, its rich history of traditions and customs, leadership development and military etiquette.Promotion opportunities are regularly available but competitive and based on performance.\""}