{"jobID": "2746800651", "jobLocation": "Melville_NY", "jobTitle": "Editorial Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.newsday.com", "Headquarters": "Melville, NY", "Size": "1001 to 5000 employees", "Founded": " 1970", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": " Newsday Media Group (NMG) is one of the nation’s most dynamic media organizations, serving Long Island and New York City through its portfolio of mobile and digital products, print publications and live events. With 19 Pulitzer Prizes and other esteemed awards for outstanding journalism, our mission and vision is to engage consumers and businesses by connecting them to the communities in which they live, work and play.  Analyzes editorial data from different sources and generates actionable reports and tasks to improve audience engagement and inform overall newsroom content tactics.  The ideal candidate is sharp, hardworking and flexible with journalism and newsroom experience to shape information and analysis quickly.  Essential Duties & Functions Shares journalism experience with the newsroom, and applies it to data.Analyzes and looks for trends in overall editorial systems and platform metrics, including web, native apps and social media.Brainstorms, drafts and implements analytics strategies to help guide our 24/7 publishing cycle.Creates insights for editorial strategies that meet the overall content strategy and helps meet the content metrics goals derived from it.Becomes a content data evangelizer in the newsroom.Is able to generate analysis and insights quickly, to timely impact programming and strategizing on the site and native apps.Has strong communication skills that convey the impact of the data trends.Looks at data from different sources and platforms and weaves an analysis from all of them.Strategizes current implementation and future ones to ensure the correct data is being captured.Has strong analytical skills, as well as critical thinking and attention to detail Essential Job Knowledge & Skills Experience in journalism and newsroom/content data analysis strongly preferred.Bachelor’s degree in journalism, data analysis, statistics, mass communications or related field.Experience producing and generating reports in Microsoft Excel, Microsoft Access and other data platformsThe ability to work independently.Good understanding/knowledge of data gathering tools such as Adobe Analytics, Chartbeat, and Google Analytics.Comfortable working on a deadline-driven journalistic and product environment.Keen eye for detail and ability to jump quickly when new trends are discovered.Understanding of audience models and how data powers them.Reliable transportation to and from our Melville, Long Island office.Desk jobs are largely sedentary roles that would require one’s ability to sit for extended period of time up to full 8 hour shift; may occasionally lift up to 25 lbs for files and supplies; ability to reach, bend. Newsday Media Group is an Equal Opportunity Employer and maintains a drug-free and smoke-free workplace."}