{"jobID": "2464256468", "jobLocation": "San_Francisco_CA", "jobTitle": "SEO Intern", "companyRating": "4.5", "companyInfo": {"Website": "www.universalgiving.org", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2002", "Type": " Nonprofit Organization", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "36000", "jobDescription": " SEO Intern Facebook  Twitter  LinkedIn  Email  AddthisUniversalGiving™, an award-winning global social-entrepreneurship nonprofit organization, is seeking a SEO Intern to join our exciting team. As an SEO Intern, you will work with Google Adwords and Google Analytics; prior experience with these services is desired. We have existing campaigns with Google AdWords, but are always seeking to increase our engagement and make it more effective. This internship is ideal for a highly analytical and well-organized person who wants to support our mission and get the word out about international giving and volunteering.  UniversalGiving™ is an award-winning website allowing people to donate and volunteer with top performing projects all over the world. Unique to UniversalGiving, 100% of a donation goes directly to the cause. UniversalGiving has been profiled on CBS and in FOX Business Network, and has also been featured in BusinessWeek Fast Company, CSRWire, WomenEntrepreneur, Oprah.com, NBC News.  Join UniversalGiving and work closely with the CEO and a dedicated international team, while gaining valuable skills and insight into social entrepreneurship. Responsibilities include:Identify new high quality keywordsFormat html tags on our website to optimize organic search rankingsMonitor page rankingsCompile weekly traffic reports using Google Analytics and Google AdWords dataStay current on industry trends and have an in-depth understanding of search ranking factorsProvide strategic SEO guidance on website developmentManage and create pay-per-click (PPC) marketing campaigns in Google AdWordsQualifications:Experience with SEO work and conceptsExperience with Google Adwords is preferredClear understanding of words/phrases in SEO/SEM Campaigns which highlight our unique value proposition, and set us apart from the competitionWorking knowledge of HTMLSkilled at word choice for marketing, and at creating concise advertising phrasesInterest in working with qualitative and quantitative analysis in SEO/SEM reportingCritical attention to detailComputer skills, Microsoft Word and ExcelCommitment to using and updating Salesforce, our Relationship DatabaseExcellent writing and communication skillsInterest in nonprofit work, international issues, and philanthropyFull support of the mission and vision of UniversalGiving™Benefits:Experience working at a unique global, social-entrepreneurship nonprofitCollaboration within a positive team environmentIncreased understanding of and alignment with global issuesNetworking with other nonprofit professionalsCareer mentoring with Pamela Hawley, Founder & CEO of UniversalGiving™For students, class credit can be arranged according to school requirementsDuration: Minimum 15-20 hours per week required for the duration of the internship, at least a minimum of 3 to 4 months. Ideal candidates are available to work out of our San Francisco office 3-4 days/week (Monday through Friday) with possibly some work completed remotely. About UniversalGiving UniversalGiving™ is an award-winning website allowing people to donate and volunteer with top performing projects all over the world. Our projects are vetted through a proprietary Quality Model™ to ensure the most effective, trustworthy philanthropy possible. Unique to UniversalGiving, we take no cut on donations. 100% of your donation goes directly to the cause.  UniversalGiving Corporate consults with Fortune 500 companies on the strategy, operations and NGO Vetting for their international giving and volunteering programs all over the world. Some clients include Cisco, Symantec, Fluor, Sabre, MTV.  Located in the heart of San Francisco, UniversalGiving has been profiled on CBS and in FOX Business Network, and has also been featured in BusinessWeek Fast Company, CSRWire, WomenEntrepreneur, Oprah.com, NBC News, The Christian Science Monitor, The New York Times, The Financial Times, MarketWatch, CNNMoney.com, Change.org and See Change Magazine. UniversalGiving has been voted as one the top nonprofits on Great Nonprofits in 2012, and was a Webby Award Honoree.  CEO Pamela Hawley is a winner of the Jefferson Award (the Nobel Prize in Community Service) and was selected as one of 50 leaders to the White House's Next Generation Leadership and Social Innovation event. She is a Finalist for Ernst & Young’s Entrepreneur of the Year Award, and a Colburn S. Wilbur Leadership Fellow at the Global Ethics Institute. She is a Fast Company Expert Blogger on CSR. UniversalGiving’s Mission: We Connect People to Top Performing Opportunities Worldwide. UniversalGiving’s Vision: “To Create a World Where Giving and Volunteering Are a Natural Part of Everyday Life.” Testimonial\"Working with UniversalGiving has given me the chance to participate in critical aspects of business management and partnership facilitation, which are opportunities that would definitely be off-limits to \"the intern\" at most corporations. The friendly and ultra-supportive executive team here wants their interns to contribute to the main goals and aspirations of UniversalGiving in important ways and helps them to do so, which is what makes working here so rewarding and fun - so fun, in fact, that I will continue to be a part of their team even after leaving the San Francisco office!\"Emily StehrUG Representative at Princeton University, Summer InternTo Apply: Email your resume, cover letter, and writing sample (2 pages max) to volunteers@universalgiving.org with \"SEO Intern\" in the subject line. Applications are reviewed on a rolling basis. No phone calls please. UniversalGiving™ is committed to understanding and representing the diverse populations it serves worldwide. Members of all ages, genders, sexual orientations, races, ethnicities, nationalities, physical abilities or disabilities, religions or beliefs, and cultures are welcome as employees and volunteers in our organization. We believe that a diverse team will best serve our diverse populations."}