{"jobID": "2814297201", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Physical Damage Appraiser - San Jose/San Mateo", "companyRating": null, "companyInfo": {"Website": "csaa-insurance.aaa.com", "Headquarters": "Walnut Creek, CA", "Size": "1001 to 5000 employees", "Founded": " 1914", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable", "Competitors": " GEICO, Allstate, State Farm"}, "estimatedSalary": null, "jobDescription": " External candidates: In order for your application to be correctly processed please sign-in before you apply  Internal candidates: Please go to Workday and click \\\"Find Jobs\\\" link under Career  Thank you for considering opportunities with us!  Questions? TalentAcquisition@cs​aa.com​ Job TitleSenior Physical Damage Appraiser - San Jose/San MateoRequisition NumberR2708 Senior Physical Damage Appraiser - San Jose/San Mateo (Open)LocationCalifornia - Home TeleworkersAdditional LocationsJob Information Are you looking for a growing company that is caring and committed to exceptional service? Are you ready to put your experience to work and advance your career? If so, be part of acommunitythatworks at CSAA Insurance Group, a AAA insurer, in San Jose / San Mateo CA geographical territory.  While we’ve been named a 'best place to work,' our proudest accomplishment comes from serving nearly 17 million AAA members. Through our dedication to service, growth and our people, CSAA Insurance Group will create AAA Members for life by fulfilling our promise to be there when they need us the most.  As a Senior Physical Damage Representative you will help us achieve our goal by handling physical damage and total loss claims, and serving as the voice of our company and owner of the AAA claims experience.A typical day as a Senior Physical Damage Appraiser includes: Claims handling: as a virtual employee this position independently evaluates, negotiates and settles physical damage and total loss claims along with other suffixes (i.e. loss of use, property damage), which requires physical inspection and evaluationService, trust & care: Caring for our members, by listening and helping to solve the issues they face.Attention to detail: Keep claims organized and moving forward to achieve a timely resolution.Completing investigations: Resolves claims coverage issues. Negotiates settlement of claim with insured, third party and attorneys. Gather and understand facts about accidents, make decisions, and determine liability.Continual communication: Keep customers informed throughout the duration of their claim using various methods; phone, email, other written correspondence. As a valued member of our community, you will: Grow: Achieve career growth by continuously developing your skills through on-the-job experience, exposure to others and formal education opportunitiesCollaborate: You will be a part of an organization dedicated to AAA members and one another.Join a team who seeks out and incorporates different perspectives to drive towards better resultsWork at a place where you are encouraged to actively display empathy and concern for our customersVolunteer: You'll have the opportunity to receive paid time off to participate in community volunteer service projects. CSAA Insurance Group offers many benefits, including: Medical, dental, vision, disability and life insurance coverage including benefits coverage for domestic partners. Company contributions into a Health Savings Account (HSA).401(k) plus company matching dollar for dollar up to 6% and a cash balance retirement program.Company paid employee assistance plan and health support programs.Award-winning wellness programs including free onsite fitness classes.Paid bonding leave for birthing and non-birthing parent and paid adoption leave.Two weeks paid military leave.Paid time off, plus ten paid holidays and 24 hours of paid time off to volunteer.Paid training, tuition reimbursement, self-service training, career development and mentorship opportunities. Be part of a community that worksAt CSAA Insurance Group, we take pride in our values-based culture. Helping our employees have enriched lives and satisfying careers is how we work. Our employees appreciate the integrity and inclusion that is evident throughout our everyday interactions. We respect the diverse range of perspectives, backgrounds and cultures of our teams, and join together when it comes to helping our members, community or one another.  Headquartered in Walnut Creek, California, our community also works in Arizona, Colorado, Nevada, New Jersey and Oklahoma. Learn more about us at CSAA-Insurance.aaa.com/careers  Please submit your application to be considered. We communicate via email, so check your inbox to ensure you don’t miss important updates from us. Questions? Please email us at talentacquisition@csaa.com.  We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.  *LI-SB1  CSAA123Required qualifications:Possesses demonstrated technical knowledge inclusive of auto-body repair practices and procedures  Strong and effective negotiation skills  Strong analytical, problem-solving and organizational skills  Basic math and working computer skills with technical aptitude to utilize a variety of software applications  Strong oral and written communication skills  Ability to work in a flexible, changing environment  Ability to work independently, be self-motivated and goal oriented  Proficient in ability to write estimates in computerized estimating systems  Preferred qualificationsBachelor’s degree and/or equivalent work experience  Bilingual, Spanish and English  Property and casualty insurance license  Typically 3+ years of claims experience  Apply"}