{"jobID": "2803546084", "jobLocation": "Secaucus_NJ", "jobTitle": "Account Executive, Inside Sales", "companyRating": null, "companyInfo": {"Website": "www.advancelocal.net", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Multiple positions open for a new team being formed. Great opportunity if you want to be part of something new with fantastic potential! POSITION SUMMARY: The Account Executive (Inside) generates revenue focused on new business acquisition, targeting prospective revenue opportunities and by selling print and digital advertising and servicing accounts via telephone, chat, webinars, and/or email. This position is responsible for exceeding established revenue goals by selling print and digital advertising (e.g., banner & display ads, online classifieds, digital video ads, email ads, mobile ads, pop-up ads, rich media ads, search ads, online sponsorships, and online affiliate marketing programs graphical display ads on Local Market Website and ad networks, text, apps, digital directories, search engine marketing, search engine optimization, social media optimization). DUTIES AND RESPONSIBILITIES:Exceed established individual revenue goals within scope of qualified revenue prospects.Conduct inbound and/or outbound telesales activity to identify, prospect to close and win new business.Proactively identify and qualify leads through cold calling, networking, marketing, referrals and database leads.Respond to email inquiries and follow through with needs assessment to determine appropriate solutions.Develop appropriate proposals that provide on-point customer solutions with optimized campaigns, using all available resources.Effectively closes the sale.Maintains a sales funnel within Salesforce per stated guidelines.REQUIRED EDUCATION, EXPERIENCE AND SKILLS:Bachelor’s degree or equivalent work experienceMinimum two years’ experience in needs-based selling with proven track record of success in increasing sales in a competitive marketplaceEffective phone presentation skillsExcellent communication skills both verbal and writtenAssertive, goal-oriented and self-motivatedAbility to multi-task, handle pressure and work under deadlines with exceptional organizational skillsAbility to build strong relationships across departments with focus on follow up and personal accountabilityCRM sales management software experience with a leading platform, Salesforce preferredProficient in MS Office Suite including Excel, Word, PowerPoint and OutlookWorking Conditions and Physical Requirements: General office environment. Extensive computer use required. Light travel may be required.  Advance Local, one of the largest media groups in the United States, operates the leading news and information companies in more than 25 cities, reaching 50+ million people monthly with our quality, real-time journalism and community engagement. Our company is built upon the values of Integrity, Collaboration, Accountability, Fearlessness, and Customer Focus. Advance Local includes MLive Media Group, Advance Ohio, NOLA Media Group, Alabama Media Group, NJ Advance Media, Advance Media NY, MassLive Media, Oregonian Media Group, Staten Island Media Group, Advance 360, The Alpha Group, Headline Studio, and our Enterprise Digital Innovation team. For more information about Advance Local, please visit www.advancelocal.com. Advance Local is an Equal Opportunity Employer and does not discriminate on the basis of race, color, religion, gender, national origin, age, physical or mental impairment, sexual orientation, marital status or any other category protected under federal, state or local law. #LI-DT1"}