{"jobID": "2830928226", "jobLocation": "New_York_NY", "jobTitle": "Chicago Pop-Up Editor, Sales Associate", "companyRating": null, "companyInfo": {"Website": "www.forcebrands.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About The PositionOverview A Glossier Pop-Up Editor, Sales Associate is more than a salesperson. You are a friend who gives the best advice on how, when, and why to use Glossier products. You are a crucial part of the overall offline customer experience. You are the face of our brand, embody our values, and have a relatable and inviting attitude. You will be a part of the Chicago pop-up team and help bring the local Glossier experience to life.  Full-time or part-time  Start date: August 2018  Duration: 2 months ResponsibilitiesWelcome customers and act as their first offline experience touchpointBe an expert on the Glossier brand and on all Glossier products, including sharing personal experiencesEducate customers about Glossier products and facilitate salesHelp customers choose the right products for themHelp customers check outClean and organize the pop-upQualificationsImpeccable customer service skills: identify customers' needs and tailor an experience accordinglyApproachable: act like a friend that gives great Glossier advice, with a personal touchPositive energy: have a \"no such thing as a stupid question\" attitudeGreat communication skills: can communicate with everyone-patience is keyExperience in a customer-facing roleRoll-up-your-sleeves attitude (no task is beneath you)Ability to identify opportunities, be creative, and generate insights for improvementQuick to learnOrganizedPassion for the Glossier missionLove for Glossier productsUnderstanding of the Glossier aesthetic and visual languageAble to work 3-5 days a week, including weekends, starting in mid-August for about 2 monthsAbout Glossier Glossier is a beauty company that lives in NYC, is sold on the internet, and promotes a skincare-first philosophy that celebrates beauty in real life. "}