{"jobID": "2672011251", "jobLocation": "Boston_MA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.theceresgroup.com", "Headquarters": "Boston, MA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Are you interested in working for a company with a start-up feel, but is already established? This company is redefining what it means to engage with customers in the financial service industry. If you have an advanced quantitative background we want to speak with you. Requirements What skills you need.  Master's Degree in Mathematics, Statistics, Economics or other quantitative discipline  8-10 years of prior research, data science, or analytical modeling experience in the aforementioned domains and are familiar with:statistical and technical tools for analysis (R, Python, SQL, SAS, Cognos, etc.)automated machine learning tools (Matplotlib, RapidMiner, DataRobot)retail banking or transaction processing industries Strong quantitative background to perform daily statistical analyses and coding tasks and are fluent in:risk analytics, pricing, risk modelingpattern recognition or machine learningdata mining, manipulation, analysis, charting and other visualization and reporting toolslarge data sets, working with distributed computing tools a plus (Map/Reduce, Hadoop, Hive, etc.) Research mindset with bias towards action and have the ability to structure a project from idea to  experimentation to prototype to implementation by manipulating and analyzing complex, high-volume, high-dimensionality data from varying sources including normalized & de-normalized datademonstrating a strong passion for empirical research and for answering hard questions with datataking a flexible analytic approach that allows for results at varying levels of precisioncan communicate complex quantitative analysis in a clear, precise, and actionable manner to nontechnical stakeholders Driven and focused self-starter - great communicator - amazing follow-through - aggressively tackle your work and love the responsibility of being individually empowered.  What your DNA looks like. Passion to win: Thrives in a competitive environment, does what it takes to be THE market leaderCommunicative: Must have strong interpersonal skills and the ability to effectively present and explain information to internal and external clientsResourceful: Resourceful, figure-it-out-and-get-it-done mentality. Ability to work independently in a team environment and help resolve any impasses during a projectOrganized: Must be able to prioritize daily, weekly and monthly tasks and possess a \"sense of urgency\"SDL2017"}