{"jobID": "2728536926", "jobLocation": "Boston_MA", "jobTitle": "Senior Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.tessella.com", "Headquarters": "STEVENAGE, United Kingdom", "Size": "1 to 50 employees", "Founded": " 1980", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "148000", "jobDescription": " We are looking for an accomplished data scientist and analytics expert with a proven record of designing and implementing custom data analytics solutions. In return, we can offer an exciting and rewarding career with provide plenty of opportunities to learn and develop.The RoleAs part of our fast-growing global analytics consulting firm, you will work with industry-leading companies to innovate and solve interesting and complex real-world problems that truly make a difference in the world. Often occupying a lead role within our Tessella Analytics Partnership (TAP) engagement model, your core function will be to work closely with our clients, helping identify and understand their analytical and business challenges and collaboratively design and develop elegant solutions. You will provide technical leadership and expertise for our clients, as well as Tessella project teams, to deliver those solutions through the application of advanced mathematical and machine learning techniques.  As a consulting company, much of our work is done on client sites. When working in a TAP lead role the successful candidate should be willing to work on our clients’ sites in the Collegeville, PA area between 50% to 75% of the time. Additionally, some travel further afield may be required and you should also be willing to travel up to 25% of the time when necessary.Principal ResponsibilitiesEngage with clients to understand their challenges and opportunities and develop creative and innovative approaches.Engage with client stakeholders to extol and raise awareness of the benefits and opportunities of analytics and data science.Apply a broad array of capabilities spanning machine learning, statistics, mathematics, modelling, simulation, text-mining, natural-language processing, data-mining, pathway/network analysis.Digest complex data structures, perform statistical data reduction, summarization, normalization and multivariate data analyses and report findings using advanced visualization techniques such as Spotfire, Tableau, Partek or similar applications.Develop new software-based tools, applications and solutions to provide our clients’ scientific staff with the necessary tools they need to do their work.Develop effort and cost estimates and detailed project plans so clients fully understand what you and/or the Tessella team will deliver.Lead & mentor analytics teams to deliver solutions to clients.Build strong relationships, collaborate with clients and colleagues and communicate clearly about project goals, challenges and results.Be a positive voice in the Tessella community, sharing your knowledge with others across the company.RequirementsMasters or PhD in a science, mathematics or engineering discipline.At least 5 years of experience applying data science, analytics, machine learning and computational techniques in life sciences or related fields.Deep understanding of algorithms, data processing, and visualization.Strong programming skills in scripting languages such as Python, R, and Perl. Object-oriented programming experience is desirable.Experience in at least two of the following areas: predictive analytics, modeling and simulation, Bayesian statistics, network analysis.Experience of processing and analyzing large multivariate data sets.Experience with algorithm development, data mining, natural-language processing (NLP), machine learning and artificial intelligence.Excellent communication and presentation skills with specific experience in cross functional collaborations.Prefer broad understanding of the biotech/pharmaceutical industry and supporting scientific, translational, and clinical platforms/domains.About TessellaTessella is the Analytics World Class Center of the Altran Group, a global leader in innovation and high-tech engineering consulting. We are leaders in the field of data science and analytics and we have developed a reputation for helping clients solve their most complex technical challenges by unlocking the power of their data, enabling them to make better-informed business decisions.  Our work is at the cutting-edge of high-tech R&D; and our projects are varied and rewarding. For example, in pharmaceutical companies we solve computational problems for chemists at the early stages of drug discovery and development, allowing them to get a head start when they begin their experiments in the lab, ultimately getting drugs to market faster. We help consumer goods companies model and simulate new product ideas and perform data analysis to improve their processes. We also support oil and gas engineers with the computational challenges of exploration and production, from reservoir modelling to writing control systems. In space and defense, we have written algorithms and solved complex mathematical problems to control satellites and radar systems. "}