{"jobID": "2814301638", "jobLocation": "New_York_NY", "jobTitle": "Senior Scientific Account Lead, Real World Value and Evidence (formerly Health Economics and Outcomes Research) MID ATLANTIC", "companyRating": "4.0", "companyInfo": {"Website": "www.jnj.com", "Headquarters": "New Brunswick, NJ", "Size": "10000+ employees", "Founded": " 1887", "Type": " Company - Public (JNJ) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Abbott Labs, Novartis, Covidien"}, "estimatedSalary": "129000", "jobDescription": " Janssen  Scientific Affairs, LLC, a Johnson and Johnson Company, is recruiting for a  Senior Scientific Account Lead, Real World Value and Evidence (formerly Health  Economics and Outcomes Research) to support the Mid Atlantic territory. The  candidate must currently reside in NY, NJ, or E PA.  At the Janssen Pharmaceutical Companies of Johnson & Johnson, what matters  most is helping people live full and healthy lives. We focus on treating,  curing and preventing some of the most devastating and complex diseases of our  time. And we pursue the most promising science, wherever it might be found.  Janssen Scientific Affairs, LLC is dedicated to providing medical information  and consultative support to a number of J&J;'s pharmaceutical companies. The  company's mission is to create the pre-eminent model of scientific excellence  in the promotion of public health.  We are Janssen. Our mission drives us. Our patients inspire us. We collaborate  with the world for the health of everyone in it.  The Senior Scientific Account Lead (SAL), RWV&E;  Field, is responsible for providing fair-balanced, objective, scientific/clinical  information to external and internal customers across all the key products  within the Janssen Pharmaceutical portfolio.  External customers can include Managed Care Organizations (MCOs), large  physician groups, Group Purchasing Organizations (GPOs), Pharmacy Benefit  Management (PBM) companies, Governmental Agencies (CMS and VA/DoD System),  Medicare, Medicaid, Long Term Care (LTC) facilities and Integrated Delivery  Networks (IDNs), and Accountable Care Organizations (ACOs) in the assigned region/geography.  The Senior SAL is also  responsible for supporting and partnering with key internal business partners,  primarily the Strategic Customer Group (SCG).  This individual will contribute to business planning and internal business  partner teams by providing strategic clinical input, pharmacoeconomic/health  outcomes input and customer insight. The Senior SAL maintains a high level of  key account management and builds external relationships with recognized  experts in managed markets/health care systems.  The Senior SAL may work closely with in-house  Outcomes Research colleagues to facilitate training, professional development,  and take responsibility for leading national level projects where he/she will  function as the RWV&E; Field point person, while participating in various  aspects of the given project.  The Senior SAL attends and  actively participates in select medical/outcomes research meetings, advisory  boards and internal meetings with the goal of developing and implementing  strategic clinical programs in conjunction with the Outcomes Research Directors  and Population Health Teams to impact current and future research strategy and  designs, as well as current and future value propositions of both commercial  and pipeline North America Pharmaceutical products.  The Senior SAL will work towards  proficiency and leadership in the role to contribute to the department and team  success. The  Senior SAL is responsible for conducting all activities in accordance with  current regulatory and health care compliance guidelines. As part of the region, you will  work closely with Strategic Account Directors, Medical Science Liaisons,  and Population Health Researchers to support strategy planning.Collaborate with strategic  Account Directors to respond to unsolicited requests from customers.Key internal customers  requiring clinical and outcomes support from the Senior Liaison, HECOR  Field include the managers/directors for Strategic Accounts, Government  Accounts, Reimbursement, Health Policy and Advocacy, Corporate Accounts  and the respective therapeutic area Medical Affairs groups.Display sufficient mastery of  the scientific and economic/outcomes data for the entire Janssen product  portfolio and functions to be able to support their customer base within  their geography.Also, special assignments are  executed, such as the development of slide decks or study critiques or  unique projects.Participates in regional  symposia and other national/regional professional and company meetings.Demonstrates success by  delivering credible scientific exchange across the entire product portfolio  and demonstrating an ability to excel in a matrix environment.QualificationsA PharmD or PhD or another  doctorate degree is required.A minimum of 2-5 years  post-graduate experience in a clinical or managed care setting is  required.Pharmaceutical industry is  preferred.Experience working in a payer  environment is highly preferred.Experience working with outcomes  research, disease management and comparative effectiveness research and  trends; able to relate these developments to pharmaceuticals is highly  preferred.Demonstrated ability to  communicate and comprehend scientific, economic and humanistic concepts  effectively with sophisticated and technical audiences required.Excellent interpersonal skills  required.Proven ability to effectively  build partnerships, relationships and collaborate internally and  externally.Proficiency  in MS PowerPoint is required  for presentations.Must have a valid U.S. drivers  license and a clean driving record, as incumbent in this role will receive  a company car.Approximately a minimum 50%  travel in region and must currently reside in or able to relocate at own  expense to the Mid Atlantic territory.  Johnson & Johnson Family of Companies are equal opportunity  employers, and all qualified applicants will receive consideration for  employment without regard to race, color, religion, sex, sexual  orientation, gender identity, genetic information, national origin,  protected veteran status, disability status, or any other characteristic  protected by law.Primary Location United States-New Jersey- Other Locations North America-United States-Pennsylvania, North America-United States-New York Organization Janssen Scientific Affairs, LLC (6120) Job Function Medical Science Liaison Requisition ID2345180525"}