{"jobID": "2606913740", "jobLocation": "Austin_TX", "jobTitle": "Data Scientist-ISD", "companyRating": "3.2", "companyInfo": {"Website": "www.walmart.com", "Headquarters": "Bentonville, AR", "Size": "10000+ employees", "Founded": " 1962", "Type": " Company - Public (WMT) ", "Industry": " Retail", "Revenue": " $10+ billion (USD) per year", "Competitors": " Target, Costco Wholesale, Amazon"}, "estimatedSalary": "82000", "jobDescription": "Position DescriptionConsults with business stakeholders regarding data insights and recommendationsDrives analytics insights across the divisionDrives the execution of multiple business plans and projectsEnsures business needs are being metLeads medium- to large-sized analytics project teamsManages the continuous improvement of data science and analyticsPromotes and supports company policies, procedures, mission, values, and standards of ethics and integrityProvides supervision and development opportunities for associates Minimum QualificationsBachelors degree in Statistics, Economics, Analytics, Mathematics, Computer Science, Information Technology or related field and 9 years experience in an analytics related field OR Masters degree in Statistics, Economics, Analytics, Mathematics, Computer Science, Information Technology or related field and 7 years experience in an analytics related field. Additional Preferred Qualifications2 years experience with big data analytics.6 years experience with SQL and relational databases (for example, DB2, Oracle, SQL Server).6 years experience with statistical programming languages (for example, SAS, R).Bachelor's degree in Statistics, Economics, Analytics, Mathematics and 12 years experience in an analytics related field.Certificate in business analytics, data mining, or statistical analysis.Doctoral degree in Statistics, Economics, Analytics, or Mathematics and 6 years experience in an analytics related field.Master's degree in Statistics, Economics, Analytics, or Mathematics and 8 years experience in an analytics related field. Company SummaryWhat started small, with a single discount store and the simple idea of selling more for less, has grown over the last 50 years into the largest retailer in the world. Each week, over 260 million customers and members visit our 11,695 stores under 59 banners in 28 countries and e-commerce websites in 11 countries. With fiscal year 2017 revenue of $485.9 billion, Walmart employs approximately 2.3 million associates worldwide. Walmart continues to be a leader in sustainability, corporate philanthropy and employment opportunity. It's all part of our unwavering commitment to creating opportunities and bringing value to customers and communities around the world."}