{"jobID": "2797146720", "jobLocation": "New_York_NY", "jobTitle": "Lead Registered Nurse-Progressive Care Unit", "companyRating": "3.6", "companyInfo": {"Website": "www.floridahospitalcareers.com", "Headquarters": "Orlando, FL", "Size": "10000+ employees", "Founded": " 1908", "Type": " Hospital", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Orlando Health, BayCare Health System, HCA Healthcare"}, "estimatedSalary": "52", "jobDescription": "Lead Registered Nurse RN Progressive Care Unit PCUTop Reasons why you want to work at Florida Hospital North Pinellas in Tarpon Springs, FL as a Lead Registered Nurse RN Progressive Care Unit PCU Named a Top General Hospital by The Leapfrog Group for 2nd Consecutive YearReceived 10th Straight 'A' Grade for Patient SafetyUtilizes the da Vinci® Surgical SystemNationally recognized and board certified orthopedic departmentRegistered Nurse Progressive Care Unit (PCU) Full Time NightsLocation 1395 S Pinellas Avenue, Tarpon Springs, FL, 34689 Work Hours/Shift Full Time - Nights Florida Hospital North Pinellas Florida Hospital North Pinellas is a full-service, 168-bed facility dedicated to helping our neighbors in beautiful Tarpon Springs and beyond. As a regional medical center, we offer a wide range of comprehensive services, testing and education opportunities for our community. Weve been focused on meeting the needs of North Pinellas residents for nearly 90 years, and Florida Hospital has built its reputation for compassionate, patient-centered care for more than a century.  Important Note: Florida Hospital North Pinellas is a Smoke/Tobacco Free Campus.  Tobacco use is defined as the use of any tobacco product including the use of temporary aids to stop smoking such as nicotine patches, nicotine gum or other similar products.  Applicants being considered for employment at Florida Hospital North Pinellas will be tested for nicotine use as part of their regular pre-employment screening. Those who are identified as tobacco users will be ineligible for employment, but may reapply in six months. You will be responsible for:Facilitates a multidisciplinary approach to patient care, patient flow, staffing, resource utilization and problem solving for a specific patient care department.Collaborates with patients/customers, families, physicians, administration and associates to meet customer needs.Provides safe patient care, evaluates the interventions provided and forecasts resource needs to meet patient care needs on an ongoing basis.Uses critical thinking skills and the nursing process to insure optimal patient outcomes.Facilitates the tone of the work environment and assures that all personnel are competent.Med/Surg and/or PCU certification (Preferred)2-4 years relevant clinical charge nurse experience Med/Surg and/or PCU certification2-4 years relevant clinical charge nurse experienceLead Registered Nurse RN Progressive Care Unit PCUWhat will you need?Current Registered Nurse License required by start dateBasic Life Support (BLS)- (Accredited through American Heart Association) requiredBSN preferredMinimum 1-year bedside experience This facility is an equal opportunity employer and complies with federal, state and local anti-discrimination laws, regulations and ordinances."}