{"jobID": "2748331250", "jobLocation": "New_York_NY", "jobTitle": "Data Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.amdocs.com", "Headquarters": "Chesterfield, MO", "Size": "10000+ employees", "Founded": " 1982", "Type": " Company - Public (DOX) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Netcracker Technology, CSG, Huawei Technologies"}, "estimatedSalary": "123000", "jobDescription": "Job ID: 59732Who are we? If you’re a smartphone user then you are part of an ever more connected and digital world. At Amdocs, we are leading the digital revolution into the future. From virtualized telecommunications networks, Big Data and Internet of Things to mobile financial services, billing and operational support systems, we are continually evolving our business to help you become more connected. We make sure that when you watch a video on YouTube, message friends on SnapChat or send your images on Instagram, you get a great service anytime, anywhere, and on any device. We are at the heart of the telecommunications industry working with giants such as AT&T;, Vodafone, Telstra and Telefonica, helping them create an amazing new world for you where technology is being used in amazing new ways every single day. In one sentence This is a combination of a leadership and hands-on position for a motivated and talented innovator who has experience in the media and entertainment industry. This Data Scientist position performs data mining and develops algorithms that provide insight from data while interacting with the business in communicating value and contextualizing insights. What will your job look like?You will oversee and perform end-top-end data research that yields practical business results.You will design data mining solutions to be implemented and executed with alignment to the planned scope and design coverage and needs/uses, leveraging knowledge and a broad understanding of E2E business processes and requirements.You will define the data analytics research plan, scope and resources required to meet the objectives of his/her area of ownership.You will identify and evaluate new data analytic technologies and trends for their potential business impact to determine the proper prioritization of data analytics strategy and roadmap based on business needs and analytics ROI.You will identify data sources, oversee the data collection process and design the data structure in collaboration with data experts (BI or big-data), domain experts, and business experts. You will also ensure data quality to derive conclusions that achieve high value insights (relevancy and veracity).You will construct data models (algorithms and formulas) for required business needs and predictions.You will work closely with content experts and managers to pinpoint queries, map data, and validate results.You will present results, including the preparation of patents and white papers and facilitating presentations during conferences.All you need is...5+ years of experience working in Cable / Broadcast Television IndustryExperience with digital and television measurementPh.D. in Computer Science, Mathematics or Statistics4 years’ experience in tasks related to data analyticsIn depth knowledge of data analytics models, techniques and toolsAbility to work as part of a team in collaboration with subject matter expertsKnowledge of Media Industry areas being investigated - RequiredAbility to communicate business valueKnowledge in RDBMS SQL, NoSQL, graph DBs, Hadoop and Hadoop Ecosystem technologies, AWS, R, Python, JavaWhy you will love this job?You will be working with dynamic IT Professionals at the back-end in creating content & data with analysis and trends for the media and entertainment business.You will interact with others throughout the organization to gracefully listen to needs, match those needs with the correct solutions, give advice to non-technical teams, and promote that solution across the business and IT groups.You will work across all boundaries with cross regional teams wherever your presence is needed to support the business."}