{"jobID": "2532162985", "jobLocation": "Boston_MA", "jobTitle": "Quality Decision Support Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.tuftsmedicalcenter.org", "Headquarters": "Boston, MA", "Size": "1001 to 5000 employees", "Founded": " 1796", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": " Req Number:10117733 Department:: Cardiovascular Center: Administration Schedule: Full-Time Regular Shift: Day shift Grade: 12 Hours: 8-4:30 Job Details: 3-5 years experience is required This position has direct reporting responsibility to the Chief Medical Officer and an indirect reporting responsibility to the President of the Medical Staff. Oversight responsibilities include managing data and databases that support performance improvement activities for the medical staff and allied health professionals within Tufts Medical Center. Will work directly with the Chief Medical Officer and the President of the Medical Staff on initiatives to support compliance with Joint Commission's Focused Professional Practice Evaluation and Ongoing Professional Practice Evaluation activities, in order to ensure institutional compliance with relevant Joint Commission and other accrediting body accreditation standards. The ultimate objective of the physician quality program is to improve patient outcomes and support high-quality, effective patient care by identifying variation in physician practices. This individual will interface directly with Physician leaders, including Department: and Division Chiefs, attending staff physicians and allied health professionals. The individual works collaboratively with the Manager of Medical Staff Services to ensure compliance with the Medical Staff Chapter of the Joint Commission standards. The individual will work with the Associate Chief Medical Officer for Graduate Medical Education to identify potential data sources and methodologies for reporting information on clinical effectiveness to interns, residents and fellows. RESPONSIBILTIES: Establishes effective process for focused professional practice evaluation activities (FPPE) utilizing Access, Excel, or other relevant database activities to ensure all new providers have documentation of quality oversight at the 120 period, and all providers undergoing focused professional practice evaluation have appropriate documentation of such activities available to the Credentials Committee and other entities as required. Works collaboratively with Health Information management, Performance Improvement and clinical Department:s to identify appropriate sources for FPPE evaluation activities; Establishes effective communication chains between the Manager, MSO, the Credentials Committee, and clinical leaders to ensure effective evaluation practices are established and maintained. Utilizes the University Hospital Consortium (UHC) database to develop and provides reports to the CMO Department: Chairs and other clinical leadership as required to evaluate physicians on an ongoing basis, establishing a proactive system of at least three data points in a two year cycle for documentation of ongoing professional practice evaluation Prepares scheduled, defined reports for Physician leaders as requested Analyzes reports and identifies trends and statistical significance in metrics that will assist Department: Chairs with identifying variations in practice and help them to focus Department:al performance improvement activities to reduce variation process improvement. Assists Department: Chairs and other clinical leaders in developing effective reports and evaluation tools from systems other than UHC, including e-clinical works and Soarian. Utilizes data available from UHC, e-clinical works (ECW), Soarian and incorporating data from other Department:s, including blood product utilization, infection rates, and health information management statistics to develop comprehensive profile of physician performance to support credentialing activities as required. Regularly attends Credentials Committees and provides reports to Medical Board as requested. Provides quarterly drill down analysis of patient satisfaction data from Press-Ganey and HCAHPS systems relating to physician performance to clinical leaders Analyzes performance data at high and drilled down level. Identifies \"correlations\" between survey questions and specific services. Summarizes performance gaps and priority \"opportunities for improvement\". Trains individuals for independent data base use. Provides interpretation consultation for metric \"users\". Makes informed recommendations on purchase of software and hardware, taking into account statistical analysis, database and data entry needs and future projected system capacity needs. Establishes and ensures system confidentiality and limited access to certain information for the protection of physician and patient privacy and compliance with legislative and regulatory requirements. Maintains collaborative, team relationships with peers and colleagues in order to effectively contribute to the working groups achievement of goals, and to help foster a positive work environment Works with Associate Chief Medical Officer for Graduate Medical Education to identify potential data sources and distribution methodologies to support ACGME standards that require \"reporting data clinical effectiveness\" to house staff. REQUIREMENTS: Knowledge of relational databases, report writing, and presentation software packages. Comprehensive understanding of Joint Commission accreditation standards related to physician performance; Comprehensive understanding of ACGME requirements related to data on clinical effectiveness; Ability to present complex data and concepts to physicians, nurses, and other clinical and administrative leaders within the Tufts Medical Center community. Experience as a clinician or 3 or more years of experience working in a health care delivery environment. Experience within an academic medical center preferred but not required. Knowledge of statistics and research methodologies Working understanding of quality improvement and process improvement methodologies. Analytical skills needed to work independently with databases, prepare budgets, develop policies and procedures, perform appropriate statistical analyses, etc. Interpersonal skills needed to interact effectively with physicians, nurses, and administrative leaders within the hospital. Masters' degree or equivalent in a clinical discipline, statistics, biostatistics, or in a related biomedical or life science. Three years of experience working in health care field where position required database management"}