{"jobID": "2556934269", "jobLocation": "San_Jose_CA", "jobTitle": "Software Engineer", "companyRating": "4.0", "companyInfo": {"Website": "www.lookingglasscyber.com", "Headquarters": "Reston, VA", "Size": "201 to 500 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " FireEye"}, "estimatedSalary": "128000", "jobDescription": "LOOKINGGLASS CYBER SOLUTIONS is hiring for an experienced, dynamic and technically versed Software Engineers. This chosen candidate will look to be apart of and support a small software engineering team responsible for assessing requirements, developing use cases, and designing, coding, documenting, debugging and maintaining software applications.  The Software Engineer position requires applicants to be self-driven and work in a distributed team designing and coding high quality customer driven ready to ship solutions. The candidate has strong working knowledge and experience of Agile Software Development and will be responsible for design, coding, and testing of solutions touching on a wide variety of technologies. Strong collaboration skills are a must. OVERVIEW OF POSITION:Codes, documents and demonstrates complex solutions by developing documentation, layouts, diagrams, charts, code comments, and well-structured code while working within the Agile Scrum software development methodology.Improves operations by conducting systems analysis; recommending changes in product, policies and procedures.Updates job knowledge by studying state-of-the-art development tools, programming techniques, and computing equipment; participating in educational opportunities; reading professional publications; maintaining personal networks; participating in professional organizations.Accomplishes engineering and organization mission by completing related software engineering and organizational tasks as assigned.Develops software by studying information needs; studying systems flow, data usage, and work processes resulting in strong code implementing the solution; investigating problem areasQUALIFYING REQUIREMENTS"}