{"jobID": "2822104324", "jobLocation": "Cerritos_CA", "jobTitle": "Data Scientist Sr", "companyRating": "3.5", "companyInfo": {"Website": "www.antheminc.com", "Headquarters": "Indianapolis, IN", "Size": "10000+ employees", "Founded": " 2004", "Type": " Company - Public (ANTM) ", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "134000", "jobDescription": "Your Talent. Our Vision. At Anthem, Inc., it’s a  powerful combination, and the foundation upon which we’re creating greater access  to care for our members, greater value for our customers, and greater health  for our communities. Join us and together we will drive the future of health  care.  This  is an exceptional opportunity to do innovative work that means more to you and  those we serve at  one  of America's leading health benefits companies and a Fortune Top 50 Company. Data Scientist Sr.Location: Cerritos CAResponsible for the development and implementation of  machine learning algorithms and techniques to solve business problems and  optimize member experiences.  Primary duties may  include are but not limited to: Design machine learning projects to address  specific business problems determined by consultation with business partners.Work with data-sets of varying degrees of size  and complexity including both structured and unstructured data.Piping and processing massive data-streams in  distributed computing environments such as Hadoop to facilitate analysis. Implements batch and real-time model scoring  to drive actions.Develops proprietary machine learning algorithms  to build customized solutions that go beyond standard industry tools and lead  to innovative solutions.Develop sophisticated visualization of analysis  output for business users. Publish  results and address constraints/limitations with business partners.Provides high-level controllership/evaluation of  all output produced to ensure established targets are met.Determines the continuous improvement  opportunities of current predictive modeling algorithms.Proactively collaborates with business partners  to determine identified population segments and develop actionable plans to  enable the identification of patterns related to quality, use, cost and other  variables. Lead the  design, implementation, and continuous delivery of data pipeline supporting the  development and operation of custom analytic products/services across the  organization.Utilizes data wrangling tools and advanced  statistical/machine learning techniques to create high-performing predictive  models and actionable insights to address business objectives and client  needsCommunicates effectively with internal  stakeholders on product design, data specification, model implementations, with  partners on collaboration ideas and specifics, with clients and account teams  on project/test results, opportunities, questionsCreates project plans to ensure projects are  completed on time and within budget. Provides high quality ongoing customer  support, answering questions, resolving issues and building solutions Demonstrate  skills in building scalable prototypes is required; demonstrated capability in  building scalable analytical solutions is strongly preferred.Demonstrated familiarity with large datasets,  and understanding of data analysis workflows is required; strong preference for  information integration across different sources (e.g. structured data, text,  and image) is required.Lead analytical projects and pilots for upgrades  or enhancements.-Master’s or Bachelors in related discipline, e.g.  statistics, operations research, computer science, mathematics and 5 years of  relevant work experience in data analytics or related field and 2 year of  experience is required.  -Strong demonstrated understanding of machine learning  methods and applied statistical packages as applied to data analysis within  open source scripting languages (e.g. R, Python) is required.  -Extensive experience with linear regression, tree based  models, Neural Networks, NLP and familiarity with Tensorflow, Keras or Theano  -Proficiency in one or more programming languages such as R,  Python, HTML5, etc. is required  -Required experience in business applications of distributed  computing (e.g. Map Reduce, HIVE, and HADOOP) is strongly preferred;  -Strong relational database SQL skills; including  optimization techniques, with knowledge of NoSQL concepts Solid experience with UNIX and shell scripting -Demonstrated ability in ingesting, cleansing and  contextualizing data through advanced data engineering approach is preferred. Proven communication and influence skills are required. Experience in Healthcare industry is  preferred. Anthem, Inc. is ranked as one of America’s  Most Admired Companies among health insurers by Fortune magazine and is a 2017 Diversity  Inc magazine Top 50 Company for Diversity. To learn more about our company and  apply, please visit us at antheminc.com/careers. EOE. M/F/Disability/Veteran."}