{"jobID": "2830906292", "jobLocation": "San_Jose_CA", "jobTitle": "Quality Engineer CNC Job Shop", "companyRating": null, "companyInfo": {"Website": "www.jobjuncture.com", "Headquarters": "Houston, TX", "Size": "1001 to 5000 employees", "Founded": " 1992", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Love your job! We are presently seeking a hands-on QUALITY ENGINEER with solid experience working within a custom machining / precision metal fabrication job shop manufacturing environment.  Our client company is a successful Multi-Billion dollar contract manufacturer, who specializes in custom products ranging from commercial electronics and precision machined components.  Their operation, located in the San Jose, CA area, is a subcontractor for precision machined parts for the aerospace, electronics and semiconductor processing equipment industries. It employs a blend of high volume / low mix and low volume / high mix production within a cellular manufacturing environment.  The Quality Engineer will be part of the quality engineering efforts for two separate plants within the San Jose areaparticipate in continuous improvement through the development and implementation of Quality processes, systems, tools and techniques.share the company's commitment to Lean Six Sigma manufacturing practices. This is an excellent career opportunity to be a part of a well established and financially secure leader in the custom machining / fabrication arena, whose San Jose operations are often rated at the top of the list of good companies to work for. Excellent Life Work balance. Strong long-term advancement potential.  Exceptional compensation and benefits. REQUIREMENTS Strong quality engineering background within a custom machining / metal fabrication job shop manufacturer. Contract / job shop manufacturing experience is absolutely requiredBachelors degree, preferably in Mechanical Engineering. BSME7+ years of quality engineering experience.Lean Six Sigma Black or Green Belt and/or an ASQ CQE certification is a big plus, but not required. COMPENSATION:  Total compensation will depend on applicant experience. Base salary range: $75K to $95K plus a 15% annual bonus  #LI-SK1"}