{"jobID": "2794320108", "jobLocation": "Norwood_MA", "jobTitle": "Sr. Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.fmglobal.com", "Headquarters": "Johnston, RI", "Size": "5001 to 10000 employees", "Founded": " 1835", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Zurich North America, AIG, Allianz"}, "estimatedSalary": "140000", "jobDescription": " Overview - ExternalFM Global is a leading property insurer of the world's largest businesses, providing more than one-third of FORTUNE 1000-size companies with engineering-based risk management and property insurance solutions. FM Global helps clients maintain continuity in their business operations by drawing upon state-of-the-art loss-prevention engineering and research; risk management skills and support services; tailored risk transfer capabilities; and superior financial strength. To do so, we rely on a dynamic, culturally diverse group of employees, working in more than 100 countries, in a variety of challenging roles.Responsibilities - ExternalAs a Senior Data Scientist you will work in a high powered environment with a team of creative and innovative individuals to identify, solve and support implementation of current and future business and client needs, as well as research new methodologies and data sets to further the Company’s technical analytics ability.  You will be working on cutting edge issues using unique data only available to FM Global in a very dynamic, exciting and evolving research area. You work will change our business.  You will plan, conduct, and direct the development and evaluation of approved analytics projects or tasks within projects, with minimal or limited supervision. You will work on business critical projects, interact with internal customers and have responsibility for delivering and communicating status and results of your projects.  Our projects range from financial decision support and advanced risk analytics to engineering based analytics. We work on short term business critical problems and develop long-term opportunities for FM Global.Qualifications - ExternalRequired Ph.D. or Master’s degree in Data Science, Statistics, Economics, Econometrics, Operations Research, or other relevant analytics fieldsDeep knowledge in descriptive, predictive and prescriptive analyticsExperience working with statistical software packages like R, SAS, Python, JMP or SPSSExperience with Visualization tools like Tableau or Power BIExperience in applying statistical techniques such as regression and classification models, cluster analysis, neural networks, ensembles, random forestsHighly analytical with strong problem-solving skillsStrong attention to detailStrong verbal and written communication skillsDesire and ability to work well with others in a team environmentStrongly preferred Some business experience in analyticsExperience working across disciplinesA plus Familiarity with next-generation capabilities, such as artificial intelligence, machine learning, text mining and other technology that will be used to support best-in-class analyticsGeneral business knowledge related to risk management and/or insurance"}