{"jobID": "2730964892", "jobLocation": "Santa_Clara_CA", "jobTitle": "Sr. Applications Engineer - Ethernet, ASIC, FW/", "companyRating": "3.7", "companyInfo": {"Website": "www.marvell.com", "Headquarters": "Santa Clara, CA", "Size": "1001 to 5000 employees", "Founded": " 1995", "Type": " Company - Public (MRVL) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "100000", "jobDescription": "The Ethernet PHY applications team is a key part of Marvell's Connectivity, Storage, and Infrastructure Business Unit responsible for cutting edge  switching and infrastructure solutions for enterprise, data center, service providers, small business, and digital home customers. We are seeking  a candidate ASIC Design fundamentals and firmware/software knowledge. Excellent verbal/written/presentation skills are needed as  this role will involve some direct customer-facing role activities for design review, etc.  This is an awesome opportunity with a small team driving key design wins and support for 10G/25G/40G/100GbE PHY products.  Responsibilities:  ·Drive and manage the technical aspect of customer design process from device evaluation to  production.  ·Understand customer’s target markets, analyze and prioritize customer design requirement, and  provide feedback to the engineering team.  ·Drive and assist the sales team to win key designs with Marvell PHYs.  ·Review customer schematics and layout.  ·Hands-on bring-up and debug of customer boards to diagnose, troubleshoot, resolve issues.  ·Support firmware and systems engineering team in the collective effort of device and system  level testing as requested by customers.  ·Provide technical training to Marvell Sales Engineers, Distributor Field Applications Engineers,  and key customers on Marvell PHY products.  ·Prepare demonstrations for trade-shows and customer visits. Work closely with Marketing  and Design to define next generation tools and products.  ·Develop technical collateral material including: application notes, release notes/errata, White  papers and other technical documents.  Occasional domestic and international travel required  #LI-KB1Experience with new system bring-up and ability to work under a high pressure environment.Expertise in High speed interfaces is preferred. Familiarity with high speed PCB layout, signal integrity, assembly and manufacturing.Working knowledge of using lab equipment including high speed oscilloscopes, spectrum  analyzers, logic analyzers and traffic generators. Ability to debug at system level involving hardware as well as firmware/software issuesAbility to write scripts for system/device configuration and test automation.Strong communication and interpersonal skills."}