{"jobID": "2827672434", "jobLocation": "San_Francisco_CA", "jobTitle": "Fraud Risk Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.matrix.msu.edu", "Headquarters": "Commerce Township, MI", "Size": "1 to 50 employees", "Founded": " 1994", "Type": " College / University", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "58000", "jobDescription": " Title: Fraud Risk Data Analyst Location: San Francisco, CA Type: Contract Responsibilities include: The Digital Channels Group (DCG) manages the delivery of financial products and services to consumer and business customers via digital channels and leads our client's online channel and e-commerce activity across businesses and geographies. This position will be responsible for performing various complex activities related to fraud risk analysis, reporting and strategy development as it relates to the various Digital Channels. The position is responsible for supporting and collaborating with the Risk Portfolio Managers within FP&A;, and ensuring the most current fraud trends and fraud risks are being considered within product development plans, and product life-cycles. The position is responsible for analyzing the current performance of fraud alerting strategies, optimizing alerting strategies and recommending new or additional actions for alerting strategies. The position will communicate regularly with team members internally and outside of FP&A;, and even outside the DCG group in order to complete requests or analysis. The position must be able to communicate effectively and efficiently to large audiences and management. Performing more complex analysis and/or modeling that maximizes profits and/or asset growth and minimizes fraud and/or operating losses and other risk exposures Providing analytical support for Internet and mobile banking, operating losses and other product strategies to ensure company goals are met Segmenting and monitoring various risk, deposit and other product groups, vintages, concentration limits, etc. and making recommendations to management based on those trends; producing performance monitoring and benchmarks regarding growth, mix, losses and overall profitability and performance Coordinating the production of monthly, quarterly, and annual reports for senior management Reviewing and analyzing trends in current population distributions and recommending strategies. Collaborates with multiple lines of business and divisions to strategize and develop multi-channel strategies."}