{"jobID": "2744935727", "jobLocation": "Burlington_MA", "jobTitle": "Clinical Data Analyst - SQL", "companyRating": "2.9", "companyInfo": {"Website": "www.amerisourcebergen.com", "Headquarters": "Chesterbrook, PA", "Size": "10000+ employees", "Founded": " 2001", "Type": " Company - Public (ABC) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " McKesson, Cardinal Health, Kinray"}, "estimatedSalary": "64000", "jobDescription": " Under  general direction of the Director – Clinical Analytics, the Data Analyst II  role is responsible for managing data projections of oncology EHR data,  producing syndicated reports, developing clinical data analyses and models to  address pharma client inquiries, and supporting product development initiatives  employing predictive analytics. Designs relevant analyses of  EHR data enabling meaningful conclusions regarding key industry trends.Leads in the development of  new product concepts, providing council on the selection and application  of appropriate analytical techniques for addressing product development  needs.Manages and produces custom  and syndicated research-based deliverables.Manages secondary research,  including identification, evaluation, and data basing of clinical research  and business events. Requires training in fields  such as biology, mathematics, chemistry or similar fields obtained through  completion of a four year Bachelor’s Degree program. Normally requires a  minimum of three (3) years directly related and progressively responsible  experience; strong analysis experience (as a provider). Graduate degree in  business or life science discipline, strongly preferred. 3 years of experience  in reporting, metrics development, and/or analytics or completion of a  related graduate studies program required.Must provide leadership  in developing, reviewing, and interpreting project requirements with  business personnel.Creative analytical  problem-solving skills for evaluating business problems and applying  applications knowledge to identify appropriate solutions.Must possess exceptional  analytical skill to produce accurate, timely, meaningful, and reliable  analysesStrong general knowledge  of medical science and healthcare data.Understanding of key  business processes and drivers.Experience with the  following or related technologies: Excel, PowerPoint, Microsoft SQL,  statistical analysis software (SAS certification, preferred).Excellent verbal and  written communication skills.Ability to handle  multiple tasks and adapt to unique situations and challenges.Strong organizational  skills and exaggerated attention to detail.Ability to mentor junior  personnel.Strong interpersonal  skills."}