{"jobID": "2756429867", "jobLocation": "San_Jose_CA", "jobTitle": "Senior Business Systems Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.netgear.com", "Headquarters": "San Jose, CA", "Size": "501 to 1000 employees", "Founded": " 1996", "Type": " Company - Public (NTGR) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "106000", "jobDescription": "Senior Business Systems Analyst Netgear is seeking Senior Business Systems Analyst to support Financials and HCM functions. As a key member of Technology Services group, the BSA will work closely with IT and business counterparts on resolving issues /bugs as well as delivering solutions to meet the needs of various business and functional areas. In this position, the individual will work to provide business process support and continuous process improvements related to Oracle Finance and HCM track. They will work with various IT and business user groups in defining, prioritizing and executing process and system enhancements.  Responsibilities: Provide day-to-day application support for Oracle R12 Finance including Channel Revenue Management and HCM applications in a multi-site, multi-user, global environment.Analyze issues and understands their business impactTake ownership of actions and follow through on commitmentsWork within IT / with Oracle to ensure quality application support and deliveryUnderstand user-provided business requirements to create technical specifications and solutionsDeliver technical and non-technical solutions that both enhance the business process and conform to the technical architecture. Required Skills: Must have worked on Oracle Financials(GL, AGIS, AP, AR, FA, CM, ChRM)Working knowledge of HCM is a plusThorough understanding of is preferableStrong verbal and written communication skillsSelf-directed and self-motivated to solve problems quickly and creatively in a fast-paced environment Required Experience: Minimum 10 years of IT and business/industry work experience with at least 5 years of experience in Oracle Financials, HCMQualification: Bachelors in Computer Science or equivalent degree"}