{"jobID": "2792535309", "jobLocation": "New_York_NY", "jobTitle": "FAO - Senior Accountant", "companyRating": null, "companyInfo": {"Website": "www.rsmus.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1926", "Type": " Private Practice / Firm", "Industry": " Accounting & Legal", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Sr Associate FAO Accountant is responsible for all areas relating to financial reporting for firms FAO clients. This position will be responsible for adhering to accounting principles, practices and procedures to ensure accurate and timely financial statements. The Sr Associate FAO Accountant manages the Accounts Receivable, Accounts Payable and Payroll processes and is responsible for ensuring that work is properly completed in a timely and accurate manner. This position will need to work to tight deadlines and a multitude of accounting activities, including general ledger preparation, financial reporting, year-end client tax and audit projects, and the support of budget and forecast activities.  The Sr Associate FAO Accountant will have contact with clients and client contacts, including the clients tax accountant and other professional service providers. RESPONSIBILITIES · Overall day-to-day management of financial reporting accuracy and on-time processing of client information  · Bank and other balance sheet account reconciliations  · Payroll reconciliations  · Review and approval of account classifications  · Review of G/L for any missing transactions and overall accuracy  · Management of weekly Open Items and To-Be-Coded lists, supervised/reviewed by the Controller  · Preparation of initial/draft Management Reporting Package each month, for completion by Controller  · New staff assigned buddy and orientation manager  · Manage the A/R, A/P and Payroll processes  · Routing of Sales Tax and other reports for preparation to appropriate parties within and outside the firm  KEY SUCCESS FACTORS · Ability to prioritize and focus in a high-paced, multi-tasking environment  · Ability to quickly learn and use new technology software applications  · Positive telephone, email and other communication skills as contact with clients and others will be  · extensive and ongoing  · Commitment to protecting client privacy, even within the firm, as appropriate  · Ability to apply self to learning and applying technical skills  · Co-operative team player  · Interest in personal and professional development and advancement KEY PERFORMANCE INDICATORS · On-time delivery of client financial reporting packages  · Low error rates and overall quality of work output  · Self Motivating and effective work skills  · Integration into the team  · Meeting assignment objectives (timeframes, budgets, outcomes)  · Ability to work independently in a sometimes stressful environment with extensive multi-tasking demands  · Client satisfaction  · Participation in FAO team and firm wide initiatives  · Learning and demonstration of evolving accounting and technology skills QUALIFICATIONS/SKILLS AND EXPERIENCE AND PERSONAL ATTRIBUTES · Bachelors Degree in Accounting, CPA a plus  · Prior Accounting experience required that involved processing of Accounts Payable, Accounts Receivable and Payroll. Experience preparing payroll and sales tax returns.  · Prior experience working with ERP accounting systems strongly preferred  · Strong technology skills using Microsoft Office 2007 or later (Word, Excel, PowerPoint, and Outlook at a minimum, more applications preferred)  · Experience working in a paperless environment strongly preferred  · Strong interpersonal and relationship building skills  · Team player with a positive can-do approach  · A general and growing knowledge of firm products and services in the practice area, and a general knowledge of products and services in other practice areasYou want your next step to be the right one. You've worked hard to get where you are today. And now you're ready to use your unique skills, talents and personality to achieve great things. RSM is a place where you are valued as an individual, mentored as a future leader, and recognized for your accomplishments and potential. Working directly with clients, key decision makers and business owners across various industries and geographies, you'll move quickly along the learning curve and our clients will benefit from your fresh perspective.  Experience RSM US. Experience the power of being understood.  RSM is an equal opportunity/affirmative action employer. Minorities/Females/Disabled/Veterans. "}