{"jobID": "2819950933", "jobLocation": "Boston_MA", "jobTitle": "Audit Intern", "companyRating": null, "companyInfo": {"Website": "www.bdo.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1910", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Auto req ID 12701BR Posting Title Audit Intern Multiple Locations Boston Address 1 One International Place City Boston State Massachusetts Zip Code 02110 Job Summary BDO’s Core Purpose is Helping People Thrive Every Day. Our Core Values reflect how we manage our work, our relationships and ourselves. As an employee of the firm, you will live true to our Core Values of people first, being exceptional every day in every way, embracing change, feeling empowered through knowledge and choosing accountability. Our Core Values are the standards by which we conduct ourselves day in and day out, both internally and externally.  BDO is a place for energetic self-starters who can think and act like entrepreneurs. As an Intern in our Assurance practice, you will begin to utilize your educational background as well as your organizational skills as you serve the firm's dynamic client base. You will assist in problem solving and fact-finding, working side-by-side with more experienced team members who can provide you with direction, coaching and learning opportunities. This opportunity will allow you to gain a unique hands-on perspective on our firm’s practices and people, as well as beginning to forge the critical relationships that will help maximize your chance for success in your career. Qualifications Education: Enrolled in a Bachelors or Masters program in Accounting or other relevant field requiredPursuing a masters degree in Accounting or other relevant field preferredExperience:Leadership experience preferredLicense/Certifications:Actively pursuing school credits to become a CPASoftware:Proficient in Microsoft Office Suite, specifically Word, Excel and PowerPointOther Preferred Knowledge, Skills Abilities:Strong written and verbal communication skillsAbility to follow instructions as directedAbility to work effectively in a team settingPositive attitude and willingness to learn"}