{"jobID": "2830739765", "jobLocation": "Boston_MA", "jobTitle": "Screening Analyst", "companyRating": null, "companyInfo": {"Website": "www.arbor.com", "Headquarters": "Uniondale, NY", "Size": "201 to 500 employees", "Founded": " 1993", "Type": " Company - Public (ABR) ", "Industry": " Real Estate", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Walker & Dunlop, Berkadia, Greystone"}, "estimatedSalary": null, "jobDescription": " Arbor Realty Trust, a real estate investment trust that invests in a diversified portfolio of multifamily and commercial real estate-related loans and other real estate-related assets has a career opportunity at its Boston office for a Screening Analyst. The main function of this position will be to support the continued growth of Arbor’s business by analyzing multifamily loan opportunities and recommending financing options using Arbor’s various loan products.  The Screening Analyst will have the following duties and responsibilities, including but not limited to: Collect, review, and analyze financial exhibits & market data for debt structure modeling in ExcelConduct preliminary credit reviewsConduct due diligence of the borrowerComplete market research through third party information sourcesCoordinate with the originator and the underwriting department in the processing of the applications.Education: Bachelor’s degree in Finance, Economics or a related discipline and have a familiarity with the terms and concepts of real estate finance. Experience: Minimum of 1 to 2 years’ experience in the analysis of real estate or commercial finance preferred. Recent graduates with a Masters, as well as intern experience in real estate will be considered. Knowledge/Skills/Abilities:Applicants must be proficient in Microsoft Excel and WordMust be a quick learner, and detail orientedDemonstrated ability to organize & prioritize projects; complete multiple tasks on scheduleAbility to problem-solve and exercise independent judgment while displaying a high degree of initiative and accuracyMust have the ability to work alone as well as with others to reach a common goalPossess excellent analytical, communication, organizational and multi-tasking skillsStrong interpersonal skills a plusMust be able to mentor and train junior staffFamiliarity with Real Estate and Finance a plusTravel: None"}