{"jobID": "2721022966", "jobLocation": "Morgan_Hill_CA", "jobTitle": "Medical Social Worker", "companyRating": "3.4", "companyInfo": {"Website": "www.satellitehealth.com", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 1973", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " DaVita, Fresenius Medical Care - North America"}, "estimatedSalary": "61000", "jobDescription": " Requisition Number 18-0241  Post Date 5/10/2018  Title Medical Social Worker  Location Morgan Hill  Job Status Part Time  Work Hours 32  City Morgan Hill  State CA  Description Satellite Healthcare is a successful, nonprofit organization that has improved the lives of people living with kidney disease since 1973. We earn our national reputation for excellent patient care each day by offering a complete range of dialysis therapy choices, personalized clinical services, and unparalleled wellness education. Satellite Healthcare provides expert, personalized kidney care at over 80 centers across the U.S. as well as at acute dialysis locations in California and Texas. Learn more about Satellite Healthcare at www.satellitehealth.com. The Medical Social Worker is responsible for psychosocial assessment for long term services to patients on dialysis treatment. Work with a health care team to promote patient's positive adjustment using brief counseling interventions and community referrals. Assist patients with financial/insurance problems; Medi-Cal and Medicare knowledge very helpful. Work is in an outpatient clinic working with an interdisciplinary team. Strong case management skills essential. Computer skills for documentation to meet timelines and regulatory expectations. Computer skills for documentation to meet timelines and regulatory expectations.  Requirements Minimum QualificationsEducation: Master’s degree in Social Work from a graduate school that is accredited by the Council of Social Work Education (CSWE).Experience: One (1) year of work experience in a behavioral or healthcare related setting. License/Certification: Licensure as a professional social worker as designated by state requirements (for positions outside of the state of California). Current CPR certification (or within 3 months of hire date). Knowledge, Skills and Abilities:• Ability to read, write, speak, understand and satisfactorily communicate with others in English • Basic computer skills; proficient enough to be able to use computer software programs for medical record maintenance • Second language skills very helpful"}