{"jobID": "2700681018", "jobLocation": "New_York_NY", "jobTitle": "Solution Engineer -NY", "companyRating": "3.6", "companyInfo": {"Website": "www.similarweb.com", "Headquarters": "Tel Aviv-Yafo, Israel", "Size": "201 to 500 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " comScore, App Annie, Alexa Internet"}, "estimatedSalary": "119000", "jobDescription": "SimilarWebs market intelligence solutions provide customers with insights to help them understand, track and grow their digital market share. At SimilarWeb we bring together the industrys top talent to work together and create a product that transforms the way that businesses make decisions.So what is a Solution Engineer (SE)?Its a client-facing position with the opportunity to directly advise the biggest companies in North America on their digital strategy.SEs collaborate with multiple departments at SimilarWeb to help turn SimilarWeb data into actionable insights for our key customers.Key responsibilities include:Owning the value-based cycle of the sales process.Speaking to customers to understand pain-points and qualify needAnalysing data and turning into presentationsPresenting deck as well as live product demosSupporting the Account Executive in the sales process by generating insights and helping with the value-side of the proposalContributing to global strategyRunning initiatives (like trials, outreach programmes etc) in your marketUpon success, can be rolled out across Solution Engineering globallySupporting sales enablement by sharing learnings on key industries/use-cases with Account ExecutivesThis is a full time position reporting the Director of Sales, based in NY.What will I bring to the team?2+ years of sale/pre-sales experienceDigital marketing experience turning marketing data into insight (agency is a plus)Highly skilled in ExcelExperience producing high quality client-facing materialsAnalytical mindset with the ability to quickly digest a problem and identify a solutionExcellent problem solving and critical thinking skillsExperience speaking to large organisations directlyWhy choose SimilarWeb?Impact: We are changing the way decisions are made and youll be a core part of that movement. We provide insights that help businesses understand the digital world, their market and their competition. With our digital market intelligence businesses can put their own data into context and make real data-driven decisions.Talent: We only the most talented ambitious professionals who are eager to work hard, take chances and share ideas. Our passion, enthusiasm and drive for success are why we win together.Opportunity: We are the perfect place to grow. SimilarWeb has been named one of Business Insiders Top 50 Enterprise Startups to bet your career on."}