{"jobID": "2829300019", "jobLocation": "New_York_NY", "jobTitle": "Director, Real World Data & Analytics Client Partner Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.pfizer.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1849", "Type": " Company - Public (PFE) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "*ROLE SUMMARY** Pfizer is looking for a Director, Real World Data & Analytics (RWDnA) Client Partners Data Analyst to join our team in the Patient & Health Impact Centers of Excellence. The RWDnA function is dedicated to the acquisition and rapid analysis of RWD to address the needs of internal and external stakeholders in support of in-line and development compounds across Pfizer. The RWDnA Data Analyst will work cross-functionally and with external partners to support and enhance value generation for Pfizer assets using RWD and advanced analytics. Candidates looking for diverse opportunities to develop their skills and grow their career in a climate of innovation and collaboration will find this role exciting and challenging. *ROLE RESPONSIBILITIES** ? Work with RWDnA Data Strategists to plan lifecycle real world evidence generation plans  ? Lead execution of RWD analyses with appropriate internal and partner analytic resources and tools to address evidence and insight needs across Pfizer portfolio.  ? Support development of fit-for-purpose solutions to promote the use of RWD for insight generation and decision-making.  ? Serve as subject matter expert on real world datasources and novel analytical methods.  ? Support shared learnings, advancement of cutting edge methods, and proactively identifies opportunities for optimal use of data and tools across the organization.  ? Provide mentorship to more junior colleagues, research assistants, interns.  ? Understand standard operating procedures, compliance laws, policies and processes and ensure approaches are in full compliance with all legal requirements. *QUALIFICATIONS** ? Doctoral (PhD, DrPH, PharmD, MD, or ScD) or Master's (MPH, MSc, MA) degree in Health Economics, Public Health/Policy, Epidemiology, Health Services Research, Data Science, Predictive Analytics, or a related discipline preferred  ? 5-7 years of relevant experience, including 3 or more years of pharmaceutical industry experience preferred.  ?Experience working with longitudinal RWD assets (e.g., claims, electronic health records, and/or surveys).  ? Experience in the conduct of research, development of product strategies and supporting use of data by internal cross-functional teams and stakeholders.  ? Customer-facing or consulting experience is a plus.  ? Experience in using statistical software (e.g., R, SAS, Python, SPSS, and/or Stata), database query (SQL) or visualization tools (e.g., Tableau) preferred.  ? Peer-reviewed publication track record is a plus.  ? Deep understanding of the healthcare environment and different health systems, payer provider structures.  ? Collaborative approach to problem-solving.  Excellent written and oral communication skills. *NON-STANDARD WORK SCHEDULE, TRAVEL OR ENVIRONMENT REQUIREMENTS** + Travel 15% *EEO & Employment Eligibility** Pfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer. *Sunshine Act** Pfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider's name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative. *Other Job Details:** + Eligible for Relocation Package  Pfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates."}