{"jobID": "2777015629", "jobLocation": "Los_Angeles_CA", "jobTitle": "Sr Principal Data Scientist - VDMS", "companyRating": "3.1", "companyInfo": {"Website": "www.oath.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "152000", "jobDescription": " Verizon Digital Media Services brings together world-class technology to prepare, deliver and display content – so users can watch and enjoy on their terms. The purpose of our platform is simple. It delivers next-generation digital experiences for today’s demanding users, whether it be their favorite TV shows, catching up with friends via social media or shopping for the latest gadgets. Built on top of one of the world’s largest networks, our platform easily handles your users’ appetite for instant, secure and always-on media, anytime, anywhere.The Traffic Management team provides key functions to the Network, Systems, and Application engineering teams. The traffic management team is responsible for: Identifying customer traffic profiles for high traffic eventsCreating custom routing profiles based upon collected analyticsInterface with customers and sales professionals for large capacity eventsDevelop and use internal tools to manage and delivery customer eventsAnalysis of customer events through the use of big data platformsDrive automation from live and archived data analysis Minimum Qualifications: R, SQL, Pandas, NumPy or related experience with data wranglingRevision control systems (GIT, SVN, etc)Customer facing role for 2 years2 or more years providing insights to technical problems with dataDegree in Computer Science of related experienceClear understanding of HTTP and/or DNS protocolsAbility to work in a collaborative environment Preferred Qualifications: 3-5 years of customer facing representationDemonstrated experience with creating KPIs and dashboards for executive and customer reviewExpert in SQL, R, Pandas or related data science tooling The Attitude Highly motivated, self-driven, and ambitious individual to drive sales and revenue for the companyPossess excellent communication skills - written, verbal, presentation and interpersonalResponsible, self-directed, forward thinker who knows what needs to be done and operates with urgency, focus, discipline and minimal supervision.Highly organized and able to multi-task in an extremely fast paced, energetic, entrepreneurial environment Oath is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on, age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Oath is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. Please let us know if you need a reasonable accommodation to apply for a job or participate in the application process.  Currently work for Oath? Please apply on our internal career site. ​"}