{"jobID": "2737531241", "jobLocation": "New_York_NY", "jobTitle": "Digital Account Executive", "companyRating": null, "companyInfo": {"Website": "www.6smarketing.com", "Headquarters": "Vancouver, Canada", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Mediative, 360i, Search Engine People"}, "estimatedSalary": null, "jobDescription": "What We're Looking For Who’s our ideal candidate? You’ve been working in business development for a digital marketing agency, but want a chance to sink your teeth into something fun and fresh. Your mandate will be to grow the 6S Marketing footprint in Toronto through hunting, relationship building, and providing digital solutions to our clients.  The Account Executive is backed by a team of talented and passionate Account Managers and Strategists. We’re a nimble collective of best-in-class specialists and marketing enthusiasts. Big agency credibility, without the big agency overhead. Our Toronto team has doubled in size this past year, and we’re looking for someone who thrives in a high growth environment and has a deep passion for bringing on new business. Our office is located at Adelaide and Peter, in the heart of agency central. We offer a competitive compensation package with benefits, as well as things that are hard to put a price tag on like our culture. We encourage you to check us out on Glassdoor, Facebook, and Instagram to learn more. What It's Like To Work With Us 6S Marketing is a ROI-driven digital marketing agency specializing in paid media optimization, media buying, shopping campaigns, paid social, and more. We bring brands to life with extraordinary ideas that create emotional connections, fuel online conversations, and deliver measurable business results. It’s all about embracing our clients’ vision — and our top creative minds make it happen, with a boutique digital agency approach.  Since 2000, 6S has worked with the world's biggest brands, as well as some of the most niche. Our independent agency has built a roster of top tier clients including Mountain Equipment Co-op, Pirelli Tires, Cirque du Soleil, Expedia Cruiseshipcenters, Herschel Supply, Canada Games Council, KLM Airlines, HSBC, and more. We serve clients in technology, eCommerce, professional services, leisure and tourism, financial services, healthcare, higher education, and not-for-profit sectors. What You'll Get To DoLead progression and development of new business accounts in Eastern CanadaMaintain and foster existing accounts to drive renewals, up-sells and new opportunitiesMeet and exceed all revenue goalsInteract directly and with all levels of agency decision-makers and coordinatorsPrepare and deliver sales presentations to prospective clientsRespond to RFPs and deliver smart, comprehensive, and strategic proposalsMaintain client records and communication activity in SalesforceStay in tune with digital industry developmentsRepresent the company at social and networking functionsMore About What We're Looking For The candidate must be confident and demonstrate excellent interpersonal and presentation skills. All communication and sales activities will be recorded and managed through Salesforce. As such, CRM experience is an asset. In addition: Degree or diploma in marketing-related field preferred but not essentialMust be able to use Google Docs, Sheets and PowerPointAt least three years of experience selling solutions-based services related to digital marketingIn-depth knowledge and passion for digital marketing / advertising services, and experience/knowledge of how to sell them Thanks for taking the time to check out this opportunity! Unfortunately, due to the number of applications we receive we are not able to contact everyone who applies. However, all applications are all stored in our talent database and will be considered for future opportunities."}