{"jobID": "2827238621", "jobLocation": "San_Jose_CA", "jobTitle": "Lab Clinical R&D; Scientist - Genetics Lab", "companyRating": null, "companyInfo": {"Website": "www.kaiserpermanente.org", "Headquarters": "Oakland, CA", "Size": "10000+ employees", "Founded": " 1945", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " HCA Healthcare, Dignity Health, Sutter Health"}, "estimatedSalary": null, "jobDescription": " Researches new and/or improves test development methodologies. Essential Functions: Researches new and/or improves test development methodologies by: performing experimental testing procedures; validating effectiveness/feasibility for implementation; costing of procedure(s); preparing and submitting recommendation(s) for change to laboratory management; training staff.  Assesses current and new process flow(s) and recommends improvements.  Consults internally and externally with clinicians and providers on technical issues, patient care management, and test interpretation/selection.  Provides laboratory management with high level reports and information for more global communication.  Serves as in-house expert in area of specialty.  Keeps current with technological developments through literature search, seminars and other modes of communication.  Disseminates to technical staff, medical director and manager appropriate information that would enhance medical care for KPMCP members.  Participates in the determination of cost per test analysis.  Projects costs and recommends reductions to support decreasing the overall cost structure of the organization.  Supports and coordinates Regional Laboratory, inter-facility and inter-regional projects.  Develops and implements projects that span a wide scope of clinical laboratory disciplines.  Coordinates with technical vendor and laboratory information system to support the implementation and interface of new test equipment and associated database changes.  Authors and communicates technical procedures, bulletins, scientific presentations and publications based on research findings to scientific community and internal KP clinicians. Basic Qualifications: Experience  Minimum three (3) years of post-graduate clinical laboratory experience required. Education Master's degree in clinical laboratory science sub discipline with course work in the appropriate sciences, including mathematics, physics, and statistics.  License, Certification, Registration  Valid current California Clinical Laboratory Scientist or limited specialty license required. Additional Requirements: Distinguished track record required.  Must be able to work in a Labor/Management Partnership environment. Preferred Qualifications: Ph.D. preferred. Additional Preferred Qualifications: MD or PhD in biological and/or biomedical sciences.  3-5 years postdoctoral training in genetics and molecular biology is preferred.  Experience with design, development and implementation of next-generation sequencing (NGS)-based tests in cancer genomics is highly desirable.  Experience in cytogenetic techniques, array CGH and SNP array are highly advantageous.  Successful applicant must be able to work independently under minimal supervision, and have excellent organizational and communication skills.  Eligible for California clinical laboratory scientist or limited specialist license is recommended. "}