{"jobID": "2781670946", "jobLocation": "Boston_MA", "jobTitle": "Business Development Manager – MD", "companyRating": null, "companyInfo": {"Website": "www.bluewavesolar.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Company Overview: BlueWave Solar is a B Corporation on a mission to revolutionize energy with simple, powerful solar solutions.We have a rapidly growing team of experts intensely focused on increasing our solar loan footprint, refining our Solar Management Platform software, developing and managing community solar projects, and forging efficient capital partnerships that enable consumers to choose local, low-cost solar power. We are constantly innovating to keep pace with the evolving energy industry, and that spirit of innovation is what drives our company’s dynamic culture. We are an energetic, driven and welcoming group of people that is looking for our “people person” to help us build the right team to support us in meeting our goals. When you join the BlueWave community, you join a team doing all that we can to be transparent, sustainable and high-integrity. We don’t just want to do business, we want to do good business. Because of our commitment to B Corp Certification we hold ourselves to high standards when it comes to our impact on the environment, our employees, our communities, and our customers.Position Description:BlueWave has an immediate opening for a Business Development Manager (BDM) for Maryland reporting to the Senior Director for Business Development – Consumer Solar Finance. The BDM for Maryland will build relationships within existing and new solar companies that meet stringent QC standards across their organizations and also with sales consultants that are presenting BlueWave’s financing platform to homeowners looking for financing. We Seek a highly motivated and qualified candidate to engage, drive sales, support, and manage partnerships with residential solar providers in the region to promote BlueWave's residential solar loan, sales tools, and other offerings. We are changing the game for residential solar by providing financing, tools, and support that help local residential solar players provide the best value for residents they serve, and the regional sales manager is key component of that impact. Is this you?Duties Responsibilities:Drive loan sales and grow volume for BlueWave through new and existing partners within MD where applicable in the region for BlueWave’s residential solar loan platform, and deliver on other offerings for residential solar partners, achieving business line performance goals for the region;Grow new partner network of solar PV installers who will utilize solar loan platform for providing financing to customers, and grow share of volume served by BlueWave among existing partners;Train and support installer partners on how to use the solar loan platform and other sales tools, and how to effectively promote BlueWave’s loan products;Manage existing installer partner relationships to increase utilization of solar loan platform, identify partner needs, and guide the deployment and sales of BlueWave offerings to solar installers;Act as liaison between installer partners and sales operations team to ensure responsive customer service;Monitor and ensure partner performance and quality of service – responsible for QC of partner performance relevant to BlueWave standards of service and quality;Support loan customers in region in coordination with BlueWave;Travel as needed within the region, and to industry events, to establish and support partner and borrower relationships;Position will report to the Senior Director of Business Development for BlueWave.Required Qualifications/Skills/Education:Bachelor of Science and/or Master’s Degree in related field or MBA preferred.Proven sales experience and success, and ability to engage partners in how BlueWave’s offerings can be applied or refined to make partners more successful.Previous residential solar industry sales experience and partner management experience preferred."}