{"jobID": "2756567829", "jobLocation": "Santa_Monica_CA", "jobTitle": "Product Analyst Intern", "companyRating": "4.0", "companyInfo": {"Website": "www.gumgum.com", "Headquarters": "Santa Monica, CA", "Size": "201 to 500 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Vibrant Media"}, "estimatedSalary": "48000", "jobDescription": "Description Through patented computer vision technology, GumGum Sports provides measurement of sports sponsorships to it’s clients. Our technology reduces turnaround times and produces more accurate and consistent valuations across all channels. We provide a holistic view of media valuation, unlocking the value of millions of videos and images being shared by thousands of fans.  GumGum is seeking a Product Analyst Intern who will be an exceptional addition to our team. Our ideal team member is someone who loves analytical problems and is responsible for developing key insights for GumGum Sports. Becoming fluent in the data around GumGum’s sports business, this person will help inform decisions about our products, improving our internal processes and client experiences. This is a full-time summer internship that will report into the GumGum Sports Product Director. ResponsibilitiesWork with GumGum Sports product team to determine what data points and KPI’s to analyze for our businessHelp define the reporting structure for tracking operational efficiency and client engagement with our productsLeverage data to understand the product, identify opportunities, and work with product team to improve operational efficiency and client engagementLearn about the sports sponsorships business and provide actionable recommendations based on data analysisRequirementsExperience with data modeling and SQLAdvanced Microsoft Excel skills (knowledge of formulas and use of pivot tables)Strong analytical, problem solving, and quantitative skills with data-driven approach to decision-makingAbility to work independently given a set of objectivesHighly organized individual with the ability to prioritize multiple tasks & meet deadlinesExcellent communicatorInterest in sports is a plusPerksLocated in hotbed of tech startups blocks from the beach!Great co-workers, monthly happy-hours"}