{"jobID": "1871163893", "jobLocation": "Cupertino_CA", "jobTitle": "Sales Program Management, Cupertino CA - Contract", "companyRating": "3.3", "companyInfo": {"Website": "www.huawei.com", "Headquarters": "Shenzhen, China", "Size": "10000+ employees", "Founded": " 1987", "Type": " Company - Private", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " Ericsson-Worldwide, Cisco Systems, Apple"}, "estimatedSalary": "119000", "jobDescription": "Huawei is a leading global information and communications technology (ICT) solutions provider. Through our dedication to customer-centric innovation and strong partnerships, we have established end-to-end advantages in telecom networks, devices and cloud computing. We are committed to creating maximum value for telecom operators, enterprises and consumers by providing competitive solutions and services. Our products and solutions have been deployed in over 170 countries, serving more than one third of the world’s population. Huawei has over 150,000 employees, approximately 70,000 of which are engaged in Research & development. Huawei operates a global network of 14 regional headquarters, 16 R&D; Centers, 28 Innovation Centers jointly operated with customers, and 45 Training Centers. Huawei is leading the way by rethinking the future. From devices to telecom infrastructure to cloud computing and convergence solutions, we are rethinking every link in the chain with ICT based innovation to deliver a better future...faster. Sales Program Management, Cupertino CA - Contract Location: Cupertino, CA (Enterprise) Req #: 7195 # of Openings: 1 DescriptionGENERAL SUMMARY - CONTRACTLOCATION: Cupertino, CA Supports the sales & distribution organization in the market and at headquarters through the development of highly-effective processes, sales success cases, and reporting protocols to ensure timely and accurate flow of data through the local sales organization. The Sales Support Coordinator collaborates with sales and marketing staff to support key sales programs, processes, and incentives to enhance and maintain revenue. ESSENTIAL DUTIES AND RESPONSIBILITIES:Drive compliance with relevant Sales processes, independently process routine day-to-day business issues (such as project data integration, regulatory oversight of the sales projects, MO process execution, etc.) involved in executing sales projects.Based on the analysis of market situations, patterns and opportunities offer early warning of emerging issuesPlan, implement, and control contact progress to achieve sales and profit objectives.Responsible for the creation & maintenance of content such as case studies and value propositions. Work with in-market sales teams and support organizations to deliver the proper content and identify process improvements.Support marketing and sales with sales programs and incentives; coordinate sales training initiatives.Performs market research and competitive analysis to translate this information into useful insight regarding local market initiatives and objectives.Facilitate and provide guidance and support during the implementation of sales optimization initiatives across markets. Support the markets with the implementation of tools/systems/programs to optimize the performance of our various distribution channels.Maintains broad expertise in best practices for marketing and communications, internal staff communications, and email newsletters.Manages performance, and prepares monthly reports and analysis that will serve as benchmarks to create and deliver the proper enhancements and changes.Drive local sales team compliance with standard processes and full implementation of sales tools.JOB QUALIFICATIONS:Education and/or Certifications/Licensures: Minimum: Bachelor's degree in communications, computer, business or equivalent field or experience and an understanding of technology-based applications and marketing communications or a related area. Preferred:Relevant Work Experience: Minimum: 3 years of experience in field sales support or administration role.  Preferred: 5+ years of experience in field sales support (telecomm industry a plus). Skills (Technical or General): Minimum: Familiar with a variety of operation, practices, and procedures. Must have enough working knowledge of how mail communications technologies work to effectively manage requirements and execution with company technical staff. Strong analytical skills. Excellent writing, verbal communication and editing skills are required. Must be capable of assessing, learning and implementing new applications. Strong oral and presentation skills, capable of communicating and working effectively with cross functional teams such as Marketing, Sales, Legal and in-markets. Experience supporting sales programs and incentives. Great interpersonal skills and the ability to work well in a dynamic and fluid environment. Intermediate Microsoft Office applications knowledge, business analysis. Advanced communication, leadership and interpersonal skills; advanced organizational ability.Huawei Inc. is proud to be an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Why work for us?In 2015, Huawei's revenue reached CNY395 billion (US$60.8 billion based on the year-end exchange rate), an increase of 37% (YOY)We invest in engineering and innovation - 70,000+ of our 150,000+ global employees work in R&D;Globally ranked #1 for International Patent SubmissionsWe continually invest heavily in global community involvement programsWe support green energy - Lowered CO2 emissions by 13,000 tons via Huawei’s green packaging solutionsEngaged in over 100 research projects with 50+ Universities in the United States Are you a returning applicant?Previous Applicants:Email:Password: If you do not remember your password click here. Back to Search Results New SearchCopyright © Huawei Technologies Co., Ltd. 1998-2017. All rights reserved."}