{"jobID": "2645532866", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Scientist, Monetization", "companyRating": "2.6", "companyInfo": {"Website": "www.snap.com/en-us", "Headquarters": "Venice, CA", "Size": "1001 to 5000 employees", "Founded": " 2011", "Type": " Company - Public (SNAP) ", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Facebook, Twitter, WhatsApp"}, "estimatedSalary": "136000", "jobDescription": " Snap Inc. is a camera company. We believe that reinventing the camera represents our greatest opportunity to improve the way people live and communicate. Our products empower people to express themselves, live in the moment, learn about the world, and have fun together.  Were looking for a Data Scientist to join Snap Inc! Working closely with the Engineering, Product Design, and Product Management teams, you will create inventive, data-based approaches to solving difficult business problems. What youll do:Partner with the Product and Engineering teams, and apply your expertise in quantitative analysis, data mining, and machine learning to create and scale insightsCreate and test hypothesesBuild models and machine learning pipelines to understand how Snapchatters interact with ads on SnapchatHelp the Business and Engineering teams make decisions based on dataWhat we're looking for:PhD in Statistics (or other doctoral degree with a strong emphasis on statistical methodology (economics, political science, operations research, etc.). or MS in statistics with 4+ years experienceThorough understanding of statistics and machine learningExperience with causal inference techniques and experimental designExperience in ads measurement or ad tech preferredAn interest in translating technical results for cross-functional stakeholders across the organizationFluency in SQL or other big data querying languagesExperience with programming languages such as PythonExperience with analytical packages such as SciPy or RAbility to communicate analyses in a clear and effective manner to senior-level audiencesAt Snap, we believe that having a team of diverse backgrounds and voices working together will enable us to create innovative products that improve the way people live and communicate. Snap is proud to be an equal opportunity employer, and committed to providing employment opportunities regardless of race, religious creed, color, national origin, ancestry, physical disability, mental disability, medical condition, genetic information, marital status, sex, gender, gender identity, gender expression, pregnancy, childbirth and breastfeeding, age, sexual orientation, military or veteran status, or any other protected classification, in accordance with applicable federal, state, and local laws. If you have a disability or special need that requires accommodation, please dont be shy and contact us ataccommodations-ext@snap.com."}