{"jobID": "2780764476", "jobLocation": "Wilmington_MA", "jobTitle": "Supply Chain Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.cutispharma.com", "Headquarters": "Wilmington, MA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " For nearly 20 years, CutisPharma has been a market leader in providing oral liquid formulations of commonly used drugs to patients unable to take tablets or capsules. CutisPharmas drugs have been used in over 5 million patients, including populations such as children and the elderly, who have greatly benefited from a safe, consistent, and more palatable alternative to a traditionally-compounded therapy.  Building on our solid foundation in the oral liquid market, CutisPharma, Inc. has now embarked on the most significant expansion in the Companys 20-year history, bringing operations and R&D; functions in-house at our two state-of-the-art manufacturing and research facilities, as well as significantly increasing our portfolio of drugs in development for FDA approval. We are now building a world-class team for our newest product launch.  The Supply Chain Data Analyst will report into the Operations Department, supporting both Supply Chain and Warehouse functions. The analyst will primarily be responsible for executing supply chain transactions and data management in key operational systems. He/She will ensure the transactions are executed accurately and timely to maintain the operational process flow. He/She will ensure master data integrity by developing or improving upon the processes that supports data quality. The analyst will collaborate with key stakeholders across the company, specifically in Operations, Finance, and Quality to ensure the transactional and data management process is being followed.  PRINCIPLE DUTIES AND RESPONSIBILITIES  Ensure supply chain transactions are executed timely and accurately in all key operational systems. Ensures master data integrity in key systems as well as maintaining the processes to support data quality. Supports development and documentation of data management processes with other functional data owners to support ongoing maintenance and data integrity. Identifies areas for transactional and data quality improvements and helps to resolve problems through the control and development of a data management process Provides assistance in resolving transactional and data quality problems through collaboration with subject matter experts (SMEs) and system owners. Manages, analyzes, and resolves data issues and manages revisions needed to best meet both internal and external stakeholder requirements Work closely with the business/IT to ensure alignment of master data rules and the operations of the application meet all requirements QUALIFICATIONS  Bachelor's degree or equivalent combination of education and experience Minimum 3-5 years in supply chain or related field Experience working in enterprise systems and with company hardware and software Capability to solve routine process problems Ability to work independently or in a group setting Ability to communicate effectively orally and in writing Ability to work in a team environment We recognize hard work and dedication with benefits offerings that address individual needs. Our comprehensive package of benefits for eligible employees includes the following: Competitive compensation package and bonus incentives for excellent performanceCompetitive group benefit program, including medical, dental, life, disability and vision insuranceCompany-paid basic life/AD&D;, short- and long-term disability insurancesPaid time-off program consisting of vacation, sick, holidays, and company-designated shutdownTax-advantaged savings plan (401(k) with employer match)For a list of benefits, please see our benefits listing on our careers page at www.cutispharma.comQualified candidates should submit their resume and statement of interest via our Careers Page atwww.cutispharma.comNO PHONE CALLS PLEASECutisPharma, Inc. is an Equal Opportunity Employer NOTE: This job description is not intended to be all-inclusive. Employee may perform other related duties to meet the ongoing needs of the organization."}