{"jobID": "2803022820", "jobLocation": "San_Jose_CA", "jobTitle": "Food Service Shift Leader", "companyRating": null, "companyInfo": {"Website": "www.modpizza.com", "Headquarters": "Bellevue, WA", "Size": "5001 to 10000 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Restaurants, Bars & Food Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " MOD was founded on the idea that if we take care of our people and our communities, the business will largely take care of itself. We are focused on creating a workplace where individual spirits are celebrated, and our teams are empowered to go above and beyond to take care of our customers.  With more than 300 locations across 20 states and the United Kingdom, MOD is committed to creating a positive social impact in the communities both domestically and internationally, creating not only a cool place to eat, but an inspired place to work.  Location: 5130 Cherry Ave Suite 40 San Jose  MOD, the original superfast pizza experience was founded on the idea that if we take care of our people in everything that we do, our people will take care of our guests and the business will take care of itself! We call it Spreading MODness! This is built right into our Core Values. We are a Team… We are the MOD Squad! We accept everyone for who they are because we are at our best when we are ourselves - so be yourself and be your best! Become the next member of the MOD Squad. Since our launch in 2008, we have opened 200+ stores Domestically and Internationally. That means lots of opportunities to let your full potential really shine.  What you will do: Leadership and problem-solving abilitiesSupervise front and back of the house employees during shiftKeep things upbeat and friendlyThrive in a team environment where you will collaborate with othersMake sure customer feel welcomeBecome a MOD menu expertPrepare and restock food productsManage cash drawersHelp maintain a spotless shopFollow all health, safety and sanitation guidelines Experience and Skills  What you will need: A genuine passion for peopleReliable transportationMust be at least 18 years old Bonus points if you have: Food/service industry experienceCash-handling skillsProblem-solving abilities Physical Requirements  As a member of our MOD Squad, you will be working in a kitchen environment, rotating between front and back of house. This requires walking, bending, twisting, reaching, stooping, kneeling, crouching, pushing and pulling to handle or move objects weighing up to 50 pounds. You will also be asked to operate hand-held appliances and simple kitchen equipment (industrial can opener, dough press, industrial dishwasher, etc.). Depending on the location, you may need to go up and down stairs. The ability to communicate and exchange information with coworkers and others is also required.  Working Conditions High noise levels due to operations, customers and overhead music (including, but not limited to, rock, punk and alternative)May be indoor or outdoor setting depending on store (varied weather conditions are expected)Will work near moving or mechanical partsVarying schedule to include evenings, holidays and extended hours as business dictates WE MAKE PIZZA SO WE CAN SERVE PEOPLE  Click here to see a day in the life at MOD- https://vimeo.com/97852904  This job description is not intended to be all-inclusive. As a member of our MOD Squad, you may be asked to perform additional related duties to meet ongoing needs.  Want to help us spread MODness? Apply today!  One of MOD’s core strengths is the diversity of our MOD Squaders, and we are dedicated to upholding this diversity. We work hard to make MOD a place that is welcoming to all people. In this regard, MOD is an equal opportunity employer and is committed to equal opportunity for all employees and applicants. MOD recruits, hires, trains, promotes, compensates, and administers all personnel actions without regard to race, color, religion, sex, sex stereotyping, pregnancy (which includes pregnancy, childbirth, and medical conditions related to pregnancy, childbirth, or breastfeeding), gender, gender identity, gender expression, national origin, age, mental or physical disability, ancestry, medical condition, marital status, military or veteran status, citizenship status, sexual orientation, genetic information, or any other status protected by applicable law."}