{"jobID": "2807377805", "jobLocation": "Boston_MA", "jobTitle": "Climate Change and Shark Research Intern", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Position Summary: The Marine Ecology and Fisheries Science research program is seeking an intern to assist on a laboratory-based project investigating the effect of climate change on development and performance of coral cat and epaulette sharks.  The intern will assist the graduate student and husbandry staff as needed on the project. This work will aim to determine how increased temperatures predicted over the next century will affect the growth, development, and physiological performance of both coral cat and epaulette sharks. Both species will be raised within the egg case at differing water temperatures. During this time, various growth measurements and respirometry will be conducted to assess survival and physiological performance. After hatching, the growth, survival, and metabolic capacity of the neonate sharks will continue to be assessed for several months. The intern can expect to be involved in all aspects of the project, including but not limited to assisting with husbandry, maintenance of the experimental setup, and data collection. This work is projected to begin in June 2017 and last at least 18 months, and will be conducted at NEAq's Quincy facility. Duties/Responsibilities include, but are not limited to:Assist with husbandry of egg cases and neonate sharksAssist with data collection and entryAssist with set up and execution of experimentsAssist with the mining, exploring and analyzing of data setsAssist with the organization, maintenance and ordering of suppliesPerform relevant literature and background searchesSkills/Qualifications:Requires minimum of 3 years of completed undergraduate study, completion of undergraduate degree preferredInterest in wildlife veterinary/animal health, fisheries biology and/or applied fish physiologyStrong academic background in biology, marine biology, fisheries or vertebrate zoology/physiology required; previous statistical coursework preferredMarine-oriented research experience preferredExcellent interpersonal, organizational and communication skillsMust be highly self-motivated with the ability to work independently and as part of a teamExperience with basic Microsoft Office platforms, especially Excel, required. Experience with statistical and/or other more advanced software desirableRequired Events:Orientation (takes place prior to first training or shift with department)Meet and GreetTwo Professional Development LunchesIntern CelebrationExit Interview0Job Posted by ApplicantPro"}