{"jobID": "2796317402", "jobLocation": "Novato_CA", "jobTitle": "Front Office Coordinator", "companyRating": null, "companyInfo": {"Website": "www.primamedgroup.com", "Headquarters": "Novato, CA", "Size": "201 to 500 employees", "Founded": " 2010", "Type": " Nonprofit Organization", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Front Office Coordinator Job Number PMF2018-70 Hours Per Two-Week Period 80 Shift Hours  8 Hour ShiftApply NowABOUT PRIMA MEDICAL FOUNDATION: Prima Medical Foundation (an affiliate of Marin General Hospital) is looking for healthcare professionals to join our positive, high-energy team to delivering world-class patient care across Marin County! With a network of clinics across many different medical specialties throughout Marin and Southern Sonoma County, Prima functions as an extended family of healthcare advocates who take pride in knowing that we aren't just making a living; we're making a positive impact on the health of our patients and their families. Come and join us in touching and transforming lives every day! COMPENSATION: We have an excellent benefits package, such as medical/vision/dental insurance, generous PTO and paid holiday, 401(k) with company match, and more!  Prima Medical Foundation is looking for a full-time, regular Front Office Coordinator for our busy pediatric office in Mill Valley.RESPONSIBILITIES: Direct Patient Care: Answer telephones in a cheerful manner.Schedule appointments.Take messages for patients using electronic medical records.Verify and update patient demographic information.Register new patients.Address patient requests and inquires.Resolve patient concerns.Process insurance issues and assist patients in understanding insurance plans.Return calls as necessaryPatient referralsGreet and check in/out patients, as needed.Collect co-payments.Update registration and insurance information for existing patients. QUALIFICATIONS:High school diploma or General Education Degree (GED) required.Desire at least one year of related medical office experience.Experience with, and proficiency in, electronic medical records: Use of Allscripts and Centricity software a plus.Computer proficiency: Microsoft Office.Bi-lingual in Spanish desiredRequires an ability to read, write, do arithmetic, and apply reasoning skills equal to that of the average high school graduate. Must be able to demonstrate accurate data entry and ability to work unsupervised.External hires must pass a background check and medical screen. Qualified applicants with arrest records and/or conviction records will be considered for employment in a manner consistent with federal, state and local laws. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sexual orientation, gender identity, protected veteran status or disability status and any other classifications protected by federal, state & local laws."}