{"jobID": "2807147618", "jobLocation": "Woburn_MA", "jobTitle": "Data Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.epsilon.com", "Headquarters": "Irving, TX", "Size": "5001 to 10000 employees", "Founded": " 1969", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Merkle"}, "estimatedSalary": "139000", "jobDescription": " As a Data Scientist in our Analytic Technology Practice, you will be responsible for researching and building data automation and machine learning processes to expand Epsilon's analytic capabilities. You will work on real-world marketing problems as part of our highly collaborative Analytic Consulting Group to develop solutions that will directly impact our business. RESPONSIBILITIESDevelop an understanding of Epsilon's current analytic capabilities and proprietary datasetsUse your machine learning expertise to research and recommend the best analytic approaches to solving the most difficult marketing problems facing our clientsIdentify new analytic capabilities and compare/contrast with existing methodsDesign, implement, and validate your analytic pipelines in Apache Spark, Apache HDFS, Apache Kafka, AWS S3, using Python / R on a state-of-the-art clusterDevelop analytic requirements and collaborate with Engineering teams to integrate analytic solutions into Epsilon's product platformsREQUIREMENTSA Ph.D., (or Master's degree plus at least 3 years' relevant experience), in Computer Science, Statistics, Electrical Engineering, Mathematics, Economics, Physics, or a related scientific disciplineResearch experience and coursework in Machine LearningMastery of the following programming languages: Python, R, SQLExperience manipulating large data sets, both structured&unstructured;Experience with distributed computing, such as Hadoop, Spark, or related technologiesStrong understanding of statistics and modeling techniquesNatural curiosity for exploring data and finding the untold storyDesire to work in a highly collaborative environmentAbility to simplify complexity, communicate clearly and teach othersManage multiple data science projects concurrentlADDITIONAL USEFUL BUT NOT REQUIRED SKILLSFamiliarity with SAS, Scala or Java programming languagesExperience in marketing analytics, especially digital analyticsFamiliarity with Scrum development methodologyExperience with data visualization Conditions of Employment  All job offers are contingent upon successful completion of certain background checks which unless prohibited by applicable law may include criminal history checks, employment verification, education verification, drug screens, credit checks, DMV checks (for driving positions only) and fingerprinting.  Great People, Deserve Great Benefits  We know that we have some of the brightest and most talented associates in the world, and we believe in rewarding them accordingly. If you work here, expect competitive pay, comprehensive health coverage, and endless opportunities to advance your career. From tuition reimbursement to scholarship programs to employee stock purchase plans and 401(k)s, we offer associates a variety of benefits that work as hard for them as they work for us.  About Epsilon  Epsilon® is an all-encompassing global marketing innovator. We provide unrivaled data intelligence and customer insights, world-class technology including loyalty, email and CRM platforms and data-driven creative, activation and execution. Epsilon's digital media arm, Conversant, is a leader in personalized digital advertising and insights through its proprietary technology and trove of consumer marketing data, delivering digital marketing with unprecedented scale, accuracy and reach through personalized media programs and through CJ Affiliate, one of the world's largest affiliate marketing networks. Together, we bring personalized marketing to consumers across offline and online channels, at moments of interest, that help drive business growth for brands. Recognized by Ad Age as the #1 World's Largest CRM/Direct Marketing Network, #1 Largest U.S. Agency from All Disciplines and #1 Largest U.S. Mobile Marketing Agency, Epsilon employs over 8,000 associates in 70 offices worldwide. Epsilon is an Alliance Data company. For more information, visit www.epsilon.com and follow us on Twitter @EpsilonMktg.  Alliance Data provides equal employment opportunities without regard to race, color, religion, gender, age, national origin, disability, sexual orientation, gender identity, veteran status or any other characteristic protected by law. For San Francisco Bay Area: Alliance Data will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of San Francisco Police Code Sections 4901 - 4919, commonly referred to as the San Francisco Fair Chance Ordinance  Alliance Data is an Equal Opportunity Employer.  Alliance Data will provide accommodations to applicants needing accommodations to complete the application process.  Any applicant offered employment will be required to establish that they are legally authorized to work in the United States for Alliance Data.  Alliance Data participates in E-Verify.  Alliance Data will consider for employment qualified applicants with criminal and credit histories in a manner consistent with the requirements of all applicable laws, including the City of Los Angeles' Fair Chance Initiative for Hiring Ordinance. #LI-BW1"}