{"jobID": "2795649802", "jobLocation": "San_Rafael_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.roseit.com", "Headquarters": "Chesterfield, MO", "Size": "1001 to 5000 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Position Title: Data AnalystPosition Number: 286119Location: San Rafael, CADesired Skill Set:MS Office 2003, MS Word, Phone, Verbal Communication, MS ExcelPosition Description: **C2C and STEM-OPT are not available** *Only U.S. Citizens and those authorized to work in the U.S. can be considered as W2 candidates.** Location: San Rafael, CA 94903  Job: Export Compliance Analyst  Contract: 6 months + Description: Job Title: Export Compliance Analyst Principle Duties and Responsibilities: Work independently within the Access Delivery / Export and Trade Compliance team to insure the timely and accurate review of Customer Account information against client's Export Compliance database.  Work with a sense of urgency to resolve Export Compliance inquiries against open customer orders.  Assist the Access Delivery team in conducting research and further investigation into a given list of Customer Accounts. Investigating the company and industry scope, and their proposed usage of client's products and services.  The work will be primarily conducted over the internet with guidance given by the appointed supervisors, reporting directly to the Manager of Export and Trade Compliance.  The result and follow-up action shall be updated into the required database systems and records per the guidance given by the supervisors.  What a typical day in this role looks like:  Successful employees in this role effectively work in a time-sensitive manner with multiple software systems open at the same time.  An individual may work through a backlog of Export Compliance Alerts in our Oracle system; referencing customer data in our CRM system and independently researching the company or individual over the Internet.  Common tools used are Google, US Bureau of Industry and Security or Department of State articles or watch lists and other reference tools.  Individual would then update the status of the Alert appropriately.  Individuals may also review the Export Compliance Status of specific Customers to determine the if specific ( time sensitive) orders can be released to fulfillment – or not.  Individuals may escalate difficult case to the Manager of Export and Trade Compliance or client Legal contacts.  Individuals may also respond to work actions assigned through a Salesforce.com queue and respond to inquiries about an order's export compliance status to internal Client Services staff.  This individual spends nearly the entire day online and researching customers ( both companies and individuals ) and is tasked with insuring that client complies with all current regulations regarding to whom client may sell our high-technology products.  When appropriate, this individual must have the ability and confidence to say “no” to a sale which may violate US Export law. Fundamental Skills Required: The person should feel comfortable in using the Internet, various search engines, and be willing and able to learn new computer software and digital tools.  Customer focused, task oriented, emphasis on \"getting things done, now\".  Team player, able to work well with others both domestically and internationally  Must be a strong communicator with great attention to detail, an organized multi-tasker, and able to exercise sound judgment within the guidelines provided.  Proficiency in multiple languages preferred but not required. Additional weight will be given to applicants with Russian, Arabic or Mandarin Chinese language proficiency.  Solid PC /Mac computer skills. Working knowledge of standard Microsoft Office applications, such as Word, Excel, PowerPoint and Outlook. Send me a reminder to complete this applicationRose International is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender (expression or identity), national origin, arrest and conviction records, disability, veteran status or any other characteristic protected by law. Positions located in San Francisco and Los Angeles, California will be administered in accordance with their respective Fair Chance Ordinances.  Rose International has an official agreement (ID #132522), effective June 30, 2008, with the U.S. Department of Homeland Security, U.S. Citizenship and Immigration Services, Employment Verification Program (E-Verify).  (Posting required by OCGA 13/10-91.)"}