{"jobID": "2831226903", "jobLocation": "Boston_MA", "jobTitle": "Research Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.hbs.edu", "Headquarters": "Boston, MA", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " College / University", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": " Research Data Analyst  28-Jun-2018 Auto req ID46175BRJob Code RS0357 Statistician II Location USA - MA - Boston Business Title Research Data Analyst Sub-Unit-----------Salary Grade057Time Status Full-time Union 00 - Non Union, Exempt or Temporary Basic QualificationsAppropriate BA/BS is required along with 3+ years of experience in data analysis in a research environment.  Current experience in two or more of the following skills is required: applied use of scripting languages, to include Python, Perl, Ruby, or Julia; database environment tools to include MySQL, SQLlite, MariaDB; experience with visualization tools such as Tableau, R, D3, or similar tools; .applied use of statistics languages/programming packages, to include R, Stata, SPSS, or SAS;Additional QualificationsMaster's degree preferred.Ability and openness to learning new tools.​Experience in handling large datasets preferred.Familiarity with version control systems such as Git/GitHub preferredFamiliarity with cluster and cloud computing preferred.Database administration experience preferred.Strong analytic and technical skillsStrong written and oral communication skills; ability to communicate complex technical topics to lay audiences as well as knowledgeable individuals.Strong customer service orientation, initiative, and the ability to anticipate and plan for customer needs.Ability to work independently and collaboratively on a team.Ability to find, plan, and communicate creative solutions to challenges.Demonstrated ability to work with highly confidential/sensitive information.Capacity to handle multiple complex tasks simultaneously.Sound judgment, professionalism, diplomatic skills, comfort in interacting with prominent individuals, and grace under pressure are essential.Meticulous attention to detail and demonstrated ability to produce consistently high quality work product.Additional InformationCover Letter is required.  Follow us on Twitter @HBSJobs  Explore HBS Work Culture at http://www.hbs.edu/employment/ and learn about other Employment Opportunities.  Harvard Business School will not offer visa sponsorship for this opportunity.  Contact InformationDepartmentDRFDPre-Employment Screening Education, Identity Job Function Information Technology, Research, Technical Duties & ResponsibilitiesHarvard Business School, whose mission is to educate leaders who make a difference in the world, is seeking a research data analyst with a strong background in research data management and programming to join its Research Computing Services (RCS) group within the Division of Research and Faculty Development (DRFD).  The Division of Research and Faculty Development (DRFD) is the School’s largest administrative unit with approximately 270 full-time and part-time staff. The organization was formed in 2002 to fully integrate the activities underlying faculty support and development. HBS is unique among top business schools, perhaps in higher education more broadly, in having a unit like the DRFD – one that funds faculty research internally, provides centralized research services, and combines nearly all faculty-related administration and services under one umbrella. From the time a prospective faculty member is identified as a recruiting candidate, and whether a faculty member spends six months or their entire career at HBS, the DRFD team’s focus is to support the success of each individual and contribute to an environment where they can thrive and do their best work in service of the School’s mission.  RCS is a centralized service within the DRFD that supports faculty for all their research computing needs. These services include managing access to and support for the research computing infrastructure and research computing software as well as a full range of research computing services provided directly to faculty in conducting their research including data collection, acquisition, processing, and manipulation; statistical programming and methodological consulting; and data analysis, visualization and presentation of data. The portfolio of services contributes to the School’s ability to attract and retain faculty. Members of RCS team provide consultation services to faculty and other researchers and work on specific research projects for faculty members.  The ideal candidate has experience with multiple steps in the data life cycle, including data acquisition, data processing, data management, analysis, and visualization, preferably in a research environment; and brings technical programming expertise using research software packages. S/he will have a history of successful collaborations, particularly in a service delivery environment. Essential Duties and Responsibilities The Research Data Analyst is responsible for identifying and implementing technical solutions for meeting researcher data needs, both as an individual contributor and as part of a team. Exhibits a high level of independence, judgement, intellectual curiosity, and technical skills. The primary responsibilities of the Research Data Analyst include: Works directly with faculty on data projects. Tasks may include collecting (e.g., via web scraping or APIs), transferring, merging, managing, de-identifying, analyzing, or visualizing data.Serves the data needs of faculty and other researchers, identifying and applying computational and statistical tools, and advising and training researchers in the use of these tools.Ensures adherence to policies related to the use of data from external sources.Collaborates with other team members through knowledge sharing and promotion of best practices (e.g., code review, technology showcase).Learns new technologies and tools as needed.School/Unit Harvard Business School EEO Statement We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, gender identity, sexual orientation, pregnancy and pregnancy-related conditions, or any other characteristic protected by law. "}