{"jobID": "2826639587", "jobLocation": "Boston_MA", "jobTitle": "Data Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.tuftsmedicalcenter.org", "Headquarters": "Boston, MA", "Size": "1001 to 5000 employees", "Founded": " 1796", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "100", "jobDescription": " REQUESTS FOR PROPOSALDATA SCIENTIST (DSCA)COMPETITIVE INDEPENDENT CONTRACTOR OPPPORTUNITYA. Objective and Scope of EngagementTufts Medical Center (Tufts MC) and the Clinical and Translational Sciences Institute (CTSI) seek a Data Scientist (DSCA) for a new scientific software development initiative. The DSCA will assess, recommend and document a range of computational issues and methods in support of causal analysis and modeling.B. Description of Services• Research and document current best practices and methodologies for understanding casual mechanisms within a clinical, biological or biochemical context.Applicants must have the following scientific skills and qualifications:• PhD in Computer or Data Science, or related discipline• Advanced knowledge of current and emerging concepts in identifying causal processes and developing supporting models.• Experience with current and emerging PPL tools and technologies for probabilistic modeling and inference.• Experience with current and emerging tools and technologies for ontology development.• Must have strong communication and time management skills• Ability to ensure high-quality on-time completion of system documents and deliverablesC. DeliverablesAt the end of the project, Contractor will have delivered the following to Tufts CTSI:1. Actionable methodologies for informing clinical, biological and biochemical computational workflows.D. Period of PerformanceServices shall on or about July 1, 2018 and shall be completed no later than December 30, 2018.REQUESTS FOR PROPOSALDATA SCIENTIST (DSCA)COMPETITIVE INDEPENDENT CONTRACTOR OPPPORTUNITYE. Fees and Payment TermsTotal hours not-to-exceed 250 for engagement unless increased by mutual agreement. Payments will be for time and materials, only.F. Additional Terms and ConditionsIf selected for this opportunity, contractor will sign a standard Tufts Medical Center consulting agreement and a Business Associate Agreement.G. InvoicesInvoices will be submitted on a monthly basis. Payment will be issued between 45 and 60 days of submission of invoice, the Tufts Medical Center standard accounts payable period.H. Responses I. Responses to this opportunity should be addressed to William Harvey, MD, MSc, FACR, Director of Clinical Informatics Integration, and sent via email to cgarabedian1@tuftsmedicalcenter.org II. Include the following with your responsea. Detailed description of services to be providedb. Hourly rate on a time and materials basisc. Brief biography and or Curriculum Vitaed. References"}