{"jobID": "2622487979", "jobLocation": "Palo_Alto_CA", "jobTitle": "Senior Product Marketing Manager", "companyRating": "4.0", "companyInfo": {"Website": "www.venafi.com", "Headquarters": "Salt Lake City, UT", "Size": "201 to 500 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " DigiCert, Gemalto, Comodo"}, "estimatedSalary": "214000", "jobDescription": "Senior Product Marketing Manager Our mission is simple: we want to set people free to do meaningful work. People love our products--and it turns out that people love working here too. If you are exceptional at what you do, then you deserve an exceptional place to work. And thats what Venafi is.  We want someone who can tell a strong story about the leader in Machine Identity Protection, who knows how to architect a message, and inspire people with an elegant interweaving of both words and ideas. You will leverage your innovative marketing techniques to help us create a new Machine Identity Protection market while simultaneously accelerating our growth. Combined with your deep understanding of the buyers journey, you will think strategically, define go-to-market activities with Machine Identity Protection messaging precision, and educate prospects, customers and partners on the unique value propositions of our solution. You must be a strategic thinker that understands how to communicate unique positioning to the market and is able to create compelling messaging that uniquely positions Venafi to support content generation activities, competitive analysis, and the creation and delivery of sales enablement assets. You must be self-motivated, proactive and comfortable working in a fast-paced, dynamic environment.  The position requires strong marketing and communications skills, as well as an understanding of enterprise software, SaaS services, enterprise IT environments, and rapidly evolving security technologies. You must be comfortable working closely with sales, sales engineering, product management, and marketing, as well as bringing an exceptional solution that delights prospects, customers and partners. The position is based in the US and reports to the Director of Product Marketing. Responsibilities:Craft compelling messaging that helps buyers understand our benefits and unique advantages and deliver it through creative presentations, demonstrations, collateral, white papers, and positioning documentsDevelop sales enablement assets focused on helping internal and field sales teams understand target markets, buyer personas, pains points, and key messagesDrive cross-functional product launches, coordinating the efforts of engineering, sales, marketing, PR, and operationsProvide product support for sales and marketing events, including customer interaction and visitsGather and analyze competitive data in order to create assets as part of a comprehensive competitive intelligence program; including, but not limited to, competitive battle cards, news flashes, win/loss analysis, RFP responses, etc.Act as an evangelist for the Venafi product line to market influencers, prospects, and customers at trade shows, industry events, and conferencesRequirements:7 10 + years of experience on high-performing product marketing teamsExquisite written and verbal communication skills with the ability to succinctly articulate value propositions to multiple audiences across multiple buyer journey stages while aligned with company positioningHigh emotional intelligence and intellectual curiosity combined with strong problem-solving skills and the ability to continuously find newer and better ways to get things doneSuperior analytical skills with theability to visualize, articulate, conceptualize and solve both simple and complex problems in order to improve overall business resultsStrong ability to embrace, enhance and drive product positioning to achieve strong positioning adoption and market tractionDeep experience in developing vertical go-to-market strategy and vertical content for specific industries such as Financial Services, Insurance, Retail, Healthcare, etc.Demonstrated success in driving go-to-market strategy and launches for market-leading productsSelf-starter who is experienced in successfully taking a project from concept to executionFluency in pricing, bundling, and positioning products to accurately present a unique value propositionAbility to translate complex technical concepts into easy to consume business valueExcellent interpersonal, facilitation, and communication skills (written and verbal)Business-value-based selling, scenario / persona based marketingExperienced in successfully multi-tasking a variety of critical priorities.Experienced influencing and managing cross-functional teamsStrong project/program management skillsStrong analytical and problem-solving skillsEnterprise security software experience requiredPKI/Cryptographic experience preferredDevOps experience a plusEducation:MBA or equivalent preferred, BA/BS requiredTravel:This position requires approximately 20% travelAbout Venafi: Venafi is the cybersecurity market leader in machine identity protection, securing machine-to-machine connections and communications. Venafi protects machine identity types by orchestrating cryptographic keys and digital certificates for SSL/TLS, IoT, mobile and SSH. Venafi provides global visibility of machine identities and the risks associated with them for the extended enterpriseon premises,mobile, virtual, cloud and IoT at machine speed and scale.  Venafi puts this intelligence into action with automated remediation that reduces the security and availability risks connected with weak or compromised machine identities while safeguarding the flow of information to trusted machines and preventing communication with machines that are not trusted. Internally, we have an exceptional culture built around our core values comprised of honesty, transparency, leading by example, awareness, risk taking, and team before self.  Come join us!"}