{"jobID": "2720939145", "jobLocation": "Los_Angeles_CA", "jobTitle": "Business Intern", "companyRating": null, "companyInfo": {"Website": "www.linquest.com", "Headquarters": "Los Angeles, CA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " LinQuest is seeking college students interested in Business Management for an internship opportunity. The internship program promotes the development of future business leaders. This position will be located at our headquarters in Los Angeles, CA. The qualified candidate will become part of LinQuest’s business administration group and will be exposed to assignments in areas such as Accounting, Contracts, Subcontracts, Rates and Budgets, Financial Planning, Cost Estimating, Pricing, Program Finance, Scheduling, and Earned Value Management.  Roles and Responsibilities: Gathering, validation, and organization of data and documentsDevelopment/Update of financial modelsPerforming budget calculations/analysis/forecastsOther business supportRequired SkillsProficiency in Microsoft Office (Word, Excel, PPT)Ability to gather quantitative data, analyze, interpret and present in a clear mannerAbility to learn new software toolsPreferred Skills:Working knowledge with the following software tools:Deltek CostPoint accounting systemDeltek Budgeting and Planning SystemRequired ExperienceBe a student who is enrolled full-time and pursuing an undergraduate or graduate degree from an accredited college/universityBe majoring in Business Administration, Business Management, Finance, Accounting, Economics, International Business, or closely related disciplineHave completed at least sophomore yearHave an overall cumulative GPA of 3.25/4.0 or higher (unofficial academic transcripts must be provided at time of application by uploading the documents to your application or profile)Be available to work a minimum of 15 hours per weekUS citizenship and the ability to obtain a U.S. Government security clearance Job Location  Los Angeles, US-CA "}