{"jobID": "2689534307", "jobLocation": "Menlo_Park_CA", "jobTitle": "math tutor ($30-$40/hr, great office and training)", "companyRating": null, "companyInfo": {"Website": "www.ajtutoring.com", "Headquarters": "Menlo Park, CA", "Size": "201 to 500 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " © craigslist - Map data © OpenStreetMap430 Cambridge ave (google map)compensation: $30-$40/hremployment type: part-time Help students get into college!Join the most professional 1-on-1 tutoring firm in the Bay Area.We offer employees:The highest starting wage of any tutoring firm with steady increases based on meritGreat upward mobility in a rapidly expanding companyThe potential for full time year round employmentA dynamic work environment at our beautiful officesGreat paid training and ongoing supportOpen-minded, accessible directors who also tutor students themselves, so they are in touch with what students and tutors need to succeedFlexible hours (you set your own schedule, and you can work as few as 15 hours/week or as many as 35/week)Team dinners and group activities to create a collaborative atmosphereGreat feedback from your clients and appreciation of your workApplicants should have:Excellent SAT scores or a mastery of an academic subject at the high school AP level (Pre-Calculus or Calculus, Physics, Computer Science, English, History, Biology, or Chemistry)Tutoring experience Great communication skills A passion for teaching and a positive attitudePatience and flexibility with students with different learning stylesHere is what our tutors have to say about working at AJ Tutoring:https://www.youtube.com/watch?v=MkCBdmj-JP4&authuser;=0Please respond by emailing us your resume. Feel free to learn more at www.ajtutoring.com. Thank you!Our attractive offices:221 N. San Mateo Dr.San Mateo, CA 944011016 Laurel St, San Carlos, CA 940702105 Woodside Rd., Suite B,Woodside, CA 940621155 Crane St. #1Menlo Park, CA 94025430 Cambridge Ave. #110Palo Alto, CA 94306301 S San Antonio Rd Los Altos, CA 94022"}