{"jobID": "2789073692", "jobLocation": "Hollywood_CA", "jobTitle": "Senior Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.livenationentertainment.com", "Headquarters": "Beverly Hills, CA", "Size": "10000+ employees", "Founded": " 2005", "Type": " Company - Public (LYV) ", "Industry": " Media", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " AEG, StubHub"}, "estimatedSalary": "95000", "jobDescription": " Job Summary: Who we are. We’re fans who help fans everywhere get in to the live events they love. A proud division of Live Nation Entertainment, Ticketmaster has changed the way the world connects with their favorite artists, teams, and shows, and we continue to shape innovation every day. We’re not just selling tickets (though we do that better than anyone else), we’re enriching lives one amazing experience at a time. And we think that’s pretty amazing. If you’re passionate about the magic of live entertainment like we are, and you want to work at a company dedicated to helping millions of fans experience it, we want to hear from you. Why you should work with us. Our biggest investment is in our people. We offer comprehensive health benefits and 401k matching, student loan assistance, plus career-boosting opportunities like tuition reimbursement and targeted development sessions to help all eligible employees thrive. At Ticketmaster, expect the fast-paced excitement of a startup with the rock-solid support from an industry leader – with plenty of ticket perks on the side. See what it’s like working at Ticketmaster.The role: The Senior Data Analyst will help support a large-scale BI platform solution used to power the day-to-day decisions and operations of various Ticketmaster business teams. Specifically, this individual will be involved in all aspects of reporting and analytics (e.g., requirements gathering, database querying, report development, etc.) that are required to successfully support our internal customers. The individual must be highly analytical, can view the business from a number of different levels, and work with stakeholders to identify and implement new opportunities to grow the business.  The ideal individual will be able to make sense of and validate data to deliver analysis and insights to our business teams across multiple functions including Sales, Marketing, Strategy, & Finance. ResponsibilitiesUnderstanding your business stakeholders’ objectives, gathering requirements, understanding the metrics that are the most important to them, and how they measure their performanceCoding (SQL) reports, Dashboards (preferably in Cognos and Domo datasets), and visualizations to help our stakeholders improve their performanceConduct hands-on modeling/analytics retrieving, compiling, and analyzing large volumes of data from disparate databases into distilled, actionable information needed by senior leadership to answer critical questionsOwn the design, development, validation, and maintenance of ongoing metrics, reports, analyses, dashboards, etc. to drive key business decisionsTurning business requirements into technical requirementsDevelop recommendations and clearly communicate results of analysis to senior managementPerform internal, ad hoc analysis of key strategic initiatives across multiple departmentsLearning from, and sharing knowledge and skills (e.g., through thorough documentation) with teammates to grow BI’s total impact to the organization. Also includes training end users of the various business tools offeredRequirementsBachelor’s degree in Computer Science or related field preferred. Master’s degree is a plus5+ years of experience with relational databases (like Teradata, Oracle, SQL Server), SQL (must be able to write complex, highly optimized SQL queries across large volumes of data), Business Intelligence tools, and similar software required4+ years of professional experience (post undergrad) in business analytics, business intelligence (BI), or comparable consumer analyst position handling large, complex data setsStrong influencing and collaboration skills, particularly with working with business end usersPrevious work with Agile and Lean practices preferredKnowledge and experience with Cognos 11.x product suite is a plusKnowledge of ETL and data warehouse concepts and processesExperience with Domo or equivalency to create impactful reports, visualizations, and interactive dashboardsExperience in gathering requirements and formulating business metrics for reportingAbility to quickly adapt to changing priorities and generate innovative solutions in an extremely fast-paced environmentExcellent oral and written communication skills, and comfort presenting to everyone from entry-level employees to Senior Vice PresidentsStrong problem solving and issue resolution skillsExtraordinary team player and ability to thrive in a fast-paced, high growth, entrepreneurial environment where quality, innovation, speed of decision making and execution are critical to organizational successEqual Employment Opportunity Ticketmaster strongly supports equal employment opportunity for all applicants regardless of age (40 and over), ancestry, color, religious creed (including religious dress and grooming practices), family and medical care leave or the denial of family and medical care leave, mental or physical disability (including HIV and AIDS), marital status, domestic partner status, medical condition (including cancer and genetic characteristics), genetic information, military and veteran status, political affiliation, national origin (including language use restrictions), citizenship, race, sex (including pregnancy, childbirth, breastfeeding and medical conditions related to pregnancy, childbirth or breastfeeding), gender, gender identity, and gender expression, sexual orientation, or any other basis protected by applicable federal, state or local law, rule, ordinance or regulation.  We will consider qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Ordinance, for applicants in Los Angeles, California, and consistent with applicable laws in other areas. Hiring Practices The preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.  Ticketmaster recruitment policies are designed to place the most highly qualified persons available in a timely and efficient manner. Ticketmaster may pursue all avenues available, including promotion from within, employee referrals, outside advertising, employment agencies, internet recruiting, job fairs, college recruiting and search firms."}