{"jobID": "2817626854", "jobLocation": "San_Jose_CA", "jobTitle": "Leasing Consultant", "companyRating": null, "companyInfo": {"Website": "www.equityapartments.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1993", "Type": " Company - Public (EQR) ", "Industry": " Real Estate", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " UDR, AvalonBay Communities"}, "estimatedSalary": null, "jobDescription": "Working for Equity Residential means being part of a community employees and residents striving to provide the best in apartment living, speaking boldly about new ideas for innovation, and inspiring creativity in the ways we live and work together. Thats what our Be.Think.Play.Live. culture is all about.Our Leasing Consultants are the heart of our community, bringing people and apartment homes together. They are multitalented, personable individuals with sales expertise and a passion for building relationships. Leasing Consultants walk side by side with customers, developing rapport and inspiring trust as residents make our community their home.  As a Leasing Consultant, you will work closely with one of our top property management teams to provide exceptional service to residents. Each day will be unique, requiring an ability to prioritize, multitask, think creatively, take initiative, and employ a diverse set of skills. You will listen carefully to discover prospective residents needs, confidently recommend solutions and overcome concerns, and earn commitment by guiding new residents through the leasing process. Leasing Consultants bring positive energy to each conversation, resolve any apartment issues quickly and effectively, and make everyone feel welcome and appreciated. WHO YOU AREA Strong Communicator. Your writing and speaking skills are clear and effective, helping you connect well with others.A Team Player. You are united with teammates in delivering the best experience to current and prospective residents.Organized. You are flexible and able to juggle appointments and personal interactions with teammates and residents smoothly.Creative. You are an idea person and like coming up with smart solutions to new challenges.Caring. You put yourself in others shoes and strive for positive outcomes.Motivated. You invest extra energy to reach your goals.Solution-Oriented. You follow through on commitments, letting residents know that they matter.WHAT YOULL DOConnect with prospective residents through phone calls, appointments, and follow-up communications.Show off our community by walking the property with prospective residents and delivering a persuasive sales pitch about the benefits of living in an Equity Residential apartment home.Manage the leasing process by guiding new residents through each step, completing and verifying all lease applications and sharing results with applicants.Keep accurate records of prospective and current residents, as well as rent and inventory.Handle transactions like accepting rent and deposits and inspecting move-ins and move-outs.Collaborate with talented teammates to identify and solve any apartment issues that arise.Plan fun activities that help build a strong sense of belonging among residents.REQUIREMENTSDemonstrated proficiency in working with computers including word processing, calendar management, software/database, and social mediaExcellent communication, interpersonal, and organizational skillsHigh school diploma or equivalentAvailable to work a flexible schedule, including weekendsPREFERRED EXPERIENCECollege degree or courseworkPrior experience in leasing, sales, or hospitalityREWARDSWe recognize everyone has different needs outside of work. Thats why, in addition to a competitive benefits package (medical, dental, vision and paid time off), we offer many unique options to employees, like adoption benefits and paid time off for community service projects. To learn more, view our Total Wellbeing page here."}