{"jobID": "2816351496", "jobLocation": "Framingham_MA", "jobTitle": "Senior Data Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.staples.com", "Headquarters": "Framingham, MA", "Size": "10000+ employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "129000", "jobDescription": " Description General Summary: We are looking for an experienced and well-rounded engineer to join our growing team. Our ideal candidate would be passionate about using computing and data science to help deliver end-to-end production solutions that raise the bar on innovation and quality. Your interests in distributed systems, fault tolerance and scalability will help Staples build large scale distributed applications that serve to accelerate our growth and profitability as well as identify opportunities for optimization. While the emphasis of this position is hands-on programming in Forecasting, Replenishment and Inventory Planning application development, you will have opportunities to collaborate closely with Data Scientists on the underlying problems applying Machine Learning, and Optimization techniques. Primary Responsibilities:Developing applications to implement solutions in the areas of Forecasting, Replenishment and Inventory Planning.Work Closely with Data Scientists and Business Partners understanding Forecasting Algorithms, Demand Patterns, Sku Life Cycles and Item parameters to test and implement \"Best Fit\" Algorithms to reduce WAPE and improve Forecasting AccuracyWork closely with key partners to understand business requirements and produce technical designs that propose highly reliable and scalable platform architectures built with well-designed software components in the Cloud.Takes hands-on ownership implementing software components following engineering practices that drive agility and quality like test driven development, peer reviews, configuration management, monitoring and continuous integration&development;Set expectations and communicate progress with business partners in the entire life-cycle of SaaS operations driving adoption and scaleQualificationsBasic Qualifications:3-5 years of relevant industry experience plus MS/BS in Computer Science, Computer Engineering, Research Operations or related fieldExpertise building SaaS offerings on public Cloud platforms (e.g.: Azure, AWS) using platform services and integrating with \"behind the firewall\" on premise deploymentsExpertise architecting and developing highly reliable, fault tolerant distributed applications with focus on performance&scale;In-depth knowledge of Linux/Unix (Red Hat/Cent OS) and ability to leverage a wide variety of upstream open source developmentAbility to analyze business requirements, working closely with business partners to develop details, driving feature prioritization&adoption; of applications. Subscribe to fast paced Agile principles with technical designs, code reviews, test driven development and other methodologies.Strong verbal and written communication kills and ability to interact with multiple teamsDesired Skills:Programming Skills developing back-end cloud applications in NodeJS, Go, Python, or Java&Scala;Experience building microservices exposing REST APIs and web applications using frameworks such as Swagger/OpenAPI, App Service/Azure or DjangoStrong scripting skills driving automation of workflows in a Linux/Unix environment (e.g.: bash, Python, Perl)Experience working with RDBMS and NoSQL data stores on-premise and in the Cloud (e.g.: SQL Server/Azure, PostgresSQL/Azure, MongoDB, Cassandra, Cosmos DB/Azure, DynamoDB/AWS, Redshift/AWS, Teradata, Oracle)Experience with Web technologies (e.g.: HTML, 5, CSS, jQuery, Angular, Websockets) a plusExperience working with data processing frameworks (e.g.: Hadoop, Spark) a plusExperience building monitoring and reporting metrics at various hierarchies using PowerBI pulling data from various sources such as Azure and Teradata Staples is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, protected veteran status, disability, or any other basis protected by federal, state, or local law.  Staples is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other basis protected by federal, state, or local law.  Staples"}