{"jobID": "2776874707", "jobLocation": "Seattle_WA", "jobTitle": "RESEARCH DATA ANALYST - PART TIME (50% FTE)", "companyRating": "4.1", "companyInfo": {"Website": "www.washington.edu", "Headquarters": "Seattle, WA", "Size": "10000+ employees", "Founded": " 1861", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "56000", "jobDescription": " RESEARCH DATA ANALYST - PART TIME (50% FTE) Req #: 155852 Department: APPLIED PHYSICS LABORATORY Job Location: Seattle Campus Posting Date: 05/15/2018 Closing Info: Open Until Filled Salary: $3,166 - $3,503 per month. Shift: First Shift Notes: As a UW employee, you will enjoy generous benefits and work/life programs. For detailed information on Benefits for this position, click here. As a UW employee, you have a unique opportunity to change lives on our campuses, in our state and around the world. UW employees offer their boundless energy, creative problem solving skills and dedication to build stronger minds and a healthier world.  UW faculty and staff also enjoy outstanding benefits, professional growth opportunities and unique resources in an environment noted for diversity, intellectual excitement, artistic pursuits and natural beauty. All of which has allowed the UW to be nationally recognized as a “Great College to Work For” for four consecutive years.  Established in 1943 at the request of the United States Navy, the Applied Physics Laboratory of the University of Washington (APL-UW) has provided continuous access to the highest levels of academic expertise in scientific research and engineering to address Navy-specific problems. Laboratory expertise spans acoustic and remote sensing, ocean physics and engineering, medical and industrial ultrasound, polar science and logistics, environmental and information systems, and electronic and photonic systems. APL has an outstanding opportunity for a part time (50% FTE) Data Analyst.  This position is located in the Polar Science Center (PSC). The Polar Science Center conducts basic and applied research on the oceanography, climatology, meteorology, biology and ecology of the ice-covered regions on Earth and elsewhere in our solar system. The scope of PSC research and fieldwork includes the Arctic and the Antarctic, as well as sea-ice, glaciers and continental ice sheets.  Under the direction and supervision of the principal scientist Dr. Kristin Laidre, this position will provide research support and assistance for Laidre’s Arctic marine mammal ecology program. This position requires work on multiple research projects, and prioritizing work with simultaneous and competing timelines. This position requires interaction with Laidre, other scientists and collaborators on research projects, graduate students, and any other groups integral to the successful completion of the research projects. This position requires a self-motivated, independent and enthusiastic candidate with GIS experience and an interest in biological and/or earth science questions. RESPONSIBILITIES: Data Coordination, Production and Analysis Analyze point, line, polygon and raster data sets using ArcGIS 10.x, including ArcGIS database management, analysis, and visualization with Python scripting or Microsoft Excel with VBA macros.Process and analyze raster (gridded) image data using remote sensing techniques and sources, including satellite image interpretation and classification (e.g., Landsat satellite data).Analyze spatial data from tagged marine animals using standard statistical methods, which may include use of ArcGIS geospatial modeling environment, kernel home range analysis, and other relevant methods.Maintain computer spreadsheets and databases using R and Excel.Resolve problems and answer queries related to the data and its outputsAssist in preparing research presentation material, such as PowerPoint slides, posters, abstracts, graphs, figures and text for publications.Perform related tasks as assigned. Research-related positions at the Applied Physics Laboratory are wholly supported by funding from research sponsors. In addition to an individual’s satisfactory work performance, it is necessary to also obtain sponsor funding sufficient to support a research-related position. This position will support a specific set of APL research projects over a period of up to three years. The work could end sooner due to lack of work, lack of funding, unsatisfactory job performance, or other factors. It is not possible to forecast whether continuing work and/or funding will be available following the completion of the existing set of research projects. Minimum Qualification: To meet the minimum qualifications for this position, applicants must possess a Bachelor's Degree in Mathematics, Geospatial studies, Computer programming, Ecology, or a related field and less than 1 year of experience. Candidates who possess skills and experience greater than the minimum qualifications are encouraged to apply. Additional minimum qualifications are: · Demonstrated knowledge of ArcGIS and spatial analysis for mapping and quantitative analysis of spatial data  · Experience working with gridded data or satellite data for biological or earth science applications  · Knowledge of Python and R, or other relevant programming and scripting language(s)  · Fluency with Microsoft Excel, Word, and PowerPoint  Equivalent education/experience will substitute for all minimum qualifications except when there are legal requirements, such as a license/certification/registration. Desired Qualifications Our desired applicants will possess all of the qualifications above, but may also have greater amounts of experience and/or education. In addition, we desire knowledge of Matlab, IDL, Java, SQL, or equivalent software for database and mathematical analysis. CONDITIONS OF EMPLOYMENT: May be subject to successful completion of E-Verify process. Application Process: The application process for UW positions may include completion of a variety of online assessments to obtain additional information that will be used in the evaluation process. These assessments may include Work Authorization, Cover Letter and/or others. Any assessments that you need to complete will appear on your screen as soon as you select “Apply to this position”. Once you begin an assessment, it must be completed at that time; if you do not complete the assessment you will be prompted to do so the next time you access your “My Jobs” page. If you select to take it later, it will appear on your \"My Jobs\" page to take when you are ready. Please note that your application will not be reviewed, and you will not be considered for this position until all required assessments have been completed.The University of Washington is a leader in environmental stewardship & sustainability, and committed to becoming climate neutral.The University of Washington is an equal opportunity, affirmative action employer.  To request disability accommodation in the application process, contact the Disability Services Office at 206-543-6450 / 206-543-6452 (tty) or dso@uw.edu. Apply for this job"}