{"jobID": "2822222911", "jobLocation": "New_York_NY", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.stashinvest.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Stash is investing, simplified. We are an investing platform that makes it easy for anyone to start with as little as $5. Through empowering our users with education and guidance, we help investors learn the basics so they can do it themselves. At Stash, we are working toward a future where investors are as diverse as our world.  Stash is looking for a Data Scientist with a passion for building reliable, scalable, and performant software. We look for strategic thinkers and creative problem solvers with a bias for execution and well expect you to contribute code as well as product/feature ideas from the get-go. If you are looking for a culture that encourages ownership, taking calculated risks, being data-driven and that values evidence over ego, this may be the role for you. What youll do:You will work closely with our CTO and engineering teams to establish new systems for our products to predict and augment the Stash experience in ever more intelligent waysDesign predictive models which grow and adapt as our products and customer base scale, utilizing machine learning, time-series and Bayesian statisticsWork with large datasets to help us better understand our customers and anticipate their needs through distributed computation techniquesMake rigorous statistical inferences from A/B testing on our product and customer segmentsNormalize our data across institutions and sources using semi-supervised learningWho were looking for:MS in Computer Science, Statistics, Applied Mathematics, Physics, Engineering or a related field with 3+ years of experience2+ years of professional programming work in Python, Scala, Java, or similarExperience with Pandas, R, or other statistical modeling frameworksAn understanding of storing and querying data from Redshift, PostgreSQL, or similarPassion to use all aspects of data science, programming, and technology to build the financial advisor of the futureExperience using machine learning to improve algorithmic systemsExperience with machine learning frameworks such as Apache Spark or Apache Hadoop/MapReduce**No Recruiters, please"}