{"jobID": "2767433532", "jobLocation": "Redwood_City_CA", "jobTitle": "Security Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.providentcu.org", "Headquarters": "Redwood City, CA", "Size": "201 to 500 employees", "Founded": " 1950", "Type": " Nonprofit Organization", "Industry": " Finance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Patelco Credit Union, Golden 1 Credit Union, San Mateo Credit Union"}, "estimatedSalary": "86000", "jobDescription": "Why Provident Provident Credit Union is member-owned, trusted, financially sound, technologically advanced, and provides \"world class\" value, convenience, products and services to all members. We are headquartered in Redwood Shores, CA and have 18 branches located throughout the San Francisco Bay Area, and Folsom. Primary Function The position is responsible for facilitating research, planning and completion of tasks with stakeholders to ensure the integrity and security of the credit union’s systems and information assets. The position must document, improve, maintain and support the credit union’s cyber security strategy. The position will work with end users to determine the security needs of all departments, and will implement policies and procedures that result in full IT security compliance throughout the organization. The position is also responsible for auditing our security vendors, and ensuring we have capable and available resources to respond to situations that require heightened security services. DutiesWork with Credit Union Staff to recognize and mitigate potential, successful and unsuccessful intrusion attempts and compromises through reviews and analysis of relevant detail and summary information.Plan, scope and drive security projects including but not limited to virus prevention and remediation; intrusion detection prevention and remediation; log analysis, network security improvements; security scans, audits and relevant remediation.Maintain the Credit Union's FFIEC CAT (Cyber Security Assessment Tool)Audit and updating the annual IT risk assessmentDocument and update management responses to third party security audits and assessmentsComplete security review requests within published timeframesResearch and recommend security solutionsStay abreast of compliance, regulatory and security practices, issues and technologiesMonthly audit of hardware, software and network connectivity inventory, access management and harding of systems, network devices and connectivityValidate that security patches have been implemented in a timely and effective mannerAdhere to change management policy and procedures for security changesCollaborate with the Training Department to ensure the Credit Union's Security Awareness Program is comprehensive and relevantProvide input to technology and security policies, procedures and budgetSalary Range: The salary range for this position is between $68,900 & $87,900. Any actual salary offer will be dependent on experience of the successful candidate.  ​ Job Knowledge/Experience:Degree in Computer Science, Sytems Engineering strongly preferred.Windows certifiction or minimum 4 years of experience maintaining and supporting networks, servers, desktop applications, equipment, connections and intranet/internet co-manage.Experience monitoring security solutions including but not limited to SIEM, Privileged Account Administration, IPS and Firewalls.Must have US banking experience and knowledge of US banking laws and regulationsHave or are working towards Security Certifications specific to areas of responsibilities (CISSP, CISA, , CEH, GSEC, GCIH, GPYC)Possess a high familiarity with computers, including experience using basic Internet applications, troubleshooting network connectivity problems, and installing network and printing hardware on Mac OS and WindowsWorks under general supervision with a certain degree of creativity and latitudeAble to take initiative in providing guidance and assistance to other staffAble to complete tasks with attention to detailAble to work long hours as needed to support the organizationFamiliar with cybersecurity framework, security standards, practices and proceduresRelies on limited experience and judgment to plan and accomplish goalsFamiliar with PowerShell, Python and JavaScript. Abilities to automate scripts to test/audit system vulnerabilities or security control solutionsProficient in Linux, Mac, Windows and virtual environment, able to perform risk assessment for different types of operating systems and appliancesFamiliar with CIS, Critical Security ControlsCISSP, CISA, , CEH, GSEC, GCIH, GPYC or equivalent experience ​The position demands maturity, flexibility and someone ready to contribute at a high level—and the rewards that come with it. • Fully paid health insurance premiums  • Quality medical, dental and vision care coverage  • 401(k) retirement plan with matching employer contributions  • Strong commitment to investing in your career and educational advancement by offering up to 100% tuition reimbursement for approved courses  • Incentive plan  • Generous paid time off and paid holidays  • Flexible spending accounts  • Short and long-term disability coverage  • Life and AD&D; insurance  • Provident membership  • Rate discount on home and auto loans  • In-house training  • And much more! Provident is an Equal Opportunity Employer We are a winner of the Bay Area News Group Top Workplace in 2017. Check us out on Glassdoor"}