{"jobID": "2782699103", "jobLocation": "Redmond_WA", "jobTitle": "Data Scientist II", "companyRating": "4.1", "companyInfo": {"Website": "www.microsoft.com", "Headquarters": "Redmond, WA", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (MSFT) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Amazon, Apple"}, "estimatedSalary": "143000", "jobDescription": " Are you a passionate engineer that enjoys building realtime scalable customer-facing services? Do you have the interest to do full-stack engineering development and have knowledge and experience in data science?  We are a common team in Data Services - we do work for Azure Database Migration Services (DMS), Azure MySQL and Azure PostgreSQL. We do feature development and Data Science/ Machine Learning work for these services.  Over the past 10+ years, the Data Group in the Cloud and Enterprise division has grown from a 40-million-dollar business to 7+ billion-dollar business and is a key revenue generator at Microsoft. The usage spans from developers, SMBs to huge enterprises taking mission-critical dependencies on our platform for a range of workloads from super-fast OLTP workloads & advanced DW scenarios to analytics, search and non-relational options. Working with the full range of customers and products, the Data Migration team’s charter is to enable customers to easily migrate to Azure.  Azure Database for PostgreSQL is the newest service added to the family of relational database services provided in Microsoft Azure. We are expanding the choice of database services in Azure and, MySQL and PostgreSQL are the newest offerings. The team is building the PostgreSQL service on the common platform supporting all relational database workloads, and leveraging the scale of our global presence in all Azure datacenters. We are a full stack team, tackling the breadth of technology from distributed systems, availability, scalability, query performance and processing, storage, operating systems, networking, management tools, web development, user experience and most other fields in Computer Science. We are reaching out to the open source community and are actively looking for ways to collaborate on enhancing the database engines we support.  We do feature development and modeling for Data Migration and PostgreSQL. The features we are currently developing include Query Store, Performance Insights and Performance Recommendations. The Machine Learning work we are doing as part of Intelligent Database system influences various parts of the core products.Responsibilities"}