{"jobID": "2819251750", "jobLocation": "Cambridge_MA", "jobTitle": "Sr Data Scientist", "companyRating": "4.5", "companyInfo": {"Website": "www.bitsighttech.com", "Headquarters": "Cambridge, MA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "135000", "jobDescription": "Position Overview Serve as a senior member of the team focused on data science, machine learning, stochastic generation models, data visualization, algorithm development, natural language processing, etc. This position reports to the Director of Data Science but collaborates directly with product and engineering groups to support and develop new features and products. In addition, this person will participate in marketing initiatives to share research results and promote market awareness. Objectives & ResponsibilitiesCollaboration with product and engineering groups to design ratings for new data inputs and risk vectorsDevelop techniques for extracting firmographics from a variety of data sourcesExtend existing risk modelsVisualization and presentation for products and external publicationsConduct research and reporting on the security environment and data landscapeConduct research, writing, and presentations in support of marketing activities and customer engagements to promote key findings and capabilities and explain data and ratings conceptsApply data science and machine learning to other challenges within BitSight including but not limited to the modeling of customer data, sales opportunities, company asset discovery, and cybersecurity research toolsSkillsOwnership mentality and entrepreneurial drive, proven ability to work autonomouslyStrong technical background with expertise in machine learning or statistics or data-driven social science (e.g., Economics) or data-driven cybersecurity or data-driven computer networking or in another relevant areaStrong communication and analytical skills including the ability to identify and frame initially vague problems and communicate solutionsExpert with the Python data science toolset, or with R, Matlab, SAS, etc. but with a willingness to switch to PythonFamiliarity with distributed data processing and data storage technologiesBasic knowledge of computer networksEducation Masters, Ph.D., or commensurate experience Experience At least 3 years practicing data science in industry or extensive postdoctoral academic experience About the Company Based in the Boston area, the company is the pioneer and leader in the security ratings market delivering ratings solutions for third-party risk management, benchmarking, and cyber insurance."}