{"jobID": "2786672821", "jobLocation": "San_Francisco_CA", "jobTitle": "Lead Front End Engineer", "companyRating": "4.1", "companyInfo": {"Website": "www.glassdoor.com", "Headquarters": "Mill Valley, CA", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Indeed, LinkedIn"}, "estimatedSalary": "64", "jobDescription": " Our mission is to help people everywhere find a job and company they love. We are disrupting an industry by changing how people search for jobs and how companies recruit top talent.  Glassdoor is looking for a talented Lead Front End Engineer to help take our product to the next level. This is your chance to share your work with a worldwide community of over 50 million members in 190 countries. Responsibilities As a Lead Front End Engineer, you will play a central role in the technical architecture, development and delivery of user-facing features for Glassdoor’s web products. The ideal candidate will have a passion for creating high-quality user experiences working closely with skilled product owners, UI/UX designers and other engineers.  You should have solid experience building dynamic, responsive web pages using JavaScript, CSS3, HTML5 using libraries such as jQuery and React. The ideal candidate will have experience working with both Java and Node.js in high-volume, production environments. As a Glassdoor engineer, you will be part of a small cross-functional, agile team where you will have continued opportunity to learn and grow.  As a growing, late-stage startup, we look for self-starters who thrive in a fast-paced, agile environment – which means wearing many hats, being able to change direction quickly, and showing an eagerness to learn new technologies as the need arises. In this role you work with a small, collaborative team of engineers, product managers, and designers – so excellent interpersonal and communication skills are also a must. And most importantly – we look for people who can prioritize, multi-task, and deliver – because it’s a lot more fun to get things done. Skills and Requirements6+ years building high-quality, secure presentation layers for high visibility web sitesProficiency with HTML5, JavaScript, and jQueryProficiency with CSS3, Sass, and MixinsExperience with React and Node in high-volume, production systemsExperience with Gulp and WebpackExperience with Node SSR, Redux, Routers, ExpressExperience developing server-side MVC applications, ideally Java/Spring basedContinual learning of emerging technologies/industry trendsExcellent communication skills and experience in collaborative environments* Location - this role is located in our San Francisco OfficeWhy Glassdoor?Work with purpose – join us in creating transparency for job seekers everywhereGlassdoor gives back! Glassdoor is a Pledge 1% member; all employees receive 3 paid volunteer days per year100% company paid medical/dental/vision/life coverage, with 80% dependent coverageLong Term Incentive PlanConveniently located office in the heart of downtown San Francisco (Embarcadero)Fully-stocked break rooms with complimentary food and drinksPaid holidays and flexible paid time offYour choice between Mac or PC Glassdoor is committed to equal treatment and opportunity in all aspects of recruitment, selection, and employment without regard to gender, race, religion, national origin, ethnicity, disability, gender identity/expression, sexual orientation, veteran or military status, or any other category protected under the law. Glassdoor is an equal opportunity employer; committed to a community of inclusion, and an environment free from discrimination, harassment, and retaliation."}