{"jobID": "2766398834", "jobLocation": "San_Jose_CA", "jobTitle": "Sales Associates - Furniture and Home Decor", "companyRating": "3.4", "companyInfo": {"Website": "www.scandinaviandesigns.com", "Headquarters": "Petaluma, CA", "Size": "201 to 500 employees", "Founded": " 1962", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "13", "jobDescription": " Join our growing retail operation in San Jose and Cupertino!  Scandinavian Designs is a home furnishings destination rooted in our love for modern design and quality craftsmanship and we are looking for full-time Sales Associates to work at our San Jose and Cupertino, CA locations. Our Sales Associates are passionate about design and quality products and are committed to providing exceptional service. Maximize sales growth and profitability by demonstrating a wholehearted customer service attitude with a positive, knowledgeable and consultative approach.Deliver a positive shopping experience to every customer, every time.Inspire our customers to blend timeless tradition of Scandinavian Design with their individual styles.Greet our clients and answer our phones in a prompt, professional and polite manner.Demonstrate comprehensive product knowledge and exhibit our merchandises qualities, features and benefits to increase sales.Build positive relationships with our clients providing quality customer service and enthusiastic and effective communication as you move them through the sales process.Selling includes some behind-the-scenes systems and details that keep merchandise moving through the selling cycle correctly and profitably.Work with other team members collaboratively across departments.Qualifications:Successful Associates have a wholehearted customer service approach with a professional and welcoming presentation.They are skilled in increasing sales, customer communication and knowledgeable in color and design.While a degree in design or related field is preferred, we welcome applicants who bring their love of design, retail experience and expertise to the team.Associates are available to work a combination of days, evenings and weekends.Able to successfully complete our pre-employment background and drug screenings. Scandinavian Designs now operates 32 stores across seven states under the brand names Scandinavian Designs, Dania Furniture and nationwide for SCANDIS.com. We offer extensive product and sales training to facilitate career growth. Our compensation includes a competitive pay program, sales incentives and a comprehensive health and retirement benefits package.  We are an Equal Opportunity Employer."}