{"jobID": "2632798300", "jobLocation": "San_Francisco_CA", "jobTitle": "Marketing Data Analyst", "companyRating": "4.4", "companyInfo": {"Website": "www.zendesk.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2007", "Type": " Company - Public (ZEN) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Freshdesk, RightNow Technologies"}, "estimatedSalary": "81000", "jobDescription": "Zendesk is seeking a Marketing Data Analyst to join the Growth Marketing team. Youll be joining a motley crew of motorcycle riders, surf & dive experts, karaoke divas, and an improv champ. We are data driven marketers, so every major decision starts with data analysis to identify opportunity areas and to measure our efforts. Youll be diving into a wide scope of sales, marketing, and product data to help us make the right decisions and achieve our ambitious goals.Who were looking for:You are a team player, a fun fact sharer, looking to inspire and be inspired, not needing sole credit for wins and able to support others selflessly. You are a spunky person who actually enjoys a challenge and sees it as an opportunity. Unafraid to admit failure and always eager to find solutions, you are resourceful, self-motivated to learn and unafraid to ask questions in order to grow. Responsibilities: Join forces with our analysts to inspire and empower Growth Marketing to leverage data to measure and prove successBe scrappy when scoping, sizing and fulfilling large and small requests balancing efficiency and qualitySift through large data sets via query languages and BI tools for dashboards and reportingEducate and support teams with strategies on how to connect data to resultsContinuously consider ways to improve the knowledge of our marketing funnel - from first impression to identifying which channel, content, or campaign is driving leads, pipeline and bookingsUse your visual and logical creativity to design and build insightful dashboards for teams to stay on top of their KPIs and initiativesBe rigorous about monitoring metric performance and dont hesitate to point out new trends or flag potential issuesDesired Skills and Experience:BS/BA degree in business engineering, economics, or related degree OR equivalent combination of education, training, and experience2+ years of experience in strategy consulting, data analytics, business intelligence, or related fieldExcellent written and verbal communication skills. Comfortable presenting data and providing recommendations with confidence to senior level stakeholders, even when there is ambiguity involvedFamiliarity with marketing funnel reporting and industry KPIs, such as website sessions, MQLs, pipeline, and MRRExperience with BI tools (e.g. BIME, Tableau, GoodData) and advanced Excel functionsIntermediate SQL query writing and experience implementing and working with analytics data warehouses (e.g. BigQuery, MySQL)Experience analyzing CRM data (e.g. Salesforce) and web tracking (e.g. Google Analytics)The best customer experiences are built with Zendesk. Zendesks powerful and flexible customer service and engagement platform scales to meet the needs of any business, from startups and small businesses to growth companies and enterprises. Zendesk serves businesses across a multitude of industries, with more than 125,000 paid customer accounts offering service and support in more than 30 languages. Headquartered in San Francisco, Zendesk operates worldwide with 15 offices in North America, Europe, Asia, Australia, and South America. Learn more at www.zendesk.com.Interested in knowing what we do in the community? Check out the Zendesk Neighbor Foundation to learn more about how we engage with, and provide support to, our local communities.Individuals seeking employment at Zendesk are considered without regards to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, or sexual orientation.By submitting your application, you agree that Zendesk may collect your personal data for recruiting, global organization planning, and related purposes. Zendesk's Candidate Privacy Notice explains what personal information Zendesk may process, where Zendesk may process your personal information, its purposes for processing your personal information, and the rights you can exercise over Zendesks use of your personal information."}