{"jobID": "2827973173", "jobLocation": "San_Francisco_CA", "jobTitle": "Consulting - Manager, Data Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.hitachiconsulting.com", "Headquarters": "Dallas, TX", "Size": "5001 to 10000 employees", "Founded": " 2000", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Slalom, Accenture, Deloitte"}, "estimatedSalary": "121000", "jobDescription": "About Hitachi ConsultingAs Hitachi, Ltd.'s (NYSE: HIT) global consulting company, with operations in the United States, Europe and Asia, Hitachi Consulting is a recognized leader in delivering proven business and IT strategies and solutions to Global 2000 companies across many industries. With a balanced view of strategy, people, process and technology, we work with companies to understand their unique business needs, and to develop and implement practical business strategies and technology solutions. From business strategy development through application deployment, our consultants are committed to helping clients quickly realize measurable business value and achieve sustainable ROI. Its client base includes 35 percent of the Fortune 100 and 25 percent of the Global 100, along with many mid-market leaders. With offices throughout North America, Europe, the Middle East and Asia, Hitachi Consulting employs more than 6,500 professionals across 23 countries with delivery centers in India (Bangalore, Pune and Hyderabad), China (Guangzhou) and the United States (Fargo, North Dakota) to offer global delivery scale. For more information, visit www.hitachiconsulting.com. Purpose of Position The Data Scientist designs, builds and maintains analytical models that mine large sets of structured, semi-structured and unstructured data while looking for unique insights and correlations that not evident through traditional Data Warehouse or Business Intelligence techniques. The Data Scientist will leverage a deep understanding of math, applied statistics, engineering, and software development to build complex models to identify business trends and predict outcomes.The Data Scientist will work in a highly collaborative team environment and be responsible for the overall quality and accuracy of the resulting model. The position will work closely with the U.S. Insight & Analytics staff and business leaders to create actionable machine-learning products that support strategic, tactical and operational decisions. This individual will be responsible for the design, implementation, evaluation and analysis of data and reporting mechanisms to bring descriptive clarity to Client business metrics and predictive maintenance / connected car / optimized factory solutions.ExpectedDutiesDesigns, develops, and implements algorithmic solutions for time series, streaming data, and big data at restWorks with functional consulting teams across business domains, including industrial engineering / manufacturing / IoT experienceDevelops reusable, maintainable and effective predictive and behavioral models through rapid, iterative, Agile development using machine learning techniques.Contributes to Hitachi Solutions through a full Agile Software Development Life Cycle methodology.Works closely with industry Subject Matter Experts, Data Architects and Solution Architects to understand business problems, identify data sources, develop analyzers and predictive models and configure visualization software to communicate results.Applies intellectual curiosity and deep analytical thinking to mine large data sets for hidden gems of insight and correlation.Actively seeks new methodologies, algorithms, tools and technologies to improve existing models and build new state-of-the-art models.Education and ExperienceBachelor’s degree in a quantitative field such as Mathematics, Physics, Physical Chemistry, Statistics, Actuarial Science, Engineering, Economics, or related field from a four-year college or university. Master’s degree or higher preferred.5 to 10 years of experience in an industrial or government scientific or engineering laboratory, underwriting firm, risk-management firm, or sell-side financial house.Fluency with analytical software including R, Python, Stata, MatLab, SAS, and/or SPSSExtensive experience applying machine learning algorithms, predictive modeling, data mining, and statistical analysis to solve business problems.Dexterity and nimbleness with the Microsoft Office/VBA stackDesired Skills and AbilitiesDemonstrated in-depth knowledge of statistics, relational databases, object-oriented programming, and a statistical-programming environment.Working knowledge of ETL tools such as Pentaho, Informatica, or LavaStormExcellent verbal, written and presentation skillsSuccess at executive presentations as well as influencing using dataSuccessful experience in negotiation and influencing at all levels within the organizationTravel• Regular and expeditious travel throughout the United States and occasionally overseas is required to meet client needs and timetables • Available to be stationed at and work from an out-of-town client site for an extended period of time Other Hitachi Consulting offers excellent benefits and career growth to all employees! Hitachi Consulting is an Equal Opportunity Employer M/F/D/V"}