{"jobID": "2830857702", "jobLocation": "Newark_NJ", "jobTitle": "Strategic Sourcing Manager-Packaging", "companyRating": "3.9", "companyInfo": {"Website": "www.mars.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "118000", "jobDescription": " A mutually rewarding experience.  Work. Realize your ambitions. And realize theres more to being in business than just making a profit. Thats the Mars philosophy. And the opportunity we offer every one of our Associates. An opportunity to take what you do and make it mean more for you, for those around you and for the planet. What you get here is challenging, interesting work. You get the tools you need to do a great job and you get to have the best possible people on your side to help you do it. And at the same time as getting to find ways to do business better today than we did it yesterday and driving a great career, you also get to build a more enlightened business and drive sustainability.  Because its never just about a single person, a single project or a single brand. Its about how you can grab everything thats within your reach here and use it to pursue mutual, long-term gain. Its about having ideas. And ideals. Being prepared to risk failure because the promise of success means well all be a little better off. Its that mix of integrity and ambition that makes Mars such a special place to work. And why working here is always about more than just a job. About Mars, Incorporated Mars is a family-owned business with more than a century of history making diverse products and offering services for people and the pets people love. With almost $35 billion in sales, the company is a global business that produces some of the worlds best-loved brands: M&Ms;®, SNICKERS®, TWIX®, MILKY WAY®, DOVE®, PEDIGREE®, ROYAL CANIN®, WHISKAS®, EXTRA®, ORBIT®, 5, SKITTLES®, UNCLE BENS®, MARS DRINKS and COCOAVIA®. Mars also provides veterinary health services that include BANFIELD® Pet Hospitals, Blue Pearl®, VCA® and Pet Partners. Headquartered in McLean, VA, Mars operates in more than 80 countries. The Mars Five Principles Quality, Responsibility, Mutuality, Efficiency and Freedom inspire its more than 100,000 Associates to create value for all its partners and deliver growth they are proud of every day.Job TitleStrategic Sourcing Manager Packaging Seasonal, Gifting and DisplaysSegment/Business UnitMars Wrigley Confectionery North AmericaFunction/FamilyCommercialCareer BandT2Location/SiteMWC US National OfficePositon Reports toStrategic Sourcing Director PacksDate(MM/DD/YYYY)05/08/2018Job Purpose/OverviewThe Strategic Sourcing Manager is responsible for the strategic procurement of the Seasonal, Gifting and Displays Category for Mars Wrigley Confectionary North America valued in excess of $85 million annually. This role will partner with cross functional stakeholders and suppliers to develop category strategies that deliver value for money, ensure supply chain continuity, measureable cost efficiencies, innovation and world class sourcing support to the organization. This role will also sit on the Seasonal Leadership Team representing the Commercial function. This role will leverage procurement expertise, enterprise wide thinking, risk management and relationship management skills.Key ResponsibilitiesUtilizes strategic sourcing methodology to develop category strategies, source, negotiate contracts and manage suppliers to deliver total lowest cost materials, ensure speed to market, value creation and mitigate the supply risks. Intimately understands the category markets and cost drivers and develops annual budgets for the Region.Collaborate with other Mars segments on synergies to drive optimal value to the organizationProactively works with suppliers to ensure the delivery of continuous improvement and technology which ultimately leads to competitive advantage and working capital reduction opportunities.Proactively works with category sourcing managers to build synergies, leverage suppliers and obtain market intelligence to deliver Seasonal, Gifting and Displays business growth and strategies.Serves as the primary point of contact for cross-functional partners across the region, relative to sourcing activity: Quality, Innovation, Packaging, Productivity, Coman/Copacker Team, Operations Business Team, Finance, Product Supply and Procurement Operational Team.Work closely with productivity teams to identify cost reduction programsWork with cross-segment, cross regional buying teams to develop sustainability strategiesIncrease revenue for supported business by leading the sourcing of innovative packagingDevelop and maintain detailed forecasts to ensure timely supply and minimal material obsolescenceWork together with Quality Assurance and Regulatory to ensure all packaging is in compliance with all requirementsContext and ScopeUtilizes Commercial knowledge to collaborate with internal team and support business growth. Creates appropriate strategies, qualifies and manages supplier performance, and prioritizes and manages competing needs.Job Specifications/Qualifications1. Education & Professional QualificationBachelors degree in business, economics, engineering, supply chain or related disciplineCPM, MS or MBA preferred2. Knowledge/ExperienceMinimum of five years experience in Services, Goods Sourcing or other procurement related experience.Knowledge of P&L; and YOY cost savings metricsProgressive experience utilizing strategic sourcing methodologyIdentify and develop a supply baseForecast price volatility leveraging market indicators (macro and micro), define means to protect the business against the volatility and manage varianceAbility to demonstrate proven results with contract reading, writing and negotiationExperience with Strategic Sourcing Techniques such as managing value stream, lean concepts, contractual alternatives, and buying theoriesStrong project management skills in support of cross functional team activitiesExperience with eSourcing toolsExcellent PC skills: MS Office (Excel, Word, PowerPoint), SAP, OutlookProven communication skills, verbal and writtenMars Leadership CompetenciesDrivePlanningPeer RelationshipsOrganizational AgilityCustomer FocusIntegrity & TrustMars Functional CompetenciesSourcing Strategy DevelopmentCommercial NegotiationSupply Chain ManagementSupplier Quality ManagementStakeholder Engagement Mars is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. If you need assistance or an accommodation during the application process because of a disability, it is available upon request. The company is pleased to provide such assistance, and no applicant will be penalized as a result of such a request."}