{"jobID": "2565691379", "jobLocation": "New_York_NY", "jobTitle": "Project Manager- Construction Risk Managment", "companyRating": null, "companyInfo": {"Website": "www.partneresi.com", "Headquarters": "Torrance, CA", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Partner is seeking a Full Time Construction Risk Management Project Manager to perform all Project Management responsibilities including planning, executing, reviewing, and finalizing projects according to deadlines and within budget.  Construction Risk Management is a comprehensive program of 3rd-party services designed to minimize the risk of construction lending. Construction Risk Management Services include:  Document and Cost Review  Contractor Evaluation  Code Compliance Inspection  Construction Progress Monitoring  Pay Application Review (Funds Control)  Cost to Complete  Pre-Construction Document and Cost Analysis  Budget Reviews ESSENTIAL DUTIES& TASKS · Manage multiple projects concurrently  · Oversee quality of Partner's deliverables throughout the project's life cycle.  · Coordinating the efforts of Partner team members, and at times Partner Associates (PAs) in order to deliver projects according to plan  · Cultivate strong relationships with the Partner team members and the Client in order to successfully deliver a quality product on time  · Conduct occasional inspections  · Occasionally write reports RESPONSIBILITIES · Overall responsibility of all portions of the services/reports being provided, including text and appendices.  · Communicate with client relationship managers (RM) re, Professional Associates (PAs) regarding scope-of-work (SOW) and client expectations throughout the term of the project.  · Effectively communicate project expectations (i.e. Client-specific SOW, templates) to team members and assessors in a timely and clear fashion throughout the course of the project.  · Provide solid recommendations and solutions to RMs and clients, while understanding the assessment’s potential impact on the transaction process.  · Identify and resolve issues with projects.  · Deliver appropriate progress reports (verbally or e-mail), recommendations to the RM and Client.  · Manage client follow-up, questions, and concerns.  · Communicate and coordinate follow-up questions with PAs during review process  · Delegate tasks and responsibilities to appropriate team members.  · Coordinate and respond to client requests for changes in project scope. KNOWLEDGE, SKILLS, AND ABILITIES · Excellent communication skills (internal and external)  · Ability to work on projects concurrently  · Proven ability to successfully deliver a quality product on time  · Exceptional writing skills  · Ability to cultivate strong relationships within a team  · Understand design concepts, construction components and funding/payment processes as it relates to construction projects  · Proficient in project estimating/proposals; report author; quality assurance (QA). QUALIFICATIONS · Bachelor Degree from accredited university in architecture, construction management and or engineering discipline.  · 5-7 years relevant experience in construction or construction related field such as architecture, construction management and/or engineering. PHYSICAL REQUIREMENTS · Must be able to read, write, speak& comprehend English  · Must be able to communicate clearly in person and over the telephone  · Visual acuity adequate to perform job duties, including reading information from printed sources and computer screen  We will consider qualified applicants who have criminal histories in a manner consistent with the law.  Learn more about Partner Engineering and Science, Inc. at www.partneresi.com."}