{"jobID": "2756013111", "jobLocation": "San_Mateo_CA", "jobTitle": "Data Scientist / Machine Learning Engineer - Classification Science", "companyRating": "4.7", "companyInfo": {"Website": "www.slice.com", "Headquarters": "San Mateo, CA", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "128000", "jobDescription": "Slice is looking for a Data Scientist / Machine Learning Engineer to join our Classification Science team.  To create one of the worlds richest commerce data sets and help deliver never-been-seen insights on customer purchase behavior, the Classification Science team is responsible for building systems to semantically classify and normalize billions of products across thousands of retailers. This includes building highly accurate machine learning models, engineering scalable systems, and incorporating crowdsourcing to have continuously improving human-in-the-loop systems. We leverage existing open source technologies and established machine learning approaches, but also innovate and research new techniques.  As a data scientist / machine learning engineer, you will spend a mix of your time researching new solutions for product classification as well as productionizing these solutions to make sure they work at scale. You will work with world-class data scientists who hold MS/PhD degrees from top global schools such as Stanford University, University of Washington, Carnegie Mellon University, and National Taiwan University, and veterans from companies such as Microsoft, AOL, Yahoo!, and Twitter.  Slice was founded by proven entrepreneurs and, as a Rakuten group company, offers the best of both worlds: a start­up environment with the backing of an established global enterprise that is revolutionizing the internet services landscape.  This position will be located in San Mateo or New York. Responsibilities:Research and experiment with different machine learning algorithms and techniques for item classification, product recognition and matching, attribute extractionConduct design and code reviewsProductionize the developed Machine Learning solutionsWork with engineers to make sure the engines scale well on high volumes of dataRequirements:MS/PhD in Computer Science or a related field3+ years of industry experience in data science and machine learning preferredExpertise in Machine LearningStrong CS fundamentals, such as algorithms and data structuresExpertise in PythonProficiency with relational databases such as MySQLExperience with cloud computing stacks such as Amazon Web Services preferredExcellent written and verbal communication skillsEnthusiasm for working hard and having fun in a dynamic environmentWho we are: Slice is online shopping, smarter. Slice is transforming online shopping and retail by unveiling never-before-seen digital commerce data via its e-commerce intelligence products, APIs, and consumer applications.  Slice operates a market research company, Slice Intelligence. With the worlds largest panel of online shoppers, only Slice offers vital intelligence that is the pulse of the digital economyactual purchases directly from online shoppers, on any device or location, reported daily. Learn more about Slice Intelligence at www.sliceintelligence.com and on twitter @SliceIntel.  Slice is an independent, wholly-owned subsidiary of Rakuten. Slice was founded by proven entrepreneurs and offers the best of both worlds: a start-up with the backing of an established global company that is revolutionizing the internet services landscape, Rakuten.  Slice was incubated as a research project at Stanford, where the best and brightest minds in machine learning set forth on how to extract business value from the vast amount of unstructured purchase data in inboxes. When we took that project out of the lab and to the market, we retained the culture of excellence and personal growth, with respect for a healthy work-life balance. Because we love what we do and care about the people we work with. Values:Start­Up Environment Work is fun, roles are challenging. Always prioritize the companys success over egos. We innovate, take risks, move quickly and fail fast.Hire smart and develop talent ­ We are entrepreneurial self-starters who ignite/inspire growth on an individual, team and company level.Say it like it is We create a transparent, respectful environment within our company and for our users and partners. We give and receive prompt honest feedback.Get it done ­ We measure our success based on results rather than activity. We use the 80/20 rule. ­Perfect is the enemy of good.Customer success is our own We treat our customers and partners with respect. We are easy to do business with.Benefits & Perks:Competitive compensation package including base salary, bonus and Rakuten stockMedical, dental, vision and basic life insuranceFlexible Spending Account (health care and dependent day care)401K planUnlimited Paid Time OffPaid Parental Leave: Maternity (up to 22 weeks off / 16 weeks paid) and Paternity (up to 8 paid weeks off)Free Caltrain Go Pass for unlimited train travelOnsite secured bike storage and $20/month bike reimbursement through WageWorks$10,000 / $5,000 employee referral program$2,000 towards professional development (annually)Healthy and Fun Work Environment at our San Mateo, CA headquarters:Daily catered breakfast and lunchVarious drinks and snacksPing-pong table, air hockey table, corn hole and board gamesAdjustable sit/stand desksFully-equipped nursing mom rooms with hospital grade pumps and fridgesOnsite gym with showers and lockersPartnership with YMCA for discounted membership. YMCA is 2 blocks from the officeCompany social and volunteer events"}