{"jobID": "2662395525", "jobLocation": "San_Diego_CA", "jobTitle": "Research Administration Business Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.vivantech.com", "Headquarters": "San Diego, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "64000", "jobDescription": " Research Administration Business AnalystThis position is aligned with a team of cross-functional Business Analysts who enjoy a high degree of influence in all areas of a rapidly growing business. Specifically, we partner with the marketing team in demonstrating and selling the Streamlyne Research Administration software to research institutions of all types. We are responsible for coordinating and executing Streamlyne Research Administration software implementations. We work together with linked teams to define the short- and long-term development paths for our product suite. We offer modules to support Pre-Award, S2S, Award, Subaward, Negotiations, Intellectual Property, IRB, IACUC, Conflict of Interest, and Publications.A fully trained member of this team could be expected to complete:  Marketing Duties: Completing RFP responses within areas of expertise, and/or coordinating the assignment and management of RFP tasks with teammates.Executing software demonstrations within his/her area of expertise and/or coordinating participation from other analysts in demonstrations as required.Traveling to onsite demonstrations as requested (usually with other team members), managing onsite technology, and managing prospect relationships and follow-up.Coordinating prospect software trials, and serving as point of contact for related communication.Providing input into scope analysis/solution architecture for contract development as requested.Traveling to industry conferences and events to foster industry relationships and develop leads.Presenting/conducting sessions at industry conferences and events wherever relevant. Implementation Duties: Leading classroom or remote sessions to train clients on application functionality.Leading onsite or remote analysis sessions with clients to guide them through configuration and customization decisions in alignment with their business requirements.Be able to successfully distinguish user requests from the underlying true needs.Creating and maintaining project artifacts, such as configuration documents, business requirements documents, and functional specifications.Identifying, delegating/executing, and tracking the results of tasks that arise out of client discussions, to include configuration tasks, testing tasks, data mapping tasks, documenting tasks, general problem solving, etc., in alignment with a defined project schedule.Responsibilities Cont. Product Development Duties: Participating in the development of the product roadmap, requirements and specification documentation.Working with development teams to translate product requirements into technical requirements.Analyzing and critically evaluating industry product information gathered from multiple internal and external sources, reconcile findings, and decompose high-level information into product details for future product enhancements.Working with quality assurance personnel to ensure product adequately meets all functional needs defined in scope of any given project. This position requires the successful candidate to: Be driven to acquire and internalize new information quickly.Possess a natural aptitude for software-supported processes and design, to include an appreciation for formal logic and a genuine love of problem-solving.Feel at home speaking in front of small and large groups of people.Coordinate assigned work with other team members, and follow up on delegated items.Possess an intrinsic passion to pursue assigned work to the highest personal ability and integrity.Be kind, flexible, and able to maintain productivity in the face of ambiguity.Appreciate a fast-paced environment in which no two days are the same.Fit into a group of highly integrated, highly communicative, fundamentally unpolitical and tightly knit but geographically dispersed team.Be successful at analyzing personal progress, project progress, potential risk areas, and communicating that analysis to team members and management.Be effective at working remotely, generally from home, serving primarily East Coast business hours.Be able to work at a pace defined required for businesses to be successfulQualificationsBachelor’s degree, or 7 + years’ experience in Business Analysis.5 + years’ experience in Research Administration and/or Research Compliance.Active participation in at least one full-lifecycle implementation project.Superior written and oral communication skills.Exceptional presentation and meeting facilitation skills.Proficient in MS Project, MS Word, MS Visio, and MS PowerPoint.Hands on experience with a research administration system.Experience with and/or demonstrated ability in working as part of a geographically dispersed project team.First Consideration Will Be Given To Candidates with:Hands on Experience with the Streamlyne Award / Kuali Coeus Award modules and RA Award processes and institutional requirements..Hands on experience with MIT Coeus, Kuali Coeus, Cayuse SP, InfoEd or Click Commerce.Hands on experience in Clinical Trials management or Biosafety processes. Job Type: Full-time  Required education: Bachelor’s Required experience: Business Analysis: 7 years Research Administration and/or Research Compliance: 5 yearsDescriptionResponsibilitiesResponsibilities Cont.QualificationsPriorityPlease send your resume and cover letter to careers@streamlyne.org along with the title of the position that you are applying for."}