{"jobID": "2451794303", "jobLocation": "New_York_NY", "jobTitle": "Sales Development Representative", "companyRating": null, "companyInfo": {"Website": "www.brightedge.com", "Headquarters": "Foster City, CA", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "As the industry pioneer behind Content Performance Marketing, BrightEdge has thoroughly redefined the concept of search engine optimization by developing an award-winning platform that precisely measures and optimizes marketing content across online channels. Our cloud-based platform is powered by big data analysis that allows our customers to plan, optimize, and measure campaigns based on real-time content performance. BrightEdge has emerged as the leading international provider of cloud-based SEO Enterprise solutions due to its dynamic and results oriented entrepreneurial culture.BrightEdge is continuing to scale a world-class Sales Development Team to help expand our customer portfolio. Sales Development Representatives are responsible for sourcing, qualifying, and setting new customers demos for the Senior Sales Team to close.As a Sales Development Representative at BrightEdge, you will develop search engine marketing knowledge through mentorship and our sales training program. All of our SDRs are on a defined promotional track to an Account Executive position.Core Responsibilities Develop and execute on cold calling and email campaign strategies to qualify potential customers as a match for our SaaS technologyQualify outbound opportunities and develop a strong demo pipeline for Account Executives via phone and email communicationsMeet weekly and monthly qualified opportunity goals to ensure company revenue objectives are metComplete advanced sales and SEO certificationsEmpower and assist leading Fortune 1000 companies with SEO technologyLearn and maintain in-depth knowledge of the BrightEdge technology, industry trends, and competition What it Takes to be Successful Bachelor's degree with a strong academic background requiredPassion for technology and possess a high level of integrityStrong communication, analytic, and listening skills, with a positive approachSelf-starter and hardworking, with a track record of success and drive for achievementSales training, pre-call planning, or salesforce.com software experience is a plus Benefits & Perks Highly competitive salary and stock optionsRecognition of accomplishments at the Annual Presidents Club for overachieversAnnual trip for all sales team members to the BrightEdge Sales Kickoff (SKO)Two-week sales and technology trainingFast paced, collaborative, and fun sales culture 401k and Financial AdvisingFriday Company LunchesKitchens with free snacks and drinksAbout BrightEdgeBrightEdge Technologies, Inc. (www.BrightEdge.com) is privately held and the leader in cloud-based SEO and Content Performance Marketing solutions for over 1200 enterprise, corporate, and agency customers and 9000 brands. The BrightEdge platform boosts their marketing performance by streamlining, automating, and integrating search optimization, social marketing, and content performance management capabilities for its customers. Advanced BrightEdge technology delivers visibility, executable recommendations, competitive insights, and dynamic performance metrics. With the largest technology, sales, and customer success teams in our industry, we help customers innovate and execute to achieve superior marketing performance."}