{"jobID": "2757515556", "jobLocation": "San_Jose_CA", "jobTitle": "Account Manager", "companyRating": null, "companyInfo": {"Website": "www.culvercareers.com", "Headquarters": "San Diego, CA", "Size": "51 to 200 employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " I am recruiting for a very unique role in San Jose that involves managing current clients and generating renewals and upselling opportunities.  My client is looking for a business professional that is interested in long-term career growth, who is s self-starter and possess a strong entrepreneurial spirit. My client offers significant opportunities for professional growth, the last two candidates we placed in this role have been extremely successful and have seen multiple promotions! One now runs the entire region and you would have the opportunity to meet with both of them in the interview process. Additional information below:  This role offers the ability to be both in an office as well as out and interfacing with clients (best of both worlds!)  They offer a competitive base salary + commission to make $70K+ year one/$100K+ year 2  $500 a month for an expense account (untaxed)  Voted #1 company by Glassdoor to get people promoted  Continual Fortune 500 style training (paid) including product and sales training, new account generation skills, sales presentation skills, and much more!  Fun culture (Annual awards party in Miami every year, happy hours, ball games, etc.)  Contests quarterly & annually that total $250K a year (we placed someone who was the #1 Rep and he won $30K and a new car)  Dental and Medical benefits as well as a 401K and laptop  If this is something you would like to learn more about please let me know. The firsts step is a quick call with myself and I only need about 10 minutes.  I look forward to hearing from you. IND 123"}