{"jobID": "2823071757", "jobLocation": "Pasadena_CA", "jobTitle": "Management Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.usgs.gov", "Headquarters": "Reston, VA", "Size": "5001 to 10000 employees", "Founded": " 1879", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "59000", "jobDescription": " Duties Help  Help  Duties  Summary *Are you an Administrative professional looking for a position in the Federal workforce? *Do you have a passion for providing customer service? *Do you want to be part of an important aspect of the Federal Government, helping with exciting and groundbreaking initiatives? If you answered \"yes\" to these questions, then this is the job for you! Come join the USGS and start doing the job you've always dreamed of! Why Is It Great To Work For The USGS? Embark on an exciting future! From the peaks of the highest mountains to the depths of the deepest seas, the U.S. Geological Survey has career opportunities that make a difference in both the lives of others and in the environment. Would you like to join the more than 10,000 scientists, technicians, and support staff of the USGS who are working in more than 400 locations throughout the United States? Apply today! As the Nation's largest water, earth, and biological science and civilian mapping agency, the U.S. Geological Survey (USGS) collects, monitors, analyzes, and provides scientific understanding about natural resource conditions, issues, and problems. The diversity of our scientific expertise enables us to carry out large-scale, multi-disciplinary investigations and provide impartial, timely, and relevant scientific information to resource managers, planners, and other customers related to: the health of our ecosystems and environment; natural hazards that threaten us; natural resources we rely on, and; the impact of climate and land-use changes. For more information about the USGS please visit http://www.usgs.gov What General Information Do I Need To Know About This Position? Open to all U.S. citizens: SAC-2018-0268  There is one vacancy however, this announcement may be used to fill additional vacancies if they become available.Learn more about this agencyResponsibilities As a Management Analyst within the Earthquake Science Center, some of your specific duties will include:Serves as Office Manager and the Center’s point of contact for all lease negotiations and the liaison and point of contact with CalTech on all facility cooperative agreement issues.Provides recommendation, advice and counsel to management on operational and facility policies.Using fundamental management program analysis techniques and procedures, the incumbent analyzes and evaluates Center activities, identifies and recommends improvements in management programs to promote economy, maximize resource utilization, and enhance the efficiency and effectiveness of operations.Establishes, clarifies, and disseminates information concerning management services.Identifies problems, issues, inefficient practices, areas for improvement, and resource needs."}