{"jobID": "2779263073", "jobLocation": "Boston_MA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.bevi.co", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Each Bevi machine is internet-connected, and collects real-time data on usage of various beverages, customer preferences, machine performance, and more. The data we collect fuels our operations, letting us know exactly when to replace ingredients, provide service and maintenance, etc. Our models are still quite rudimentary, and there's so much more we could be doing!  The purpose of this job is to establish Bevi's data science function, and integrate optimization models into our day-to-day business so that each month, we're able to provide a better service more efficiently than ever before. Examples of probably projects include: Building models to provide our operations team with guidelines on which flavors/ingredients to place in each machine in order to maximize usage and customer satisfaction.Integrating homegrown optimization models with software for supply chain management.Automating the collection of data from across systems (Salesforce for sales & account management, Zendesk for customer service, Netsuite for logistics, etc.), analyzing results on an ongoing basis, and making recommendations. The purpose of this role will be to automate data collection, reporting, and even subsequent business guidelines. From the start, we will try to minimize one-off, ad-hoc analyses, and instead focus on building the foundations for automating business decisions. The more we can automate recommendations (e.g. \"add lemon to this particular machine,\" \"order 50 more cartridges of cucumber concentrate for Seattle\"), the better. Requirements We're open to various levels of experience, as long as you're able to jump in and add value quickly. In particular, we're looking for the following: The ability to convey data both visually and verbally in a compelling way, and tell the story of the data (i.e. explain the business implications).Experience building optimization models and predictive models using time series data, and ideally integrating those models with other software.At a minimum, intermediate programming skills. (Python is preferred.)Experience collaborating with a software development team.The ability to be scrappy and practical, and function in an environment where there’s never enough data, and where it’s never clean enough. Capable of combining quantitative analysis with qualitative insights to make good decisions even when quantitative data is lacking.Experience with modern data analysis and visualization tools like Tableau is a plus.Experience with logistics or supply chain management software is a plus.BenefitsThe opportunity to tangibly impact the environment every day by replacing bottled & canned beverages with Bevi.Company pays 95% of medical, dental, and vision insurance at 95%15 days PTO and 9 company holidaysOpen workspace in Charlestown (5-minute walk from the orange line T) with visiting furry friends, great snacks, and, of course, unlimited beverages."}