{"jobID": "2796124516", "jobLocation": "San_Jose_CA", "jobTitle": "Investments Operations Systems Engineer", "companyRating": "3.5", "companyInfo": {"Website": "www.fishercareers.com", "Headquarters": "Camas, WA", "Size": "1001 to 5000 employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "96000", "jobDescription": " OverviewFisher Investments is a privately-held investment management firm who manages portfolios for high-net-worth private clients and some of the world's preeminent institutions. We are now searching for a highly talented Investment Operations Systems Engineer to join our team in San Mateo, CA (SF Bay Area) or Camas, WA (Portland Metro Area) in a Contract-to-hire assignment. We believe in providing our employees with the tools, support, and training they need to thrive within our company and in their professional career. We have invested a lot of resources and time into our IT department, and we are dedicated to securing the most advanced technologies available. Responsibilities: •Install and Configure Microsoft Windows Server 2012 R2 and 2016•Troubleshoot and debug systems end-to-end•Manage technical support relationship with our financial software vendors•Train, mentor and lead junior system support team members•Utilizes design skills to define Technical Design Specifications for complex and high impact projects•Create, train and manage all necessary documentation including but not limited to system standards, run-books, etc.•Take ownership of new and/or existing environments including planning upgrades, staying on top of EOL dates and documenting inter-dependencies•Research software solutions to meet current business needs or to proactively create efficiencies•Participate in 24x7 on-call rotation Qualifications:•Experience providing advanced level OS support for Microsoft Windows Server 2012 R2 and 2016•Experience working in a banking, investment management or investment research firm•Experience supporting portfolio management, compliance, or trading infrastructures•Expert knowledge of Financial Services systems such as Order Management Systems (OMS), FIX, TNS, market data providers and crossing systems•Understanding of Transaction Network Services for financial data communications•Understanding of controlled private networks which includes extranets and DMZs•5+ yrs. experience in supporting an enterprise class infrastructure•Strong analytical capabilities•Intermediate to advanced level experience using PowerShell and task automation•Ability to participate in a team environment•Strong verbal and written communication skills•Ability to communicate with all levels of management and end users with varying levels of technical expertise•Self-starter who displays a sense of urgency and drives issues through to completion•Excellent system design skills•Bachelor’s degree in MIS, computer science, math, or other related science field (or equivalent) Benefits:•Competitive compensation package•Full medical benefits•Dental/vision plan•401k•Generous paid-time-off  FISHER INVESTMENTS IS AN EQUAL OPPORTUNITY EMPLOYER  #DI"}