{"jobID": "2641598677", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.yelp.com", "Headquarters": "San Francisco, CA", "Size": "5001 to 10000 employees", "Founded": " 2004", "Type": " Company - Public (YELP) ", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Google"}, "estimatedSalary": "126000", "jobDescription": "At Yelp, it’s our mission to connect people with great local businesses. Yelp’s unique dataset contains billions of interactions between users and local business around the globe, from a user reviewing a neighborhood coffee shop to requesting a repair quote with a photo of a leaky faucet. Data Scientists at Yelp work to make sense of these interactions to deliver impactful analyses and products to our users, business partners and the general public.Who We Are:The Data Science team performs analyses, builds models, and designs experiments that directly impact Yelp’s business and users. Our centralized team is the most wide-ranging consumer of data at Yelp, adept at tasks from modeling content growth and user behavior to sharing insights about the health of local economies. With varied backgrounds and expertise, we strive for learning and growth in a collaborative environment.We Are Looking For: BA/BS degree and 3+ years of experience as a data scientist, or MS/PhD and 2+ years of industry experience in a quantitative role.Fluency with SQL and Python or R for data analysis.Solid understanding of statistical inference, experimental design and analysis.Enthusiasm for clean code and sharing reproducible results.Communication skills to work with partners on engineering, product and business teams.An eye for great data visualization with Matplotlib, Plotly, ggplot, or Tableau.If you don't have 2+ years of industry experience in a quantitative role, please take a look at our College Data Scientist roles instead!What You Will Do:"}