{"jobID": "1154250959", "jobLocation": "Brea_CA", "jobTitle": "Sr. Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.lat36.com", "Headquarters": "Franklin, TN", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " TEKsystems, Collabera"}, "estimatedSalary": null, "jobDescription": " Sr. Data AnalystJob  code: 10629Job Category: Data AnalystCity: BreaJob Description:Description: Very strong analytical and problem solving skills within relational and numeric computations. Manage and develop a sophisticated Microsoft Access database utilized to edit order data to appropriately pay sales representatives incentive compensation.  Provide analytical and information systems support to the department by gathering, documenting processes and analyzing sales information to be used to process incentive compensation on a monthly basis.  The candidate will process ad-hoc queries to analyze sales operation data and create reporting using various business tools; (Salesforce.com, Business Objects, OBI, SAP) Serve as a system administrator for the Xactly Incent software utilized to process Incentive Compensation.  Manage the loading of quotas, positions, territories, people movements, orders, commission rules and IC Plans.  Provide analytical and information systems support to the department(s) by gathering, documenting processes and analyzing data. The candidate will problem solve requests and evaluate global work streams to provide support in best practices and technology driven solutions. Candidate must be proficient in understanding relational databases, technically proficient to provide solutions outside the norm.  45% of the job will be scoped to support Incentive Compensation (processing, problem solving, administration)  45% of the job will be scoped to support global HR systems support. (consulting, executing, implementing technical solutions.)  10% of the job will be scoped to support ad-hoc requests.  Position requires a BA or BS in Business Administration, Finance, or IT, 2-3 years of experience with strong financial/operational systems (someone with this combination of skills will likely have at least 5+ years of experience).  The candidate must be proficient in Microsoft Access and Excel. The candidate must also possess excellent analytical and communication skills.  Knowledge of SDLC (Systems Development Life Cycle), PMLC (Project Management Life Cycle), Lean Six-Sigma is a plus. The job schedule is flexible as it may require after hours work. Responsibilities:  Role requires running preset processes already coded to the application. Being able to understand data flow and logic will be critical in this area of success. VBA and SQL proficiency is a very strong plus as this relates to some functions/formulas inherent to Xactly Incent as well as some internal programs developed within the department.  Other programming languages such as C#, Java, .net is a plus but not necessary.  a. Xactly Administration - Running preset processes  b. Xactly Administration - Implementing and adjusting Plans, Rules, Formula, Rates, Quota, Positions  c. Xactly Administration - Review Reports and Statements  d. Xactly Administration - Importing/Exporting Data  (2-3yrs) Proficiency: Microsoft Access 2003-2010, VBA, SQL (Language not necessary MSSQL Server itself)  b. Run preset processes within developed Multiple Access Programs (Procedure Driven).  c. Assist in maintaining developed Access Programs (Updating: VBA, Macros, Modules, Classes, Tables, Queries).  d. Assist in development of new IC, HR Access projects (VBA, Macros, Modules, Classes, Tables, Queries, Form Design, Mapping).  Proficiency: Excel (Macros not needed but recommended)  a. candidate will at a minimum be able to provide organized data sets, pivots and understand basic excel functions and formulas. OBI XI would be a plus  a. Pulling reports, Oracle Extracts, Analytics b. Have an understanding of universe and objects a plus Yashica Khurana | Latitude 36, Inc | Technical Recruiter M: 510-468-8447 | D: 510-509-3425| E: ykhurana@lat36.com|  W: www.Lat36.com |Connect: www.linkedin.com/pub/yashica-khurana/5a/503/b45 Connect with us on: Like us on Facebook  Follow us on Linked In  Tweet us on Twitter About us: Latitude 36 is a full-service staffing services firm, specializing in recruiting for Information Technology and Healthcare positions. Founded in 2000, Latitude 36 is a WBENC certified woman-owned company. Our clients include Fortune 1000, large (500MM+) privately-held companies and non-profit corporations. Latitude 36’s core service is staffing. Through time-tested recruiting programs, we offer our customers the highest-caliber, pre-screened resources to ensure our customers meet business and project objectives."}