{"jobID": "2821507887", "jobLocation": "San_Jose_CA", "jobTitle": "Mobile Sales Associate", "companyRating": "3.5", "companyInfo": {"Website": "www.mobileonellc.com", "Headquarters": "San Diego, CA", "Size": "1001 to 5000 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "11", "jobDescription": "BE BOLD. MobileOne, a T-Mobile Premium Retailer, wants you to be our next Mobile Associate! Join our team of dynamic, self-motivated sales representatives with a desire to meet and exceed sales goals.  Its the time to be present. To be fulfilled. To be Bold.  As a Mobile Associate, youll be responsible for:  Obtaining or receiving merchandise, totaling bills, accepting payments and making change for customers in retail store.  Perform all required opening and closing duties.  Meet and exceed monthly revenue and profit targets.  Research and memorize T-Mobiles products and services lineup.  Support your team, keep the store looking its best, and make sure your knowledge of T-Mobile technology is up to date.  Consistently act in the best interest of the company. SET THE TONE. A true Mobile Associate is a people-person just as much as a tech-person, with a competitive spirit and infectious energy. You can work the floor with a breezy confidence, elevating the customer experience. We want you to make the first impression. We want you to set the tone.  As a Mobile Associate, youll be responsible to follow these customer regulations:  Help Customers that come into the store location who are browsing and/or ready to make a purchase.  Approach with confidence and a smile, and go to work, assessing needs and concerns for customers by building a genuine relationship with them.  Build trust with customers by answering their questions, educating, and offering solutions that pave the way for a potential T-Mobile sale.  When its time to make the sale, youre an expert at finding just the right plan for your customer, and then making sure theyre primed for success throughout the customer on-boarding process  Right-fit customers into the correct phone and rate plan package. FIND YOUR PATH. All Mobile Associates have the opportunity to build a pathway for their future success and become a Mobile Experta stores lead tech guruand continue to thrive in a company that you love. Now is the time to demonstrate expertise with  current and future products and services.  That means longevity. Stability. Growth. Fulfillment.  And, that means success.  In order to be a Mobile Associate, you need to have the following:  Previous customer service or sales experience. Wireless experience is not needed.  A passion for technology and the ability to smoothly find your way around a computer.  Instinctual problem-solving skills.  Excellent written and verbal communication skills.  Legal authorization to work in the United States.  Pass a pre-employment background check.  Flexibility in schedule and work varied shifts, 7 days per week, which may include evenings, weekends, and holidays.  Bilingual is a plus.  A high-school diploma or GED and be at least 18 years of age. Please note this job description is not designed to cover or contain a comprehensive listing responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice. *WORKING CONDITIONS: The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.  This is largely a standing role; however, some filing is required. This would require the ability to lift files, open filing cabinets and bending or standing on a stool as necessary.  Travel is required sometimes for training purposes.  While performing the duties of this job, the employee is frequently exposed to fumes or airborne particles, moving mechanical parts and vibration. The noise level in the work environment can be loud."}