{"jobID": "2795972160", "jobLocation": "New_York_NY", "jobTitle": "Senior UI/UX Designer", "companyRating": null, "companyInfo": {"Website": "www.konradgroup.com", "Headquarters": "Toronto, Canada", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Konrad Group Konrad Group is a next generation digital consultancy. We are dedicated to solving complex business problems for our global clients with creative and forward-thinking solutions. Our employees enjoy a culture built on innovation and a commitment to creating best-in-class digital products in use by hundreds of millions of consumers around the world. We hire exceptionally smart, analytical, and hard working people who are lifelong learners. Senior Experience Designer (UI/UX) As a Senior Experience Designer (UI/UX) you will play a key role in leading large-scale digital innovation projects for consumer brands and enterprise clients. You will bridge the gap between design, business, and technology to ship world-class digital experiences for leading companies and global brands. ResponsibilitiesLead design research, ideation and creation of digital interfaces across multiple platforms and devicesFacilitate discussions and design thinking / feedback sessions with clients and project stakeholdersEnsure successful delivery of multiple projects by managing design deliverables and timelinesMentor designers by providing clear design guidance and actionable suggestionsInspire all members of the creative team by fostering a culture of constant learning and professional growthSuccessful candidates will haveMinimum of 3 years experience in leading UI and UX designSolid understanding of creating user-centered experiences with complex requirementsDriven to innovate and lead creative workflows and processes for the teamExcellent communication and presentation skillsProficient knowledge of Sketch, Adobe Creative Suite and prototyping toolsExpertise in motion design and web or mobile development is a bonusPerks and BenefitsFlexible Vacation PolicyHealth & Wellness ProgramsCulture of Learning & DevelopmentFully-Stocked Kitchens & LoungesNew Shiny Device UpgradesMonthly Socials & Team OutingsBonus Points: Have you taken any courses at BrainStation? A lot of our design and development best practices and processes are taught during our courses - make sure to highlight this experience in your cover letter if you have! Konrad Group is committed to maintaining a diverse work environment and is proud to be an equal opportunity employer. All qualified applicants, regardless of race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status will receive consideration for employment. If you have any accessibility requirements or concerns regarding the hiring process or employment with us, please notify us so we can provide suitable accommodation. While we sincerely appreciate all applications, only those candidates selected for an interview will be contacted."}