{"jobID": "2802118472", "jobLocation": "Los_Angeles_CA", "jobTitle": "Investment Banking Analyst Intern with Alpha Capital Holding", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The position listed below is not with LA Interviews but with Alpha Capital Holdings Inc  LA Interviews is a private organization that works in collaboration with government agencies to promote emerging careers. Our goal is to connect you with supportive resources to supplement your skills in order to attain your dream career. Job Description Mandarin Required, Investment Banking Intern  Alpha Capital Corporation is seeking a number of mandarin speaking investment banking interns. We work extensively with Chinese companies on the purchasing American companies. Your work will include assisting the principals on specific projects such as valuation, building financial models, writing teasers and pitchbooks, valuation and identifying investors. Recent client work has included a sale of a technology company, an acquisition by Foxconn in Taiwan, a merger of two social media companies, advising a company with the first blood test for breast cancer and a sell side assignment of a large financial service company. We are currently working on an acquisition in the Internet of Things.  College credit internship provided. Our work qualifies for OPT and CPT for international students. Admission to the program requires a demonstration of your knowledge in investment banking.  In addition, and just as importantly, you will intensively train under the personal mentorship of a Harvard trained senior banker with 25 years experience. Our students come from Ivy Schools and select non-target schools. You will become fluent in valuation and modeling including comparable analysis and DCF, IPO's plus leveraged buyout (LBO) valuation and full merger modeling. You will also be involved pitch book presentations and equity research.  You will have something important and respected to put on your resume. This is the first step towards a real career in investment banking. You will receive personal attention and mentorship which is crucial in building a career and the perception of your resume. You will be able to assist in real deals at any firm. Our interns go on to positions with many prestigious firms.  Students who have worked with us have gone onto bulge bracket firms such as Goldman, Sachs (5), Deutsche Bank (5), Morgan Stanley Capital Markets, Barclays, Warburg, and many other large firms. Also, students have also achieved positions with middle-market firms. Send your resume and cover letter. We look forward to hearing from you. Thank you. Hiring Organization: Alpha Capital Holdings, Inc.  Company DescriptionAlpha Capital Holdings, Inc. is a well-regarded financial advisor to corporations with Fortune 500 companies. Since 1995, we have participated on the sell-side (primarily mergers and acquisitions), and raising capital. We currently focus on buy-side assignments for multi-billion Chinese companies seeking acquisitions in the Unites States. We usually form WeChat groups within our company to work on assignments. Our former interns go onto Bulge bracket firms such as Goldman, Morgan, Deutsche Bank, Barclays and others. They also go to elite boutiques.  Apply"}