{"jobID": "2442670065", "jobLocation": "Milpitas_CA", "jobTitle": "Principal Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "jobs.wdc.com", "Headquarters": "San Jose, CA", "Size": "10000+ employees", "Founded": " 1970", "Type": " Company - Public (WDC) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Seagate Technology, Toshiba"}, "estimatedSalary": "100000", "jobDescription": "As part of the Client Solutions group at Western Digital you will be working with a talented team designing the next generation personal cloud solutions. Logging and analytics are the core eco-system which we are investing heavily to look at issues with all the teams proactively both during development and production.In the role of a Principal Data Analyst you will be the lead of all the analytics across the cloud, client and device eco-system, looking at metrics and understanding data to make it actionable across teams. Data driven approach to look at customer issues and user behavior patterns to better predict and analyze on field issues. Should have the drive to lead changes across teams with minimal supervision.Responsibilities:Trends data and designs data analysis strategies to identify potential opportunities for quality & performance enhancements for My Cloud eco systemDesign and develop real-time analytics solutions using industry standard technologiesPresents data in an understandable manner, which may include graphs, charts, etc.Develop queries and dashboards for logging and analytics for facilitating teams across the eco-systemEnable data-driven decision-making by collecting, transforming and visualizing dataLead by example, demonstrating best practices for performance testing, capacity planning, documentation, monitoring, alerting and incident responseLook at opportunities to optimize logging to optimize costs and provide valueHave the mindset to proactively look for issues and address them with teams for better Quality of Service #LI-BJ1"}