{"jobID": "2805814366", "jobLocation": "Palo_Alto_CA", "jobTitle": "Mortgage Loan Officer", "companyRating": null, "companyInfo": {"Website": "www.firsttechfed.com", "Headquarters": "Mountain View, CA", "Size": "1001 to 5000 employees", "Founded": " 1952", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " First Tech is the 7th largest CU in the Country with over $10 billion in assets, 450,000 members and ranked 4th for Mortgage Production. We are currently hiring talented Mortgage Loan Officers who are able to develop and maintain a quality network of business relationships that serves as a source of referrals for new mortgage opportunities. We offer innovative and competitive loan products and a winning team to help you succeed. We will also provide opportunities for you to engage with our current member base as well as our Select Employer Groups (SEG’s), such as Nike, Intel, Microsoft, and many others.  You will be responsible for interviewing new and existing members to determine their loan needs and advising those borrowers of appropriate products, terms, and pricing, while gathering any additional required information. It will be necessary to generate complete mortgage applications, ensuring appropriate procedures and policies are followed while meeting the sales goals and objectives. As a mortgage loan officer your primarily responsibilities includeAspire to deliver world class service to our membersAchieve Sales and referral goals by developing a positive member experienceProactively seek ways to develop and expand member relationships in order to contribute to credit union success.Provide guidance to our continual stream of leads coming through our network(s)Desire to maximize personal productivity through attention to detail, self-motivation, and adaptability to achieve CU and personal goalsActively participate in opportunities to expand your knowledge Essential SkillsMinimum 1-3 years Mortgage Sales ExperienceStrong sense of responsibility for completing work quickly and accuratelyDetail orientation with efficient focus on work activitiesBasic computer skillsAbility to work independently with minimal supervisionWorking knowledge of Conventional, FNMA, FHA and VA programLocation: Palo Alto Branch First Tech is not currently offering Visa sponsorship or transfersMP123This position requires compliance with the S.A.F.E. Mortgage Licensing Act of 2008 and all related regulations. Ongoing employment with First Tech Federal Credit Union is contingent upon meeting all such requirements, including acceptable background investigation results. The S.A.F.E. registration is required at the time of employment. The Nationwide Mortgage Licensing System (NMLS) web site (mortgage.nationwidelicensingsystem.org) provides the questions and registration required for employment in this position.  I acknowledge that if hired by the company, employment is on an at-will basis. This means the company is free to terminate my employment at any time, with or without cause or advance notice. Similarly, I am free to terminate my employment with the company at any time for any reason. I agree to conform to the rules and regulations of the company, and I understand that the company has complete discretion to modify such rules and regulations at any time, except that it will not modify its policy of employment at-will."}