{"jobID": "2794906941", "jobLocation": "Santa_Clara_CA", "jobTitle": "Data Analytics Intern", "companyRating": null, "companyInfo": {"Website": "www.hitachipowersystems.us", "Headquarters": "Basking Ridge, NJ", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Data Analytics InternCompany: Hitachi America, Ltd. Division: R&D;/Big Data Lab/Energy Solutions Team Location: Santa Clara, CA Status: Intern, Full-Time Duration: May-August 2018 Summary Hitachi America, Ltd. (http://www.hitachi-america.us/) has openings  for Summer Interns in the Big Data Laboratory located in Silicon Valley. The  mission of this laboratory is to help create new and innovative solutions in  big data and advanced analytics. The laboratory focuses on research, technology  innovation, proof-of-concept activities, technical marketing and business  development for novel big data solutions, leveraging Hitachi’s technologies,  reinforcing Hitachi’s messaging around big data, and establishing Hitachi as a  leader in big data.  We are seeking an Intern to work with our Energy Solutions Team. The Data  Analytics Intern will work on developing innovative data analytics frameworks  under guidance of senior researchers, he/she will advance selective data  analytics modules using state-of-art machine learning and artificial  intelligence methods and create models of demand and renewable generations  within the Energy IoT environment and benchmark performance against industry common  practices. You will work in a team environment with significant interaction  with Researchers.  More information about the research done at the Big Data Laboratory can  be found at:  http://www.hitachi-america.us/rd/about_us/bdl/  More information about Hitachi IoT technology in Smart Industry can be  found at:  https://www.hitachivantara.com/en-us/solutions/iot-insights/industrial-iot.html Qualifications: ·  A Ph.D  student pursuing a degree in Computer Science, Computer Engineering, Industrial  Engineering, Electrical Engineering or any other related degree; especially  with a focus on analytics.  ·  Previous  research related to Energy & Demand forecasts and/or time series short term  forecasts/data prediction is required.  ·  Expert knowledge of power and energy analytics,  nature of electrical loads is preferred.  ·  Proficiency in Python, R or MATLAB is required.  ·  Hands on experience with state-of-art ML  libraries is required.  ·  Familiar with popular database software, i.e.  MySQL, Postgres etc. is preferred.  ·  In addition, the successful candidate  will possess the following behavioral characteristics:  o  Must have strong problem-solving  skills  o  Must be highly-motivated team player  who can thrive in a dynamic startup-like environment  o  Must have excellent communication  skills, both written and verbal EOE-Females/Minorities/Protected  Veterans/Individuals with Disabilities"}