{"jobID": "2658414283", "jobLocation": "Redmond_WA", "jobTitle": "SQL Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.fortek.com", "Headquarters": "Cherry Hill, NJ", "Size": "51 to 200 employees", "Founded": " 1987", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "SQL Data Analyst Redmond, Washington - United StatesPrimary SkillsHadoop,SSAS,Big data,MDX,DAXTax TermsC2C,W-2,1099OverviewJob descriptionPosition - SQL Data AnalystLocation - Redmond WA – Local Candidates only – In person interview requiredDuration 6 MonthVisa Needed US citizen and GC holder. Should have strong knowledge with SSAS / MDX/ DAXBig data experience required (COSMOS or HADOOP). Bachelor’s degree in Computer Science, Engineering, Business or related field and 8+ years experience in the following:  - Business Intelligence development on the Microsoft Platform (SSAS, SSIS).  - Deep experience in data modeling, data analysis, relational and multi-dimensional database design using the SQL Server Stack.  - Experience OLAP Cube, DAX query development. Advanced data analysis skills including advanced SQL query capabilities.  - Strong multi-tasking skills and hands on programming skills are a must.  - Excellent oral and written communications skills. Excellent interpersonal communications skills. Results oriented and self-motivated.  Bonus Qualifications:  Experience with Azure cloud technologies such as Blob, PolyBase, U-SQL, Azure Data factory, Azure Data warehouse.I look forward working with you Thanks & Regards, Alag Palaniappan| Technical Recruiter Fourth Technologies, Inc. 1816 Springdale Road, Cherry Hill, NJ 08003  Healthcare | Pharma | Financial | Legal | Education | Govt. Email: alag@fortek.com | Url: www.fortek.comPhone: +1 856 751 4848 Ext- 1403NORTH AMERICA | ASIA P please consider the environment - do you really need to print this email"}