{"jobID": "2720858608", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist / Analytic Consultant 4", "companyRating": "3.5", "companyInfo": {"Website": "www.wellsfargo.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1852", "Type": " Company - Public (WFC) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "147000", "jobDescription": "Job DescriptionAt Wells Fargo, we have one goal: to satisfy our customers financial needs and help them achieve their dreams. Were looking for talented people who will put our customers at the center of everything we do. Join our diverse and inclusive team where youll feel valued and inspired to contribute your unique skills and experience.  Help us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you. Wells Fargos Chief Administrative Office (CAO) consists of enterprise functions that work together to promote and protect the Wells Fargo culture and brand, and support our team members. Groups within CAO work to protect our reputation, tell our story, bolster team member engagement, connect with our customers, and bring new and innovative solutions to life. CAO functions include Commitment to Customer, Corporate Responsibility & Community Relations, Data Management & Insights, Human Resources, Marketing, and Stakeholder Relations.  The Data Management and Insights organization (DMI) is building a best in-class data science team, focused on delivering enterprise-wide data driven insights based in both traditional and emerging analytical techniques. Our team supports the DMI service model by providing LOBs with machine learning and predictive analytic consulting and guidance. Key Responsibilities Include :Lead machine learning projects, including working with business partners to define the scope and deliverable, developing the analytic plan and time line, leading deployment and delivering resultsProvide technical advice to other members of the team and across the organization on topics including machine learning code, machine learning algorithms and traversing across multiple big data platformsIdentify and lead the evaluation of new software techniques and technologies, including delivery of resultsIdentify new applications for machine learning across the company and work with business partners to pilotRequired Qualifications6+ years of experience in one or a combination of the following: reporting, analytics, or modeling; or a Masters degree or higher in a quantitative field such as applied math, statistics, engineering, physics, accounting, finance, economics, econometrics, computer sciences, or business/social and behavioral sciences with a quantitative emphasis and 4+ years of experience in one or a combination of the following: reporting, analytics, or modeling2+ years of Python experience2+ years of SQL experience2 + years of experience using quantitative machine learning techniquesDesired QualificationsExtensive knowledge and understanding of research and analysisStrong analytical skills with high attention to detail and accuracyExcellent verbal, written, and interpersonal communication skillsExperience with Tensorflow, Theano or KerasOther Desired QualificationsSolid understanding of and 3+ years of experience applying machine learning techniques such as neural networks, random forest, GBM and SVM, to form a storyExperience with signal processing or optimization techniquesAdvanced knowledge of statistical techniques (e.g. sampling, probability, multivariate data analysis, regression, PCA, time-series analysis)Strong ability to retrieve, combine and transform data from numerous information systemsStrong acumen in diagnosing and resolving data issuesExperience working with big data infrastructure with tools such as Hive, Spark and h2oExceptional analytical, critical thinking, quantitative reasoning skills, and problem-solving skills. Ability to relate complex analysis and insights to effective business strategy.Oher advanced statistical tools such as SAS, R and WekaDisclaimerAll offers for employment with Wells Fargo are contingent upon the candidate having successfully completed a criminal background check. Wells Fargo will consider qualified candidates with criminal histories in a manner consistent with the requirements of applicable local, state and Federal law, including Section 19 of the Federal Deposit Insurance Act.  Relevant military experience is considered for veterans and transitioning service men and women.  Wells Fargo is an Affirmative Action and Equal Opportunity Employer, Minority/Female/Disabled/Veteran/Gender Identity/Sexual Orientation."}