{"jobID": "2616230392", "jobLocation": "San_Mateo_CA", "jobTitle": "Sr. Software Engineer - Generalist", "companyRating": null, "companyInfo": {"Website": "www.sifive.com", "Headquarters": "San Mateo, CA", "Size": "1 to 50 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "At SiFive, you will be part of a fun, engaging team and get an opportunity to grow with the company. You will work side-by-side with the founders of RISC-V and bring to fruition the new RISC-V architecture and enable its rapid adoption by implementing new tools, breakthrough design methods and services. We need people who are trail-blazers, arent afraid to take a chance, and dont always go with the flow.SiFive is looking for senior software engineering generalists who are excited to help us realize our vision of creating a platform accessible to everyone for building and verifying highly-customized RISC-V processors and System-on-chips (SoCs). Our software engineers work on a wide variety of projects in a fast-paced environment where they quickly respond to feedback from our customers and our other internal engineers to improve our software systems. Our engineers have a great deal of autonomy, and we trust that they make well-informed decisions that weigh the tradeoffs between long-term scalability and short-term shipability.We are looking for candidates with diverse backgrounds and who are able to quickly learn about and solve problems in new domains. Candidates do not require experience in the semiconductor industry or in embedded software. We believe it is more important for generalists to be capable of working closely with domain experts to understand their problem domain and engineering holistic solutions that fit in with the system at large. We also believe that it is important to solve problems from first principles and that a team comprising individuals from different industries solving different problems is better equipped to solve old problems in better ways.We're here to bring the software revolution back to hardware.Responsibilities Designing the core software pipeline that generates and verifies processor designsArchitecting and managing the cloud infrastructure the pipeline runs onBuilding out web front ends and API back ends for interfacing with the core pipelineCreating a framework for automatically generating documentation tied to a specific designQualificationsExperience with multiple programming paradigms (functional, OOP, declarative, etc.)Experience with different kinds of programming languages (scripting, application, systems, etc.)Knowledge and experience with domain modeling and managing and evolving large systemsHaving expertise in at least one thing, whether it be a tool, a language, or a software engineering conceptStrong communication skills and the ability to convey technical details to non-technical individuals Nice to Have Competency in specific languages we use such as Scala, Python, Bash, JavaScript (ES2017), C, RISC-V assembly, SQLExperience with Service-Oriented Architectures and commonly-used tools and services such as databases, web servers, Amazon Web Services and Google Cloud PlatformExperience with Docker and KubernetesExperience taping out an SoCSiFive is proud to be an equal employment opportunity workplace. We offer a competitive compensation package that includes flexible paid time off, health, vision and dental benefits, 401(k) plan, employee stock option program, and much more. If you yearn to be challenged and wish to work in an environment where the boundaries of your creativity and skills will be tested, then SiFive is place for you."}