{"jobID": "2749114238", "jobLocation": "San_Jose_CA", "jobTitle": "Loss Control Consultant", "companyRating": null, "companyInfo": {"Website": "www.keenan.com", "Headquarters": "Torrance, CA", "Size": "501 to 1000 employees", "Founded": " 1972", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Keenan & Associates is a successful insurance brokerage and consulting firm meeting the insurance needs of hospitals, public entities and California school districts. Keenan specializes in providing consulting services in the areas of: employee benefits, workers' compensation, loss control, financial, and property & liability. We have seen continuous progress and expansion, making us the 22nd largest consulting firm in the United States. This growth positions us to continue to lead the industry into the 21st century.  We currently have an exciting career opportunity for a Loss Control Consultant based out of our San Jose, CA office.  ESSENTIAL DUTIES AND RESPONSIBILITIES include the following: Performing on-site inspections (both Workers’ Compensation and Property/Liability) of client facilities to identify and evaluate hazardous conditions and make recommendations for corrective measures.Reviewing the existence of required safety programs to assess their compliance and functional effectiveness. Assisting with the writing of the programs identified as deficient.Conducting an inventory of hazardous materials (HMI) and producing a survey of related hazardous conditions. Assisting customers with compliance with Business Plan requirements.Providing safety training classes (as approved by Director).Responding effectively to specific safety problems or concerns raised by customers.Conducting ergonomic evaluations, accident investigations, or specific hazard assessments (as approved by Director).Completing an analysis of District’s losses and presenting action plans focused on negative loss trends.Informing Districts of any changes in safety regulations and distributing safety-related bulletins to them.Completing reports that meet department guidelines and complying with established department turnaround times.Complying with department’s product delivery and follow-up guidelines.Communicating effectively with other internal departments on customer strategy issues.Assisting in the development and marketing of new products and new business opportunitiesStaying informed about contractual obligations; tracking service plans and ensuring status is updated on R drive.All other duties as assigned. MINIMUM SUGGESTED QUALIFICATIONS: Should either possess a Bachelor’s Degree in Occupational Safety and Health, or equivalent in formal education and work-related experience. Must have strong customer service, writing, presentation and communication skills. Should be able to handle and prioritize multiple projects. Requires dealing with many personality types, so professional appearance, friendliness and genuine empathy are all distinct advantages. Needs to be a team player with a collaborative and flexible attitude. A self-motivated and organized work style is essential. Compliance with state fingerprinting regulations is required.  SOFTWARE: Proficiency in Word, Excel, PowerPoint, Outlook and Internet Research required.  PHYSICAL DEMANDS: The job entails 80% fieldwork with extensive driving and walking required. The remaining 20% is report writing and administrative duties, a lot of which is performed at home. Overnight stays are required in some areas, and occasional (once every two months at most) in-state travel. The employee should be able to: Drive up to four hours a day for at least three days a week. Occasionally (once a week) a six-hour driving day is required.Often (up to three times a week) walk up to five miles a day over the school grounds.Often (five times a day three days a week) be required to climb up steps, bleachers, playground equipment, ladders, etc.Regularly (ten times a day four days a week) bend, stoop, kneel, crouch or twist to better identify hazards.Withstand sun exposure (up to six hours a day) for a number of consecutive days (up to four).Reach overhead occasionally (up to five times a day) to materials stored on overhead shelves.Occasionally (five times a day) move or lift boxes (up to 40lbs).Frequently operate small tools and measuring devices (monitoring devices, tapes, screwdrivers, calipers, etc.).Often (twice a week) type for two hours at a time while taking micro-breaks every few minutes and a five minute break every 45 minutes.Seldom (once every two weeks) sit up to seven hours a day at a computer workstation. Keenan provides a competitive compensation and benefits package. We encourage teamwork and employee initiative - people working together is what makes Keenan a success. We invite you to share in the commitment of preserving our warm tradition, reputation and dedication to our clients. After all…What you do makes a difference!  Please apply online at www.keenan.com/careers. For more information, visit our website at www.keenan.com  Keenan provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, creed, sex, sexual orientation, gender identity, national origin, age, disability, veteran, marital, or domestic partner status. Keenan is committed to a diverse workforce and is an affirmative action employer."}