{"jobID": "2817161516", "jobLocation": "Seattle_WA", "jobTitle": "Data Scientist", "companyRating": "2.8", "companyInfo": {"Website": "www.zulily.com", "Headquarters": "Seattle, WA", "Size": "1001 to 5000 employees", "Founded": " 2009", "Type": " Subsidiary or Business Segment", "Industry": " Retail", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Starbucks, Amazon, Target"}, "estimatedSalary": "111000", "jobDescription": " We have an immediate need for an experienced industry Data Scientist. As a Data Scientist at zulily you’ll use statistical and machine learning techniques to better understand how customers engage with zulily’s web and mobile e-commerce platforms, and use that information to better allocate resources across zulily, from recommender systems informing the e-commerce site, to acquisition and lifecycle marketing processes, to operations. You’ll work with key stakeholders to crisply define business questions, success criteria, and deployment plans. You’ll use reproducible research techniques to create analytical data sets, conduct exploratory data analysis, select and engineer features, train, tune, and evaluate candidate models, distill and present findings, and create cloud-ready production and reference implementations.What you will own, manage, and be accountable for:Constructs analytic data sets for both exploration and modelingConducts exploratory data analysis and prepares visualizations summarizing key features of the dataResearches and adapts existing open source algorithms when possible, develops novel techniques when neededDevelops reproducible information products and modular, instrumented softwareDevelops accurate models for prediction and inferenceProvides guidance to software development engineers on production implementationsDevelops program plans and road maps for Data ScienceWorks with stakeholders to define business questions, success criteria, and model deployment plans. Checks in regularly with stakeholders during projectsWe also want to let you know about what you can expect when you work at zulily: We have a well-defined career path for our technical talent, with measurable goals.zulily understands the value of learning; every tech employee receives an annual education budget for personal development. This includes external classes, training, conferences, etc. We also encourage you to bring your new knowledge back to the team to share! In addition, zulily also has internal L & D tools and opportunities available.HTO (Hack Time Off) - You have great ideas – here’s some extra time to work on them! All exempt employees will be granted 5 days of “Hack Time Off” per year – PAID! You can partner with other teams on innovative ideas.Giving back: Every quarter we offer zulily full-time employees 8 hours of PAID volunteer time. We also encourage you to get a team of volunteers together and make a difference in the community.Zuniversity is a lecture/fireside series that allows you to meet with local influencers and learn about what is going on in our community.Qualified Candidates Possess: Education: Bachelor's Degree with a concentration in one of the following: Statistics / Ops. Research / CS. Highly Preferred: a Master's Degree with a concentration in Data Science / Analytics 3 – 5 years working with real data sets in a business settingExperience distilling and presenting complex concepts to a business audienceSolid Knowledge of for-profit business operationsDemonstrated history of scoping small to medium size projectsExperience with different algorithm families and experience selecting, applying, and measuring model performance in a non-academic settingA professional background that includes working with machine learning and optimization techniques in a non-academic settingExpertise in data integration with SQL, as well as within a statistical programming language such as R or Python in a non-academic settingPractical knowledge and application of best practices in reproducible research and software engineeringWell-versed in all phases of the modeling pipeline on both desktop and distributed/cloud platforms in a non-academic settingExperience with classical statistics and knowledge of design of experimentsThe ability to start FT work with zulily upon offerBonus: proficiency in Spark"}