{"jobID": "2822327581", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst, Growth and Operations", "companyRating": "3.5", "companyInfo": {"Website": "www.infusionsoft.com", "Headquarters": "Chandler, AZ", "Size": "501 to 1000 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Marketo, Constant Contact, Salesforce"}, "estimatedSalary": "75000", "jobDescription": " 80% of small businesses fail in their first 18 months. At Infusionsoft, we aim to change that. We dont just say it, we work to help small businesses succeed every day. Our full commitment to this mission means there will be long days days and incredible challenges. We expect you to bring hustle, grit and passion to the table. You will need to take proactive ownership and improve yourself constantly in a high-intensity startup atmosphere. But the reward? You will learn. You will grow your skills. And most importantly -- you may just contribute to something larger than yourself. Your Role and Impact We are looking for an experienced Senior Data Analyst who can make an immediate impact on our Analytics team. At Infusionsoft, we dont just expect our data analysts to just provide reporting and KPI tracking. We expect data analysts to fulfill three broad functions: Automate dashboards and reports with ninja-like SQL and data transformation skillsProvide statistical analysis on business questions using tools like R and PythonMost importantly -- work as a peer with business stakeholders and help them answer meaningful business questions using dataResponsibilitiesWrite complex SQL queries to transform data at the data warehouse level -- yes, we expect our Analysts to create derived tables from raw table dataHelp define KPIs and develop dashboards to track business questions and metrics across the companyExploring data to find actionable insights and make recommendationsProvide direct analytical support to help business stakeholders and leaders prioritize, execute, and analyze initiativesServing as a best-practices and implementation owner for AB tests and other controlled experimentsPerform ad-hoc statistical analysis (logistic regression, IV regression and quasi-experimental methods, and difference-of-means testing)ExpertiseFluency in SQL, as well as a deep understanding of statistical analysis, experiment design, and common pitfalls of data analysisExperience with modern scalable data warehouses (BigQuery/Redshift/Hive/etc), BI tools (Looker) and enterprise sales/marketing automation tools (Salesforce/Marketo) is strongly preferred3+ years of experience doing quantitative analysis for a technology company preferably in a Business Intelligence, Marketing Analytics, Customer Success Analytics or Data Science teamPower user of analytical tools (Mixpanel, Optimizely, Google analytics, Python, etc)Degree in Math, Physics, Statistics, Economics, Computer Science, or other quantitative fieldsSelf-starter: You drive projects with minimal guidance and focus on high impact workStrong communicator: You effectively synthesize, visualize, and communicate your ideas to othersCritical thinker: You are thoughtful, self-aware, and use available evidence to make decisionsWork effectively with teammates and win credibility quicklyAt Infusionsoft we celebrate diversity and inclusion for the benefit of our employees, our products, our community, and to help small businesses succeed. We do not discriminate based on race, color, ethnicity, ancestry, national origin, religion, sex, gender, gender identity, gender expression, sexual orientation, age, disability, veteran status, marital status or any legally protected status."}