{"jobID": "2796105224", "jobLocation": "San_Francisco_CA", "jobTitle": "Insurance Agency Owner", "companyRating": null, "companyInfo": {"Website": "www.allstate.jobs", "Headquarters": "Northbrook, IL", "Size": "10000+ employees", "Founded": " 1931", "Type": " Company - Public (ALL) ", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Progressive Insurance, State Farm, Farmers Insurance Group"}, "estimatedSalary": null, "jobDescription": " . Job Description Be MORE than just an agent. Be an Allstate Agency Owner Why work hard to build a business and not earn any equity? As an Allstate Agency Owner, your hard work turns into equity that provides you the opportunity to sell or pass down in the future. Plus, the big advantage with insurance is that it’s a must-have for many Americans who own a car or home. So, the demand is always there making the Allstate agency ownership a business opportunity not to be missed. There’s MORE to being an Allstate Agency OwnerBuild a legacy with the opportunity to pass it down or sellPay NO franchise or royalty fees (not a franchise opportunity)Be your own boss and run things your wayEnjoy a better work/life balanceEarn repeat revenue from policy renewalsEnjoy unlimited earnings potentialEnjoy immediate brand-name recognition of a Fortune 100 CompanyThere’s MORE support than you thinkUp to 4 years of enhanced compensation packageEducation bonus ranging from $5-$8KEstablishment bonus up to $15KMarketing funds of $6K in you first year in addition to ongoing local and national marketing supportQuarterly life and retirement bonuses up to $7,500 Job Qualifications BE MORE than just an agent. Be an Allstate Agency Owner and start building equity in a small business of your own with a nationally recognized brand helping to drive leads to your door. For more information visit allstateagent.comMORE DetailsPrior business or franchise ownership preferredPrevious insurance experience a PLUS!Experience in playing an active role in the day to day operations, budgeting, planning and staffing strategies or experience in business or sales management.You are required to obtain all applicable state licenses for property & casualty, life & health before getting appointed with Allstate.Investment of $100,000 liquid capital to cover startup costs. Allstate does not take possession of your capital and there are no franchise fees or licensing fees. These funds remain in your control and you will use them to cover your operational expenses such as your payroll, lease, marketing, utilities etc.Subject to all terms and conditions as outlined in the Allstate R3001 Exclusive Agency Agreement and Exclusive Agency program materials. Allstate agents are not franchisees; rather they are exclusive agent independent contractors and are not employed by Allstate. Allstate is an Equal Opportunity Company. Allstate Insurance Company, Northbrook, IL. In New Jersey, Allstate New Jersey Insurance Company, Bridgewater, NJ. © 2015 Allstate Insurance Co.  Keywords:  Sales representative, sales executive, inside sales, outside sales, sales manager, account manager, operations manager, business development, business development manager, call center manager, supervisor, director, real estate, realtor, insurance agent, insurance account representative, insurance broker, franchise owner, customer service, business consultant."}