{"jobID": "2812880057", "jobLocation": "New_York_NY", "jobTitle": "Personal Trainer - Jackson Heights", "companyRating": null, "companyInfo": {"Website": "www.blinkfitness.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Consumer Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Founded in 2011 by executives at Equinox, Blink Fitness is a premium quality, value-based fitness brand with more than 90 locations open or in development throughout New York, New Jersey, Pennsylvania and California. Blink puts Mood Above Muscle™, which celebrates the positive feeling you get from exercise, not just the physical benefits.  Blink is a subsidiary of The Related Companies, founded by Stephen Ross, who owns the Miami Dolphins, and has investments in a variety of businesses, including Momofuku,&Pizza;, Citi Bike, etc. Blink is a wholly-owned subsidiary and is a sister brand to Equinox, Soul Cycle, Pure Yoga, Rumble Boxing, and Equinox Hotels. Blink is based in Manhattan.  Blink recently launched a franchising system to complement its fast growing company-owned business model and has secured franchise development agreements in Georgia, Illinois, Massachusetts, Michigan, Virginia and upstate NY. This includes an agreement with Golden State Warriors forward Draymond Green, two-time NBA Champion, All Star, Olympic Gold Medalist and Defensive Player of the Year, who announced a franchise development deal to bring 20 gyms to his home state of Michigan and to Illinois.  Blink is an exciting and dynamic business that is still in the start-up mode. We are a passionate team with a great entrepreneurial spirit and a willingness to roll up our sleeves to get the work done.  While Blink has grown rapidly and has already achieved significant profitability, the business is just getting warmed-up. Its leadership has a very lofty vision and expects explosive growth over the coming years. At a minimum, the business expects to have more than 300 locations over the next five years through a combination of corporate and franchise development.  For more information visit Blink’s consumer website -- blinkfitness.com– and its franchise website– blinkfranchising.com. What makes PT at Blink different? Blink is currently based in the New York tri-state area with plans to grow nationally in 2018 and as a result, we have a rapidly expanding member base. With over 10,000 new members a month, there are plenty of new clients to engage in training. We offer the lowest price point per session with the largest payout for new trainers in the industry. You also have the opportunity to get paid for floor hours, where you can maximize prospecting. What are you waiting for? It’s time to get blinking. Job Overview: Blink Personal Trainers provide personalized attention, professional instruction, and exercise programming to each member to maximize the member’s health, fitness, and wellness goals while providing the highest level of customer service. Join us and discover a dynamic work environment built around helping others maximize their potential, where limitless opportunity is cultivated by the highest in industry standards across training, education, marketing, media and sales.Responsibilities:Build client base through conducting orientations and PT sessions and demonstrating the value of personal training, including safe and proper exercise techniquesPrepare and deliver comprehensive fitness programs based on clients’ goalsMotivate and inspire clients to get results through goal setting, frequent follow-upProvide hospitality to all membersSet the positive energy and tone of the ClubQualifications:Cardiopulmonary Resuscitation (CPR) and Automated External Defibrillator (AED) certification requiredApproved Personal Training Certification RequiredDesire to transform lives through educating members on health and wellness topicsUnderstand principles of physical fitness and proper exercise techniquePossess excellent customer service skillsPossess or be willing to learn sales skillsAbility to self-promote and networkAbility to communicate clearly and concisely, both verbally and in writingAdjust and operate fitness equipmentCompensation& Benefits:Competitive compensation and bonus opportunitiesComprehensive Benefits package for all TrainersMedical, Dental, and Vision plans401(k) Retirement savings optionCareer Advancement opportunitiesComplimentary Blink membershipFun working environment!"}