{"jobID": "2656448156", "jobLocation": "Santa_Clara_CA", "jobTitle": "Sr System Software Engineer – CUDA Driver", "companyRating": "4.3", "companyInfo": {"Website": "www.nvidia.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1993", "Type": " Company - Public (NVDA) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "146000", "jobDescription": "What we're looking for: We are hiring senior engineers to work on the CUDA driver, a core component of our platform for accelerating general purpose computation on the GPU. Our team delivers features and improvements to better realize the potential of NVIDIA hardware for a growing range of computational workloads, ranging from deep learning, scientific computation, and self-driving cars to video games and virtual reality.  CUDA defines a unified programming model across a range of system configurations and hardware capabilities. To accomplish this, the CUDA driver interacts with GPU hardware, kernel mode drivers, and the operating system. What you'll be doing: As a member of our team, you will use your design abilities, coding expertise, and creativity to deliver the best compute platform in the world. You will craft elegant solutions to exciting problems and craft the future direction of CUDA as you collaborate with your peers across NVIDIA. You will evangelize, architect, and implement new featuresYou'll oversee and drive development efforts across multiple teamsHelp define forward-looking improvements to the CUDA APIs and programming modelWrite effective, maintainable, and well-tested codeDevelop code for multiple operating systemsWhat we need to see:BS or MS degree in Computer Science, Electrical Engineering​, with 5+ years of related development experienceStrong C programming skillsExperience working with large codebasesExperience with operating system interfaces for threads, process control, and virtual memoryExperience writing and debugging multithreaded programsGood written communicationDeep understanding of technology and passionate about what you doStrong collaborative and interpersonal skills, specifically a proven ability to effectively guide and influence within a dynamic matrix environmentWays to stand out from the crowd:You have an understanding of system level architecture, such as interconnects, memory hierarchy, interrupts, and memory-mapped IOKnowledge of memory coherence and consistency modelsExperience with kernel mode developmentExperience with Windows, Linux, or macOS driver developmentSome familiarity with C++ NVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most brilliant and talented people in the world working for us. If you passionate about what you do, creative and autonomous, we want to hear from you!NVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression , sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law."}