{"jobID": "2831345199", "jobLocation": "Oakland_CA", "jobTitle": "Intern", "companyRating": null, "companyInfo": {"Website": "www.jacobs.com", "Headquarters": "Dallas, TX", "Size": "10000+ employees", "Founded": " 1947", "Type": " Company - Public (JEC) ", "Industry": " Construction, Repair & Maintenance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Fluor, Bechtel, AECOM"}, "estimatedSalary": null, "jobDescription": " The Buildings&Infrastructure; Line of Business is a global network of employees, which serves both the private and public sector. Our employees work to shape the communities we live in by creating world-class projects that transform the future development patterns of those communities. We provide our clients award-winning planning, engineering, architectural and interior design, construction and program management, and design-build project delivery. The Jacobs business model allows us to successfully service our clients, leverage our integrated services, and provide our employees with growth opportunities while delivering global solutions to our client's local programs.  We consistently receive high rankings from Engineering News-Record (ENR) in many classifications, including the categories of Top Design Firms, Top Contractors, Top Green Buildings Design Firms, and Top Transportation Companies. Position Summary Internship positions at Jacobs provide college students an opportunity to gain real-world experience in their specific area of study. Interns will work alongside world-class professionals in a fast-paced, professional setting which provides interns invaluable experiences applying the knowledge and skills learned through education in a business environment.  Reporting directly to an assigned design lead in an office, this is a temporary position providing on the job training. Duties provide meaningful work experience and business knowledge to students in their chosen field. Building and infrastructure designCAD, as neededSite surveys, as needed, but in non-construction environmentsReport preparationData analysis in support of design effortsBriefings to supervisors and colleagues on work conductedDaily logging of duties Must be part of Jacobs STEM (science, technology, engineering and math) initiative program  At Jacobs, we help prepare people for new opportunities and challenges. With positions at every level, openings in multiple disciplines, expertise in a range of markets and offices around the globe, we create an environment where you can learn, grow, and thrive. From our competitive benefits program to our Health and Safety initiative of Beyond Zero workplace injuries, we believe that you'll find a flourishing career here at Jacobs."}