{"jobID": "2806003302", "jobLocation": "Wilmington_MA", "jobTitle": "Sales Data Analyst (Entry Level)", "companyRating": "3.5", "companyInfo": {"Website": "www.sovos.com", "Headquarters": "Boston, MA", "Size": "1001 to 5000 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "41000", "jobDescription": " The Work You'll Do  The Sales Operations Analyst will work closely with the Sales and Marketing teams to provide on-going support and maintenance of our business systems, processes and data. More specifically, you will:Provide assistance with sales support/training, project coordination, creating and maintaining documentation, accommodating ad-hoc user requests and developing management dashboard reportingProvide direct user support on Salesforce.com (SFDC) (and other critical tools and applications) that enable the sales forceImplement and enforce processes and tools that will maintain integrity and accuracy of Salesforce.com dataMaintain reporting tools and manage ad-hoc reporting requests for the sales&marketing; departmentsDesign and development reporting to provide sales performance analysis and insights to sales management, sales reps and other departmentsAssist in the development of internal audits and controls to ensure integrity of business processes and dataProvide cross-functional support and assist sales management on projects as needed What We Need From You Bachelor's Degree in Business Management or equivalent degree/experienceSalesforce.com experience preferredUnderstanding of standard business practices related to Sales Operations processes and systems (sales cycle, CRM applications, reporting, forecasting, territory management and sales quotas)Strong analytic and quantitative skills; ability to determine trends and propose solutionsProficient in the Microsoft suite of products with extensive Microsoft Excel experienceExcellent communication and organizational skills How You'll Grow  Growth is serious business at Sovos! In the past 12 months, nearly one-third of our employees experience career growth in the form of promotions, career changes, and lateral movesMerit-based compensation philosophy and a corporate bonus programThere are clear paths of growth within our roles What We Can Offer!  The opportunity to grow as a professional - and as a person - through various company-provided development opportunities, including: SovosYOUCLOUD Rotation ProgramThe IDEA Mentor ProgramLEADS and IMPACTTuition ReimbursementProgressive Wellness ProgramOther noteworthy benefits include:401KFlexible Time OffThrivePassVisit our careers page to learn more! The challenge of working in an emerging market and solving complex problems for our clients is a large one. Businesses are struggling to keep up with the pace, volume, and complexity of regulatory requirements. In fact, 45% of CFOs say compliance is their \"biggest growth challenge.\" That is why over half of the Fortune 500 counts on Sovos to solve their complex business-to-government compliance challenges. Our employees work on meaningful and engaging projects that make a tangible impact on our clients' success.  Does this sound like a fit? Apply now!  Sovos is an Equal Opportunity/Affirmative Action employer Minorities/Women/Veterans/Disabled"}