{"jobID": "2831317059", "jobLocation": "San_Jose_CA", "jobTitle": "Commercial Underwriter for Technology & Life Sciences", "companyRating": null, "companyInfo": {"Website": "www.comerica.com", "Headquarters": "Dallas, TX", "Size": "5001 to 10000 employees", "Founded": " 1849", "Type": " Company - Public (CMA) ", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Regions Financial, BBVA Compass, Zions Bank"}, "estimatedSalary": null, "jobDescription": " The Commercial Underwriter is responsible for underwriting and documentation of basic and less complex loan requests for assigned Lines of Business (LOBs) as well as owning deal analyses and execution of workflows according to established Service Level Agreements (SLAs), also responsible for assisting in the on-going monitoring of the credit exposure for assigned relationships, including renewals, reaffirmations and annual risk ratings. Reporting Information: The Commercial Underwriter reports to the Manager Commercial Underwriting (MCU). Position Competencies: Successful incumbents possess strong analytical, time management, verbal and written communication skills, are accountable and have strong data management capabilities. Position Responsibilities:Provide complete analysis of loan package for new deals, reviews and renewalsPrepares and/or updates appropriate RECAP documentation with guidance from MCU (Manager Credit Underwriting).Prepares basic collateral charts, cash flows, risk ratings and other attachments.Provides basic industry analysis.Identifies policy exceptions and works with MCU/RM (Relationship Manager) to mitigate them.Identifies and analyzes inconsistencies and inaccuracies in customer data, including spreads, aging's, projections and other financial documents.Develops basic analytical narrative and commentary on the request.Evaluates strengths and weaknesses of the credit and escalates risks and other issues to MCU and/or RM or PM (Portfolio Manager).Assists RM/PM with contacting customers to obtain answers for loan analyses and recommend loan structures and covenants.Prepares risk rating with guidance from MCU.AdministrationMonitors loan covenants and tracking on simple transactions in conjunction with CSC (Credit Support Center) support team for assigned relationships.Shares responsibility with Credit Specialists for performing OFAC checks and identifying issues.Investigates title searches, surveys and UCC (Uniform Commercial Code) searches as requested by MCU or RM/PM.Process SustainabilityAdheres to department procedures for workload management.Strives to meet or exceed SLA, or when not possible, communicate to MCU and RM/PM.Ensures appropriate RECAP formats/attachments are used in accordance with approved process & procedures.Other duties as assigned. Travel  Travel is not required of this position.  Relocation  Relocation is not available for this position.  Work Schedule  This positions work schedule may require overtime. Bachelor's Degree in Business or Economics3.0 cumulative GPATwo (2) Accounting courses (minimum 6 units) with a 3.0 GPA average1 year Microsoft Office applications (Word, Excel, PowerPoint, Outlook) Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}