{"jobID": "2821885316", "jobLocation": "Medford_MA", "jobTitle": "Scientist I/II – Nucleic Acid Biochemistry", "companyRating": null, "companyInfo": {"Website": "www.greenlightbiosciences.com", "Headquarters": "Medford, MA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Greenlight BiosciencesScientist I/II – Nucleic Acid Biochemistry Job DescriptionPosition Summary GreenLight Biosciences is seeking an exceptional and highly motivated analytical scientist to help advance the company’s RNA platform technology. The successful candidate will support R&D; efforts within the company by characterizing RNA products with respect to structure, sequence, and modifications. A deep technical background in analytical chemistry, molecular biology, and assay development is required. Strong organizational and communication skills, creative problem-solving, and flexibility are essential. Responsibilities:Characterize the structure, sequence, and modifications of RNA molecules using state-of-the-art techniques, including HPLC, LC-MS/MS, capillary electrophoresis, next-generation sequencing, etc.Purify RNA products using state-of-the art techniques, such as reverse-phase chromatography, ion exchange chromatography, size exclusion chromatography, solid-phase extraction, etc.Evaluate purity of RNA samples for nucleic acid, protein, and other contaminantsDesign and perform standard molecular biology experiments (DNA cloning, nuclease digestion, PCR, (q)RT-PCR, agarose gel electrophoresis, etc.)Develop novel analytical methods where necessaryWork independently and in collaboration with multidisciplinary project teams, as well as the Analytical Chemistry and Metabolic Engineering groupsMaintain diligent and organized recordsClearly communicate results and recommendations to colleagues, managers, and senior management, assisting in project decision-making Required Skills & ExperienceQualifications:Ph.D. in Biochemistry, Molecular Biology, or related discipline with at least 3 years of industrial experience or 5 years of academic experience, specializing in the RNA field. Candidates with a M.S. and at least 8 years of industrial experience in the RNA field will also be considered.Experience characterizing nucleic acid modifications, including nucleoside and post-transcriptional modifications (e.g. 5’-cap structures, polyadenylation, etc.) is requiredExperience characterizing primary and secondary structures of nucleic acids is requiredExperience developing analytical chemistry methods (e.g. HPLC and LC-MS) is requiredExperience with standard molecular biology techniques is requiredExperience with next-generation approaches to RNA sequencing is desirableExperience translating bench scale experiments to high throughput workflows is desirableStrong organization, communication, and interpersonal skills are required, with the ability to work both independently and in a collaborative work environment Apply For Job View All Jobs @ Greenlight Biosciences Powered by Built for Teams©2018 Built for Teams  | Support"}