{"jobID": "2767287401", "jobLocation": "Redmond_WA", "jobTitle": "Data Analyst II", "companyRating": "4.1", "companyInfo": {"Website": "www.microsoft.com", "Headquarters": "Redmond, WA", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (MSFT) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Amazon, Apple"}, "estimatedSalary": "102000", "jobDescription": " Are you someone with a passion for data, analytics, insights and technology? Do you want to be part of a team lighting up actionable insights to help the organization make business decisions?If you excel inblending technology solutions with quantitative analysis and strategy development and wantto influence the future ofthe Officedigital marketingstrategyat Microsoft, then this position is for you.  The Office Insights, Data Engineering and Analytics Team is looking for a passionate, creative, analytical and experiencedweb instrumentationanalyst who lovesbig data, curious toidentify ways to track the digital experiences andexplore and unveil insightstocreate a business story and reporting to impact key business decisions. Ourteamprovidesthe data and insights needed to run and grow the Office business. This work includes: Providingholistic, Office wide customer and business insightsProvidingdata and insights for modern marketing and salesDeliveringdata sets and1:manyexploration tools that democratize business and customer insights forthe Office Product Group, marketing and our field. This includes common data models and architecture, and data governance.Providingactionable intelligence and analytics that will make our products and servicesbetter and grow our business. This includes Office wide predictive modeling, machine learning models and recommenders This Web Instrumentation Analyst position isakey rolethatservesas a subject matter expertoncapturingand understandingthe digitalexperiences of our audienceto support the organization in implementing successful and efficient digital marketing. The scopeincludes understanding how the Paid Media and Lead Generationteams can target the right audiences and how their tactics can be tracked to accurately evaluate performance and allocate investments to the most appropriate ones. Also includes stakeholderengagement and close collaboration with and leveragingefforts of data scientists,data engineers and other data analysts of the Office Insights, Data Engineering and Analytics Team.  You are driven, self-directed, entrepreneurial and focused on delivering the right results. To be successful in this role, you must have strong skills in written and oral communications, a can-do attitude and the willingness to tackle hard problems in innovative ways. You also thrive in a team environment that values cross team collaboration and building on the success of others.Responsibilities"}