{"jobID": "2828829155", "jobLocation": "Braintree_MA", "jobTitle": "Part Time Sales Associate", "companyRating": "3.4", "companyInfo": {"Website": "www.swarovskigroup.com", "Headquarters": "Wattens, Austria", "Size": "10000+ employees", "Founded": " 1895", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Pandora Jewelry, Tiffany & Co."}, "estimatedSalary": "12", "jobDescription": " Interested in joining our team? If so, take the opportunity to apply to one of the world's best-known brands as: SALES CONSULTANT – PART TIMEWHAT YOU CAN EXPECT You will work in a fascinating field, as part of a motivated, dynamic team, within the world of fashion, jewelry and accessories.  Exceptional Swarovski Sales Consultants represent the company as Brand Ambassadors providing the Ultimate Consumer Experience along with maximizing the overall store sales opportunities and creating a \"Crystal World\" for all new and existing Swarovski customers. Sales Consultants are accountable for individual performance. Developing authentic relationships with the consumer by assessing their needs, making personalized product recommendations, and creating a luxury experiencePromoting the features and benefits of the Swarovski Crystal Society membership to all consumers and meeting established monthly membership sales goalsMaintaining a flexible work schedule including evening, weekend and holiday availabilityMaintain the spirit of ownership by demonstrating strong problem-solving skillsOpening and closing the storeWHAT WE EXPECT As an ideal candidate you want a strong, expressive personality with a stylistically appropriate and professional manner. The ideal candidate will also be able to get the best out of the world, metrics driven, poised and confident. Candidates must have 6 - 12 months experience in a premium, luxury branded retail environmentBackground in a target / metric oriented environmentAbility to apply mathematical concepts such as fractions, percentages, ratios, and proportions to practical situationsMust be able to work with a minimum amount of supervisionAbility to read and interpret documents such as Store Operations Manuals and Training ManualsHS diploma or equivalentWHAT WE OFFERBe a key part of a global world-class luxury brandWork in a 120-year-old family run organization that feels local, but has dynamic global reachCome sparkle in one of our many world-wide businesses housed here in the United StatesExperience a strong sense of belonging as we proudly work togetherWhether you are just beginning or celebrating an existing career, we invite you to make your own mark on Swarovski’s rich history Does this sound like you? If so, we look forward to receiving your online application. Equal Employment OpportunitySwarovski is committed to Equal Employment Opportunity for all employees and will take Affirmative Action in those appropriate employment situations. All employment decisions will be made without regard to race, color, religion, age, national or ancestral origin, gender, sexual orientation, marital status, citizenship status, veteran status and disability. Job Type: Part-time  Experience: Sales: 1 year Education: High school"}