{"jobID": "2637055072", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist - Algorithms", "companyRating": "4.1", "companyInfo": {"Website": "www.airbnb.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "142000", "jobDescription": " Airbnb has become a global platform that connects travelers and hosts from over 34,000 cities. As such, it has collected a diverse set of data which powers various data products, to understand unstructured data such as image and text data, Pricing and Help Assistant that greatly enhance our users' experiences.  As an algorithms data scientist, you will have the opportunity to leverage Airbnb’s rich data and state-of-art machine learning infrastructure to develop data products that are used by millions of users and propel the growth of our business. You will collaborate with a strong team of engineers, product managers and fellow data scientists in defining the frontier of data products in matching marketplaces. Data scientists will work on how to evaluate potential approaches, build features, algorithms, and determine metrics which are critical for machine learning models.  We have multiple openings available. Sample projects include: Determine novel metrics to evaluate pricing models.Build new model to predict the quality of guest experiences.Build and iterate on machine learning models to detect high risk activities like account takeovers, fake contents and fraudulent transactions.Building NLP models to detect spam and inappropriate content on the fly. Here are some qualifications we look for: 3+ years experience developing machine learning models at scale from inception to business impact. Leadership opportunities also available.Advanced degree in quantitative field.Deep understanding of modern machine learning techniques and their mathematical underpinning, such as classification, recommendation systems, optimization, deep learning, and natural language processing.Proven ability to tailor machine learning solutions to business problems in a cross functional team.Strong programming skill (Python, R, or Scala preferred).Experience productionizing machine learning model is a plus.Experience in NLP is a plus.Experience in Deep Learning is a plus.BenefitsStock$2,000 yearly employee travel couponCompetitive salaryPaid time offMedical, dental, & vision insuranceLife & disability coverage401KFlexbile Spending AccountsApple equipmentDaily breakfast, lunch, and dinner"}