{"jobID": "2756298054", "jobLocation": "Cambridge_MA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.cibotechnologies.com", "Headquarters": "Cambridge, MA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "As a Data Scientist at CiBO youll join a collaborative team of developers, data scientists, agronomists, and remote sensing experts. You will help build customer facing apps and our core platform to create, improve, and scale agricultural models and optimization. Our culture is built on cross-disciplinary collaboration, learning, and rapid prototyping. As engineers we believe in types, tests, FP and automation. CiBO is a science-based company, so prepare to learn and invent with us!Qualifications Either Masters in a technical field and 5+ years experience as a Data Scientist or Research Scientist; or PhD in Math/Statistics-focused field, with strong preference for some work experienceExperience across and significant work in at least one of clustering and classification; multivariate regression, prediction, and forecasting; and dimensionality reduction and feature engineeringExperience applying the scientific method to complex, multivariate unstructured problems to produce rigorously-defendable conclusion in prose and graphicsExperience or interest in Bayesian methods of crafting generative probabilistic models; engineering informative priors; and solution via MCMCExperience engineering production-level software systems evidenced by having built a parallel/distributed system, using software best practices, performance optimizations, or an automated pipeline to interpret other data science experimentsExperience collecting, curating, structuring and retrieving large data sets in relational databases.Additional experience with NoSQL preferredBasic background in computer science including the use of foundational data structures; programming and languages types; and essential discrete math and calculus. Bonus Qualifications (Not Required) Experience or keen interest in FP {Scala, Haskell, Clojure, Erlang, OCaML/SML, Elm, F#}Experience with Bayesian non-parametrics (CRP, IBP, etc.)Experience with advanced MCMC techniques such as DREAM, Hamiltonian-MC, variational approximations, etc.Experience with either time-series or spatial statistics, especially Gaussian ProcessesExperience creating complex data visualizations for multivariate dataExperience with AWS or other programmatic distributed computing environments such as MPI or LSF"}