{"jobID": "2821604613", "jobLocation": "Cambridge_MA", "jobTitle": "Data Scientist (Imaging) / Cheminformatician", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Job Description  We are looking for a highly motivated data scientist / imaging expert who wants to advance drug discovery projects through innovative analytics in a cross-functional environment.  You will join the Chemical Biology and Therapeutics Informatics (CBTi) group at Novartis Institutes for Biochemical Research (NIBR). We are an interdisciplinary, global group of chem- and bioinformaticians, and data engineers, who together are brokers between data and the next wet-lab experiment.  Embedded in project teams, you will be answering the question of “what compound to screen next”, which includes focused library design; readout quantification and hit call strategy; and virtual screening and SAR exploration.  In particular, you will develop and apply computational methods to analyze complex phenotypic readouts, such as imaging and time series data. Deep learning expertise in the imaging space is a plus!  Key responsibilities include: Early drug discovery project in silico support a. Identify data analysis / in silico needs of early-stage drug discovery projects by working closely with biologists, chemists, and screening scientists  b. Execute on project needs effectively and efficiently by developing and leveraging reusable data analysis workflows, tailored to the needs of the project.  c. Communicate data-driven insights with clear recommendations on the next experiment. Innovation in computational methods for drug discovery a. Develop imaging and video analysis pipeline in the context of drug discovery projects.  b. Gain cross-project insights through state-of-the-art machine learning methods, such as deep learning.  c. Collaborate with external partners on state-of-the-art machine learning methods, in particular in the imaging space.  d. Apply and develop novel methods to organize and navigate institutional knowledge.  EEO Statement  The Novartis Group of Companies are Equal Opportunity Employers and take pride in maintaining a diverse environment. We do not discriminate in recruitment, hiring, training, promotion or any other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, marital or veteran status, disability, or any other legally protected status.  Minimum requirements  The successful candidate will have a life science background with computational training, such as a PhD or in bio/cheminformatics, computational biology/chemistry, combined with training (e.g., Masters degree) in biology or chemistry; or an advanced degree in biology or chemistry, with at least 3 years of computational experience in an industrial or Postdoc setting.  Required skills include:  • Background in Biology or Chemistry, with solid understanding of chemical biology and screening Demonstrated ability to develop, implement, and apply project-tailored analysis workflows to answer scientific questionsHands-on experience with analysis of experimental results; in particular, biological assays with complex readouts, such as imaging or time-series data.Practical experience with a scripting language (Python, R, Matlab)Relevant work experience using scientific computing in a life-science environmentExcellent scientific communication skills and effective data visualization skillsFamiliarity with relational databases and SQL  Desirable skills include:  • Experience with cheminformatics (similarity searching, SAR analysis, chemogenomics data mining)Experience with deep learning, in particular in the imaging spaceExperience with high-performance computing environments and SparkIndustry experience in early drug discoveryWet lab experience"}