{"jobID": "2786409636", "jobLocation": "Boston_MA", "jobTitle": "Critical Care Registered Nurse", "companyRating": "2.4", "companyInfo": {"Website": "www.msgstaffing.com", "Headquarters": "Worcester, MA", "Size": "51 to 200 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "31", "jobDescription": "We have partnered with several highly desirable and competitive facilities right in the heart of historic Boston and beyond and are committed to delivering an experienced Critical CareRegistered Nurse for a 13-week contract starting ASAP. We also have other exciting opportunities for Critical Care Nurses, so come for the Spring, stay for the summer, and fall in love with the Autumn in New England!Duties and responsibilities of the Critical Care Registered NurseIdentify patients' age-specific needs and alter care plans as necessary to meet those needs. Provide post-mortem care. Perform approved therapeutic or diagnostic procedures based upon patients' clinical status.Evaluate patients' vital signs and laboratory data to determine emergency intervention needs. Administer blood and blood products, monitoring patients for signs and symptoms related to transfusion reactions.Administer medications intravenously, by injection, orally, through gastric tubes, or by other methods. Advocate for patients' and families' needs, or provide emotional support for patients and their families.Set up and monitor medical equipment and devices such as cardiac monitors, mechanical ventilators and alarms, oxygen delivery devices, transducers, and pressure lines.Requirements of the Registered Nurse - Critical CareMinimum 2 years of experience as a Registered Nurse and minimum 2 years of Critical Care experience requiredWilling to work 7p-7a shiftBLS , ACLS required.Active MA License-Note: If you are not licensed in MA and choose to apply for our state license we will reimburse you once you complete an assignment for us!"}