{"jobID": "2828378489", "jobLocation": "Seattle_WA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.spectraforce.com", "Headquarters": "Raleigh, NC", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Title: Data Analyst  Duration: 12 months W2  Location: Seattle, WA (98019) Description: The Data Analyst is responsible for ensuring the efficiency of Oculus’ cross-functional product safety team, tracking field reports, identifying areas for improvement, and building both long term and ad-hoc solutions. The ideal candidate will have a strong technical, analytical, and operational background. Skills: · Create and iterate on solutions and dashboards to empower operational and exploratory analysis.  · Enforce best practices and alignment with research, analytics, and engineering teams  · Effectively communicate with external clients and internal teams to deliver solutions in a timely fashion  · Respond to (or triage) any and all requests related to customer report data with minimal guidance or oversight  · Document requirements with stakeholders, and partner with Legal and Safety teams on broader changes to core dashboards and solutions Preferred Qualifications: · SQL and Tableau proficiency is preferred  · 2+ years’ experience with SQL (or similar language aimed at querying relational databases)  · The ability to have effective conversations with cross-functional teams about their support needs and requirements  · Enjoys working primarily onsite in a team-oriented environment and highly motivated to provide a positive user experience  · Strong project management skills  · Experience with data management, specifically with validating and auditing data and reports from multiple systems  · Experience manipulating large data sets through statistical software or other methods Education: · BA/BS in a field that emphasizes data analysis and visualization (e. g., computer science, social sciences, physical sciences, math, engineering, or statistics), or equivalent work experience  · 2+ years of experience working with data visualization tools  · Knowledge with Excel (conditional formulas and formatting, charting, etc.)  · Experience initiating and driving projects to completion with minimal guidance  · Experience processing and analyzing data sets, interpreting them for making business decisions  · Experience communicating the results of analyses with product and leadership teams to influence the overall strategy of the product  · Experience working in a customer service or support organization as well as handling sensitive data"}