{"jobID": "2804545454", "jobLocation": "Boston_MA", "jobTitle": "Research Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.newmarkkf.com", "Headquarters": "New York, NY", "Size": "5001 to 10000 employees", "Founded": " 1929", "Type": " Company - Public (NMRK) ", "Industry": " Real Estate", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "51000", "jobDescription": " Research Analyst NewUNITED STATES., MA., BOSTON. Research  Newmark Knight Frank     18001368 Requisition #Apply for Job Share this JobSign Up for Job AlertsNewmark Knight Frank(NKF) is one of the world's leading commercial real estate advisory firms. We provide a fully integrated platform of services to prominent multinational corporations and institutional investors across the globe, as well as to occupiers, owners and developers of real estate on a local, regional and national level.  Together with London-based partner Knight Frank and independently-owned offices, NKF's 14,100 professionals operate from more than 400 offices in established and emerging property markets on six continents.Job Description:Works with other members of the research services staff to provide daily database management and integrity. He/she is also responsible for conducting market analysis, research and reporting for the Transaction, Corporate and Institutional Services Groups.Essential Job Duties:Participates in establishing procedures for acquiring, entering and verifying real estate marketing data related to properties, listings, tenants and comparable transactions for all divisions covered by the district offices.Maintains the market data integrity used in the research function, which includes overseeing data collection, data input/verification and review, by salespeople.Responsible for addressing issues of data quality and will maintain a policy of data security both within and outside the office.Responsible for understanding all company research related database programs including G2.Responsible for the aggregation, analysis, interpretation, and reporting of market research data through internal and outside sources.Works closely with associates to address their research needs and formulates text and graphics for regular market information reports.Monitors the research capabilities of local market competition.Understands all software programs used within the research function.Researches and recommends new programs for the maintenance of research information.Participates in evaluating new sources and existing products.Understands all purchased research-related data sources including but not limited to, tax record information, ownership information and tenant prospect databases.Thorough knowledge of all operations performed by staff members of the client services function and. May assist in training new staff.Assists in training interns and brokers / sales staff in Company software programs.Promote the research function and its capabilities to the brokers / sales staff.Comply with Corporate mandates of reporting appropriate market statistics to corporate personnel and will work with Corporate Research staff to obtain appropriate answers to research questions.Coordinate requests and responses between the local office and Company resources.Maintains the research reference library, including periodicals, reference publications, reference software, plat maps, property brochure files and research files.Research and recommend new subscriptions, prepare related invoices and provide input on subscriptions to the Client Services Manager or District manager for use in developing annual budgets.Attends all divisional specialty meetings and presented relative research activities.Participates in establishing an annual research business plan with the Client Services Manager/District Manager.Conducts and executes Web searches for pertinent data and information related to research and analysis of local, regional and national trends that influence the commercial real estate market.Skills, Education and Experience:Bachelor’s degree (preferably in economics, real estate, finance, urban planning or business administration).Minimum 2-3 years professional experience in real estate analysis, market research or related field.Extensive database and project management experience.Project and staff management experience.Strong analytical, writing and communication skills.Strong organizational and multi-tasking skills.May perform other duties as assigned.Working Conditions: Normal working conditions with the absence of disagreeable elements Note: The statements herein are intended to describe the general nature and level of work being performed by employees, and are not to be construed as an exhaustive list of responsibilities, duties, and skills required of personnel so classified.  Newmark Knight Frank is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected Veteran Status, or any other characteristic protected by applicable federal, state, or local law."}