{"jobID": "2813769894", "jobLocation": "Seattle_WA", "jobTitle": "Market Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.parametricportfolio.com", "Headquarters": "Seattle, WA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "58000", "jobDescription": " At Parametric, we offer competitive salaries, generous benefits and opportunities for growth and development. We invite you to explore our available job opportunities listed below and look forward to having you become a part of our continued success! General Description The Market Data Analyst works within the Investment Operations Department as a subject matter expert in market data, its application and the various business rules that govern it to ensure our business runs smoothly. This person is responsible for daily processes around ensuring accurate market data (specifically pricing, security data, benchmark data), investigates data anomalies through various technologies and tools, and ensures accurate data is consumed into systems. The successful candidate has great communication, solid analytics, high curiosity, and strong attention to detail. This role works closely with the Investment Operations department staff, Portfolio Managers, Information Technology and other teams to ensure that market data is complete and accurate across the entire firm. Primary ResponsibilitiesResponsible for daily processes around market and reference data to ensure accuracy, resolve exceptions, manage data validationResponsible for daily processes around Pricing and Security Information/Maintenance in portfolio accounting systemsExtensive knowledge and understanding of the financial services industry and its unique data requirementsStrong analytical skills with the ability to collect, organize, analyze, and disseminate information with attention to detail and accuracyCommunicate effectively - both verbally and written - to peers and business partners to include strong questioning and listening skills and the ability to look beyond obvious answers to understand impactsMust thrive in managing multiple deadlines and inquiries across several teams and departments in a fast-paced environmentResolves issues quickly with a sense of urgency.Must be able to prioritizeCommunicates clearly and effectively with other managers and internal staffMust be able to self-manage daily and monthly deadlinesJob RequirementsBachelor’s degree required1-2 years’ of experience, preferably in financial operations or data related fieldInsatiable curiosity, self-starter, and detailed focusNatural aptitude for technology and data driven initiativesAbility to self-startPassionate about financial services, dataAbility to work independently in a high volume, fast-paced environment with strict deadlinesLearn quickly and work in a changing environmentCompetent in Microsoft Office programsStrong Interpersonal and communication SkillsStrong attention to detailMarkit EDM and/or Advent products experience preferredExperience with Bloomberg and FactSet preferred Parametric is an equal opportunity employer and is committed to providing a work environment that is free of discrimination and harassment. It does not discriminate against applicants or employees with respect to any terms or conditions of employment on account of race, color, religion, creed, national origin, ancestry, sex, sexual orientation, age, pregnancy, parenthood, physical or mental disability (actual or perceived), medical condition including genetic characteristics, marital status, citizenship status, military service, gender, gender identity, registered domestic partner status, domestic violence victim status, status with regard to public assistance, or any other characteristic protected by applicable federal, state or local laws. Parametric also prohibits discrimination based on the perception that a person has any of those characteristics or is associated with a person who has or is perceived as having any of those characteristics. This commitment applies to all persons involved in the operations of Parametric, and prohibits unlawful discrimination by any employee of Parametric, including supervisors and co-workers. All employment decisions shall be consistent with the principles of equal employment opportunity.  The information on this website is for U.S. residents only and does not constitute an offer to sell, or a solicitation of an offer to purchase, securities in any jurisdiction to any person to whom it is not lawful to make such an offer. Investing entails risks and there can be no assurance that Parametric (and its affiliates) will achieve profits or avoid incurring losses. All investments are subject to potential loss of principal. Parametric does not provide tax or legal advice. Prospective investors should consult with a tax or legal advisor before making any investment decision. Please refer to the disclosure page for important information about investments and risks."}