{"jobID": "2632186779", "jobLocation": "New_York_NY", "jobTitle": "Civil Engineer", "companyRating": "2.3", "companyInfo": {"Website": "www.dragados-canada.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "78000", "jobDescription": "Dragados USA  New York, NY  Civil Engineer SUMMARY: This role will perform a variety of engineering duties by applying basic engineering techniques and analyses. The Engineer at this level is in a developmental mode, and will be trained under close supervision in the utilization of engineering theories and practices, and gaining exposure to Company procedures. PRIMARY RESPONSIBILTIES:Performs various engineering and design assignments requiring the application of basic principles and fundamental theories studied in a four-year university engineering program, and available data in the engineering field.Prepares or assists in preparing fundamental engineering computations, material quantity takeoffs, estimates, surveys, and designs.Assists in the preparation of detailed requisitions for material purchase, services, and subcontracts.Under the guidance of a more senior engineer, assists in reviewing supplier drawing submittals and technical bid analyses.Assists in the preparation and issuance of specifications, data sheets, and other construction documents.Provides input to CAD Designer/Drafters working on the same project.Establish design calculations and plans ensure matching to the guidelines, the code requirements and other regulations.Establish and maintain relationships with clients in order to define their needs, explain technical information, concepts or study results.Verify and complete request for proposals, estimates and other technical documents.Executes additional duties and responsibilities as assignedREQUIREMENTS:Bachelor's Degree from an accredited four-year college or university in Civil Engineering1-3 years of related work experienceKnowledge and experience with Scheduling software (i.e. Microsoft Project), Microsoft Word, Excel, and PowerPointRequires basic engineering knowledge in civil, or a related field.Familiarity with CAD and other PC software packages typically associated with engineering is also required.Organizational ability – able to plan, prioritize, organize and monitor activities and projects. Able to work well in a group environment and foster a team approach.DRAGADOS USA, INC. IS AN EQUAL OPPORTUNITY EMPLOYER"}