{"jobID": "2546511311", "jobLocation": "New_York_NY", "jobTitle": "Travel RN Registered Nurse", "companyRating": null, "companyInfo": {"Website": "www.whiteglovecare.com", "Headquarters": "Brooklyn, NY", "Size": "1001 to 5000 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Travel Nurse – RNWhite Glove Placement, Inc. is a travel nursing agency affiliated with top ranking facilities throughout New York. For the past 2 decades we successfully assigned Travel Nurses – RN Registered Nurse at hospitals, nursing homes, clinics, group homes, correctional centers, home health and more.We are currently hiring Travel Nurses – RN Registered Nurses to help fill vacancies at our client hospitals. If you are an experience RN Registered Nurse, then we would love to hear from you! Call us at 866-387-8100 Ext 202.Take your chance to visit the best of New York – the Empire State. As a cultural icon, New York City will expose you to you to Broadway theatres, exquisite dining, globally influential art, fashion and historic sites. There’s only one New York and there’s no time like the present.What are benefitsfor White Glove Travel Nurses – RN?Variety of RN Travel Nurse Assignments at top ranking facilities – you get to choose which one! Reserve your slot for upcoming orientation so your file can be submitted timely.Daily / Weekly payrollFree housing or tax-free housing/meal stipendsTravel reimbursementNYS license/certification reimbursementFree health and dental insuranceCompletion bonusMetro cardsExtra cash bonus for referring your Nurse friendsAny other benefits you want… just let us know so we can include it in your contract!As a Travel Nurse - RN with White Glove you’ll also get to enjoy complimentary perk that gives you access to 20 – 60% off on movies, hotels, shows, concerts, sporting events and more! Exclusively for White Glove employees… ask us more!Requirementsfor Travel Nurse – RN:NYS Registered Nurse License (our recruiters will assist you in applying for one, plus we reimburse it in your contract)Current or recent experience as RN Registered NurseOur recruiters will take you through the rest of it, guiding you in the process to complete your file so you can start this Travel Nurse - RN Registered Nurse assignment ASAP."}