{"jobID": "2828749216", "jobLocation": "New_York_NY", "jobTitle": "Ethicon Sales Representative Bariatric Thoracic Energy (BTE) Bronx, NY Ethicon US LLC", "companyRating": null, "companyInfo": {"Website": "www.jnj.com", "Headquarters": "New Brunswick, NJ", "Size": "10000+ employees", "Founded": " 1887", "Type": " Company - Public (JNJ) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Abbott Labs, Novartis, Covidien"}, "estimatedSalary": null, "jobDescription": " Ethicon US LLC, a part of the Global Surgery Group within the Johnson & Johnson Family of Companies, is recruiting for a Sales Representative - Bariatric Thoracic Energy (BTE), located in Bronx, NY.  The Ethicon Surgical Care business offers a broad range of products, platforms and technologiesincluding sutures, surgical staplers, clip appliers, trocars and synthetic mesh devicesthat are used in a wide variety of minimally invasive and open surgical procedures. Specialties include support for treatment of colorectal and thoracic conditions, womens health conditions, hernias, cancer and obesity. The Ethicon Surgical Care business combines products and services of two market-leading legacy companies, both with long histories of medical innovation. Ethicon, Inc. based in Somerville, New Jersey, was founded more than 80 years ago as a pioneer in suture development and manufacturing, helping to transform the safety and effectiveness of open surgery. Ethicon Endo-Surgery, Inc. was created 20 years ago in Cincinnati, Ohio, developing innovative devices that have driven the revolutionary shift from open to minimally invasive surgery that continues to lead the industry today. Learn more at www.ethicon.com, or follow us on Twitter @Ethicon  The role of the Sales Representative Bariatric Thoracic Energy (BTE) is to: Expand the sales of specific Ethicon US LLC products and to convert competitive products in a manner that complies with the company policies and sales direction.Own end-to-end selling of appropriate products for BTE (Bariatric Thoracic & Energy) procedures.Focus on driving growth among target specialists and new accounts.Acquire in-depth BTE product/procedure expertise, while covering larger territories.Responsible for understanding and demonstrating proper preparation and surgical use of specific target specialty products.Own end-to-end selling of appropriate products for BT procedures and focus on driving growth among target specialists and new accounts.Acquire in-depth BTE product and procedure expertise, while covering larger territories.Understand and demonstrate proper preparation and surgical use of specific target specialty products. Understand the role that the physicians, nurses, support staff, and hospital administration play in the sales process.Build excellent customer relations with key physicians, hospital personnel, and authorized distributors, as well as conduct customer education seminars as appropriate.Analyze data and stay updated about market information and will be responsible for business planning (e.g. setting priorities and making sound business decisions based on understanding of sales opportunities within accounts).Forecast attainment in assigned accounts. Record sales, customer calls, account visits, and territory achievements.QualificationsRequired Qualifications: A valid Drivers License in one of the 50 United StatesAn undergraduate Bachelors Degree (or equivalent) in an applicable fieldA minimum of 1 year of relevant sales experienceThe ability to work in a lab or operating room environment Preferred Qualifications: 3 or more years experience in outside salesOperating room sales/ medical device experienceCandidates with documented successful sales performance (high growth, results vs. plan), the ability to target accounts and achieve results through a daily action plan and the ability to collaborate with other J&J; associates (peers, marketing, Strategic Account Managers), external companies (distributor reps) and KOLsHospital-based pharmaceutical or medical device experience as well as experience in product sales to a highly educated/high profile customer base is strongly preferred. Johnson & Johnson Family of Companies are equal opportunity employers, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, protected veteran status, disability status, or any other characteristic protected by law.Primary Location United States-New York-New York Other Locations North America-United States-New Jersey-Jersey City, North America-United States-New York-White Plains Organization Ethicon US, LLC (6040) Job Function Selling MD&D; Requisition ID4646180619"}