{"jobID": "2813944236", "jobLocation": "Bellevue_WA", "jobTitle": "Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.symetra.com", "Headquarters": "Bellevue, WA", "Size": "1001 to 5000 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " MetLife, Voya Financial, Prudential"}, "estimatedSalary": "61000", "jobDescription": " Symetra is a dynamic and growing financial services company with 60 years of experience and customers nationwide. In our daily work delivering retirement, employee benefits, and life insurance products, we're guided by the principles of VALUE, TRANSPARENCY AND SUSTAINABILITY. That means we provide products and services people need at a competitive price, we communicate clearly and honestly so people understand what they're getting, and we build products that stand the test of time. We work hard and do what's right for our customers, communities and employees. Join our team and share in our success as we work toward becoming the next national player in our industry.  Symetra's Benefits Division is looking for a Data Analyst to work with our team of actuaries and analysts. This position would primarily support Symetra's Fixed Indemnity Medical and Group Life and Disability product lines.  The primary responsibilities for this role are as follows: Updating and managing databasesCreating monthly and ad-hoc reports for management and external clientsPulling data from SQL-based admin system to improve reporting capabilitiesCompleting industry surveysResponding to ad hoc data requestsImproving processes and creating efficiencies in workflowsBachelor's degree or equivalent with strong quantitative background including college level mathematics.1+ years of professional experience is preferred.Proficient in Microsoft Office products, including Excel, Access, Word and PowerPoint.Proficient with SQL.Strong technical skills and attention to detail are a must.Effective oral and written communication skills.Demonstrated analytical abilities and problem solving.Proven ability to work independently.Commitment to self- development and learning actuarial concepts.Prior insurance or health care industry experience is a plus. Learn more at www.symetra.com/careers.  Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}