{"jobID": "2759847818", "jobLocation": "New_York_NY", "jobTitle": "Nurse Educator", "companyRating": null, "companyInfo": {"Website": "www.vnsny.org", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1893", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Overview Visiting Nurse Service of New York (VNSNY) is the nations largest not-for-profit community-based health system. VNSNY provides a comprehensive array of home- and community-based programs, including health plans, tailored to the needs of high-risk, vulnerable New Yorkers, improving their quality of life. Each day,more than 18,000 VNSNY employees including nurses, rehabilitation therapists, social workers, dieticians, other allied professionals, and paraprofessionals deliver compassionate care, unparalleled medical expertise, and 24/7 solutions and resources tomore than35,000 patients, helping them to live the best lives possible. CA2018 Responsibilities purpose of position Plans, manages, and evaluates clinical orientation and ongoing education and training programs for staff across the Enterprise. Collaborates with regional/program leadership in the delivery of new hire and ongoing clinical education and competency development. Develops new and modifies existing curriculum and training materials to ensure all clinical training and educational needs are met. R ecommends and implements approved changes to ensure effective clinical education and training support for field operations. Partners with Centers of Excellence to develop clinical standards, guidelines, relevant statutes, rules and regulations. Facilitates enterprise-wide consistency of dissemination of standardized clinical education policies, procedures and programs. Works under general direction. responsibilities Manages and delivers Enterprise-wide and program specific clinical education programs designed to foster high quality care through implementation of evidence based practice, performance improvement activities, and professional staff development. Collaborates with Education staff in the development of an annual training calendar to ensure a coordinated approach to ongoing programs. Ensures clinical education programs are aligned with CMS Triple Aim framework: improving the patients experience of care (including quality and satisfaction), improving the health of populations, and reducing the per capita cost of healthcare. Ensures clinical education programs address patient/member centered needs. Identifies and communicates protocols and standards of care for a cultural and demographic diverse patient/member population; provides education intervention guidelines based on these population health needs. Manages implementation of clinical staff development programs such as orientation, in-services, training and other learning activities. Ensures that development and delivery of programs meet the strategic objectives of the Enterprise or specific programs. Ensures all clinical education programs are in accordance with standards of nursing practice, state and federal regulations and Enterprise policies and procedures. Reviews Enterprise-wide and program specific educational program outcomes and program evaluations to determine areas for improvement and makes recommendations for change and/or new programs for clinical education as appropriate. Presents improvement strategies to department leadership. Trains and/or oversees training of new and current staff in Enterprise/program philosophy, policy, standards, procedures, documentation, models for service delivery and efficient, productive, cost-effective work processes. Monitors and evaluates performance of newly hired staff and staff referred on for remedial or additional training. Counsels, disciplines, terminates or extends probation for staff based on performance during introductory, probationary or training period. Designs new and modifies existing educational curriculum and training materials to ensure staff has current knowledge and competencies to meet program contractual and regulatory compliance. Conducts educational needs assessment in collaboration with operations staff to identify learning needs among staff. Analyzes and utilizes assessment data to plan for program educational sessions. Develops education programs such as workshops and/or group learning activities; follows up to ensure programs are effectively implemented. Identifies performance issues and develops performance improvement plans for tenured employees in collaboration with Program management. Evaluates competency and performance in conjunction with program management. Reviews and evaluates clinical orientation and ongoing educational program outcomes to determine areas for improvement and recommends changes to current orientation program as appropriate. Participates in the development of revised programs and/or materials. Communicates ongoing e-learning opportunities. Evaluates e-learning usage and effectiveness; identifies opportunities for distance learning. Manages the Internship Program in collaboration with the College Relations department. Assists with program planning, problem solving and evaluation of interns. Assesses productivity and performance, analyzes problems and recommends and implements solutions. Analyzes course evaluations in order to evaluate effectiveness of training sessions and to implement improvements. Participates in the development of annual clinical education strategic goals and objectives. Utilizes resources and practices sound fiscal responsibility; provides input for the development of the department budget. Monitors expenditures and ensures compliance with budgetary constraints. Collaborates with Quality department in the development of and implementation of education related training programs. Ensures program content is presented in a manner that promotes learning and enables trainees to meet competency requirements. Demonstrates services excellence and creates and implements education and training programs which are centered on the goals and strategies of the Enterprise. Performs other supervisory related duties and projects as assigned. Participates in special projects, serves on committees and performs other duties, as required. competencies Accountable/Results-Oriented Adaptability/Flexibility Business Acumen Communications (written and oral) Customer Focus Initiative/Innovation Interpersonal Effectiveness Problem Solving Teamwork and Collaboration Change Management Project Management Strategic Management qualifications Licensure: Current license and registration to practice as a Registered Professional Nurse in New York State required. Education: Bachelors or Masters degree in nursing required. Certification in Nursing Education preferred. For internal candidates who do not meet this requirement, the candidate is required to be accepted to an accredited program, currently registered for course(s), and committed to remaining continuously enrolled until completion of the program and attainment of the degree to meet this qualification. Experience: Minimum four years experience in a community based or long term home health setting, including at least two years with a primary focus on education and training, required. Knowledge of health care delivery systems, patient care, care coordination, and clinical processes required. Experience assessing and designing clinical education programs preferred. Experience in a health care setting in a teaching capacity with an understanding of adult education and learning processes preferred. Effective oral and written communication, presentation, analytical, coaching and organizational skills required. Knowledge of computer applications required."}