{"jobID": "2702067788", "jobLocation": "Menlo_Park_CA", "jobTitle": "Real Estate Research Intern", "companyRating": "3.6", "companyInfo": {"Website": "www.jll.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1997", "Type": " Company - Public (JLL) ", "Industry": " Real Estate", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " CBRE, Cushman & Wakefield"}, "estimatedSalary": "66000", "jobDescription": " Timeframe: Summer 2018  The Research Intern will get a first class introduction to a Fortune 500 commercial real estate services firm, gain direct access to the Silicon Valley real estate market, build detailed market knowledge and prepare yourself for a wide range of careers -- ranging from entry-level GIS/Research to real estate brokerage.  General Qualifications Self-driven individual with an interest in working with dataDetail-oriented, highly organized and creativeAbility to work under deadline pressureInterest in commercial real estateCollege sophomore or above.Duties & Responsibilities:Manage review process for lease informationValidate data and correct information in JLL's databaseVerify third party lease informationConduct and organize web research into actionable datasetsHelp with web research for data products in progressResearch up-and-coming trends in the technology sector and greater economyManage lease and sale information databasePull and save availabilities each quarterConduct custom research on building informationBe a point of contact for questions about lease/sales compsEnter new sales comps and update property ownership in databaseMerge, clean, and validate different datasetsAssist with custom data productsResearch tenant industries using external databasesConvert property brochures and manage catalog in cloud storageAssist with harvesting data from external databasesBe a point of contact for questions about data fieldsTechnical Qualifications:Strong Excel skillsAdept at learning new software programsKnowledge of relational databases#LI JLL Is an Equal Opportunity Employer  JLL is committed to developing and maintaining a diverse workforce. JLL strongly believes in equal opportunity extended to all individuals in all aspects of the employment relationship, including recruitment, hiring, training, promotion, transfer, discipline, layoff, recall and termination without regard to race, color, religion, belief, creed, age, sex, pregnancy or maternity (including childbirth and related conditions), family responsibility (e.g. child care, elder care), nationality, ethnic or national origin or ancestry, citizenship, marital status, civil partner status, sexual orientation, gender identity or expression, transgender status, veteran's status, genetic information, trade union membership, social position, political view or status as a qualified individual with a disability, protected leave status or any other protected characteristic in accordance with applicable law. The company also endeavors to make reasonable accommodations for known physical or mental limitations of otherwise qualified employees and applicants with disabilities unless the accommodations would impose an undue hardship on the operation of our business and ensures that employment decisions are based only on valid job requirements.  For employees in the United States, please see a fully copy of our Equal Employment Opportunity and Affirmative Action policy at https://jll2.sharepoint.com/CorporatePolicies/HR%20Policies/Equal%20Employment%20Opportunity%20and%20Affirmative%20Action.pdf.  If you have questions about careers at JLL or are disabled and require further assistance in applying for a position, please contact us at careers@am.jll.comSDL2017"}