{"jobID": "2485820987", "jobLocation": "Mountain_View_CA", "jobTitle": "Wax Specialist", "companyRating": null, "companyInfo": {"Website": "www.waxcenter.com", "Headquarters": "Hallandale Beach, FL", "Size": "1 to 50 employees", "Founded": " 2004", "Type": " Franchise", "Industry": " Consumer Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " LunchboxWax, Waxing the City, Hand and Stone Spa"}, "estimatedSalary": null, "jobDescription": "Job DescriptionEuropean Wax Center | Mountain View  1039-L El Monte Ave.  Mountain View, CA 94040  El Monte Shopping Center  GOT A PASSION FOR WAXING? NOW HIRING WAX SPECIALISTS  Got a passion for waxing and want to boost your career? Then join our growing family of Wax Specialists at European Wax Center! As a Wax Specialist, you'll be a friendly and passionate team player who can hit the ground running while also building your skills with our comprehensive training program. We're in the business of Revealing Beautiful Skin, and with your help, you'll give your guests a reason to walk in, and strut out.  To encourage loyal guests, we offer incentives (packages and memberships) and use local and national advertising to promote guest frequency. And to ensure your guests always receive the best results, European Wax Center has an exclusive line of skin and brow-care retail products.  Here's what we're looking for: A licensed Esthetician or Cosmetologist in California, willing to learn new techniques.A positive, friendly, upbeat and personable demeanor.A professional appearance at all times.Capability to do all types of body waxing.Ability to work in a fun, fast-paced environment.Ability to work flexible days and hours.Sales experience is preferred. Benefits: Discounts on all retail products.Great referral program.Free Body Waxing.A fun, well-managed, successful work environment.Hourly wage, commission and bonus program.Career Growth.Benefits for full time employees include health insurance and paid vacation.Competitive Salary:Earn $45,000-$65,000 as a Wax Specialist, working an average of 30 hours per week About the Company:  Visit us at www.waxcenter.com and discover how European Wax Center is committed to Revealing Beautiful Skin. You can also fill out an application online by visiting www.waxcenter.com/careers"}