{"jobID": "2689983703", "jobLocation": "San_Francisco_CA", "jobTitle": "Investment Banking Analyst - Technology", "companyRating": null, "companyInfo": {"Website": "www.catapultadvisors.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Catapult Advisors is currently looking to hire an analyst to assist us in the areas of business development, transaction execution, industry research and general business-related tasks. The successful candidate will ideally have at least one year of relevant experience working in a similar capacity at another investment bank or in a related field. Catapult may be willing to consider an exceptional candidate with less formal experience.  The successful candidate will be a highly motivated self-starter with a natural curiosity about technology trends who is comfortable working in an entrepreneurial, small firm setting. The analyst will support small deal teams and have regular interaction with senior members of the team as well as clients. Ability to work efficiently and organize/track overlapping tasks in a fast-paced environment with frequent priority changes and minimal supervision is essential.  Activities include:  · Track and analyze relevant industry trends and data, including M&A; and financing activity  · Prepare materials, including investment summaries, management presentations and pitch books  · Develop and revise financial models to support M&A; and capital raising transactions  · Perform due diligence, research, analysis, and documentation of live transactions  · Assist in marketing M&A; and Private Placement transactions  · Perform in-depth research of technology sub-sectors  · Assist in the recruiting, training and supervision of interns  Qualifications:  · Bachelor’s degree in economics, business or STEM field with strong academic performance  · 12+ months prior experience in financial services is preferred, but not required for exceptional candidates  · Strong interest/experience in the technology industry  · Excellent written and oral communication skills  · Strong quantitative understanding and financial modeling skills  This position offers competitive compensation and a comprehensive benefits package.  If interested, please submit a resume and cover letter explaining in detail why this position is a good fit for you to careers@catapultadvisors.com. No phone calls. The position, based in our San Francisco office, is full-time and available immediately. Relocation is not available."}