{"jobID": "2693136428", "jobLocation": "San_Diego_CA", "jobTitle": "Senior Customer Experience Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.servicenow.com", "Headquarters": "Santa Clara, CA", "Size": "5001 to 10000 employees", "Founded": " 2004", "Type": " Company - Public (NOW) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " BMC Software, CA Technologies, Salesforce"}, "estimatedSalary": "69000", "jobDescription": "Senior Customer Experience Data Analyst ServiceNow, The Enterprise Cloud Company, is the industry-leading cloud platform provider for building enterprise applications. We are redefining markets and changing the perception of enterprise software. Our cloud platform allows enterprises to bring together business strategy, application design and operations in a powerfully simple solution.  To sustain our explosive growth, we are looking for drivers—people who thrive on responsibility and live for the next big challenge. We seek to employ the brightest and most forward-thinking talent on the planet, and we want to hire people who have their best work ahead of them, not behind them. Accelerate your career and succeed in an environment where you can make an impact daily. We invite you to join in to stand out.  ServiceNow is seeking an Analyst for the Customer Experience Voice of the Customer Program within Success Management organization. We are looking for someone who is excited to be part of a comprehensive and growing Customer Experience program for ServiceNow.  The ideal candidate should be passionate about customer data, with a proven history of driving insights that improve the customer experience. A can-do attitude, with the expertise to deliver. Willing to roll up their sleeves in a \"start-up-like\" environment, building from the ground up and facilitate quantitative and qualitative customer survey programs across multiple functional areas. Able to aggregate, analyze and interpret primary and disparate data across multiple data sources and formats. Execute new measurement programs and refresh existing programs as needed to provide a more holistic voice of customer assessment for ServiceNow. Responsibilities: The Customer Experience Data Analyst must utilize different technologies to gather and synthesize customer feedback data with associated business data to determine key drivers of customer success, loyalty, risk, churn and overall experience, and then translate that into actionable insights.Top line and in-depth analysis of customer data to determine significance of trends and impact on business and customer healthPerform recurring statistical analysis on Voice of the Customer data and determine key insightsAggregate and compare data from various sources for ad-hoc analysesCollaborate with Data Science teams for predictive analytics and recommendationsReconcile and validate data across systemsMaintain an awareness of key industry trends to provide context for the performance analysis and recommendationsRequired Skills / Experience:Bachelor`s degree in Math, Statistics, Business, Data Science, Computer Science or similar field; Advanced degree preferredAt least 5-10 years direct experience, preferably in Customer Experience, or Market Research in an IT, SAAS, or Fortune 500 CompanyKnowledge of a variety of survey design and research methodsExperience with multivariate techniques including correlation and regression; able to develop plans of analysis neededStrong technical skills, and must be expert level in MS Excel, R, SPSS, SQL, or related analytic toolsDemonstrated passion for Customer Experience and acting as an advocate for customersStrong organizational, critical thinking, influencing, and relationship management skillsExperience using Martiz, Qualtrics, Gainsight or similar enterprise level survey tools a plus"}