{"jobID": "2819941577", "jobLocation": "Cambridge_MA", "jobTitle": "Data Scientist, Chemical Biology & Therapeutics", "companyRating": "3.7", "companyInfo": {"Website": "www.novartis.com", "Headquarters": "Basel, Switzerland", "Size": "10000+ employees", "Founded": " 1996", "Type": " Company - Public (NVS) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "122000", "jobDescription": "Posting Title Data Scientist, Chemical Biology & Therapeutics  04-Jun-2018 Job ID242840BRJob Description We are seeking a data scientist to join the Chemical Biology and Therapeutics (CBT) group in NIBR to help us develop and deliver cutting edge therapies to benefit patients. The bioinformatics scientist position plays a key role in an interdisciplinary team of wet-lab biologists, physician scientists, and computational scientists to develop mechanistic hypotheses addressing unmet medical needs. The role will have a particular emphasis developing therapies derived from microbiome research programs, which are a part of the broader CBT discovery portfolio in which the successful candidate will participate. This position will focus on a wide range of applications leveraging large scale data from model systems and human genetic/genomic studies to generate testable therapeutic hypotheses, including the nomination of biomarker and target hypotheses. The successful data science candidate will work closely with CBT biologists to provide informatics systems to support the exploratory research and drug discovery process. The ideal candidate must demonstrate a proven ability to work collaboratively to provide high quality research and have hands on experience in bioinformatics. Key responsibilities include:Work with other data scientists, computational engineers, and laboratory scientists to determine scientific project needs and deliver high quality in silico researchIntegrate ‘omics data to collaboratively support large-scale data mining of public and private resources to support biomarker and target discovery aimsDevelop, maintain, and utilize cutting-edge pipelines for the processing and analysis of high-throughput dataMinimum requirements Ph.D. or M.Sc. in a biology or computer science field, or related discipline, supported by a strong publication record Demonstrated, strong communication skills, written and oral, and a successful track record of collaborating with cross-functional scientific teamsFluency in SQL and R or Python is a prerequisite, and/or demonstrated Linux/Unix competencyDemonstrated working knowledge of statistics and data modelingExperience in integrated modeling of genomics, transcriptomics, proteomics and/or metabolomics dataExperience with microbial metagenomics analysesDemonstrated effective and creative problem solving skills accounting for logistic and scientific constraintsExperience handling and modeling clinical data is a plusA willingness to learn and to share your learningsExperience with current machine learning techniques is a plusIndustry working experience is a plusJob Type Full Time CountryUSAWork Location Cambridge, MA Functional Area Research & Development DivisionNIBRBusiness UnitCBT - NIBREmployment Type Regular Company/Legal EntityNIBRIEEO Statement The Novartis Group of Companies are Equal Opportunity Employers and take pride in maintaining a diverse environment. We do not discriminate in recruitment, hiring, training, promotion or any other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, marital or veteran status, disability, or any other legally protected status. "}