{"jobID": "2709919083", "jobLocation": "San_Jose_CA", "jobTitle": "Clinical and Business Development Educator", "companyRating": null, "companyInfo": {"Website": "www.janmarini.com", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Obagi Medical, SkinMedica"}, "estimatedSalary": null, "jobDescription": " Clinical and Business Development EducatorWe are a quickly expanding aesthetic company based in California that offers its employees an exciting opportunity to grow professionally in a rewarding and supportive environment. This position provides the ability for an individual who is motivated and passionate about the aesthetic industry to inspire others to take action towards greater success. This is a person who strongly believes they can support others with strategies and tools to achieve business growth.  The company offers an amazing opportunity to be creative and strategic, and make a difference on a daily basis. Join our team of highly motivated professionals and experience the thrill of being a part of a leader in the medical skincare industry.  The company, Jan Marini Skin Research, Inc. was founded in 1994 and is a recognized leader and innovator in skincare that is committed to continually expanding and improving the professional skincare market. JMSR's two primary focuses are to provide innovative technologies that deliver proven measurable results and an unwavering commitment to the ongoing success of our customers.  Qualifications for a career you can thrive in: An RN or aesthetician with a sales and/or sales management background who can motivate others through educationCommitted to excellence in providing the highest level of education for development and growth of the JMSR sales team and valued resellersPassionate and inspiring – a belief builderProfessional, polished, articulate and succinct in communicating a message – a credible resourceA dynamic and engaging speakerCan read an audience, think on their feet and motivate people in different roles within an aesthetic business to take actionExcellent communication skills to work with resellers across the countryActive listening with intent to connect with others, identify needs and develop solutionsStrategic and skilled at creating content and tools in alignment with our corporate message based on the needHas strong business development experience to work with Account Development Managers and Regional Sales Managers in developing reseller accounts through business partnership strategiesAble to support the growth of Account Development Managers; especially new hiresAble to set and achieve educational objectives for successAble to travel a minimum of 50% up to 75% of the timeA minimum of 2 years of experience performing skincare treatments in a clinical environmentAbility to perform and demonstrate chemical peels and facial protocolsPrevious experience as an educator in the skincare industry – will need to demonstrate experience by preparing and conducting a presentation during the interview processMust be proficient in Microsoft Office products; especially Outlook, Word and Powerpoint.  Must also be able to use Adobe Acrobat and GoToWebinar. We offer an exceptional compensation and benefits package which includes: medical, dental, vision, group life, 401k, paid holidays and PTO. We also offer expense reimbursement for travel and work related expenses.  Are you ready to take your career in the skincare industry to the next level? Start here and apply today: h.r@janmarini.com. An HR representative will reach out to you directly. We look forward to hearing from you and thank you for your interest in Jan Marini Skin Research. Connect with us on LinkedIn"}