{"jobID": "2261924343", "jobLocation": "Redmond_WA", "jobTitle": "Market Research Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.blueoceanmi.com", "Headquarters": "Seattle, WA", "Size": "201 to 500 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "67000", "jobDescription": " Blueocean is a next-generation services organization with a deep focus on market intelligence, data analytics, and social intelligence, all uniquely delivered under one roof by skilled professionals. By combining the talent, speed and cost benefit of a flat world, along with their scalable delivery model, we are able to achieve a more nuanced and comprehensive understanding of the market at the delivery speed and price advantage that todays business climate demands. More information can be found at www.blueoceanmi.com.  The Data Analyst position is a critical role and will be focused on supporting one of Blueoceans key technology vertical clients. We are looking for a strong professional with hands-on experience with all manner of data sets, tools and most importantly statistical methodologies.  This is a full time position located at the client site in Redmond, WA. ResponsibilitiesWork closely with our client to understand their business questions, the data assets they have available and make impactful recommendations about how specific techniques can generate insights to drive their businessConduct data analysis that helps the business understand the key stories from their attitudinal survey data, both within a survey and across multiple surveysClearly communicate the value of the analytical findings and be able to connect with business decision makers who may be less familiar with statisticsPartner with our India based market intelligence and analytics teamAssist in supporting project management needs including scheduling, project planning, meeting notes, action items, documentation, SharePoint sites etc.QualificationsMinimum Bachelors Degree with 3-5 years working in a field such as Market Research, Business Intelligence, Statistics, EconomicsVendor and client experience preferredAbility to think strategically and assess key client /business issues being addressedVery strong analytic, communication, leadership and interpersonal skills required for synthesis of data and interpretation of resultsSubject matter expert in Statistics as well as tools such as SPSS, SQL, SAS, R, etc.Ability to interface well with all levels of the organization, partnering well across all geographies and functionsNice to have: Experience with Dashboards: Tableau, PowerBI, etc..."}