{"jobID": "2816664415", "jobLocation": "Brooklyn_NY", "jobTitle": "Now Hiring! Part Time Teachers", "companyRating": null, "companyInfo": {"Website": "www.huntingtonhelps.com", "Headquarters": "Oradell, NJ", "Size": "5001 to 10000 employees", "Founded": " 1977", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "NOW HIRING PART-TIME TEACHERS – ALL SUBJECT AREAS AND EXAM PREP!IMMEDIATE PART-TIME OPENINGS IN YOUR AREA!Since 1977, Huntington has been changing the lives of children. As a leader in the tutoring and test prep industry, our success is attributed not only to our highly acclaimed instructional programs, but to the amazing teams of qualified and devoted professionals who commit themselves to helping students achieve success in school each and every day.At Huntington, we are eager to continue to build our teams! We seek to hire the best, most talented professionals into our organization. If you are a qualified, caring and dedicated teaching professional, interested in spending your time working directly with students, we'll give you the opportunity to do what you love to do - TEACH!The Opportunity:Work with students in a 1 to 1 setting, or a small group up to 4There are no lesson plans to write or homework assignments to grade!Flexible, part-time hours – afternoon, evening, weekend and summerCompetitive hourly rate and paid trainingProfessional development opportunitiesRequirements include: 4 year degree requiredCertification/license strongly preferred, but not requiredAll experience levels are welcome to apply – recent grads, current teachers & retired professionalsCenter locations include:New Jersey: Brick, Bridgewater, East Brunswick, Edison, Englewood, Livingston, Manalapan, Middletown, Morristown, Ridgewood, Springfield, Verona, Wayne and Westwood.New York: (Long Island) Baldwin, Bay Shore, Carle Place, East Northport, Lynbrook, Manhasset, Massapequa, Patchogue, Plainview, and Smithtown; (NYC Boroughs) Manhattan, Brooklyn, Bronx, Queens, and Staten Island; (Westchester/Rockland) Scarsdale, Hartsdale, Yorktown, and Nanuet.Interested in applying?Enhance your resume with experience that is highly respected in the field of education. If you meet the above requirements and are interested in applying, send your resume to the link provided.We have additional locations throughout the Tri-State AreaFor more information, visit our website at HuntingtonHelps.com."}