{"jobID": "2831372635", "jobLocation": "New_York_NY", "jobTitle": "Director of Corporate Partnerships", "companyRating": null, "companyInfo": {"Website": "www.japansociety.org", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Arts, Entertainment & Recreation", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Director of Corporate Partnerships will oversee and advance all aspects of corporate giving, including maintenance of existing accounts, identifying prospects, and recruiting new corporate members and sponsors. The Director will collaborate with senior management to design and implement effective strategies to increase corporate giving by Japanese corporations in the US, as well as American corporations conducting business in Japan and with Japanese corporations. The Director, Corporate Partnerships will be an integral part of the Development team, working hands-on with program areas and Special Events on cultivation events, as well as fundraising campaigns and the annual dinner. ESSENTIAL DUTIES AND RESPONSIBILITIES: ·  Develop the strategy and execute a plan to increase overall corporate support for Japan Society;  ·  Serve as the frontline for corporate membership, overseeing monthly renewals, upgrade and solicitation materials, telephone and email inquiries, and providing customer service/troubleshooting;  ·  Research and identify corporate member prospects; create and implement cultivation strategies to increase overall corporate membership revenues through upgrades, new memberships and cross-selling opportunities such as rentals, Webcast services, and program sponsorships;  ·  In coordination with program areas, research and identify potential corporate sponsors for gallery exhibitions, film, performing arts, education, corporate, policy and other program areas as appropriate;  ·  Work with the Media & Marketing Department on corporate membership-related collateral materials, including membership-related aspects of Japan Society’s website and online presence;  ·  Collaborate with program areas and Special Events on cultivation events, fundraising campaigns and the annual dinner;  ·  Conduct cultivation visits with existing and potential donors, and cultivate members at Japan Society programs on a regular basis throughout the year;  ·  Fulfill corporate member and sponsor benefit obligations and requests, including complimentary gallery passes, Executive Courtesy Cards, complimentary catalogues, and invitations to programs and openings;  ·  Manage annual revenue budgets and forecasts;  ·  Oversee data entry in Raiser’s Edge related to corporate members and sponsors and corporate prospects;  ·  Prepare correspondence, marketing materials and related documents, including proposals, acknowledgement letters, benefits and report drafts;  ·  Oversee credit lines of corporate sponsors in coordination with Director, Foundation & Government Relations;  ·  Oversee airline contracts and ticket usage and report to Finance Department as needed. REQUIREMENTS: ·  Bachelor’s degree and a minimum of six to eight years nonprofit corporate sales, corporate sales, corporate membership program management, and/or corporate fundraising experience;  ·  Proven track record in successfully cultivating and soliciting corporate partners;  ·  Possess superior written, verbal, and intercultural communication skills;  ·  Excellent interpersonal and presentation skills essential  ·  Superior networking skills, relevant professional networks, and expert at building external relationships;  ·  Must be a hands-on, resourceful team player able to collaborate with and build consensus with colleagues inside and outside the organization;  ·  Prior experience managing and supervising staff;  ·  Experience with database processing (preferably Raiser’s Edge) required;  ·  Familiarity with Japanese culture required. Japanese language skills a plus.  ·  Must be willing to work evenings and weekends as necessary;  ·  Experience in the nonprofit sector a plus.  Founded in 1907, Japan Society in New York City presents sophisticated, topical and accessible experiences of Japanese art and culture, and facilitates the exchange of ideas, knowledge and innovation between the U.S. and Japan. More than 200 events annually encompass world-class exhibitions, dynamic classical and cutting-edge contemporary performing arts, film premieres and retrospectives, workshops and demonstrations, tastings, family activities, language classes, and a range of high-profile talks and expert panels that present open, critical dialogue on issues of vital importance to the U.S., Japan and East Asia. For more information, visit our websitehttp://www.japansociety.org."}