{"jobID": "2795875994", "jobLocation": "New_York_NY", "jobTitle": "Game Manager Intern", "companyRating": null, "companyInfo": {"Website": "www.tiltingpoint.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Flaregames, Kongregate, Scopely"}, "estimatedSalary": null, "jobDescription": "Our Game Manager Intern will partner closely with Tilting Points Game Management team to design and implement, across multiple games, features aimed at monetizing, engaging and retaining players, as well as collecting, analyzing and interpreting data about the games performance and economy. Youll participate in developing and refining the economy of several games, while collaborating with the Game Management team to ensure that key features are properly defined, implemented and evolved. Your Future at Tilting PointWork with Tilting Points Game Management team in defining, balancing and managing the economy of their games; review reporting on usage/earning/purchasing to ensure economy is healthyAssist Game Manager with PnL modeling and forecastingCoordinate externally with development partners and internally with all departments (Marketing, Production, Business and Data) to drive a seamless execution of the game roadmap.Provide regular feedback on partners plan in terms or monetization, engagement and retention features, and work with the Game Manager to address any issue in that respectOptimize game features by performing A/B and multivariate testsReview KPI reports and act to drive new initiatives to optimize monetization and engagement of the customer baseParticipate in the management of 3rd party technology and tools (business intelligence, analytics, A/B testing etc.) to be used by Tilting Point and by developer partnersAdvise on additional revenue opportunities, and work with development partners to evaluate and implement themYour XP & SkillsExperience as Game Manager / Product Manager for mobile games or applications is preferredCompleted BS in computer science, statistics, mathematics or economicsExcellent quantitative skills and an understanding of statistics and trendingStrong problem solving skills with unique ability to look at large complex data sets and formulate conclusionsA passion for games and knowledge of the games industryAbility to draft wireframes and product specificationsSelf-starter, able to work autonomouslyStrong written and oral communication skills and ability to work with creative partnersAbility to work on multiple projects in parallel while meeting changing deadlines and prioritiesPositive attitude and a love for problem solvingInterested? We would love to hear from you. Just send us your resume and cover letter below (and tell us about your passion for mobile and/or free-to-play games!)  Direct applicants only - No agencies/headhunters please. This role is not eligible for remote location or work from home at this time. Tilting Point provides equal employment opportunity to all individuals regardless of their race, color, creed, religion, gender, age, sexual orientation, national origin, disability, veteran status, or any other characteristic protected by state, federal, or local law. Discrimination of any type will not be tolerated. This policy applies to all terms and conditions of employment, including recruiting, hiring, promotion, termination, time off, and compensation."}