{"jobID": "2389527371", "jobLocation": "New_York_NY", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.adtheorent.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Data ScientistNew York City, NYJob Description:AdTheorent is an ad network engaged in real time bidding to reach the ideal audience for each advertising campaign. We are looking to hire a results-oriented data scientist with experience in data analysis and predictive modeling. Experience in advertising or real time bidding is a plus. The job will involve research, analysis and coding to improve our current technology and develop innovative new solutions to the problems posed by real time bidding. This is an exciting opportunity for a skilled professional (junior or senior) to apply big data techniques to work within a very fast-growing industry.Responsibilities: Independently manipulating and analyzing high volume, high-dimensionality real time bidding (RTB) data in order to identify relationships and trendsBuild predictive models using machine learning algorithms to optimize advertising campaignsVisualize results of statistical analyses in the form of graphs, charts, tables and scorecardsRequirements:Degree in Computer Science, Machine Learning, Operational Research or another relevant technical field (B.S. M.S. or Ph.D.)Familiarity with relational databases and SQL, data transformation (ETL), data mining, ad-hoc analysisExtensive experience with Python, R, Stata, SAS, Matlab or another statistical languageExtensive experience solving analytical problems using quantitative techniquesA passion for empirical research and for answering hard questions with data in a clear and precise wayAbility to take high level, loosely-defined business problems and identify precise, quantitative solutionsExperience with big data software and techniques such as Hadoop is a plusExperience in advertising or real time bidding is a plus Location: New York  We offer full health coverage, generous PTO, great office culture.  We are an Equal Opportunity Employer.  AdTheorent™ is the world’s first Predictive Targeting platform for mobile. Learn more here.About AdTheorentAdTheorent is a technology company that is transforming advertising through data-driven predictive solutions. AdTheorent’s machine learning, tracking and deep linking technologies combine to maximize engagement and awareness for advertisers."}