{"jobID": "2400834943", "jobLocation": "New_York_NY", "jobTitle": "Sales & Marketing Intern", "companyRating": null, "companyInfo": {"Website": "www.aircall.io", "Headquarters": "Paris, France", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Aircall is a fast-growing Software as a  Service (SaaS) tech company looking for outstanding interns to work  side-by-side with our passionate, hard-working team in New York City. Aircall is a cloud based phone system app for small and medium business teams. This  sales and marketing intern role is an essential part of the new customer  acquisition process. Well provide and  teach you the tools and methodology to get started, but youll have to show  autonomy and initiative to succeed. You wont be just a sales admin, you will  be part of the sales strategy having a direct effect on Aircalls growth and  success. You will work closely with Aircall  sales and marketing employees to research target customers, map accounts for  prospecting, create and send marketing acquisition emails and support sales  operations activities. We seek interns who are passionate about the tech company industry, sales and marketing, want  to be part of a hard-working team, and are eager for professional development.  Day to day activities  include:  ·  Identifying relevant  sales targets by finding companies who match Aircalls Ideal Customer Profile.  ·  Mapping accounts by finding  contact details for relevant employees at potential target customers by sending  emails and making phone calls.  ·  Entering all  information into salesforce.com to ensure our database is up to date.  ·  Contacting prospects  by phone to qualify them and schedule demos with our sales team.  You will learn and gain experience in many  sales and marketing concepts including:  ·  The SaaS sales cycle  and customer buying cycle.  ·  Using various cloud-based tools including sales force automation, customer relationship management,  email marketing and our inbound/outbound phone platform.  · Identifying and researching new sales  opportunities thanks to growth hacking techniques that well teach you. Requirements ·  Seniors or Juniors at  competitive schools studying business, marketing, economics or related  subjects.  ·  Effective  communication skills - extremely clear, direct, timely, and accurate  communication is required including outstanding written and spoken English. Fluency  in other languages a plus.  ·  Data oriented, with  some experience working in Microsoft Excel.  Past success in science, statistics and mathematics courses.  ·  An entrepreneurial  spirit - Our team is hard working, self-motivated and confident.  ·  Passion for the tech  startup industry.  ·  Past business  development experience a plus.  ·  Comfort managing  several tasks and issues in a fast-paced environment Compensation · Competitive hourly salary  · Cool offices in NYC with causal dress code  · Soft drinks, snacks, ping pong  · Great resume builder working in a fast growing tech  startup  · Possibility for full time positions after  graduation for top performers"}