{"jobID": "2791343735", "jobLocation": "New_York_NY", "jobTitle": "Blockchain and Distributed Ledger Technologies - Architect", "companyRating": "3.6", "companyInfo": {"Website": "www.ibm.com", "Headquarters": "Armonk, NY", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Public (IBM) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Accenture, Microsoft"}, "estimatedSalary": "81000", "jobDescription": "Job Description Do you have a passion for coding on cutting edge technology? Are you ready to take your Blockchain technology expertise to the next level? Do you like to travel? Are you self-motivated and seek to explore new technologies? Apply now!  IBM Global Business Services (GBS) is hiring strong Managing Consultants who architect and develops technical solutions to solve business problems in several industries using Blockchain and Distributed Ledger Technologies such as Hyperledger, Ethereum, and Ripple.  We are the world's largest consulting services organization. GBS provides clients with business transformation and industry expertise, and the ability to translate that expertise into integrated, responsive, and innovative business solutions. We offer consulting services across multiple industries and cover the whole process chain from strategy consulting through to the construction, implementation and operation of technical and commercial solutions.  Whether you are a hands-on architect or a hard-core developer, you will have an opportunity to take your skills and career to next level.  We prefer are architects who live in the New York City/Jersey City, New Jersey or Dallas area, however, we are open to candidates in who live within a 50-mile radius to a major metro airport. You will have the opportunity to interact directly with clients and will be required to travel up to 75%. Responsibilities include:Hands-on architect & developer who can take part in the entire development life cycleResponsible for architectural reviews, design reviews and consultationsImplement design principle to architect and solution business problemsFollow and standardize the best practices from the industry and apply them in the project builds.Maintain extreme engineering rigor with all aspects of code and development routinesDevelop methods and tools to be used to test, monitor and implement new solutions using Blockchain and Distributed Ledger technologiesAbility to lead and manage a team and execute projects and deliver solutionsProvide Project Management oversight as neededDevelop and deliver business strategy and implementation plansDesign, develop, and deliver complex Distributed Ledger/Blockchain technology applicationsConceptualize and develop relevant use cases, proof-of-concepts (POC), proof-of-value (POV)Generate repeat sales at assigned client and support sales efforts of the practiceManage client relationshipsLead teams to successful deliveryBuild Industry and region-specific IBM viewpoint/offerings for Blockchain.Be the trusted advisor for our clientsTop notch process re-engineering skills to help transform industry processes through BlockchainExpected to support new signings opportunities in Blockchain for the region both at Individual Lead level and Team level. Create awareness and deliver IBM's POV on Blockchain in our key account.BENEFITS Health Insurance. Paid time off. Corporate Holidays. Sick leave. Family planning. Financial Guidance. Competitive 401K. Training and Learning. We continue to expand our benefits and programs, offering some of the best support, guidance and coverage for a diverse employee population. http://www-01.ibm.com/employment/us/benefits/https://www-03.ibm.com/press/us/en/pressrelease/50744.wssCAREER GROWTH Our goal is to be essential to the world, which starts with our people. Company wide we kicked off an internal talent strategy program called Go Organic. At our core, we are committed to believing and investing in our workforce through: Skill development: helping our employees grow their foundational skillsFinding the dream job at IBM: navigating our company with the potential for many careers by channeling an employees strengths and career aspirationsDiversity of people: Diversity of thought driving collective innovationCORPORATE CITIZENSHIP With an employee population of 375,000 in over 170 countries, amazingly we connect, collaborate, and care. IBMers drive a corporate culture of shared responsibility. We love grand challenges and everyday improvements for our company and for the world. We care about each other, our clients, and the communities we live, work, and play in! http://www.ibm.com/ibm/responsibility/initiatives.htmlhttp://www.ibm.com/ibm/responsibility/corporateservicecorpsPRIDE18 PRIDE18NA Required Technical and Professional Expertise At least 8 years of experience with Java DevelopmentAt least 5 years of experience with ArchitectureAt least 3 years of experience with UNIX/LINUXAt least 5 years of experience using versioning tools (Github or Similar)At least 5 years of experience working in Agile/ScrumAt least 5 years of experience in an industry architecting softwareAt least 5 years of experience taking multiple application to productionAt least 4 years of experience with building and managing custom REST APIsAt least 4 years of experience in architecting applications using design principlesKnowledge about TOGAF or Zachman FrameworkKnowledge of Design Patterns with a focus on reusing components and codeDesign data models, schemas and data maps using database technologies including SQL/NoSQL Preferred Tech and Prof Experience At least 5 years of experience developing applications using cloud-based platforms or Docker or KubernetesExperience with developing Smart Contracts and Consensus AlgorithmsExperience in developing Blockchain applications or proof-of-concepts (POC) using Hyperledger, Ethereum Solidity or other proprietary language and APIs.At least 4 years of experience in developing distributed applications using JavaScript, JSON, Python or Go languagesAt least 2 years of experience in database technologies (MongoDB/SQL or Any RDMBS/NoSQL)At least 2 years of experience developing distributed applicationsYou are involved in developer community groups. EO Statement  IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status. "}