{"jobID": "2814717712", "jobLocation": "Burbank_CA", "jobTitle": "DATG R&D; Intern, Burbank, CA - Fall", "companyRating": null, "companyInfo": {"Website": "www.disneyabctv.com", "Headquarters": "Burbank, CA", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Summary: Disney ABC Television’s R&D; group is a small and agile technology strategy organization that incubates new technology, executes proof of concepts, transfers new technology to operating groups, and provides strategic recommendations on new technology opportunities. The scope is any technology related to television production, creative development, digital media, newsgathering, distribution, operations and IT. The group was started in summer 2012 and reports to the CTO of Disney ABC Television Group.  The R&D; Intern will report to the Director, R&D; and contribute to the general goals of the group. During the internship there will be at least one major initiative the intern will be responsible for. The work will be very entrepreneurial; in some cases, the intern will be responsible for vision, strategy, hiring, analysis, execution, project management, reporting, and socialization. Some administrative duties will be part of the internship.  Responsibilities:• Manage proof of concepts for new technologies or technological areas Hold hands on ‘product owner’ role in contributing to research and prototyping processWriting strategy documents or white papers on new technologyAssist in defining technology innovation processes and valuesSocialize concepts and results across Disney ABC Television Group’s business unitsInterface with other technology groups across the broader Walt Disney Company Basic Qualifications:Experience with data visualization and/or production technology developmentExperience in media technology as an engineer or media productionExperience interfacing with senior executivesCreativity, desire to learn new things, obsession with innovationPreferred Qualifications:Programming experience in one (or more) of the following areas a big plus: game engine (Unity, etc.), application or web development and/or data science Required Education  Junior, Senior, Graduate Level student or recent graduate (within 6 months of graduating) pursuing a Bachelor's or Master's Degree in Computer Science, Data Science, Business Analytics or related field.  Preferred Education  Graduate Level student or recent graduate (within 6 months of graduating) pursuing an MBA degree or related graduate level degree.  Additional Information:Program Eligibility At least 18 years of ageUnrestricted work authorizationAvailable to work part-time (minimum 20 hours/week) or full-time (maximum of 40 hours/week) in Fall 2018 (August/September - December).All candidates must be able to have a consistent, reliable work schedule throughout the sessionAbility to provide own relocation, housing and transportation. Position is located in Burbank, CA.Enrolled in an undergraduate or graduate program at an accredited college/university taking at least one class in the semester prior to participation in the internship program, or recently graduated within six months at time of application About Disney ABC Television Group:Disney/ABC Television Group (DATG) redefines the future of media and entertainment. Delivering compelling creative, great storytelling, ground-breaking technology, high-impact marketing and innovative distribution, DATG offers multiple opportunities to build a career that supports entertaining and informing the world. A key unit of The Walt Disney Company, one of the world's most admired vertically integrated media enterprises, DATG includes global live action and animation entertainment, news, owned television stations, and radio. If you've got a passion to join our team of talented professionals we want to hear your story.About The Walt Disney Company:The Walt Disney Company, together with its subsidiaries and affiliates, is a leading diversified international family entertainment and media enterprise with the following business segments: media networks, parks and resorts, studio entertainment, consumer products and interactive media. From humble beginnings as a cartoon studio in the 1920s to its preeminent name in the entertainment industry today, Disney proudly continues its legacy of creating world-class stories and experiences for every member of the family. Disney’s stories, characters and experiences reach consumers and guests from every corner of the globe. With operations in more than 40 countries, our employees and cast members work together to create entertainment experiences that are both universally and locally cherished.  This position is with American Broadcasting Companies, Inc., which is part of a business segment we call Disney ABC Television Group.  American Broadcasting Companies, Inc. is an equal opportunity employer. Applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Disney fosters a business culture where ideas and decisions from all people help us grow, innovate, create the best stories and be relevant in a rapidly changing world."}