{"jobID": "2795512545", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Customer Support Engineer", "companyRating": null, "companyInfo": {"Website": "www.geminidata.com", "Headquarters": "Greenbrae, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Unknown", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Change how organizations think about and make use of their data. We’re looking for humble but ambitious, razor-sharp professionals who can grow with us and the technologies we bring to the world. We embrace those who see things differently, aren’t afraid to experiment, and who have a healthy disregard for constraints.  That's where you come in.  You are the backbone of the Gemini Customer Success organization. This is a highly visible, customer facing position within Gemini, Inc. Position is located at our San Francisco HQ with remote available. ResponsibilitiesProvide tier one and tier two technical support for Gemini products and tier one support for Splunk products.Working from home or in an Gemini Inc facility, participate in daytime and night/weekend on-call rotation schedules.Manage the issues/customers by under-promising and over-delivering. Customer satisfaction comes first.Maintain detailed case history and escalate issues appropriately.Ownership of support tickets throughout the entire troubleshooting process.Provide product training as needed for customers and partners.Provide assistance to Gemini Logistics in maintaining relationships with vendors and partners.Engage 3rd party vendor support on behalf of customers and follow up until a suitable resolution is provided.Provide support to Gemini Sales and Professional Services with asset management and field support tasks.Technical RequirementsExperience with Remote Customer Support activities.Strong Knowledge of Linux on x86 server platforms.Strong knowledge of network and application protocol stack including TCP/IP, UDP, SNMP, SMB/CIFS, (S)FTP, general Routing.Experience with SIEM (Security Information and Event Management) systemsDeep understanding and practical experience with Information Security concepts, tools and processes.Proven Splunk experience, Splunk certifications are preferable.Soft Skills RequirementsExcellent verbal and written English communication skills.Self managed, detail oriented individual that enjoys the challenge of technical troubleshooting.Proactive person who is able to take initiative and think outside of the box when faced with new situations.Empathic, calm and able to reduce tension when dealing with a stressful situation.Multi-tasking and having the ability to successfully manage multiple issues at onceStrong work ethic and high moral standards."}