{"jobID": "2790021022", "jobLocation": "New_York_NY", "jobTitle": "Transport Technician", "companyRating": null, "companyInfo": {"Website": "www.rcn.com", "Headquarters": "Princeton, NJ", "Size": "1001 to 5000 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Telecommunications", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Requisition Number 18-0172 Post Date 5/24/2018 Title Transport Technician City New York State NY Description Job Summary: The Transport Technician builds, provisions, tests and maintains fiber optic transport equipment that supports RCN core network connections and Enterprise customer circuits. Transport Technician:Deploy, turn-up and test dense wavelength division multiplexing (DWDM) equipment at RCN hubs, carrier hotels, data centers and customer locations within the New York metropolitan area.Provision, test and turn-up transport services including 10 and 100 GIG over the DWDM network and local metro extensions.Support the New York internet backbone infrastructure with equipment deployments, circuit builds and rearrangements. Infrastructure includes core internet switches, routers and content servers.Build, provision and maintain the Media Links video over IP network.Build, provision and maintain local RCN hub to megapop data transport equipment and circuits.Provision, maintain and rearrange T1, T3 and STS voice circuits over legacy Fujitsu SONET and Tellabs DCS systems.Assists in the building and maintaining of the market Ethernet network infrastructure.Performs back-office tasks as needed to properly provision and document the deployed equipment.Maintains network by troubleshooting and repairing outages.Ensures customer SLA standards by testing customer circuits as needed.Perform site survey walkouts as necessary to plan future jobs.Provide necessary technical support to customers as needed and where appropriate.Participate in on-call rotation schedule for nights and weekends.Perform other duties and responsibilities as required and assigned."}