{"jobID": "2656944567", "jobLocation": "Boston_MA", "jobTitle": "Spa Concierge", "companyRating": null, "companyInfo": {"Website": "www.bellasante.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Consumer Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Elements Therapeutic Massage, Massage Envy, Exhale"}, "estimatedSalary": null, "jobDescription": "DO YOU WANT TO MAKE A DIFFERENCE IN SOMEONE’S DAY BY CREATING A SENSE OF WELLBEING AND CARE At Bella Santé we believe in a whole-body healthy lifestyle approach where men and women come to look good, feel good, feel healthy, lighter, energized and overall better than before they came.We are focused on delivering a superior service through continued growth and development of our team, offering premium services, and using high-quality products. We are a family, with an enthusiastic and respectful team atmosphere.Bella Santé, meaning ‘beautiful health’, is one of the most recognizable spa brands in New England. We are seeking both Full-Time and Part-Time Spa Concierge in our Boston, Lexington and Wellesley locations.The Spa Concierge is responsible for the reception area at the spa, including the greeting of all guests, answering phone calls, assisting guests with questions regarding spa services and products, booking all appointments, checking the guest into the computer system and charging for services performed.In business for over 20 years, our ‘Best of Boston’ awards span over a decade. We are proud of our numerous awards and accolades, which is a testament to our talented staff and executive team and their commitment to delivering world class service and relaxation to our clients.We offer competitive pay and benefits (for qualifying employees) which include medical, dental, 401k, paid vacation and sick time and complimentary spa treatments and generous product discounts.Success in the spas will fast track your career growth with us. The opportunities are endless with Bella Santé.When submitting your resume, please indicate which location you are interested in applying for.This is a year round position, not a seasonal role."}