{"jobID": "2810847203", "jobLocation": "Redmond_WA", "jobTitle": "Jr Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.excell.com", "Headquarters": "Bellevue, WA", "Size": "201 to 500 employees", "Founded": " 2001", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Kforce, TEKsystems, Robert Half"}, "estimatedSalary": "49000", "jobDescription": " Did you know that our employee benefits start on the first day of employment? Join eXcell and enjoy our generous, DayOne Benefits (SM)!  The Jr. Data Analyst provides data that is accurate, congruent, and reliable, and ensures the information is easily available to users for direct consumption or integration with other systems. The Analyst will:Work closely with internal clients and development teams to turn data into critical information and knowledge that can be used to make sound business decisionsPerform data de-duplication (matching and merging data) and data cleansing (matching, linking, updating records, such as organization records, in batch and real time)Be responsible for hierarchy management: identifying, creating, correcting, update, and maintaining complex relationships among parent and child recordsPerform data conversion: changing / transforming the data based on business rules, usually done before the data is integrated into a new systemRaise escalations and communicate issues to Project LeadSkills Needed:Undergraduate or Master studies student with high GPAProficiency in English (verbal and written)Advanced computer literacyTeam-oriented attitude and excellent interpersonal skillsCommitment to accuracy, quality, and attention to detailsDesign and document dashboards, alerts, and reports either on a regular recurring basis or as neededMay perform analysis for a wide range of requests using data in different formats and from various platforms * * * Local Candidates Only * * * Non-Local candidates will be rejected without consideration. Relocation assistance is not on offer. Required Background: 2 to 5 years of relatable work experienceAbove average Excel skills: vlookups, creating pivots, basic functions at a minimumExposure to PowerBI or similar systemPreferred Experience: Working experience in PowerBIExperience in Recruiting field or related industryAdditional NotesNo travel requiredRequired to work onsite, in person in Redmond, WA location W2 only, no Corp to Corp. We are unable to sponsor H1B visas at this time. **eXcell Supports Equal Employment Opportunity** eXcell, a division of CompuCom® Systems, Inc., a global company headquartered in Bellevue, Washington, provides IT staffing services and solutions to Fortune 1000 companies as well as small and medium business. For more information, visit www.excell.com."}