{"jobID": "2795652359", "jobLocation": "Boston_MA", "jobTitle": "Data Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.chewy.com", "Headquarters": "Dania Beach, FL", "Size": "5001 to 10000 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "103000", "jobDescription": "Our Opportunity Chewy is seeking a highly motivated, goal-oriented, and analytical, Data Scientist to join our exciting and fast paced company in Boston, MA. Our team is growing and if you are equally passionate about data analysis, digital marketing, e-commerce, and career growth, an opportunity at Chewy may be a great match! As the Data Scientist, you will be focused on solving business problems by advanced mathematical modeling to predict outcomes of high impact business decisions. In this role, you will own the management of Chewys digital marketing data science end-to-end. You will cooperate with BI teams across the organization in finding insights and developing the right data solutions. In this role, you should be effective at organizing large amounts of data from multiple data sources and build predictive and machine learning models from these large data sets, in order to support solutions of business problems as well as marketing campaign optimizations. This candidate should have a passion for data quality and attention to detail. What youll do:Research, design, and implement predictive models and classifiers built off of billions of rows of dataRoutinely and effectively partner with digital marketing team to define key business questions and build the models and data sets that answer these questionsLead identification of trends and KPIs with the objective of improving marketing performanceMentor junior data analysts and demonstrate Data Science and development best practicesWhat youll need:An M.S., P.H.D., or equivalent experience in a related discipline (Engineering, Mathematics, Physics, Finance or C.S.)Experience in Python, R, or other Data Science object oriented programming languageExperience with applying machine learning techniques at scale and their tuning parameters (Neural Networks, Random Forest, Bayesian Models, K-Means Clustering)5 years of experience applying Machine Learning, Statistical Modeling, and Data MiningExperience with SQL, NoSQL, and unstructured databases (MySQL, Hadoop, Redshift, MongoDB)Hands on experience with software design for scalability, reliability, and performanceProven track record in developing mathematical models to predict business outcomes and determine cause and effect relationshipsCandidate must be organized, driven, and exhibit critical thinking skills.Candidate must have an entrepreneurial and self-starting mentality. Bonus:Experience in working with digital marketing channels in an eCommerce environment.Knowledge of / experience with multi-channel and cross-channel attribution.Extensive CLI and UNIX experience we live in the terminal!"}