{"jobID": "2668469098", "jobLocation": "San_Francisco_CA", "jobTitle": "Firmware Intern", "companyRating": null, "companyInfo": {"Website": "www.whistle.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Consumer Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Company Overview: We love dogs and we love building smart wearable electronics that help pets live healthier and safer lives. As the market leader in pet tracking, our goal is to build products that connect owners to their pets. Our activity tracker has helped motivate tens of thousands of pet owners to spend more time walking their pets so they can live longer and more fulfilling lives and our GPS tracker has helped reunite countless lost pets. We pride ourselves in the quality of products so we do everything in house including: electrical, mechanical, firmware, mobile apps, and server software. If you are just as passionate about building amazing products for our furry friends we want to talk to you. Position Overview: Whistle is looking for a junior or senior studying Computer Science or Electrical Engineering to help us with firmware development and analytics. Our Firmware Interns will work side-by-side with our Firmware and Hardware Engineers in developing new features in the areas of: Evaluating different sensor technologiesDeveloping system to transfer firmware and update various subsystemsImplementing Signal Processing, Compression, and Transfer of sensor dataSupporting and testing Development targeting Cortex M4 + RTOS environmentCreating analytics to support FW developmentQualifications:Available for 3 months of fulltime work for summer of 2018Junior or Senior studying Computer Science, Electrical Engineering, Math or EquivalentStrong knowledge of C is requiredProficiency in Python is a plusMicrocontroller development experience is a plusCourse work in operating systems is a plusCourse work in digital design is a plus"}