{"jobID": "2565663097", "jobLocation": "Mill_Valley_CA", "jobTitle": "Senior UX Designer - Marketing", "companyRating": "4.1", "companyInfo": {"Website": "www.glassdoor.com", "Headquarters": "Mill Valley, CA", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Indeed, LinkedIn"}, "estimatedSalary": "130000", "jobDescription": " Glassdoor’s B2B Marketing Team is looking for a superstar UI/UX Designer to be a partner and leader on our B2B marketing website and brand teams. You are going to design to transform the user experience across our B2B online experience, effortlessly driving users from all buying cycle stages to the products or information that meets their exact needs.  The ideal candidate is passionate about solving complex problems and creating experiences that delight customers worldwide. You dive right in, moving at the speed of light, while working on projects with varying degrees of ambiguity. While the work will be more heavily weighted in UX, it still requires both interaction and visual design skills. Your designs are detailed, but divinely simple. Sound like you?  We need you to think strategically for our business, balancing customer needs with business requirements, while executing tactical plans with a razor sharp focus. This is a hybrid designer position that will require both interaction and visual design skills. You will be responsible for wireframes, visual layout, branding, and various digital marketing elements.  This role reports into the Sr. Director of UX and will collaborate with a B2B Senior Visual Designer. This person will also have hybrid management across the B2B Digital Marketing & UI/UX teams.  We want to provide our users with more than just functionality - we want to give them insights and best-in-class tools that make hiring easier. In this role, you’ll have the opportunity to flex every design and UX muscle you have to help Glassdoor disrupt a $90B talent acquisition market. Up for the challenge? What your day-to-day looks like:Collaborate with product managers, engineers, the creative director, designers, and other marketing stakeholders to create intuitive, cohesive, and delightful experiences and solutions to specific problemsRapidly develop site maps, user flows, wireframes, mocks and specs. You own the entire design process.Partner with Product Manager to identify user research needs and conduct usability testsEnsure product design deliverables adhere to high design standardsWork with your Design peers to ensure a consistent and cohesive experience for our users as they move across different platforms and tasksPractice a highly efficient, iterative design process with light documentation to support your visionEnjoy daily interaction, brainstorming, and collaboration with people who are as passionate about the end-user experience as you are!What You Bring to the Table:BA/BS in HCI, Graphic Design, or related field7+ years experience in mobile, product, interaction or information designA portfolio demonstrating both visual and interaction design experience, including responsive web designA solid understanding of user-centered design principlesStrong visual design background building brands is a mustExpert knowledge of design tools including Sketch and the Adobe SuiteExperience working in Agile and/or Lean UX environmentExperience building prototypesVisual design skills are a strong plusExperience working in fast-paced startups a plusA sense of humor a must!Local Bay Area candidatesCandidates must submit an online portfolio to be consideredWhy Glassdoor?Work with purpose – join us in creating transparency for job seekers everywhereGlassdoor gives back! Glassdoor is a Pledge 1% member; all employees receive 3 paid volunteer days per year100% company paid medical/dental/vision/life coverage; 80% dependent coverageLong Term Incentive PlanSunny & peaceful Mill Valley offices located right on the waterWalking, running and biking trails steps away from the officeOnsite gym and fitness classesFree catered lunch; new menu dailyPaid holidays and flexible paid time offYour choice between Mac or PCDog-friendly office (with dog-free zones if you are so inclined)Free parking Glassdoor is committed to equal treatment and opportunity in all aspects of recruitment, selection, and employment without regard to gender, race, religion, national origin, ethnicity, disability, gender identity/expression, sexual orientation, veteran or military status, or any other category protected under the law. Glassdoor is an equal opportunity employer; committed to a community of inclusion, and an environment free from discrimination, harassment, and retaliation."}