{"jobID": "2812866088", "jobLocation": "Chelmsford_MA", "jobTitle": "Technical Intern", "companyRating": null, "companyInfo": {"Website": "www.arcadis.com", "Headquarters": "Amsterdam, Netherlands", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Construction, Repair & Maintenance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Description Arcadis is currently seeking an Intern to join our Chelmsford, MA team. The candidate should be a student currently pursuing a college degree in engineering, environmental science, public health or geology. This is an excellent opportunity to gain experience in the environmental consulting industry and to learn a wide variety of technical office tasks.  Candidates must demonstrate strong written and oral communication skills and the ability to work well in a team environment. The ideal candidate will have a strong background in MS Office and desire to pursue a career in the environmental sector.  Responsibilities will include (but not be limited to): Data management (compilation, manipulation, and evaluation of data)Writing and preparing documentation for reports, work plans, letters, and memorandaAssist in hydraulic evaluation.Assist with Human Health and Ecological Risk assessment evaluationsAssist with conducting statistical analysis of data sets in Microsoft Excel Required Qualifications Must be at least 18 years of age.Must have reliable transportation and work in Chelmsford, MA office.Currently pursuing a college degree (bachelors or associates) in engineering, engineering technology, environmental science, public health, geology or related field.Strong oral and written communication skills.Strong attention to detail. Preferred Qualifications Currently pursuing a BS or MS degree in engineering, engineering technology, environmental science, public health or geology.Prior related internship or research experience, with one year remaining until graduation.Demonstrated proficiency in MS Word and MS Excel. Employment Type  As Needed"}