{"jobID": "2699362310", "jobLocation": "San_Francisco_CA", "jobTitle": "Content Marketing Interns for Data Analytics", "companyRating": null, "companyInfo": {"Website": "www.chartio.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "We are looking for Content Marketing Interns on Data Analytics to develop high-quality online technical marketing content (tutorials) in the analytics space that will contribute to the overall success of the Chartio product and impact. Here at Chartio we are on a mission to improve human potential by democratizing access to data and enhancing everyone’s ability to explore and understand data in practical and impactful ways. You will be part of a team of talented marketers and content marketing experts who work collaboratively to create prolific education around the importance of accessing and understanding data. You will have the chance to work out of our offices in San Francisco, CA or in Blacksburg, VA, or at your own space. We offer internships for the summer on a rolling base.Responsibilities Work with internal teams to define audiences and ideate topics for marketing content to attract web visitors and facilitate conversionsResearch relevant topics in the data analytics space as it applies to different lines of business (e.g. marketing, sales, operations, product, startups, etc.)Develop high-quality tutorials for the Chartio web site (https://chartio.com/learn/tutorials/) that meet applicable standards and are appropriate for its intended audience.Analyze existing and potential content, focusing on reuse and single-sourcing opportunitiesRequirements Proven understanding of the data analytics spaceAbility to independently research new topics and compile the important informationAbility to quickly grasp complex technical concepts and make them easily understandable via text, pictures and videosAbility to deliver high quality marketing content paying attention to detailExcellent written skills in English is a mustUniversity degree (completed or in progress with excellent standings) in Computer Science, Engineering, Data Science or equivalent work experience requiredAbout Chartio Chartio is on a mission to democratize data across organizations so that everyone can become a Data Hero. To that end, Chartio has built the most intuitive yet powerful cloud-based data exploration and analytics tool. Chartio enables business teams to explore, transform and visualize their data in real-time. Chartio has been named a “High Performer” Business Intelligence tool by G2 Crowd in both 2016 and 2017, and is currently ranked as the top Self-Service Business Intelligence software product for usability as well as fastest implementation. We were founded in 2010 in San Francisco. To learn more, visit chartio.com or follow us on our blog, LinkedIn, Facebook or Twitter."}