{"jobID": "2816168087", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": "4.6", "companyInfo": {"Website": "www.scribd.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Media", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Audible, Amazon"}, "estimatedSalary": "149000", "jobDescription": "Scribd/skribbed/ (n). 1. a tech company changing the way the world reads2. a membership that gives users access to the worlds largest online library of books, audiobooks, sheet music, news, and magazinesWe value trying new things, craftsmanship, being an open book, and the people that make our team great. Join us and build something meaningful.About the Data TeamOur team is small but mighty, digesting terabytes of data, making sense of it, and delivering key insights that drive both business and product decisions. The team works on every aspect of the business so youll touch everything we do and have impact on all aspects of Scribd. If you look at problems from both a business and technical perspective, wed love to talk to you!You will:Provide decision-support to the whole company by doing analysis, building predictive models, creating reports - doing whatever it takes - to support data needs across the organization.Become a domain expert in all aspects of the Scribd business, product, and data model; use this expertise to provide advice to all teams in the usage of our data.Solve ambiguous problemsCollaborate with stakeholders to determine the highest-impact opportunitiesAbout You:3-5+ years of professional experience in data scienceBachelors degree or higher in math, stats, CS, physics or equivalent experienceFamiliarity with one of the following: NLP, recommendation systems, neural networks, predictive modelingExperience w/ a scripting language like Python, R, etcComfortable w/ SQLBonus points for experience w/ experimental design or deep learningWhy we work here-We are located in downtown San Francisco, just a few minutes walk from BART-Health benefits: 100% employer covered Medical/Dental/Vision for regular, full-time employees-Generous PTO policy plus we close for the last week in December-401k matching-Paid Parental leave-Monthly wellness budget and fully paid membership to our onsite fitness facility-Professional development: generous annual budget for our employees to attend conferences, classes, and other events-Three meals a day, catered from local restaurants-Apple laptops and any equipment you want to customize your work station-Free Scribd membership and a yearly reading stipend! -Company events that include monthly happy hours and offsites (past events include Santa Cruz, bowling, arcades, geocaching, ropes courses, etc.)In the meantime, check out our office and meet some of the team at https://www.scribd.com/aboutScribd values diversity, and we make all hiring and employment decisions based on merit, qualifications, competence, talent, and contribution, not who you are by choice or circumstance. We value the people who make Scribd a great place to work and strive to create an environment where your work is supported and personhood respected."}