{"jobID": "2820814492", "jobLocation": "Boston_MA", "jobTitle": "Senior Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.humana.com", "Headquarters": "Louisville, KY", "Size": "10000+ employees", "Founded": " 1961", "Type": " Company - Public (HUM) ", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Cigna, Aetna, UnitedHealth Group"}, "estimatedSalary": "103000", "jobDescription": "DescriptionHumana is seeking a Data Scientist who will develop cutting edge predictive models, forecasts, and analyses to turn data into actionable solutions.  Using techniques from supervised and unsupervised machine learning, statistical analysis and predictive modeling to deliver business insights to prospects and customers based on data stored in data warehouses  Working directly with customers to educate them on “moving beyond BI” and training their internal resources to execute advanced forms of analytics  Creating reusable implementations of statistical tests and models using the available technologies in the ecosystem  Working with the academic and business community to develop new techniques and to contribute to research in the area of advanced analytics on large databases  Generating new product requirements for the engineering group to enhance the analytics capabilities of the database  Assisting in customer engagement management, requirements definition, project scoping, timeline management, and results documentation to ensure professional relationship management  Participate in and drive ethnographic and user research  The Senior Data Scientist uses mathematics, statistics, modeling, business analysis, and technology to transform high volumes of complex data into advanced analytic solutions. The Senior Data Scientist work assignments involve moderately complex to complex issues where the analysis of situations or data requires an in-depth evaluation of variable factors.Responsibilities The Senior Data Scientist develops, maintains, and collects structured and unstructured data sets for analysis and reporting. Creates reports, projections, models, and presentations to support business strategy and tactics. Begins to influence department’s strategy. Makes decisions on moderately complex to complex issues regarding technical approach for project components, and work is performed without direction. Exercises considerable latitude in determining objectives and approaches to assignments.  Required Qualifications  Advanced knowledge of statistical and machine learning methods, particularly in the areas of modeling and business analytics  Strong programming skills  Experience with statistical languages and packages, such as R, SAS, and/or Matlab  Experience working with relational databases and/or distributed computing platforms, and their query interfaces, such as SQL, MapReduce and Hive.  Experience with additional programming languages, such as Python, Java, and C/C++.  Excellent written and verbal communications skills, with a proven ability to translate complex methodologies and analytical results to higher-level business insights and key take-aways  Ability to travel as-needed to meet with team members  Role Desirables  Preferred Qualifications  A proven passion for generating insights from data, with a strong familiarity with the higher-level trends in data growth, open-source platforms, and public data sets.  Experience working hands-on with large-scale data sets  Familiarity with visualization software and techniques (including Tableau), and business intelligence (BI) software, such as Microstrategy, Cognos, Pentaho, etc.  Degree in an analytical or technical field (e.g. applied mathematics, statistics, physics, computer science, operations research)  Experience in using data science as a mechanism to drive to better outcomes in people’s lives  Additional Information  Humana is an organization with careers that change lives—including yours. As an innovator in the fast-paced industry of healthcare, we offer our associates careers that challenge, support and inspire them to use their passion for helping others and to lead their best lives. If you’re ready to help people achieve lifelong well-being, and be a part of an organization that is growing and poised to make an impact on the future of healthcare, Humana has the right opportunity for you. Scheduled Weekly Hours40"}