{"jobID": "2807663158", "jobLocation": "New_York_NY", "jobTitle": "M&M;'s World - Backstage Cash Room", "companyRating": null, "companyInfo": {"Website": "www.mars.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " A mutually rewarding experience.  Work. Realize your ambitions. And realize theres more to being in business than just making a profit. Thats the Mars philosophy. And the opportunity we offer every one of our Associates. An opportunity to take what you do and make it mean more for you, for those around you and for the planet. What you get here is challenging, interesting work. You get the tools you need to do a great job and you get to have the best possible people on your side to help you do it. And at the same time as getting to find ways to do business better today than we did it yesterday and driving a great career, you also get to build a more enlightened business and drive sustainability.  Because its never just about a single person, a single project or a single brand. Its about how you can grab everything thats within your reach here and use it to pursue mutual, long-term gain. Its about having ideas. And ideals. Being prepared to risk failure because the promise of success means well all be a little better off. Its that mix of integrity and ambition that makes Mars such a special place to work. And why working here is always about more than just a job.  Mars has net sales of more than $33 billion, operates six business segments including Petcare, Chocolate, Wrigley, Food, Drinks, Symbioscience, and more than 75,000 Associates worldwide that are putting its Principles into action to make a difference for people and the planet through its performance.  Mars brands include: Petcare PEDIGREE®, ROYAL CANIN®, WHISKAS®, BANFIELD® Pet Hospital, CESAR®, SHEBA®, DREAMIES® and NUTRO®; Chocolate M&MS;®, SNICKERS®, DOVE®, GALAXY®, MARS®, MILKY WAY® and TWIX®; Wrigley DOUBLEMINT®, EXTRA®, ORBIT® and 5 chewing gums, SKITTLES® and STARBURST® candies, and ALTOIDS® AND LIFESAVERS® mints. Food UNCLE BENS®, DOLMIO®, EBLY®, MASTERFOODS®, SEEDS OF CHANGE® and ROYCO®; Drinks ALTERRA COFFEE ROASTERS, THE BRIGHT TEA COMPANY, KLIX® and FLAVIA®; Symbioscience COCOAVIA® and WISDOM PANEL®. M&M;'s World - Backstage Cash Room  Purpose of Role: Support the management team in an adiministrative role to include: cash handling, reconciling funds, POS trouble shooting, tracking and reporting various information.  Principal Accountabilities: Due to the nature of the retail environment and the importance of this role to the store operations, it is a requirement to have open availability which includes nights, weekends and holidays.Responsible for all aspects of cash handling, i.e, balancing the safe, change orders, reconciling tills, pay outs, deposits, preparing till funds.Responsible for store opening and closing procedures in relation to the cash room and the POS system.Trouble shoot, advise and follow up with technical support in the resolution of POS issues.Demonstrate thorough knowledge of POS system and back of the house reports.Accurately process income and pay outs from various vendors.Read, understand and complete all reports/media in relation to the POS system, in a timely manner.Complete all required paperwork related to cash room duties with efficiency and accuracy.Create and maintain reports, as requested by management team.Maintain confidentiality in all matters related to cash handling.Ability to demonstrate the Principal Accountabilities of Retail Sales Associates.Special duties as assigned by Store Director. Key Functional Skills/Knowledge: Excellent communication skills (verbal and written).Computer skills (beyond the basics).Able to set priorities, effective use of time management skills, excellent organizational skills.Approachable, strong interpersonal skills.Results and solution oriented.Self directed.Sense of urgency in completing duties of the cash room. Key Experiences: Previous cash room experience preferred.Excellent math and reasoning skills.Ability to work in a team environment.Experience with guest service oriented environment.Retail experience in fast paced setting.Administrative experience in an office environment (Word, Excel).Demonstrated ability to handle confidential information.Demonstrated ability to meet deadlines. Desired Education: College degree preferred, not required. Mars is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law. If you need assistance or an accommodation during the application process because of a disability, it is available upon request. The company is pleased to provide such assistance, and no applicant will be penalized as a result of such a request."}