{"jobID": "2796882327", "jobLocation": "Seattle_WA", "jobTitle": "Data Scientist, Multi-Channel Acquisition", "companyRating": "4.4", "companyInfo": {"Website": "www.rover.com", "Headquarters": "Seattle, WA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Consumer Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "99000", "jobDescription": "Who we are:Rover.com connects pet parents with the nation’s largest network of pet sitters and dog walkers. On Rover, pet parents can easily discover, book, and manage personalized care for their dogs including pet sitting, dog walking, and doggy day care. Founded in 2011 on the belief that everyone should have the opportunity to experience the unconditional love of a dog, Rover improves and simplifies life for pet parents and the dogs they love.We're headquartered in downtown Seattle. We're an agile, fast-growing startup, and our leadership comes from some of the country's most respected tech companies. We've been named among Seattle's \"Best Places to Work\" in Seattle Met magazine, Seattle Business Magazine, and the Puget Sound Business Journal.\" We're also a recipient of Seattle Business Magazine's 2015 Tech Impact Awards. Needless to say (but we're going to say it anyway)—we love dogs, and we wouldn't dream of going to work without them by our sides.What we're looking for:We are looking for an experienced data scientist to evolve our marketing attribution framework and influence substantial investment decisions. This data science role will provide analytical feedback to the business regarding online acquisition measurement and the impact of channel mix, proposing future optimizations in spend allocation. Why we'll hire you:You are scary good with data. You look at charts, furrow your eyebrows, and observe that something doesn’t seem quite right. Others see trends; you see outliers. Mix shifts, lag effects, data sufficiency issues - these things are second nature to you.You have a track record of applying data science on ambiguous problems and delivering actionable results.You are passionate about optimization and categorization. You want to make sure every item is tracked and attributed properly.You have deep compassion for the business owners you will support. You understand at a cellular level that people have jobs to do and decisions to make, and it is your job to help them do that in as data-driven a way as possible.You have an uncanny ability to get to the question behind the question. You do not accept presuppositions, and are driven to find solutions and novel approaches; to figure out what can be done to move the business forward, in the messy real world of imperfect information.You show a pattern of being self-started, self-taught, and self-directed. You are your own QA team, producing quality analysis and creating novel ways to ensure accuracy.Experience with a wide range of digital analytics tools is a plus, including: Google AdWords, DS3, Digital Attribution tools, UTM tracking, Adobe Reports & Analytics, Java Script page tagging, pixeling, etc."}