{"jobID": "2827929741", "jobLocation": "Redwood_City_CA", "jobTitle": "Consumer Loan Officer", "companyRating": null, "companyInfo": {"Website": "www.providentcu.org", "Headquarters": "Redwood City, CA", "Size": "201 to 500 employees", "Founded": " 1950", "Type": " Nonprofit Organization", "Industry": " Finance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Patelco Credit Union, Golden 1 Credit Union, San Mateo Credit Union"}, "estimatedSalary": null, "jobDescription": "Provide outstanding member service with fast, efficient review of credit applications. Identify new loan opportunities by providing cross-sales and counter offers. Contribute to the daily management of workflow within the department. Adherence to Credit Union service quality objectives and lending guidelines. Specific Job DutiesReview income statements, credit history and other loan documentation to determine the creditworthiness of each applicant.Within the established guidelines, use judgement and discretion to underwrite consumer loan and Visa credit card requests.Document loan decisions thoroughly, providing specific reasons for the decision. If the loan cannot be approved as requested, consider alternatives and provide a counter offer.Maintain thorough working knowledge of internal policies and procedures, NCUA lending guidelines, regulatory lending laws and any other applicable consumer laws and regulations.Develop product relationship with member through cross-sell recommendations.Manage to departmental service quality standards.Assist in training front line staff.Communicate with internal and external clients.Assist in any area as requested by management.Ability to identify Red Flags and fraudulent loan applications to help mitigate potential losses.Complete all required annual compliance training.Understand and adhere to BSA & OFAC policies and procedures, including reporting suspicious activity to Risk ManagementIncumbent must have good working knowledge of California Credit Union law and rules and regulations, Provident Board Policies, NCUA Rules and Regulations, Consumer Lending Department policies and procedures.Job RequirementsRequires the ability to use both hands in a non-repetitive motion up to eight hours per day. The position requires minimal lifting of 0-10 pounds. The incumbent sits, stands and walks intermittently. Excellent visual acuity is required for the position.High School DegreeConsumer Loans UnderwritingThree years’ experience in consumer loan operations, including credit granting, processing and funding.Excellent communication and presentation skills.Excellent writing skills.Prior working knowledge of MeridianLink (LPQ) a bonus.The position demands maturity, flexibility, prior banking experience and someone ready to contribute at a high level -- and the rewards come with it.Fully paid health insurance premiumsQuality medical, dental and vision care coverage401(k) retirement plan with matching employer contributionsStrong commitment to investing in your career and educational advancement by offering tuition reimbursement for approved coursesIncentive planGenerous paid time off and paid holidaysFlexible spending accountsShort and long-term disability coverageLife and AD&D; insuranceProvident membershipRate discount on home and auto loansIn-house trainingAnd much more! Join us at Provident Credit Union as a Consumer Loan Officer. Discover new challenges in a rewarding atmosphere that helps you grow professionally. Provident is an Equal Opportunity Employer We are a winner of the Bay Area News Group Top Workplace in 2017. Check us out on Glassdoor"}