{"jobID": "2709538816", "jobLocation": "Oakland_CA", "jobTitle": "Data Analyst - Int", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Under close supervision, this position exists to assist the organization in making strategic data-related decisions by analyzing, manipulating, tracking, internally managing and reporting data. This position functions both as an analyst and as a statistical analytics programmer.  Essential Functions: Designs and enhances databases. Designs menu systems that are effective and user-friendly. Develops reports with accurate, easy to read, useful information. Designs and generates tracking and monitoring tools.Participates in the development of outcomes and process measures, including technical specifications, to enable population measurement, guideline implementation, and evaluation.Maintains complex statistical routines using macros, vendor software, and software written by self and others. Tests and maintains data integrity.RequirementsBasic Experience:Three (3) year of programming in SAS (or R), SQL, VBA; net or equivalent statistical analytical programming language.Two (2) or more years’ experience of related analytical consulting experienceAdditional:Microsoft Office skills required.Strong ability to apply analytic and critical thinking skills, writing skills, communication skills, consulting skills, and ability to work within a team.Must be an independent self-starter.Must be able to work in a Labor/Management Partnership environment.EducationBachelor's degree in economics, finance, health care administration, public health administration, statistics, mathematics, operations research, or related field required OR four (4) years of experience in a directly related field. Additional: Experience with analytical manipulation and interpretation of large databases.Analytical consulting experience.Project management experience.Experience with MVS/TSO operating systems. Preferred Qualifications: Healthcare industry experience preferredKnowledge of JCL strongly preferred.SAS Macro Language experience preferred.Crystal Reporting experience preferred.BenefitsSalary:Commensurate with experience.Cross Ocean Technologies, Inc. is an Equal Opportunity Employer that actively pursues and hires a diverse workforce. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, disability (mental or physical), gender identity or expression, genetic information, marital status, medical condition, military veteran status, national origin, political affiliation, pregnancy, race, religion or creed, sex, sexual orientation, or any other factor that is not related to the job."}