{"jobID": "2629230567", "jobLocation": "New_York_NY", "jobTitle": "RN Case Manager", "companyRating": "3.0", "companyInfo": {"Website": "www.archcare.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1899", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " MJHS, VillageCare"}, "estimatedSalary": "90000", "jobDescription": " ArchCare, the Continuing Care Community of the Archdiocese of New York, provides top-quality healthcare and other services to thousands of people each day through an ever-expanding array of home- and community-based and residential care programs. We offer: Long-term nursing home care and short-term rehabilitationNursing home alternatives that keep seniors healthy, safe and independentHealthcare plans that coordinate members’ every healthcare needHome health services for infants, children and adultsFamily-centered hospice and end-of-life careSpecialized programs for people with exceptional care needs, including Huntington’s Disease, HIV/AIDS and developmental disabilities As one of the largest and most dynamic Catholic health systems in the nation, ArchCare caters not just to the physical health of those we serve, but to their emotional and spiritual well-being, too. Helping families understand their healthcare options and cope with the challenge of making sure their loved one is well cared for is just as important to us. Join the ArchCare TeamOur team of dedicated Care Members are shaping the health care landscape of today and tomorrow. The role of a Case Manager is to facilitate the achievement of desired patient outcome through interdisciplinary communication and identification of resource. Provides early identification of covered care and ensures that claims are approved when the requirements are met.Responsible for the coordination of discharge planning and the transfer of Managed Care patients.Helps to identify appropriate providers and facilitates quality and cost effective services throughout the continuum of care.Reviews the medical record within 48 hours of admissions and then weekly as required to promote effective use of resources, appropriate reimbursement and quality services through concurrent review of the medical record and other supportive documentation. NYS RN License. Must have experience in Case Management.  Must be PRI certified."}