{"jobID": "2795243503", "jobLocation": "San_Jose_CA", "jobTitle": "Watson Health Oncology/Genomics Solution Seller - Great Lakes", "companyRating": null, "companyInfo": {"Website": "www.ibm.com", "Headquarters": "Armonk, NY", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Public (IBM) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Accenture, Microsoft"}, "estimatedSalary": null, "jobDescription": "Job DescriptionLocation: Highly qualified candidates in any major metropolitan area within the following states are acceptable: IN, IL, MI  Its time to transform health with new ways of working to improve approaches to care, productivity and well-being. Watson Healths AI (artificial intelligence) understands, reasons and learns helping to translate information into knowledge that can help drive more informed decision-making. With AI, we can see and analyze more data than ever before and achieve more than we ever thought possible.  IBM Watson Health is looking for talented individuals destined to usher in the next era of healthcare.  This position will lead, sell and promote three primary solutions to the Provider segment, including but not limited to hospitals, Health Systems, IDNs and Academic Institutions: Watson for Oncology (WFO)Watson for Genomics (WFG)Watson for Clinical Trial Matching (CTM) This is a hunter role and the Solution Seller will work closely with the Watson Health Client Executives and Regional Sales Leaders for direction and be responsible for selling the Watson Health Oncology & Genomics technologies to the full range of providers from small community hospitals all the way up to IDNs and academics.  Working with the Client Executives in the geography, this position must meet or exceed a determined sales quota. This position will also be responsible for producing qualified sales leads, closing net new business, and supporting a team sales strategy with the overall Watson Health sales team.  The seller will support two or more regions working with several internal and external teams.  The Solution Seller will develop and execute a territory plan according to company policy, which will include strategic and tactical sales planning along with identifying, qualifying, demonstrating and presenting product capabilities to customers to increase sales and market share. Essential Job DutiesUtilize a pro-active strategic sales approach encompassing all phases of the sales cycle, such as: Opportunity generation and qualification through detailed dialogue with prospective customersWork with proper (PSC) Pre-Sales Consultant support, technically validate potential customer opportunities for viability.Develop a strategy and specific tactics for anticipating and creating customer demand for our Oncology solutions.Influencing doctors (clinical stakeholders) who are department heads as well as technical leaders (IT stake holders).Perform all work in Salesforce.com and track lead against relevant campaign(s);Client Executives across the regions will share leads with you.Pursues a program of self-development through the use of selected reading, seminars, and participation in continuing education.Travel through assigned territory to call on prospective customers to promote imaging product line, and solicit orders Required Technical and Professional Expertise 5+ years of hunting provider (hospitals, IDNs, Academic Institutions) sales experience within healthcare.Be able to effectively lead a clinical / technical sales team through a 6 12-month sales cycle.Proven competencies in designing and implementing enterprise sales strategiesProven track record of being a high sales performer in the provider space.A valid drivers license and safe driving record is required.Experience selling complex solutions to the C-Suite Preferred Tech and Prof Experience 15+ years of experience selling Oncology, or Genomics solutions, or Clinical Trial Matching IT solutions.The ideal candidate started in Clinical Oncology, and then successfully transitioned into a sales role selling IT solutions to Oncologists.The ability to have a have technical conversations with key stakeholders.Advanced degree. EO Statement  IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status. "}