{"jobID": "2645521189", "jobLocation": "San_Jose_CA", "jobTitle": "Microbiology", "companyRating": null, "companyInfo": {"Website": "www.navy.com", "Headquarters": "San Diego, CA", "Size": "1001 to 5000 employees", "Founded": " 1775", "Type": " Government", "Industry": " Government", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " \"About This JobNavy Microbiologists combat unique and exotic microorganisms that are found wherever Navy personnel are called to serve. Conducting medical research and development. Creating a culture of innovation and sustainability on the clinical level at Naval Facilities Engineering Command (NAVFAC). Or examining wound cultures aboard the USNS Comfort during a humanitarian mission, providing medical care to patients in a dozen countries.Wherever their duties take them, its the Navy Microbiologists responsibility to employ cutting-edge technologies to alleviate real-world biological threats.As a Navy Microbiologist, your primary focus will be to prevent, diagnose and/or treat infectious diseases. You may also be called upon to: Consult and conduct infectious disease research  Participate in operational deployments  Conduct defensive research, including vaccine development  Supervise clinical/public health microbiology laboratories, with the opportunity to serve as department head, program manager or research director Senior members may even serve as senior scientists or in Navy Executive Medicine as liaisons, Officers in Charge, Executive Officers or Commanding OfficersNavy Microbiologists may serve in any of 20 global locations, performing a wide range of duties, including: Research and development centers (both medical and nonmedical) overseas in Cairo, Egypt; Lima, Peru; Jakarta, Indonesia; and within the continental U.S. (Washington, D.C., metro area and San Diego, Calif.) Environmental preventive medicine in Pearl Harbor, Hawaii, and within the continental U.S. (Virginia and California) Clinical microbiology at any of three large teaching medical centers in Bethesda, Md.; Portsmouth, Va.; and San Diego, Calif.Upon graduation from graduate school, those pursuing a Microbiologist position are required to attend Officer Development School (ODS) in Newport, R.I. ODS is a five-week program that provides a comprehensive and intense introduction to the responsibilities of Navy Staff Corps Officers. Here they learn about the military structure of the U.S. Navy, its rich history of traditions and customs, leadership development and military etiquette.Promotion opportunities are regularly available but competitive and based on performance.\""}