{"jobID": "2799484052", "jobLocation": "Seattle_WA", "jobTitle": "Data Analyst II", "companyRating": "3.2", "companyInfo": {"Website": "www.westonsolutions.com", "Headquarters": "West Chester, PA", "Size": "1001 to 5000 employees", "Founded": " 1957", "Type": " Company - Private", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "60000", "jobDescription": " Job ID 11221  Type Regular Full-Time  Company Fred Hutchinson Cancer Research Center  Location US-WA-Seattle  Category Information Technology  Overview  Cures Start Here. At Fred Hutchinson Cancer Research Center, home to three Nobel laureates, interdisciplinary teams of world-renowned scientists seek new and innovative ways to prevent, diagnose and treat cancer, HIV/AIDS and other life-threatening diseases. Fred Hutch's pioneering work in bone marrow transplantation led to the development of immunotherapy, which harnesses the power of the immune system to treat cancer. An independent, nonprofit research institute based in Seattle, Fred Hutch houses the nation's first cancer prevention research program, as well as the clinical coordinating center of the Women's Health Initiative and the international headquarters of the HIV Vaccine Trials Network. Careers Start Here. Responsibilities Working under supervision, the Data Analyst II will utilize a preapproved business intelligence tool or direct SQL development to create reporting artifacts including but not limited to: simple reports, complex reports , dashboards , cubes , data visualizations and data mining constructs in support of Fred Hutchinson Cancer research Center and the various consortium partners organizational goals.  The Data Analyst II reports to the Sr. Director Engineering Operations within the Hutch Data Commonwealth (HDC). Gathering and documenting requirements from the user community and then translating those requirements into an analytics solution that meets the customer's needs.Produce high-quality output consistent with team and industry best practices.Acquire knowledge of preapproved business intelligence tool set functionality and options.Possess knowledge on a wide range of possible reporting solutions and have sufficient discernment skills to select the most appropriate solution for each set of requirements.Have an in-depth understanding of the SQL programming language.Will serve as a liaison with the business community around the usage and deployment of reporting solutions and tools.Will participate/lead code review sessions and will be expected to make updates as directed by the primary reviewer.Will have an understanding of reporting within both a relational and a dimensional framework.Respond to ad hoc requests for reports and other artifacts.Participate in change control, problem management, and communication process.Utilizing approved BI tools translate written requirement documents into appropriate reporting artifacts.Prepare for and actively participate in design and development reviews.Strictly adhere to established reporting guidelines and standards.Assist in preparing work estimates for assigned projects.Meet required deadlines as outlined by project team and business partners.Prepare documentation for deployment purposes and respond to any implementation issues as needed to ensure quality deliverable has been met.Assist the data quality team in tracking down/debugging potential data quality issues.QualificationsMinimum QualificationsBS in Computer Science, Engineering or equivalent experienceMinimum of 3 years professional database reporting development experience with a wide range of business intelligence tools (MS Reporting Services, Cognos, Business Objects, Tableau Software, etc.)Minimum of 3 years SQL development experienceExperience working with both relational and dimensional modelsExperience developing a variety of different reporting artifacts (parameterized reports, cubes, dashboards, etc.)Sharp analytical abilities, proven design skills and problem solving skillsEnjoys working in a team environment and has a proven record of positive contributions to the work of the teamCoordination and working knowledge of project management methodologies (Agile/Scrum), time estimates and allocation Preferred Requirements/Experience Experience with Microsoft SQL ServerExperience gathering and documenting requirementssome past experience with analytical, data management & reporting toolsExpertise and knowledge of gathering and documenting analytic/reporting requirementsPrevious work with hospital information systems either connected, or not, to research uses of the dataPrevious experience in delivering to end users reports and/or extracts to support research and/or clinical care Our Commitment to Diversity  We are committed to cultivating a workplace in which diverse perspectives and experiences are welcomed and respected. We are proud to be an Equal Opportunity and VEVRAA Employer. We do not discriminate on the basis of race, color, religion, creed, ancestry, national origin, sex, age, disability, marital or veteran status, sexual orientation, gender identity, political ideology, or membership in any other legally protected class. We are an Affirmative Action employer. We encourage individuals with diverse backgrounds to apply and desire priority referrals of protected veterans. If due to a disability you need assistance/and or a reasonable accommodation during the application or recruiting process, please send a request to our Employee Services Center at ********************* or by calling ************."}