{"jobID": "2684300617", "jobLocation": "San_Francisco_CA", "jobTitle": "Manager - Developer Platform Data Science", "companyRating": null, "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " About Uber Were changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now were a part of the logistical fabric of more than 600 cities around the world. Whether its a ride, a sandwich, or a package, we use technology to give people what they want, when they want it. For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer. And thats just what were doing today. Were thinking about the future, too. With teams working on autonomous trucking and self-driving cars, were in for the long haul. Were reimagining how people and things move from one place to the next. Are you ready to challenge yourself to an opportunity to impact millions of users across all of Uber Apps (rider/driver-partner/eats) and measure yourself against the top line revenue impact? Our mobile apps are as reliable as running water is our teams mission and we accomplish this by driving mobile app health via engineering metrics while remaining truly customer obsessed. We are the go-to team that brings visibility to metrics and provides fast actionable feedback to engineers, PMs, and operations across 400+ cities by focusing end-to-end on prevention, detection, mitigation, and resolution. We work with a multitude of signals (for example: crashes, network performance, app performance, battery etc) and scale of data points throughout the release cycle and in production. Our success will be determined by creating scalable platforms and experiences across multiple dimensions: SDKs, monitoring, alerting, ticketing, reporting, data visualization, etc. You will get a rare opportunity to work within our consumer space across all of Uber Apps and drive internal-facing tools. Are you in? What You'll Be Doing: Internalize and deeply understand Ubers mission and strategies, and align the mission and objectives of your specific team to factor into the company strategy. Lead a small team of 3-4 highly skilled data scientists/data analystsWork with Product Manager and Engineering Manager to come up with data science roadmap and implementation plan.Participate actively in shaping the platform vision through data and insights. Be incredibly truth-seeking. Collect whatever data is necessary to inform product direction, whether in the form of competitive intel, rider behaviour or other business metrics. Solicit and embrace critical feedback. Mentor team member on analytics and modeling techniques and guide the team to apply correct statistical methods. Run statistical analysis to find what factors are important to drive mobile app health in emerging countries Deal with massive mobile event data store and build important analytical models which help the Product team to determine what nature of devices and networks should be promoted in emerging countries. Qualifications: An MS or PhD is a quantitative field such as Mathematics, Statistics, Economics, Operations Research or related. Minimum 2 years of managing teams in various capacitiesProficient in SQL, Python or R.Experience with working with Product and Engineering leadership and define strategy and visionAn extensive experience of defining KPI to measure business performanceStrong background in Statistics and Machine Learning.Ability to be a technical mentor to the team and provide leadershipExperiment design and measurement experience is a plusStrong communication skills"}