{"jobID": "2760252367", "jobLocation": "New_York_NY", "jobTitle": "Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.vdartinc.com", "Headquarters": "Alpharetta, GA", "Size": "1001 to 5000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "97000", "jobDescription": "Role:Data ScientistLocation: New York City, NYDuration: Contract / FTEAlso Work from Home Possible with once a month onsite travel.Mandatory Skills: R, SAS, PythonExperience: 6+ YearsJob DescriptionData Science Services for Analytical Products in Merchandising As a Statistician/Data Scientist, you collaborate with a team of modeling scientists and optimization scientists to deliver high quality predictive models and cutting-edge analytical solutions to clients (retailers). The position will bring analytical rigor and statistical methods to the challenges of predicting merchandising behavior. You will work closely with internal clients (Professional Services team, Implementation Managers) and/or external clients (retailers) to understand their business needs as well as to explain our analytical product. Responsibilities:Implement and validate predictive models and ensure successful customer deliveryCommunicate with intern/external clients to understand business needs and provide analytical solutionsInvestigate on forecast accuracy and provide insightful findingsQualifications:Advanced degree in at least one of these fields: statistics, applied mathematics, optimization, computer science, physics (MS required, outstanding BA/BS candidates will be considered)Understand statistical concepts such as regression, time series, mixed model, Bayesian methods, clustering, etc.Experience with R, SAS, or other statistical software Familiar with Unix environmentResponsible and detail orientedCommunication skills capable to explain technical terms to clients/colleagues who have no analytical/mathematical backgroundPreferred: Experience in merchandising applications for retailer's / lifecycle price management and optimization / promotion management & optimization / promotion execution / deal management / assortment optimization / shopper insights."}