{"jobID": "2794570472", "jobLocation": "New_York_NY", "jobTitle": "Technical Business Analyst", "companyRating": null, "companyInfo": {"Website": "www.forefrontcorp.com", "Headquarters": "Fair Haven, NJ", "Size": "1 to 50 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " WorkWave, Commvault, iCIMS"}, "estimatedSalary": null, "jobDescription": "Who Are We? ForeFront (Fair Haven, NJ) is a global technology consulting firm. Our expertise enables enterprise-wide digital transformation through cloud strategy, systems integration, agile delivery and change management of custom applications. We work with technology disruptors to accelerate business transformation and solve some of the industry’s most complex challenges in the life sciences, retail, media, and high-tech. Our commitment is to keep your business at the forefront. Why Join Us? We were voted as one of 2017's Best Places to Work in NJ. Our team loves it here because of our environment, the various challenging projects they get to engage in at once, and the investment we make in training and growing our people. What Will You Be Doing? The Technical Business Analyst will be responsible for the scope, architecture, and requirements gathering sessions for various cloud computing and integration solutions. In order to build strong relationships with clients, he/she will have to gain in depth knowledge and experience in CRM/ERP consulting. He/She will review, analyze, and evaluate business requirements and user needs. The BA must have excellent skills in managing multiple projects simultaneously to identify and implement application solutions and enhancements. RequirementsWhat You Need for this Position?Bachelors in Computer Science, Software Engineering, MIS, or BusinessTechno-functional analyst gathering requirements and creating technical documents including SOW’sCapturing technical requirements during presales process and applying them to UAT test casesMust have strong client-facing consultative skills and ability to act as a customer advocateDemonstrates a basic level of knowledge of various common enterprise systems – CRM, ERP, SCMAbility to wear multiple hats - Project Management, Business Analyst, Quality Assurance, Technical WriterUnderstanding of CRM and ERP Systems; knowledge of Salesforce.com is a big PLUS.Strong technical acumen a with the ability to learn and configure core applications such as Salesforce.com, Apttus and ServiceMaxBenefitsWhat's In It For You?Talented, innovative, diverse, and fun Team that values work-life balanceWeekly Friday Lunch & LearnsGreat learning and growth opportunities through ForeFront EDU, continuing education, certifications, and tuition assistanceTeam Building Events and Trips (past events include spinning classes, picnics, trip to Ireland & France)Medical, Dental, and VisionMatching 401KStable company in big growth mode"}