{"jobID": "2606516664", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist", "companyRating": "4.4", "companyInfo": {"Website": "www.hoteltonight.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "193000", "jobDescription": "HotelTonight makes it remarkably easy to book great hotels at amazing last-minute rates on your mobile device, for tonight, tomorrow and next week. Our mission is to make people feel more alive by delivering the unexpected and we're looking for a Senior Data Scientist to help do just that.If hotel rooms are the fuel that powers HotelTonight, data is the oil that makes it fire on all cylinders. Leveraging this data in the right way is what will differentiate HotelTonight and make it the leading hotel booking app on the planet. That’s where you come in.As the first Sr. Data Scientist on the team you will own the Data Science direction of the company. In your first 30 days you’ll identify immediate needs of the machine learning infrastructure, with focus on setting up the ecosystem. Our main goal is to create more personal and relevant products for our millions of customers by harnessing the intelligence acquired from your solutions.Follow our Technology Blog at BuildTonight to learn about the Engineering Team's challenges, goals and everything in between.WHAT YOU'LL DO Build out our machine learning platform from its infancy, eliminating redundancy and inefficiency in order to make our marketplace more dynamic, intelligent, and predictiveApply ML algorithms and statistical modeling to personalize and optimize our marketplace and understand user behavior, crafting products that are more relevant to our customersCollaborate with executive-level team members to drive innovation and intelligence in our productsBring a startup mentality - you’re not afraid to roll up your sleeves, dig into the code, and implement your ideasWHAT WE'RE LOOKING FOR IN YOU 3-5+ years in a machine learning/advanced analytics environment pushing production-level codeAdvanced knowledge of SQL, Python, R (or similar language); comfort with regression, classification, clustering, time series and other machine learning/advanced analytics techniquesStrong communicator - you can break down high level technical concepts for anyone to digestDemonstrated capacity for developing and understanding strategyScrappy, hands-on problem solverBonus: M.S. or other advanced degree in Computer Science, Engineering, Artificial Intelligence, or other technical fieldWHAT YOU'LL GET FROM US An official Best Places to Work (we're in the top 10!)The opportunity to define mobile commerce and change the way people book travelA people-focused organization dedicated to making sure you're challenged, learning, growing, and recognized for all the great work you doThe camaraderie of a driven, agile team that is building something disruptiveExcellent health, dental, vision and 401k plans, and stock options tooFun stuff - quarterly travel stipend, flexible time off, subsidized cell phone plans and fitness memberships, and the opportunity to spin the HT Roulette wheel to win a spontaneous weekend getaway!We are on a mission to radically transform hotel bookings. Doing this requires us to think differently and to question conventional approaches, therefore it’s essential to have a diverse team of the very best people with all types of backgrounds and experiences to bring the best ideas to life. We are committed to maintaining an environment where all of our team members have the opportunity to be heard, to make an impact and to do the best work of their lives."}