{"jobID": "2831364804", "jobLocation": "Santa_Clara_CA", "jobTitle": "Regional Manager of Business Development- Home Health and Hospice", "companyRating": null, "companyInfo": {"Website": "www.hcr-manorcare.com", "Headquarters": "Toledo, OH", "Size": "5001 to 10000 employees", "Founded": " 1991", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Kindred Healthcare, Genesis HealthCare, Sava Senior Care"}, "estimatedSalary": null, "jobDescription": " Heartland Home Health Care and Hospice is part of the HCR ManorCare family, a leading provider of home health care, hospice care, skilled nursing, memory care and post-acute care.  The Regional Manager of Business Development (RMBD) is responsible for leading supervising, developing and providing direction to Managers of Business Development, Account Liaisons and Hospital Liaisons-RNs. This role will utilize your sales acumen and strategic knowledge to develop and maintain relationships and partnerships with high level executives/influencers in health care facilities, systems and communities in the areas covered. This role collaborates closely with the Regional Director of Operations, and each local hospice agency leadership to develop and implement regional sales plans and to coordinate with operational and clinical leadership to ensure extraordinary customer service and fulfill Heartland promises.  Desired areas of expertise/experience are: Strategic sales leader that is committed to driving growth and expansionAbility to work in collaboration with regional leadership and local hospice offices and their teams to pursue growthProven sales successes in the region, demonstrated by having a network of relatable contactsExperience developing and implementing sales plans with multiple locations, sales representatives, and leadersDesire to want to provide extraordinary customer service to ensure all individuals are given the opportunity to learn about and receive the care they desire/needAbility to perform as an influencing sales leaderAbility to understand and apply market intelligence to sales strategies This role will focus on our business development and growth in the states of California, Arizona, and New Mexico. Consistent travel throughout region is expected.  In return for your expertise, youll enjoy excellent training, industry-leading benefits and unlimited opportunities to learn and grow. Be a part of the team leading the nation in health care!000 - California, any locationA minimum of three to five years in healthcare sales leadership, multi-site experience preferred. Hospice, home care, or community based services experience preferred"}