{"jobID": "2796541899", "jobLocation": "San_Jose_CA", "jobTitle": "Senior Application Developer", "companyRating": "3.5", "companyInfo": {"Website": "www.fishercareers.com", "Headquarters": "Camas, WA", "Size": "1001 to 5000 employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "127000", "jobDescription": " OverviewIt’s an exciting time to be in our IT department; under the leadership of our newly-appointed Chief Technology Officer, we’re investing heavily in the future of our firm’s technology. Our business is growing internationally, which emphasizes the need to build an unparalleled technology team that drives future global growth and scale through strategic solutions and continuous innovation. We play a foundational role in supporting our firm’s diverse businesses, and we’re excited to continue solidifying that foundation as we add more talented technologists to our team.  Our IT Department is now seeking a highly talented Senior Application Developer to join our team to help provide internally-developed and third-party software solutions to meet business needs. This individual will manage technical aspects of assigned projects, including planning and resolving issues. The Senior Application Developer will also work independently to convert business requirements to Technical Design Specifications, and design/develop code for enterprise-wide and other projects. This position can be located in our San Mateo, CA, office (near San Francisco, CA) or Camas, WA, office (near Portland, OR). This will be a contract-to-hire or direct hire opportunity. RESPONSIBILITIESDevelop software, primarily in C# and ASP .NetProvide expertise in the use of the Microsoft .Net stack, including best practices and design patterns.Significantly contribute to software design and architectureDevelop both new applications and improve our existing ones in performance, capability, and reliabilityManaging technical development of software from inception through user acceptance, including projects which affect multiple departments and/or pose high risk situations Designs steps and modules, defines timelines, identifies and resolves issues.May assign work and provide oversight to othersMay serve as technical lead and make decisions regarding technical directionQUALIFICATIONS Minimum Requirements: 5-7 years of experience in developing software programs; or equivalent combination of education/experience Deep understanding of the C# language and ASP.NetSolid understanding of Enterprise Applications Development and strong design skillsPrevious experience serving as a team and/or technical lead in software applications development projects preferredDeep understanding of Web API’s and micro-service patternsExpert in the Microsoft .Net Runtime through version 4.5, including WCF, LINQ, TPL, and other modern librariesExpert in best practices and design patterns in Microsoft .NetBachelor’s degree in MIS, Computer Science, Engineering, Physics, Mathematics, or related discipline Preferred Skills/Previous Experience: Experience with Microsoft MVC pattern is a plusExperience with SQL and / or experience working with large, complex data setsStrong math background and analytical capabilitiesFamiliarity with financial dataWhy Fisher Investments? Fisher Investments is a different kind of investment firm. We don’t come from Wall Street, nor do we believe we fit in with most of the finance industry, and we’re proud of that. We work for a bigger purpose: bettering the investment universe. From unmatched service to innovative perspectives on investing, it’s the people that make the Fisher purpose possible. After all, it’s our people that enable us to offer the level of service that we do. And we invest in them accordingly, offering exceptional benefits like: 100% coverage of premiums for health, vision and dental insurance50% 401(k) match - up to the IRS maximum20 days of paid time off* (plus 9 paid holidays)Open and supportive team-based environmentAnd much, much more We also provide a cumulative, continuous learning and development framework customized for every employee. This emphasis on personal and professional growth has yielded an award-winning work environment; we’re Great Place to Work Certified, and The Oregonian named us as a 2017 Top Workplace with the best benefits!  But in the end, it’s not the perks that keep people here. They stay because they believe in our mission of service—our employees want to make a difference in an industry that can do better.  *California employees accrue up to 17 days of paid time off and 3 days of sick time per year.  Thank you for your interest in our firm. We look forward to hearing from you!  FISHER INVESTMENTS IS AN EQUAL OPPORTUNITY EMPLOYER  #DI"}