{"jobID": "2819833286", "jobLocation": "Medford_MA", "jobTitle": "Downstream Process Engineer/Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.greenlightbiosciences.com", "Headquarters": "Medford, MA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "60000", "jobDescription": " Greenlight BiosciencesDownstream Process Engineer/Scientist Job DescriptionGreenLight Biosciences is seeking an exceptional, highly-motivated Downstream Process Engineer/Scientist with expertise in industrial-scale purification of molecular biology enzymes, proteins and/or nucleic acids to work on the scale-up of cutting edge technology in Cell-free Bioprocessing. The successful candidate will define and develop scalable recovery processes at the benchtop scale by applying state-of-the-art DSP techniques in the context of milestone-driven projects and will scale those processes from benchtop- to pilot- to industrial-scale. Strong technical, organizational, and communication skills, as well as the ability to develop creative solutions to challenging problems, are essential. Responsibilities: Design and develop robust purification schemes for recovering enzymes, proteins and/or nucleic acids from microbial cells using scalable separation techniques (e.g., TFF/MF/UF/DF, chromatography)Collaborate with enzymologists and molecular engineers to achieve purity and composition requirementsWork with the technoeconomic modeling group to define downstream processes in silico, including design schemes, associated costs, and relevant technical assumptions.Scale benchtop-scale purification processes to pilot-scale and industrial-scaleWork with other team members to accomplish project goals and milestones.Use creative problem-solving skills to independently troubleshoot experimental challenges.Continuously contribute to the company’s intellectual property portfolio and routinely track and document results in laboratory notebooks and databases.Analyze, summarize, and present experimental results to team members. Required Skills & ExperienceQualifications: M.S. or Ph.D. in chemical engineering, bioengineering, biochemistry, or equivalent.5+ years of industrial experience developing and scaling downstream processes for the purification of proteins and/or nucleic acids from microbial cellsStrong background in protein purification including precipitation is required.Experience in nucleic acid purification is a plus.Expertise with scalable separation techniques, such as MF/TFF/DF/UF and chromatography is required.Expertise with scalable cell rupture methods is a plus.Must be highly-motivated with exceptional communication, leadership, and teamwork skills. Apply For Job View All Jobs @ Greenlight Biosciences Powered by Built for Teams©2018 Built for Teams  | Support"}