{"jobID": "2670726566", "jobLocation": "Boston_MA", "jobTitle": "Research and Investment Data Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.gmo.com", "Headquarters": "Boston, MA", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Private Practice / Firm", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "60000", "jobDescription": "Company Profile Founded in 1977, GMO is a private partnership committed to delivering superior investment performance and advice to our clients. We offer strategies where we believe we are positioned to add the greatest value for our investors. These include multi-asset class portfolios as well as dedicated equity, fixed income, and absolute return offerings, many of which employ the firm’s proprietary 7-year asset class forecasting framework. Our client base is comprised primarily of institutions, including corporate and public defined benefit and defined contribution retirement plans, endowments, foundations, and financial intermediaries.  GMO, whose sole business is investment management, employs approximately 500 people worldwide and is headquartered in Boston with offices in San Francisco, London, Amsterdam, Sydney, and Singapore. We manage roughly $70 billion in client assets using a combination of top-down and bottom-up approaches that blend traditional fundamental insights with innovative quantitative methods to identify undervalued asset classes and securities. Our valuation-based approach embeds several key factors, including: a long-term investment horizon, discipline, conviction, and a commitment to research. Our research emphasizes not only identifying and exploiting pricing dislocations but also understanding the long-term drivers of return in the markets in which we invest. We are known for our candor in sharing our views with clients and for our willingness to take bold, differentiated positions when opportunities warrant. Position Overview We are looking for a Research and Investment Data Analyst to join a high performing team focused on building and maintaining information in our research databases used in a state of the art quantitative investment process. This person will work closely with the investment teams and technology groups to develop and understand requirements for new and existing datasets and will help facilitate the implementation of processes to load and manage data within our various research databases. This individual will be expected to develop and enhance data quality controls and processes, perform business and quality analysis on new and enhanced data sets, assume project management responsibilities for a variety of projects and assignments, and ensure for the integrity of all daily and monthly processing.  This position offers a unique opportunity to learn about all facets of data used in the investment process. An ideal candidate should have a working knowledge of financial data used in a multi-asset class quantitative investment process and have a strong desire to think about and solve data quality issues and be adept at using various tools and technologies at their disposal to execute the job. Key Responsibilities:Develop an expert understanding of internal databases and processes and ensure information is maintained accurately and efficiently.Become a “subject matter expert” in a variety of data categories (reference, market, fundamental, estimate, macro-economic, et al) across various asset classes including equity and fixed income.Develop a keen understanding of how data is utilized in our investment processes to help design and implement new data sets and processes.Partner with investment teams and respond to and proactively address their data needs.Design and build efficient and effective controls to help resolve and identify potential data issues.Monitor incoming data to detect anomalies and remediate issues.Coordinate with engineering team to identify ways to improve our data and monitoring processes.Investigate and resolve data quality questions and concerns.Work with external market data vendors to bring in any new data sources required by the business users and support existing feeds.Required Skills:Bachelor’s degree required, preferably in economics, statistics, computer science or mathAttention to detail is a must.Experience with SQL required.Experience with Matlab, Python, or R a plusExperience with data systems implemented in the cloud using Data Lake, Spark, and Hadoop a plusExperience with Data Governance tooling a plusExperience working with large data setsExperience with Visualization Tools such as PowerBI, Qlik, Tableau a plusInterest in, or experience with, Machine Learning for Anamoly Detection a plusDemonstrated strong interest in databases and database technologies.Passionate about data, data quality and robust quantitative analysisPrevious experience with historical financial data is a plusStrong communication skillsHigh energy and positive attitude – candidate should be conscientious, self-directed and possess a strong work ethic."}