{"jobID": "2699691901", "jobLocation": "Austin_TX", "jobTitle": "Senior Data Scientist", "companyRating": "3.3", "companyInfo": {"Website": "jobs.thermofisher.com", "Headquarters": "Waltham, MA", "Size": "10000+ employees", "Founded": " 1902", "Type": " Company - Public (TMO) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Illumina, Agilent Technologies, Roche"}, "estimatedSalary": "126000", "jobDescription": " Job DescriptionWhen youre part of the team at Thermo Fisher Scientific, youll do important work, like helping customers in finding cures for cancer, protecting the environment or making sure our food is safe. Your work will have real-world impact, and youll be supported in achieving your career goals.  ThermoFisher Scientifics Life Sciences Mass Spectrometry group is looking for an enthusiastic and well qualified Software Scientist for developing Mass spectrometry instrument software that includes real time control of instruments, associated algorithms for instrument control, instrument calibration, high speed performance and real time data analysis.  The individual should be able to combine extensive knowledge of core sciences like ion physics and chemistry with computer programming for embedded systems, .net applications and cloud based software processing. The ability to effectively communicate and work in a diverse environment with scientists, software developers and chemists is paramount to success in this role. Responsibilities:Develop end to end machine learning models , starting from understanding the domain and related data , selecting features, building and optimizing classifiers and using optimal bootstrapping strategiesEnhancing data collection procedures to include information that is relevant for building analytic systemsDevelop and adhere to rigorous testing of statistics, models, and codeProcessing, cleansing, and verifying the integrity of data used for analysisFollow conventions and best practices for analysis, statistics, modeling, coding, and architecture; hold other members of the team accountable for doing soStay up to date with new technologies and determine how to incorporate these into future platform capabilitiesBuild strong relationships with cross-functional team members and business stakeholdersBasic qualifications:3+ years in Software Engineer roleHands on experience developing models and solutions using techniques in machine learning , information retrieval, data mining, statistics, NLP or related field.Experience managing end-to-end machine learning pipeline from data exploration, feature analysis and selection, model building, bootstrapping and final deployment.Proven experience with distributed systemsProven experience with software development life cycle (SDLC) and agile/iterative methodologies requiredSolid algorithm development background. Experience with building Machine Learning algorithms and productizing them at scale in a distributed computation environment.Proficiency with data analysis languages and tools such as Python/Jupyter or RProficiency with at least one programming language (.Net/Java/C++/ Scala/GO/NodeJs)Proven Experience with Big Data Technologies, such as Apache Spark, Apache Flink, Azure HDInsight, H2OExperience collaborating with cross functional teamsAgile/Scrum/KanbanMachine Learning / Deep Learning,Preferred qualifications:AWS or Azure CloudDesign and document APIs leveraging a standard API documentation framework (Swagger)Life Science experience preferred, but not requiredBioinformaticsResource Description Framework, semantic web, and experience applying those concepts This position is open to relocation.  At Thermo Fisher Scientific, each one of our 65,000 extraordinary minds has a unique story to tell. Join us and contribute to our singular missionenabling our customers to make the world healthier, cleaner and safer.  Apply today! http://jobs.thermofisher.com  Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status."}