{"jobID": "2823206473", "jobLocation": "New_York_NY", "jobTitle": "Regional HR Business Manager", "companyRating": "3.5", "companyInfo": {"Website": "www.qatarairways.com", "Headquarters": "Doha, Qatar", "Size": "10000+ employees", "Founded": " 1997", "Type": " Unknown", "Industry": " Travel & Tourism", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "83000", "jobDescription": "Qatar Airways Welcome to a world where ambitions fly high  From experienced pilots to dynamic professionals embarking on new careers, Qatar Airways is searching for talented individuals to join our award-winning team.  We take pride in our people—a dynamic and culturally diverse workforce is essential to why we are one of the finest and fastest growing airlines in the world.  We offer competitive compensation and benefit packages. About Your Job:As the Regional HR Business Manager for The Americas, you will act as a trusted business partner to the senior leadership team on human capital management matters. You will gain a solid understanding of the business divisions (Commercial, Ground Services, Cargo and Customer Contact Centre) commercial strategy, activities and needs and coordinate required tasks and objectives with specialists from the HR division to provide specific HR solutions. You will focus on strategic HR and practices that support robust business growth, reinforce a culture of performance and are in-line with Group HR policy.  Specific accountabilities include: Understanding the business, the strategy and business drivers, products, budgets, forecasts and employee issuesProviding expert guidance, support and coaching to regional and country management team on key people issuesDeveloping effective working relationships with the client group positioning Human Resources as an integral part of the business and the HR business partner function, as a trusted advisor and consultantProviding active, insight led leadership to the business and HR team by owning, shaping and driving self, others and activityManaging risk and conducting risk assessment toward country legislation, minimising legal risks associated with employment law and health and safetyDevelop a division HR strategic plan in line with the Group HR Strategic plan and Division strategic business plan including performance management, engagement, MIS Communication through Centers of Excellence, drive strategy for expert area's e.g. Recruitment, L&D;, Remunerations & Policies.The Core HR accountabilities would be : Organizational Design, Organizational Development, Resource & Talent Planning, Learning & Talent Development, Performance & Rewards, Employee Engagement & Relations etc. About You:To be effective in this role, you will need a Bachelors degree preferably with a recognised accreditation in Human Resources with at least, 8 years of Job related experience in a Human Resource Function and preferably 3 years specific experience with HR Business Partner responsibilities.  You will need to have experience leading a multi-site operation with responsibility for distance management. You should have experience and knowledge on : Performance Management, Organizational design, engagement, employee relations, Legal awareness - including country/ regional labour laws, strategy development etc.  Experience of working within Airline or Aviation industry will be hugely advantageous. Note: you will be required to attach the following: Resume / CV"}