{"jobID": "2745597095", "jobLocation": "Santa_Clara_CA", "jobTitle": "System Engineer - Signal Integrity and EMC", "companyRating": "3.7", "companyInfo": {"Website": "www.marvell.com", "Headquarters": "Santa Clara, CA", "Size": "1001 to 5000 employees", "Founded": " 1995", "Type": " Company - Public (MRVL) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "92000", "jobDescription": "The EMC and signal integrity engineer will be responsible for analysis and validation of high-speed PHY interfaces and power distribution network. The successful candidate will be part of the signal/power integrity/simulation and EMC expert team and will participate in the definition of chip, package and printed circuit board (PCB) design. Within a concurrent engineering environment, the individual will be part of a larger team with system architects, ASIC engineers, and other SI/PI engineers in creation of next generation high-speed automotive products. The candidate is ideally an expert in analyzing and solving various automotive EMC and other industrial compliance issue in high-speed data communication system with demonstrated experience in these areas. In addition, the position is also responsible for hardware reference design to meet application requirement. Job Responsibilities: Perform SI/PI and EMC analysis in designing working solutions ranging from chip to chip, board to board and system to system.  Conducting lab EMC measurement and follow up on issue resolving.  Develop test plans to validate signal and power integrity.  Develop/simulate/validate channel models with electromagnetic field solvers, such as Ansys HFSS and SIWave  Review and optimize package and PCB design to ensure signal and power integrity.  Perform PCB timing analysis, work with board engineers and layout designers to implement all SI/PI rules, develop layout/SI/PI/PDN checklists.  Perform SI DVT measurements on boards and correlate simulations with DVT measurements.MS in Electrical Engineering or equivalent practical experience.  Solid understanding of electromagnetic theory.  Knowledge/experience about how to apply EM theory on solving SI/PI/EMC issues in a modern high-speed systems.  Familiar with EMC design and debugging techniques  Knowledge of modern digital signal processing technique for data communication systems.  Solid fundamental knowledge of transmission line theory and high-speed Printed Circuit Boards (PCB) design, Knowledge of board stackup, trace geometries, and impact on SI  Proficient with Ansys HFSS/SIwave/DesignerSI, HSPICE, & Agilent ADS.  Hands-on experience with lab equipment such as oscilloscopes, VNA, TDR, and logic analyzers.  A team player with good oral and written communication skills, ability to work in cross-functional team  Capable of presenting new work/concepts/analysis to SI/PI team.  Experience and knowledge with Automotive Ethernet is a plus."}