{"jobID": "2757278088", "jobLocation": "New_York_NY", "jobTitle": "Business Design & Process Modeling - Principal Consultant", "companyRating": null, "companyInfo": {"Website": "www.paconsulting.com", "Headquarters": "London, United Kingdom", "Size": "1001 to 5000 employees", "Founded": " 1943", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " McKinsey & Company, Accenture, Deloitte"}, "estimatedSalary": null, "jobDescription": " Job DescriptionAt PA Consulting Group, we transform the performance of our client organizations by developing business models that enable organizations to navigate disruptive change in their industries and meet evolving needs of customers and regulators. We work alongside senior leadership in developing, deploying and implementing transformative solutions and we are looking for outstanding candidates with a strong drive to succeed who are enthusiastic about business and technology and motivated to achieve our clients' business objectives through solutions that go beyond the latest thinking and accepted wisdom.  Ideally, you should have a track record of successful project delivery working within a major professional services consulting firm or in industry, however other backgrounds will be considered. We also look for the following: Strong consulting skills, including a high degree of communication and presentation skills, with the ability to manage projects, working with both people and technology to achieve successful outcomes.Leadership of substantial projects within a team.Commercial acumen to understand requirements and formulate realistic and robust solutions while appreciating and managing risk appropriately.A willingness to learn and to develop yourself and others around you.Job RequirementsBasic QualificationsMust be local to one of our six US locations; no relocation assistance will be providedBachelor’s degree required. An advanced degree or a specialization in healthcare, computer science or engineering is preferred Additional Attributes Experience in developing models for finance operations, with proven expertise in finance, accounting and procurement processesAt least 7 years of experience in developing strategy and delivering business transformation in areas such as process design, process engineering, process modeling, change management and technology enabled business changeKnowledge and experience in one or more of the following areas: o Business and transformation strategy  o Change management – effectively delivering the change through the organization  o Business processes transformation – through the rationalization of business processes by implementing Lean, Six Sigma and other transformative tools is preferred  o Operating Model definition – defining the target operating model for an organization Strong interpersonal and team-building skillsExemplary communication skills, including written, verbal and presentationThe ability to successfully manage client expectations, projects, deliverables and relationshipsEntrepreneurial, with creative thinking skills What can PA offer you? Original, strategic and operational consulting that makes a real business difference to high-profile clients. We never offer second-hand work or ready-made solutions.The opportunity to work in committed teams that blend in-depth industry experience with high quality consulting expertise. Intelligent and interesting colleagues who will develop and challenge you.A transparent career path where your advancement is objectively measured, enabling you to achieve your full potential.A compelling benefits package that is competitive with the market and designed to reward you for achieving success.About PA Consulting GroupWe are the consulting, technology and innovation firm that uses constant curiosity and ever-evolving expertise to make a lasting impact on the world. We are PA Consulting Group. Specializing in technology and innovation, management and IT consulting, our employees operate globally across a wide range of sectors, delivering practical solutions that make the difference for our clients. Getting exceptional results that have a lasting impact on businesses, communities and individuals is what we do. And finding fresh angles, exploring new avenues and following the unconventional path is how we do it. We are solving some of the world’s most complex problems. But where others settle for off-the-shelf solutions, we approach each challenge with fresh eyes, unconstrained thinking and a perfectly balanced team of experts handpicked for the task.  Join us and make the difference with your career.  We are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class. VEVRAA Federal Contractor"}