{"jobID": "2712185859", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist - Risk", "companyRating": "4.3", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "141000", "jobDescription": " About Uber Were changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now were a part of the logistical fabric of more than 600 cities around the world. Whether its a ride, a sandwich, or a package, we use technology to give people what they want, when they want it. For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer. And thats just what were doing today. Were thinking about the future, too. With teams working on autonomous trucking and self-driving cars, were in for the long haul. Were reimagining how people and things move from one place to the next. About the role Uber is building a world class team that uses machine learning to deliver Uber's goal to make transportation as reliable as running water. You will join the team building machine learning models for the security platform supporting multiple Uber business lines (Rides, Eats, Social, U4B, etc) and multiple risk and security programs (Incentive Fraud, Account Security, Payment Risk, Privacy etc). Our team works together with product managers, engineers, and data analysts. As a member of our team, you'll protect Uber's riders and drivers by bringing state of the art technology to bear on the world's richest dataset about how people move. You will experiment with a range of machine learning techniques including supervised, unsupervised and semi-supervised approaches, and tackle a variety of interesting and challenging problems including knowledge graph analysis, identity and reputation scores, mobile sensor and GPS feature development etc. Our team applies a variety of learning algorithms such as CNN, LSTM, DBSCAN, tree-based models, neural networks, and other graph based techniques such as matrix decomposition, embedding, traversal and clustering etc. You will benefit from Uber's unique talent pool spanning several machine learning domains, including our advance research groups and the Uber AI labs (formerly Geometric Intelligence), applying and extending their research to our domain areas. What you'll need Team spirit: you thrive in diverse teams and everyone in the team loves working with youHands on mastery of data wrangling, modeling, and telling a story based on dataA strong background in mathematics, statistics, machine learning combined with experience using these skills to solve hard problemsFanatical attention to detailA natural desire to learn and innovate: ML and Risk are fast-paced domains and we need to find the most efficient and clever approaches to solving risk problemsExcellent programming skills - ability to prototype effective algorithms and collaborate with engineering team to implement them in the production systemExperience of working with large scale data set and knowledge of mapreduce, spark is desired but not mandatoryKnowledge of the latest ML techniques like deep learning is a plus, but not a requirement"}