{"jobID": "2822542959", "jobLocation": "Boston_MA", "jobTitle": "Toddler Teacher Certified", "companyRating": null, "companyInfo": {"Website": "www.littlesprouts.com", "Headquarters": "Lawrence, MA", "Size": "501 to 1000 employees", "Founded": " 1982", "Type": " Company - Private", "Industry": " Education", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Bright Horizons Family Solutions, Kindercare, The Goddard School"}, "estimatedSalary": null, "jobDescription": "Join Little Sprouts as a Toddler Teacher Today!OVERVIEW Are you ready to make a difference in the lives of children and join a winning team? We are the best early childhood program in the area and we only hire the best. We are always looking to add talented, energetic, positive, honest, and fun people to our team. Must be an outstanding communicator and relationship-builder with parents. EXCELLENT wages and benefits, and paid training! We value teachers that embrace positive energy to make extraordinary differences in the lives of children and families. OUR TODDLER CLASSROOMS In the dynamic environment of our toddler classrooms, children begin to acclimate to a schedule within a whole group setting. Through a combination of personalized instruction and small group time, teachers advance toddlers resourcefulness, critical thinking skills, and capacity for compassion. Our toddler Budding Scholars approach includes a balance of child-directed and teacher-initiated opportunities. Hands-on learning and play keep toddlers actively engaged and continuously interested in understanding more about themselves, their friends, their family, and the world around them. TODDLER TEACHER RESPONSIBILITIESInspire, guide, and support children ages 15 months through 2 years and 8 months.Plan daily lessons consistent with the Budding Scholars approach to learning to develop children across four key domains: Citizen, Scholar, Mind, and Body.Promote empathy in children through warm hugs, smiles, nurturing language, and positive guidance.Care for growing bodies by ensuring that children experience regular feedings, diaper changes, and naps throughout the day to provide the ultimate care and comfort.Read frequently to children to help toddlers explore new concepts and language.Use singing and sign language to effectively communicate with pre-verbal children.Design and implement sensory activities to examine various dimensions of sight, touch, smell, and sound.Create meaningful connections with children to enhance the foundation for social-emotional skills.Aid children in the development and strengthening of both large and small muscle groups.Promote self-help skills, including hand-washing, teeth brushing, self-feeding, coordination, and toilet training.Administer and evaluate several guidance tools and assessments to help individualize the curriculum to each child.Maintain Department of Early Education & Care (EEC) regulations at all times to ensure excellence and compliance.Uphold the vision, professionalism and philosophies of Little Sprouts Early Education & Child Care.REQUIREMENTSTeacher-certified by the Department of Early Education and Care. (college degree a plus)Must be able to stand on your feet for up to 90% of the day, capable of lifting up to 30 pounds, able to sit on the floor and crouch down, and perform all activities with the children including running, jumping, etc.Must be able to close at least one day per week (6:00 pm)QUALIFICATIONSActively exhibit a passion for early education and an enthusiasm for learning!Demonstrate exceptional organizational and multi-tasking skills.Deliver required paperwork and lesson plans on time and to completion.Respond to changing work environments by demonstrating flexibility with schedules, teamwork, and families.Display excellent written and verbal communication skills.INCENTIVESCompetitive wages and comprehensive benefits package including health, dental, vision, and pet insurance.Advanced curriculum support, including education coaches, mentor teachers, and music therapists at every school.Performance and tenure bonuses.Tuition reimbursement and educational stipends.Paid professional development and training.Career advancement and coaching through the Little Sprouts Leadership Academy. Qualified candidates are welcome to apply at www.littlesprouts.com/careers . We will see you soon in the classroom!"}