{"jobID": "2711030416", "jobLocation": "San_Jose_CA", "jobTitle": "Home Health Registered Nurse (RN) Director of Patient Care Services", "companyRating": null, "companyInfo": {"Website": "www.bridgehh.com", "Headquarters": "San Diego, CA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Bridge Home Health is growing! We have locations throughout California and we are looking for a Clinical Leader to join our growing family in San Jose. We currently are looking for full time Director of Patient Care Services for our Home Health Office . We are looking to fill an immediate position for a highly qualified Registered Nurse. Prior Home Health DPCS experience preferred but Clinical Supervisory and Managerial experience encouraged to apply. Prior Home Health experience is a requiredBenefits:For our full time employees we offer a first-rate comprehensive benefit packages that include health, dental and vision insurance, and generous PTO. We offer our employees tuition reimbursement for continuous learning opportunities and provides them with all the necessary tools and resources to perform their role to its fullest.Job Responsibilities:Ensures that the client's plan of care is executed as writtenAssists in preparing monthly Medicare billingAssists in reviewing 485's and 486's4. Assists with patient chart auditsRegularly participates in case conference activities and assures through attendance and record reviews that conferences are conducted and documented in accordance with Agency policyReviews all reports of complaints, errors, incidents, and grievances to insure that they are fully documented and properly handled in the time-frame and manner specified by the Agency's policyCoordinates a program for risk management which encompasses written guidelines and provides for supervision of workers on cases with risk factors, such as: contagious disease, infections, AIDs, hepatitis, high tech therapies, high tech equipment and supplies, and other situations in which the patient or worker is at riskMakes home visits regularly to observe care being rendered, to assess the condition and use of equipment and supplies, and to receive reports of the patient/family satisfaction with care.Assures the confidentiality of clinical recordsPromotes and maintains an environment that is compliant with Federal, state and local regulatory agenciesParticipates in development and implementation of a staff educational program for documentation and Quality ImprovementWorks with administrative and supervisory personnel regarding home care visits to assure high quality and proper follow-up patient care with regard to patient needs.Qualifications:Registered NurseA Bachelor's degree is preferredMust have at least one year of supervisory or administrative experience in home health care or related health programs and one year of supervisory experiencedIn lieu of a Bachelor's Degree - at least two years of home health experience and at least one year of supervisory experience."}