{"jobID": "2750821097", "jobLocation": "Pleasanton_CA", "jobTitle": "Principal Systems Engineer", "companyRating": "3.5", "companyInfo": {"Website": "www.allergan.com", "Headquarters": "Dublin, Ireland", "Size": "10000+ employees", "Founded": " 1948", "Type": " Company - Public (AGN) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "149000", "jobDescription": "Allergan plc (NYSE: AGN) is a bold, global pharmaceutical company and a leader in a new industry model - Growth Pharma. Allergan is focused on developing, manufacturing and commercializing branded pharmaceutical, device, biologic, surgical and regenerative medicine products for patients around the world.Allergan markets a portfolio of leading brands and best-in-class products for the central nervous system, eye care, medical aesthetics and dermatology, gastroenterology, women's health, urology and anti-infective therapeutic categories. With commercial operations in approximately 100 countries, Allergan is committed to working with physicians, healthcare providers and patients to deliver innovative and meaningful treatments that help people around the world live longer, healthier lives every day.Allergan is a company that will inspire you to aim high with your ambition. Where you can build bridges all over the world. Where you can power ideas that drive change. And where you will act fast and drive results for customers and patients. Power your future & join our bold team.Position OverviewThe Principal Systems Engineer will implement best-in-class practices for translating user and business needs into system and subsystem requirements. The person shall be experienced in all aspects of product development with emphasis on systems engineering processes and leadership with a strong understanding of software, electrical and mechanical integration. The person will provide system concept definition, system requirements development and analysis, risk assessment, usability engineering, and systems integration. We are looking for a motivated self-starter who is energetic, has a ‘make it happen’ attitude and can thrive in a fast-paced environment.  Main Areas of Responsibilities:  • Lead systems engineering activities for complex electro-mechanical medical devices. Translate customer needs, research findings and business requirements into product requirements and specifications.Ensure system design and appropriate supporting documentation meets all safety and regulatory compliance.Lead development and maintenance of product specifications, requirements documents, hazards analysis, design FMEA, usability, design V&V; documentation, and other technical documentation.Communicate and collaborate with a wide range of project contributors and stakeholders spanning the organization, and external partners.Lead risk analysis, including system hazard analysis and design FMEA.Provide technical leadership for product design, development, integration, testing, and reliability improvements.Define usability evaluation plans and conduct and coordinate usability testing activities and ensure usability engineering is applied according to international standards"}