{"jobID": "2817714861", "jobLocation": "San_Jose_CA", "jobTitle": "Watson Commerce - Subject Matter Expert", "companyRating": "3.6", "companyInfo": {"Website": "www.ibm.com", "Headquarters": "Armonk, NY", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Public (IBM) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Accenture, Microsoft"}, "estimatedSalary": "85000", "jobDescription": "Job Description Are you a self-starter, a go-getter and a deal maker? Does influencing and challenging CXO's, while selling transformational solutions excite you? In IBM Watson Customer Engagement, you'll find a culture that rewards such entrepreneurial spirit, within one of the world's leading brands. We are looking for talented, high-energy individuals who share our passion for success, and want to help our markets succeed in selling Watson Commerce products.  Candidate will support sales enablement, deal enablement and deal execution in a highly pressurized environment with clearly outlined revenue and enablement objectives. Qualifications and ExperienceHas influenced CXO's decision making process for choosing solutions in transformational projects.Preferably has sold solutions that have improved clients' selling, marketing, merchandising, or fulfillment operations.Preferably has experience in a broad range of industries: industrial, telecom, public, healthcare/life sciences, financial services, and retail desiredBachelors degree preferred in any discipline with a strong academic track record. MBA is a plus.Comfortable as a visionary. We are pioneering cognitive commerce solutions, and seek Subject Matter Experts who can sell a differentiated vision and transform that vision into achieved business outcomes for clients and market share for IBM.CompetenciesStrategic ThinkingSystematically solves problems and hypothesizes possible customer pain points, expectations, and implicit needs; brainstorms with team members to devise solutions to solve complex deal challengesOwnership and Collaboration Relentless drive to take deals to closure and achieve business outcomes  benefit realization for clients, and closed business for IBM. Is independent and self-directed, and takes initiative with minimal direction or supervision, while comfortable in a collaborative environment.InfluenceUses rational and emotional drivers that appeal to customers to frame decision criteria's and negotiation conversations in IBMs favor.Executive CommunicationTailors communication to the customers needs with authority; effectively delivers presentations and has strong verbal and written communication skills.Fearless - risks disapproval to express a differentiated POV about what is right for our clients & their shareholdersTime management - Qualifies time to ensure activity drives outcomes. For active pursuits, clearly understands a deals drivers and the steps to closure.Networkingidentifies the right customer, partner, and IBM stakeholders and builds connections to drive consensus.Workflow ManagementSets clear, realistic, and time-bound objectives that align to business growth; breaks each objective into tasks and process steps that can be achieved within a realistic time frameJob ResponsibilitiesExceed quarterly revenue targetsDesign and execute strategies for creating and progressing pipeline to meet revenue targetsGrow market share in new and existing accountsUse insight and consultative selling techniques to teach customers about their industry and offer unique perspectives on their business, which link back to IBM Commerce's differentiated capabilitiesCoach and be coached. We seek life learners who want to grow, while helping others grow.Independently and collaboratively, with other IBM sellers, strategize for solving deal-level challenges.Sales Hygiene: Regularly update CRM system. Forecasts Accurately Required Technical and Professional Expertise 3 years selling and supporting complex team solution selling to enterprise accounts Preferred Tech and Prof Experience Experience with the IBM Commerce Solutions a plus EO Statement  IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status. "}