{"jobID": "2747654963", "jobLocation": "Los_Angeles_CA", "jobTitle": "Senior Data Scientist", "companyRating": "4.2", "companyInfo": {"Website": "www.factual.com", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Foursquare"}, "estimatedSalary": "170000", "jobDescription": " Senior Data Scientist Los AngelesAt Factual we love all things data! Our mission is to organize and optimize the world’s location information. As a Data Scientist, you will have the opportunity to shape and influence the direction of our products and propel the growth of our business. You will collaborate with a diverse team of software engineers and data analysts to optimize our current machine learning models and pipelines while also developing creative, data-based solutions. You will be working on many different projects, ranging from scoring the popularity of a place at a given time to pairing anonymized geolocation data with real-world place visits.About you:You are passionate about using your programming, data wrangling, and analytical expertise to drive product and business decisions. You are a skilled communicator that will provide thought leadership on metrics, features, and products to teams across the company. You have strong engineering experience and enjoy working in a rapidly changing environment. And most of all: you ship.What you’ll do:Build models to solve a wide range of location data problemsDesign experiments and work with fellow engineers to ensure thoroughness and correctness on a variety of analysesUse and commit to our data processing software and frameworksAuthor specification and lead technical projectsPropose creative strategies based on data-driven insightsWhat we’re looking for:4+ years of industry experience maintaining production machine learning pipelines and using data science to solve business problemsDeep understanding of machine learning concepts and algorithms - particularly classification, clustering, and supervised learning.Expertise with Python/Scala/JavaFamiliarity with distributed programming with Spark or MapReduceApplied knowledge of Statistics (we really value people who can handle uncertainty and variance)Willingness and ability to wrangle messy dataAn advanced degree in a quantitative field (Math, Statistics, Computer Science)Excellent oral and written communication skillsCover letters will be greatly appreciated! Thanks!Apply for this JobRequired First Name * Last Name * Email * Phone Resume/CV  AttachPaste Cover Letter  AttachPaste LinkedIn Profile Website How did you hear about this job?"}