{"jobID": "2824709985", "jobLocation": "New_York_NY", "jobTitle": "Account Manager", "companyRating": null, "companyInfo": {"Website": "www.culvercareers.com", "Headquarters": "San Diego, CA", "Size": "51 to 200 employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Our client is the global leader in the creative deal gift industry, with a history of success. Individually and collectively, they work with some of the brightest minds in global finance. They inspire achievement worldwide through the pieces they create, relationships they form and the outstanding customer service they provide. The global team is made up of passionate, talented people, who take pride in quality work and what they achieve together.  I am currently searching for an Account Manager/Coordinator to focus on managing a portfolio of Fortune 1000 size accounts. This is a very specialized role designed to increase customer satisfaction in the business relationship. There is no cold-calling or prospecting. Compensation includes base salary, monthly and annual bonus, full health benefits, 401K and the opportunity for profit sharing.  1st-year earnings - $60K-$65K. Job Requirements: Bachelor s degree  6mos-2 years of sales or account management.  Relevant industry experience would include; ad agency, marketing, technology, hospitality or employee engagement.  Strong understanding of sales and customer service, able to manage client expectations effectively  Energetic, positive, with a can-do attitude  High ethical values and professionalism  Ability to prioritize and manage time effectively  Excellent written/verbal communication skills  Ability to work collaboratively with others as part of a team, while still being a strong individual contributor in a high growth entrepreneurial environment. Seniority Level Associate Industry Computer Software  Management Consulting  Luxury Goods & Jewelry Employment Type Full-time IND123"}