{"jobID": "2653837558", "jobLocation": "New_York_NY", "jobTitle": "Staff Physician - NYC Correctional Health - 11pm - 7am", "companyRating": null, "companyInfo": {"Website": "www.pagny.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OverviewEffective January 1st, 2016 NYC H + H and PAGNY partner to provide NYC Correctional Health Services.  With approximately 60,000 admissions per year and 10,000 average daily population in twelve jails citywide, the NYC jail system is among the largest in the nation. The Division of Correctional Health Services (CHS) of the New York City Health and Hospitals Corporation is responsible for the delivery of medical and behavioral health care, social work services, discharge planning and reentry services 24-hours a day, 7-days a week. CHS is a national leader in the delivery of health care to the justice-involved population and works continuously to improve access to, and quality and continuity of, care within the jail system.  Positions available at Rikers Island.  ResponsibilitiesDescription: CHS is seeking Full time, Part Time and Per Diem Physicians to join our team at Manhattan Detention Complex in NYC and/or Rikers Island in East Elmhurst, NY for overnight shifts 11pm - 7am.  Staff physicians provide primary care to patients in jail based clinics, perform intake evaluation and treatment and provide emergency care with the support of Emergency Medicine physicians.  The healthcare system is a single-payer system that requires no physician time dedicated to billing. No administrative work is expected outside of work hours, promoting career/life balance.  Physicians work as part of a care delivery team with strong administrative support staff, integrated nursing and mental health.  Compensation and benefits are competitive and malpractice is covered.QualificationsJob Requirements:Registration to practice medicine in New York StateACLS Certification and Infection Control CertificationCurrent Federal DEA LicenseBoard Certification Preferred This position will require a background check, security clearance and/or drug screening. PAGNY is an Equal Opportunity Employer. In compliance with federal and state employment opportunity laws, qualified applicants are considered for all positions without regard to race, gender, national origin, religion, age, sexual orientation, disability, Vietnam era veteran, or disabled Veteran status."}