{"jobID": "2814315142", "jobLocation": "Brooklyn_NY", "jobTitle": "Sales Development Representative", "companyRating": null, "companyInfo": {"Website": "www.gorilla-talent.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2018", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Sales Development RepresentativeTipster represents a new generation of food websites. We are a hybrid between a food guide and a campaign site. In 2011, Tipster was founded in Copenhagen, Denmark, and we are now launching in multiple cities across the U.S. – starting off in NYC.Our team handpicks everything from Michelin-starred restaurants to bakeries and fast food joints. We do storytelling about places that deserve to be highlighted. Additionally, we work with our partners to provide special pricing at rates almost too good to be true. Tipster is about where to eat, and our audience is locals who want to explore their city.About the Role:Together with Tipster’s Founder and CEO, you are going to spearhead our launch in New York City. You will get the role of targeting and closing deals with carefully selected restaurants, gourmet shops, cocktail bars and hidden local food gems in an outside sales role. You will also be contributing to the overall strategy and business development.You will engage with local “Brick and Mortar” merchants with the goal of evangelizing the Tipster mindset of creating value for both the business owner and our members. We are looking for an eager and persistent sales hunter who wants to build his/her sales career in an entrepreneurial, start-up environment.What you will do:Target new merchants in New York City with the end goal of forming long-term partnerships based on trust and integrityCreate brand awareness with the city’s picky foodies and high-quality merchantsDemonstrate high degrees of diligence and accountability, with evidence of personal resultsResponsible for achieving daily activity requirements through outbound merchant contactSpearhead the New York launch by implementing an entrepreneurial sales approachWho you are:A true sales hunter with a clear passion for the restaurant and hospitality scene.A brilliant storyteller who understands how to deliver the vision and concept of TipsterA passionate sales professional preferably with at least 6-18 months of proven success in a competitive outbound sales environmentSomeone with great negotiation and consultation skills but also with a clear focus on making the deal great for both merchants and our membersSomeone who is highly motivated to help build the business from the ground up and to structure an innovative and abstract sales approachYou think analytically and have a start-up mindset that can be utilized in direct partnership with Tipster’s CEO and FounderJob Type: Full-timeSalary: $50,000.00 to $60,000.00 /year"}