{"jobID": "2755231744", "jobLocation": "New_York_NY", "jobTitle": "FATCA Tax Manager", "companyRating": "3.5", "companyInfo": {"Website": "www.rsmus.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1926", "Type": " Private Practice / Firm", "Industry": " Accounting & Legal", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "128000", "jobDescription": " RSM's International Tax practice consists of professionals nationwide with broad experience in international tax matters. The practice advises clients on outbound and inbound structure planning, foreign tax credit, global tax planning, transfer pricing analysis, compliance, ASC 740, information reporting and withholding (including FATCA and the Common Reporting Standard (CRS)), foreign assignment planning and general international business planning.  We currently have an opening for a Manager of International Tax (ITAX) position with strong experience in U.S. back-up, nonresident alien, and FATCA reporting and withholding tax matters as well as experience with the Common Reporting Standards (CRS) (collectively referred to as Global Information Reporting or \"GIR\") to join our International Tax practice. The individual will be a part of our Washington  National Tax Practice housed in our New York office.  This position will provide leadership and technical support for developing and providing GIR services. The candidate will cover areas such as withholding tax on cross-border transactions, double tax treaties,  outbound risk and process reviews, FATCA and the Common Reporting Standard (CRS). In addition to strong tax technical capabilities, the candidate must demonstrate proven project management skills, the ability to lead teams and advise senior level executives, and the ability to partner with business teams  from across all geographies and at all levels. Responsibilities:Manage and execute Global Information Reporting related advisory and compliance projects.Consult with and advise internal and external clients on U.S. back-up, nonresident alien, FATCA, and CRS reporting and withholding requirements for various arrangements including complex cross border transactions and mergers and acquisitionsPrepare and/or review tax information returns including IRS Forms 1042, 1042-S, 1099, Foreign Bank Account Reports, FATCA and CRS reportsSupport RSM teams and member firms nationally on GIR related projects and issuesBe a driving force in the growth and expansion of GIR services throughout the firmEstablish steps, responsibilities and timelines for GIR projects and compliance effortsHeavy research and drafting of tax memorandums, tax protests, and other correspondence regarding  tax information reporting and withholding issuesLead internal training sessions and client educational workshops on FATCA, CRS, and other information reporting and withholding topics upon requestMonitor legislative and regulatory developments impacting reporting and withholding requirements and draft thought leadership regarding the impactQualifications:Bachelor's Degree in Accounting, - CPA, EA, JD or MST preferredMinimum 5 years of tax information reporting and withholding experience in a corporate, public  accounting or law firm environment (Big 4 experience preferred)Minimum of 3 years of experience managing tax professionalsStrong knowledge of IRC Chapters 3,4, and 61with the ability to consult and advise on related issuesExperience with related tax compliance including preparation of Forms 1042, 1042-S, and FATCA reportsProven ability to develop and implement policies and procedures, including the design and  documentation of detailed process flowsAbility to resolve issues quickly; well organized with strong management skills You want your next step to be the right one. You've worked hard to get where you are today. And now you're ready to use your unique skills, talents and personality to achieve great things. RSM is a place where you are valued as an individual, mentored as a future leader, and recognized for your accomplishments and potential. Working directly with clients, key decision makers and business owners across various industries and geographies, you'll move quickly along the learning curve and our clients will benefit from your fresh perspective.  Experience RSM US. Experience the power of being understood.  RSM is an equal opportunity/affirmative action employer. Minorities/Females/Disabled/Veterans. "}