{"jobID": "2796541885", "jobLocation": "San_Jose_CA", "jobTitle": "Senior Corporate Financial Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.fishercareers.com", "Headquarters": "Camas, WA", "Size": "1001 to 5000 employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "102000", "jobDescription": " OverviewFisher Investments is a privately-held investment management firm who manages portfolios for high-net-worth private clients and some of the world's preeminent institutions. We are now searching for highly talented individuals to join our Finance team in our Woodside, CA (in the San Francisco Bay Area) office. Job Summary: The Senior Corporate Financial Analyst is a key member of the firm’s Financial Planning and Analysis Team and is responsible for creating and maintaining financial models, forecasts and reports requiring very strong analytical and systems skills. The Senior Financial Analyst may support the most complex business units or specialized functions within the Finance organization. Responsibilities:Work closely with the Group Vice President of the assigned business units to review variance and trend analysis, performance metrics, forecasting, annual planning, and ad hoc reportingPrepare timely and accurate reports, variance analysis and commentary as part of the monthly forecasting and management reporting processDrive the further development of detailed Excel financial models to project the firm’s Assets Under Management for forecasting, planning and scenario analysesRegularly plan and conduct highly complex analysis projects, involving thorough understanding of all financial processes and their interactionLeverage the department’s Business Intelligence and Reporting tool to design and create new custom reporting for enhanced decision analysisResponsible for timely delivery of assigned department projects and initiativesDrive the annual planning process including developing and updating training materials, coordinating all activities throughout the firm, and preparing effective trend analysis and reportingFunctions as a subject matter expert and/or utilizes very broad finance expertiseResponsible for testing financial systems and reports following system upgrades or business requirement changesQualifications:Bachelor’s degree in finance/accounting4-6 years of related experience including a solid understanding of financial reporting, project management skills and a proven ability to work across functions within an organizationExcellent analytical and modeling skills are essentialAdvanced Excel skills and Intermediate MS Access query skills requiredPrior experience using BI tools such as OutlookSoft, Hyperion or Cognos requiredMust possess high degree of professionalism, adaptability and strong customer service skills including a high level of integrity and commitment to confidentialityBenefits:Competitive compensationOpen and supportive team-based environmentGenerous paid time offFull medical benefits; dental and vision benefits401(k) plan with 50% company match Thank you for your interest in our firm. We look forward to hearing from you!  FISHER INVESTMENTS IS AN EQUAL OPPORTUNITY EMPLOYER  #LI-FI1"}