{"jobID": "2816218413", "jobLocation": "Boston_MA", "jobTitle": "Senior Data Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.marcusa.com", "Headquarters": "Pittsburgh, PA", "Size": "201 to 500 employees", "Founded": " 1955", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " BRUNNER, Branding Brand"}, "estimatedSalary": "108000", "jobDescription": " MARC USA is a national, full-service advertising and integrated marketing agency. Our Boston office is seeking a Senior Data Scientist for our Analytics team.  Our Analytics team plays a central role for all clients by using data to understand how media affects their business and identifying how to optimize their marketing budgets. We are practitioners of Data Science, statistics, machine learning, data visualization and insight discovery. The Senior Data Scientist will own the entire data science spectrum. Here’s the topline of your role in the agency:In this client-facing role, you will interact independently with clients to identify needs, deliverables and timelines;Translate client needs into analytical methods, and apply the methods;Turn model results into customer insights;and ultimately deliver insights to clients.Specific Responsibilities:Design tests that measure the effectiveness of media against various client objectives, such as brand awareness or salesExplore, filter, restructure, join, and aggregate raw data into varying formatsApply analytical techniques to datasets of all sizes and formats to uncover useful and otherwise hidden insightsMake data-driven recommendations to our clients that ultimately drive growth for their businessesPackage the results of analyses into visually appealing, insightful, and compelling presentationsPartner with other agency disciplines to bring complete solutions to our clientsRequirements:Educational background in statistics, mathematics, computer science, economics, policy, or related STEM fields2-4 years of relevant experience in a consulting, agency, or client-side organization, where business acumen was an important assetExperience with parametric statistical techniques like experimental design and A/B testing, linear regression, logistic regression, factor analysisExperience with time-series methods like ARIMA, state-space models, seasonal decompositionsExperience with machine learning techniques like decisions trees, random forests, natural language processing (NLP), and data miningSolid programming ability; SAS, R, SPSS, SQL, Python or similar platforms preferred; Java or other development language experience a plusAbility to translate complex analytical findings into concise, business-focused recommendationsBonus Points:Experience using cloud environments for Data Science (AWS, Azure, etc.)Artificial Neural networks / deep netsOptimization techniques and algorithms"}