{"jobID": "2744178740", "jobLocation": "New_York_NY", "jobTitle": "Senior Investment Banking Analyst/Associate", "companyRating": "3.7", "companyInfo": {"Website": "www.tigerrisk.com", "Headquarters": "Stamford, CT", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "88000", "jobDescription": "TigerRisk Capital Markets & Advisory (TCMA) is seeking a highly motivated, experienced senior analyst or associate to join our Investment Banking Team in New York City. Formed in 2015, TigerRisk Capital Markets & Advisory is the investment banking division of TigerRisk Partners and is exclusively focused on the insurance industry. TigerRisk Partners, formed in 2008, is a privately-held reinsurance broker and risk/capital management advisor with a selective list of current and prospective customers. We focus on challenging the status quo where both customers and reinsurance clients benefit from our market knowledge and innovative analytical platform.TigerRisk and TigerRisk Capital Markets & Advisory have attracted a team of experienced experts who assume the role of problem solver, innovator, and sophisticated financial solutions provider. The depth of our resident intellectual capital, market knowledge, and industry relationships enable us to provide unparalleled creativity and service.Primary ResponsibilitiesA new senior analyst / associate will play an integral role on our teams, providing analytical support on mergers and acquisitions, public and private capital offerings, insurance-linked security (ILS) offerings and other financial advisory services for our clients. Analysts / Associates on the TCMA team will be heavily involved in the following tasks:Preparation of company valuations including using various methodologies including discounted cash flow, leveraged buyout, trading comparables and transaction comparables;Preparation of company marketing documents and client presentations in addition to performing research and various analyses in support of new business generation;Participate in the origination and execution of M&A;, equity, debt and ILS transactions;Build detailed financial models to evaluate performance under various operating scenarios and to analyze the impacts of different capital structures and potential M&A; transactions;Prepare presentation materials for use in client meetings; covering topics such as strategic alternatives, capital markets activity and general corporate finance;Participate in all stages of transaction executions, from the pitch phase through closing. Analysts / Associates develop their skills through broad and frequent exposure to both other junior and senior bankers. You will gain a strong career foundation in financial services. Our analysts / associates are the anchors of each team and are expected to make a personal impact right from the start. You will work on some of the biggest deals in insurance investment banking, interact with clients almost immediately, travel for the firm and handle increasingly important responsibilities.Required QualificationsThe ideal candidate will have (i) an enduring work ethic and track record of success; (ii) the ability to function equally well in both a team setting and on a self-directed basis; and (iii) excellent mathematical, writing, verbal and computer skills. Key required qualifications include:2+ years of investment banking experience as a FIG Analyst or Associate; or 3+ years of investment banking, management consulting, accounting, or other relevant financial services industry experience (preferably with a focus on the (re)insurance sector)Demonstrated academic achievement and excellence outside of academics;Excellent written and verbal skills;Ability to work independently and as part of a team;Demonstrated ability to work in a time sensitive environment and under pressure with tight deadlines;Ability to multi-task with strong attention to detail;Ready to assume a high level of responsibility;Bachelor’s Degree required; well-rounded academic background, with coursework in finance, economics, mathematics, or actuarial science is preferred;Demonstrated leadership abilities;Solid interest in the financial sector;Excellent PC skills; advanced knowledge of Excel, Word and PowerPoint a must;Series 7, 79, and/or 63 licenses preferred;Legally authorized to work in the United States."}