{"jobID": "2791843813", "jobLocation": "New_York_NY", "jobTitle": "Office Experience Associate", "companyRating": null, "companyInfo": {"Website": "www.yipitdata.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " YipitData specializes in analyzing web data for institutional investors. Three years ago YipitData consisted of 20 people. Since then, we've grown to 80+, have tripled our revenue and expanded our client base to include the largest institutional investors in the world.  Now, were looking to hire another person to help manage our growing office and employee experience. As our Office Experience Associate, you will help make sure our office (a beautiful loft in flatiron) is the best place to work in NYC! How will we define success for our Office Experience Associate? You will:Take full ownership over our day to day operations of our office. Including:overseeing supply managementsolving maintenance issues and handling communications with office vendorsthinking a step ahead to improve upon existing processes and prepare for potential issues that come with rapidly scaling an office and team.Manage and improve our food and beverage programImprove our office productivity by maintaining our conference room scheduling and assisting those who need space to keep their work moving forward.Make every guest who walks through our door feel welcomed and attended to - be the mailmans favorite stop of the day!Youre likely to succeed if:You have at least 1-2 years of Office Assistant or Executive Assistant experience under your beltYou have impeccable attention to detail and creative problem-solving skillsYou may have experience with a start up or rapidly growing teamCompensation includes competitive salary, equity and benefits of working at a successful VC-backed startup.YipitData is an equal opportunity employer and seeks excellence through diversity."}