{"jobID": "2704967483", "jobLocation": "Somerville_MA", "jobTitle": "Computational Biologist I: Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.finchtherapeutics.com", "Headquarters": "Somerville, MA", "Size": "51 to 200 employees", "Founded": " 2016", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About Finch Finch Therapeutics is unlocking the therapeutic potential of the microbiome via our human-first drug discovery platform. We support clinical studies that intentionally manipulate the microbiome to investigate causality in diseases that are otherwise poorly understood, then leverage this clinical data to focus our in vitro and in vivo efforts on cocktails of microbes that have already demonstrated safety and efficacy in humans. Using high-throughput molecular data these human and ex-vivo experiments, we identify specific strains that drive clinical phenotypes and responses to microbial therapies. Our team values transparency, integrity, humility, and collaboration, and we intend to have fun while maximizing our ability to make an impact on patients’ lives. We are searching for passionate teammates eager to support this mission. Job Description As a member of our Data Science team, your mission is to develop tools and intuition to predict successful microbial therapies. You will design experiments (computational, bench, animal, and clinical) and extract mechanistic understanding from high-throughput microbial data. You will further our microbial drug development platform by mining microbial datasets, developing our machine learning platform, and working closely with both bench scientists and clinicians to brainstorm and test functional hypotheses about microbial community disease. You will have the opportunity to further our IP portfolio and participate in our product development from early discovery to regulatory applications and clinical trials, learning about the full life cycle of a drug's development.  Responsibilities will include but are not limited to: Propose new biological hypotheses for microbial drivers of pathology and therapy, based on high throughput data, lit review, and in house experiments; develop and perform statistical tests of these hypothesesUse machine learning effectively and develop new analysis strategies for large biological datasets (e.g. 16S, metagenomics)Work closely with bench scientists to design and analyze microbial function and phenotype experimentsWork with clinicians to help design and analyze clinical trials (particularly of microbial therapeutics)Communicate analysis results with a variety of audiences including clinicians, bench scientists, industry executives, and academic researchers, especially with effective graphical output.Work effectively as part of a multifunctional team in support of a commercially viable therapeutics discovery platformQualificationsPhD in computational biology or a related fieldProven track record of statistical analysis of datasets in the life sciencesProven ability to design and code new algorithmsFacility with big data visualization, especially with R or python matplotlibAbility to work independentlyEager to work collaboratively in a team and to both give and receive feedback to support professional development for self and othersAbility to perform complex analyses in a time sensitive fashionStrong organizational and communications skillsPassion, humility, and excitement for doing whatever it takes to drive research forwardAdditional Desired Skills & Experience (not required)Experience in the fields of microbiology, evolution, genomics, immunologyExperience with machine learningExperience executing computational analysis of metagenomic or genomic datasetsFamiliarity with cloud computing, in particular AWS EC2, CFNPrevious experience developing database architecture At Finch Therapeutics, you can expect to engage deeply in the core of our mission. You will grow with a dynamic, rapidly expanding organization, and have an opportunity to contribute to cutting edge research that will truly impact patients’ lives. We offer a competitive starting salary, plus healthcare and other benefits. As we grow, there will be opportunities for promotion and professional development.  This is a full-time, exempt position with a comprehensive benefits package. This is an entry-level position. You be will be reporting to the Director of Data Science. Application Instructions: The start date for this position is flexible. To apply, please go to http://finchtherapeutics.com/jobs, then follow the link for Computational Biologist to submit your cover letter and resume. Promising candidates will be contacted to further evaluate their fit for this role and our organization.  Authorization to work in the US required. No visa sponsorship is possible."}