{"jobID": "2817760818", "jobLocation": "Pleasanton_CA", "jobTitle": "Master Data Analyst (MDM Cust & Vendor Custodian)", "companyRating": "3.1", "companyInfo": {"Website": "www.bio-rad.com", "Headquarters": "Hercules, CA", "Size": "5001 to 10000 employees", "Founded": " 1952", "Type": " Company - Public (BIO) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Thermo Fisher Scientific, Abbott Labs, bioMérieux"}, "estimatedSalary": "74000", "jobDescription": " Bio-Rad Laboratories is seeking a highly proactive MDM Custodian who’s passionate about Master Data accuracy and driving products to market. The MDM Custodian will assist the Project Management Team with transferring products to Manufacturing.  The goal of this role is to assist project teams to move products to market as quickly as possible while maintaining high standards of quality. The successful candidate will have excellent communication skills along with knowledge of Master Data and/or ERP Systems (SAP). Assist Project Management Team with New Product launches and sustaining existing products.The MDM will support new product launches in transferring to manufacturing.These activities may include:Drive quick, efficient, and accurate creation of material master data.Partner with manufacturing plants to continuously improve master data accuracy.Create and revise Materials in SAP.Create and update BOMs.BS Technical Degree / engineering disciplines; Electrical, Mechanical, Computer Science, CAD. Or equivalent work experience.Good Attention to Detail.Must have strong critical thinking skills and proven ability to independently solve problems.Must be able to drive assigned tasks, which may entail finding your way through ambiguity.Must be extremely energetic with a strong desire to learn/grow.Must demonstrate self-confidence and a positive attitude/disposition.Must have excellent communication skills and ability to build/develop strong relationships.Must be extremely organized and detail oriented.Must be able to read, understand and relay technical information accurately and concisely to non-technical staff and management.Proficient using Google Applications and Microsoft Applications.Basic understanding of Version Controlled Objects Stored within Data Base Systems; i.e. SAP, Baan ERP, Cad / PLM , Documents, Bill of Materials, etc.4+ years’ experience in implementation of Product Support and or New Product Development using a Controlled Data Base environment (SAP); i.e. interacting / input/data entry, uploading files/downloading files.About Bio-Rad: Bio-Rad is a global leader providing a broad array of clinical diagnostics and life science research products. With a team of more than 7,800 employees and a global network of operations serving our customers, we help people live longer, healthier lives.  Bio-Rad was founded over six decades ago and has continued to provide the healthcare industry with innovative and useful products that help life science researchers accelerate the discovery process and medical diagnostic labs obtain faster, better results.  EEO/AA Employer/Veterans/Disabled/Race/Ethnicity/Gender/Age Agency Non-Solicitation: Bio-Rad does not accept agency resumes, unless the agency has been authorized by a Bio-Rad Recruiting Representative. Please do not submit resumes unless authorized to do so. Bio-Rad will not pay for any fees related to unsolicited resumes."}