{"jobID": "2777760319", "jobLocation": "San_Francisco_CA", "jobTitle": "Software Engineer - Intern", "companyRating": "4.2", "companyInfo": {"Website": "www.databricks.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Google, IBM"}, "estimatedSalary": "101000", "jobDescription": "Mission As a software engineer intern, you will join our world-class engineering team that is building out Databricks. This includes teams that span a variety of work from working on the cluster manager to building out collaborative features to building software to manage cloud infrastructure. Your team will consist of 5 to 8 engineers with whom you will work on a daily basis. Your team will be responsible for empowering and pushing you to grow as an engineer.  An internship at Databricks will introduce you to leading experts in computer science and influential projects that matter to the field of big data and technology. In order for our interns to gain the most out of their time at Databricks, we will require a minimum commitment of 12 weeks. OutcomesWrite client-side and server-side code for the Databricks platformWork as an individual and in a team to deliver features or improve architectureCommit a change to production within the first monthProactively seek feedback and input from other team members and teamBe able to deliver on small, well-understood deliverables spanning weeksCompetenciesHave a BS/MS or PhD degree in Computer Science, Engineering, or a related subjectProficient in Java, Scala, Python, or other general purpose programming languagePrevious internships where one produced production quality codeGood knowledge of algorithms, data structures, and OOD/OOP principlesPreferred SkillsRising seniorStrong knowledge of distributed systemsPrevious internship experience where you contributed production-level code3.5 or above GPAAbout Databricks Databricks mission is to accelerate innovation for its customers by unifying Data Science, Engineering and Business. Databricks founders started the Spark research project at UC Berkeley that later became Apache Spark. Databricks provides a Unified Analytics Platform powered by Apache Spark for data science teams to collaborate with data engineering and lines of business to build data products. Users achieve faster time-to-value with Databricks by creating analytic workflows that go from ETL and interactive exploration to production. The company also makes it easier for its users to focus on their data by providing a fully managed, scalable, and secure cloud infrastructure that reduces operational complexity and total cost of ownership. Databricks, venture-backed by Andreessen Horowitz, NEA and Battery Ventures, among others, has a global customer base that includes Viacom, Shell and HP. For more information, visit www.databricks.com.  Apache, Apache Spark and Spark are trademarks of the Apache Software Foundation."}