{"jobID": "2641633210", "jobLocation": "Berkeley_CA", "jobTitle": "Software Engineer Intern - Fall", "companyRating": null, "companyInfo": {"Website": "www.kloudless.com", "Headquarters": "Berkeley, CA", "Size": "1 to 50 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Kloudless mission is to make it easy for companies to integrate their products with software applications. From Dropbox and Salesforce to Slack and Google Apps, our unified APIs enable companies to connect their products to business stacks quickly, saving them valuable time and effort.  Were looking to hire engineering interns at our Berkeley offices. You will be expected to work independently within a small team of cross-functional engineers. We are looking for candidates who can take the initiative on application architecture, development, and product roadmap. ResponsibilitiesWork with a variety of technologies to build the best experience around the leading API integration platform.Keep yourself and others accountable to coding standards and best practices such as DRY and KISS principles.Make smart decisions from design and architecture all the way to implementation, testing, and release.Own your part of the stack and make a positive contribution to the rest.Technical RequirementsExperience with HTTP APIs, web services, and web application development.Strong grasp of the software development lifecycle, and experience developing applications with a modern general purpose programming language such as Python, Ruby, JavaScript, Java, C# or similar.Comfortable using tools in a Linux environment such as SSH, git, text editors, and working with a terminal in general. DevOps experience preferred.Debugging and troubleshooting skills.QualificationsAn entrepreneurial mindset. Eager to join a dynamic, fast-paced, startup environment, and take the initiative building the Kloudless platform.Confident in coming up with innovative solutions, and challenging the status quo. Can make quick decisions based on a variety of business or product demands.Excellent communication and interpersonal skills.BenefitsFree snacks, lunches, dinners and team outingsDog-friendly office. Woof!Opportunity and autonomy to make a huge impact!About Kloudless Kloudless is the go-to platform for enterprise software integrations. Businesses use our unified API products to connect to many kinds of enterprise applications like Salesforce, Box, Dropbox, G Suite, Slack and more. With Kloudless, developers can stop building tedious and expensive one-off integrations by using Kloudless to build once and integrate many. We are trusted by more than 15,000 developers in over 4,000 organizations.  Kloudless is backed by top tier investors including Aspect Ventures, Alibaba, Vivek Ranadive (Founder of TIBCO), David Sacks (Founder of PayPal, Yammer), and Tim Draper (investor in Box, Tesla, SpaceX). We are also a member of the Heavybit Industries, a community of developer-focused companies, founders, investors, and advisors."}