{"jobID": "2768778064", "jobLocation": "Boston_MA", "jobTitle": "Business / Data Analyst, AVP", "companyRating": null, "companyInfo": {"Website": "www.statestreet.com", "Headquarters": "Boston, MA", "Size": "10000+ employees", "Founded": " 1792", "Type": " Company - Public (STT) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " J.P. Morgan, BNY Mellon, Northern Trust"}, "estimatedSalary": null, "jobDescription": " We are looking for a Data analyst with 6 to 10 years of experience in data sourcing and data analysis skills and should be proficient in SQL. The candidate should have experience working in the Banking or Financial Services Sector and experience in Regulatory, MIS or Risk Reporting is a plus. The Position willPerform Data Analytics and Data AnalysisInteract and interface with clients, partner organizations, development and testing teams on the entire book of workWork with the Business teams to gather detailed, accurate and specific data requirementsPrepare functional and technical specifications documents and work closely with developers to ensure that they understand the specifications and deliver solutions for these specificationsWork with Business Analysts on firm-wide initiatives and participate in the testing phasesAssist with production and support activities and help identify, mitigate and resolve issues which may come up from time to timeWork with Global counterparts and identify common tools and techniques which can be employed to increase the overall productivity of the teamSupport Data Stewards with cataloging and certifying key data including business and technical data definitions, data flow, security, privacy, use and location of data;Analyze data flows and dictionaries to support the cataloging efforts;Participate/Initiate data quality efforts working closely with key stakeholders to design, develop and deploy process redesign, and tool implementation, where needed.Functional SkillsUnderstanding of Operational Data Store and Data WarehouseAbility to understand Data Sourcing RequirementsAbility to understand Data Transformation, Data Mappings, Data Model, Normalization (& De Normalization)Preferable to have prior experience in working for Data Intensive programs in Banking or Financial ServicesGood knowledge of Banking and Securities productsGood knowledge in Finance and AccountingShould understand the trade and loan attributes used for reportingProficiency in SQL is expectedData & business analysis skills – Familiarity with data feeds, mapping documents, data specification documents. Ability to trace data elements through their lineage and transformation as data elements move through systems.Understanding of Agile MethodologyAbility to conduct Gap analysis, Impact analysis and system analysis with a high standard of proficiency on defined projects and continuous improvement initiativesAbility to gain a deep understanding of the data architecture and how it rolls out to the reporting architectureNon-functional Behavioral skillsA team player, who is focused on the project goals.The person should be able to collaborate well and has no ego issues.The person should be willing to learn.A go getter, who can execute on his/her own and get the results.Good oral and written communication skills.Leadership qualities and strong management skills, particularly in respect to prioritization and execution."}