{"jobID": "2740301303", "jobLocation": "Pleasanton_CA", "jobTitle": "Lead Data Analyst / Bioinformatic Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Nucleic Acid Sequencing Development The successful candidate will play a key role in the company’s sequencing data analysis and algorithm development. He or she will work directly with surface chemists, biochemists and SW developers to support development of a high-throughput, low-cost sequencing platform. Position seniority commensurate with candidate experience.Primary R&D; activities and responsibilities include:Designs, plans and executes sequencing development and optimization experiments.Develops a strategy for integration with sequencing substrateSupports the surface chemistry and hardware teams to improve system performance.Works closely with the data anlaysis team to specify and create reports to monitor system performance and set criteria for system optimization.Build, supervise and mentor a biochemistry team as the company grows.Act as a liason with the software development team to specify instrument control UI and functionality.Qualifications and Experience:Undergraduate degree in mathematics, informatics, computer science, or related field.Advanced degree a plus.8+ years of experience in data analysis or bioinformatics, preferably in sequencing applications.Expert knowledge and extensive experience with data analysis, visualization and interpretation.Very large dataset manipulation a must.Programming and database experience and skills a strong plus.Expertise in NGS data analysis and algorithm development highly desirable.Experience with optimizing the performance of a biological system a strong plus.Familiarity and comfort with the fast-paced startup environment and culture.About Apton Biosystems Apton Biosystems Inc. is based in Pleasanton, CA. The company was founded in 2012 with the goal of revolutionizing the way cellular processes and pathways are characterized. We are developing an ultra-low-cost and high-throughput sequencing platform based on our 4-color single molecule detection system. This system was developed for the detection and quantification of multiple analytes (DNA, RNA and Proteins) on the same platform and uses proprietary optical and authentication technologies to push the limits of molecular detection and quantification."}