{"jobID": "2796639723", "jobLocation": "Fremont_CA", "jobTitle": "Senior Director of Quality & Management Representative", "companyRating": null, "companyInfo": {"Website": "www.shockwavemedical.com", "Headquarters": "Fremont, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Shockwave Medical is revolutionizing the interventional treatment of advanced cardiovascular disease, creating new opportunities for patients and physicians by effectively targeting calcified plaque. Together, we are working to reshape interventional therapy with Lithoplasty® Technology for the treatment of calcified plaque. Position Overview The Senior Director of Quality Assurance is responsible for the administration, supervision, and development of the Quality Department. The position has supervisory responsibility for the following functions/job titles: Quality Control, Quality Compliance, Documentation Services, Quality Engineering, and Quality Systems. Essential Job Functions The Senior Director of Quality Assurance is the Management Representative for ISO, FDA and FDB purposes. The Director of Quality Assurance is responsible for representing the facility to external Quality Management System (QMS) Assessment agencies, such as Notified Body Auditors, Federal Food and Drug Agency (FDA) Inspectors, State of California Food and Drug Branch (FDB) Inspectors, and other Auditors.  Develop and implement procedures and systems to assure Shockwave Medical, Inc. complies with applicable regulatory standards such as:  • ISO 13485 – Medical Devices – Quality Management Systems  • Council of the European Communities Directive 93/42/EEC - Medical Device Directive  • Current Good Manufacturing Practices (CGMP) Quality Systems Regulation  • CMDCAS - Canadian Medical Devices Conformity Assessment System  • FDA Medical Device Reporting (MDR)  • EU Vigilance Reporting  • UL, CE, CSA, and other testing standards  Develop and implement methods and systems to assure that development as well as production teams receive support in the following areas:  • Quality planning including inspection techniques and sampling methods  • Statistical analysis  • Certification of Controlled Environmental Rooms (CERs)  • Verification and Validation activities of products, process and equipment  • Biological and biocompatibility testing including sterilization validation  • Application of required regulatory standards  Develop and implement procedures and systems to assure product manufactured for human use meets Product Development Process and functional specifications. These systems are to include as a minimum: Delivery of raw materials and OEM products.Manufactured devices and equipment.Documentation associated with these functionsDevelop, track, and report on the following administrative systems:Departmental BudgetDepartment and Facility MetricsDepartment Goals and ObjectivesPersonnel development and training Develop and implement business and operational strategies  Other duties as assigned. These job requirements are not intended to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel Requirements The Senior Director of Quality Assurance is preferred to have a minimum of a Bachelor’s Degree (or equivalent experience), preferably in a technical field such as engineering or physical sciences, as well as 8 years working experience within the Medical Device Industry or an equivalent combination of education and experience in the field of Quality Assurance.  The majority of the work will be performed on-site in an office environment. Periodically as a result of the interactions with our outside customers and other departments, the Senior Director of Quality Assurance will be required to travel as well as be exposed to various chemicals and biological hazards. Expected CompetenciesLeadershipKnow the BusinessDevelop self and othersSet DirectionManage executionDrive Innovation & ChangeTake initiativeInspire OthersOptimize communicationPromote TeamworkMake decisionsAbility to work in a fast-paced environment while managing multiple prioritiesBachelors Degree preferred or equivalent experience.Operate as a team and/or independently while demonstrating flexibility to changing requirements.There may be continuous sitting for prolonged periods (more than 2 consecutive hours in an 8 hour day)Employee may be required to lift objects up to 25 lbs or more. Employees will be required to work in an air conditioned office space and possibly perform some tasks in our non-temperature controlled warehouse space.Benefits Shockwave Medical offers competitive salary, equity and healthcare. If you have experience and initiative for this fast paced fun start-up, please apply.  EEO Employer"}