{"jobID": "2787175941", "jobLocation": "Renton_WA", "jobTitle": "Supply Chain Data Analyst Csc", "companyRating": "3.4", "companyInfo": {"Website": "www.providenceiscalling.jobs", "Headquarters": "Renton, WA", "Size": "10000+ employees", "Founded": " 1855", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "44000", "jobDescription": "Description:Providence is calling a Supply Chain Data Analyst-CSC to Providence Health & Services in Renton, WA. We are seeking a Supply Chain Data Analyst-CSC to support the CSC scope of operations in managing system-wide contract related information, compliance, and financial analysis. In addition, this position supports data analytics for daily, monthly, and annual operating metrics and dashboards. This includes supporting negotiations and monitoring compliance for system-wide contracts, the analysis of contract utilization and proposal data, and formulating recommendations. The successful candidate will demonstrate the ability to analyze and comprehend large amounts of data, create basic to complex reports, charts, and graphs from various sources of information and effectively facilitate discussions with decision-making bodies. The incumbent will leverage data mining tools and techniques to create and manage databases of data. This position will build reporting tools, including regular scheduled KPIs. This position will build and monitor a database of auto-generating reports. This position will use data analytics to decipher data trends and variances and create summary reports to leadership Essential Job Functions:Designs, prepares and delivers regular and ad hoc reports and analysis of key performance indicators. Requires data mining, organizing and analysis.Converts data into meaningful graphs and charts that provide insight into business operations and results.Use data analytics to provide decision support to CSC leadership. Perform applied analytics.Ensuring reports are accurate, relevant and delivered on time.Ensures the accuracy, relevance and timeliness of all reports provided to OSCM management and clients.Ensures the data integrity of the reporting system and all reports and analytics.Evaluates the effectiveness of programs by using analytics to compare results with original proposals.Ensures the most effective method of delivery and presentation is used for communicating reports, graphs and charts.Streamlines the implementation process of report updates, fixes and enhancements.Develops and maintains clear, complete, concise and transferable documentation for support of reports.Qualifications:Required qualifications for this position include:Minimum of a Bachelors degree in Computer Science, Information Systems, or Business Administration is required, or an equivalent combination of education and/or experience.Must have the ability to independently manage multiple projects simultaneously all with deadlines that must be adhered too.Proven proficiency at an advanced level in all MS Windows and Office applications, including Visio.Ability to work under pressure and with strict deadlines.Demonstrates flexibility and willingness to adapt to changing work conditions.The position requires two years of analytics and reporting, or related work experience, preferably in a materials management, operations or group purchasing environment, which has demonstrated strong analytical and organizational skills, or the equivalent. The position is responsible for planning efficient and accurate procedures, schedules, and systems to accomplish information and data base information management functions in support of the activities and programs of the department.The position requires skills necessary to present technical and financial information to both small and large groups representing clinical, technical and administrative leadership management.Preferred qualifications for this position include:Proven understanding of accounting principles, formula creation, and business mathematics and statistics.Demonstrated excellent skills in research, analysis and problem solving.Proven deep skills in business analytics, trend analysis and financial reporting; particularly the ability to translate data into meaningful and actionable information.Proven outstanding attention to detail with a focus on quality.A track record in quickly acquiring a good understanding of the organization, its business imperatives and reporting needs.A track record in organizing and planning with a proven ability to effectively manage time, multi-task, and achieve results in a fast paced environment with competing business priorities.Proven ability to work independently with minimal supervision, taking the initiative to solve problems while using discretion to escalate issues as needed.Demonstrated excellent verbal, interpersonal communication and negotiation skills including stakeholder management and conflict resolution.Demonstrated customer focus with a track record in building and maintaining regular communication and feedback channels.Demonstrated basic understanding of supply chain management business practices and functions.Proven ability to work collaboratively in a team environment in a positive and professional manner.Demonstrated ability to perform in alignment with company mission and values.Strong oral/written communications skills, ability to manage, set priorities and operate with minimal direct supervision.Strong presentation and public speaking abilities.Ability to work effectively with diverse workforce.About the department you will serve. Providence Strategic and Management Services provides a variety of functional and system support services for all eight regions of Providence Health & Services from Alaska to California. We are focused on supporting our Mission by delivering a robust foundation of services and sharing of specialized expertise. We offer a full comprehensive range of benefits - see our website for details http://www.providenceiscalling.jobs/rewards-benefits/ Our Mission As people of Providence, we reveal God's love for all, especially the poor and vulnerable, through our compassionate service. About Us Providence Health & Services is the third largest not-for-profit health system in the United States. Providence employs more than 82,000 caregivers (employees) across a five-state area; AK, WA, MT, OR, and CA. Our facilities include 34 hospitals, 600 physician clinics, senior services, supportive housing and other health and educational services. Providence is proud to be an Equal Opportunity Employer. Providence does not discriminate on the basis of race, color, gender, disability, veteran, military status, religion, age, creed, national origin, sexual identity or expression, sexual orientation, marital status, genetic information, or any other basis prohibited by local, state, or federal law. Schedule: Full-time Shift: Day Job Category: Supply Chain Location: Washington-Renton Req ID: 184138"}