{"jobID": "2725462862", "jobLocation": "Cambridge_MA", "jobTitle": "Data Scientist-Innovation", "companyRating": "3.0", "companyInfo": {"Headquarters": "Saint Paul, MN", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Subsidiary or Business Segment", "Industry": " Manufacturing", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "143000", "jobDescription": " Data Scientist-Innovation  05-Apr-2018  03-Aug-2018 Responsibilities The Lilly Innovation Center in Cambridge, Massachusetts allows Lilly to explore how next generation therapeutic ecosystems, connected solutions, and data analytics can improve patient health while reducing the clinical, psychosocial and economic burden that is systemic throughout healthcare today. Our team in Cambridge shares a passion for challenging conventional wisdom and creating an environment that embraces prioritizing high-risk, breakthrough concepts. The center provides a start-up environment with large company support. We are located in the core of Massachusetts exploding science and technology cluster, walking distance to some of the best academic and industry innovators in the world. The center has been designed to cultivate collaborative drug, device and technology research across all of Lilly’s therapeutic areas.  We are seeking an entrepreneurially-minded Data Scientist to help drive creative new therapeutic solutions by analyzing large, complex sets of streaming and metadata, applying machine learning and predictive models to develop novel algorithms, acting as a key liaison with strategic IOT partners, supporting clinical trial planning, data collection, and analysis, and providing consultation and analysis for patient- and outcomes-centered product feature development. You will be at the forefront of Lilly’s digital health initiatives, and will interact and collaborate with a diverse pool of talent both in Cambridge and at Lilly’s headquarters in Indianapolis, IN. .Responsibilities of this role include:Contribute to the development of next generation clinical treatment and decision systems through analysis and integration of large datasets from system apps (sensors, wearables), digital biomarkers, open/closed loops, patient outcomes, data registries, claims databases etc., thereby increasing compliance and adherence through patient-centric treatment and decision toolsUse creativity and resourceful application of computational statistics, data mining, and big data capabilities to address the challenges of using statistics in a business setting, such as incomplete data, biased data, large data sets, low signal-to-noise ratios, high variance and multiple objective functionsWork closely with a diverse team of scientists, engineers, clinicians, statisticians, and IT professionals to identify, evaluate, design, and implement statistical analyses and data exploration/visualization of internal and external, structured, and unstructured data.Build and share trusted reports and dashboards that transform complicated problems into simple, tractable ones.Manage multiple projects and exercise good triage and judgement skills.Seek and identify new opportunities for portfolio expansion, including, for example, identifying appropriate wearables for portfolio support in the diabetes, neurodegenerative and pain, oncology, autoimmune therapeutic areas.Establish and leverage strategic relationships with academia and start-ups to accelerate and access emerging innovationReq ID40463BRAdditional Skills/PreferencesStrong working knowledge of Python, R, and/or MATLABExperience with programming languages such as Java, C, or C++Experience working with Tableau or similar reporting/data visualization toolExperience in using machine learning and predictive modeling techniques in an industrial or commercial settingFamiliarity with analytical techniques such as distribution fitting, multivariate statistics, stochastic modeling, time-series modeling, design of experiments, Monte Carlo methods, robust statistics, sampling, segmentation, clustering, hypothesis testing, regression, and forecastingStrong interpersonal skills and the ability to work productively in an interdisciplinary team environment.Effective technical writing skills as well as good verbal communication / presentation skillsExperience with big data technologies like Hadoop, HDFS, Spark, Pig, HBase, etc.Experience working with Amazon’s AWS big data services like EMR, Redshift, S3, or EC2Familiarity with longitudinal clinical data, electronic medical records, or other healthcare dataPrevious medical device / pharmaceutical design / development experienceAdditional InformationLocation: Cambridge, MA.Travel is part of job, usually 10-15% but up to ~30% of time. Must be able to travel within US and OUS.Lilly is an EEO/Affirmative Action Employer and does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status.Title Data Scientist-Innovation Job Category Science Basic QualificationsBachelor’s degree in Computer Science, Data Science, Statistics, or Engineering preferred, with 7+ years of relevant professional experience OR Master’s degree in Computer Science, Data Science, Statistics, Engineering preferred with 5+ years relevant professional years of experience.Qualified candidates must be legally authorized to be employed in the United States. Lilly does not anticipate providing sponsorship for employment visa status (e.g., H-1B or TN status) for this employment position.Company Overview At Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our 39,000 employees around the world work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We’re looking for people who are determined to make life better for people around the world. City Cambridge CountryUSAState / Province Massachusetts Region North America "}