{"jobID": "2688902889", "jobLocation": "San_Francisco_CA", "jobTitle": "Lead NLP Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.twilio.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2008", "Type": " Company - Public (TWLO) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "173000", "jobDescription": " The Twilio platform enables companies to integrate communications directly into their applications via simple cloud API’s and with on-demand global reach. Twilio is therefore challenged with abstracting away a world of complexity so that our customers can go global without concern for managing a global communications network, carrier integrations and relationships throughout the world. About the job: As the Lead NLP Data Scientist, you will lead Data Scientists on the team through research and implementation of NLP models and algorithms that power our Twilio Understand product line. You'll work in a collaborative environment where your team can pursue ambitious research, and work on problems that haven’t been solved before. Your will work closely with engineering to enable millions of interactions for top Twilio consumer and enterprise customers. You'll see the work of your team directly improve customer experiences on every product that is built on the Understand platform. You will be key to NLP developments at Twilio.  This role will involve: Lead a team that advances research projects in NLP, machine learning and related fields to create highly innovative developer products and customer experiences.Develop and manage the vision and portfolio of research initiatives for your team.Manage the design, development and evaluation of highly innovative, scalable models and algorithms.Lead experienced data scientists as well as develop junior members from academia/industry to a successful career track in applied data science;Work closely with product and software engineering teams to manage the integration of successful models and algorithms in complex, real-time production systems at very large scale.Requirements:PhD in Natural Language Processing, Computational Linguistics or similar10+ years of Natural Language Processing experience in one or more of the following areas: intent classification, named entity recognition, normalization, text summarization, semantic search, word/paragraph/document embedding, ranking, ontology-aware IR, question-answering systems and dialog management.Experience working on modern deep learning approaches to NLP (NN, CNN, LSTM, BiDir-LSTM): word/paragraph embedding, representation learning, text/sentiment classification (e.g. SVM), and lexical, syntactic, semantic and referential disambiguation5 years of people management / leadership experience with a track-record of hiring and developing research teams.Experience with server architectures, distributed systems and filesystemsAbout us:Twilio is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal opportunity regardless of race, color, ancestry, religion, gender, gender identity, parental or pregnancy status, national origin, sexual orientation, age, citizenship, marital status, disability, or Veteran status and operate in compliance with the San Francisco Fair Chance Ordinance."}