{"jobID": "2771191459", "jobLocation": "Seattle_WA", "jobTitle": "Data Analyst", "companyRating": "2.9", "companyInfo": {"Website": "www.highereducation.com", "Headquarters": "Houston, TX", "Size": "51 to 200 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "48000", "jobDescription": " HigherEducation.com is the market leader in driving high-intent prospective online students for colleges and universities in the U.S. Core to our capabilities is the ability to manage and develop education-specific websites with content to capture organic traffic. With the continued growth of our content marketing operations, we want to further develop the way we capture, analyze, and apply our data to our content-marketing strategies. We are looking for a passionate self-starter who loves the challenge of solving problems and has experience building tools and reporting dashboards that deliver actionable insights. RESPONSIBLITESLeverage complex data sets to generate useful conclusions and actionable recommendations that will drive effective content, marketing, and operational strategies.Plan, design, implement, and manage deployment of reports in Tableau.Understand our business objectives, determine key performance indicators, and analyze and explain changes to those KPIs.Develop theories and create data informed solutions that uncover opportunities.In the absence of complete information, find creative solutions for a variety of challenges facing our growing data requirements.Translate complex analytical work into easily digested analysis and recommendations for various teams.QUALIFICATIONSBusiness analytics experience with concrete examples of ramping up quickly and making an impact.Technical experience working with Excel, SQL, and BI tools (QlikView, Tableau, etc.)You are a resourceful problem-solver with a willingness and determination to hunt and find the why and what if answers.You have the ability to drive forward with goals independently, work to see your ideas put into practice, and are able to multitask and prioritize competing projects and timelines quickly and efficiently in an environment with changing priorities.You can easily understand and work toward big-picture goals while delivering short-term wins.Superior organizational skills, both mentally and in outputs.Bachelors degree in Statistics, Analytics, Economics, Data Science or comparable."}