{"jobID": "2707961582", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist - Search", "companyRating": "3.1", "companyInfo": {"Website": "www.ancestry.com", "Headquarters": "Lehi, UT", "Size": "1001 to 5000 employees", "Founded": " 1985", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "165000", "jobDescription": " Job DescriptionAncestry helps people to find their ancestors and discover their family history. The Search Relevance team builds the matching engine of Ancestry’s core product. As a Data Scientist, you will be part of a global data science team. You will help our users to find their ancestors and discover interesting family history events. You will utilize cutting edge machine learning algorithms and statistical analysis techniques to improve our mobile and web search system. Responsibilities: Ranking algorithms for search accuracy and recallMachine Learning for index optimization and improvementsData pipeline for feature/label extraction and generationFeature engineering for people, family, records, photos and moreNLP for query and document analysis, processing and understanding at a large scaleRanking result evaluation and analysis Qualifications3+ years of experience as a Data Scientist, Data Engineer, Relevance EngineerMS or PhD in Computer Science, Electrical Engineering, Mathematics or related fieldResearch experience in a relevant field, such as information retrieval, machine learning, NLP or recommendation systemsSolid modeling skills in Python or RSolid understanding of core CS algorithms and good coding skills in Python or JavaExperience with Big Data, such as Hadoop/Hbase/Pig/HiveExperience with Solr/Elasticsearch is a plusExperience with Spark is a plusExcellent interpersonal and communication skillsProven track record of achieving significant engineering or academic results Additional Information Helping people discover their story is at the heart of ours. Ancestry is the largest provider of family history and personal DNA testing, harnessing a powerful combination of information, science and technology to help people discover their family history and stories that were never possible before. Ancestry’s suite of products includes: AncestryDNA, AncestryProGenealogists, Fold3, Newspapers.com, Find a Grave, Archives.com, and Rootsweb.  We offer excellent benefits and a competitive compensation package. For additional information, regarding our benefits and career information, please visit our website at http://ancestry.com/careers.  Ancestry is not accepting unsolicited assistance from search firms for this employment opportunity. All resumes submitted by search firms to any employee at Ancestry via-email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Ancestry. No fee will be paid in the event the candidate is hired by Ancestry.com as a result of the referral or through other means.  IND2  #LI-POSTJob Location"}