{"jobID": "2685814077", "jobLocation": "Seattle_WA", "jobTitle": "Senior Data Scientist - Industry", "companyRating": "2.8", "companyInfo": {"Website": "www.zulily.com", "Headquarters": "Seattle, WA", "Size": "1001 to 5000 employees", "Founded": " 2009", "Type": " Subsidiary or Business Segment", "Industry": " Retail", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Starbucks, Amazon, Target"}, "estimatedSalary": "136000", "jobDescription": " As a Data Scientist at zulily you’ll use statistical and machine learning techniques to better understand how customers engage with zulily’s web and mobile e-commerce platforms, and use that information to better allocate resources across zulily, from recommender systems informing the e-commerce site, to acquisition and lifecycle marketing processes, to operations. You’ll work with key stakeholders to crisply define business questions, success criteria, and deployment plans. You’ll use reproducible research techniques to create analytical data sets, conduct exploratory data analysis, select and engineer features, train, tune, and evaluate candidate models, distill and present findings, and create cloud-ready production and reference implementations. What you will own, manage, and be accountable for:• Develops accurate models for prediction and inference• Constructs analytic data sets for both exploration and modeling• Develops reproducible information products and modular, instrumented software • Works with stakeholders to define business questions, success criteria, and model deployment plans. Checks in regularly with stakeholders during projects• Conducts exploratory data analysis and prepares visualizations summarizing key features of the data• Researches and adapts existing open source algorithms when possible, develops novel techniques when needed• Provides guidance to software development engineers on production implementations • Develops program plans and road maps for Data ScienceMinimum Education Level: Master’s Degree; Required Concentration: Statistics / Ops. Research / CSYears of Equivalent Experience: 4 – 6 years working with real data sets in a for-profit, business setting. Ability to distill and present complex concepts to a business audience Scoping and managing medium to large sized projects Experience with different algorithm families and experience selecting, applying, and measuring model performance in a for-profit settingStrong background working with machine learning and optimization techniques in a for-profit settingProven history working of data integration with SQL, as well as within a statistical programming language such as R or Python in a for-profit settingUnderstands and practices the application of best practices in reproducible research and software engineeringStrong expertise in all phases of the modeling pipeline on both desktop and distributed/cloud platforms in a for-profit settingStrong working knowledge of classical statistics and knowledge of design of experimentsExperience with Spatial & Temporal StatisticsDemonstrated Exploratory Analysis and Visualization abilities in a for-profit settingSolid experience at the Linux command line and with shell scriptingExperience automating applications in a distributed / parallel environmentHighly desirable candidates will offer:PhD - Preferred Concentration: Data Science / Analytics"}