{"jobID": "2607344246", "jobLocation": "Palo_Alto_CA", "jobTitle": "Caregiver / Home Health Aide", "companyRating": null, "companyInfo": {"Website": "www.goldenvalleyhomecare.com", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Golden Valley Home Care provides in-home respite care to developmentally disabled (i.e Autism and Down Syndrome) children and adults in Santa Clara County (San Jose/Silicon Valley, CA). We are looking for compassionate, dedicated, and experienced healthcare professionals in the Santa Clara County area to join our team! If you are a caregiver who would like to provide one-on-one care for a developmentally disabled child or adult in his or her home, this job is for you.  We have immediate caregiving opportunities with our clients in the Santa Clara County surrounding areas: Santa Clara, San Jose, Los Gatos, Campbell, Sunnyvale, Mountain View, Fremont, Cupertino and Palo Alto!  Apply to be considered for an in-person interview! Summary: We are looking for a committed individual who has great communication skills and the ability to quickly problem-solve. Our Caregivers will perform non-medical companion homecare for clients who, due to developmental disabilities, need supervision. Caregivers also may work flexible schedules of their choice. Our shifts are available Monday through Sunday ranging from 4-12 hours long. These shifts can occur during the morning, day or evenings. Whether you are looking to gain more caregiving experience or simply enjoy working with developmentally disabled children or adults, discover how working at Golden Valley Home Care can change your life, along with your clients’ lives, forever!  Our Caregivers provide a wide range of non-medical services to ensure clients overall wellness which includes, either companion care or personal care for some certain clients.  Caregiver Responsibilities: Arrive at assigned shift on time and properly clock-in via our telephony system.Appropriately report any changes to client’s mental/physical health or home environment immediatelyMaintain proper documentation pertaining to client health and follow specific instructions pertaining to client health and other duties assignedComply with rules and regulations pertaining to client health information, specifically HIPAA’s policies and proceduresAdhere to all policies and procedures of Golden Valley Home CareRepresent Golden Valley Home Care to your the highest standardsPromote positive, supportive, and respectful communication to client/family and GVHC staff Requirements/Qualifications: Professional caregiving experienceProfessional caregiving referencesProfessional appearance and demeanorTwo forms of ID compliant with I-9 requirements (ex. driver’s license, passport, social security card, etc.)Cleared criminal background We Care For You! Competitive payFlexible scheduling to fit your lifestyle with full-time and part-time availabilitySupportive staff and management to help you achieve your career goalsShort commute times – we try to match you to opportunities near your homePaid Mileage Caregiver Recognition/Benefits: Employee recognition awardsEmployee appreciation month (win cash prizes, free food, gift cards)Incentives for good performance (gift cards, movie tickets, caregiver of the month) Keywords: Healthcare, Home care, CNA, HHA, Homemaker, Caregiver, Private Duty Aide, Home Health Aide, Home Health Assistant, Nurse’s Aide, Nursing aide, Certified Nurse’s Aide, Nursing Student, Nurse Extern, PCT, Patient Care Tech, PCA, Patient Care Aide, Personal care aide, Companion, home care assistant, homecare aide, healthcare assistant, Private Duty Homecare, Healthcare, Certified, HHA, aide, aid Healthcare, Home Health Aide, Certified nursing assistant, Nursing Student, Nurse Extern, Home Health, Aide, certified nursing aide, CNA job, Certified Nursing Assistant Job, HHA Job, Santa Clara, San Jose, Los Gatos, Campbell, Sunnyvale, Mountain View, Palo Alto"}