{"jobID": "2737990167", "jobLocation": "San_Rafael_CA", "jobTitle": "Senior Level Trusts and Estates Attorney", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Thompson Welch Soroko & Gilbert LLP, a boutique law firm with offices in San Rafael and San Francisco, seeks a sophisticated estate planning/trust administration attorney with 8-10 years experience and partnership aspirations.Our firm is particularly accomplished in the areas of estate planning & administration, corporate and business transactions, real estate transactions, tax, and litigation related to these practices. Our estate planning practice includes work with ultra-high net worth clients.The successful candidate will have strong credentials, experience with a mid-to-large size firm or trusts & estates boutique, and the skills and motivation to develop a thriving practice. He or she will share our firm values of collegiality and excellence, and appreciate our emphasis on work-life balance and professional growth.Competitive salary and benefits package. Ample free parking and main office is a short walk from the San Rafael Civic Center Smart Train station.ESSENTIAL DUTIES AND RESPONSIBILITIES:Confer with clients to identify their objectives and concerns;Evaluate client situations to identify strategies and apply a comprehensive understanding of planning and administration techniques;Counsel clients about possible strategies to reach objectives;Draft estate plans and trust administration documents (sometimes basic, sometimes advanced) to implement strategies;Work well with attorneys in other practice areas and with firm support to leverage team-wide capacity and maximize efficiency;Cultivate relationships with firm’s existing clients; andOriginate new clients.REQUIREMENTS: J.D. from ABA approved school;Active License with the State Bar of California;An LLM in tax or estate planning, preferred; and8-10 years experience in estate planning, probate and trust administration.Please respond by email with cover letter and resume. Two writing samples will be required for consideration. Thank you, and we look forward to hearing from you."}