{"jobID": "2809886682", "jobLocation": "Menlo_Park_CA", "jobTitle": "Business Data Analyst ll", "companyRating": "3.1", "companyInfo": {"Website": "www.milestonepowered.com", "Headquarters": "Fremont, CA", "Size": "501 to 1000 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " World Wide Technology, Accenture, Taos"}, "estimatedSalary": "80000", "jobDescription": " Overview  Milestone is looking for passionate and motivated professionals who go above and beyond to solve the world's biggest problems through innovation and technology. Our vision is to revolutionize the way technology is deployed and supported worldwide.  Global Security Strategic Initiatives (GSSI) develops global programs that optimize processes, mitigate risk, and drive results to support the mission of the company and the advancement of the Global Security organization.  Do you naturally look for the story and have a knack for translating that story into one that non-analytical minds can grasp and rally behind? As the GSSI Strategic Business Partnerships (SBP) Business Data Analyst II, you will report to the SBP Lead and be responsible for leading the data analytics strategy for SBP. The GSSI SBP Team is looking for an experienced analyst that loves data, analytics and systems, and has a passion for answering difficult business questions with data-driven decision making. The successful applicant will be creative and a logical thinker who likes to answer complex questions through rigorous analyses, and has the ability to tell a synthesized, easy-to-follow data story. Responsibilities Drive data analytic projects from initial ask through metric/score definition, testing, development, deployment, support, and further iteration.Establish analytical framework for your team: define measurement approach, quantify and evaluate success, and develop KPIs and guide tracking efforts for ongoing measurement and reporting.Analyze data to assess opportunities and improve alignment of activities to organizational business drivers, goals, and objectives.Act as the key data steward in the build out of SBP's direction at an international level. The individual will also partner closely with key stakeholders to provide regular, robust reporting and analytics.Operate independently in a fast-changing environment and with multiple teams relying on you.Generate reporting, ad hoc analysis and create data visualizations to support leadership decision-making.Continually improve and automate existing methods for parsing data and incorporating into real-time models, analysis, and actions.Create platform(s) and tools for the organization to leverage.Coordinate data analytics requests from SBP and work with the data engineering team to implement them as appropriate.Communicate insights to the business partners- emphasizing clarity, completeness, and action ability. Qualifications 3-5 years experience in data analytics or management consulting.Education: Bachelor's degree in Statistics, Math, Engineering, Computer Science, Economics, Business and/or 5+ years of work experience in the field.Systems: Proficient in SQL (Oracle, Hive, MySQL), Tableau (or other BI tools), MS Excel, Python/R or other scripting languages is a plus.  Hard SkillsNinja-like data analysis skills: you are a strategic thinker and have the ability to ask the right questions to elicit the true data needs. You understand how to most effectively support business leaders with critical decision-making analyses and recommendations.Bold builder: you are innately curious and have a strong desire to add new tools to your \"tool belt \"you're innovative, creative and constantly looking for opportunities to tweak and optimize by learning new tools quickly.Startup mental: you have the ability to simplify and structure complex and ambiguous problems and manage multiple simultaneous objectives in a fast paced and changing environment.  Soft SkillsSelf-starter attitude: you boldly pursue your work and love the responsibility of being personally empowered.Excellent communication: you possess strong interpersonal skills so you can interact collaboratively and productively with diverse teams across the organization. You build relationships to help drive adoption of data-driven decision making.Strong business acumen: you understand biz drivers and have a data framework-driven process of analyzing biz problems and developing solutions."}