{"jobID": "2687564308", "jobLocation": "Cambridge_MA", "jobTitle": "Sr. Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.sanofi.com", "Headquarters": "Paris, France", "Size": "10000+ employees", "Founded": " 1973", "Type": " Company - Public (SNY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Pfizer, GlaxoSmithKline"}, "estimatedSalary": "131000", "jobDescription": "About Sanofi Sanofi, a global healthcare leader, discovers, develops and distributes therapeutic solutions focused on patients' needs. Sanofi is organized into five global business units: Diabetes and Cardiovascular, General Medicines and Emerging Markets, Sanofi Genzyme, Sanofi Pasteur and Consumer Healthcare. Sanofi USAt Sanofi US, we are committed to the growth of our people, connected in purpose by career, life and health.Headquartered in Bridgewater, NJ, Sanofi US is part of a leading global healthcare company dedicated to discovering, developing and distributing therapeutic solutions focused on patients needs.Sanofi has core strengths in diabetes solutions, human vaccines, innovative drugs, consumer healthcare, emerging markets and Sanofi Genzyme.Sanofi US employs approximately 15,000 people across the country all dedicated to protecting health, enhancing life and responding to the hopes and potential healthcare needs of seven billion people around the world.Commitment is our Strength. Ready to grow together?Sanofi US endeavors to make our career center accessible to any and all users. If you are experiencing difficulty and need assistance applying online, please call 1-800-207-8049 Option 7, then Option 3. Sanofi US Services, Inc. and its U.S. affiliates are Equal Opportunity and Affirmative Action employers committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race; color; creed; religion; national origin; age; ancestry; nationality; marital, domestic partnership or civil union status; sex, gender, gender identity or expression; affectional or sexual orientation; disability; veteran or military status or liability for military status; domestic violence victim status; atypical cellular or blood trait; genetic information (including the refusal to submit to genetic testing) or any other characteristic protected by law.  Job Overview:  We are seeking a Sr. Data Scientist to help transform evidence-based pharmaceutical product development with Advanced Analytics in the Real World Evidence and Clinical Outcomes department at Sanofi. He/She will work closely with other disciplines across Sanofi including Biostatistics, Information Technology Systems and other Data Science partners to drive the use of novel analytics and data types to generate patient-centered evidence with impact across the Sanofi pipeline and business.  Examples of Advanced Analytics activities: Machine/Deep Learning to elucidate disease trajectories, patient subtypes, define underdiagnosed conditions, and unmet health needs.Create a framework for generating re-usable models and insights across big-data (e.g. EHRs, claims) and rich small data sets (e.g. clinical trials, imaging).Generating insights by merging diverse data streams e.g. health, surveillance, trend data, sensor, imaging,Adoption of emerging technology into an analytical framework: distributed analytics, graph databases Job Responsibilities: Expand the reach and help drive the development of a high-functioning organization through the development and deployment of cutting edge analytics and computational techniques applied to a wide range of data including structured and unstructured healthcare data sources, pre-clinical, clinical trial and complementary real world information streams.Provide operational support on multiple projects with a core role in providing expertise in machine learning, statistics, mathematics, modeling, simulation, text-mining/NLP, data-mining on real world data across Sanofi.Lead development and adoption of new computational and statistical methodologies for big data.Maintain internal and external profile through contributions to congresses, publications.Proactively engage RWE & CO colleagues, Sanofi technical and analytical partners, and Information Technology Services to identify, scope, and implement analytics approaches and solutions impacting a broad range of activities.Provide expertise by advising on team members or executing advanced analytics for solving problems across R&D;, Medical Affairs, HEVA and Market Access Strategies and Plans.Plan and deploy methodological standards, standardized processes, demos, and POCs for the companys highest priority business needs.Help drive the vision and further the development of Advanced Analytics capabilities in RWE & CO by participating in the broader Statistical, Machine Learning and Data Science communitiesContribute to the design, development, and implementation of Sanofis data science architecture and ecosystem to guide decision-making and building foundational capabilities. Essential Skills & Experience: PhD or ScD in quantitative field such as Medical Informatics, Applied Math, Engineering, Computer Science or related field with a minimum of 3 years of industry or academic experienceRelevant Masters Degree, with 6 or more years of related industry experienceProficiency in at least two or more technical or analytical languages (R, Python, etc..) and a willingness to embrace new coding approaches.Experience with advanced ML techniques (neural networks/deep learning, reinforcement learning, SVM, PCA, etc.).An ability to interact with a variety of large-scale data structures e.g. HDFS, SQL, noSQLExperience working across multiple environments (e.g. AWS, GCP, linux) for optimizing compute and big data handling requirements.Ability to prototype analyses and algorithms in high-level languages embracing reproducible and collaborative technology platforms (e.g. github, containers, jupyter notebooks)Exposure to NLP and dataviz capabilities preferred.Strong oral and written communication skillsA demonstrated ability to work and collaborate in a team environment Sanofi is dedicated to supporting people through their health challenges. We are a global biopharmaceutical company focused on human health. We prevent illness with vaccines, provide innovative treatments to fight pain and ease suffering. We stand by the few who suffer from rare diseases and the millions with long-term chronic conditions.  With more than 100,000 people in 100 countries, Sanofi is transforming scientific innovation into healthcare solutions around the globe.  Sanofi, Empowering Life"}