{"jobID": "2819025759", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist - Product Operations and Advanced Analytics", "companyRating": "3.6", "companyInfo": {"Website": "www.gap.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1969", "Type": " Company - Public", "Industry": " Retail", "Revenue": " $10+ billion (USD) per year", "Competitors": " Inditex, H&M, American Eagle Outfitters"}, "estimatedSalary": "146000", "jobDescription": " The ProductOperations Advanced Analytics Team drives business benefits for Gap Inc. andits brands by applying industrial engineering/management science,statistical analysis and analytics to improve inventory and revenuemanagement.  Theteam's primary focus is creating analytical methodology for all tools andprocesses in product operations in Gap Inc. Areas of expertise include:demand planning, inventory replenishment, inventory and supply chainoptimization, pricing, flexible inventory and supply chain initiatives. ESSENTIAL DUTIES&RESPONSIBILITIES;:Providequantitative research, modeling, analysis and support for identifying businessopportunities/issues and form hypothesesSynthesize findings, prepare presentations and assist inpresenting findings to all levels of managementCreate revenue, inventory, price optimization modelsProvide assistance needed to implement the recommendationsIdentify and track the metrics to measure the success of aspecific business opportunityManage projects or part of larger initiatives, including modeling,analysis, etcREQUIREDQUALIFICATIONSKnowledge, Skills&Abilities;:Provenability to develop and apply analytic solutions to solve business problemsAbility towork both at a detail level as well as to summarize findings and extrapolateknowledge to make strong recommendations for changeExperiencedeveloping short and long term visions for solutions that have significantbusiness impactDemonstratedexamples of working with business partners to deliver a solution that metobjectivesKnowledgeof inventory management, merchandising, pricing, supply chain management andoptimization principles and conceptsExperiencedeveloping and working with inventory optimization, pricing and forecastingapproaches for retail software or the retail industryAbility tocollaborate with cross-functional teams and work independently with minimalsupervisionMinimum Educational Level:PhD in Operations Research, Industrial Engineering or ManagementScience requiredMinimum Experience:5+ yrs. of professional experienceHands-onexperience with data analysis, statistical, optimization and simulationpackages (SQL, MATLAB, SAS etc) is mustInventorymanagement, pricing experience is highly desirableExperienceworking for retailers, consulting to retailers is highly desirableAbility tocommunicate effectively with cross-functional teamsExperiencedat working with business process owners to understand the process impact Apply"}