{"jobID": "2775507075", "jobLocation": "San_Francisco_CA", "jobTitle": "Treatment Coordinator", "companyRating": "3.2", "companyInfo": {"Website": "gentledental.catsone.com", "Headquarters": "Inglewood, CA", "Size": "1001 to 5000 employees", "Founded": " 1978", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Willamette Dental Group, Pacific Dental Services, Western Dental Services"}, "estimatedSalary": "42000", "jobDescription": " At Gentle Dental, our Treatment Coordinators manage patients full cycle from clinical diagnosis to treatment acceptance. You will successfully communicate financial planning and available options based on the proposed treatment. From the first appointment to the last, our Treatment Coordinators lead patients to a happy and healthy smile! This location is open 6 days a week. Some Saturdays will be required. Duties & Responsibilities:Discuss treatment options, establish treatment schedules, and prepare financial arrangements with patients.Monitor each patients progress to ensure completion of a dental treatment plan and report patient status to attending doctor as well as enter and track patient treatment plans in the computer system.Be knowledgeable in various insurance plans, manuals, exclusions, and limitations.Ensure that all forms for acceptance (predeterminations to third parties benefit providers) have been submitted and patients have been notified of status and their financial responsibilities.Manage consultation reports and progress.The ability to complete all tasks and duties assigned to front office personnel.Actively participate as a contributing member of the office staff team to achieve patient satisfaction and office production goals.Perform other duties as assigned.Qualifications:A minimum of 2 to 5 years front office experience in a medical environment.Must have excellent verbal and written communication skills.Bilingual Spanish preferred.Computer literate a must (QSI experience is a plus).Specialties experience is a plus. We aim to provide our network of affiliated doctors and staff with a competitive benefits package, which include: medical, dental, vision, life insurance, 401K plan, PTO, CE credits, and career opportunities to advance with the company. Gentle Dental has the resources you need to achieve true personal and career success."}