{"jobID": "2820973344", "jobLocation": "Brooklyn_NY", "jobTitle": "HVAC Technician", "companyRating": null, "companyInfo": {"Website": "www.alpinems.com", "Headquarters": "Doylestown, PA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Construction, Repair & Maintenance", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Looking for steady work, stable company, team atmosphere and great benefits? Alpine Mechanical Services, LLC is a nationally recognized, self-performing leader in commercial and retail HVAC preventative maintenance, energy efficiency, and repair services in 12 states across the East Coast. Alpine currently has over 4,000 individual customer locations under contract and more than 12,000 HVAC units for our customers and we continue to grow and expand every year. Our management team is comprised of HVAC experts with more than 75 combined years of industry experience and our team of technicians range from recent graduates to senior technicians, some of whom have been with Alpine for over 15 years.  At Alpine we understand that choosing who you work for isn’t just about the job itself but also about having a rewarding work experience. We have a strong commitment to integrity, transparency and doing the right thing for our employees and that includes providing our team with the Best Benefit Package Including:Paid Health Insurance, Dental Insurance, Prescription Coverage and Discount Vision Plan Starting Day 1 for EmployeesPaid Short Term and Long Term Disability, Life Insurance and AD&D; InsuranceHighly Competitive Salaries and Annual Raises401K Plan with Annual Match3 Weeks Paid Time Off in your first year with increases at future anniversariesPaid Holidays Off and Your Birthday Off with PayPaid For Trainings and Continuing EducationReferral ProgramRelocation ProgramWeekly Payroll with Direct DepositSmart Phone and Company UniformsCompany Vehicle, Fuel Card and ToolsAlpine is currently seeking an HVAC TECHNICIAN in Brooklyn, NY area.  This position is responsible for the service, maintain, troubleshoot and clean various heating cooling and ventilation units including but not limited to roof top units and EMS within the retail/commercial setting.  Position Requirements: Minimum 3-5 years’ experience in the service and repair of commercial or residential HVAC equipment.Valid driver’s license. Become a part of our dynamic team and APPLY TODAY and make the move to choice career with Alpine Mechanical Services! Apply by visiting http://alpinems.applicantstack.com/x/apply/a2hq2a3sv5vy "}