{"jobID": "2830915235", "jobLocation": "Oakland_CA", "jobTitle": "Transportation Analyst Intern", "companyRating": "4.2", "companyInfo": {"Website": "www.camsys.com", "Headquarters": "Cambridge, MA", "Size": "201 to 500 employees", "Founded": " 1972", "Type": " Company - Private", "Industry": " Transportation & Logistics", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "80000", "jobDescription": " Position Description  Cambridge Systematics, Inc. is shaping the future of transportation. We are industry leaders, transportation specialists dedicated to ensuring that transportation investments can deliver the best possible results. By providing innovative policy and planning solutions, objective analyses and technology applications, we help our clients anticipate and meet future transportation needs while improving the performance of existing infrastructure and operations. Above all, we are committed to our clients success in making transportation better for future generations.  Transportation Operations specializes in the development of strategies and application of technologies to improve transportation system performance, including highways, transit, and freight; at the national, state, regional and corridor levels. We are a recognized leader in Intelligent Transportation Systems (ITS) and Operations policy, planning and program development; are developing operations data business plans and performance measurement strategies for many transportation agencies; and, continue to develop some of the nations leading ITS planning and evaluation analysis tools and simulation models. Also, we conduct important federal research in the areas of Operations data, analytics and planning. We help our clients make the most of the available resources to optimize the operation of their transportation systems.  We are looking for a Transportation Analyst Intern to join our team in Oakland this fall. This is an exciting opportunity to gain experience in transportation planning activities in a consulting environment. The Intern will have the opportunity to work with transportation data and a variety of other tools in support of various projects. Additionally, s/he will have the opportunity to attend client meetings, workshops and provide support for client presentations.  EOE AA M/F/VET/DISABILITY  Position Requirements  Masters degree in Engineering, Transportation Planning, or related field required  Enrolled in PhD program desired  Knowledge of the freight transportation industry  Excellent written and verbal communication skills"}