{"jobID": "2828478178", "jobLocation": "San_Jose_CA", "jobTitle": "Sales Representative", "companyRating": null, "companyInfo": {"Website": "www.jti.com", "Headquarters": "Geneva, Switzerland", "Size": "10000+ employees", "Founded": " 1999", "Type": " Subsidiary or Business Segment", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable", "Competitors": " Imperial Tobacco, British American Tobacco, Philip Morris International"}, "estimatedSalary": null, "jobDescription": " JTI is a leading international tobacco company with operations in more than 120 countries. We’re the global owner of world-renowned brands such as Winston, the number two cigarette brand in the world, and Camel (outside the US). Our global brands also include Mevius, LD and Natural American Spirit, and we manufacture the internationally recognized Logic e-cigarette brand and Ploom Tech, a major brand in the heated tobacco category. Within the US, we only market and sell the following key brands: Wave, Export 'A', LD and WINGS.   Headquartered in Geneva, Switzerland, we employ over 27 000 people across the globe. We were recently awarded Global Top Employer for the third consecutive year and number one Top Employer certification in Europe, Asia and the Middle East. This is recognition of our outstanding talent strategy, energizing culture and commitment to learning and development.    We are a member of the Japan Tobacco Group of Companies. For more information visit www.jti.com. Position Purpose    JTI USA is presently seeking a Sales Representative to become a member of our Sales team, to help support the overall strategy of the organization in San Jose, CA. The bulk of the area includes Hayward, Fremont, Newark, Milpitas and surrounding areas and may require overnight travel. This position offers advancement opportunity.     MUST RESIDE IN SAN JOSE OR BE WILLING TO RELOCATE TO THE AREA.ResponsibilitiesStimulate market growth throughout prospecting, cold calling, and networking within the retail market to include – Convenience stores, “Mom & Pop\" retailers, Independent Accounts, Wholesalers, and Distributors. Conduct professional presentations to prospective and existing customers within a geographically defined territory.Ensure optimal visibility of company productsConsultative account management of new and existing client base   Qualifications & ExperienceAssociate Degree and/or Bachelor’s Degree or 1-3 years of sales experienceExperience in selling to retailers, Wholesalers and Distributors in the Consumer Products industry is preferred.Excellent proficiency in Microsoft Office (Word, Excel, Outlook).Excellent verbal and written communication skills.Strong organizational and planning skills.Self-starter with demonstrated strong work ethic.Clear driving record   Benefits: Enjoy a competitive salary commensurate with the experience and responsibility requirements.  Excellent employee environment with a competitive benefits package including: Bonus Annual Merit Increase Company Vehicle Healthcare Dental Paid Time Off 401k Plan + Company Contributions Life Insurance DisabilityTuition Assistance"}