{"jobID": "2700625773", "jobLocation": "New_York_NY", "jobTitle": "Strategist- Pharma Brand Insights", "companyRating": null, "companyInfo": {"Website": "www.hallandpartners.com", "Headquarters": "London, United Kingdom", "Size": "201 to 500 employees", "Founded": " 1991", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Kelton, Ipsos, Millward Brown"}, "estimatedSalary": null, "jobDescription": "Who we are We help our clients build brand relationships that matter, that are commercially and emotionally rewarding. We do this by understanding people and closing the relationship gap between businesses and people.  Our positioning is as a strategic brand consultancy, powered by data and insight. We work with some of the world’s biggest companies shaping their brand relationships for them. We do this through disciplined strategic thinking. This then acts as a driving force to extract hidden insights from further research investigation and data analytics. Role We have an exciting opportunity for a Strategist to join our team. Strategists have executive support on each account and have line management responsibility for our talented Senior Analysts. Alongside day to day management of your accounts, you’ll play an active role in developing new business for your existing clients. You will also be expected to be actively involved in pitch teams, managing the creation of proposals and pitch presentations.  We love to experiment in our approach and delivery, and we’re looking for someone who is energized by this. We are looking for someone who embraces change and is hungry to grow their skills in line with the business strategy. Experience (or at least a keen interest) in blended research approaches (e.g. qual, quant, mobile, social) is a must.  You’ll be working across a portfolio of accounts so you’ll need to be proactive and have excellent organizational skills to respond to a wide range of client needs.  We are open to a variety of backgrounds including strategists, planners, researchers and marketers. Core responsibilities Manage positive client relationships day to day and contribute to strategic problem solving against client’s business challenges, powered by research and data.  Embrace our digital transformation in a local office or business area driving our new way of working through the Hub.  Identify new business opportunities, particularly with current client accounts and proactively builds client relationships.  Line manage and coach team members in their day to day work, helping them to grow their skills and ensure high quality, on time work.  Incorporate new ways of working, technologies and methodologies across client accounts including the Hub, Adapt, Social Reading and Annalect, Tempo, Rapid, Living Lens.  Lead the design and planning of presentations and pitches, identifying the insight story and telling it in clear and inspiring way.  Demonstrate expert key research skills and ensure the quality of the work being done by the team.  Show a passion for the digital media landscape and integrate digital in solutions proposed to clients. Oversee analysis of social listening and other digital data sources; understand use and role of cultural tools including semiotics, cultural reads.  Stay up to date and can talk knowledgably about developments in our industry and beyond, identifying and sharing new ways of doing things.  Work collaboratively with the PM to implement efficiencies and increase automation on accounts. Key attributes 4+ years of experience in blended research healthcare/pharma approaches (e.g. qual, quant, mobile, social listening) is a must. Courageous. Proactive, gets involved and makes decisions when needed. Creative. Demonstrates a love of people and brands, steps outside the ordinary to surprise and delight clients. A problem solver, thinking pragmatically to make the complex simple. Curious. Shows a hunger to learn, innovating and experimenting at work. Embraces new ideas and ways of working. Collaborative. Great at working within team environments and getting stuff done together. Actively participates in company initiatives.  Knowledge of blended research methods. Strong expertise in more than one research area.  Shows a strong understanding of the evolving media and consumer landscape (e.g. digital channels), knowledgeable about how to use various types of data to answer business questions.  Strong management skills. Able to lead and prioritize to deliver outstanding quality on time and coach team members to do so.  Strong presentation and storytelling skills.  Highly motivated and driven, with a hunger to win and grow our business.  Able to travel occasionally as the job requires. What we offer you We believe we have a unique culture. It’s a difficult thing to put into words but it’s all about being challenging yet treating each other with respect. We are naturally curious and we love to learn and discover new things.  We nurture opinions and really respect people who have a point of view and aren’t afraid to share their thinking. We work as teams and responsibilities sit with everyone in that team, whatever their job title. A can-do attitude goes a long way in our business and we don't tolerate egos!  We are passionate about helping our people to learn, stretch and grow. We want this to be a place where people feel challenged, as well as guided and supported.  We have a Learn calendar packed with opportunities to attend interactive training sessions. From “OutsideIn” sessions with industry experts to “15 minutes of Fame” sessions with colleagues to share the amazing work we do, there are lots of ways to build your skills for the future. Benefits We want our people to feel rewarded for the great work they do. Here are some of the benefits we offer:  Comprehensive benefits program (including medical, dental and vision coverage)  401k program  Group life insurance  Generous vacation policy  Discretionary summer Friday bonus days  Employee Discount programs  To find out more about Hall & Partners click here to check us out online. Hall & Partners is an equal opportunity employer and are strongly committed to promoting equal opportunity. We maintain an Equal Opportunities, Diversity and Anti-Harassment Policy to inform, guide and encourage equal opportunities practices within the Company. We are also part of the Omnicom group and together we promote and embrace equality and diversity through a number of initiatives such as Omniwomen, ADCOLOR and Open Pride. You can read more about our commitment to do equality and diversity here: http://www.omnicomgroup.com/culture/diversity/"}