{"jobID": "2770194846", "jobLocation": "Billerica_MA", "jobTitle": "Software QA Engineer Intern", "companyRating": "3.3", "companyInfo": {"Website": "www.insulet.com", "Headquarters": "Billerica, MA", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Public (PODD) ", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "46000", "jobDescription": " Insulet Corporation, maker of the OmniPod, is the leader in tubeless insulin pump. Insulet is looking for a self-motivated Software Test Engineer to be a part of the testing effort related to product development and product modifications. The position is responsible for ensuring that software for on-market products has been effectively and efficiently verified and validated prior to its release and that these designs effectively meet their requirements. Software quality assurance efforts are lifecycle oriented, beginning during product requirements development and continuing throughout its lifetime.  This position will also be part of implementing software development tools to improve the overall quality of software, including peer reviews, software hazard analysis, requirements traceability, software code analysis/code coverage, defect tracking, software metrics, configuration management, software supplier quality, and software tool validations. Execute test plans, test designs and test cases.Automate testing as appropriate.Support Data Science group in the verification of automated reports.Work closely with the software development team to identify improvements.Influence the requirements definition and software design to maximize testability.Develop and maintain test database for automated validation test of software revisions.Oversee and influence development of test objects to meet needs of protocol.Develop and extend protocols and plans as device features evolve.Participate in product design reviews.Performs other duties as required.Minimum Requirements:Pursuing an undergraduate degree in Computer Science, Electrical and Computer Engineering, or a closely related field is required.Experience programming and testing software solutions.Preferred Skills and Competencies:Experience programming in C, C++ and scripting languages.Experience implementing automated software test tools is a plus.Software test group experience strongly preferredProficient using Word, Excel and Power Point.Strong written, verbal, interpersonal and presentation skills."}