{"jobID": "2804646590", "jobLocation": "Sunnyvale_CA", "jobTitle": "Physical Therapist / PT - Full Time", "companyRating": "2.9", "companyInfo": {"Website": "www.hcr-manorcare.com", "Headquarters": "Toledo, OH", "Size": "5001 to 10000 employees", "Founded": " 1991", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Kindred Healthcare, Genesis HealthCare, Sava Senior Care"}, "estimatedSalary": "47", "jobDescription": " HCR ManorCare the leading provider of short- and long-term medical and rehabilitation care is seeking a passionate and driven Physical Therapist - PT. If you are looking for a challenging and rewarding career assisting our patients in a time of need, then we are looking for YOU!  Our Physical Therapists are the cornerstone to HCR ManorCare's commitment to caring. Working in the health care environment can be very demanding, and it is our goal to provide the tools to help our Physical Therapists understand and commit to the philosophy that defines our culture. Our strength is not just quality of care, but also our quality of caring. We are interested in employing Physical Therapists who are as passionate as we are about ensuring that our patients and residents receive the care and support services they need and deserve. As a team member at HCR ManorCare your duties may include, but will not be limited to:Plan and administer prescribed physical therapy treatment program for patients to restore function, relieve pain, and prevent disability following illness, disease, or injury.Take patients medical history.Conduct tests and measure to identify potential and/or existing problems the patient is facing.Required to conduct re-examinations as needed.Develop discharge plans for the patient. 471 - ManorCare Health Services - Sunnyvale, CaliforniaPrior experience in Physical Therapy preferred, but not necessary.  Credentialed Graduate of an accredited Physical Therapy program, obtained a passing score on the National Physical Therapy Examination and currently licensed in applicable state where working."}