{"jobID": "2730903708", "jobLocation": "New_York_NY", "jobTitle": "Event Sponsorship Sales Executive", "companyRating": null, "companyInfo": {"Website": "www.alm.com", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " 1843", "Type": " Company - Private", "Industry": " Media", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OverviewABOUT THE TEAM: Sales professionals focused on providing our clients with opportunities to create a strong brands and win more new business by having the opportunity to: Speak and Exhibit at ALM’s Executive conferences and trade shows thought the US, Europe, Canada, South America, and Asia.Responsibilities Sell trade show booths, sponsorships, conference speaking and business development sponsorship opportunities.Sell sponsorships for multiple ALM EventsDevelop and close new business – Meet revenue goalOversee the sales process from initial contact through the event stageBuild solid business relationships with accountsCreate and maintain database of potential leads in SalesforceCreate and present creative sponsorship opportunities to meet client needsCoordinate paymentsProvide ongoing support during showsQualificationsMinimum of 3-5 years sales experience, event sales experience in legal a plus.Top-notch strategic and tactical selling talentEstablish list of client relationships with law firms and legal vendorsAbility to establish relationships at all levels of the organization including the most senior levelsEffective written, verbal and presentation skills essentialProactive, independent, tenacious and goal-orientedMust be highly proficient in Excel, Word, Salesforce and PowerPoint a big plusHigh energy and self-motivatedExcellent phone skills/presentation and the ability to develop relationshipsExcellent customer service skillsThe ability to work independently and as a teamA strong sales closing ability, the desire to succeed and a proven record of success is a must.Able to succeed in an energetic, fast-paced environmentDiscover where your talent fits best at ALM…At ALM, we’re reinventing the way professionals use information, news, data, marketing solutions and events to manage the business of business. That requires creativity, collaboration and innovation. Headquartered in New York City with 18 offices worldwide, ALM brands have been serving their markets since 1843. Join our team of talented ALMers working to create exceptional experience for our audiences and customers across the globe.ALM provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, veteran status, national origin, age, disability or genetics. In addition to federal law requirements, ALM complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training."}