{"jobID": "2805260116", "jobLocation": "Wakefield_MA", "jobTitle": "Software Development Intern", "companyRating": "3.0", "companyInfo": {"Website": "www.sdl.com", "Headquarters": "Maidenhead, United Kingdom", "Size": "1001 to 5000 employees", "Founded": " 1992", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " AMPLEXOR, TransPerfect, Lionbridge"}, "estimatedSalary": "38000", "jobDescription": "     Job Description SDL, the leader in global customer experience, is seeking a Software Engineer Intern in Wakefield, Mass. You will work side-by-side with our development team for approximately 15-20 hours per week in the Wakefield office in an agile/scrum environment. You will be involved in the troubleshooting and resolution of defects in the software. You will assist in working through a product backlog to deliver both new features and enhancements to existing software. You will assist in supporting various processes and aspects of systems related to software engineering, such as source control, documentation, testing, build scripts, etc.  About our Team  We work as a part of a global DevOps organization in the SDL Wakefield MA office. Our team includes product owners, developers, testers, UX specialists, and technical writers. We work in a collaborative environment and follow agile/lean software development processes. We develop three products related to content management.  SDL Contenta/Contenta S1000D – CSDB for S1000D and custom DTDs: Managing creation, management and delivery of technical documentation.SDL LiveContent S1000D - IETM (Interactive Electronic Technical Manual): Interactive and dynamic technical publication viewing engine that interactively renders structured content in real time to end usersSDL XPP - High-end Publishing Engine: Automates composition and pagination of XML data (and other data sources) and outputs PostScript, Adobe Acrobat PDF and ePub    Candidate Skills & Requirements Currently pursuing a Bachelor's degree in Computer Science or related technical field.  Good fundamental knowledge of computer science, algorithms, data structures, etc…  Good verbal and written communication.  Organized & detailed oriented.  Ability to creatively troubleshoot and solve programming problems.  Working knowledge of Java and/or HTML5/Javascript.  Knowledge of Oracle Database or MS SQL Database a plus.  Experience with XML, XSLT, DTD, XSD a plus.  Knowledge of GIT/Stash a plus."}