{"jobID": "2802905736", "jobLocation": "Boston_MA", "jobTitle": "Registered Nurse - Labor & Delivery Perinatal Float Pool - 36 Hours Nights with Every Other Weekend (SEIU)", "companyRating": "3.6", "companyInfo": {"Website": "www.bmc.org", "Headquarters": "Boston, MA", "Size": "1001 to 5000 employees", "Founded": " 1996", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "43", "jobDescription": " Registered Nurse  Labor & Delivery Perinatal Float Pool  Status: Full Time 36 Hours  Shift: Nights, With Every Other Weekend  Union: SEIU  The Registered Nurse adheres to the rules and regulations of the Massachusetts Board of Registration in Nursing and is primarily responsible for professional performance and direct patient care. The role encompasses nursing assessment, diagnosis, planning, intervention, evaluation, and coordination of care for patients and their families across the health care continuum. The registered nurse is accountable for clinical, educational, quality and fiscal patient care outcomes using the model of care designed by the nursing department and in accordance with established agency policies, procedures, protocols, guidelines and standards of practice.Minimum Qualifications:Graduate from an accredited Nursing Associates or Bachelors of Science degree program; BSN preferred.Recent RN experience in Labor & DeliveryLicensed to practice professional nursing as a registered nurse in the Commonwealth of Massachusetts.Current basic cardiac life support certification.Duties and Responsibilities: (these are a general summary and not all inclusive)Basic computer proficiency inclusive of ability to access, enter, and interpret computerized data/information.Effective interpersonal skills to facilitate communication with various members of the health care team, patients, and families.Organizational skills to set priorities and efficiently complete assigned work.Multilingual skills (beyond that of English) in languages appropriate to the patient populations served by the medical center preferred.Relevant clinical experience and/or specialty, certification required for certain practice areas, e.g., enterstomal therapy, epidemiology, peri-operative areas.Analytical ability to solve clinical nursing issues and conduct quality improvement research utilization projects.Organizational skills to set priorities and efficiently complete assigned work.Ability to effectively delegate appropriate patient care activity.An Equal Opportunity / Affirmative Action Employer. Females, minorities, veterans, and persons with disabilities are strongly encouraged to apply."}