{"jobID": "2755935581", "jobLocation": "Mountain_View_CA", "jobTitle": "Sales Operations Analyst - Proposal Desk", "companyRating": "3.8", "companyInfo": {"Website": "www.purestorage.com", "Headquarters": "Mountain View, CA", "Size": "1001 to 5000 employees", "Founded": " 2009", "Type": " Company - Public (PSTG) ", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " EMC, NetApp, 3PAR"}, "estimatedSalary": "98000", "jobDescription": "About Us Our ambitious goal of helping innovators build a better world with data started in 2009. Today, we are one of the fastest growing enterprise companies in history, surpassing $1B in revenue at the end of 2017.  The world is experiencing a technological revolution driven by AI, machine learning, virtual reality, quantum computing and self-driving cars -- all of which require large amounts of data and put Pures technology literally in the drivers seat. Our solutions deliver real-time, secure data to power mission-critical production, DevOps, and modern analytics in multi-cloud environments. With a Satmetrix NPS score in the top 1% of B2B companies worldwide, our customer-first culture and commitment to innovation create a thriving company that employees, customers, partners, and investors love. For more information on our business, check out the corporate fact sheet here. Sales Operations Team at Pure Puritans come from various backgrounds and we thrive off of challenging the norm. This cross pollination of backgrounds led to numerous ground breaking ideas and has helped us build one of the most reliable and easy to use storage systems in the industry. We strive to hire the best and brightest people, who excel in a cutting edge, fast paced, collaborative and transparent environment. We are seeking enthusiastic individuals to solve real world problems while having fun along the way.  The Sales Operations Analyst (SOA) will work directly with Sales Directors, Sales Operations and Sales insight to support our Pure Storage sales teams to provide timely and accurate analytics to help them manage the teams selling efforts. The SOA will assist the Sales Directors and sales reps in providing accurate forecasting, pipeline and results reporting. This is a fast-paced and constantly evolving sales environment that requires excellent communication skills, the ability to multi-task and work under and towards a deadline. The SOA will possess superb analytical skills and the ability to work as a team, not only with the Sales Directors but with their SOA colleagues. Work with extended teams and outside resources to ensure market analysis data. Previous experience in project management, RFP management and account management is strongly desired. What You Will Be DoingConduct post-deal analysis, research key issues and identify opportunities to improve sales efficiencies across a global sales organization.Identify, review, curate and manage key content ownership across a global team of subject matter experts to be used in active and future sales cycles.Work directly with sales directors to achieve sales goals by providing timely sales analytics including pipeline analysis, forecasting and sales results.Work directly with sales directors to identify problem areas and pain points within their organization, identifying stakeholders to solve and improve these pain points.Pro-actively identify issues and solutions to make business flow better for the sales teams. Works on problems of moderate to complex scope where analysis of situations or data requires a review of a variety of factors.Participate in weekly, quarterly and annual sales planning by preparing and supporting the delivery of specific sales coverage and forecasting analytics.Work with internal front and back office departments throughout each selling quarter to resolve open items and close deals ensuring all necessary paperwork is in place prior to deal closure.Support the end-of-quarter sales effort by assisting in driving all sales orders and approvals through intern processing.Assist sales team with needs related to processing through internal systems and processes (e.g. Salesforce.com).Assist sales team with deal structuring to ensure best value for the company while maximizing quota attainment.Work closely with other SOAs to share knowledge, best practices and facilitate standardization across the whole sales organization.Uses professional concepts; applies company policies and procedures to resolve a variety of issues.Exercises judgment within defined procedures and practices to determine appropriate action.Tracks and reports on account performance - measurement set by business units, sales and marketing.Plan and implement projects for account and territory selection in order to optimize the sales team for next year planning.What You Bring To The Team3 years experience in a Sales Operations, Finance or other analytical rolesBachelors degree in business or finance (completed or in process MBA preferred)Excellent analytical skillsStrong writing, editing, grammar and proofreading skillsExperience with SFDC applicationsDesktop Publishing Skills (Word, InDesign, Publisher)Excellent Excel skillsProject Management experience preferredExcellent communication skillsMust have a can do attitude and have an internal strong sense of urgencyMust be willing and able to work in an open office, team environment.No Storage? No Problem. We look for talent and culture first, specific technologies second, so once you decide Pure is the right place for you, we will match you with the right project to start with. Plus, we like people to have the ability to do different things and be constantly learning, so we encourage our engineers to move around to different teams and project across the company. Pure creates opportunities for your development and career growth. At Pure, we believe that each Puritan is a leader contributing to the success of our business, regardless of role. We offer an assortment of learning options available to all Puritans, including workshops on leadership, management, career development and more! Were here to change the world and we hope you join us! Popular Perks Pure offers an unlimited vacation policy, free lunches, meditation rooms, free yoga classes and employee resource groups, such as Pure Equality and Pure Vets, to encourage all of our employees to maintain mind and body wellness. We offer numerous volunteer opportunities for employees to give back not only to the Bay Area, but across the globe. Pure is Committed to Equality Pure is proud to be an equal opportunity and affirmative action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or any other characteristic legally protected by the laws of the jurisdiction in which you are being considered for hire. If you need assistance or an accommodation due to a disability, you may contact us at recruitingops@purestorage.com."}