{"jobID": "2661370462", "jobLocation": "San_Jose_CA", "jobTitle": "Supervisor at San Jose International Airport", "companyRating": null, "companyInfo": {"Website": "www.hudsongroup.com", "Headquarters": "Basel, Switzerland", "Size": "5001 to 10000 employees", "Founded": " 1987", "Type": " Company - Public", "Industry": " Retail", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Position: Supervisor Location: San José International Airport (Mineta)GROWWithUS!Hudson Group is North America's largest specialty travel retailer. For 30 years Hudson Group has led the way and prides itself in knowing what matters in travel retail. As airports and transportation terminals have evolved, so has Hudson Group, striving to bring sophistication and convenience to today's traveler.Job Summary:Supports the Operations Manager/ Assistant Manager and the General Manager to ensure that all store daily operating procedures are performed on a timely basis as required, while promoting a corporate image of excellence through a strong work ethic, leadership by example, and the consistent delivery of excellent customer service and store visual presentation. Maximizes sales through the development and supervision of sales associates. Job Responsibilities:Conducts store opening/closing/ shift change procedures.Provides staff training.Performs all cash register preparation, float verifications, spot checks, verification of end-of-shift cash reconciliation's, and deposits.Ensures that money is secured at all times and cash in excess of $500 is removed from the register for safekeeping.Ensures that daily counts on cigarettes, phone cards, newspapers, and other items as required are conducted consistently and that any discrepancies are reported immediately to the Operations Manager.Ensures that staff report to work on time, dressed in clean full uniform, including nametags.Ensures all sales associates are aware of daily sales targets.Ensures customers are greeted promptly and served by knowledgeable, well-trained associates.Demonstrates effective management of customer queuingEnsure telephones are answered in a consistent business-like manner and are used only for business-related purposes.Ensures that all staff tardiness and illnesses are reported to the Operations Manager.Ensures that sales associates are assigned daily duties and never congregate in the vicinity of the cash desk.Ensures that staff is aware of procedural changes and/or other latest memorandums.Has an in depth knowledge of products sold and ensures replenishment and proper rotation of stock on the sales floor.Ensures all damaged goods are returned to the warehouse properly tagged.Ensures that housekeeping standards are maintained (i.e. dusting, folding, replacement of burnt light bulbs, sweeping, mopping).Maintains an ever-vigilant theft and shoplifting awareness and enforces cash register and other policies controlling internal shrink. Working Relationship Consults and helps plan daily activities with Assistant Manager/Operations Manager and other Supervisors; manages the activities of staff.Provides supervision and support to store staff.Works with on-site jobbers and sales representatives.Knowledge, Skill and Ability:Leadership qualities, interactive, and approachable.Ability to work in a fast-paced environmentTime-management skills and multi-tasking abilities.Good problem-solving skills.Education and Experience:High School Diploma or equivalent.One or more years of retail experiencePrevious supervision experience preferredHudson Group is always on the lookout for top quality people who want to be a part of a winning retail team. With many stores and concepts across the country and throughout the world, we have the ability to help you find the job that is right for you. We recognize that our employees are a driving force behind our success! Our dedicated team enjoys an exciting and friendly environment! We invite you to learn more about our …Competitive Salaries,Medical, Dental & Vision Insurance,Company Paid Life Insurance,Paid Vacation,Paid Sick Time,Employee Recognition Programs,Advancement and Growth Opportunities,On-going Training & Development. Qualified candidates should submit their resume for immediate consideration.The job that’s right for you! Apply NowApply"}