{"jobID": "2818091072", "jobLocation": "Cambridge_MA", "jobTitle": "Data Scientist (Imaging) / Cheminformatician", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Job Description We are looking for a highly motivated data scientist / imaging expert who wants to advance drug discovery projects through innovative analytics in a cross-functional environment.  You will join the Chemical Biology and Therapeutics Informatics (CBTi) group at Novartis Institutes for Biochemical Research (NIBR). We are an interdisciplinary, global group of chem- and bioinformaticians, and data engineers, who together are brokers between data and the next wet-lab experiment.  Embedded in project teams, you will be answering the question of \"what compound to screen next\", which includes focused library design; readout quantification and hit call strategy; and virtual screening and SAR exploration.  In particular, you will develop and apply computational methods to analyze complex phenotypic readouts, such as imaging and time series data. Deep learning expertise in the imaging space is a plus! Key responsibilities include:Early drug discovery project in silico support a. Identify data analysis / in silico needs of early-stage drug discovery projects by working closely with biologists, chemists, and screening scientists  b. Execute on project needs effectively and efficiently by developing and leveraging reusable data analysis workflows, tailored to the needs of the project.  c. Communicate data-driven insights with clear recommendations on the next experiment. Innovation in computational methods for drug discovery a. Develop imaging and video analysis pipeline in the context of drug discovery projects.  b. Gain cross-project insights through state-of-the-art machine learning methods, such as deep learning.  c. Collaborate with external partners on state-of-the-art machine learning methods, in particular in the imaging space.  d. Apply and develop novel methods to organize and navigate institutional knowledge.  Employment Type  Regular"}