{"jobID": "2828319613", "jobLocation": "Milpitas_CA", "jobTitle": "System Engineering/Data Analytics Intern", "companyRating": "3.7", "companyInfo": {"Website": "www.kla-tencor.com", "Headquarters": "Milpitas, CA", "Size": "5001 to 10000 employees", "Founded": " 1976", "Type": " Company - Public (KLAC) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Applied Materials, Nanometrics"}, "estimatedSalary": "75000", "jobDescription": "COMPANY OVERVIEW Calling the adventurers ready to join a company that's pushing the limits of nanotechnology to keep the digital revolution rolling. At KLA-Tencor, we're making technology advancements that are bigger and tinier than the world has ever seen.  Who are we* We research, develop, and manufacture the world's most advanced inspection and measurement equipment for the semiconductor and nanoelectronics industries. We enable the digital age by pushing the boundaries of technology, creating tools capable of finding defects smaller than a wavelength of visible light. We create smarter processes so that technology leaders can manufacture high-performance chips the kind in that phone in your pocket, the tablet on your desk and nearly every electronic device you own faster and better. We're passionate about creating solutions that drive progress and help people do what wouldn't be possible without us. The future is calling. Will you answer* GROUP/DIVISION The Global Service Support Organization (GSS) team headquartered in Milpitas, CA is our service organization that consists of Service Sales and Marketing, Spares Supply Chain management, Field Operations, Product Training, and Technical Support. The GSS organization partners with our field teams and customers in all business sectors to maintain the high performance and productivity of our products through a flexible portfolio of services. Our comprehensive services include: proactive management of tools to identify and improve performance; expertise in optics, image processing and motion control with worldwide service engineers, 24/7 technical support teams and knowledge management systems; and an extensive parts network to ensure worldwide availability of parts. RESPONSIBILITIES This exciting position will enable you to interact with a wide variety of Engineers and KLA-Tencor System data, with a focus on delivering an improved user and customer experience across KLA-Tencor s global installed base of Systems. The intern will learn how to work with real-world data from industrial equipment, and how it can be used to improve the productivity and maintenance of those machines. The intern will learn how to work with engineers and future users to understand and document requirements for software and data analysis applications, to ensure that the final products will meet the user needs.  This project offers the opportunity to implement tools that will save users time and make more accurate and more proactive service decisions on equipment running in leading-edge semiconductor fabs. The intern will have the opportunity to work on both the implementation of their own work, as well as influence the framework for others to use in the future, and will have the opportunity to see the results of their work during the project timeframe. The work for this project could also potentially continue on a remote basis after the intern returns to campus. This position is responsible for:Working with software, hardware, product support, application and marketing groups to understand and document product requirementsWorking with statistical structures: JMP, OriginLab, Matlab; to derive a statistical decision making pointDesign, development and testing of data analysis and visualization applications in PythonDeveloping user training materialsWorking in a global environment to interact with multi-site team members (India, Singapore, Europe, Israel and USA)Traveling to customer sites on a needed basis for deployment / troubleshootingPREFERRED QUALIFICATIONSBasic Requirements:At least 3 years of College in a field such as Computer science, Data Science, Engineering, Physics or equivalent fieldGood understanding of software principles and constructsJMP, OriginLab, Matlab; to derive a statistical decision making pointDesign, development and testing of data analysis and visualization applications in PythonGood communication, interpersonal and team coordination skillsCreative thinker with good problem analysis and solving abilitiesGood understanding of data structures and algorithmsDesired:Coursework in Computer science, data mining, machine learning, data science, engineering (mechanical, electrical, systems), or physicsExperience in statistical analysis, automated data mining, pattern recognition, and or prediction modelingExperience in debugging softwareExperience in design and implementation of User Interfaces (desktop or web)Familiarity with encryption and security concepts and best practicesExperience building or maintaining / troubleshooting scientific instruments or other mechanical, electrical, and/or optical systemsMINIMUM QUALIFICATIONS At least 3 years of college EQUAL EMPLOYMENT OPPORTUNITY KLA-Tencor is an Equal Opportunity Employer. Applicants will be considered for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other characteristics protected by applicable law."}