{"jobID": "2796165759", "jobLocation": "El_Segundo_CA", "jobTitle": "Data Scientist", "companyRating": "2.8", "companyInfo": {"Website": "www.bluestembrands.com", "Headquarters": "Eden Prairie, MN", "Size": "1001 to 5000 employees", "Founded": " 2002", "Type": " Company - Public (BGRP) ", "Industry": " Retail", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Conn's, Walmart eCommerce, Amazon"}, "estimatedSalary": "132000", "jobDescription": "Data Scientist Bluestem Brands, Inc. is the parent company to 13 dynamic, eCommerce retail brands. We have one mission: to build a dynamic retail enterprise that wins with direct-to-consumer excellence and entrepreneurial-minded employees focused on serving our customers’ unique needs. Our leadership is responsive and supportive, empowering those smart and passionate employees who drive our success. We are continually innovating and improving: we take risks, learn from mistakes and celebrate success as a team.  You work hard, and you deserve more than just a paycheck. Bluestem works to do what’s right for employees. From the big things (great benefits, employee discounts and incentive plans) to small touches (jeans-every-day dress code), this is the place you’ll want to be. And we don’t just talk about work-life balance, we try to live it. Join the Bluestem Brands team to make an impact, be inspired and be valued, every day.  We are seeking an Data Scientist for Bluestem Brands to be located at our office in El Segundo, CA.  If you are interested in using your experience leveraging cutting-edge data science to inform smarter, faster decision making, this is your chance to get in on the ground floor and help Bluestem Group as a member of the Zenalytics Data Science and Machine Learning Lab. The Lab Team is tasked with leveraging the enormous amount of data we have available to us, to help answer some of the toughest questions in customer acquisition, marketing attribution, merchandising, recommendation engines, search optimization, pricing, credit adjudication and recoverability. The answers are in the data, it’s up to us to mine through the noise and find the true signal to gain insights and drive the business forward. What You'll Do:Develop machine learning models for predictive purposes.Validate models for roll-out and analyze the performance of existing models.Assess the usefulness of new data sources, transformations, and modeling techniques.Perform high quality, data driven statistical inference.Mine large datasets in multiple databases to draw patterns and inferences to build models and arm leaders with information that will help make business decisions.Create machine learning algorithms that drive innovation and add significant value at the enterprise level.What You'll Need:Advanced degree (MS or PhD) in data science, information science, machine learning, statistics, computer science, data mining, applied mathematics, physics, engineering, econometrics or other technology/quantitative/hard science program.Must have 2+ years of data science experienceExemplary programming skills in one or more of the following: Python, R, Spark, Scala, SQL, Matlab, or other analytical/mathematical/statistical programming environment.Commitment to creating reproducible and well-documented code.Hands on experience with information retrieval from high dimensional data, dimensionality reduction and feature extraction.eCommerce merchandising specific domain knowledge and/or experience in one or more of the following areas: search engine optimization, recommendation engines/recommender systems, pricing optimization, mixed marketing modeling and attribution, artificial intelligence for fashion.Deep knowledge of supervised and unsupervised model building techniques, especially machine learning methodologies, such as: collaborative filtering, deep learning, neural networks, extreme gradient boosting (XG Boost), support vector machines (SVM), gradient boosted models (GBM), multivariate adaptive regression splines (MARS), random forest, elastic nets, lasso, and ridge.Extensive experience in general data science techniques, such as: natural language processing (NLP), cross validation, bootstrapped resampling, bagging, boosting and ensemble techniques with both homogeneous and heterogeneous base learning algorithms.Ability to translate business goals to modeling approaches/methodologies and the ability to convey model results in a clear and convincing fashion to business leaders.Experience with Unix/Linux, is a plus.Experience with cloud computing, is a plus.Experience with distributed computing, is a plus.Experience with click stream data, is a plus. Job Grade: D1Required Skills Required Experience Job Location  El Segundo, US-CA "}