{"jobID": "2800181412", "jobLocation": "San_Francisco_CA", "jobTitle": "Business Development Manager", "companyRating": "3.3", "companyInfo": {"Website": "security.kastle.com", "Headquarters": "Falls Church, VA", "Size": "201 to 500 employees", "Founded": " 1972", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Datawatch, Genesis Securities, Tyco"}, "estimatedSalary": "93000", "jobDescription": " Kastle is the nation’s leading provider of Managed Security Services. Our customers depend on us every day and include the who’s who of commercial real estate, distinguished global retail brands, leading commercial enterprises and critical government facilities. We are committed to providing a ‘Wow’ customer experience and we continually invest in the next big ideas to shape and transform our industry. We are proud to say that our people are the industry’s best and we work hard to create a culture that provides a compelling career for talented individuals.  The primary objective of the Business Development Manager is to sell comprehensive security systems and services to the Company’s clients: local building owners, managers, tenants and developers. The Company, a well-established leader in the security industry, recognizes the challenges and complexity that its clients must overcome to successfully perform ongoing management of their security systems. The Company uniquely runs and manages security systems so its clients don’t have to face these challenges.  To be successful, the Business Development Manager must be cognizant of the dynamics within the market served and understand the client’s security requirements. The Business Development Manager will instill in the client a clear understanding of the Company’s value proposition and offer systems and services to meet the client’s needs. Identify and cultivate long-term business relationships with building owners, managers, tenants, and developers.Develop and plan account strategies that provide the greatest opportunity to make sales.Design security systems that meet the client’s needs.Write proposals, conduct presentations, and demonstrate Company systems and services.Generate sales that meet or exceed established goals.Maintain an ongoing sales journal that accurately summarizes the status of outstanding proposals.Participate in scheduled sales meetings.Amplify collective sales opportunities by introducing decision-makers and key client contacts to colleagues and managers.Identify, research, analyze, and communicate competitive sales strategies.Participate in key industry associations and events to increase awareness of the Company’s brand and favorably position the Company to targeted clients within the community.Demonstrate enthusiasm, initiative, teamwork, and professionalism.All other duties as assignedBachelor’s DegreeMinimum 8 years sales experience preferredDemonstrated outstanding sales skills to commercial clients at the executive level.Working knowledge and understanding of the commercial real estate market or commercial construction a plus.Demonstrated track record of closing sales of complex systems or services with protracted sales cycles.Outstanding written, verbal and presentation skills.Experience with sales force automation systems such as Sugar is a plus.Demonstrated ability to work with little direct supervision.Excellent personal computer skills including a working knowledge of word processing, spread sheet, contract management, and e-mail programs.Ability to work well under pressure.Ability to perform a physical survey of commercial premises such as construction sites, parking garages, office building public spaces, tenant spaces and roofs.Neat, professional appearance.Must be willing to participate in and pass the company’s pre-employment screening process including a background investigation, drug screening and driving record.Must continue to maintain a safe driving record and valid driver’s license to fulfill the travel requirements of this position.Must be able to meet and continue to meet state licensing requirements for security.Must be able to meet client background and suitability screening when required to access client’s data and/or site.Must be eligible to work in the U.S. and at least 18 years old. These physical demands are representative of the physical requirements necessary for an employee to successfully perform the essential functions of the job. Reasonable accommodation can be made to enable people with disabilities to perform the described essential functions of the job.  While performing the duties of this role, the employee is required to talk, and hear. The employee is often required to sit and use their hands and fingers, to handle or feel and manipulate keys on a keyboard. The employee is often required to stand, walk, and reach with arms and hands. Vision abilities required by this job include close vision, and the ability to adjust focus. The employee must be physically and mentally capable of functioning effectively with moderate to high levels of stress in a demanding and dynamic environment. Employee must be able to concentrate for extended periods of time and consistently produce organized thoughts and execute sound judgment. Some travel by automobile, plane and other modes of public transportation may be required.  The following work environment characteristics are representative of the environment the employee will encounter while performing the duties of his/her job; The employee is subject to prevailing weather conditions at the time,The noise level in the office environment is usually quiet to moderateThe employee may be exposed to moving mechanical parts, tools and vehicles Reasonable accommodation may be made to enable people with disabilities to perform the essential functions of the job.  *All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, color, religion, sex, sexual orientation, national origin, age, disability, or protected veteran status or any other characteristic protected by federal or applicable state laws. Kastle Systems takes affirmative action in support of its policy and to advance in employment individuals who are minorities, women, protected veterans, and individuals with disabilities.  #CB"}