{"jobID": "2831273264", "jobLocation": "Austin_TX", "jobTitle": "Attorney with 2-7 years of privacy and data security experience - Texas", "companyRating": null, "companyInfo": {"Website": "www.bcg-search.com", "Headquarters": "Pasadena, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Toggle navigation Associate Resources Attorney Career AdviceAssociate Q&A;Attorney Job Offer Evaluation and Negotiation ResourcesDiversity, Family, and Labor Issues for AttorneysEstablishing and Protecting Your ReputationGeneral Career AdviceLateral TransfersLegal Contract Work ResourcesLegal MentorsNetworking Tips for AttorneysPerformance Reviews for AttorneysResources for Foreign AttorneysSalary Resources for AttorneysSenior Attorney Resource CenterStaying Employed as an AttorneyThriving Within a FirmWork-Life Balance and Self-Reflection for AttorneysWorking with a Legal RecruiterAttorney Career ChoicesAlternative Careers for AttorneysCareer Planning and GoalsChoosing a Legal RecruiterChoosing a Small or Large Law FirmGovernment Employment for AttorneysIn-House Employment Resources for AttorneysLegal Career Advice and OptionsAttorney Career Transition ResourcesBar Exam ResourcesGeographic Guides and Profiles for AttorneysGetting Laid Off as an AttorneyGiving Notice for AttorneysLLM Resource CenterRelocation Resources for AttorneysUnemployment Resources for AttorneysAttorney Job Search ResourcesLegal Writing Sample ResourcesTiming Your Legal Job SearchAttorney Resume and Cover Letter ResourcesCover Letter Resources for AttorneysProfessional Reference Resources for AttorneysResume Resources for AttorneysInterview Resources for AttorneysDressing for Interviews with Legal EmployersGeneral Interview Resources for AttorneysPost Interview Resources for AttorneysLaw Firm ResearchLaw Firms and Firm CultureResearching Law FirmsLegal Practice Area ResourcesChanging Legal Practice AreasChoosing a Legal Practice AreaGeneral Legal Practice Area ResourcesPatent Attorney and Patent Agent ResourcesMoving Up as an AttorneyAdvice on Moving Up as an AttorneyMaking Partner at a Law FirmResources for Attorneys Practicing LawGeneral Resources for Attorneys Practicing LawState of the Legal MarketState of the Legal Market ReportsEmployer Resources Bringing in New AttorneysAttracting Legal TalentGrowing a Law FirmHiring Decisions for Law FirmsLaw Firm ManagementDiversity and InclusionLaw Firm Management ResourcesLaw Firm Profits and SustainabilityLaw Firm StructureLaw Firm Practice Groups and SpecialtiesLegal Employer Resource CenterGeneral Legal Employer Resource CenterLegal RecruitingAbout BCG Attorney SearchUtilizing Legal RecruitersLaw Students Resources Law Student Career AdviceLaw School GradesLaw Student Q&A;Law Student Job ResourcesConsiderations for Legal Interns and Summer AssociatesJob Application Resources for Law StudentsLaw Student Job Search ResourcesThe Legal Job MarketRecent Law Graduate ResourcesPartner Resources Getting Legal BusinessGetting Legal BusinessPartner Business Plan ResourcesGeneral Partner Business Plan ResourcesPartner Job Search ResourcesPartner Employment ResourcesHarrison's Perspectives Career Advice for AttorneysCase StudiesLLM ResourceLaw Firm Culture&Economics;Law, Society&Culture;Legal Job Search&Interview; TipsNetworking&Business; DevelopmentRelocations&Practice; Area ChangesSpecific Practice AreasThe Winning MindsetUtilizing Legal RecruitersDiversity Resources Attorney Diversity ResourcesGeneral Attorney Diversity ResourcesHelpful Diversity ResourcesLaw Firm DiversityGender, Age, and Racial Diversity and InclusionLaw Firm Work-Life BalanceWork-Life Balance ResourcesBrowse Jobs law firm reviews Case Studies Testimonials Searches  Job section intro  Physics Attorney Job in Texas , Austin  Welcome to the jobs section of the BCG Attorney Search Web site. We are constantly updating our jobs seven days a week. As a firm dedicated to research, our ability to forge strong relationships with law firms allows us to offer our candidates a breadth of opportunities that we believe is unrivaled anywhere. Legal RecruiterAttorney Jobs Patent Litigation Attorney with 2-3 years of physics experience  Back to Attorney Job Search results JOB REFERENCE NUMBERDZ3M133412LOCATION Texas - Austin  Submit Resume  Austin office of our client seeks patent litigation attorney with 2-3 years of experience. The candidate should preferably have engineering, physics or computer science background.  Excellent academic credentials, verbal, written and interpersonal skills and technical background is needed.  This large firm is well known for its expertise in representing growing high-tech companies in all stages of their development, and it has offices in technology centers around the globe. It has been involved in a large number of IPO's as well as many M&A; transactions. A full range of legal services are provided to the firm's clients, and it has attorneys that practice litigation, intellectual property, tax, employment and other types of law. The workload at this firm can be intense at times, but attorneys still have time to pursue their interests outside of work. 2018-02-06 18:06:24 Houston  2500 Citywest Blvd Ste 300  Houston,Texas 77042  Phone(713) 270-1199 | Fax (832) 550-2558  Email Jobs@bcgsearch.com  BCG Attorney Search Reviews Houston  Submit Resume  Permalink Email Colleague  Share on FB Share on Twitter  Email a Colleague Printable Version Permalink  Share of Facebook Share of Twitter  Contact us about this Job  Houston  2500 Citywest Blvd Ste 300  Houston,Texas 77042Phone (713) 270-1199 | Fax (832) 550-2558  Email Jobs@bcgsearch.com"}