{"jobID": "2759738699", "jobLocation": "Cupertino_CA", "jobTitle": "Financial Service Representative II -", "companyRating": "3.3", "companyInfo": {"Website": "www.keypointcu.com", "Headquarters": "Santa Clara, CA", "Size": "51 to 200 employees", "Founded": " 1979", "Type": " Nonprofit Organization", "Industry": " Finance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "41000", "jobDescription": "Job Summary: The Financial Service Representative II is expected to support growth and retention efforts by acquiring new relationships by displaying a high level of knowledge of KPCU products and building relationships with members that result in repeat and referral business, primarily within our Member Companies and exisiting membership. Consistently deliver a high level of service with a consultative approach earning high marks in net promoter scores while assisting members in transaction processing, loans and new accounts. Adheres to the service oath and service expectations, promotes advocacy and continually focuses on delivery of a personable member experience. Follow established compliance processes and procedures. Support growth objectives by representing the Credit Union and developing long term relationships at KeyPoint sponsored business and community events.  The FSR II is expected to have a high level of professionalism and knowledge to assist members in complex inquiries that include residential, consumer loan inquiries and booking, Retirement, Fiduciary Accounts and referrals to the Wealth Management and Commercial Banking Divisions. The FSR II is to expected to attend on sites at Member Companies and contribute to the growth within and act as a role model to co-workers by cross-training team members and recommending process improvements to the Branch Manager that contribute towards overall organizational improvements. Responsibilities:SalesMember ServiceOperational IntegrityBusiness and Community DevelopmentPhysical Requirements: The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. (Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.)  While performing the duties of this job, the employee is frequently required to stand; walk; sit; use hands to finger, handles or feel; reach with hands and arms, climb or balance; talk and hear. The employee must occasionally lift and/or move up to 10 lbs. Vision abilities required by this job include close vision, distance vision and color vision, peripheral vision, depth perception and ability to adjust focus. High School Diploma or equivalent.2 years experience in related disciplines, including exposure to members/customer services cash handling, procedures, loans, primarily residential, business services, Fiduciary Account Administration and operations, in a credit union or other financial institution.KeyPoint Internal Applicants Only: 6 months experience with KeyPoint Credit UnionMust be capable of working established hours required by the branch.Mandarin Speaker preferred"}