{"jobID": "2792447489", "jobLocation": "Sunnyvale_CA", "jobTitle": "Co-Op ASIC/VLSI Engineer", "companyRating": null, "companyInfo": {"Website": "www.infinera.com", "Headquarters": "Sunnyvale, CA", "Size": "1001 to 5000 employees", "Founded": " 2001", "Type": " Company - Public (INFN) ", "Industry": " Telecommunications", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Ciena"}, "estimatedSalary": null, "jobDescription": "Your Key Responsibilities Would Include: Candidate will be part of ASIC group that develops high bandwidth multi-billion transistor ASICs using 7nm and 16nm FinFET process technologies, which will form the core of Infinera’s next-generation platforms. The ASICs implement complex algorithms in DSP, FEC domains, as well as industry standard and proprietary data- & tele-communications protocols. ASICs incorporate high-performance embedded processors, 56+G interfaces. Projects leverage industry-leading EDA tool-suites, and end-to-end ASIC development methodology from concept to volume production.  Candidate shall get exposed to all facets of semiconductor development including Architecture, Design, Verification, Physical Design, CAD, Emulation, Lab validation, System integration & test. Candidate will get opportunity to work independently on critical building blocks under the guidance of highly experienced professionals. Candidates will also get opportunity to develop presentation and communication skills, and engage across the global ASIC sites, as well as Cross-functional groups such as Hardware, Firmware, Software/SDK. Education & Experience Necessary For Success: · Relevant course work in EE / CS departments  o VLSI Design, Communication Theory, Data Networking, Semiconductors, Programming and scripting languages, Operating Systems, Microprocessors, Computer Architecture  · Exposure to RTL/Synthesis based ASIC design methodology and tools  · Working knowledge in script/programming languages such as Python, Perl, TCL, C/C++, Matlab/Mathematica  · Excellent communication skills and ability to work in collaborative team environment Infinera is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, age, status as a protected veteran, or status as a qualified individual with disability. EEO Employer/Vet/Disabled."}