{"jobID": "2705070604", "jobLocation": "Los_Angeles_CA", "jobTitle": "Senior Data Analyst (LA)", "companyRating": "4.3", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "117000", "jobDescription": "About Uber We’re changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now we’re a part of the logistical fabric of more than 600 cities around the world. Whether it’s a ride, a sandwich, or a package, we use technology to give people what they want, when they want it.  For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer.  And that’s just what we’re doing today. We’re thinking about the future, too. With teams working on autonomous trucking and self-driving cars, we’re in for the long haul. We’re reimagining how people and things move from one place to the next.  Uber is looking for sharp, highly motivated individuals to join our US & Canada Rides Central Operations team. If you love setting a vision, managing cross-functional stakeholders, pushing projects forward to deliver measurable and strategically meaningful results, and solving problems from both 30,000 feet as well as deep in the details, this is the role for you.  As one of the world’s fastest growing companies, we’re generating vast amounts of data in every day. We use this data to inform everything we do: ensure balance in the marketplace, identify ways to continually make the Uber experience better for drivers and riders, deploy incentives and promotions, understand customer behavior, develop and launch new product offerings, and more.  Senior Central Operations Managers are responsible for developing functional business strategies, such as how we balance our marketplace, target and deploy customer promotions, and identify operational weaknesses. They balance improving or innovating new processes with setting and delivering on core goals to meet business needs. What You’ll DoBe a critical, strategic leader on the US & Canada Central Operations team. This team is focused on solving the hardest problems impacting the customer experience and the overall business at a centralized levelMake strategic decisions to prioritize within functional area; guide and set goals for the overall teamCoach others - directly or indirectly - on strategic thinking & prioritizationDevelop analytical frameworks to support the company in business decision-makingIdentify operational weaknesses and help improve or innovate new processesBuild, maintain, communicate, and present detailed reporting at city, regional, and mega-regional levelsPresent models, findings and insights to senior management to drive business decisionsCollaborate with local and other Central Operations teams, as well as marketing, product and other central functions, to ensure that insights inform broader strategic initiativesThis role demands excellent stakeholder and project management skills, as well as the ability to both plan and execute projects of varying time horizons and scope with minimal guidanceThe Central Operations team owns functional business strategies, and your team will be responsible for monitoring, correcting, and executing business processes in functional areasTeam focus areas include:ComplianceBusiness StandardsSafety OperationsDriver Fares StrategyAirports StrategyRider AnalyticsVehicle SolutionsDriver RelationshipPOOLWhat You’ll Need6+ years experience of investment banking / consulting / business intelligence / strategy or related experience; some high-growth operations or startup experience is strongly preferred.Exceptional communication and organization skills.Clear communicatorStrong, demonstrated leadership capabilitiesA “driver” personality - biased toward action, great collaborator and master disambiguator/simplifier - constantly pushing toward clarity and delivery.Exceptional Excel / data management skills.Self-motivated, works independently and possesses strong organization and time management skillsBachelor's degree requiredSQL Proficiency strongly preferred"}