{"jobID": "2645521376", "jobLocation": "San_Francisco_CA", "jobTitle": "Naval Reactors Engineer", "companyRating": null, "companyInfo": {"Website": "www.navy.com", "Headquarters": "San Diego, CA", "Size": "1001 to 5000 employees", "Founded": " 1775", "Type": " Government", "Industry": " Government", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " \"About this jobNaval Reactors Engineers are Officers responsible for researching, designing, maintaining, operating and regulating the nearly 100 nuclear reactors and power plants that drive the most advanced Fleet of submarines and aircraft carriers on earth. Its a challenging role serving a critical function, and one of the most highly respected positions available in Americas Navy.From its location at the Navy Yard in Washington, D.C., Naval Reactors (NR) has cradle-to-grave responsibility for all shipboard nuclear power plants, shore-based prototypes, and nuclear propulsion support facilities for Americas Navy. The wide array of technical areas involved in the Naval Nuclear Propulsion program include: Reactor and fluid systems design Reactor physics Materials development Component design such as steam generators, pumps and valves Instrumentation and control of reactor, steam and electric plants Testing and quality control Shielding Chemistry and radiological controlsAs a Naval Reactors Engineer, you will typically be in charge of several projects at once. Taking the lead in anything from designing nuclear reactors to developing refueling procedures to decommissioning of nuclear propulsion plants.Preliminary training and eventual staff assignments center around the NR headquarters in D.C. The process will take you from earning a post-graduate level education in academic settings to training on prototype units.Even junior level Nuclear Reactors Engineers assume responsibility for key technical work in a variety of state-of-the-art facilities, including: Two Department of Energy laboratories Two nuclear prototype/training sites Nearly 100 nuclear-powered ships and submarines Six shipyards More than 1,000 firms that support the Naval Reactors ProgramUpon graduation from college, the formal training process of becoming an Officer in the Naval Nuclear Propulsion program is officially underway. For those pursuing a Naval Reactors Engineer position, the first step is Officer Development School (ODS) a 5-week course in Newport, R.I., that provides a comprehensive and intense introduction to the responsibilities of being a Navy Staff Corps Officer.Upon completion of ODS, newly commissioned Officers move on to receive the advanced training that is at the core of Navy Nuclear Propulsion. First comes four to five months of preliminary training at Naval Reactors Headquarters in Washington, D.C. This is followed by approximately two weeks spent gaining a working background at one of the Navys land-based prototypes in either Charleston, S.C., or Albany, N.Y.The next step is Naval Reactors Training Program (NRTP), a 6-month postgraduate-level education in nuclear engineering. This is provided through the Bettis Reactor Engineering School at the Bettis Atomic Power Laboratory in Pittsburgh, Pa.Following Naval Reactors Training, Naval Reactors Engineers are then assigned a Nuclear Engineer position with the group responsible for managing all technical aspects of the Naval Nuclear Propulsion program planning, approving and confirming the design, operation and maintenance of nearly 100 nuclear reactors. Engineers start in a junior role under a supervisor and rapidly advance to take on increasing responsibilities.\""}