{"jobID": "2689361159", "jobLocation": "Campbell_CA", "jobTitle": "Private Client Investment Consultant- Cupertino, Ca", "companyRating": null, "companyInfo": {"Website": "www.tdameritrade.com", "Headquarters": "Omaha, NE", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (AMTD) ", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Fidelity Investments, E*TRADE Financial, Charles Schwab"}, "estimatedSalary": null, "jobDescription": "Proactively contact, manage and develop an assigned, existing high net worth/ affluent client relationship practice. Primary goals are to deepen relationships, retain assets, drive cross-sell and asset consolidation opportunities. Our Private Client Investment Consultant (PCIC) associates follow a consultative dialogue approach to better understand each clients goals, needs, objectives, investment preferences and desired level of involvement for investing / managing their portfolio. Successful candidates will be able to deliver high-value and a personalized client experience by creating awareness of needs and matching them with relevant services, platforms, education, products and offerings that help drive loyalty, retention and improved overall satisfaction. PCIC associates will need to be able to leverage planning and analytical tools to present high value solutions across a wide spectrum of client needs and preferences, spanning self-directed to full delegator investor types.  Responsible for growing an assigned practice of affluent clients through identifying value added products, services and solutions. Identify and consolidate client assets held outside of TD Ameritrade and develop additional business through client referrals Provide clients with a stronger bias for guidance with more frequent portfolio consultations, goal planning recommendations and introduction to specialized income teams dealing with annuities and fixed income solutions Build and solidify client relationships pre and post retirement through a distinctive experience that leverages TD Ameritrades unique value proposition Ability to partner within and across the organization to extend meaningful client value and overall service experience as measured through current company evaluation metrics Adheres to all compliance/risk procedures, follows corporate and industry protocols and acts in a manner which protects the interests of the client and TD Ameritrade at all times Demonstrates proficiency in learning/utilization of the Salesforce contact management system, Money Guide Pro. Microsoft office suite and other internal systems. Is committed to the integrity and accuracy of all client information and data Outstanding communication and problem solving skills. Has strong / deep understanding and ability to deliver client value in the areas of self-directed investor tools, research and trader offerings. Deep industry knowledge of managed money solutions and financial planning concepts Ability to master TD Ameritrades guidance offerings and policies with expert level skills to provide periodic portfolio consultations Strong track record in generating sales and a broad background in retirement products, general investment matters and applicable tax and estate planning issues Demonstrated experience with consultative sales techniques and experience in diagnosing affluent client financial situations and personal circumstances in order to propose appropriate solutions that secure client confidence and expanded business Excellent interpersonal skills, phone sales skills and face-to-face relationship building abilities Excellent organizational skills and experience leveraging technology to improve efficiencies and effectiveness in role Comfortable working in a matrix reporting structure and consider/balance the needs of multiple stake holders Previous experience with financial/goal planning software and planning concepts preferred. Minimum of 5-8 years of demonstrated advisory, client management and sales experience providing complex financial planning services for high net worth ($750k+ ) clients Life insurance licenses and CRPC® or CFP® designations required Health insurance licenses preferred (obtaining these licenses will be a requirement within 60 days of hire) FINRA Series 7, 66 (or equivalents) 4 year college degree preferred Military education or experience may be considered in lieu of civilian requirements listed"}