{"jobID": "2815120815", "jobLocation": "Seattle_WA", "jobTitle": "Sr. Data Analyst/Business Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.liveperson.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1995", "Type": " Company - Public (LPSN) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Oracle, Salesforce, 24/7 Real Media"}, "estimatedSalary": "82000", "jobDescription": " LivePerson makes life easier by transforming how people communicate with brands. Our 18,000 customers, including leading brands like Citibank, HSBC, Orange, and The Home Depot, use our conversational commerce solutions to orchestrate humans and AI, at scale, and create a convenient, deeply personal relationship a conversational relationship with their millions of consumers. This is a brand new role and will be part of our Data and Science team under LivePerson's Chief Scientist. In this role, The Data Analyst will develop analysis that will allow researchers and business owners to make smarter, data-driven decisions. This is a chance to work closely with and learn from cutting-edge researchers in various fields of Machine Learning, including Natural Language Processing and Understanding. To be successful in this position, you must be highly motivated, execute under pressure and stay focused on the details. You should have the desire to grow your technical analytical skills in order to move the business forward towards automated reporting. Here at Liveperson, we have some of our principles that we live by when it comes to designing and delivering the most strategic programs that are tied to company results. We must be experts. We start from the intent. We obsess over the customers. We are decisive. We are data-driven. We learn from mistakes. We maintain high standards. During your tenure at LivePerson you will become an expert in the following and much more: * Collect data and perform advanced modeling and statistical analysis * Map, document and recommend process improvements * Assist in communications with internal and external customers to understand business requirements * Determine efficient utilization of resources * Actively engage with internal partners throughout the organization to meet and exceed customer service levels & transport-related KPI's. * Research and implement cost reduction opportunities * Revise and maintain ongoing analysis for research teams and business partners * Ad hoc data retrieval and analysis using SQL, Excel and other data management systems. * Supporting cross-functional teams on the day-to-day execution of projects and initiatives. * Manage multiple priorities and handle with urgency. We are looking for an expert with experience in: * BA/BS in Computer Science, Statistics, Mathematics, Engineering or other quantitative field. * 5+ years of experience in quantitative analysis, combined with strong business judgment and an ability to present analysis in a clear and compelling manner * Proficient in implementing various statistical models and data mining tools (predictive modeling, clustering, logistic regression, multivariate regression, decision trees, neural networks) * Hands on experience in executing analysis using tools such as SQL, R, Python, Excel, Tableau and Google Analytics. * Ability to research and learn new technologies, tools, and platforms * Ability to draw conclusions from data and recommend actions * Ability to thrive in an unstructured environment, working autonomously on a strong team to find opportunity and deliver business impact * A self-starters who can, with minimal guidance, drive projects from concept through completion * Focus to make quick strikes, iterate, and produce in high volume * The smarts to pick up new concepts fast * Interest in contributing broadly and learning about a variety of business and science contexts Required background: * 5+ years' experience as a Data / Business Analyst pulling, analyzing, and delivering analyses * Advanced proficiency with Microsoft Excel (e.g., complex statements, VBA, conditional formatting) * SQL (customized queries, automating scripts, ensuring job completion, resolving errors) * Experience with automated self-service reporting tools * Confidence in dealing with technical and non-technical senior level staff and ability to communicate in a crisp, concise and professional manner * Proven ability to manage multiple projects with competing priorities Preferred Skills: * Proficiency with Python, R or Scala * Experience with Machine Learning Libraries such as scikit-learn, mlr, mllib * Experience in one area of ML, especially Natural Language ProcessingSDL2017"}