{"jobID": "2632148491", "jobLocation": "New_York_NY", "jobTitle": "Audit Seniors--New York and New Jersey", "companyRating": null, "companyInfo": {"Website": "www.mazars.com", "Headquarters": "Paris, France", "Size": "501 to 1000 employees", "Founded": " 1921", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Description: Mazars USA LLP, the independent U.S. member firm of Mazars Group, ranks as the 24th largest accounting firm in the nation, and the 8th largest firm in the New York metropolitan area. We serve national and international clients from our headquarters in New York City and our offices in New Jersey, Long Island, Chicago, and Pennsylvania. Now is the time to join the changing, growing, and exciting Mazars USA LLP team as we continue to add both breadth and depth to our practice. We have opportunities for Audit Seniors in our New York City office to work with our Audit Groups. JOB RESPONSIBILITIES:Gain a thorough understanding of Mazars USA LLP's audit approach, methodology and toolsAssist in designing the audit approach for clientsIdentify accounting issues under U.S GAAP and/or IFRS; perform research to solve issuesSupervise audit engagements and monitor the work of audit staff, keeping managers informed of the engagement statusDraft the audit summary memoranda, the management letter, and the presentation of key discussion points for the closing meeting with the managementDevelop and maintain relationships with client personnel to obtain a better understanding of business operations, processes and functionsStay informed of current economic developments relevant to each client’s business and industryManage staff performance, conduct timely performance reviews, and provide performance feedbackDemonstrate professionalismJOB REQUIREMENTS:Bachelor’s Degree in Accounting4-6 years of recent experience as an auditor with a quality CPA firmKnowledge of manufacturing, distribution, media, and service industriesExcellent computer skills, accounting software, knowledge of ProSystem a +Completed education as a CPA or dedicated to take CPA examStrong experience in large corporate assignmentsExcellent communication and interpersonal skillsMotivated to meet client deadlines and provide first-rate client serviceMotivated by challenges and desire to be part of a teamStrong analytical and report writing skillsBENEFITS:Salary commensurate with experienceComprehensive Medical and Dental Plans401(k) PlanLife insurance, long-term disability and voluntary short-term disability coverageHigh-tech professional environment"}