{"jobID": "2598661836", "jobLocation": "San_Francisco_CA", "jobTitle": "Consulting Intern (m/f)", "companyRating": null, "companyInfo": {"Website": "www.detecon.com", "Headquarters": "Köln, Germany", "Size": "1001 to 5000 employees", "Founded": " 1977", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Starting Date: July 2018What we are looking forDetecon is looking for talented, self-motivated and entrepreneurially minded students to join its San Francisco team. Interns are critical in supporting the delivery of successful US and international projects, ensuring that our clients around the world leverage the full potential of their digital strategy and innovation initiatives. Typical projects include defining a client’s digital business strategy and preparing implementation roadmaps for new products and services. Trend analysis and startup scouting are also important parts of our work. Current enrollment as a postgraduate with a core focus on Business Administration, Computer Science, Engineering or Economics (ideal is a combination of Business/Economics and Technology)Must have a strong interest or background in digital/technology innovation, specifically in telecommunications, wireless, IoT, Industry 4.0 or connected cars, and an entrepreneurial mindsetKnowledge about innovation methods, tools and techniques (such as Design Thinking) is a plusExpertise from previous internships in innovation departments, telecommunication, consulting, startups and/or corporate strategy is extremely valuable What you can expect Being part of an international team, you will have a unique opportunity to experience the innovation powerhouse of Silicon Valley and build a network in this startup hubYou will support our consultants with their projects, assisting them on several projects during your time in San Francisco What we are offering Working as part of an international teamA flexible and attractive working environmentExcellent training and further development opportunities"}