{"jobID": "2827717489", "jobLocation": "Sunnyvale_CA", "jobTitle": "Market Development Manager/Director - Aerospace and Defense", "companyRating": "4.7", "companyInfo": {"Website": "www.rti.com", "Headquarters": "Sunnyvale, CA", "Size": "51 to 200 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " QNX Software Systems, Wind River, Green Hills Software"}, "estimatedSalary": "141000", "jobDescription": " As the leader of RTIs Aerospace and Defense market initiatives, you will play a key role in driving broader adoption of our connectivity software. You will identify new opportunities for RTI products, develop and execute strategies to pursue them, and evangelize the benefits of our technology.  You will have an excellent foundation on which to build. RTI software already provides the interoperability backbone for hundreds of mission-critical A&D; systems. By enabling a modular and open systems architecture, RTI products reduce integration costs and foster software reuse.  Candidates should have deep experience in at least one of RTIs target markets, which include avionics, unmanned systems, training and simulation, and naval systems. You should also be familiar with defense systems procurement, supply chains, and standards initiatives.  So, what do we do? Simply put, RTI connects smarts to distributed systems. We seek to transform entire industries. Our hottest markets are todays most exciting: autonomous cars, smart medical systems, green energy, unmanned planes. Our software smartly runs the largest power plants on the continent, connects perception to control in vehicles, drives the new generation of medical robotics, controls hyperloop and flying cars, and provides 24x7 medical intelligence to hospital patients and emergency victims. We are making the world greener, safer, faster, and flat-out cooler.  Unabashedly, we are the best in the world at what we do. We are the best positioned small company to capitalize on the very real future of intelligent, distributed systems.  You can make a real difference in our quest for a better world. We are large enough to impact the world, yet small enough that you can impact us. At RTI, you will be well supported, well paid, proud of your product and company, and on a mission with the greatest team you've ever known.  RTI lives at the intersection of functional artificial intelligence and pervasive networking. These are the two most important technical trends for the next several decadesthe trends that will drive your career. There is no better address.  Responsibilities: Own RTI's success in the aerospace and defense marketAssess potential target applications and develop go-to-market plans for top targetsIdentify target procurement programs and develop a strategy to pursue them, including identifying and approaching likely prime biddersIdentify and actively contribute to relevant industry consortia and standards organizationsDevelop sales and marketing tools including presentations, competitive analysis, web content, data sheets, videos, white papers, contributed articles and blog postsAuthor or contribute to RFI and RFP repsonsesEstablish and manage relationships with key partners and promotersPresent at conferences and on webinarsProvide subject matter expertise to Sales and MarketingParticipate in sales calls Qualifications: BS in a technical discipline or equivalent experienceSubject mater expertise in at least one of RTI's target markets, including unmanned systems, avionics, ground vehicles, naval systems, training and simulation, and air and missile defenseFamiliarity with software development, software architectures and/or software integrationUnderstanding of defense procurement and supply chains About RTI"}