{"jobID": "2693600087", "jobLocation": "New_York_NY", "jobTitle": "Field Clinical Specialist", "companyRating": "3.7", "companyInfo": {"Website": "www.atricure.com", "Headquarters": "Mason, OH", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Public (ATRC) ", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Medtronic, St. Jude Medical, Boston Scientific"}, "estimatedSalary": "87000", "jobDescription": "AtriCure, Inc. is a medical device company that provides innovative solutions designed to decrease the global Afib epidemic. AtriCure’s Isolator® Synergy™ Ablation System is the first and only surgical device approved for the treatment of persistent and longstanding persistent forms of Afib in patients undergoing certain open concomitant procedures. AtriCure’s AtriClip® Left Atrial Appendage Management (LAAM) exclusion device is the most widely sold device worldwide that is indicated for the occlusion of the left atrial appendage. AtriCure believes electrophysiologists and cardiothoracic surgeons are adopting its technologies for the treatment of Afib and reduction of Afib related complications. Afib affects more than 33 million people worldwide. For more information, visit AtriCure.com or follow us on Twitter @AtriCure. Position Summary: The Field Clinical Speicalist or Ablation Specialist role primarily supports field sales in the cardiac operating room and related departments in the following: Support during surgical procedures where company devices are utilizedTraining of surgical and OR staff personnel in the use of company devicesGuidance and support for physicians during live surgical procedures, and utilization and/or operation of company technologyPatient support and follow-up where requested by physician or operating room staff This position requires teamwork and strategic planning with the sales force and Program Development team. The focus of the Ablation Specialist is to support the account development process for the company by providing a resource to the sales manager, physician, and operating room staff. Ablation Specialists must be able to train and support the surgeon and their staff in various procedures and support him/her technically in the O.R. and during follow-up patient care as required. ROLES AND RESPONSIBILITIES:Conduct training for the surgeon and medical staff with modalities such as didactic and hands-on laboratory approachesProvide technical and clinical support during surgical proceduresMake calls on surgeons and support staff as necessary to discuss AtriCure technology, training programs, and clinical programs and trialsWork in a team environment with Sales, Marketing, and EngineeringCommunication on frequent basis, reporting on case notes and product and clinical feedbackBASIC QUALIFICATIONS:Strong attention to detailExperience working in an Operating Room, Electrophysiology (EP) Lab or Catheterization lab either through industry or clinical setting preferred, but not requiredPresentation and customer relationship skillsAbility to communicate and collaborate effectively with people across all levelsComputer experience with Microsoft programs such as PowerPoint, Outlook, Excel, and WordExcellent interpersonal skills. The candidate must enjoy and excel at personal relationship-buildingProblem-solving / trouble-shooting skillsAbility to travel 50%PREFERRED QUALIFICATIONS:Undergraduate degree in technical or scientific fieldESSENTIAL JOB FUNCTIONS (Physical or mental qualification requirement – i.e. walk, sit, stand, bend, push/pull, lift (how much), travel %; O=Occasional, R=Regularly, N=Never):Regularly walk, sit, and standOccasionally bend and push/pullRegularly lift up to 25 pounds, occasionally lift over 25 pounds75-80% travel possibilityPosition dependent upon candidate passing pre-employment physical/drug screen"}