{"jobID": "2789144673", "jobLocation": "New_York_NY", "jobTitle": "Accounts Payable Coordinator", "companyRating": "4.1", "companyInfo": {"Website": "www.hazenandsawyer.com", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " 1951", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Brown and Caldwell, CH2M, Black & Veatch"}, "estimatedSalary": "47000", "jobDescription": "« Current Openings Accounts Payable Coordinator - New York Location: New York, NY Office - Corporate Headquarters Hazen and Sawyer is looking for an Accounts Payable Coordinator with 5+ years’ experience to join our New York, NY office.Job Duties: • Process vendor payables by receiving, date stamping, verifying accuracy and approval before scanning into Deltek Vision. • Pay vendors by verifying Federal ID numbers; scheduling and preparing checks; resolving contract, invoice, or payment discrepancies and documentation; ensuring credit is received for outstanding invoices. • Review employee expense reports entered in system for G/L account coding, cost center allocation, completeness of receipts, approvals before processing for payment. • Pay employees by receiving and verifying expense reports for account coding, receipts, amounts, and approval; prepare checks/ACH file. • Maintain accounting ledgers by verifying and posting account transactions. • Verify vendor accounts by reconciling monthly statements and related transactions. • Maintain historical records by organizing and filing documents. • Protect organization’s value by keeping information confidential. • Special projects as needed.Skills and Qualifications: • Strong knowledge of Accounting concepts required. • Strong computer skills in MS Office and Windows applications required. • Experience with Deltek Vision is a plus • Must demonstrate excellent verbal and written communication with internal and external clients. • Ability to multi-task and work collaboratively in a fast paced, problem solving and deadline-driven environment. • Must be well organized, detail oriented, and task oriented. • Applicant must be comfortable learning new technologies, tools, and platforms. • Must be proficient in working with numbers in large volumes. • Must be flexible and able to work overtime if necessary.Apply online » Send to a friend"}