{"jobID": "2756563439", "jobLocation": "Boston_MA", "jobTitle": "Ignite Student Program Development Intern", "companyRating": null, "companyInfo": {"Website": "www.earthwatch.org", "Headquarters": "Boston, MA", "Size": "1 to 50 employees", "Founded": " 1971", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Location: Boston, MA, United States Position Type: Intern (unpaid) Department: Program Delivery POSITION SUMMARY:The Ignite Student Program Development Intern will support the Ignite fellowship program to achieve its goal to stimulate curiosity and interest in science and technology by providing students with a hands-on field experience. As an intern you will assist in a variety of tasks relating to preparing fellows for the field, and building the program’s alumni network.RESPONSIBILITIES:  Internships offer training in a variety of tasks and provide individuals an opportunity to be part of an exciting and dynamic team. Internship responsibilities may shift with seasonal needs. Responsibilities may include: Researching and producing a quarterly newsletter.Contributing to funder reports.Supporting the development of fellow fielding materials.Supporting event preparation and planning.Collecting and organizing fellowship data.Building an alumni network and community through social media and outreach. REQUIREMENTS: Interest in environmental education and non-profit business development.Exceptional organizational ability and time-management skills.Ability to work independently and collaborate on a team.Desire to help scale up an impactful program.Experience with citizen science (optional).Earthwatch interns can take part in the Intern Credit Program in which they receive credits to use towards a qualified Earthwatch expedition and are invited to participate in all Earthwatch activities. Although three or moremonths are preferred, we require a minimum commitment of one month and 120hours. We also encourage use of the internship for academic credit, thesis, or practicum work towards degree or certificate programs.  All applicants must make their own living arrangements for them to stay within commuting distance to Boston. Applicants must currently be eligible to work in the United States. All interns are required to have individual health insurance. Placement will be subject to qualifications and availability.  Earthwatch is an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disabilitystatus. We welcome people of all backgrounds and work to cultivate respect, openness, learning, honesty, and integrity in our community.  How to apply:  To apply, please submit one document containing all of the following items. Incomplete applications will not be considered. A Cover Letter illustrating your qualifications, why you are interested in this internship, and what you arelooking to gain from this internship.A current resume, detailing relevant field and/or office experience.Your availability (days per week, and months of availability)."}