{"jobID": "2818023231", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst - Entertainment and Media Industry Opportunity", "companyRating": "3.2", "companyInfo": {"Website": "www.crunchyroll.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "79000", "jobDescription": " Data Analyst (Growth Team)Planning world domination? What a coincidence, we are too! With VRV recently reaching 1.5M registered users in less than one year, and Crunchyroll topping the 1M subscriber milestone; the team at Ellation is just getting started.  Ellation is searching for a Data Analyst to join our Growth Team. As a key contributor, you will have the opportunity to directly impact the companys growth. This role offers tremendous growth opportunity and is perfect for for individuals looking to refine their skills and team responsibilities over time. Benefits: On-site gym, showers, yoga, and meditation classes  Medical, dental, vision, STD, LTD, and life insurance  Opportunity to participate in industry conferences  Employer-sponsored training and certifications  Contribute to multiple open source products  Catered lunch and dinner 4 days per week  Fun, passionate and skilled co-workers  Health care and dependent care FSA  401(k) plan with employer match  Pet-friendly environment  Paid commuter benefit  Competitive salary About you: 3+ years in a Data Analyst role with 2+ years of Data Mining experience  Bachelors Degree in Mathematics, Engineering or Sciences  Experience in composing SQL queries to mine internal data  Able to collaborate effectively and work as part of a team  Experience in analyzing A/B testing experiments  Curious about user behavior & product UX  Strong attention to detail and enthusiasm  What to expect on a daily basis:  Identify and recommend new ways generate (or save) revenue through our Crunchyroll and VrV platforms  Build and maintain recurring reports to evaluate performance of our product KPIs and guide strategic decision making  Generate useful business reports to assist leadership in measuring and articulating results  Conduct ad-hoc analysis and build complex financial models to drive actionable insights  Create Data Models that depict trends in the customer base and consumer population  Support decision-making with the product org and cross-functional departments  Assist with the creation of key presentations (experiment results, leadership reports)  Utilize statistical methods and tools to analyze data Please beware of recent scams to online job seekers. Those applying to our job openings will only be contacted directly from @crunchyroll.com and @ellation.com email accounts. If you have any questions of the authenticity of an Ellation or Crunchyroll job offer, please contact jobs@crunchyroll.com before giving away any personal information. About Crunchyroll  Crunchyroll is the worlds largest destination for anime and manga, boasting a global community of more than 25 million registered users and over 1 million subscribers. Fans connect through the most complete anime library including \"Naruto Shippuden,\" \"Attack on Titan,\" and Dragon Ball Super, events such as Crunchyroll Movie Nights, Crunchyroll News, and can purchase related merchandise through its online store. Through its app on game consoles, set-top boxes, mobile devices and more, Crunchyroll delivers content from leading media producers directly to viewers translated professionally in multiple languages. The service is available for free or through a premium offering that allows users to watch ad-free with access to simulcaststop series available immediately after Japanese broadcast.  Fans can also view Crunchyroll on VRV, an audience-focused aggregation platform featuring premium SVOD channels and a curated house channel, VRV Select.  About Ellation  Ellation, Inc. is a transformative entertainment company and home of industry-leading platforms Crunchyroll andVRV. With majority investment from Otter Media, a joint-venture between AT&T; and The Chernin Group, Ellation operates at the intersection of technology and media to redefine the next wave of media interaction and consumption -- breaking down barriers to content experiences for passionate fans around the world. Ellations offices in San Francisco, Tokyo, and Chiinu develop the product, design, engineering, marketing and content that brings our communities of passionate fans together.  About VRV  VRV is a leading audience-focused aggregation platform featuring premium SVOD channels including Crunchyroll, Funimation, Rooster Teeth, and Shudder, alongside a curated house channel, VRV Select. Created to provide fans with a next-gen entertainment experience, VRV offers immersive content experiences in a digitally-driven environment via bundled subscription, a la carte subscription, or ad-supported options. As a platform, VRV helps partners extend their reach and distribute their premium content through a high-quality, branded experience on mobile, web, and popular living room devices."}