{"jobID": "2707705359", "jobLocation": "San_Jose_CA", "jobTitle": "Teller - FT South Bay", "companyRating": null, "companyInfo": {"Website": "www.providentcu.org", "Headquarters": "Redwood City, CA", "Size": "201 to 500 employees", "Founded": " 1950", "Type": " Nonprofit Organization", "Industry": " Finance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Patelco Credit Union, Golden 1 Credit Union, San Mateo Credit Union"}, "estimatedSalary": null, "jobDescription": "If you’re a people person who loves to help others and has an eye on a career that pivots around making a difference in the lives of others, check out our floating Member Service Representative/Teller position.What is a floating Member Service Representative/Teller?We’re glad you asked! Our floating MSRs are introduced to the many locations and communities Provident serves. They travel to our branches to fill in where needed. They handle cash, interact with our members and seek opportunities to share information about us and the products and services we offer to help them manage their finances successfully. This position opens the door to a variety of future career possibilities with Provident. It is also an ideal way to take us for a test drive and determine which branch you like the best. This float position will primarily provide coverage for the East Bay (Hayward to Walnut Creek) branches, but may cover other branches on occasion. If you’re a road warrior and welcome the opportunity to be in a different place every day (at least during your initial time period with us), Provident could be the perfect fit for you!Here’s a breakdown of the day-to-day functions:Assist members with their transactions.Recognize member needs and make referrals that may be of benefit to them.Give your best every day to provide top-notch service. (Sure, this is a given – but we like saying it anyway.)The position demands maturity, flexibility, prior banking experience and someone ready to contribute at a high level -- and the rewards come with it.:The chance to be immersed in a family-type environment with the goal of helping our members – and each other – succeed. Mileage reimbursement for your travels to our community branches.Fully paid health insurance premiums Quality medical, dental and vision care coverage 401(k) retirement plan with matching employer contributions Strong commitment to investing in your career and educational advancement by offering up to 100% tuition reimbursement for approved courses. Incentive plan Generous paid time off and paid holidays Flexible spending accounts Short and long-term disability coverage Life and AD&D; insurance Provident membership Rate discount on home and auto loans In-house training And much more! What you’ll bring to the position:Great energy and a level head.The desire and ability to learn new things. Good computer skills – and it’s a plus if you’re familiar with Microsoft Word and Excel.Get to know our members and our culture while working in several settings. As branch positions open up, you’ll have opportunity to apply for them.Provident is an Equal Opportunity EmployerWe are a winner of the Bay Area News Group Top Workplace in 2017. Check us out on Glassdoor"}