{"jobID": "2806531405", "jobLocation": "Fremont_CA", "jobTitle": "Embedded Systems Developer", "companyRating": null, "companyInfo": {"Website": "www.excelfore.com", "Headquarters": "Fremont, CA", "Size": "1 to 50 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We are looking for OTA Software engineers to deliver cutting edge and high quality embedded automotive products. You will develop embedded Linux and embedded Android solutions for Ethernet connectivity in automobiles and develop and integrate interfaces to connect these with existing automotive infrastructures.  We have skilled and collaborative teams, and while our main office is in the US we work with people around the world. We believe in agile development and processes and keep unnecessary layers to a minimum. Skills and Requirements: o  Passionate about software development  o  Strong experience in embedded domains, preferably automotive  o  Exceptional C programming skills  o  Strong expertise in QNX system internals  o  In-depth knowledge of network and socket device drivers  o  Experience in hardware debugging, porting and board bring-up Development experience on GNU tools and cross-tool chain Extra points if you have: o  Strong knowledge of Android Framework. Experience with embedded Android  o  Low level Ethernet protocol lower than the transport layer  o  Automotive Standards: SPICE, AUTOSAR, ASIL  o  Automotive Protocols: AVB/TSN, DolP, SOME/IP, CAN  o  Experience working with distributed teams  Candidates should be self-starters, insatiably curious and always learning new technologies. You will be adept at managing your time and communicate fearlessly. An active GitHub profile will garner you bonus points.  We have multiple open positions and welcome all levels of seniority. Candidates seeking fulltime as well as consulting engagements are welcome to apply."}