{"jobID": "2827761730", "jobLocation": "Charlestown_MA", "jobTitle": "Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.umassmed.edu", "Headquarters": "Boston, MA", "Size": "10000+ employees", "Founded": " Unknown", "Type": " College / University", "Industry": " Education", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": " Overview GENERAL SUMMARY OF POSITION:ABOUT THE CENTER FOR HEALTH CARE FINANCING AND COORDINATION OF BENEFITS The Center for Health Care Financing (CHCF) is part of Commonwealth Medicine (CWM), a division of University of Massachusetts Medical School. CWM programs combine academic excellence and public health service expertise to provide health care solutions ideal for the public sector and not-for profit organizations. CWM has helped Massachusetts and many other state and local health care agencies increase the value and quality of health care expenditures and improve access and delivery of care to at-risk and uninsured populations. The Coordination of Benefits (COB) Claims team, within CHCF, is responsible for a wide mix of projects and initiatives that share a common link of coordinating Medicare and commercial insurance coverage for recipients of public health and human service benefits. Using a data driven approach, the team is responsible for identifying, researching, developing, and implementing cost savings initiatives, through the coordination of claims on behalf of health and human service agencies. Through each venture, the BCR team works to maximize benefits for recipients, while ensuring cost effectiveness for clients. ABOUT THE HEALTHCARE CLAIMS DATA ANALYST II - COORDINATION OF BENEFITS CLAIMS POSITION The COB claims team is seeking a Healthcare Claims Data Analyst II who will perform data analyses for assigned projects and develop/ produce all related reports. This position will conduct information gathering to provide leadership with the necessary tools to determine the best data analytic practices to position the business unit for addressing client needs. The Healthcare Claims Data Analyst II will utilize analytic consulting skills and a customer service focus in order to design and deliver analytic products that meet or exceed client expectations. This position will be required to work on multiple concurrent projects while successfully completing deliverables with an increasing level of independence. Under the general direction of the Senior Manager, or designee, the COB Claims Healthcare Claims Data Analyst II will lead the COB claims team's project activities, oversee all aspects of the project from inception to completion as it relates to coordination of claims. The Healthcare Claims Data Analyst II will be responsible for acquiring data sets, initiating analyses, interpreting outputs, providing analytical findings and making recommendations to achieve cost savings for our clients. The Healthcare Claims Data Analyst II will utilize a customer service focus to design and deliver analytic products that meet or exceed client expectations. The successful candidate will be a highly motivated individual, who thrives in a team environment, with proven high quality results in a dynamic operations setting. ResponsibilitiesMAJOR RESPONSIBILITIES:Conduct advanced data mining in a timely and accurate manner as required by the program/project.Produce standard and adhoc analyses and reports using a variety of data which support the development, implementation and monitoring of programs/projects.Integrate/manipulate large datasets from data sources (e.g. claims and encounter data) to support analyses using MS Excel, Access, SAS, SQL, COGNOS, and Business Objects.Deploy standard qualitative and quantitative analysis techniques utilizing software packages such as SAS, SQL or Atlas.ti.Contribute to the design of project-specific analytic plans, data manipulation and collection efforts; may include: claims analysis, interviews, focus groups, and surveys involving clients, state agency personnel, and other key informants.Utilize and create standard testing measures and/or algorithms to test and analyze large amounts of data.Design and develop data collection instruments, databases and procedure manuals based on thorough knowledge of data files, related databases, and systems integration.Participate in the design and implementation of data management strategies/techniques and quality control procedures, including writing technical requirements and documentation of data sets.Produce and submit data analysis reports. Develop methods and results narratives to be included in broader scientific reports developed by senior staff.Ensure accuracy of all data analyses, reports and other deliverables by conducting thorough quality control checks and resolving discrepancies.Provide interpretation of data for key stakeholders and leadership; including identifying and reporting data patterns and abnormalities. May be required to produce tabular and graphic summaries of analyses in a form suitable for inclusion in manuscripts for publication in peer reviewed scientific journals as well as for presentation at scientific meetings.Schedule, coordinate, and review activities related to data collection and analysis in order to meet deadlines.Communicate with all appropriate parties to ensure that the project's objectives, scope, and expected deliverables of each project phase are understood. Facilitate communication of the project's status, budget, costs, issues, and related information to same.May provide guidance and training to more junior data staff as needed to help ensure accuracy and timeliness of deliverables.Review and monitor compliance with the federal and state regulations.Perform other duties as required.QualificationsREQUIRED QUALIFICATIONS:Bachelor's degree in a business, health sciences, or a related field; or equivalent4 years of related experience; including at least one year of healthcare data analysisDemonstrated experience/skills in appropriate computer, statistical or database applications including SAS/SQL, Business Objects, Cognos or similar.Strong attention to detail and time management/organization skills to manage multiple priorities.Demonstrated ability to research issues and resources.Demonstrated ability to write reports, journal articles and/ or other technical documents.Excellent communication skills, both oral and written.Interpersonal skills necessary to interact successfully with a wide range of individuals.Additional InformationPREFERRED QUALIFICATIONS:Expertise in Health Insurance services utilization, reimbursement concepts, industry standard terminology and metrics relevant to Coordination of Benefits for Medicaid, Medicare and Commercial PayersDemonstrated focus on quality that includes attention to detail, accuracy, and accountability for work productWorking knowledge of claims based health care data, including medical terminology and standard coding systems (ICD9/ICD10, CPT, MS-DRG, HCPCS)Demonstrated experience/skills with Data Warehouse concepts and CognosHighly proficient in Microsoft Office suite (Word/Excel/Access/PowerPoint).Experience with Microsoft SharePoint or other project management toolsDemonstrated experience with test cycles (UAT and Model Office)SUPERVISION EXERCISED: May supervise junior data staff ENVIRONMENTAL WORKING CONDITIONSUsual office environmentTravel to off-site locations"}