{"jobID": "2706553164", "jobLocation": "Santa_Monica_CA", "jobTitle": "Senior Analyst/Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.edmunds.com", "Headquarters": "Santa Monica, CA", "Size": "501 to 1000 employees", "Founded": " 1966", "Type": " Company - Private", "Industry": " Media", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " TrueCar, Cars.com, Kelley Blue Book"}, "estimatedSalary": "150000", "jobDescription": " At Edmunds were driven to make car buying easier. Ever since we began publishing printed car guides in the 60s, the company has been in the business of trust, innovating ways to empower and support car shoppers. When Edmunds launched the car industrys first Internet site in 1994, we established a leadership position online and have never looked back. Now, as one of the most trusted review sites on the Internet, millions of visitors use our research, shopping and buying tools every month to make an easy and informed decision on their next car. For consumers, we bring peace of mind. For dealers, we make tools to help them solve their problems and sell more cars. How do we do it, you ask? The key ingredients are our enthusiastic employees, progressive company culture and cutting-edge technology. Want to join the team? Read on to find out how! What Youre Applying For: Edmunds is seeking a skilled, creative and enthusiastic Senior Analyst/Data Scientist experienced in generating actionable insights from large sets of data, measuring business performance, and identifying areas of growth and optimization using advanced analytical (modeling, machine learning) and experimental approaches.  The ideal candidate is also a natural problem-solver that enjoys working with large data sets and is proactive in exploring database tables and using data to make clear and convincing business cases.  The analyst will play a crucial role in supporting our Tier 3 Sales team by creating dealer performance forecast; monitoring revenue, dealer penetration and churn; analyzing effectiveness of sales efforts, and identifying areas of optimization and growth by extracting insights through modeling, testing and experimentation. In addition, this person will be expected to take ownership of projects to continually improve reporting quality through automation while also working cross-functionally to generate key insights, reports and analytics.  The right candidate will have experience working across business and functional boundaries, partnering with internal clients to provide decision-making support through analytic insights.  This is a great opportunity for an individual with significant business acumen that is interested in playing with the wealth of structured and unstructured data that is available within the car buying ecosystem. Curiosity and business intellect a must. What Youll Do: Develop, evaluate, refine, and automate analytic models using data to address business needs, and identify areas of optimization and growthPrepare visualizations of data in order to explain and persuadeDesign, conduct and lead complex analyses that mine, extract, track, report and analyze performance metricsProvide recommendations to key stakeholders and support the business needCreate and produce forecasts, reports, ad hoc requests, dashboards, etc. utilizing our data warehouse and other data source systems and summarize your findingsInteract with multiple teams in different departments and define requirements for reportingChallenges:Edmunds is a fast growing and innovative company. Qualified candidate should possess strong project management skills, an ability to multitask and balance competing priorities.What You Need: Strong analytical and data mining skillsExcellent programming skills in SQL and R, and/or SAS, and/or PythonStrong data modeling / statistical analysis / predictive modeling experience required (R, SAS and/or Python)Excellent presentation and communication skills (PowerPoint)Exposure to BI tools such as Tableau or Interana is a plusMasters degree in a quantitative field, such as mathematics, statistics, physics, computer science, business analytics, etc. with at least three years of related work experience, or a BS in related field with at least five years of relevant work experienceWorking @ Edmunds.com: Employees think its a pretty great place to work and some pretty impressive publications think it is too: we have been recognized as one of the best places to work by the Fortune Magazine and Great Places to Work, LA Business Journal (for the last 6 years!), Computerworld, and Built in LA. We've also been identified as one of the best workplaces specifically in Technology and also for Diversity and Asian Americans. In fact, our CEO, Avi Steinlauf, was rated as one of Glassdoor's Highest Rated CEOs! If youre interested in learning more and joining our mission, wed love to hear from you! Edmunds will consider for employment qualified candidates with criminal histories in a manner consistent with the requirements of all applicable laws."}