{"jobID": "2767288895", "jobLocation": "Concord_MA", "jobTitle": "Clinical Data Analyst for Physician Performance", "companyRating": "4.3", "companyInfo": {"Website": "www.emersonhospital.org", "Headquarters": "Concord, MA", "Size": "1001 to 5000 employees", "Founded": " 1924", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Steward Health Care System"}, "estimatedSalary": "64000", "jobDescription": "Job Summary:The Clinical Data Analyst for Physician Performance will work with internal and external stakeholders to provide reporting and analysis for quality and cost initiatives. The analyst will assist leadership in identifying trends and areas for improvement for quality performance and cost of treatment for all Emerson affiliated practices. This position requires a strong quantitative background, and solid communication skills.The analyst will conduct analyses using Crystal Reports, Business Objects, Excel and Tableau. The position will require solid communication skills to present findings, provide updates, and assist in the planning and preparation for new initiatives. This role requires a familiarity with medical terminology, medical classification systems (ICD-10, DRG's, NDC or GPI Codes), relational databases, and dashboard presentations.  Minimum Qualifications:Education:BA/BS with a clinical or technical degree preferred  Experience:Demonstrated experience with data and analytic software programs such as Crystal Reports, Business Objects, Microsoft Access, or similar. The ability to use Excel or Tableau to display summary data accurately and effectively.Demonstrated interest in health care.Experience with electronic medical record systems preferredExcellent communication skills, including oral, written, and graphical display of dataAbility to understand the goal and intent of requests for analysis, and collaborate with non-technical stakeholders to fulfill the request. Appreciation for the sensitive nature of health data, and an ability to respect patient confidentiality. Ability to work collaboratively and independently, as needed, in a fast-paced, high volume, changing environment  Licensure and/or Certification: None  Skills:Excellent customer service skills.Data reporting and visualization softwareAbility to maintain confidential information."}