{"jobID": "2776433137", "jobLocation": "Austin_TX", "jobTitle": "Data Scientist II: Yield Optimization", "companyRating": "3.8", "companyInfo": {"Website": "www.homeaway.com", "Headquarters": "Austin, TX", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Airbnb, TripAdvisor, 9flats.com"}, "estimatedSalary": "107000", "jobDescription": " HomeAway, a world leader in the vacation rental industry, is the place to book beach houses, cabins, and condos with more than two million places to stay in 190 countries. The site makes it easy to find and book the perfect vacation rental for any getaway, often for less than the cost of traditional hotel accommodations. HomeAway is part of the Expedia Group family of brands. Opportunity: We are looking for excellent Data Scientists to join our growing 20+ strong team. This position focuses on yield optimization and dynamic pricing, so it is a good fit for those with backgrounds such as operations research, economics and applied mathematics. This role will work closely with our marketplace design team to help boost efficiency and profitability on our massive e-commerce marketplace. The statistical learning algorithms you develop will affect billions of dollars of transactions every year. Challenges To Work On:Understand supply and demand based on rich features sets that very across space and timeModifying ranking algorithms to support a healthy marketplace with dynamic commissionsModel demand curves in a high-dimensional space using modern techniques such as deep learningDevelop mechanisms to dynamically trigger supplyOptimal pricingSpacial modeling of supply valueResponsibilities:Work on larger programs/initiatives encompassing several projects that have a company-wide impactApply best-in-class machine learning techniques to solve the business problem at handProduce novel insights with machine learning to inform company strategyAssist others with data discovery and data preparation phaseHelp build the core feedback loops and incentive structures in our marketplaceWork end-to-end on studio projects that you conceive, develop and land as a winner in the companyAttend conferences and read papers to stay on top of advancements in the fieldQualifications:Experience with programming languages such as R, Python, or ScalaExperience in processing and analyzing large scale data volumes, semi-structured and unstructured data and near real-time throughputExperience applying the right ML model to solve business problemsAbility and passion to learn new techniques to stay on the cutting edgeExperience working in Hadoop ecosystemStrong database knowledge and expertise in SQLExperience using visualization tools such as Tableau and DatameerGood storytelling and presentation skills i.e be able to present business side of the story that data presents to c-team and business leadersMasters or Ph.D in Statistics, Operations Research, Math, Computer Science or other quantitative fieldBenefits & Perks:Competitive health and insurance benefits.Competitive salary.Annual target bonus or commission.Paid vacation and sick time.Vacation rental on a yearly basis (taxable benefit).Employee Stock Purchase Program.Free snacks and beverages.Frequent company update talks with our leadership team.Free listing on HomeAway.com.Electronic, adjustable stand-up desk.Discounted Metro & Rail pass.Casual dress. We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}