{"jobID": "2811399104", "jobLocation": "New_York_NY", "jobTitle": "Project Manager - Temporary Position", "companyRating": "2.9", "companyInfo": {"Website": "www.prohealthcare.com", "Headquarters": "Lake Success, NY", "Size": "1001 to 5000 employees", "Founded": " 1997", "Type": " Subsidiary or Business Segment", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Northwell Health, Stony Brook University Medical, Catholic Health Services of Long Island"}, "estimatedSalary": "67000", "jobDescription": "Construction Project Manager – Temporary PositionLocated in Manhattan, The New York Proton Center (NYPC)is one of the most unique and respected clinical partnerships in the world of proton therapy. The collaboration between Memorial Sloan Kettering Cancer Center, Montefiore Medical Center and Mount Sinai Health System brings state of the art proton therapy treatment to the patients of New York and the surrounding areas. The Consortium is managed by ProHEALTH Medical Management, LLC.Our team at NYPC is comprised of highly motivated, passionate, professional and engaged individuals working together as a dynamic team to deliver an exceptional level of patient care, providing the most advanced proton therapy technology. We offer our employees a competitive compensation and benefits package with flexibility for growth and career advancement.We are looking for an experienced Construction Project Manager to plan and supervise a wide range of construction projects from start to finish. This role will organize and oversee construction procedures and ensure they are completed in a timely and efficient manner.An excellent Construction Project Manager must be well-versed in all construction methodologies and procedures and able to coordinate a team of professionals of different disciplines to achieve the best results. The ideal candidate will have an analytical mind and great organizational skills.The goal will be to ensure all projects are delivered on time according to requirements and without exceeding budget. Essential Duties and Responsibilities:Collaborate with engineers, architects etc. to determine the specifications of the projectNegotiate contracts with external vendors to reach agreementsObtain permits and licenses from appropriate authoritiesDetermine needed resources (manpower, equipment and materials) from start to finish with attention to budgetary limitationsPlan all construction operations and schedule intermediate phases to ensure deadlines will be metAcquire equipment and material and monitor stocks to timely handle inadequaciesHire contractors and other staff and allocate responsibilitiesSupervise the work of laborers, mechanics etc. and give them guidance when neededEvaluate progress and prepare detailed reportsEnsure adherence to all health and safety standards and report issues Qualifications:Proven experience as construction project managerIn-depth understanding of construction procedures and material and project management principlesFamiliarity with quality and health and safety standardsGood knowledge of MS OfficeFamiliarity with construction/ project management softwareOutstanding communication and negotiation skillsExcellent organizational and time-management skillsA team player with leadership abilities The New York Proton Center (NYPC) strives to maintain a workplace that accepts and appreciates the differences among our employees. The company will not discriminate against any applicant or employee based on age, race, gender, color, religion, national origin, ancestry, disability, marital status, covered veteran status, sexual orientation, gender identity and/or expression, genetic information, status with respect to public assistance or any other characteristic protected by state, federal, or local law. "}