{"jobID": "2811583555", "jobLocation": "New_York_NY", "jobTitle": "Therapy Staff Coordinator", "companyRating": null, "companyInfo": {"Website": "www.nportstaffing.com", "Headquarters": "Brooklyn, NY", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Private Practice / Firm", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "A CAREER WITH NPORTNPORT is the largest provider of contract nursing and therapy staffing services in the tri-state area. We provide thousands of hours of staffing every month with long-term, short-term, temp-to-perm and permanent placement positions to fit the needs of our clinicians and our clients. We offer high pay rates, fun and challenging positions with full benefit packages available to you... At NPORT, superior customer service and clinical excellence are our standards every day. We are a top performing therapy staffing company with the ability to service facilities of all types. We provide the most advanced therapists of all disciplines and a rich plentiful culture to our internal employees.NPORT is Joint Commission accredited for health care staffing and is an industry leading provider of nursing and therapy services throughout New York. Through our partnership with VTA Management Services in 2012, our experience serving New York dates back to 1972. NPORT services populations from pediatrics through geriatrics within various healthcare and educational facilities. NPORT is dedicated to top quality patient care.NPORT’s mission is to fill facility health care staffing needs with competent, qualified clinicians in a timely basis. We will simultaneously fill our clinicians’ work needs by providing them with full work schedules and preparing them to succeed in their assignments.*Nport/Kindred Healthcare has an available opening for a Therapy Staff Coordinator in our Brooklyn NY Location* Responsible for staffing therapy programs with OT, OTA, PT, PTA and SLP staff to cover for time off such as vacation, illness, holidays, or extended leaves of absence as well as regular day to day staffing operations. The staff coordinator will be assigned to report directly to the Recruitment Manager and assist in resolving open staffing positions. In most cases will be assigned to work directly with Recruitment specialist, Sales Associates, Liaison’s, and design a Staffing plan that will enable the area to fulfill patient care by having appropriate staff on site.Knowledge/Skills/Abilities: General knowledge of staffing principlesKnowledge of RehabCare operationsAbility to multi task and plan ahead for unexpected staffing shortagesAbility to work independently with limited resourcesHighly detailed oriented with strong time management skillsStrong communication skills and the ability to communicate with various levels of management and employees.Approximate percent of time required to travel:Prior experience in staffing licensed i.e. Rehab personnel, Physical Therapist, Occupational Therapist, Speech Language Therapist and RN’s/LPN’s is highly preferred.Good working communication, organized and entrepreneurialExcellent knowledge of the employment and staffing process.Computer literacy, including effective utilization of Internet capabilities.Clear understanding of staffing ratios and expectations"}