{"jobID": "2767596992", "jobLocation": "Bellevue_WA", "jobTitle": "Data Scientist", "companyRating": "4.6", "companyInfo": {"Website": "www.smartsheet.com", "Headquarters": "Bellevue, WA", "Size": "501 to 1000 employees", "Founded": " 2005", "Type": " Company - Public (SMAR) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "129000", "jobDescription": " Smartsheet is looking for an experienced Data Scientist to help drive analyses, generate insights, and influence decision making. With thousands of subscribing organizations and millions of users there is lots of opportunity to make meaningful impact and drive growth through analytics within Smartsheet. The ideal candidate is intellectually curious, has strong analytical skills and has the ability to communicate key insights effectively. This individual will work closely with departments across the company and will be a part of a highly efficient and results oriented Business Intelligence team. This full time position reports to the Data Science Manager and is based in Smartsheet's corporate offices in Bellevue, WA. Responsibilities:Mine large datasets and draw actionable insightsPresent discoveries and insights to line of business teams and give recommendations to encourage data-driven decision makingPartner with cross functional teams across Marketing, Sales, Product Management, Engineering in operationalizing the initiativesIdentify areas for further investigationRequirements:BA/BS in Computer Science, Mathematics, Operations Research, Physics, or other technical field. Advanced degree preferred but not required3+ years of experience in quantitative analysis, combined with strong business judgment and an ability to present analysis in a clear and compelling mannerProficient in implementing various statistical models and data mining tools (predictive modeling, clustering, logistic regression, multivariate regression, decision trees, neural networks)Hands on experience in executing analysis using tools such as SQL, R, Python, Excel, Tableau and Google Analytics.Ability to research and learn new technologies, tools, and platformsAbility to draw conclusions from data and recommend actionsAbility to thrive in an unstructured environment, working autonomously on a strong team to find opportunity and deliver business impactA self-starters who can, with minimal guidance, drive projects from concept through completionFocus to make quick strikes, iterate, and produce in high volumeSmarts to pick up new concepts at light speedAgility to quickly adjust priorities and shift directionFlexibility to contribute to other projects as required"}