{"jobID": "2582214295", "jobLocation": "New_York_NY", "jobTitle": "Associate Chief of Anesthesiology", "companyRating": null, "companyInfo": {"Website": "www.pagny.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Overview Physician Affiliate Group of New York (PAGNY) is comprised of nearly 4,000 physicians and healthcare professionals who provide services to NYC Health + Hospitals, the largest public health system in the United States. Our practitioners are highly skilled professionals with outstanding credentials who deliver the highest level of quality healthcare to patients throughout New York City. NYC Health + Hospitals/Metropolitan is a full-service, acute care hospital emphasizing primary care medicine and utilizing the latest advances in medical science. Metropolitan Hospital Center was the first hospital in East Harlem to be designated by the New York State Department of Health (NYSDOH) as an official Stroke Center. Metropolitan prides itself on delivering culturally-sensitive, compassionate, appropriate and affordable medical care to the diverse neighborhoods of northern Manhattan. Responsibilities Under the direction of the Chief of the department, direct, oversee, manage and evaluate all aspects of clinical services and medical education provided by members of the Division to deliver accredited medical services that meet all medical standards required by law. Full range of administrative/operational responsibilities to ensure the efficient achievement of departmental goals. Responsibilities:Foster the academic development of the Division membersParticipate with the Hospital in the development and implementation of mechanisms and measures to optimize the appropriate utilization of medical services, quality assurance and patient satisfaction at the Hospital.Participate in other related responsibilities as assigned by the Employer, the Executive Director and/or the Medical Director of the Hospital.Plans joint programs and procedures with other departments for coordinating services with other patient care services.With the Chairman, establishes services capital equipment needs and capital equipment purchasing plan.Evaluates equipment proposals for the Chairman of the department.Participates in the Department's Quality Assessment and Improvement Committee.Acts as direct supervisor and consultant for all staff assigned to Services.Knowledge of Patient Safety requirements.Participates in medical educational meetings to improve and provide continuous quality care to our patients.Determines the qualifications and competence of department personnel who perform medical/surgical Services.Establishes mechanisms for orientating and providing in-service training and continuing education for all persons in Division.Recommends space and other resources needed by the Division in order to maintain a satisfactory level of care.Essential Responsibilities:Prepare division staff schedules.Review, approve/deny and sign off on leave of absence requests, including CME.Review, Approve/deny and sign off on time sheers and session sheets.Prepare monitor and follow up on division performance indicators.Prepare strategic planning for the Division.Prepare monthly schedules for teaching of students and residents.QualificationsABMS BC/BE in AnesthesiologyNYS license in good standingBoard CertifiedEOE M/F/D/V"}