{"jobID": "2678141971", "jobLocation": "Santa_Clara_CA", "jobTitle": "Research Intern, Heterogeneous Mobile Edge Computing", "companyRating": null, "companyInfo": {"Website": "www.huawei.com", "Headquarters": "Shenzhen, China", "Size": "10000+ employees", "Founded": " 1987", "Type": " Company - Private", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " Ericsson-Worldwide, Cisco Systems, Apple"}, "estimatedSalary": null, "jobDescription": "Huawei is a leading global information and communications technology (ICT) solutions provider. Through our dedication to customer-centric innovation and strong partnerships, we have established end-to-end advantages in telecom networks, devices and cloud computing. We are committed to creating maximum value for telecom operators, enterprises and consumers by providing competitive solutions and services. Our products and solutions have been deployed in over 170 countries, serving more than one third of the world’s population. Huawei has over 180,000 employees, approximately 80,000 of which are engaged in Research & development. Huawei operates a global network of 12 regional headquarters, 14 R&D; Centers, 36 Innovation Centers jointly operated with customers, and 45 Training Centers. Huawei is leading the way by rethinking the future. From devices to telecom infrastructure to cloud computing and convergence solutions, we are rethinking every link in the chain with ICT based innovation to deliver a better future...faster. Research Intern, Heterogeneous Mobile Edge Computing Location: Santa Clara, CA (R&D;) Req #: 9326 # of Openings: 1 DescriptionBusiness Justification MEC is recognized as one of the key emerging technologies for 5G networks. Heterogeneous computing will play a critical role for future edge computing platforms. Keys to HSA are common tools to support an increasing array of processing solutions and a common intermediate language to allow programming for and portability to other platforms. Project - Work alongside members of the Architecture & Advanced Technologies team of NFV Competence Center to conduct research and development on heterogeneous computing to address mobile edge computing challenges from context-aware performance optimization to smart and efficient MEC scheduling to optimize resource allocation and to enhance reliability and scalability. ObjectiveConduct research on heterogeneous/parallel programming models of HAS to enable power-efficient network performance and programmability.DeliverablesResearch report on programmability and portability of Heterogeneous System Architecture;Use case study (e.g. IoT, analytics) of HSA in mobile edge computing;IPR in ETA if applicable;ResponsibilitiesPhase I (ramp up) Become familiar with NFV and packet processing technologies, especially Data Plane Development Kit (DPDK)Get familiar with FPGA, GPU, NPU and other HW acceleration techniquesBecome familiar Network Interface Card (NIC), zero-copy, and vSwitch acceleration architecturesPhase II (survey) Study research literature in data plane acceleration, conduct a survey and comparison of commonalities of accelerated hardwareStudy data plane processing acceleration frameworks with CPUs, GPUs, ASICs, FPGAs, NPUs and other processors, with the factors of efficiency (performance vs costs), programmability, protocol, packet size, etc.Phase III (proposal/conclusion) Select a virtualized network function relevant to the Telco industry and design an experiment to demonstrate performance improvement using HW offload technologyPropose/author a technical conclusion report for building programmable data plane to meet performance and latency requirementsQualificationMS/PhD in Electrical/Computer Engineering and minimum 2 years relevant work experienceAdvanced knowledge of computer architecture and digital logic designVerilog coding and integration, test set up, bench creation and debugFPGA design tool flows, synthesis, timing analysis, partitioning, FPGA programming, bring up and testingProficiency in programming/scripting languages like Perl, Python, C/C++Linux Operating Systems, Linux Kernel, especially networking driversExcellent problem solving and debugging skillsDesiredExperience with OpenCL or OpenMP, CUDAHuawei Inc. is proud to be an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Why work for us?In 2017, Huawei's revenue reached CNY600 billion (US$92 billion based on the year-end exchange rate), an increase of 15% (YOY)We invest in engineering and innovation - 80,000+ of our 180,000+ global employees work in R&D;, and we invest roughly 10% of our annual revenue in to R&D.; U.S. R&D; efforts are carried out by Futurewei Technologies, Inc.Futurewei’s commitment to R&D; is a major reason why Huawei holds one of the largest patent portfolio’s in the world: Since 2008, Huawei has been a top five international patent filer, per the World Intellectual Property Organization.We support green energy - Lowered CO2 emissions by 13,000 tons via Huawei’s green packaging solutionsFuturewei works with leading universities to further R&D; efforts, investing more than $10million USD each year to support programs at Harvard, MIT, Stanford and Yale, among others. Are you a returning applicant?Previous Applicants:Email:Password: If you do not remember your password click here. Back to Search Results New SearchCopyright © Huawei Technologies Co., Ltd. 1998-2017. All rights reserved."}