{"jobID": "2730849539", "jobLocation": "Menlo_Park_CA", "jobTitle": "Staff Nurse (RN) - Per Diem", "companyRating": "3.4", "companyInfo": {"Website": "www.satellitehealth.com", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 1973", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " DaVita, Fresenius Medical Care - North America"}, "estimatedSalary": "51", "jobDescription": " Requisition Number 18-0260 Post Date 4/11/2018 Title Staff Nurse (RN) - Per Diem Location Menlo Park Job Status Per Diem Work Hours 0 City Menlo Park State CA DescriptionSatellite Healthcare is a successful, nonprofit organization that has improved the lives of people living with kidney disease since 1973. We earn our national reputation for excellent patient care each day by offering a complete range of dialysis therapy  choices, personalized clinical services, and unparalleled wellness education.  Satellite Healthcare provides expert, personalized kidney care at over 80 centers across the U.S. as well as at acute dialysis locations in California and Texas. Learn more about Satellite Healthcare at  www.satellitehealth.com.  The Staff Nurse functions as a coordinator of patient care collaborating with other care providers and health team members to provide required care. The Staff Nurse acts as a patient teacher and advocate, assisting the patient in seeking information, assuring  the patient has the opportunity for informed consent for treatment decisions, and promotes the maximum level of patient-desired independence.  The Staff Nurse actively participates in professional role development activities including continuing education, quality assessment and improvement, and the review and clinical application of research findings. The Staff Nurse develops ethically sound practice  and confronts ethical challenges through application of the Nephrology Nursing Standards of Practice and Standards of Care.  All work performed by the Staff Nurse is under the direct supervision of on-premises Charge Nurse. Essential FunctionsThe essential functions listed are not a comprehensive inventory of all duties, tasks, and responsibilities. Employees may also perform other duties as assigned. All employees must work in accordance with Satellite’s I-CARE Standards. Employees  must abide by all Satellite’s standards of patient care, patient’s rights and ethical treatment, and adhere to safety and quality programs.  Observes and records patient’s responses to renal failure and its treatments; performs thorough patient assessments as evidenced by documentation and feedback to the Charge Nurse"}