{"jobID": "2755005569", "jobLocation": "Hyde_Park_MA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Data AnalystAbout the Organization:Boston Preparatory Charter Public School (Boston Prep) is a free, public school, offering a rigorous curriculum to 464 students and 224 alumni, the majority coming from Dorchester, Roxbury, Mattapan, and Hyde Park. Boston Prep has recently moved into a state of the art facility and we are continuing to expand our space, as we grow from 464 to 700 students over the next five years. We operate as an integrated middle school, high school, and alumni support model. At the root of our programming is a belief that all students can succeed in a four-year college. Mission: Boston Prep prepares students to succeed in a four-year college and embody, in thought and action, lifelong ethical growth. We foster an environment structured around scholarship and personal growth that cultivates students' virtues of courage, compassion, integrity, perseverance, and respect.To achieve our ambitious goals, our approach includes six essentials that we believe leads to our success: we have an exceptional adult team, we hold high expectation for students, we foster ethical growth, we have an invested, passionate student culture, we offer a range of supports, and we ensure college persistence through a number of alumni supports. Currently, 83% of our graduates are persisting in college, 100% of our students have been accepted to four-year colleges, and 98% of our alumni have matriculated to college the semester after graduating from Boston Prep. We believe that exceptional student gains are the direct result of excellent teaching and programming and acknowledge the importance of students college readiness skills in achieving our mission. We are a mission-driven adult team committed to refining and improving our practice such that our students can chart the life course they aspire to. We hope you will consider applying.About the Position:Data Management and DesignManage all data systems, including the student information system, behavior management system, attendance data, and othersManage all internal and external reporting, including academic grading, state reporting, assessment data, behavior dashboards, and transcript dataPlay a leading role in transitioning the student information system to PowerSchoolDevelop and maintain master schedule including teacher schedules, student schedules, and class rostersSupport Targeted Intervention grouping using interim and external assessment dataLead analyses and interpret data to test hypotheses and understand academic and behavioral driversStrategic Planning and Systems Evaluation Collaborate on developing a strategic expansion plan for Boston Preps growth in enrollmentPilot academic systems such as reading programs, math programs, and interim assessment evaluation toolsLead internal and external surveys, including adult culture pulse check, upwards feedback, and Panorama surveysSupport requests from Executive Director, Chief Academic Officer, Principals, and Department ChairsSupport Board and Committee material developmentAdditional Skills Required:Commitment in Boston Preps mission, students, and staffStrong proficiency in Microsoft Excel is a must Effective oral and written communication skills using PowerPointAbility to independently structure work plans, troubleshoot technical issues, and work under tight deadlinesApplicants must possess the drive, experience, and entrepreneurial spirit to craft an outstanding urban public school. Boston Prep is committed to a diverse workplace.For more information, please visit our website at www.bostonprep.org.Boston Prep Charter Public School is committed to ensuring that all of its programs and facilities are accessible to all members of the public. We do not discriminate on the basis of age, color, disability, national origin, race, religion, sex or sexual orientation."}