{"jobID": "2830859329", "jobLocation": "Palo_Alto_CA", "jobTitle": "MBA Intern - Investment Strategy Team - Senior Financial Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.air-watch.com", "Headquarters": "Atlanta, GA", "Size": "501 to 1000 employees", "Founded": " 2003", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "93000", "jobDescription": "Intern - Investment Strategy Team - Senior Financial AnalystLocation: Palo Alto, CA Start: May or June 2018, 12 weeks  VMware is a global leader in cloud infrastructure and business mobility. VMware accelerates customers digital transformation journey by enabling enterprises to master a software-defined approach to business and IT. With VMware solutions, organizations are creating exceptional experiences by mobilizing everything, responding faster to opportunities with modern data and apps hosted across hybrid clouds, and safeguarding customer trust with a defence-in-depth approach to cybersecurity.  At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Do you dare to do the stuff youve always dreamed about? Dare to explore at http://careers.vmware.com. Team Description: The VMware Investment Strategy Team is a small and focused group that advises our CEO, CFO, and executive leaders on evaluating, assessing, and prioritizing investments for the company across its entire portfolio of products including vSphere, NSX, AirWatch, vSan, and more. The team has a proven record of identifying market and competitive trends early, embedding these trends into planning conversations and driving downstream change throughout the company.  The teams mission is to help VMW identify and invest in the right opportunities, with deliberate thought and a relentless focus on prioritization, ROI and economic value.  We seek to accomplish this mission through: Activities that impact today, such as annual strategy planning, long-range planning, prioritization and optimization of existing portfolio investmentsActivities that impact tomorrow, such as providing informed counsel on business strategy and business model evaluation, including core research teams, M&A;, and partnerships. Our team will embed you into the center of a dynamic company (>20k employees, >$35B market cap), transition to a cloud-centric future, with a responsibility for informing and recommending the investment strategies we should execute. Responsibilities:Drive strategy projects to support top cross-company prioritiesBusiness model analysisGreenfield and brownfield assessmentM&A; evaluationCompetitive and value chain assessmentActive engagement with external stakeholders (Wall Street, Board of Directors)Requirements:Bachelor's degree in Business, Finance or Accounting and a first year MBA student in a full time program2-4 years of experience at a top-tier investment bank/private equity/venture capital firm, management or technology firm, or other relevant work experienceDemonstrated ability and experience with finance, strategy or M&A; modelingAbility to work independently across multiple groups in a rapidly changing environmentStrong MS Excel, PowerPoint capabilities; deep research skillsDesired Skills:Ability to handle several high-priority bodies of work concurrentlyYou have outstanding financial acumen blended with business partnership and leadershipYou bring confidence and presence collaborating with and presenting to executive staffYou should be a self-starter, who takes charge of complex tasks with minimal direction and develop new ways of approaching business challenges independently and pro-activelyYou have excellent written, verbal communication and interpersonal skillsPassion for continuous learning and personal developmentYou must be a U.S. citizen or permanent resident to apply for this role. VMware will not sponsor a non-transferable visa for this role.Equal Employment Opportunity Statement VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. VMware will provide reasonable accommodation to employees who have protected disabilities consistent with local law."}