{"jobID": "2700663256", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist / Field Engineer (Japanese Speaking)", "companyRating": null, "companyInfo": {"Website": "www.incendia.com", "Headquarters": "Framingham, MA", "Size": "1 to 50 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " DescriptionPosition: Data Scientist / Field Engineer (Japanese Speaking)Location: San Francisco, CATerm: PermanentCompensation: Competitive Salary + bonus, equity, benefits and more! Incendia Partners, Inc. has been hired to represent Cambridge-based startup www.TAMR.com for staffing purposes. Company Description: Tamr, Inc., connects and enriches the vast reserves of underutilized internal and external data, so enterprises can use all their data for analytics and downstream applications. Tamr’s data-unification platform combines machine learning algorithms with collective human insight to identify sources, understand relationships and curate the massive variety of silo-ed data. The Tamr platform is deployed in production at information services providers, pharmaceutical firms, manufacturers and other customers. Based in Cambridge, Mass., Tamr was founded in 2013 by database industry veterans Andy Palmer, Mike Stonebraker and Ihab Ilyas with George Beskales, Daniel Bruckner and Alex Pagan. Tamr was named in Boston Globe's Top 10 Places to work in 2015. Job Description: Tamr field engineers are highly technical data scientists and engineers who understand all aspects of the business. We know how to pitch the product to anyone from software architects to business executives. Often we’re working on the most challenging problems in the enterprise and we have to dig deep to understand the business value and deliver technical solutions. As the company’s outward-facing, technical resource, the work of the whole group is varied. We build prototypes, direct product development, work with sales on accounts, implement pilot solutions, and deploy full production rollouts. Field engineers are expected to be highly efficient and resourceful when leading these projects. Qualifications:We are looking for someone who loves to write code, and has a genuine interest in being customer-facing. We are building and selling a human-in-the-loop machine learning platform for the enterprise to help companies automatically unify and categorize their data to drive new analytic insight. We are looking for engineers interested in creating front line code to solve real customer problems, ranging from back-end data processing and machine learning, to front end presentation and dashboards.Service clients in Japan, must be fluent in Japanese. Up to 25% travel.The challenges that make this job interesting:The problem we’re solving is hard - enterprise data is messy and there is a lot of it. It’s our job to derive value from this data in a flexible and scalable way.Every customer is different - while there are similar use cases that we see repeatedly, every account presents new challenges and we need to be able to adapt quickly to each new situation.This job might be a good fit for you if:You have strong data science and/or software engineering experience.You are excited about working for a startup and being a key contributor.You enjoy working with customers and have excellent interpersonal skills.You have machine learning knowledge/experience.Qualifications:BS, MS or PhD degree in Computer Science, Physics, Mathematics or similarly quantitative/technical field.Polyglot programmer, with experience using technologies such as Python, Java, R, SQLWillingness and ability to travel to client locations. Maximum of 25% travel, some potentially international.Other Preferred Qualifications:Front end / full stack software development expertiseDeep understanding of data integration and transformation patterns such as messaging, ETLHands-on experience with large distributed systems from an architecture and development perspectiveHands-on experience with traditional data warehouse technologies and BI or visualization toolsMachine learning knowledge/experienceExperience building enterprise applications, including integration with COTS systemsExperience with any of the following technologies: Hadoop, Spark, ElasticSearch, Java, AWSDevOps and/or cloud solutions deployment experience a plusAdvanced quantitative technical degree (MS or PhD) preferredAdditional Information:This position is available in San Francisco CA. Specialties: Data curation, Data integration, Automated, scalable data connection, Machine learning, Data preparation, Data unification"}