{"jobID": "2827493815", "jobLocation": "Los_Angeles_CA", "jobTitle": "Civil Rights Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Duties Help Duties Summary  The incumbent performs research on civil rights topics, including literature reviews, analysis of laws and regulations, collection and analysis of statistical data and other information, and conduct of interviews and surveys. The incumbent also drafts memoranda, reports, and other written products for review and approval of the agency's 51 State Advisory Committees.  Applications for this position are being processed through an on-line applicant assessment system that has been specifically configured for US Commission On Civil Rights applicants. Even if you have already developed a resume in USAJOBS, you will need to access this on-line system to complete the application process. To obtain information about this position and TO APPLY, please click on https://www.avuecentral.com/casting/aiportal/control/toVacancy?referenceCode=HLIED.  Learn more about this agency Responsibilities (The duties described reflect the full performance level of this position)  Serves as a Designated Federal Officer to advisory committee and supports their projects that identify, clarify, and make recommendations to the Commission concerning major national and state civil rights policies, problems, and/or issues.  As the primary researcher and point of contact for Advisory Committees, the Civil Rights Analyst directs Advisory Committees through all the stages of a project and provides support throughout all stages. Examples of these duties include but are not limited to the following: Providing methodologies to Advisory Committee Chairs in the concept stage and engender robust conversation among Committee members at open committee meetings about the pressing civil rights issues in their jurisdiction;Drafting or overseeing the drafting of a project proposal after concept completion for discussion at an open meeting of the Advisory Committee and ensuring the project proposal describes a project that is within the agency jurisdiction and its budget constraints;Overseeing and managing the implementation stage to ensure balanced testimony is heard regarding the project topic. Civil Rights Analysts will also work with Advisory Committees and Support Specialists to promote public participation in the public meetings with testimony;After all testimony is transcribed and research is complete, the Civil Rights Analyst drafts or oversees the drafting of the Advisory Committee report to ensure a professional and scholarly product is produced that includes the diverse perspectives of all stakeholders to the issue studied;Ensuring the Advisory Committee reviews draft outlines and sections of reports in open meetings until a final draft is discussed and voted upon at an open meeting. Works to maintain public involvement and feedback throughout drafting and after publication of the report; andAssist in supervising interns and managing the unit's intern program. Travel Required  Not required  Supervisory status  No  Promotion Potential 13 Who May Apply This job is open to United States Citizens  Questions? This job is open to 1 group. Job family (Series) 0160 Civil Rights Analysis Requirements Help Requirements Conditions of Employment  Moving expenses are not authorized.  Relocation expenses are not authorized.  Government housing is not available.  As a condition of employment, all male applicants born after December 31, 1959, must have registered for the selective service. If selected for this position, the applicant must sign a statement certifying his registration, or the applicant must demonstrate exempt status under the Selective Service Law.  The U.S. Commission On Civil Rights is an Equal Opportunity Employer. Except where otherwise provided by law, there will be no discrimination because of color, race, religion, national origin, politics, marital status, disability, age, sex, sexual orientation, membership or nonmembership in an employee organization, or on the basis of personal favoritism.  The U.S. Commission On Civil Rights welcomes and encourages applications from persons with disabilities and is firmly committed to satisfying its affirmative obligations under the Rehabilitation Act of QualificationsMINIMUM FEDERAL QUALIFICATION REQUIREMENTS:Grade 11: Qualifying experience for the GS-11 level includes one year of specialized experience at least equivalent to GS-9 which is in or directly related to the line of work of the position to be filled and which has equipped the applicant with the particular knowledge, skills, and abilities to successfully perform the duties of the position.  SUBSTITUTION OF EDUCATION FOR EXPERIENCE: Experience requirements at the GS-11 level may be met by three (3) full academic years of graduate level education, or the successful completion of a Ph.D. or equivalent doctoral degree, or the successful completion of an LL.M. degree.  COMBINATION OF EDUCATION AND EXPERIENCE: Equivalent combinations of successfully completed education and experience may be used to meet the experience requirements.  Specialized Experience is work such as conducting research for civil rights projects, studies, and proposals regarding the political, social, legal, and economic factors influencing socioeconomic inequality or the denial of equal protection under the law because of sex, race, national origin, religion, age, or disability; collecting, reviewing, analyzing, or organizing statistical information using public and private data source and archives which concerns the income, education, employment, occupational classifications, housing, social services, etc., of minorities, women, older persons, persons with disabilities, and persons of various national origins and religions. ADDITIONAL REQUIREMENTS: I possess the ability to conduct qualitative and/or quantitative research, analyze data reports, and develop findings/conclusions.  I possess knowledge of Federal laws/policies related to civil rights and discrimination, as well as the ability to produce reports that recommend changes and improvements in public policy on these issues. TECHNICAL QUALIFICATIONS: Ability to obtain progressively higher competency-based education.  Ability to obtain competency-based certifications.  Ability to effectively communicate in written form both internally (to senior staff, leadership and colleagues) and externally (to stakeholders, funders and federal partners) regarding civil rights programs and policies.  Ability to conduct civil rights qualitative and quantitative research and to analyze data report and develop findings and conclusions.  Knowledge of Federal laws and policies related to civil rights and discrimination, and ability to produce reports that recommend changes and improvements in public policy on these issues.  Ability to meet and deal with others regarding civil rights' matters.  Demonstrated ability to communicate orally regarding civil rights programs and policies to corporate or agency leadership, staff and representatives.  Click here to see the full Qualifications Statement. Education See Other Information.SDL2017"}