{"jobID": "2796543685", "jobLocation": "San_Jose_CA", "jobTitle": "Vice President, Wealthbuilder – Financial Services Sales", "companyRating": "3.5", "companyInfo": {"Website": "www.fishercareers.com", "Headquarters": "Camas, WA", "Size": "1001 to 5000 employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "76000", "jobDescription": " OverviewJoin Fisher Investments as a Wealthbuilder Vice President!  Use your finance sales experience to take your career to the next level at a stable and rapidly growing financial firm.  We are seeking financial professionals that are committed to changing the way that the investment industry operates. Tired of selling commissioned products that aren’t always appropriate for your clients? Help us by finding more appropriate solutions for the wide array of clients that we serve.  This is an advanced, full cycle, inside sales role. What we provide to enable you to succeed:Uncapped earning potential—a base salary plus uncapped earning incentives, so that your activities directly translate to your earningsFlexible schedule—eight hours per day, Monday through Friday during the business hours that you chooseFirm provided lead flow—not only do we have a database of existing leads, we provide you with hundreds of new contacts every month; all aspiring-affluent investors who have requested information from usQualified appointments—your performance with the leads you’re given can earn you appointments set on your behalf with qualified leads who are ready to evaluate Fisher Investments’ offeringsCompelling competition—you’re surrounded with an energetic and competitive team environment, to provide support and organic learning from other intelligent and ambitious individualsOngoing training—not only will you continue to fine-tune your sales skills, you’ll receive training in finance, capital markets, and portfolio management so you can communicate Fisher Investments' philosophy and strategy to prospective clientsAdvancement opportunities—available in sales or other departments, all of which are driven by your performance, drive, and attitudeGenerous benefits—An impressive benefits package including full coverage of insurance premiums for medical, dental, vision, a 50% 401(k) match, as well as generous paid-time-offWhat we expect of you: As a Vice President of Wealthbuilder, you will be the voice of Fisher to prospective clients. You’ll learn their financial situation, educate them on the competitive landscape, and guide them through ways Fisher Investments might be able to help them reach their financial goals.  Your success in the role will be defined by your activity in relation to your peers. Individuals who typically succeed in this role are driven, competitive, and have been successful in financial sales prior to coming to Fisher Investments. Our top performers are introspective and coachable—learning from every conversation. You’ll need strong communication skills, and the ability to tailor conversations to your audience in order to provide appropriate client solutions.  Are you committed to moving away from a commissioned product driven sales environment, and to directly help a rapidly growing firm change the investment universe ? Apply now!  FISHER INVESTMENTS IS AN EQUAL OPPORTUNITY EMPLOYER"}