{"jobID": "2827035174", "jobLocation": "Venice_CA", "jobTitle": "Sr. Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.birdbrooklyn.com", "Headquarters": "Brooklyn, NY", "Size": "1 to 50 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Bird is a last-mile electric vehicle sharing company dedicated to bringing safe, low-cost, environmentally-friendly transportation solutions to communities across the world. We provide a fleet of electric, shared scooters that can be accessed via smartphone. Bird is headquartered in Venice, California and is rapidly expanding across the country and the world.OverviewA Sr. Data Analyst will work across the organization to generate the data and analysis needed to make the best decisions as we grow and innovate. Youll be responsible for pushing the business forward on all fronts, based on insights derived from your deep understanding of our data and operations. Youll have exposure to our top executives with the opportunity to learn from their deep experience in transportation and technology as well as the opportunity to impact their decision making at a critical time as we scale the business.What You'll Do: Own the design, development, validation, and maintenance of ongoing metrics, reports, analyses, experiments and related roadmaps, etc. to drive key business decisionsConduct hands-on modeling/analytics retrieving, compiling, and analyzing large volumes of data from disparate databases into distilled, actionable information and insightsCollaborate with product, operations & marketing to deliver on key projects. This will include data provisioning, exploratory data analysis, data visualization and in some instances, statistical modelingChampion the analytics process from business understanding, data understanding, data preparation, data modeling, evaluation, and deployment; lead by example and by training business stakeholders with varying technical and non-technical backgroundsDesign and analyze A/B multivariate tests to drive KPI improvementWhat You'll Need:Bachelor's degree in a quantitative field from a highly competitive school, Masters degree preferredMinimum 5-10 years of experience using data to facilitate business decisions; High growth technology, strategy consulting, business intelligence, investment banking/private equity backgroundProficiency with SQL, and experience or familiarity with one additional scripting languageStrong background in, or comfort with, statistical conceptsAbility to develop and manage an experimentation roadmapSteadfast focus on the details, while keeping strategic priorities top-of-mindResponsible and reliable to the people you work with - this is a team effort!Growth mindset: you seek out learning opportunities for yourself and the teamEffective communication skills: you can build the story and then tell it just as wellProject management savvy: you expect best from your peers to get joint projects done wellSeize opportunities and willing to go beyond the task at handRadiate positivity and possess a can-do attitudeResponsiveness: you deliver timely, digestible answers to complex asksConstantly think of ways to improve our products and the businessBird Rides Inc. is an equal employment opportunity employer, and we welcome everyone regardless of their race, color, religion, sex, national origin, age, disability, veteran status or genetics. We are dedicated to providing an inclusive, open, and diverse work environment."}