{"jobID": "2614788106", "jobLocation": "Beverly_MA", "jobTitle": "Financial Reporting and Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.yesway.com", "Headquarters": "West Des Moines, IA", "Size": "201 to 500 employees", "Founded": " 2014", "Type": " Company - Public", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Yesway, an affiliate of Brookwood Financial Partners, LLC, is seeking an experienced Financial Reporting Analyst to join our growing team. Yesway plans to assemble a portfolio of 400 to 600 gas stations in selected regions of the United States. In this role, the individual support both internal and external financial reporting of the Company. The successful candidate will be responsible for conducting detailed analysis of revenue, product margins, expenses and overhead. The position will be based our of our Beverly, MA headquarters.Position Responsibilities:Analyzes financial results by collecting, monitoring, and studying data; recommending actions;Regularly prepares budget-to-actual variance analysis for review and dissemination to senior management;Works with Operations and Finance to develop or modify reports based on changing business needs;Prepares monthly and quarterly lender reporting schedules and analysis;Guides cost analysis process by establishing and enforcing policies and procedures; providing trends and forecasts; explaining processes and techniques; recommending actions;Improves financial status by analyzing results; monitoring variances; identifying trends; recommending actions to management;Reconciles transactions by comparing and correcting data;Recommends actions by analyzing and interpreting data and making comparative analyses; andResearches industry trends and best practices; makes recommendations for enhanced reporting.Requirements:Bachelor's degree in business, accounting, finance, economics or related field;Experience analyzing from a large pool of data and the ability to manage large volumes of transactions;Demonstrated strong analytical skills and attention to detail;Excellent interpersonal, verbal and written communication skills;Ability to manage multiple tasks and meet demanding deadlines;Advanced knowledge of Microsoft Excel. (Index-Match, Indirect, Offset, SUMIFS, SUMPRODUCT, Array Formulas, VBA);Excellent problem solving skills and self-motivated learning abilities; andExperience with T-SQL and SSRS.Preferred Skills:Intermediate to advanced knowledge of an object-oriented programming language (Python, Java, C++);Experience with a data-focused programming language (R, Python, SAS);Experience with machine-learning techniques;Experience building advanced financial models and Monte-Carlo simulations; andStrong statistics background (specifically in generalized linear modeling)."}