{"jobID": "2665491290", "jobLocation": "Austin_TX", "jobTitle": "Nokia IoT IMPACT platform summer intern", "companyRating": null, "companyInfo": {"Website": "www.nokia.com", "Headquarters": "Nokia, Finland", "Size": "10000+ employees", "Founded": " 1865", "Type": " Company - Public (NOK) ", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " Ericsson-Worldwide, Huawei Technologies, Microsoft"}, "estimatedSalary": null, "jobDescription": "Nokia is a global leader in the technologies that connect people and things. With state-of-the-art software, hardware and services for any type of network, Nokia is uniquely positioned to help communication service providers, governments, and large enterprises deliver on the promise of 5G, the Cloud and the Internet of Things. Serving customers in over 100 countries, our research scientists and engineers continue to invent and accelerate new technologies that will increasingly transform the way people and things communicate and connect.  Nokia Application & Analytics Digital Experience group is looking for student intern for the IoT / IMPACT platform.The co-op's responsibilities include, but are not limited to: Write Java, Python or C code to create a prototype software for IoT/M2M device data collection, processing and analytics.Configure device modules such as Raspberry Pi, run IoT software on them to communicate with the Nokia’s IoT platform IMPACT for device management, data collection & analytics.Coordinate with product architect and product manager to design and implement prototypes.Must be proficient with the following: JavaPythonEclipse or equivalent development environmentWorking with MakefilesGithub and Source Code Control conceptsHands on experience with Linux and Windows platformsBe able to work out of the Austin, TX office Desired skills: Web application knowledgeGithub, Apache MavenAmazon Webservices (AWS) or equivalent cloud platformKnowledge on Apache, TomcatProgramming in C or C++Must be actively enrolled in a Bachelor degree program or higher in computer science or related field (software engineering, computer engineering, etc.)Have a GPA of 3. 0 or higher"}