{"jobID": "2750472966", "jobLocation": "Weehawken_NJ", "jobTitle": "Asset Management Data IT Lead", "companyRating": "3.5", "companyInfo": {"Website": "www.ubs.com", "Headquarters": "Zurich, Switzerland", "Size": "10000+ employees", "Founded": " 1862", "Type": " Company - Public (UBS) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Deutsche Bank, Credit Suisse, Morgan Stanley"}, "estimatedSalary": "79000", "jobDescription": "Your RoleUBS Asset Management's growth strategy requires a highly scalable, robust global operating platform for high operational effectiveness and efficiency, streamlined platform and low organizational complexity, ability to grow top line without linear cost growth, and fully align investment with strategic growth priorities. In order to achieve this goal, Asset Management is renovating its middle-office and back-office technology stack, decommissioning 54 applications over 3-4 years, and implementing a global unified operating model around SimCorp product suite. AM Data Program creates a competitive advantage for UBS Asset Management through data and analytics. Current AM data architecture is highly fragmented and does not satisfy divisional needs . Dynamic nature of AM business driven by internal and external drivers has led to many regional and functional solutions leading to lack of trusted data. The objective of AM Data initiative is to drive common set of data governance principles, processes & tools to improve data integrity, quality, governance & availability. Key initiatives launched in 2016   Products & Mandates onboarding (US)   Market Data & Security Master   Data Governance  In addition, there are several initiatives in various stages of planning and rollout:   Transform our front office, back office, data management, and client platforms from regional to global.   Deliver new mobile capabilities to enable business agility and extend business reach.   Empower businesses to increase insights by standing up an enterprise analytics and business intelligence (BI) platform.   Advance data governance to boost global business competitiveness.  The Application Delivery organization is in need of a seasoned Sr. Development Manager for AM Data program, facing off to the Chief Data Office within AM. A successful candidate must have 4 core strengths: Strong technical skills with ability to design, architect, and get into low-level implementation details. Candidate must demonstrate this through experience in implementing large scale, complex, data-centric programs/initiatives in a technical role.Deep business understanding of Asset Management domain, specifically buy-side related data challenges front-to-back (e.g. custom benchmarks, pricing hierarchies, fund structures, etc.)Partnering with senior business stakeholders from vision-to-execution and leveraging soft skills to navigate across organizational unit boundaries towards successful deliveryProven leadership experience in building and leading a strong technical team of engineers and demonstrable experience in leveraging agile and automation best practicesResponsibilities include:Managing overall plan, quality, delivery and costs of the AM Data initiatives.  Gain and utilize deep understanding of investment business flows and how the business wins to increase productivity by transforming current business models with innovative technology.   Become a valued partner with business stakeholders by anticipating and proposing alternative solutions to help business extend their reach.   Manage and lead a team of developers, business analysts, and testers to provide end-to-end design, delivery and maintenance of applications and solutions.   Develop and manage platform budget and resourcing requirements.   Manage the platform in line with the bank’s policies and architecture standards to ensure technology risks are understood, communicated, and effectively mitigated.   Integrate an effective DevOps model that effectively supports all investment platforms.   Champion development methodology trends and emerging technologies.Your teamYou will be working for Group Technology out of our Weehawken, NJ Office. You will report to Capability Head, Investment Administration & Data, Asset Management IT. On the Data program, you will serve as a Deputy for the Capability Head.Your experience and skillsYou have: 15+ years of IT delivery / development management experience in a financial services organization10+ years' experience managing large scale IT change program related application delivery (30+ people)5+ years' experience managing complex projects and programs in asset management domainstrong understanding of software development lfecycle (SDLC)extensive leadership, strategic and execution level experience combined with a strong record of delivering results and impactstrong negotiating, influencing and change management skillsexcellent communication and presentation skillsWhat we offer"}