{"jobID": "2670266272", "jobLocation": "Seattle_WA", "jobTitle": "Data Scientist I (Hotwire", "companyRating": "3.9", "companyInfo": {"Website": "www.lifeatexpedia.com", "Headquarters": "Bellevue, WA", "Size": "10000+ employees", "Founded": " 1996", "Type": " Company - Public (EXPE) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Priceline.com, Booking.com, Kayak.com"}, "estimatedSalary": "140000", "jobDescription": " HotwireAbout Hotwire: Launched in 2000 in San Francisco, Hotwire is one of the earliest innovators in the online travel arena. Just a few years later in 2003 we joined the Expedia Group family of brands that includes Hotels.com, HomeAway, Travelocity and more.  Our roots are in California, but we also have offices in Seattle along with an important and fast-growing product and technology presence in Gurgaon, India. Hotwire has the energy and pace of a startup, plus the stability and backing of the incredible Expedia family of companies. Hotwire’s culture centers around delivering value to customers and supply partners by being passionate about building great products with the latest and greatest technologies available. We pride ourselves on our organizational transparency, a bias for action and a customer centric approach to everything we do. About the team: Our Data Science team is a strategic group responsible for identifying and driving significant revenue growth across all Hotwire products. This team and position offer an unparalleled opportunity to get exposure to multiple areas of the business and have significant impact. The team innovates on sorting, pricing and marketing analytics for different Hotwire products such as Hotel and Car.  We work closely with other functions – marketing, product development, finance, business intelligence, and customer operations – with the expressed goal of using advanced analytics to make informed decisions and drive performance. As a Data Scientist, you will be responsible for maximizing Hotwire’s profitability through pricing and sorting optimization, designing and executing monetization strategies for Hotel and Car product.  Do you want to make an impact? Would you like to see your work affect people's travel choices in real time? Are you passionate and dedicated to the mission?  If you thrive in environments that are dynamic, action oriented, data driven and relish in conquering diverse challenges every single day, joining Hotwire is likely to be the most rewarding opportunity of your career. So-- what are you waiting for? Come join a household name brand that lives at the exciting intersection of technology and travel. Your Responsibilities:You develop consumer and pricing insights from sophisticated data-driven analysis that result in specific action plans.You provide our management team with critical market and/or trend information; needed to make strategic decisions.You contribute significantly to pricing and sort from end-to-end, including all aspects of analytics, test design and execution.You work closely with our Product Managers, other Data Scientists and Engineers to design and execute site-wide monetization initiatives.You contribute to the development and evolution of analytical models establishing objectives, key metrics, and test plans.You manage cross-functional ad hoc research requests.Qualifications and Skills:Master’s degree in a quantitative discipline (Computer Science, Machine Learning, Operations Research, Industrial Engineering, Statistics, Applied Mathematics, etc.), PhDs preferred.Professional experience or relevant course work in analytics and data mining, with focus on segmentation strategies and predictive models.Experience working in e-commerce, with focus on supply/demand dynamics, price elasticity, customer’s behavior, and competitive strategies are a plus.Proven programming skills in Python with 1+ years hands-on coding experience.Strong business sense and logical skills to balance a data driven decision process with intuition.Desire and capacity to learn, develop, and lead.Ability to understand complex systems. #LI-BFExpedia is committed to creating an inclusive work environment with a diverse workforce. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. This employer participates in E-Verify. The employer will provide the Social Security Administration (SSA) and, if necessary, the Department of Homeland Security (DHS) with information from each new employee's I-9 to confirm work authorization."}