{"jobID": "2686908067", "jobLocation": "Waltham_MA", "jobTitle": "Sales Operations Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.axelon.com", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Sales Operations Data Analyst  Waltham, MA  3 Months  Job description: Seeking a talented data jockey with superior excel skills to help us through a transitionary period as we build our team while enhancing data visibility and reporting. The candidate must have been in an operational reporting role in the past and have the ability to work across finance and sales. Demonstrated experience in working in a fast paced environment in which they are responsible for several concurrent tasks, with a keen ability to multitask and solve problems quickly. Attention to detail and ability to meet and beat deadlines are a must. The analyst must also be proficient with basic computer software.   Sales Operations Analyst Tasks Support the forecasting & financial reconciliation process; summarizing weekly and monthly results.Produce monthly report package summarizing top level results; through the use of SalesLogix & NetSuite CRM systems, Qlikview reporting, and other platforms.Assist in Ad-hoc reporting and analysis; liaise with other teams, channeling information to the appropriate parties.Performing quality assurance & data integrity checks prior to end user delivery.Support other Sales Operations team projects related to sales planning, forecasting, reporting, or territory optimization as needed  Experience Bachelor's degree in Finance, Business Administration or related field8+ years of experience in an analytical role, with prior experience in an operations environment.Experience working in an extracting data from CRM system (Salesforce, SalesLogix, SugarCRM, NetSuite etc)Proficient knowledge in at least one BI tool(Qlikview, Tableau or Cognos)Strong communication skills, with the poise to work and communicate effectively with peers, with front-line sales reps, and with sales and corporate leadership.Deep analytical and intellectual curiosity and a data-driven approach to problem solving."}