{"jobID": "2804213928", "jobLocation": "San_Jose_CA", "jobTitle": "Sr. Manager, Supplier Quality Assurance", "companyRating": "4.6", "companyInfo": {"Website": "www.outsetmedical.com", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " NxStage, Baxter, Intuitive Surgical"}, "estimatedSalary": "160000", "jobDescription": "Company Overview Outset is a pioneering medical technology company that puts the patient before the machine. Our human-centered model is designed to dramatically improve not only the care experience – for patients, families, providers and physicians alike – but also cost-efficiency of dialysis delivery. We believe in introducing technology innovation in order to drive service model innovation. And in doing so, we intend to profoundly and permanently impact what, where and who can dialyze. Position Overview Responsible for delivering all aspects of the Supplier Operations Quality Assurance function on an on-going basis in line with the Quality Management System and Quality Policy to ensure that the business’ products and services are fit for purpose and meet customer expectations. Responsible for ensuring that suppliers continue to develop and implement best practice that emphasize defect prevention, reduction in variation and waste and provide for continuous improvements and continue to meet quality standards required to minimize quality costs and maximize customer satisfaction whilst ensuring that procedures and processes are adhered to. Responsible for providing leadership, outstanding people skills and management to a team of Supplier Quality Engineers. The incumbent for this position will support additional activities as assigned. Essential Job Functions:Lead supplier development strategy, designing the metrics for the function and supplier performance.Carry out supplier validation audits, with supplier support and supplier advanced product quality planning.Work with Engineering (Design and Manufacturing Engineers) team to define process parameters and criteria to ensure supplier process capability is effective to meet product and process requirements.Support Purchasing with the supplier approval process by assessing manufacturing/technology capabilities.Support new product launches to ensure suppliers are capable of delivering to the required quality standards.Manage the root cause analysis and corrective actions process of supplier quality issuesPerform on-site supplier visits for root cause analysis and verification of corrective actions of supplier quality issues.Review and evaluate supplier quality data to identify process improvement opportunities within the supply chain.Where appropriate work with the supplier directly, create corrective action plans to address process failures.Review supplier manufacturing processes, collaborate with suppliers on process improvement and value enhancement opportunities. Promote the use of customer preferred techniques for continuous improvement such as Lean, Six-Sigma, Poka-Yoke (Error Proofing), Measurement System Analysis and FMEA (Failure Mode and Effects Analysis).Manage the Supplier Key Performance Indicators (KPIs).Stay current and up to date on any changes that may affect the supply and demand of needed products and materials and advise others of any impact.Input and hold responsibility for Supplier Quality budgets.Responsible for achieving budget and forecast.Prepare the annual Supplier Quality budget and forecasts.Develop and maintain strong relationships with internal and external stakeholders to ensure optimal performance.Work collaboratively, negotiate and engage with key stakeholders to facilitate delivery and compliance with the purchasing strategy.Excellent interpersonal skills.A self-starter, motivated and able to positively motivate others.Focused, target driven with a positive, can-do attitude.People Management:Manage, coach and develop a high performing Supplier Quality team that meets agreed objectives and which delivers best practice results, added value and continuous improvements.Provide leadership, direction, management and development to the Supplier Engineering team.Set department objectives/KPIs and review and assess ongoing performance of direct reports.Report on achievement of targets and identify any actions required.Manage and lead the team.Motivate and coach the team to operational success.Requirements/Qualifications:Bachelor’s degree in Engineering or Science (or similar).Minimum of 10+ years of hands on experience with increasing Quality Assurance responsibilities or similar field. Prior experiences in the medical device field is required, preferably experience with Capital Equipment medical devices.Thorough knowledge of FDA Quality System requirements, ISO 13485:2003 (Quality System) requirements, ISO 14971 (Risk Management) requirements, Medical Device Directives (MDD) requirements, Knowledge of Good Manufacturing Practices (GMP) and applicable Quality System Standards.Ability to work effectively in a fast paced and dynamic environment.Leadership and interpersonal skills to develop and manage good working relationships with internal departments (manufacturing, receiving, purchasing, product development, and regulatory), contractors, and suppliers; strong written and verbal communication skills. You are part of an organization that attracts and hires the best talent on the planet! You will be working with a great team of dedicated, friendly and knowledgeable individuals, developing novel and game changing product(s). We are dedicated to the development and growth of our Teammates.  In return, we offer you an opportunity to become a highly influential teammate who can build and support a first class Quality Engineering function by providing intelligence, discipline, problem solving and collaborative skills that can improve designs and processes.   "}