{"jobID": "2830945186", "jobLocation": "San_Jose_CA", "jobTitle": "Data Analyst/Engineer", "companyRating": null, "companyInfo": {"Website": "www.accusource-online.com", "Headquarters": "Corona, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Role: Data Analyst Lead Data Analyst/EngineerWork Location: San Jose, CADuration : 6-12MonthsJOB DESCRIPTION MS in Computer Science or equivalent with statistics covered in the discipline with a focus on Machine Learning/AI learning or related areas with at least 3 years of experience  Connect disparate data sets across the client to analyze and understand every customer interaction to develop insights and associated actions to improve top/bottom line  Understanding of technology & data schemas in Oracle, SFDC and other new data sources  Strong background in two or more of the following areas: machine learning/AI algorithms, computations/statistical learning theory, scalable systems (e.g. Spark, Hadoop), large scale data analysis, optimization, functional analysis and deep learning.  A demonstrable track record of developing novel algorithms, solutions and delivered/deployed projects in the area preferred.  Experience in deep learning frameworks (e.g., Tensorflow, MxNet, Caffe, Torch, Theano, Keras, etc.), and Large-scale optimization preferred.  Hands on coding experience in Python, Java & R  A sense of ambition and passion to change the world using AI and machine Learning  Experience in creating insights by combining large disparate data sets, such as Telemetry, customer transactions, customer sentiments etc. and application of AI/Machine learning in the context of these domains  The ability to understand and accelerate the use of new data formats  The ability to proactively build upon / identify new business use cases using data analysis  business analytics and impact of data genealogy on analytics  Thanks and Regards,ObjectWin Technology, Inc.Santhosh Kumar D, Senior RecruiterPhone: 832 497 2118| Email:santosh.k@objectwin.comGlobal Workforce Solutions | Contingent Staffing | SOW Services | IT Consulting | Certified HUB & MBE Company  19219 Katy Freeway, Suite 275, Houston, TX 77094 | Main: (713)-782-8200 | Fax: (713)-782-8283www.objectwin.com"}