{"jobID": "2817500112", "jobLocation": "Quincy_MA", "jobTitle": "Market Data Analyst, Officer", "companyRating": "3.0", "companyInfo": {"Website": "www.ssga.com", "Headquarters": "Boston, MA", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Subsidiary or Business Segment", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " BlackRock, Fidelity Investments, Vanguard"}, "estimatedSalary": "53000", "jobDescription": " Under direction of the Market Data Services /OFS Business Solutions Section lead, this role is in support of all sections: Pricing, Reference, Index Data, Desktops/Exchanges, Outsourced Financial Services and Account Management. This role requires a technically inclined person with the ability to multitask and drive projects and tasks to completion with minimal direction. The role also requires strong data analysis and data presentation skills. RESPONSIBILITIESSupport the systems and processes related to the proactive management of market dataPerform quality control and monthly cycle close functionsBusiness analysisData and spend analysisData/spend presentation skillsProvide creative solutionsProject managementDrive small and large scale projects to completion in support of the department's strategic plansLiaise with business unit stakeholders on spend inquiries and provide analysis of spend fluctuationsCreate and maintain documented procedures and policiesCoordinate and lead assigned projects and associated testingCreate and maintain test plansLead assigned projectsEXPERIENCE&SKILLS;Expert user of Microsoft Excel, including Pivot tables, VLOOKUP, and macro creationStrong Power Point SkillsTableau or other reporting application experienceMicrosoft Access experience is preferredFITS knowledge is highly desirableProject management experience a plusManages and meets defined deadlinesProactively provides status on active projects and initiativesCollaborates effectively across the MDS/OFS teams as well across the organizationProbes and listens carefullyPresents information clearly and in appropriate style, makes technical information clear, persuades others in straightforward situationsInnovative thinker"}