{"jobID": "2733605503", "jobLocation": "Los_Angeles_CA", "jobTitle": "PAID INTERNSHIP: Research Intern", "companyRating": null, "companyInfo": {"Website": "www.foundanimals.org", "Headquarters": "Los Angeles, CA", "Size": "1 to 50 employees", "Founded": " 2005", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Organization Overview:  The Michelson Found Animals Foundation is a cutting edge non-profit organization managed by savvy business and science professionals focused on social entrepreneurship. We are a well-funded startup organization that takes pride in bringing together great minds from diverse backgrounds in our mission to reduce shelter euthanasia in Los Angeles. Our culture and work environment sets us apart from traditional non-profit startups and inspires our talented team to create innovative ideas and solutions to complex programs and initiatives. Our animal-friendly, creative office suites are located on the west side of Los Angeles.Internship Program Overview:  Under general supervision of the Senior Manager of the Registry Program, as the Research Intern you will be working on a variety of projects as a key part of the overall effort to enhance the organizations resources, reputation, and relationships with various software companies in the animal welfare community and pet business industry. This Research Intern position is a paid position with a non-profit organization. Responsibilities include but are not limited to: Identify potential software partnerships with shelter management software companiesFollow up on contacts and support cultivation of relationships with software partners and affiliatesConduct research and develop a list of all shelter management software optionsResearch and identify potential new, not-yet released shelter softwareDeveloping speaking and white paper topics, conducting research and possibly drafting speechesRequirements:Current College StudentAttention to detailExcellent research and written communication skillsSelf-starter, well-organized, and able to work independentlyExperience with Excel and Google Drive, Oracle is a plusInterest in non-profit administration"}