{"jobID": "2811716572", "jobLocation": "Santa_Clara_CA", "jobTitle": "Senior Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "115000", "jobDescription": "Senior Data Analyst Job Number: 113818818Santa Clara Valley, California, United StatesPosted: Jun. 21, 2018Weekly Hours: 40.00 Job SummaryWe’re perfectionists. Idealists. Inventors. Forever tinkering with products and processes, always on the lookout for better. Whether you work at our global offices, offsite, or even at home, a job at Apple will be demanding. But it also rewards bright, original thinking and hard work. And none of us here would have it any other way.  The Integrated Customer Experience (ICE) team is responsible for ensuring that customers have the best possible experience anywhere Apple products are sold across our channel retail partners. We ensure that customer experience combined with physical (display and merchandising), emotional (selling experience) and virtual (digital touch points) always represent the Apple's values.  We are seeking a Senior Business Analyst to identify, assemble, and analyze data generated from these experiences to present a holistic view and insights that drive the US business. You will support each Sales team to build and execute strategic account plans, including incentive programs, storefront quality analysis, employee behavior research, POS management, new product categories, business development and new channel development.  You will partner with key partners across Apple such as the WW Business Insights Team, People Programs & Training, Finance, and Sales teams to design, refine, and build innovative analytical and reporting solutions. This will include integrating and analyzing large, complex data sources, deriving actionable insights, and bringing our data to life via innovative visualizations and story telling.  Your talent in crafting and analyzing field surveys will provide substantial insights into how our sales teams and our partners deliver on the promise of an “Apple” experience.  Are you self-motived, skilled in a broad set of analytical tools, with a strong real passion for data and effective visualization techniques?  Do you have the ability to adapt and learn quickly, provide results with limited direction, and communicate complex results effectively to all levels?Key Qualifications You have 10+ years of developing strategy, analytics and/or business development with sales teamsYour advanced Excel, Advanced SQL, and experience in MySQL and/or Teradata with exposure to statistical methodologies are daily tools you useYour familiarity with decision tools will aid in delivering new, intuitive, dashboards and reporting.You have confirmed survey writing and analysis skillsData management and governance in working with large data setsCan you thrive with little direction in an ambiguous work environment while maintaining tact and a positive attitude?Real passion for data visualization (proficiency in Tableau preferred)Shown success in analyzing business trends and formulating recommendations, flexible and able to pivot as neededAbility to initiate, refine, and complete projects with limited guidance and directionDeep knowledge and experience with SAS, R, Python, Alteryx or Maestro a plusYou have experience demonstrating resilience, resourcefulness and flexibility in the midst of ambiguity therefore impacting changeYou problem solve creatively to complete complex assignments DescriptionPlan and drive strategic sales programs and initiatives not limited to: Staff Behavior Research (Mystery Shop); Reseller Back Margin Program; Reseller Engagement; Reseller Digital channel strategy  Design and implement analytics and reporting tools to support key decisions on a wide variety of topics including product launches, customer experience (Mystery Shop & NPS), future expansion, store relocations, and operational performance  Partner with cross-functional teams to identify, frame, prioritize, and answer business questions  Quickly outline and build customized analyses for leadership  Perform all aspects of analysis including creation of queries, data acquisition and manipulation, results visualization, story telling and documentation, and presentation  Drive the development of tools to improve team efficiency and productivity  Support key forecasting efforts in support of sales, training, and worldwide operationsEducationMinimum bachelor’s degree, in economics, statistics, computer science, or related quantitative field"}