{"jobID": "2632271498", "jobLocation": "San_Jose_CA", "jobTitle": "Bay Area Internal Audit & Financial Advisory Senior Consultant", "companyRating": "3.8", "companyInfo": {"Website": "www.protiviti.com", "Headquarters": "Menlo Park, CA", "Size": "1001 to 5000 employees", "Founded": " 2002", "Type": " Company - Public", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Deloitte, Accenture, Huron Consulting Group"}, "estimatedSalary": "89000", "jobDescription": " At Protiviti, we believe that a career is about more than just working, providing deliverables, and being compensated for your efforts. A Protiviti Career is about opportunities to lead, learn, grow, and make a difference.  We strive to recruit and hire the best talent. But it doesn't stop there. Once you join us, we build your career through exceptional work experiences, a culture focused on learning and development, and a commitment to the things that matter to you. Are you inspired to make a difference?You've come to the right place.JOB REQUISITION Bay Area Internal Audit & Financial Advisory Senior Consultant LOCATIONSAN FRANCISCOADDITIONAL LOCATIONSAN JOSEJOB DESCRIPTIONThe following statements are intended to describe the general nature and level of work being performed. This is not intended to be construed as an exhaustive list of all responsibilities, duties and skills required of team members.The Senior Consultant is responsible for:Direct supervision of Consultants, serving as both a role model and trainer in helping them to develop technical and professional competency.Planning, scoping, developing, and leading projects, including developing work plans that comply with Protiviti policies and methodologies.Leading interviews with process owners to understand current state systems, processes, and/or controls and assessing risk with minimal oversight and supervision.Evaluating design and operating effectiveness of in-scope audit areas, including efficiency, effectiveness, and mitigating controls, and procedures to remediate gaps.Preparing audit reports on findings and recommendations to senior management.Reviewing deliverables, audit work papers, and other supporting process documentation for quality.Communicating strengths and weaknesses to the client or internal project management team and developing effective solutions.Performing job administration responsibilities, including status reports, budget to actuals, and peer evaluations for consulting staff.Ensuring timely completion of assigned project phases within a provided budget.Exhibiting strong ethical behavior and strong morals.Developing and maintaining effective client relationships.EDUCATIONAL & PROFESSIONAL CREDENTIALSBachelor’s degree in relevant discipline (e.g. Accounting, Finance, Information Technology or Business Related Field) required.3+ years in internal audit, consulting, assurance services, or related field, either in professional services or industry.Professional Certification such as CPA, CIA CISA, or similar strongly preferred.REQUIRED KNOWLEDGE & SKILLSDemonstrated project management, supervisory, leadership, and mentoring experience.Ability to quickly learn new concepts and skills.Excellent interpersonal skills to interact in team environment and foster client relationships.Strong analytical and problem-solving skills.Advanced verbal and written communication skills including documentation of findings and recommendations.Strong listening skills to discern the best course of action for our clients.REQUIRED TECHNICAL KNOWLEDGE & SKILLSAn advanced skill base in internal auditing.Strong understanding of current accounting (GAAP) and auditing (GAAS) principles.Understanding of commonly used internal control concepts, including COSO and COBIT.Knowledge of auditing processes and methodologies, including developing process flows.Knowledge of Sarbanes-Oxley Act provisions and methodologies for achieving compliance.Proficient in Microsoft Office suite applications with specific emphasis on Word, Excel and PowerPoint. Secondary emphasis on Visio and Access.ABILITY TO TRAVELTravel throughout the month frequently required based upon client requests/commitments. Travel may include suburban, regional, or out of state locations.EEOProtiviti is not licensed or registered as a public accounting firm and does not issue opinions on financial statements or offer attestation services. For all US & Canada Postings: You may submit your application materials online or call 1.888.556.7420 for additional ways to apply. Protiviti is an Equal Opportunity Employer. M/F/Disability/Veteran For positions located in San Francisco, CA: Protiviti will consider qualified applicants with criminal histories in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance. For positions located in Los Angeles, CA: Robert Half will consider for employment qualified Applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring. JOB LOCATIONCA PRO SAN FRANCISCO"}