{"jobID": "2828654363", "jobLocation": "New_York_NY", "jobTitle": "Coordinator - Inventory Control (TEMP)", "companyRating": null, "companyInfo": {"Website": "www.christies.com", "Headquarters": "London, United Kingdom", "Size": "1001 to 5000 employees", "Founded": " 1766", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "COORDINATOR - INVENTORY CONTROL (TEMP)The CompanyChristie’s, the world’s largest Art Business, is an incredibly exciting & enriching place to start or continue your career. Whether you work within one of our Specialist Art Departments or in our more Operational focused teams we are all working together with one common goal in mind: to continue the success of this 250 year old company, steeped in history, bringing constant innovation whilst not forgetting our age old values; Passionate Expertise, Exceptional Client Service, Teamwork, Integrity, Business Judgement & Innovation. Colleagues across all departments are truly passionate about what they do and it is constantly inspiring to work with industry leaders across all segments of the business.The RoleThe purpose of the Inventory Control Coordinator role is to facilitate the clearance of aged Inventory from Christie’s warehouses. The Inventory Control Coordinator will follow the Inventory Control procedures to ensure Inventory is cleared in adherence to US law, tax regulations & Christie’s policies.The Inventory Control Coordinator represents Christie’s to clients, embodying the business’ core values and upholding our Client Service Standards. Their primary focus will be to communicate with Christie’s clients via telephone and email, so the person in this role should be driven to perform exceptional levels of client service.Specific duties & responsibilities will include but are not limited toFollow Inventory Control process to contact clients regarding items marked for clearanceStrong ability to address any client queries and escalate issues as appropriateLiaise with key stakeholders within the business to coordinate collection of itemsLiaise with Specialist departments to confirm re-valuation sessions for items marked for clearance and arrange movement of stock accordinglyWork closely with Post Sale Service and/or Client Service to arrange payment for any unsettled charges and complex client queries outside of clearance processUpdate Christie’s client system (COS) with results of client contact and update CTLKeep detailed & accurate statistics on client contact & other tasks involved in the project, whilst providing regular reports to line managerComply at all times with Christie’s policies on data protection & client confidentialityComply at all times with Christie’s client service standardsOther tasks & projects as assigned by line managerThe CandidateAt least 2 years’ experience of customer serviceAbility to reflect the image and standards of Christie’s in all situations in accordance with Client Service StandardsExcellent verbal and written presentation skillsExcellent IT Skills (excel, word and PowerPoint). A good understanding of Christie’s systems desirable but not essentialAbility to work professionally and responsibly with all other areas within the businessHigh degree of organisation skills with ability to multi-task, prioritise, and follow up promptlyAbility to work to tight deadlinesFollow us on Instagram @ChristiescareersClosing Date; Sunday, July 8th"}