{"jobID": "2802087626", "jobLocation": "San_Francisco_CA", "jobTitle": "IT Audit Manager", "companyRating": "4.0", "companyInfo": {"Website": "www.frankrimerman.com", "Headquarters": "Palo Alto, CA", "Size": "201 to 500 employees", "Founded": " 1949", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "110000", "jobDescription": " Requisition Number 18-0011 Title IT Audit Manager City San Francisco State CA Description Job Summary  The IT Audit Manager role is responsible for managing multiple IT Audit, Assurance and Consulting teams and client assignments of moderate complexity and variety, delivering at a high level of quality service. This includes coaching, advising and supporting  team members in meeting client and self-development expectations. The IT Audit Manager will own the account planning process for the clients ensuring high quality delivery within the project budget. They will report to and work closely with Senior Management  in the Assurance group. This role will require a tactical level of experience to drive IT compliance efforts; including but not limited to: ISO 27001/2 surveillance and certification audits.Service Organization Controls (SOC) audits for the SOC 1, SOC 2, SOC 3 reports.SOX IT and project-based IT compliance. Typical IT Audit Manager responsibilities on a client engagement include: Proactively plan and be accountable for client engagements with time and schedule consideration for other jobs.Work with the team and the client to plan a project strategy, define the objectives, and address technology-related controls risks and issues.Conduct walkthroughs to gain understanding of operational and IT processes, provide management with an assessment of risks, internal controls design and the overall effectiveness and efficiency of the processes.Review and provide feed on the team’s workpapers to ensure audit objectives are addressed and controls are adequately tested.Supervise, train, and mentor seniors, associates and interns on projects. Ensure assigned work and responsibilities are achieved on time.Review drafts and final versions of the audit reports.Overseeing the engagement economics of the project that includes budget status tracking, billing, and collection analysis.Provide timely updates to supervisors regarding progress and issues that may impair successful completion of specific tasks and overall project.Works in consultation with the team and senior management to anticipate project issues, assesses alternatives and takes appropriate measure to resolve assignment issues.Additional responsibilities:Apply knowledge of IT trends and IT systems processes to identify engagement issues and risk management issues.Shares and transfers knowledge in the team.Advises, coaches and supports team members including providing consistent recognition and encouragement to team members to increase retention and utilization.Participate/lead strategic and tactical initiatives related to new product offerings and services.Develop and maintain relationships with clients and identify new opportunities for business.Identifies opportunities to improve profitability on the engagements and staff utilization.Actively pursues all required training as well as additional self-development opportunities in line with the competency model.Providing technical guidance to staff and client organization personnel with respect to information technology general controls.Consult, work with, and service client base to make recommendations on business and process improvement and serve as a business advisor to clients.QualificationsBachelor's degree required. Major in Computer Information Systems, or Management Information Systems or equivalent is preferred.Minimum 5 years of experience in the areas of IT audit, corporate IT Audit, or technology risk consulting preferred.Ability to work under pressure and prioritize multiple projectsStrong verbal and written communication skills are required.Candidate should have solid experience in planning engagements, managing IT audit projects, supervising personnel and developing audit work programs.Evaluating application and IT general controls across a variety of systems.Drafting reports and executive summaries on IT control issues for senior management personnel.Certified Information Systems Auditor (CISA).Must have access to transportation as this position requires 20% travel around the Bay Area."}