{"jobID": "2789324148", "jobLocation": "New_York_NY", "jobTitle": "Field Marketing Manager", "companyRating": null, "companyInfo": {"Website": "www.feedvisor.com", "Headquarters": "Tel Aviv-Yafo, Israel", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We're looking for a talented and passionate Field Marketing Manager capable of driving business through demand and lead generation using several marketing channels, including events, tactics like email and social media, paid advertising, and collateral. You will work closely with marketing and sales managers to build a successful, sustainable pipeline of leads and customers. In addition, we are looking for a self-starter and thought leader that can contribute to a strong, positive, and innovative design culture from within the small but growing team.Requirements:What you would be getting into... + Plan and host all aspects of offline events and conferences to deepen relationships with customers and attract local prospects  + Create detailed proposals for all events, including timelines, venues, vendors, staffing, and budgets  + Identify and secure speakers, special guests, and/or entertainment for each event  + Plan event layouts and agendas and coordinate with all internal and external stakeholders  + Provide excellent support of our attendees and guests  + Collaborate with marketing teammates to promote events and sell tickets and/or merchandise  + Analyze the success of each event and propose creative new improvements to the attendees experience  + Generate and optimize marketing touchpoints, including top-of-funnel channels like social media, middle-of-funnel channels like email nurturing, and bottom-of-funnel activities, including events  + Execute grassroots campaigns and events, such as attending meetups and industry events, in local markets You'd be a good fit if you... + BA/BS or equivalent working experience  + Great attention to detail and project management skills. This role requires balancing several initiatives together.  + Strong experience planning and executing local events  + Proven abilities in executing field marketing tactics  + Excellent communicator and creative thinker, with an ability to use data to inform all decisions  + Enjoy traveling (~25% of your time will be on the road) Our Culture At Feedvisor we care a great deal about our company culture. You will be a fit if:  + You are taking ownership  + You seek to understand the world through other peoples eyes  + You are constantly asking How can I help?  + You see opportunity in demanding situations  + You are trustful  + You are a proactive problem-solver who gets stuff done  + You are humble, radically candid, and open to feedback"}