{"jobID": "2807795900", "jobLocation": "Santa_Clara_CA", "jobTitle": "Principal Engineer, Applications", "companyRating": null, "companyInfo": {"Website": "www.inphi.com", "Headquarters": "Santa Clara, CA", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Public (IPHI) ", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Principal Applications Engineer, OpticsMarketing | Santa Clara, CA, United States We are looking for a talented Staff Optical Applications Engineer, Optics who will be responsible for product and customer support for Inphi’s next generation optical platforms. The position requires strong customer facing communications skills and technical lab experience. The successful candidate will report to the Sr. Director of Marketing.  In this role you will be responsible to provide technical solutions to customers regarding products/applications and provides hands on support, including pre-sales and post-sales.  ESSENTIAL DUTIES AND RESPONSIBILITIES: Proactively & efficiently support customer product qualification and design win activity with an emphasis on specification, quality, product performance and reliability requirements.Working jointly with product management, R&D; and product engineering to resolve technical issues during and after design in activities.Provide customer system design feedback and will collaborate with sales teams to gather and communicate customer’s needs to marketing and engineering.Will function as a center of technical excellence for Inphi optical platform: Write and maintain data sheets, application notes, technical articles/presentations and user guides.Broad knowledge of optical modules in order to handle analog, system hardware, firmware, and application software issues.Provide timely responses to customer questions and required to have exceptional technical skills to quickly troubleshoot and debug customer issues.Responsibilities will include taking bench/lab measurements and assisting customers with simulation models and design guidelines.Must be able to travel to international and US locations. SKILLS: BSEE with 8+ years of experience or MSEE Preferred with 5+ years of deep knowledge in high-speed optical communications from sub-components to DWDM systems.Familiar with 25Gb/s and above electrical and optical lab instruments including sampling scopes, real time scopes, network analyzers, I2C bus analyzers, spectrum analyzers, bit error rate testers, etc.Hands-on troubleshooting and debugging experience of electro-optical components that operate at speeds of 25Gb/s or higher.Have a deep understanding of optical transceiver function and design principles. Be capable of testing optical transceivers on customer system boards to troubleshoot technical issues.Understanding of standards, multi-source agreements and specifications (electrical and optical).Strong interpersonal skill to communicate with customers and various internal groups such as marketing, engineering, sales, and operationsStrong communication, presentation, and documentation skills"}