{"jobID": "2818867644", "jobLocation": "Redwood_City_CA", "jobTitle": "Community Program Analyst II-Emergency Medical Services (Open and Promotional)", "companyRating": "3.6", "companyInfo": {"Website": "www.smcgov.org", "Headquarters": "Redwood City, CA", "Size": "5001 to 10000 employees", "Founded": " 1856", "Type": " Government", "Industry": " Government", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "76000", "jobDescription": "Note: This recruitment schedule was amended on June 21,2018 to extend the Final Filing Date. This recruitment has been changed to \"Continuous.\" The County of San Mateo Health System is seeking a well-qualified individual for the position of Community Program Analyst II-Emergency Medical Servicesto provide program planning, technical assistance, review and evaluation functions to direct community/client service delivery programs; act as County liaison with contract service providers, community-based organizations, and funding sources; ensure compliance with program regulations and procedures; monitor contracts related to assigned program; and perform related work as required.  The current vacancy is in the Emergency Medical Services (EMS) Agency of the Health System, located at 801 Gateway Blvd., South San Francisco, CA, but will travel/drive to perform duties of the job. Primary Responsibilities Grant/contract management, tracking, monitoring and ensuring compliance; for grants such asPublic Health Emergency Preparedness (PHEP) and Hospital Preparedness Program (HPP) grants. Contribute to the development of the Public Health EmergencyPreparedness and Hospital Preparedness Program (HPP) Work Plan applications.Contribute to the development of the PHEP and HPP Grant Budget applications.Oversee and manage the annual PHEP and HPP Grant Work Plan activities and other responsibilities and reporting requirements for the PHEP and HPP Grants.Develop the Mid-Year and Year-End Progress Reports as required by the California Department of Public Health's Emergency Preparedness Office (CDPH-EPO).Attend/Participate and represent the San Mateo County EMS Agency on all State HPP grant-related Workshops, conference calls, meetings and trainings.Conduct the annual Health and Human Services-Assistant Secretary for Preparedness and Response (HHS-ASPR) Coalition Surge Test (CST) and report deliverables to HHS-ASPR.Plan and conduct the annual Statewide Medical & Health Exercise (SWMHE). San Mateo County Healthcare Coalition (SMCHC) Acts as Liaison for the SMCHC to local, regional, state and national stakeholders.Plan, convene, follow-up and lead monthly Coalition meetings including agendas, minutes, materials, action items, etc.Maintain existing Coalition membership partnerships and interests and recruit additional Coalition members from existing healthcare facilities and other stakeholders.Oversee and ensure SMCHC meets all federal and state requirements of Coalitions including plans, performance measurements, exercises, activities et. al.Provide assistance, resources, subject matter experts and other tools to Coalition membership pertaining to The Joint Commission (TJC)and Centers for Medicare& Medicaid Services(CMS) rules regarding disaster preparedness, planning, mitigation, response and recovery.Actively participate and contribute to regional and state Healthcare Coalition Coordinators(HCC) meetings.Develops, conducts, and tracks polling drills and real events (e.g., Mass Casualty Incident, Immediate Bed Polling, and Long Term Care).Additional primary responsibilities:Assist interns with exercise designs, grant applications and management, and updated policies and plans.Create and update plans and procedures.Participate in local, regional, and sometimes federal and state meetings, webinars, conference calls, workshops, conferences, and other engagements in Emergency Support Function (ESF) 8: Public Health and Medical.Participate in Health Emergency Preparedness (HEP), EMS, Health and County activities including employee engagement, all staff meetings, internal committees, etc.County of San MateoCo-Administrator of ReddiNet including trainings, inquiries, polling, instructions, messaging, tracking, etc.Participation in the 24/7 EMS Duty Officer Program.The ideal candidate will possess:Strong experience with creating and managing grant applications/ budgets.Strong experience managing a coalition/committee, including development, maintenance, oversight, recruitment, and short and long term strategic planning.Experience in carrying out Full Scale, Functional and Table Top exercise/events (e.g., development, management, execution, and evaluation).Strong facilitation, organizational, research and presentation skills.Ability to work well with multiple stakeholders in politically sensitive environments.Ability to work well and multi-task under pressure/deadline with flexibility.Ability to tackle assignments with limited oversight.Ability to successfully act as liaison (e.g., representation, advocacy, spokesperson, etc.) to the County, the Health System, the County of San Mateo EMS Agency and the EMS-Health Emergency Preparedness in local, regional, and potentially state and federal meetings.Strong administrative skills in overseeing meetings (e.g., agendas, meetings, minutes, logistics, utilization of technology, etc.).Familiarization with The Joint Commission (TJC) and Centers for Medicaid and Medicare Services (CMS) regulations as they pertain to healthcare facility disaster preparedness, planning, mitigation, response and recovery.Excellent verbal and written communications skills.Master's Degree is preferred.NOTE: The eligible listgenerated from this recruitment may be used to fill future extra-help, term, unclassified,and regular classifiedvacancies. Qualifications:Education and Experience : Any combination of education and experience that would likely provide the required knowledge, skills and abilities is qualifying. A typical way to qualify is a Bachelor's degree in public or business administration, management or a related field and four years of professional level analytical, administrative and programmatic experience in a community-related setting, including some experience in contract monitoring. Knowledge of : Principles and practices of the specific program area to which assigned; principles and practices of program evaluation and planning; principles and practices of client service delivery; principles and practices of contract development, negotiation and monitoring; principles, practices and techniques of administrative and programmatic research, analysis and programming; applicable federal, state and local laws, rules and regulations and County and program policies and guidelines; computer applications related to the work; and office administrative practices and procedures, including records management and the operation of standard office equipment. Skill/Ability to : Monitor, analyze and evaluate program effectiveness; develop and evaluate proposals and negotiate contracts and agreements; develop, monitor and analyze budgets and program performance; compile and analyze data, draw sound conclusions and prepare and present effective reports; analyze, interpret and apply various regulations and requirements; develop and evaluate proposals and negotiate contracts and agreements; plan, coordinate and implement administrative and programmatic research and analysis; plan, coordinate and conduct special events and projects; establish and maintain effective working relationships with grantors, subcontractors, County staff, elected and appointed officials, the public and others; train staff in work procedures and provide technical and programmatic assistance to staff and subcontractors; communicate effectively, both orally and in writing; and exercise sound independent judgment within general policy and regulatory guidelines.  Application/Examination: Anyone may apply.Current San Mateo County and San Mateo County Superior Court employees with at least six months (1040 hours) of continuous service in a classified regular, probationary,SEIUorAFSCMErepresented extra-help/term position prior to the final filing date will receive five points added to their final passing score on this examination. Responses to the supplemental questions must be submitted in addition toour regular employment application form. A resume will not be accepted as a substitute for the required employment application and supplemental questionnaire. This is a continuous recruitment which may close at any time. The final filing date will be posted five days in advance on this job announcement. The examination process will consist of an application screening (weight: pass/fail) based on the candidates' application and responses to the supplemental questions.Candidates who pass the application screening will be invited to a panel interview(weight: 100%). Depending on the number of applicants, an application appraisal of education and experience may be used in place of other examinations or further evaluation of work experience may be conducted to group applicants by level of qualification . All applicants who meet the minimum qualifications are not guaranteed advancement through any subsequent phase of the examination. All examinations will be given in San Mateo County, California and applicants must participate at their own expense. IMPORTANT:Applications for this position will only be accepted online.If you are currently on the County's website, you may click the\"Apply Online\"button above or below. If you are not on the County's website, please go tohttp://jobs.smcgov.org/to apply.Online applications must be received by the Human Resources Department before midnight on the final filing date.Apply immediately. This recruitment is open on a continuous basis and selections may be made at any time within the process.~ TENTATIVE RECRUITMENT SCHEDULE ~Final Filing Date: Continuous  Combined Civil Service Panel/Departmental Interviews: July 9 and/or 10, 2018At the County of San Mateo, we take pride in the way our employees bring together their diverse backgrounds, experiences, and perspectives to serve our community's needs. The County is an Equal Employment Opportunity Employer. HRContact:YvonneAlvidrez(053118) (Community Program Analyst II - G246)  Application Instructions  To learn more about the position and/or to apply, please click the link below. If link is not available, please read the information above for detailed instructions on how to apply.  Closing Date/Time: Continuous  Continuous"}