{"jobID": "2810325219", "jobLocation": "El_Segundo_CA", "jobTitle": "Senior Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.davita.com", "Headquarters": "Denver, CO", "Size": "10000+ employees", "Founded": " 1994", "Type": " Company - Public (DVA) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "86000", "jobDescription": "Job Description The Clinical Analytics & Reporting Team is responsible for designing, developing and overseeing analytical solutions for our clinical and operations executives in support of DaVita's clinical strategy. Our team's mission is to improve patient quality of life in terms of care safety, quality, and efficiency by transforming data into actionable information that guides strategic decisions, supports clinical innovation, and informs operating tactics.  A successful teammate exemplifies personal behaviors in line with DaVita's core values: service excellence, integrity, team, continuous improvement, accountability, fulfillment, and fun. Responsibilities The Senior Clinical Data Analyst's primary objective is to partner with diverse teams from around the enterprise to produce analytical insights that support a broad range of clinical initiatives specifically for VillageHealth, DaVita's integrated care initiative. The following duties and responsibilities generally reflect the expectations of this position but are not intended to be fully inclusive. Partner with clinical subject matter experts and operational leadership to identify key clinical questions that can be answered using data to drive clinical goals and objectivesIndependently conduct clinical analysis and synthesize results in a non-technical manner to provide recommendations to senior executivesStructure analytic plans that comprehensively address clinical questions and provide a detailed methodology and approach for analysisDevelop clinical models to drive strategic initiatives on the basis of care efficacy and resource allocationBuild, implement, and maintain multifunctional clinical tools to disseminate real-time information to VillageHealth care teammates and nephrologistsUtilize multiple computational languages, platforms and environments to mine and manage data in preparation for analysisAdhere to best demonstrated practices in clinical analytics from the fields of informatics, biostatistics, epidemiology, and data science to analyze data to provide unbiased and unconfounded answers to clinical questionsPartner with cross-functional teams to socialize analytic findings and drive management processes to meaningful resultsBecome a subject matter expert and thought partner in clinical and methodologic areasWilling to travel (up to 10% of time)QualificationsBachelor's degree required; major in biostatistics, statistics, informatics, computer science, math, or relevant field required; post-graduate degree in an analytic discipline strongly recommended.Prior relevant work experience preferredDemonstrated ability to learn and develop proficiency in any or all of the following as needed: Microsoft Office Studio, SQL, SAS, Tableau, IBM Cognos, Python, R, etc.Advanced critical thinking, strong work ethic, creative mindset, adept communication skills, attention to detail, design-mindedness, flexibility with change, comfort with ambiguity, efficient time management, technical aptitude, and business acumen Language Skills  Fluent in the written and verbal skills necessary to perform successfully the essential functions, duties and responsibilities of the position  Vision Requirements  Vision adequate to perform essential duties and responsibilities of position  Physical Demands  Physical requirements can vary. These must be reviewed with management. However, in general, the position requires the following physical activities: Ability to lift minimum of 2 pounds to a maximum of 15 pounds unassisted; ability to sit for extended periods of time with some standing, stooping, walking, stretching, reaching, lifting; moderate range of body motionsAbility to use computer and all peripherals for extended periods of time DaVita is an equal opportunity/affirmative action employer. As such, DaVita makes hiring decisions solely on the basis of qualifications and experience, and without regard to race, color, religion, sex, gender identity, sexual orientation, national origin, disability or protected veteran status."}