{"jobID": "2740688459", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst Intern", "companyRating": null, "companyInfo": {"Website": "www.plato.de", "Headquarters": "Lubeck, Germany", "Size": "51 to 200 employees", "Founded": " 1992", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "At Plato, were on a mission to help engineering managers become great leaders. Our platform intelligently matches mentees to highly experienced engineering leaders of various backgrounds to help resolve their most pressing management challenges. After raising over $3M from SaaStr's Jason Lemkin, Slack, Zoom CEO Eric Yuan, and more earlier this year, we've experienced exceptional and rapid growth.As our first Data Analyst Intern, youll report to the CEO and work closely with all the departments of the company: sales, marketing, customer success, product and Engineering teams. Youll also work to surface key insights that will inform our product roadmap and help each department to take the best decisions.This is a dynamic opportunity thats polyvalent, strategic and that will have a big impact on the performance of each team. Your day-to-day will consist of talking to sales, marketing, customer success, product and Engineering teams, understand their needs, challenge them and implement warehouses, trackers, database models and dashboards to help them solve their problems.The person occupying this position will have an exceptionally broad view of every aspect of Plato business. The scope involves both technically rigorous work, including the use leading-edge data analysis technologies, and daily interaction with all the team.At Plato youll have a big impact on the growth of a promising startup as well as the career development of 100s of engineering leaders.WHO YOU AREA data nerd - you are highly confortable with basic languages (SQL, Python...) and highly rigorous on your workA business-drive person - you hate building models and dashboard without understanding the needs of the businessA people person - you can easily talk, understand and help anyone in the companyA juggler - you are highly skilled handling multiple projects at once and a master at prioritization and getting sh*t doneA Problem-solver - you have a bias for action and are quick to come up with solutionsREQUIREMENTSIdeally double specialty in Business and Engineering (or CS)Available for 6 months (full-time) or moreExperience or willing to work in a startup or other fast-paced environmentExcellent written and oral communication skillsExperience with HR or Engineering space, a plusExperience in B2B SaaS, a plusLocal or moving to SFVery few companies have the potential to do something truly meaningful to actually help others. We believe that making managers better, more successful, and happier results in a happier overall workplace. And improving that even 10% leads to a ripple effect.We spend nearly all of our waking lives at work. Let's make that better."}