{"jobID": "2804866430", "jobLocation": "Mountain_View_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.genesis10.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Genesis10 is currently seeking a Data Analyst with our client in the SEO industry in their Mountain View, CA location. This is a 12 month + contract position.  Description: Seeking a Data Analyst  The ideal candidate for this position is able to do complete life cycle data generation: data querying, building pipelines, running statistical analysis, building dashboards and outlining critical insight for each Project Manager  We also need someone who is able to understand and fit curves to materials data as a key metric for understanding system performance  Responsibilities: Top 3 Daily Responsibilities: Use statistical methods to analyze data and generate useful business and engineering reports  Work with management team to create a prioritized list of needs for each test case  Use data to create models that depict trends in targeted experiments and the system population as a whole  Overall Responsibilities: Work with departmental managers to outline the specific data needs for each business method analysis project  Recommend solutions to maximize understanding with limited data sets and show statistical levels of confidence in conclusions drawn  Requirements: Bachelor's Degree in Mathematics or Computer Engineering or Materials Engineering  4+ years in a data analyst or engineering role  Experience in Python, Matlab, SQL  Ability to collaborate effectively and work as part of a team  Strong attention to detail  Desired Skills: 2+ years' Data mining experience preferred  Google Tools: Plx, Dremel  Able to work as a W2 employee of Genesis10 (no Corp-to-Corp)  If you have the described qualifications and are interested in this exciting opportunity, please apply! About Genesis10: Genesis10 is a leading U.S. business and technology consulting firm with hundreds of clients needing proven talent and solutions to power their strategic initiatives. If you are a high performing business or IT professional with solid, referenced experience, we want to meet you. Genesis10 recruiters and delivery professionals are highly accomplished career advocates, who get to know you beyond your resume to position you with the opportunities that fit your skills, experience and aspirations. We have benefit options to fit your needs and a support staff that works with you from placement throughout your engagement project after project. To learn more about Genesis10 and to view all our available career opportunities, please visit us at www.genesis10.com. \"Genesis10 is an Equal Opportunity Employer, M/F/D/V"}