{"jobID": "2572179142", "jobLocation": "New_York_NY", "jobTitle": "Intensivist-Critical Care/Pulmonary", "companyRating": null, "companyInfo": {"Website": "www.pagny.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OverviewPhysician Affiliate Group of New York (PAGNY) is comprised of nearly 4,000 physicians and healthcare professionals who provide services to NYC Health and Hospitals Corporation (HHC), the largest public health system in the United States. Our practitioners are highly skilled professionals with outstanding credentials who deliver the highest level of quality healthcare to patients throughout New York City. Equal Employment Opportunity Employer M/F/D/V  In partnership with NYC Health + Hospitals/North Central Bronx our teams handle more than 156,000 outpatient visits, more than 50,000 emergency room visits and more than 7,500 admissions annually in the 232-bed facility. The hospital maintains an academic affiliation with the James J. Peters VA Medical Center.ResponsibilitiesThe Pulmonary & Critical Care Medicine Division of North Central Bronx, a major teaching affiliate of the Albert Einstein College of Medicine in NYC, seeks an academically oriented, clinically adept Intensivist to join its full time staff. North Central Bronx supports a very robust IM residency training program and Jacobi serves as a major clinical site for Montefiore Medical Center PCCM fellowship trainees and other Medicine Sub-specialty fellows. The primary focus of this Intensivist position will be to attend in the MICU where we currently have on-site 24/7 attending coverage. In addition, this Intensivist will provide similar services to Jacobi if needed.QualificationsThe successful candidate will be BE/BC in Critical Care Medicine. Additional BE/BC in Pulmonary Diseases is highly desirable which can lead to additional clinical opportunities in inpatient Pulmonary medicine and the OPD.  EOE M/F/D/V"}