{"jobID": "2830583591", "jobLocation": "Sunnyvale_CA", "jobTitle": "Revenue Accounting Manager", "companyRating": "3.2", "companyInfo": {"Website": "www.redseal.co", "Headquarters": "Sunnyvale, CA", "Size": "51 to 200 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Skybox Security, FireMon, AlgoSec"}, "estimatedSalary": "119000", "jobDescription": " RedSeal is an enterprise cyber security platform company located in Sunnyvale, California. The platform calculates a model of the networking infrastructure (physical, cloud, hybrid) and helps customers validate and improve their overall level of resilience, accelerate incident containment and improve the productivity of the resource constrained security and networking teams. Our customers include all four branches of the military and some of the largest finance, healthcare, power and technology companies in the world.  We are seeking a highly motivated Revenue Accounting Manager who will report directly to the Corporate Controller. This position will play a key role in managing the end-to-end accounting, business and system processes as the company implements ASC 606.  The ideal candidate will have a solid understanding of revenue accounting principles under US GAAP and ASC606, with hands-on knowledge of ERP billing systems. He or she will also have experience with managing month-end close cycles. RESPONSIBILITIESReview sales arrangements to ensure revenue is recognized in accordance with US GAAP and internal policies.Be the internal revenue expert and key contact with respect to requirements and impact on the revenue recognition cycle.Play a key role in the implementation of ASC 606, including establishing accounting policies, identifying performance obligations for the Companys contracts and revenue elements, restating historical results, data conversion and development of internal controls and processes.Responsible for month-end close activities, including preparing monthly revenue recognition, revenue reserve and commission amortization journal entries under ASC 606.Responsible for Financial Planning & Analysis (FP&A;), revenue forecast modeling and backlog.Serve as the finance organizations subject matter expert on revenue accounting and provide support to the Sales & Sales Operations organizations.Partner with other departments to streamline processes related to revenue and cost recognition to create best practices across the organization.Participate in and contribute to the completion of corporate and statutory audits, including the preparation of audit schedules, supporting calculations and ad hoc reconciliations.Work closely with the Companys external auditors to ensure approved revenue policies are adhered to and monitored.Proactively identify issues and assist in optimizing systems, upgrades and automation of accounting processes.REQUIRED QUALIFICATIONS/SKILLS7+ years public or private high-tech company experience in revenue recognition accounting.BS in Finance or Accounting.CPA with Big 4 experience.Working knowledge of and experience with implementing of ASC 606 required.Detail-oriented with superior analytical and problem-solving skills.Experience with NetSuite or similar ERP system.Significant experience with revenue forecasting. Working knowledge of Adaptive or Host Analytics desired.Advanced Excel skills.Ability to analyze and interpret customer contracts.Outstanding interpersonal and communication skills.Exceptional business partnering skills, with demonstrated ability to work cross functionally and at various levels within a company.PREFERRED QUALIFICATIONS/SKILLS SaaS experience highly preferred."}