{"jobID": "2830635864", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Health Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.blueshieldca.com", "Headquarters": "San Francisco, CA", "Size": "5001 to 10000 employees", "Founded": " 1939", "Type": " Nonprofit Organization", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "95000", "jobDescription": " Looking for a chance to do meaningful work that touches millions? Come join the hardest working, nonprofit health plan in California and help us shape the future of health care. Blue Shield of California is focused on transforming health care by making it more accessible, affordable and customer-centric. Being a mission-driven organization means we do much more than serve our 3.5 million members: we were the first health plan in the nation to limit our annual net income to 2 percent of revenue and return the difference to our customers and the community, and since 2005 we have contributed more than million to the Blue Shield of California Foundation to improve community health and end domestic violence. We also believe that a healthier California begins with our employees, so we provide them with resources to develop and maintain a healthy lifestyle through our award-winning wellness program, Wellvolution.  We're hiring smart thinkers and doers who want to work for a leader and innovator in the challenging, ever-changing healthcare space. Come and help us make health care better for everyone. Description: Our team focuses on network design, maintenance and regulatory support. Some of our key responsibilities are (1) provide analysis and consultative services on new network design in support of corporate strategic roadmap; (2) manage and oversee development and production of regulatory network filing artifacts as required by regulators for all Blue Shield commercial and Medicare networks; (3) provide network analytics, reporting and oversight on existing networks to ensure meeting regulatory access, availability standards as defined by regulators; and (4) provide consultative and analytical support as needed to during contract negotiations and pricing activities.  Independently manage projects that may involve coordinating a team and working with different stakeholders. Collects, analyzes and synthesizes data; develops artifacts and summaries in response to regulatory filings and comment letters. Support BSC's key network initiatives using robust analytic tools. Translate data analysis into insightful and actionable items for internal customers. Produce geo-access reports and analysis/summaries for regulatory filings. Collaborate with internal stakeholders and customers to identify enhancement opportunities to improve data collection, integrity and efficiencies. Collaborate with and support other teams such as network managers and Access & Availability workgroup in developing strategies in support of data collection, reporting, network adequacy assessments as it pertains to new and existing networks. Independently summarize findings and presents data in formats such as excel pivots, power point, reports, grids and tables. Support development of presentations/reports for internal and external customers. Ad-hoc assignments as requested. Our team (Network Performance Analysis and Contracts) is part of the HCQA Division and focuses on provider network performance analysis, reporting, and consulting. The NPAC team is responsible for developing analytics and supporting materials to assist and guide strategic development and maintenance of Blue Shield's network of physicians, hospitals, ambulatory surgery centers, HMO IPA's, and medical groups.  This position can be located in our San Francisco, Rancho Cordova, El Dorado or Woodland Hills offices. Responsibilities:Qualifications: Requires an MPH, MBA, MS or MA in science, social science, public health, health services research or business, or BA/BS with demonstrated equivalent work experience.  PhD preferred.  Position also requires 3-5 years' experience in Health Care (managed care, academic, or government payer), demonstrated ability to work with all clinical coding systems (e.g., ICD9, CPT, DRG, LOINC, RxHUB).  MS Office, esp. Excel and Access, Unix, SQL/PL-SQL, SAS. Must be able to develop new SAS programs and SQL scripts that improve the efficiency of the work of others. SAS Base and Adv. Certification preferred. Minimum Experience Level: Typically has 3-5 years of experience in quality of care assessment in a managed care or academic setting. "}