{"jobID": "2514096014", "jobLocation": "San_Jose_CA", "jobTitle": "Manager, DRAM Technical Marketing", "companyRating": "3.4", "companyInfo": {"Website": "www.skhynix.com", "Headquarters": "Icheongeo-ri, South Korea", "Size": "10000+ employees", "Founded": " 1983", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "113000", "jobDescription": " This role will be responsible for interfacing with Tier 1 customers and SoC microprocessor partners to assure that SK hynix DRAM technology leadership is maintained, the product pipeline is optimized for customer platforms and SoC vendor reference designs. As customer advocate, the role will provide an escalation path to company headquarters on occasions where there are internal/external obstacles impeding key design wins or production usage of SK Hynix products.  Manage all technical issues arising with DRAM at specific assigned customers. Provide guidance so partners design in optimal solutions based on product lifecycles, cost competiveness, and aggregate market sector demand. Gather market intelligence, industry and application technology trends so product roadmaps can be adjusted strategically to secure design-wins. Visit & interact directly with partners and select customers to maintain roadmap alignment & interact on DRAM product changes and qualification status. ResponsibilitiesProvide SoC or OEM partners with DRAM product & technical collaterals to complete designs and promote new products for design qualificationsSample DRAM products and track progress. Submit partners' sample requests into company’s database for DRAM related components and expedite shipments for OEM partners based on urgency of validations and/or qualifications for future reference designs or customer platforms.Develop, manage, and interface with manufacturing facilities on technical and quality issues during new platform enabling period.Initiate technical leadership and support to sales staff and customers. Develop technical information and company insights for sales presentations to partners/customers.Research, analyze, and recommend feature into new product specs including guidance on future product positioning.Conduct analysis on competitive products in assigned market segments.Document and report internally to peers & management the status, progress, and results of technical marketing activities.Attend and/or present at industry related conferences to enhance company’s reputation and improve professional knowledge.Train and coach new team members on key technical marketing duties.RequirementsBachelor’s degree in Electrical Engineering, Computer Science or related technical degree. Master’s degree preferred. MBA and/or previous managerial experience with a semiconductor supplier a plus.5~15 yrs. experience in technical marketing, field or factory application engineering, customer support. Prior employment with a Tier 1 SoC supplier in the areas of product management or business/project development a plus.Knowledge of the DRAM industry, systems trends and market sensing, and applications ecosystems.DRAM device knowledge at device and systems level.New product and project development, and proven track record of achieving designs with customers in sales, FAE or marketing role.Strong communication, collaboration, coaching, negotiation and presentation skillsStrong knowledge of consumer electronics architecture, ecosystems, & PC/Server/Mobile/IoT platforms architectures desiredKorean language skill is a plus but not required SK hynix America"}