{"jobID": "2830048622", "jobLocation": "Bellevue_WA", "jobTitle": "Infrastructure Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.gtsrecruit.com", "Headquarters": "Karachi, Pakistan", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job CategoryProducts and Technology  Job Details  The Infrastructure Data Science team is looking for a data scientist to contribute to our growing efforts in developing impactful data science applications that support infrastructure operations and strategy. In this role, he/she will be exposed to the entire data science stack, from distributed storage systems to operationalized internal applications. As we scale, our team continuously invests in the data science workflow by expanding our data catalog, automating data pipelines, performing data validation, and deploying models. Responsibilities:Partner with stakeholders to support infrastructure data analyses.Acquire, clean, and structure data from multiple sources.Perform statistical analyses and modeling to understand the data.Map data flows and develop data integration roadmaps.Contribute to algorithmic development for infrastructure anomaly detection and forecasting.Required Skills/ Experience:Working towards Masters degree / PhD in Data Science, Computer Science, Mathematics, Statistics, or relevant Engineering fieldProficiency with many of the following: Python, R, SQL, Hive, Hadoop, Jupyter Notebook, visualization librariesSelf-starter and high degree of motivation to go above and beyond the task at hand.Excellent written and spoken communication skills.Ability to effectively drive complex data projects with many dependencies. Are you an upcoming or recent graduate (within the past 2.5 years)? Please check out our FutureForce program at www.salesforce.com/futureforce. We appreciate your interest but we are seeking industry experienced engineers.  Salesforce, the Customer Success Platform and world's #1 CRM, empowers companies to connect with their customers in a whole new way. The company was founded on three disruptive ideas: a new technology model in cloud computing, a pay-as-you-go business model, and a new integrated corporate philanthropy model. These founding principles have taken our company to great heights, including being named one of Forbes's \"World's Most Innovative Company\" five years in a row and one of Fortune's \"100 Best Companies to Work For\" eight years in a row. We are the fastest growing of the top 10 enterprise software companies, and this level of growth equals incredible opportunities to grow a career at Salesforce. Together, with our whole Ohana (Hawaiian for \"family\") made up of our employees, customers, partners and communities, we are working to improve the state of the world.  Salesforce information  We are Salesforce Engineering  Salesforce FY18 Year in Review  Salesforce Ohana Culture  Salesforce Engineering behind the cloud  https://medium.com/salesforce-engineering  Posting Statement  Salesforce.com and Salesforce.org are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Headhunters and recruitment agencies may not submit resumes/CVs through this Web site or directly to managers. Salesforce.com and Salesforce.org do not accept unsolicited headhunter and agency resumes. Salesforce.com and Salesforce.org will not pay fees to any third-party agency or company that does not have a signed agreement with Salesforce.com or Salesforce.org."}