{"jobID": "2746290018", "jobLocation": "New_York_NY", "jobTitle": "Data Analyst Intern", "companyRating": null, "companyInfo": {"Website": "www.dmpgroup.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Established in 2007, Downtown Music Publishing is one of the world's leading rights-management firms with offices in major music markets around the globe, including New York, Nashville, Los Angeles, London, Amsterdam, and Tokyo. The company's catalog spans over seven decades of popular music, encompassing some of the world's most beloved songwriters and artists including The Beatles, John Lennon & Yoko Ono, Ryan Tedder, Benny Blanco, Robin Thicke, The Kinks, Hans Zimmer, Mötley Crüe, One Direction, Naughty Boy, Hardwell, Sturgill Simpson, Santigold, Carla Bruni, and Social Distortion. Downtown Music Publishing is wholly owned by Downtown & Company, which also owns New York-based Downtown Music Studios and Songtrust, the worlds largest technology platform for songwriting and music publishing royalties, which powers global royalty collection from over 120 territories and more than 20,000 unique income sources worldwide. Downtowns internships are for credit only -- candidates must be enrolled in a college or university. If offered a position, students must provide a letter from their college or university confirming that they will receive school credit. The minimum time commitment is two days per week, to be spent across a minimum of 16 hours per week, working from our New York City office in SoHo. It is also required that interns bring their own Wi-Fi enabled laptop to the office.DATA ANALYST INTERN: Downtown is seeking a passionate Data Analyst Intern who is excited by all the opportunities available in data and the Music Industry. By the end of the internship, the intern will have a strong understanding of data analysis,and the business of music publishing. SO,WHAT WILL YOU BE DOING?Gathering data and analyzing results to gain business and customer insightsWorking with the Data Analyst to present findings to managementAssisting in analyzing conceptual, logical and physical data models and documenting business concepts, data entities, data elements and the relationship between themReviewing master data against the presently used data in various business processes to identify the gaps, discrepancies and the opportunities to further improve quality of master dataParticipating in documenting systems and processes interactions within a functional scopePerforming various data quality functions for data from multiple systems such as: Profile, cleanse, validate and auditTaking part in master data quality improvement activities through analysis and remediation of data quality issues.YOU ARE:Working towards a degree in Computer Science, Mathematics, Statistics, Economics, or similarComfortable working with large datasetsKnowledgeable about SQLA resourceful and creative problem solverAble to work independently in a fast-paced environment and take initiative to solve problems and complete tasks as they ariseA positive, team-player attitudeEnrolled in a Bachelors or Masters degree programPassionate for data and musicStrong in communication skillsHighly analytical with strong technical acumenProficient in Excel (pivot tables, filters, basic formulas)Eager to experiment, test and measure the results of specific initiativesKnowledgeable in DBMS concepts, Javascript, programming in R, SAS, & ETLs (all preferred not required)WHY YOU WANT TO WORK HERE:An opportunity to work with some of the most talented professionals in the music industry in a casual and welcoming environmentWeekly Q&A; sessions with the head of each departmentA collaborative group project connecting the operations of multiple departments and companies within DowntownFrequent interactive presentations, office-wide breakfasts/lunches, birthday celebrations, and other special eventsSoHo -- need we say more?"}