{"jobID": "2767282863", "jobLocation": "Boston_MA", "jobTitle": "Healthcare Data Analyst", "companyRating": "3.0", "companyInfo": {"Website": "www.decisionresourcesgroup.com", "Headquarters": "Burlington, MA", "Size": "1001 to 5000 employees", "Founded": " 1990", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " IQVIA, GlobalData"}, "estimatedSalary": "83000", "jobDescription": " DRG is a global information and technology services company that provides proprietary data, solutions, and expertise to the healthcare industry. If you’re passionate about our healthcare system (fixing it, at least), let’s talk. While our products look like data sets and software, our solutions decision-making in ways that shape the availability and cost of prescription drugs for nearly every American. As a commercial partner to leading R&D; teams and drug manufactures, our data and insight help ensure that innovative drugs thrive in the market.  At DRG, we know that better understanding of data leads to better application of data, which is why we make it a point to understand your business challenge. We build the right team of experts to address your need, and partner with you to transform varied bodies of data into the evidence required to make informed business decisions. DRG Analytics provides data and analytical solutions to the largest biopharmaceutical and medical technology companies in the world.  Our clients need to estimate the prevalence of undiagnosed patients for a particular disease, understand the impact of high-deductible insurance policies on drug uptake, or identify research partners for early-stage product development and ideal clinical trial sites.  Our resources include one of the largest insurance claims and electronic health records repositories available and a large database of scientific literature.  Our techniques include statistical modelling and text analysis on datasets that represent more than 50% of all healthcare activity in the United States.  Our problems are hard and their answers have an impact on healthcare today. The Opportunity We are seeking a self-directed, inquisitive, and enthusiastic Healthcare Data Analyst to join our dynamic, fast-growing team in Toronto and Boston.  The Analyst or Sr. Analyst must be capable of understanding data, manipulating data, analyzing data, and delivering data and analyses. Responsibilities:Apply a mix of quantitative problem-solving skills and qualitative research to solve the questions of the pharmaceutical and medical device industries.Collaborate with both clients and fellow team members to implement solutions.Be an expert in data (insurance claims, electronic health records), method (statistics, data visualization), and domain (healthcare policy, market dynamics).RequirementsEducation: Background in quantitative sciences or studies with a healthcare focus or several years of work experience providing the same background.Data management: Proficiency in general programming languages.Post-undergraduate studies, graduate studies, or post-doctoral work in a quantitative ormedical discipline.Strong proficiency in R or Python.Differentiating Qualities:Healthcare data experience: Demonstrated background in using healthcare data in a project setting. Relevant data types include insurance claims data (diagnoses, procedures, physician/hospital data) or electronic health records (free-text analysis, lab resultsAbout DRG: Decision Resources Group offers best-in-class, high-value information and insights on important sectors of the healthcare industry. Clients rely on this analysis and data to make informed, knowledgeable decisions. With more than 1,300 employees worldwide, Decision Resources Group provides the pharmaceutical, biotech, medical device, financial services and managed care industries with the analytics they need to compete and thrive in an increasingly competitive marketplace. Through both organic growth and an aggressive acquisition strategy, Decision Resources Group has become the premier provider of healthcare analysis and data in the world. Visit our page at https://decisionresourcesgroup.com. Benefits Decision Resources Group offers a competitive compensation package and medical, dental, vision and life insurance programs from first day of employment. We also offer a 401(K) retirement plan after two complete months of employment.  Decision Resources Group is proudly committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, marital status, disability, gender identity or Veteran status.  Analyst: Professional 2 / Grade 6  Sr. Analyst: Professional 3 / Grade 7  #LI-MD1"}