{"jobID": "2796592177", "jobLocation": "Round_Rock_TX", "jobTitle": "Software Engineer Intern", "companyRating": "3.5", "companyInfo": {"Website": "www.selinc.com", "Headquarters": "Pullman, WA", "Size": "1001 to 5000 employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "59000", "jobDescription": " Schweitzer Engineering Laboratories (SEL) seeks an intern who wishes to apply his/her talents to assist engineers in developing software for embedded systems and UEFI BIOS. This internship is located in the Austin- Round Rock metro area, and is available immediately for part time employment during the academic year and full time in the summer. The intern will have the opportunity to work with rugged computer systems and assist in developing and enhancing our product line. If you are looking for an opportunity to learn about the BIOS in modern computers while also obtaining real-world experience, then this position is for you! Essential Duties and ResponsibilitiesImplement firmware/software designs.Test SEL development software to meet specifications and engineering requirements.Document and communicate test results using spreadsheets, database programs, and CASE tools.Provide support to engineering staff as needed.Follow engineering quality assurance procedures.Continuously identify, measure, and improve processes.Other duties as assigned.Required QualificationsMinimum two years' undergraduate studies in Electrical Engineering, Computer Science, or equivalentExperience using C, C++, and/or assembly languageWorking knowledge of modern test equipmentAbility to conduct and document defined testing proceduresStrong writing, documentation, and speaking skillsAbility to learn new skills and assume new responsibilitiesAbility to work cooperatively in a team environmentBackground check results satisfactory to SELNegative drug test result(s)Preferred QualificationsAbility to work part time during the school year and full time during the summerExperience in programming with C and assembly languages and script filesExperience in embedded software developmentWorking knowledge of emulators and logic analyzersPhysical RequirementsNoneLocation Information This position is located in SEL's Austin, TX office. Austin is a big city with a laid-back atmosphere. It offers a diverse culture including a vibrant music scene, good eats, and plenty of outdoor activities. An Award Winning Company Schweitzer Engineering Laboratories, Inc. (SEL) has earned a reputation for quality, reliability, integrity, and service. This has enabled us to expand within both the electric utility and industrial markets in many different industries, markets, and geographies around the world."}