{"jobID": "2797004031", "jobLocation": "New_York_NY", "jobTitle": "Amazon Marketing Manager", "companyRating": null, "companyInfo": {"Website": "www.feedvisor.com", "Headquarters": "Tel Aviv-Yafo, Israel", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " At Feedvisor, were just as proud of our products as we are of our people. We work hard to assemble the best teams in the industry to create, manage, and sell the repricing tools that are shaping the future of e-commerce. Harnessing the powers of AI, Machine Learning, and Data Science, our Feedvisors are changing the way that business happens online. Our New York office is growing rapidly, and were looking forward to starting a conversation with you.  At Feedvisor, our technology makes a real and lasting impact on our customers businesses. As our in-house Amazon expert, you live and breath the Amazon platform. You will ensure we stay up to date on all aspects of Amazon marketing, executing and consulting on campaigns that will set our customers up for success. You will work side by side with our marketing, customer success, sales teams on a daily basis to make sure we are driving the best Amazon advertising and marketing strategies for our clients. About the Role + Consult with customers on Amazon Marketing and PPC campaigns  + Execute entire campaign life cycle - set up, run, optimize, analyze PPC programs  + Implement and execute strategic plans for leveraging the Amazon marketplace to grow the customers business with a focus on marketing campaigns, promotional opportunities, and brand opportunities  + Grow a team of hands-on Amazon Advertising and Brand consultants  + Build connections with Amazon Product teams and Marketing groups  + Write marketing content and thought leadership pieces  + Keep up-to-date on news and changes within Amazon  + Create presentations for both internal and external stakeholders About You + 5+ years of in the e-commerce and digital marketing space  + 2+ years of direct experience managing Amazon campaigns and listing optimization  + Deep knowledge of Amazon Seller Central, Amazon Marketing Services, and Vendor Central  + Strong communication and presentation skills  + Relationship management and networking  + Excellent content development skills Our Culture At Feedvisor we care a great deal about our company culture. You will be a great addition if:  + You're obsessed with excellence and consistently looking to improve  + You seek to understand the world through other peoples eyes  + You see opportunity in difficult situations  + You are trustful  + You get things done  + You are humble, radically candid, and open to feedback Benefits You will be part of a dynamic team and have the privilege to work for a company that is building the infrastructure of the future.  We offer a competitive compensation package, which includes: comprehensive health, dental and vision insurance, Life insurance, generous PTO, a 401K and Happy hours, parties and events to insert joy into workflow.  Check out our profile on The Muse, our Customer Success Stories, and our Products page. All brought to you by the brilliant minds at Feedvisor - care to be one?"}