{"jobID": "2831298485", "jobLocation": "Brooklyn_NY", "jobTitle": "Music Management/Content Intern", "companyRating": null, "companyInfo": {"Website": "www.harvillemusic.com"}, "estimatedSalary": null, "jobDescription": " Brooklyn-based alternative rock and soul band Harville is hiring an intern to help grow the band’s audience and make the most of summer 2018. Harville has spent the spring recording and releasing music, shooting and planning music videos, and making our live show undeniable. We’re playing AFROPUNK Brooklyn in August, putting together an EP for the fall, and looking to make the most out of all the quality content we’re creating to build an audience locally and nationally. We need more help to do this! That’s where you come in. Ideally you are interested in a career managing artists, booking shows and tours, and creatively marketing music. Working with Harville, you’ll get hands-on experience working with a band with strong momentum and the opportunity to connect with our industry network - helping manage the conversations with the agents, labels, publishers, and streaming services we’re working with.  Some specific responsibilities include the following (depending on your strengths and interests): Booking & coordinating shows (keep 10% of the $ you make for us)Helping us craft and execute on our high-level strategy to create amazing shows, records, videos and develop the band’s audience.Helping capture + manage social media contentHelping capture and curate behind-the-scenes content for a documentary about the band.Helping us coordinate partner conversations with labels, publishers, agents, and others. More about Harville: Harville founders and multi-instrumentalists Jay Troop and Jonathan Singletary each have 15+ years experience writing, producing, and performing music. Whether opening for Bruno Mars, Stevie Wonder, or Questlove and playing stages from Las Vegas to Dubai music is their lifeblood, passion, and purpose. They also have unique high level experience working at music and tech companies Pandora, Google and Shazam, and are in constant conversation with labels, publishers, and tech companies about the future of the music industry and are planting a foundation at the center of it all - music first. Harville is a project focused on music, art, and the people who share this journey with us on either side of the stage. We believe in building bridges, bringing people together, and making art that is challenging, enriching, immersive, and exciting.  Come join the team!  Harville "}