{"jobID": "2695731937", "jobLocation": "New_York_NY", "jobTitle": "Assistant Resident Engineer –", "companyRating": "4.1", "companyInfo": {"Website": "www.hazenandsawyer.com", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " 1951", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Brown and Caldwell, CH2M, Black & Veatch"}, "estimatedSalary": "73000", "jobDescription": "« Current Openings Assistant Resident Engineer – New York  Location: New York, NY Office - Corporate HeadquartersWe are seeking an Assistant Resident Engineer to manage and coordinate the construction of various water and waste-water facilities. 5 to 10 years of experience as an Assistant Resident Engineer or Assistant Project Manager in a field construction capacity, preferably in the water/wastewater industry. Bachelor’s degree in Engineering or related field and a NYS Professional Engineer license required. Must be able to manage staff, effective with both oral and written communication, familiar with schedule and budget management.  This person will assist Resident Engineer with project delivery, acting primarily as the Owner’s Agent. Must be capable of providing oversight and direction to the complete construction effort including typically:  Review and interpretation of project specifications and drawings, Assist in coordinating the work of multiple prime contractors, Coordinate and facilitate communication between the contractors, the Engineer, the Facility Managers and the Owner. Assure proper construction means and methods are used by the Contractors for successful completion of the project within determined costs and schedules. Review contractor performance and compliance with safety requirements. Assist with review and evaluation of contractor and delay claims Manage internal staff responsible for inspection services, invoice review and processing, change order processing, (including estimating and negotiation), project correspondence and reporting. Familiarity with cloud based project management is a plus.Apply online » Send to a friend"}