{"jobID": "2674304786", "jobLocation": "Quincy_MA", "jobTitle": "Data Analyst R", "companyRating": "3.7", "companyInfo": {"Website": "www.bcbsma.com", "Headquarters": "Boston, MA", "Size": "1001 to 5000 employees", "Founded": " 1937", "Type": " Nonprofit Organization", "Industry": " Insurance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "64000", "jobDescription": " Are you looking for innovation? Your search is over - it happens here.CSA – Data Analyst  Data Analyst works has the knowledge and experience sufficient to ensure that functional design and implementations of Common Staging Area Program are consistent with the current and future state of various applications, ETL solutions and BI reports. Data analyst understands the data elements available in the staging area platform and works closely with business areas to help them implement their business needs using this data.  Data Analyst works as liaison between business and technical teams & provides strategic services like feasibility study, conceptual/logical data modeling and maintaining meta data. Data Analyst has exceptional SQL skills to put together analysis for various stakeholders for various projects. Other responsibilities may include understanding future state of various ETL applications to read from Hadoop platform, mapping new/existing Extract Transformation and Load (ETL) solutions & understanding of various Business Intelligence tool sets to ensure business reporting needs are met. Strong communication skills is a must to this role.CSA – Data Analyst Data Analyst works has the knowledge and experience sufficient to ensure that functional design and implementations of Common Staging Area Program are consistent with the current and future state of various applications, ETL solutions and BI reports. Data analyst understands the data elements available in the staging area platform and works closely with business areas to help them implement their business needs using this data.  Data Analyst works as liaison between business and technical teams & provides strategic services like feasibility study, conceptual/logical data modeling and maintaining meta data. Data Analyst has exceptional SQL skills to put together analysis for various stakeholders for various projects. Other responsibilities may include understanding future state of various ETL applications to read from Hadoop platform, mapping new/existing Extract Transformation and Load (ETL) solutions & understanding of various Business Intelligence toolsets to ensure business reporting needs are met. Strong communication skills is a must to this role. ResponsibilitiesWork closely with business and IT teams to define, clarify and refine functional or technical data requirement specifications.Assist end users across all functional areas in identifying long-term, strategic data needs for the enterprise, defining how the data is related to the business processes and developing a conceptual and functional model of the dataServe as the modeler who can develop and understand conceptual and logical business models which will be used to generate physical data models and database schema by Data Architect.Understand data models to support both RDBMS and NoSQL based databases and how they map to business requirements.Ability to translate detailed business requirements into optimal database and ETL tasks.Ability to understand Hadoop infrastructure and write queries to support data analysisAbility to put data analysis into clear systems documentation, including technical sections of proposals, requirements documents, project plans, and project schedules.Collaborate with technical teams to develop coordinated plans to meet business requirements.Develop a strong understanding of health care data.Required Technical Skills5+ years of industry experience as Data Analyst/Systems Analyst.3+ years of experience with major RDBMS (Oracle, Netezza, DB2, SQL server) with hands on experience in data analysis using SQL3+ years of experience working in data integration environment having ETL tools using tools such as Informatica, Oracle Data Integrator (ODI) or equivalent.Knowledge of Hadoop stack: Hive and Impala is a plusExperience in creating technical documentationHealthcare domain knowledge is a plusExtensive experience with SQL requiredExperience with conceptual/logical/physical dimensional/relational data modelsExcellent verbal and written communicationEducationBachelors degree or higher in Computer Science/Information Systems/Statistics/Mathematics or related field. #LI-DNILocationQuincyTime TypeFull time"}