{"jobID": "2551098646", "jobLocation": "Menlo_Park_CA", "jobTitle": "Kitchen Manager/Chef - Weekends Off", "companyRating": null, "companyInfo": {}, "estimatedSalary": "63000", "jobDescription": " Looking to gain a work-life balance? Tired of working long hours? Do you want to be part of a team that provides the best food menu options to our customers while working in a fast-pace environment and supporting our mission of creating amazing, high-quality food dishes while having fun? This may be your opportunity...if you think you are the best Chef in the industry that can deliver a broad-range of international cuisine then we encourage you to apply to this amazing opportunity before it goes away. Flagship@ Largest Social Media Company in the world located in Menlo Park is seeking Kitchen Managers with a vast experience working with international and regional cuisines in an corporate high food production environment yet with the highest local sustainable products. Looking for a passionate Manager that can lead a staff of 30-50 team members in creating daily changing menus.*The ideal Manager will be responsible for fostering the company’s philosophy of hosting an excellent learning environment with the highest degree food quality yet without compromising the respect of our staff. We foster a fun and exciting environment and our staff is our top priority alongside our food quality.*ESSENTIAL FUNCTIONSResponsible for production according to recipes/directionsManages assigned staff, including scheduling, performance feedback, discipline, investigations and terminations.Responsible for ongoing training and professional development of staff membersEffectively communicates to management to ensure effective and efficient operations without issue.Effectively builds trust with staff members and fellow management by providing clear and honest communication and feedback.Evaluates the quality, care and morale of the staff and strives to improve these areas through solid communication, care with schedule-writing, work group leadership, etc.Sets operational goals and follow-up plans for the work unit.Directs and holds all work unit staff accountable for those goals.Ensures compliance with inventory procedures.Maintains food quality standards for the café.Oversees all phases of food procurement, production and service, including, inventory and ordering, storage and rotation, food preparation, recipe adherence, plate presentation, and service and production time standards.Conducts daily line checks, food reviews and recipes of the day.Ensures that clear feedback is provided to the entire kitchen team, including staff and management.Conducts monthly housekeeping, food safety and sanitation and facility reviews personally to improve café standards of kitchen team and to correct deficiencies on a timely basis.Ensures the cleanliness of the kitchen by maintaining to specified standards, passing Health Department audits with a 90% or better, and training staff on proper sanitation guidelinesThese are a few perks of what we offer our managers:Above industry pay11 Paid Holidays-Medical, Vision, Dental-Discounted80 hours of accrued sick and vacation 1st year401k -portion company matchYearly performance reviewsChild/Adoption fundsWEEKENDS OFF....(GET YOUR LIFE BACK!!!)"}