{"jobID": "2827749729", "jobLocation": "New_York_NY", "jobTitle": "Intern, Macro Analyst", "companyRating": null, "companyInfo": {"Website": "www.bamfunds.com", "Headquarters": "Chicago, IL", "Size": "501 to 1000 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Job Details are as follows: OVERVIEW An NYC based macro PM is looking for an Analyst Intern to help with all facets of portfolio management from developing tools and reports that help find new trades and risk manage a portfolio, to back-testing new trade ideas. The ideal candidate will have a quantitative background with experience coding in Python and familiarity with Excel. Experience with some macro products (FX, Bonds, Futures) is preferred, but is not necessary. RESPONSIBILITIES In the role of a Macro Analyst Intern, depending on the candidate’s background, there will be opportunities to/for: Work on data analysis projects and back-testing that have direct influence on trade idea generationBuild portfolio analytics and risk management toolsHelp build market monitors and relative value reports to identify and track new tradesDevelop models on market-relevant topics, e.g. Fed balance sheet runoff, election probabilities, etc.Learn about various macro products and trading strategy and toolsQUALIFICATIONS & REQUIREMENTSUndergraduate or Master’s student in a quantitative field. Masters in quantitative finance candidates preferredProgramming experience in Python in the context of data analysis, with the ability to test ideas and develop infrastructure for further researchKnowledge of statistics, including time series analysis and regressionsStrong organization skills with the ability to present results clearly and iterate with PMs accordingly The ideal candidate for an intern position will be someone who has or is interested in: Strong desire to work collaboratively with the teamHigh standard of professionalism in all dealings with internal staff and any external partners, clients and regulatory agenciesProblem solving skills and ability to identify and implement appropriate solutionsAbility to prioritize and manage multiple tasks and projects concurrently to meet/exceed deadlineStrong written and verbal communication skillsOutstanding attention to detail and strong organization skills"}