{"jobID": "2807670068", "jobLocation": "New_York_NY", "jobTitle": "Administrative Support & Tax Processing Senior Associate", "companyRating": null, "companyInfo": {"Website": "www.crowe.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1942", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job SummaryBusiness Support Admin and Tax Processor - Senior Associate This position provides administrative support to Partners and Directors in the Tax Business Unit. This position will require extensive people, communication, organizational, technical and process skills, and the ability to continuously prioritize multiple projects, and have a high level of focus on quality, accuracy and confidentiality in all work products and communications. This position also provides tax processing and project support to the Tax business unit. Work products and projects include tax processing, letters, reports and other client deliverables. Reports to the office manager and is a member of the Global Services Team. Administrative ResponsibilitiesDevelop, edit and format correspondence, letters, presentations, proposals, spreadsheets, .pdf files using Adobe Professional and newsletters including coordination of distribution.Prepare and distribute various communications and types of business reports and perform data analysis and reconciliation as well as summarize trends and provide recommendations.Research and document information using various Internet search engines and research sites.Facilitate invoices and expense reimbursement forms through coding, approvals and to accounts payable for processing.Assist with planning of client or internal meetings, webcasts or conference calls, including scheduling and communication, maintaining information and preparing and distributing materials.Provide assistance as it relates to planning and preparations for speaking engagements, committee involvement and events, including creation and preparation of written and spoken materials.Provide calendar management for client or business unit meetings, including administration, scheduling, and communication.Coordinate travel arrangements through Concur booking tool or travel agents.Assist with SharePoint site content management and administration.Use extensive knowledge of internal business practices and priorities to proactively respond to daily issues and requests as authorized, keeping them apprised of critical issues.Evaluate and encourage process improvement to provide effectiveness and enhance service delivery.Utilize tracking systems to ensure all time and materials are recorded, project work is prepared and tracked, and project instructions and client interactions are fully documented.Tax Processing and Project ResponsibilitiesProcess business and individual tax returns including binding and assembly, utilizing firm determined processes and procedures and firm tracking systems to ensure all data is entered.Produce, format and edit letters, reports and other documents in Microsoft applications.QualificationsKNOWLEDGE, SKILLS, AND ABILITIES:"}