{"jobID": "2804552213", "jobLocation": "Newark_NJ", "jobTitle": "Client Development Representative", "companyRating": null, "companyInfo": {"Website": "www.ykkap.com", "Headquarters": "Austell, GA", "Size": "501 to 1000 employees", "Founded": " 1991", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Kawneer, Oldcastle BuildingEnvelope, Tubelite"}, "estimatedSalary": null, "jobDescription": "Position Summary The purpose of this position is to interact with customers and architects to develop deep relationships by providing solutions to their daily needs through services that include, but are not limited to, account inquiry, order entry, product solutions, estimating support and services by performing the following duties. Essential Functions and Key ResponsibilitiesSpeaks with customers by phone or in person and receive orders.Performs order entry for non-configured items and configured items by keying purchase information into the computer program.Handles and resolves customer complaints and billing issues.Acts as liaison between customers, sales group, and manufacturing facility.May solicit sales of new or additional services and assists customers with the pricing of standard materials.Reviews architectural plans and other data to determine material and labor requirements to produce itemized lists. May require consultation with an applications engineer.Prepares documents including material take-offs, estimates, quotes, quote logs, and the Scope of Work; reviews these documents with the Supervisor(s) when needed.Consults with clients, vendors, or other individuals to discuss and formulate estimates and resolve issues.Interfaces with other individuals in the organization to obtain support and commitment to the cost estimates.Speaks to architects to assist in obtaining information to support the design needs of their projects including preliminary design details, budget estimates and other product application needs all oversight from the Solutions Center Manager and/or Engineering Center.Analyzes completed projects to compare estimated costs to actual costs and determine the reason for any discrepancies; provide improvement recommendation.Qualifications and Skill RequirementsAssociate's degree or equivalent from two-year college or technical school in construction or estimating plus 1 - 3 years of related experience in commercial glazing, commercial construction, residential construction, building facade or architectural aluminum industry; or equivalent combination of education and experienceBe vigilant about safetyQuality - conscious, oriented to excellenceAbout the Company Our company culture is built upon YKK’s philosophy called the CYCLE OF GOODNESS™. We believe that providing value and being fair to our customers and our employees are what makes us a successful company in return. Guided by our core values and fundamental behaviors, we strive to foster a caring company, committed employees and challenging work that benefits our employees, customers, and communities. We offer competitive compensation packages, training and advancement opportunities. YKK AP America provides employees with a comprehensive benefits package designed to provide the security they need to enjoy life at home and at work. By providing a high level of benefit coverage at reasonable cost to the employee, we hope to foster a long and productive employment relationship.  Equal Opportunity Employer / Minorities / Women / Veterans / Disabled"}