{"jobID": "2804770130", "jobLocation": "Emeryville_CA", "jobTitle": "Paid Social Media Manager", "companyRating": "4.3", "companyInfo": {"Website": "www.justmedia.com", "Headquarters": "Emeryville, CA", "Size": "51 to 200 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "57000", "jobDescription": " Description In the ever-changing landscape of digital media advertising, paid social media is the front-runner of this evolution. In the past year, we’ve seen Facebook launch engagement retargeting capabilities, LinkedIn build Lead Generation ad units, Snap Inc. launch a self-serve advertising tool and Instagram start experimenting with paid ads within Stories. In the wake of all this, brands and businesses need guidance on how to effectively run a paid social media campaign. Enter, the Paid Social Media Manager.The Paid Social Media Manager will be responsible for understanding the intricacies and best practices for paid advertising on Facebook, Twitter, LinkedIn, Instagram YouTube and Pinterest. He/She will build, launch, optimize and report on paid social media campaigns for a variety of different clients in both B2B and B2C sectors. Additionally, he/she will have the motivation to expand their knowledge into the broader scope of digital media advertising technology and strategy. POSITION REQUIREMENTSBachelor’s Degree, preferably in Marketing or Advertising; or equivalent work experience2+ years of experience in online advertising, specifically with paid socialProficient in MS Office, particularly Excel, PowerPoint and OutlookKnowledge and understanding of paid vs. organic social media strategyFacebook Power Editor ExperiencePaid advertising experience in LinkedIn, Twitter, YouTube and PinterestExceptional organization and communication skillsHighly motivated with a strong desire to meet or exceed expectationsExceptional attention to detail and the ability to meet aggressive deadlinesUnderstanding of integrated marketing communications and the digital media landscapeA good sense of humorThe Following Skills are a Huge Plus (Not required)Adobe Analytics and/or Google Ad Words ExperienceAd Serving ExperiencePrimary ResponsibilitiesFocus on platforms, integration, marketing tech- person is motivated by personal advancement. Gets the Bigger Picture; Can think strategically for the account/client and offers meaningful insights beyond performance reports.Take full ownership of client accounts and demonstrate competency for responsibilities such as campaign planning, strategy recommendations, budgeting, managing client relationships, etc.Play a large role in strategy and recommendations process for new campaigns and clientsAbility to onboard new clients and work with all internal teams throughout onboarding processOrganize campaign materials and set up ads in Facebook, Instagram, LinkedIn, Twitter, Pinterest, and/or YouTubeSet up and organize tracking links for social campaignsPull weekly or bi-weekly reports from the platforms, organize data within Microsoft Excel and PowerPointAnalyze reports and recommend optimizations for improving campaign performanceBe a resource and training internal social team on new capabilities, processes, platforms etc.Perform training for new hires, internal social team, and agency-wide on new capabilities & processesWork directly with the team supervisor to oversee the team and provide guidance and feedback when necessary.Additional duties as assigned or requestedApply"}