{"jobID": "2822838141", "jobLocation": "San_Jose_CA", "jobTitle": "CDL-A Regional Truck Driver, Company Driver, Hayward", "companyRating": null, "companyInfo": {"Website": "www.trimac.com", "Headquarters": "Houston, TX", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Transportation & Logistics", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Potential To Earn Up To $83,200 Hauling Regional Chemicals  $1,500 Sign-On Bonus  Trimac Transportation is currently looking for Professional Company Truck Drivers for our Chemcial operation in Hayward, CA. If you are looking for a safety-oriented company that provides consistent work partner with Trimac Transportation!  Loads of Work  Hauling Chemicals  Pick-up Points: Hayward, CA and Kettleman City, CA  Deliver: Hayward, CA and Kettleman City, CA  $1,500 Referral bonus Benefits Paid Weekly Direct Deposit  Paid Orientation  Vacation Pay  Two weeks- Year 1 & 2  Three Weeks- Years 3-9  Four Weeks- Years 10-15  Over 15 years 5 weeks  Sick pay  Holiday pay  Medical, Dental, and Vision insurance  Employee Assistance Program  Life Insurance, Disability Insurance  Flexible Spending Accounts (Health & Dependent Care)  401 (K)Profit sharing with company match- (Fully vested after 3 years)  Tuition Reimbursement available, if eligible Minimum Hiring Requirements: Valid Class A Commercial Driver’s License (CDL)  Hazmat / Tanker Endorsements  1 year verifiable tractor trailer experience in the past 3 years; 2 years experience in the past 5 years; 5 years experience in the past 10 years  No previous driving record involving consumption of illegal or intoxicating substances in the past 7 years.  Not involved in a major preventable accident in the past 3 years (Includes rear end crashes and DOT recordable crashes)  No involvement in a preventable rollover or fatality crash within the previous seven 7 years  No more than 2 moving convictions in the past 3 years.  Consistent and Stable work history.  Trimac Safety Commitments  We make Safety a part of every decision  We make Safety personal  We have the courage to intervene  Attention Veterans with Military Driving Experience  You served our country faithfully, now come join us in serving you and take advantage of your skills and let’s continue serving together. Please visit our Military Transport Path page. Walk-Ins Welcomed and Encouraged: Apply in person Monday -Friday 8am to 4pm The branch can be located at: 3751 Breakwater Ave, Hayward, CA 94545  Trimac, the premier provider of bulk transportation services, specializes in the safe, timely transport of chemicals, industrial gas, dry bulk and other tanker freight. Trimac has career opportunities for safety-minded company drivers. From local and dedicated, to regional and OTR, Trimac offers a variety of opportunities to meet your needs. With industry-leading pay, extensive benefits and quality home time, you’ll find a long-lasting career with Trimac.  We offer the best paid training in the industry! Whether you’re a recent CDL school graduate, a former military service member or an experienced driver, Trimac Transportation has the perfect career opportunity for you!  Trimac Transportation is an equal opportunity employer that is committed to employment equity.  We value a diverse workforce and are committed to hiring practices that are fair and equitable."}