{"jobID": "2768988284", "jobLocation": "New_York_NY", "jobTitle": "Data & Analysis Intern", "companyRating": null, "companyInfo": {"Website": "www.brightpower.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We collect and analyze thousands of utility bills in pursuit of valuable insight for our clients. The Data & Analysis intern will help our data and energy analysis teams in this pursuit. The intern will work with the Bright Power team to understand data processing tasks and deadlines. In addition they will communicate with property managers/owners and utility companies to get energy and water data, follow up to obtain complete and accurate information, and input energy and water data, in a timely and accurate manner, into Excel documents and EnergyScoreCards online software. Join Us Bright Power has been a transformative player in clean energy and sustainable housing for 12 years. Our Clients include affordable housing owners and developers, Fortune 1000 financial and real estate investors, privately held firms, and some of the nation’s largest property managers.  We are passionate about reducing energy and water usage through the implementation of energy efficiency and renewable energy technologies. Our goal is to improve the health, comfort, and value of our client’s buildings, while cultivating a sustainable future. We believe deeply in doing well by doing good, and come to work every day seeking to change the world. Primary TasksSupport EnergyScoreCards analysis and reportingSupport collection of utility dataMiscellaneous administrative tasks in support of the Data and Analysis departmentSkills PreferredProficiency in MS Excel (data manipulation and basic formulas)Excellent attention to detailExcellent time management skillsGood written and oral communication skillsCreative and pro-active problem solving abilitiesExperience with SQL and PythonSome experience/exposure to energy and building scienceInterest in sustainabilityEqual Employment Opportunities Bright Power provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Bright Power complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.  Bright Power expressly prohibits any form of workplace harassment based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status. Improper interference with the ability of Bright Power’s employees to perform their job duties may result in discipline up to and including discharge. Salary commensurate with experience. Applications submitted without cover letters will not be considered."}