{"jobID": "2830056605", "jobLocation": "New_York_NY", "jobTitle": "Operations Associate", "companyRating": "3.3", "companyInfo": {"Website": "www.getfelix.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "38000", "jobDescription": "WE THINK BIG, WE LEARN FAST, WE GET THINGS DONEWe are looking for an energetic critical-thinker who wants to become a crucial asset to a growing start up. Hone your analytical skills and develop operational acumen in a dynamic and fun environment.Felix is a leading local advertising technology company dedicated to bringing the power of online advertising to all local businesses. Our solutions make it easier for consumers to find and transact with local businesses. We founded this business over 10 years ago on the premise that for Felix to do well we have to do right by our clients and develop strong relationships with them; which is why we value integrity, passion and fun so highly in our team of extraordinary professionals.Felix is a vibrant and growing young company that falls under the IAC umbrella, along with sister companies such as OKCupid, Vimeo, CollegeHumor, Match.com, Ask.com, About.com and dozens of other successful internet brands. Located in the heart of Manhattan, we are growing fast and need smart talented individuals to join our team!BECOMING A FELIX OPERATIONS ASSOCIATEWHO WE ARE LOOKING FORSomeone who is eager and determined to help grow not only the company, but their own skillsets as well.Data lovers that enjoy manipulating and evaluating large data sets, finding meaningful trends to help streamline and improve performance within the business.Highly organized candidates with great communication skills.Someone who wants to become an integral part of a close-knit team of fun loving and intelligent young professionals.Candidates should also have:A detail-oriented mind and the ability to follow-through.Proficiency in ExcelStrong problem solving skillsAmbition, strong work ethic, and willingness to learnSharp, professional demeanorAbility to take ownership of assigned responsibilities and campaignsDesire to track and report on trends and outcomesAbility to roll with the punches in a dynamic environmentExperience with or a desire to learn SQL0-2 years’ relevant work experienceTHE JOBDaily, weekly and monthly reporting and analysis on important company KPIs.In addition to ongoing reporting, completion of ad-hoc project requests: pulling the raw data needed, conducting necessary audits and analyses, summarizing findings.Working with our offshore operations and sales team, as well as all internal departments. Listening to, analyzing, and reporting on phone calls for quality assurance and research.Performing any other duties that are necessary for the smooth and efficient execution of day to day operations.BENEFITSFelix offers a competitive compensation package, as well as a comprehensive benefits program, including:Health insurance, with options for dental and vision coverageA relaxed work atmosphereA vibrant and fun group who works hard and plays hardPaid vacation, personal, and sick time401kFree breakfast, lunch, and dinner** All benefits listed are subject to change.Felix is an equal opportunity employer.To learn more about our company, culture, and how we’re trying to change the world, log on at www.getfelix.com."}