{"jobID": "2805039879", "jobLocation": "Houghs_Neck_MA", "jobTitle": "Data Analyst (Quincy", "companyRating": null, "companyInfo": {"Website": "www.shieldshealthsolutions.com", "Headquarters": "Quincy, MA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Business overview: As the first and largest specialty pharmacy integrator and accelerator, Shields Health Solutions sits at the nexus of the $200B specialty pharmacy industry. Shields builds and manages hospital-owned specialty pharmacies for health systems who want to offer coordinated care services for patients with chronic illness. Our patient-centric TelemetryRx platform enables health systems to improve medication adherence, reduce patient readmission rates, and ultimately improve health outcomes through the collection and distillation of clinical, behavioral, and financial data. Shields Health Solutions is one of the fastest growing healthcare companies and has proven its immense impact on patients' lives. Whom we are looking for: We are searching for an analytical and energetic team-member who is looking for a challenging career with a fast-growing company in HealthTech. We want to meet with those of you who measure yourself on results, statistical rigor, and quality. You should be as excited by data analytics as we are; gleaming insights from noise to portray a story that informs how we think about our business. Having the foresight to anticipate potential issues and the action-bias to propose solutions. We want to rely on you to complete your work without constant oversight; we will guide you along the way to success but do not micromanage. Most importantly, we all work together as members of a close-knit team, supporting and learning from one another. If you smile reading through this, we want you on our team. What you will do: Enable the success of our Data Analytics team including our innovative TelemetryRx platform. We will ask to you complete analyses of opportunities to attract new patients, improve our care model, and analyze the financial success of our business. Importantly, you will be a key member of the team that provides detailed data and quantitative analysis, statistics and trends reporting, and predictive modeling that support sales, operations, finance and executive teams. Specific Skills/Qualifications:Experience in quantitative and data analysis; predictive modeling; strong business judgment and overall analytics skills.Demonstrated statistical and analytical ability with programming expertise in R.Highly proficient in Microsoft Office particularly Excel; statistics and trends reporting; strong modeling and data aggregation, manipulation and mining is a must. Experience with SQL is a plus.Energetic, highly motivated, organized, attention to detail; a team player with strong personal and communication skills; discretion and confidentiality essential as position deals with highly sensitive and private data.Job Duties:Achieves operational objectives by contributing information and detailed data analysis using R or similar programs;Assist in developing data and quantitative analysis to build predictive models;Prepare daily, weekly and monthly reports and provide insights on key company functions;Optimize, monitor, and maintain existing reports;Assist with ad hoc questions and data needs;Develops, implements and maintains program forecasting models; track performance vs. forecast; communicates discrepancies to the organization;Guides other departments by researching, analyzing and interpreting data;Applies observations and recommendations to operational issues, increased productivity, quality, and customer-service standards;Identifies trends, resolves problems; determines system improvements; implements change;Reviews of new business opportunities to identify the impact to the financial outlook of the organization;Actively participates in process improvement initiatives;Acts as a strategic and value-added business partner to stakeholder throughout the organization;Protects organization's value by keeping information confidential;Updates job knowledge by participating in educational opportunities; reading professional publications; maintaining personal networks; participating in professional organizations;Is willing to do whatever is necessary for the betterment of the Company;Other duties as assigned;SDL2017"}