{"jobID": "2755009309", "jobLocation": "San_Jose_CA", "jobTitle": "Senior IO Applications Engineer", "companyRating": "3.7", "companyInfo": {"Website": "www.xilinx.com", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 1984", "Type": " Company - Public (XLNX) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Qualcomm, Intel Corporation, AMD"}, "estimatedSalary": "102000", "jobDescription": "DescriptionThis position will be part of Silicon applications engineering team focused on advanced high speed FPGA I/O interfaces. Job responsibilities include testing in hardware, building custom designs using Verilog or VHDL, creating application notes, datasheets and user guides. This position interfaces directly with silicon and software engineering groups, and is the primary interface between the engineering teams and escalated customer support issues. Strong background in RTL development and verification required. Experience in Silicon bring-up, hardware debug and customer interaction preferred. Proven track record of leading cross-functional projects is highly desirable.Qualifications:BSEE or BSCE with 6-7 yrs experience or MSEE/MSCE with 5-6 yrs experienceStrong background in RTL development and verificationExperience in Silicon Bring-up and Hardware debugLab experience – familiarity with oscilloscopes, logic analyzers and basic debug techniquesFamiliarity with programming/scripting language Excellent written and verbal skills.FPGA or ASIC design background preferredEffective project planning and executionXilinx is the leading provider of All Programmable FPGAs, SoCs, MPSoCs and 3DICs. Xilinx's all-programmable devices are designed into tens of thousands of products that improve the quality of the everyday lives of billions of people worldwide. For over 30 years, Xilinx has been behind some of the greatest advancements in technology and science - from the industry's first fabless semiconductor model to the NASA Curiosity Mars Rover, to today's autonomous vehicles and hyperscale data centers. Xilinx uniquely enables applications that are both software-defined, yet hardware optimized - enabling smart, connected and differentiated applications across technology's biggest megatrends, including Machine Learning, 5G Wireless, Embedded Vision, Industrial IoT and Cloud Computing and more. If you are a passionate, innovative and an out-of-the-box thinker that enjoys challenging projects, Xilinx is the right place for you. Our global team is growing and we are looking for bold, collaborative, and creative people to help deliver groundbreaking technologies that enable our customers to differentiate. Come do your best work and live your best life through collaboration, wellness and giving back to your community as a member of the ONEXILINX team.PPG Product Application EngineerCustomer AwarenessDeveloping understanding of customer flows and expectations, and can provide pre and post-sales support with guidance. Dealing with AmbiguityExecutes to plan and stays motivated even while gaining better understanding that things change. Seeks guidance from management whenever in doubt to stay fully engaged. Works with management to ensure they are aware of potential gaps that may cause uncertainties within the team.Indirect InfluenceNegotiates across group boundaries under guidance. Seeks to identify alignment to common goals to get agreements for new work. Works with management if alignment can not be achieved.Product KnowledgeHas understanding of the entire FPGA design process and tool flow, with expertise in at least one technology area.Technical AcumenSeamlessly integrates foundational semi-conductor knowledge with specific knowledge of Xilinx IP, tool, and device functionality to enhance technical sales support Clearly identifies and prioritizes where Xilinx technology can cost-effectively make the most significant contribution to the achievement of customer goals or resolution of customer challengesTechnical Product SkillsHas completed Advanced training Can handle basic debug of any unique/hot issues/critical escalations/ESP cases Significant experience using the product Can solve problems autonomously with no help Typically has high knowledge level on general issues Can perform advanced debugging steps for known issues Have at least 1 Advanced Level Expertise and begin working on a secondary Advanced Level expertise Accepts escalations from Advanced experts Completed Gold Level CertificationSharedCommunicationSelecting suitable communication techniques based on circumstances Using a positive inquiry approach with others to explore their needs and to openly share knowledge Using creative and critical thinking skills to explore and share knowledge with others Effectively uses formal and informal communication efforts to express concepts, strategies, information and inspiration that affect the listener in the desired manner. Using effective listening and observational skills to reflect information back to peers in a constructive manner and being open to receiving the same Demonstrating awareness, discretion and thoughtful communication practices Shares relevant information and feedback in order to maintain high standards and performance. Convincingly presents analysis and recommendations to peers and senior management. Crafts material to be relevant to non-technical audiences. Demonstrates confidence when speaking or facilitating to an audience. Design Enablement (Tools/System/Practice)Exercises a solid understanding of how circuit blocks are architected, developed, integrated, and verified through testing to achieve specification-compliant deliverables (e.g., CAD modeling, RTL coding, circuit architectures, building circuit specifications, applying simulation techniques, implementing verification testing methods) Capable of mentoring junior engineers in the tips and tricks of tools used at Xilinx. Applies technical innovation in the use of standard design implementation tools and methods (system portioning). Adapts design implementation methods as required, cognizant of the challenges inherent in new technologies Works effectively with new tool sets and ensures that the right tools are selected for hardware design implementation. Capable of providing inputs to more senior team members on issues to improve the tools.Design Process and MethodologyDemonstrates flexible adaptability in working with still maturing, generation-dependent design and testing methods Provides design management (e.g., CAD department) with feedback on the efficiency of proposed methods and associated challenges, based on applied experience Actively monitors Xilinx and industry communications for evolving design methodology practices and changes in approach Ensures compliance with Xilinx engineering practice and methodologies.InitiativeIdentifies what needs to be done and takes action before being asked, when the situation requires it. Does more than what is normally required in a situation. Seeks out others involved in a situation to learn their perspectives. Takes independent action to change the direction of events. Takes prompt action to accomplish objectives and achieve goals beyond what is required.Partnering/NetworkingDevelops networks and builds alliances. Participates in cross-functional activities to achieve organizational objectives. Collaborates across internal and external agency boundaries to meet common objectives. Keeps support areas like budget and HR informed of program priorities, needs, and issues, in pursuit of responsive service.Solution ExcellenceDrives Wazo items with development Reviews PDD documents Identify and supervises Supportability projects Creates supportability reports on WTS case and knowledge metrics to influence development and marketing Provides relevant case data and issue analysis to WTS management for quarterly report out Reports customer issues to factory outside of CR filing through monthly Case reviews or Issue Case studies Create Debug guides Provide assistance and the customer perspective within Factory. Creates Wazo items on strategic gaps Represents the customer in PDD review Represents the customer in Use Case definition Works with Tactical Solutions Teams (TSTs) to anticipate Support challenges in upcoming Xilinx Products Technical Communication and TrainingCan simplify more complex subjects and make them understandable. Can get points across to other groups, and understand their needs. Can prepare and present good presentations for technical audiences in their area of expertise. Can define and create well-received training materials for a limited portion of the toolset, for specific audiences upon request. Can author accurate documentation, proposals, and specs for their functional areas under guidance and review. Testing AcumenReviews and understands testing methodology to ensure broad and complete coverage. Provides feedback where appropriate.Training and DevelopmentComprehensive understanding of adult learning theory and techniques, employee development trends, technology-based training methods and best practices for encouraging employee participation in the development process. Conducts needs analysis, presents results to leadership and others who are necessary to develop learning objectives and curriculum. Evaluates audience comprehension of material. Obtains industry performance data and related best practices regarding training and development new initiatives. Verification and ValidationCreates verification plans at the block level Understands protocols and standards associated with products Collaborates with program management to verify that components meet technical specifications and quality requirements (e.g., power efficiency, area efficiency, ease of use) Collaborates with other hardware and software groups to ensure effective component integration within the larger system Supports Test Engineering or customer verification engineering teams in the setting up of valid test verification criteria and plans Supports Applications Engineering in debugging customer issues Troubleshoots component blocks as required to ensure milestone achievement and production-ready integration (e.g., specifications, performance, standards) Manages regression suites for products, and contributes to the tool flow Acts on verification test data to ensure seamless component integration, device manufacturability, and sign-off acceptability if applicable (e.g., customer sample feedback, iterative tape-out production turns involving 3rd parties) When required, creates environment and infrastructure to test designs in a HW verification environment, and running test scenariosEducation RequirementsBSEE/BSCE with 6-7 yrs experience or MSEE/MSCE with 5-6 yrs experience"}