{"jobID": "2789419267", "jobLocation": "San_Francisco_CA", "jobTitle": "Graphic Design Intern", "companyRating": "4.0", "companyInfo": {"Website": "www.motivworks.com", "Headquarters": "Seattle, WA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "45000", "jobDescription": " Motiv is looking for a Graphic Design Intern to join our Brand & Marketing team. This is a small yet nimble team, with opportunity for growth and experience in a fast-paced tech start-up environment.We are: Based in San Francisco, were a forward-thinking group with backgrounds that run deep in hardware, software, design, and data science. Weve created everything from products you use every day to advancements that have taken us far into space. Together we share a commitment to creating solutions that connect the human body with technology in an almost magical way. Join our quickly growing team of amazing people and enjoy your days at our casual and creative SOMA office. We are seeking just the right fit of personality, brains, skills, and desire. You will contribute creativity, craftsmanship, and design thinking to solve problems for our marketing team and work on a wide range of projectsfrom social content, to web design, to marketing collateral, all consistent with our brand. We are looking for someone who can bring the same level of enthusiasm and insight to everything from presentation to POS design. We are looking for a creative, detail-oriented designer who is looking to collaborate with a small team and stretch your creative legs. You love being in the thick of things, involved in a wide range of projects, and going beyond the expected. You have a high bar for quality and craft.What you will do Website design Social Media graphics/content Blog/Support assets and content Press kits and media assets Email templates and content Ad creative and campaign assets Sales and Marketing content and collateral Internal documents, presentations and decks Product support assets and content Content/listings and asset production for Amazon as neededWhat you will bring A passion for and understanding of designs role in communication, problem-solving, and brand. Solid foundation in visual designcolor, typography, layout, hierarchy. Able to effectively communicate design rationale and point-of-view, both written and verbally."}