{"jobID": "2741322856", "jobLocation": "San_Jose_CA", "jobTitle": "Client Technical Professional -Watson Internet of Things, IBM Tririga", "companyRating": "3.6", "companyInfo": {"Website": "www.ibm.com", "Headquarters": "Armonk, NY", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Public (IBM) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Accenture, Microsoft"}, "estimatedSalary": "141000", "jobDescription": "Job Description IBM is looking for an experienced Client Technical Professional (CTP) to represent IBM Tririga in a pre-sales role. As a member of the Watson Internet of Things Client Technical Professionals (CTP), you will drive the execution of all technical activities required in support of meeting revenue targets and supporting customers IoT business initiatives throughout the sales cycle. As a CTP, it will be your responsibility to understand the customers business and operational requirements and translate these requirements into the delivery of a compelling demonstration that will exceed expectations, and one that differentiates IBM from the competition. You will possess a deep understanding of the Watson IoT Asset Management platform (of which Tririga is a part of); understanding of the technical architecture, as well as the cognitive analytics and business intelligence layers of the solution(s). You will work directly with the Sales team to identify opportunities and lead technical sales strategies to meet customers requirements. You will articulate and demonstrate the value that IBMs Watson IoT solutions provide to our customers. You provide technical sales support which may include: collaboration with IBM sales teams to define, design, and detail the technical aspects and feasibility of proposed solutions; lead and deliver Proof of Concepts; develop and deliver customized demonstrations; support critical situations; and answer technical questions. As a member of the sales team, you will be engaged in customer facing activities, be responsible for the technical accuracy of the proposed solution, and lead the technical aspects of the sale.  The ideal candidate should be comfortable working independently as well as collaboratively in a dynamic team atmosphere. You must be self-motivated with a proven track record of consistently delivering strong business results and team success. In this customer facing role, strong oral and written communication and presentation skills are required. The role requires an organized and analytical individual, able to eliminate sales obstacles through creative and adaptive technical approaches. Responsibilities:Enterprise-level business selling and consulting skills working in a technical sales capacityDeliver value based demonstrations to clients to help them envision and ultimately achieve value.Use technical and business acumen to build and maintain relationships with key customer decision-makers, and actively seek new projects/opportunities to sell additional softwareProvide technical expertise on solution design and deployment best practices within IBM's technology with a strong focus on IBM TRIRIGA softwareHarvest and share reusable intellectual capital and Integrated Workplace Management System (IWMS) experiencesUnderstand how IBM TRIRIGAs offerings compare, contrast, and integrate with the customers existing software investment from IBM, business partners, and the competitionBuild relationship networks with knowledge sources inside and outside of IBM, and leverage those relationships to increase sales of IBM TRIRIGAProactively monitor and promote deployment of purchased software products to maximize deployment against targets and eliminate software reversals.Drive client references to promote software sales Required Technical and Professional Expertise At least 5 years of experience in the Integrated Workplace Management System (IWMS) industryAt least 5 years of experience in delivering IWMS Software Solution demonstrationsUnderstanding of IWMS processes and product offeringsExperience with the IBM TRIRIGA solutionKnowledge of Integrated Workplace Management Systems (IWMS) & Enterprise Asset Management (EAM) with associated qualificationsUnderstanding of one or more markets/industries where IWMS is essential to its operational side of its business.Familiarity with the tools in the TRIRIGA product line Preferred Tech and Prof Experience Well versed in the new Financial Accounting Standards Board (FASB)/ International Accounting Standards Board (IASB) financial accounting changesProven technical depth in foundational enterprise technologies such as operating systems (Linux and Windows), relational database tooling and organization (schema definitions, SQL, query execution), VMware, Java, HTML, Python, business intelligence/reporting (BIRT, Crystal, Watson), Enterprise Asset Management systems and leading IWMS marketplace solutions (TRIRIGA, Maximo) EO Statement  IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status. "}