{"jobID": "2645520535", "jobLocation": "San_Jose_CA", "jobTitle": "Industrial Hygiene", "companyRating": null, "companyInfo": {"Website": "www.navy.com", "Headquarters": "San Diego, CA", "Size": "1001 to 5000 employees", "Founded": " 1775", "Type": " Government", "Industry": " Government", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " \"About This JobNavy Industrial Hygiene Officers provide risk characterization, hazard control recommendations and direct consultation to Commanding Officers and other leaders on operational policies and procedures necessary to protect the health and safety of Sailors and Marines around the globe.They focus on developing engineering and administrative controls, and recommending personal protective equipment necessary to properly safeguard people, installations and equipment by managing risk within working, living, and operating environments worldwide.Navy IHOs:Provide direction worldwide to the Department of the Navy (DON) Environmental and Occupational Health, Industrial Hygiene, and Safety programsServe as advisors for environmental and occupational health issues to reduce injury and disease risks among Navy and Marine Corps personnel, both afloat and ashoreLead large multidisciplinary departments and directorates such as Occupational Health and Preventive Medicine, fill critical staff positions at higher headquarters commands, and provide technical expertise at research facilities and laboratoriesConduct inspections and training functions in industrial or operational settings aboard ships, at shore-based workplaces or in the field with Navy Sailors and MarinesAs an IHO in the Navy Medical Service Corps you will accept responsibility for a broad and rapidly expanding array of environmental and occupational control programs including: Occupational Exposure Assessment Medical Surveillance Hearing Conservation Heat Stress/Cold Injury Ionizing and Non-Ionizing Radiation Safety Environmental Compliance Respiratory Protection Ergonomics Industrial Safety Hazardous Material storage, assessment, and disposal Detection, assessment and monitoring of chemical and biological agents in wartime and natural disaster contingenciesWith more than 120 duty stations around the globe, IHOs may serve anywhere from an aircraft carrier, to an overseas U. S. Naval Hospital, to a Preventive Medicine unit, to a Marine Corps command. There are numerous opportunities to live overseas including Hawaii, Guam, Italy, Spain, Bahrain, Japan and Cuba.\""}