{"jobID": "2822498519", "jobLocation": "New_York_NY", "jobTitle": "Data Science Intern", "companyRating": null, "companyInfo": {"Website": "www.animoto.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Apple"}, "estimatedSalary": null, "jobDescription": "At Animoto, we believe that everyone should have the power to create professional-quality videos. To get there, our approach has always been about bringing in the smartest, and most passionate people who care as much about our product as they do about each other. If that sounds like something youd want to be a part of, and you fit the description below, wed love to hear from you.Animoto is looking for a Data Science Intern with a strong understanding of statistics, data mining modeling techniques, and tools. The internship will be focused on helping the company create predictive lists for our email marketing. The right candidate will demonstrate in-depth strengths in mathematics, computer science, statistics, and business savviness. This is a 2 month long internship in our NYC headquarters. What youll be working on: Using supervised, unsupervised, and reinforcement machine learning to help identify the hidden relationships within and across databasesWhat were looking for:Background in mathematics and statisticsFluent in at least one scripting language (preferably Python and/or R)Familiarity with relational databases and SQLExperience in machine learningFamiliarity with supervised, unsupervised, and reinforcement machine learning algorithmsStrong written and verbal communication skills (and of course the ability to present data well)Bonus Points:Familiar with AWS technologies like RedShift Why You'll Want to Work for Animoto: Animoto is a bunch of hard-working, fun-loving folks who love our Noho office, make awesome products and support our equally great customersFun, open office (http://www.businessinsider.com/animotos-nyc-office-2013-4) the front of our office, with huge windows overlooking Lafayette, doubles as a spot for many of us to gather for lunch and a coffee shop - replete with a constant stock of fresh beans and a bunch of coffee machines to play withVoted Crain's Best Places to Work (\"Heaven for fun-loving, creative types\")At Animoto, we believe that video is the future of communication and that all businesses learn to speak video. To achieve this vision we bring together world-class storytellers, product designers, motion graphics specialists, and engineers to make it easy for any business to become fluent in video, in minutes. Animoto Marketing Video Builder is an easy-to-use online video editor with a large selection of pre-built storyboards that businesses can customize to make engaging, shareable content for their audiences on social media.At Animoto, we help our customers communicate who they are, what they do, and what they love through video. Our users are connected by the desire to use video to share what matters most to them, but come from all walks of life and are passionate about all sorts of different things. Were proud to help them share these passions. Similarly, we embrace the differences of our team members and actively seek diversity of beliefs, backgrounds, education, and all the other things that make us unique. We strive to create a space where employees can bring their true selves to work every day. By doing so, were building an inclusive culture where we can continue innovating for our customers. We too are united in the belief that our voices are even more powerful when using video to communicate, and we aim to have a workplace that reflects the variety of our users. Animoto is proud to be an equal opportunity workplace and affirmative action employer."}