{"jobID": "2712406766", "jobLocation": "Waltham_MA", "jobTitle": "Senior Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.care.com", "Headquarters": "Waltham, MA", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Public (CRCM) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "66000", "jobDescription": " Care.com is the largest and fastest-growing technology platform for online care services, helping families, businesses, and corporate employees find high-quality care for their kids, pets, parents, and homes. We’re seeking innovative, entrepreneurial, and genuinely nice people to join our collaborative team. If that describes you, we want to hear from you! A career at Care.com offers countless ways to grow and have a real effect on a young, exciting company. Overview The Senior Data Analyst will be part of our centralized Analytics team at Care.com, which serves multiple departments and business units for their analytical and business intelligence needs. The Analytics team works closely with business and technical teams, overseeing data structures and quality while also ensuring that data is properly leveraged to inform business decisions.  The Senior Data Analyst will work with various departments across Care.com to understand their analytical questions, then collect, manipulate, and analyze data from different sources using a variety of techniques, ranging from simple data aggregation to complex data mining. S/he will interpret & present analytical results to different business stakeholders.  The ideal candidate will have 5+ years of experience as a Data Analyst. S/he will enjoy working with data, demonstrate strong business judgment and be able to prioritize in a fast-paced environment. Specific Duties/ResponsibilitiesSupport the business on general analysis and strategic projects; meet with stakeholders to understand analytical needs and define metrics/KPIs/reportsEnsure on-time & accurate delivery of regular KPIs, reports and forecastsPerform data analysis on user behavior to inform product featuresMaintain deep and up-to-date knowledge of the data warehouse; troubleshoot data inconsistenciesTranslate business needs into analytical tasks, documenting & presenting resultsBuild and maintain dashboards to track product usage and performanceSupport CRM team in assessing performance of email and on-site marketing campaignsInterpret results using a variety of techniques, ranging from simple exploratory data analysis to statistical modelingRequired SkillsRequired ExperienceAnalytically oriented with ability to interpret trends and correlationsStrong knowledge of database & data warehousing conceptsExperience writing complex SQL queriesKnowledge of A/B testing and statistical principles (e.g. regression) preferredExperience with R, Python, or related programming language preferredMicrosoft Excel proficiency, including pivot tables, look up functions and chartsExperience with Tableau or other reporting/BI tools preferredExperience documenting & presenting analytical results & product requirementsStrong communication skills and ability to collaborate with stakeholders at different level of the organizationDemonstrated ability to maintain performance level in a fast paced agile environment with changing priorities and deadlines Education/Other Pre-requisites"}