{"jobID": "2822206494", "jobLocation": "Seattle_WA", "jobTitle": "Director, Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "us-jobs.kpmg.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1987", "Type": " Subsidiary or Business Segment", "Industry": " Accounting & Legal", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " PwC, Deloitte, EY"}, "estimatedSalary": "189000", "jobDescription": " Innovate. Collaborate. Shine. Lighthouse KPMG's Center of Excellence for Advanced Analytics has both applied data science, AI, and big data architecture capabilities. Here, you'll work with a diverse team of sophisticated data and analytics professionals to explore the solutions for clients in a platform-diverse environment. This means your ability to find answers is limited only by your creativity in leveraging a vast array of techniques and tools. Be a part of a high-energy, diverse, fast-paced, and innovative culture that delivers with the agility of a tech startup and the backing of a leading global consulting firm. For you, that translates into the chance to work on a wide range of projects covering technologies and solutions from AI to optimization and the power to have a real impact in the business world. So, bring your creativity and pioneering spirit to KPMG Lighthouse.  KPMG is currently seeking a Director to join our KPMG Lighthouse - Center of Excellence for Advanced Analytics. Responsibilities:Retrieve, prepare, and process a rich data variety of data sources such as social media, news, internal/external documents, emails, financial data, and operational dataAnalyze and model structured data and implement algorithms to support analysis using advanced statistical and mathematical methods from statistics, machine learning, data mining, econometrics, and operations researchPerform Statistical Natural Language Processing to mine unstructured data, using methods such as document clustering, topic analysis, named entity recognition, document classification, and sentiment analysisUtilize a diverse array of technologies and tools as needed, to deliver insights, such as R, SAS, Python, Spark, Hadoop, Qlikview, and TableauTranslate advanced business analytics problems into technical approaches that yield actionable recommendations, in diverse domains such as risk management, product development, marketing research, supply chain, and public policy; communicate results and educate others through insightful visualizations, reports and presentationsPerform exploratory data analysis, generate and test working hypotheses, and uncover interesting trends and relationshipsQualifications:A minimum of ten years of relevant experience and strong knowledge in at least one of the following fields: statistics, data mining, machine learning, statistics, operations research, econometrics, natural language processing, and/or information retrievalMaster's degree from an accredited college/university in Computer Science, Statistics, Mathematics, Engineering, Econometrics, or related fields, PhD is preferredDeep experience in extracting, cleaning, preparing, and modeling data; command-line scripting, data structures, and algorithms; and working in a Linux environment and proficiency in analysis packages (e.g. R, SAS, Matlab) and programming languages (e.g. Python, Ruby, Java, Scala)Ability to translate engagement objectives to a project plan with milestones, and resource/technology requirements, and teach, lead, and manage projects to successful executionAbility to work across multiple engagements with clients to assess needs, provide assistance, and resolve problems, using excellent problem-solving skills and verbal/written communication to non-technical audiencesAbility to travel up to eighty percent of the time. Must be legally authorized to work in the United States without sponsorship of a ViSA. KPMG LLP (the U.S. member firm of KPMG International) offers a comprehensive compensation and benefits package. KPMG is an equal opportunity employer. All qualified applicants are considered for employment without regard to race, color, creed, religion, age, sex/gender, national origin, ancestry, citizenship status, marital status, sexual orientation, gender identity or expression, disability, physical or mental handicap unrelated to ability, pregnancy, veteran status, unfavorable discharge from military service, genetic information, personal appearance, family responsibility, matriculation or political affiliation, or other legally protected status. KPMG maintains a drug-free workplace. KPMG will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of applicable local, state or federal law (including San Francisco Ordinance number 131192). No phone calls or agencies please."}