{"jobID": "2443927689", "jobLocation": "San_Jose_CA", "jobTitle": "Outside Sales Representative", "companyRating": null, "companyInfo": {"Website": "www.sharpusa.com", "Headquarters": "Montvale, NJ", "Size": "1001 to 5000 employees", "Founded": " 1962", "Type": " Subsidiary or Business Segment", "Industry": " Manufacturing", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OverviewAlign yourself with Sharp, one of the most innovative technology companies in the world. Sharp’s rich history of manufacturing cutting-edge products spans over a century, and its longevity has been fortified by the recent alliance with Foxconn, an international Fortune 50 company. Sharp Business Systems (SBS), the direct sales division of Sharp Electronics Corporation, has locations across the U.S. and is made up of local, caring employees who solve customer business challenges through a consultative approach and best-in-class support. SBS is currently at the forefront of the “smart office” revolution and has one of the broadest technology portfolios in the industry including multifunction printers, interactive display systems, workflow automation, IT services, managed print services, and more.ResponsibilitiesThis position works closely with the Branch Sales Manager to expand business and establish new customers while interacting with existing customers to increase sales of an organization's products and/or services. Acts as the focal point for major customer accounts within branch territory.Sells SBS products and services by calling on and maintaining relationships with established and prospective commercial and government accounts within assigned territory.Keeps customers informed about available services, supplies, prices and new products.Responsible for meeting established sales quota.Monitors competitive activity and trends within the territory.Prepares accurate, legible and timely reports as required by management. Recognizes that this activity is an integral part of the position’s responsibility.Maintains a close liaison and coordinates with Sharp sales and service personnel regarding customer problems.QualificationsMinimum 2 years B2B Outside Sales experience.Experience working with key decisions makers (C-level corporate managers)Experience in Technology Sales a plus.Good knowledge of sales, service, and administrative functions.Broad knowledge of the organization's policies, products and/or services.BS/BA in Business administration or related field preferredExcellent written and oral communication skills.A valid driver's license. Benefits: Competitive salary (base salary + uncapped commissions + monthly expense allowance)President’s Club, Sharp’s Ultimate Rewards and Bonus programsExcellent benefits package (including Medical, Dental, Vision, Life Insurance)401(k) plan with matching company contributionGenerous Paid Vacation & Company Holidays policyTuition Reimbursement ProgramSharp Electronics Corporation is proud to be an equal opportunity employer: minority/female/disability/veteran. #LI-SD1"}