{"jobID": "2787829346", "jobLocation": "Morgan_Hill_CA", "jobTitle": "Business Analyst Intern", "companyRating": "3.9", "companyInfo": {"Website": "www.specialized.com", "Headquarters": "Morgan Hill, CA", "Size": "1001 to 5000 employees", "Founded": " 1974", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable", "Competitors": " Trek Bicycle, SRAM, Santa Cruz Bicycles"}, "estimatedSalary": "51000", "jobDescription": " SUMMARY You are interested in strategy/operations but not sure what specific role would work for you? Youve been looking at different job postings and they never meet what you are looking for? You dont really know what you want as a job? If you answered yes to any of those questions, this internship is for you! Specialized is looking for talent that can adapt to any situations and is ready to take new challenges! HOW YOULL MAKE A DIFFERENCE  This role has 2 major components:  Perform detailed and comprehensive analysis to advise the leadership team Analyze global pricing strategies and identify opportunitiesAssist with sales program developmentTake initiatives to improve the quality of its work and add value to the interventions Support and coordinate projects directly connected to multi-channel strategy Assist the ecommerce team with operational support needsWork cross-functionally on several projects that will create new revenue streamsDocument best practices and benchmark against other companies WHAT YOU NEED TO WIN Pursuing / completed college degree with a specialization in commerce or accountingAnalytical thinker; ability to take complex problems and provide simple solutions with sales and margin data.Strong technical abilities of MS Excel (especially pivot tables)Excellent communication skills in EnglishStrong ability to multitasking and to work autonomously and in a team environmentTableau skillset is a plusPassion for cycling How to apply Apply online and make sure to include a great cover letter telling us why you are SpecializedPlease include an updated resume highlighting your relevant experienceAbout Specialized: First and foremost, we are riders. We share the core belief that bikes help make the world a better place. From product development and operations, to finance and marketing - every role at Specialized contributes to a culture of sustainable, global growth and innovation. Around the world, we work to recruit candidates who are passionate and curious with the belief that everyone has the potential to be a leader."}