{"jobID": "2586395879", "jobLocation": "New_York_NY", "jobTitle": "Research Intern (Building Science)", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The International WELL Building Institute seeks a dynamic, intellectually curious, high-integrity professional to join its growing team as a Research Intern (Building Science). The Standard Development team is currently engaged in the research and development of global wellness standards for the built environment. This process involves collaboration with industry professionals and stakeholders in the global construction industry. This position will support the review and analysis of project rulings and technical literature on building ventilation, indoor environmental quality (air quality, thermal comfort, lighting, acoustics) and human health. ResponsibilitiesRun calculations in Excel to assist with project ruling decisionsAssist with analysis of real-life project complications, including HVAC and IEQAssist in conducting basic research, literature reviews and analysis of global standards as well as system and product data sheetsCompare and analyze similarities and differences of different global standardsCandidate Profile & PrerequisitesMaster's candidate or final-year Bachelors candidate in Building Science, Electrical Engineering, Mechanical Engineering, or closely related degreeA strong record of academic achievementMicrosoft Excel whizWorking knowledge of HVAC systemsBackground or familiarity with the construction industryArdent detail-orientation and commitment to delivering high quality workDeep intellectual curiosity and excellent analytic abilitiesMust be a self-starter and comfortable working in groupsCompensation: This is a paid internship. Hourly rates are competitive and commensurate with prior experience. Applications must include cover letters to be considered. Applicants are selected based upon their qualifications for this position and without regard to the applicants race, color, ethnic or national origin, religion, creed, age, disability, sex, sexual orientation, gender identity or expression, pregnancy, marital or partnership status, citizenship or alienage status, veteran status, whether children are, may be or would be residing with a person, or any other characteristic protected by law. About the International WELL Building Institute The International WELL Building Institute (IWBI) is a public benefit corporation whose mission is to improve human health and wellbeing through the built environment. Public benefit corporations like IWBI are an emerging U.S. structure for corporations committed to balancing public benefits with profitability harnessing the power of private capital for greater good. IWBI administers the WELL Building Standard (WELL) a performance-based system for measuring, certifying, and monitoring features of buildings that impact the health and wellbeing of the people who live, work, and learn in them. IWBI was established by Delos in 2013 pursuant to a Clinton Global Initiative commitment to improve the way people live by developing spaces that enhance occupant health and quality of life by sharing the WELL Building Standard globally. WELLcertified.com"}