{"jobID": "2824280644", "jobLocation": "Billerica_MA", "jobTitle": "Intern - Operations&Support; Data Analyst", "companyRating": "2.4", "companyInfo": {"Website": "www.morphotrust.com", "Headquarters": "Billerica, MA", "Size": "1001 to 5000 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "53000", "jobDescription": " Are you looking for an \"Internship\" where you can feel proud of your accomplishments and know you are making a difference in your community and your country? Join MorphoTrust, and you join a world-class team whose mission is to simplify, protect and secure the lives of the American people. We do this through innovative, market-leading identity technology solutions and services. We are \"The Identity Company.\"  Imagine renewing your driver license through an app on your smartphone or using a digital driver license on your phone to prove your identity at a bank or retail store. Our secure credentialing solutions, vetting services, and world renowned biometric technologies, including face, fingerprint and iris images, will enable this in the near future and much more. Now you can take your chosen profession and apply your specific career skills to a technology driven company that is leading the future of identity solutions, and positively affecting the lives of your friends and family on a daily basis.  Now is the time to jump on board and join a company that is growing in a market that is rapidly expanding, evolving and growing in importance! That company is MorphoTrust! JOIN US NOW! Job Summary: This MBA Internship will require significant skills to analyze, track and report on data from multiple sources, and then collaborate on making recommendations for process improvements and improving efficiencies that will lead to cost reductions and profit gains.You may also be involved in helping to analyze and evaluate federal and state contracts that will ultimately result in revenue and profit growth. MorphoTrust fingerprints bout 3 million customers each year and are the prime contractor for the TSA's Universal Enrollment Service (UES), as well as the leading provider of fingerprinting services to numerous agencies and commercial businesses across all 50 states.  Essential Job Functions (includes but is not limited to): Create and/or maintain and enhance daily/weekly/monthly status reportsIdentify, assess and report on current and potential cost issues that can be avoidedRecommend business practices that will help decrease costs and increase profitsAdditional work assigned as neededRequired SkillsBA/BS in Finance, Economics, Business or similarCurrently enrolled in MBADemonstrable data analysis experience in a job, internship or school projectMust demonstrate the ability to think analytically and contribute strategically to the businessExceptional skills in Excel, PowerPoint, CRM systemsStrong understanding of Microsoft ProjectMust be able to function in a fast paced, deadline-driven environment, and must not become flustered by changeExcellent written and oral communication skillsPassionate, driven, self-motivated business-person with an unquenchable thirst for knowledge and achievementDesired SkillsVisual BasicVBASQLJavaRequired Experience Travel Requirement, Working Conditions and Physical Demands: Travel requirement:Must be able to travel occasionally as needed to attend training, conferences, and related activities.Working Conditions, such as:General office environment. The work area is adequately lighted, heated, and ventilated.Physical Demands, such as:Office environment where the employee may sit comfortably to do the work. Some walking, standing, bending, reaching, and carrying of light items such as papers, books, small parts; driving an automobile, etc. Requires eye-hand coordination and manual dexterity sufficient to operate a keyboard, photocopier, telephone, and other office equipment.The work may require light physical effort with frequent lifting and/or moving of materials in the 10-30 pound range and occasional lifting up to 50 pounds, and manual dexterity and ability to manipulate small objects. May require normal range of hearing and vision to operate machinery. Must be eligible to work in the U.S.  IDEMIA is an equal opportunity employer.  We evaluate qualified applicants without regard to race, color, religion, sex,  sexual orientation, gender identity, national origin, disability, veteran status, and other protected characteristics."}