{"jobID": "2722115893", "jobLocation": "Boston_MA", "jobTitle": "Data Science Intern", "companyRating": null, "companyInfo": {"Website": "www.rifiniti.com", "Headquarters": "Boston, MA", "Size": "1 to 50 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Rifiniti provides enterprise business intelligence software to Fortune 500 and other leading global companies, such as Lenovo and Cisco, enabling them to understand how their office space is used, right-size their real-estate portfolios, and redesign their offices to reduce costs and maximize employee productivity, innovation, and satisfaction.  Our web-based software, Optimo, measures actual office space utilization, total cost of occupancy, and employee mobility. Our solution provides not only highly accurate and granular monitoring but also predictive analytics.  Rifiniti is a leading, disruptive SaaS company headquartered in Boston, MA, with offices in Sofia, Bulgaria. Rifiniti is venture-backed.Position DescriptionThe machine learning intern will work with a talented development team to assist in the development of algorithms and database design for Rifiniti’s software platform. This paid position is open to part-time candidates during the school year and full-time candidates in the summer.Responsibilities Design and test various statistical and machine learning algorithms.Test new programs to ensure that logic and syntax are correct, and that program results are accurate; assists other developers with programming assignments.Manage projects on time and on budget to meet project specifications using scrum/agile methodologies.Document code consistently throughout the development process by listing a description of the program, special instructions, and any changes made in database tables on procedural, modular and database level.RequirementsAt least 1 year of programming experience.Experience with several of the following: Python, Java, Scala, Javascript, MySqlExperience with Matlab, R, or a data mining tool such as RapidMiner is a plus.Strong teamwork and interpersonal skills; excellent communication skills.Bachelor’s in computer science, applied math, or other quantitative discipline (completed or in progress).Strong math skills, including statistics, is preferred. LocationWork from our modern office in Boston, US."}