{"jobID": "2767297560", "jobLocation": "Issaquah_WA", "jobTitle": "Data Scientist Leader", "companyRating": "4.1", "companyInfo": {"Website": "www.microsoft.com", "Headquarters": "Redmond, WA", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (MSFT) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Amazon, Apple"}, "estimatedSalary": "149000", "jobDescription": " Are you someone with a passion for data, analytics, insights and technology? Do you want to be part of a team developing actionable insights to help the organization make impactful business decisions? If you excel in blending quantitative analysis with strategy development and want to influence key business decisions, then come join our team. Customer Support & Services (CSS) is transforming the way we support our customers, and we want you to be a part of it. The CSS Operations and Delivery Excellence team is looking for a passionate, creative, analytical and experienced data analyst leader who loves big data, curious to explore and unveil insights and create a business story and reporting to impact key business decisions. CSS is a customer-obsessed organization keenly focused on improving all aspects of our interactions with customers. This team is tasked to maintain and provide accurate and timely data insights, leveraging industry-best practices. In CSS, our vision and our promise is to Drive Customer Success with a Modern Support experience across the customer lifecycle. We aspire to deliver seamless experiences with quality, speed and value by building self-healing into our products and services to prevent and automate issue resolution before customers experience a problem. We enable our transformation with telemetry, tools, readiness and business intelligence to drive successful outcomes for our customers. We know our customers and anticipate their needs across every stage of the lifecycle This position is a key role that drives insights about our business model and health, pre-sales and post-sales activity of our users, lead generation, and acquisition and engagement efforts. The scope includes understanding and monitoring key metrics and ongoing analyses to inform overall strategy for acquisition, usage, and retention of our users. Also includes stakeholder engagement and close collaboration with and leveraging efforts of data scientists, data engineers and other data analysts.  This role focuses on the following high impact areas:  • Enable CSS executives to make strategic decisions  • Facilitate experimentations and prototypes showcasing how data BI can help drive better business decisions  • Design data governance processes, including data definitions, inputs and change requests  • Operationalize data science analysis based on cutting edge techniques in machine learning, semantic analysis, data mining, experimentation, statistics, et al The ideal candidate is driven, self-directed, entrepreneurial and focused on delivering the right results. In addition, strong skills in written and oral communications, a can-do attitude and the willingness to tackle hard problems in innovative ways. Thriving in a team environment that values cross team collaboration and building on the success of others is key.Responsibilities"}