{"jobID": "1968269452", "jobLocation": "New_York_NY", "jobTitle": "Basketball Coach", "companyRating": null, "companyInfo": {"Website": "www.successcareers.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2006", "Type": " School / School District", "Industry": " Education", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "As the fastest growing, highest-performing charter school network in New York State, Success Academy has reimagined public education. Nationally recognized for achieving outstanding academic results for students from all backgrounds and zip codes, we have created an innovative K-12 school model that is preparing current and future generations of children with the subject mastery and skills to succeed in college and life. We now need a results-driven Basketball Coach to join our school community. Key responsibilities include:- Inspiring a profound love of athletics in all students;- Collaborating with other coaches across the network to build a world-class basketball program in our elementary schools;- Instilling values of respect, team spirit, passion, modesty, fair play, and individuality in our students;- Managing a rigorous basketball team focused on developing scholars’ technical skills at a high level;- Investing parents and families in the transformative role athletics can play in children’s lives; and- Engaging in training with school leaders and benefitting from targeted, in-the-moment feedback on instruction, which accelerates learning and growth with unparalleled support.Successful candidates should also have the following experiences and characteristics. They:- Have experience coaching youth basketball with a record of excellence;- Hold a Bachelor’s degree, with an outstanding record of academic achievement and extracurricular leadership;- Are a person of high moral character; and- Are passionate about basketball.To join our team, please upload a cover letter and resume that outlines your candidacy. Your cover letter should explain in detail your qualifications for the position. Resumes without cover letters will not be reviewed.Success Academy Charter Schools is an equal opportunity employer and actively encourages applications from people of all backgrounds. Compensation is competitive and commensurate with experience. Success Academy offers a full benefits program and opportunities for professional growth.Apply"}