{"jobID": "2771163455", "jobLocation": "New_York_NY", "jobTitle": "Data Center Engineering Intern", "companyRating": "4.2", "companyInfo": {"Website": "www.outbrain.com", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "40000", "jobDescription": " Data Center Engineering Intern ****This is a long term intership. If you are looking for a Summer internship only, please do not apply.**** Outbrain is seeking a motivated intern, ready to make a difference, to join our Platform group. To meet the increasing challenges of the growing business, the Platform group is continuously expanding Outbrain’s infrastructure, building new data centers and expanding existing ones. We work in a challenging environment, leveraging state of the art Open Source tools and developing our own. We are big believers in automation, data-driven development, and extreme monitoring.  Our team is made up of individuals who are resourceful, bright, proactive, and who work well both independently and as a team.  Deliverables:  For this position, we seek a proactive self starter who strives for continuous improvement. You will gain valuable knowledge on the many aspects of scaling a physical operation and would be expected to further research and propose ideas to streamline our internal processes. Basic requirements: - You are a student working towards a degree in Computer Science, Networking Technologies, etc  - You display good communication skills  - You strive to remain current on industry trends and latest technologies  - Ability to come into the New York office at least 20-25 a week  - Ability to work after the Summer is over into the Fall/Winter What you’ll need to be successful: - An understanding of Linux OS and commands  - Posses some programming experience in a Linux environment  - Experience working with computer hardware  - (Optional) Being familiar with Datacenter power management"}