{"jobID": "2554899488", "jobLocation": "San_Francisco_CA", "jobTitle": "Software Engineering Intern", "companyRating": "4.4", "companyInfo": {"Website": "www.simplyinsured.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "85000", "jobDescription": "We are looking for interns to join us for the summer! Our engineers are hackers and generalists who value using software to improve lives and make an impact while tackling difficult technical problems, and we are looking for interns to join them in our mission. We are built on Ruby on Rails and React, but what's most important is solving problems and getting stuff done.Our engineers build customer-facing tools with significant autonomy and product ownership, and as an intern, your work will become a key part of the product. Our engineers are the key to our growth, and their opinions valued.SimplyInsured is a 100% online platform to buy small business health insurance. We are revolutionizing the $20B health insurance brokerage market and improving our customers' lives.We have thousands of delighted customers, grow in double digits every month, and are backed by YCombinator and some of Silicon Valley’s top entrepreneurs and investors.Who You Are:An engineering student with 2+ years of relevant coursework - code samples are best (share your github, personal website, previous projects, etc.)Ready to do everything from tweaking nginx on our servers, to building analytics and marketing solutions, to designing entirely new insurance servicesCommitted to our product with a strong desire to build product and winTechnical background: a degree in CS, EE, math, physics, molecular gastronomy, etc.Who We Are:A mission-driven team who want to fundamentally transform the health insurance industrySelf starters with a history of building (and breaking) thingsHigh trust, achievement, and transparency cultureProblems solversData-driven thinkersWhat We Offer:Generous stock option packagesLunch and Dinner every day (along with healthy snacks)Team-building activities like wine tastings, hikes, and volunteer opportunitiesHealth, Vision, Dental Insurance (duh!)A values-based culture that invests in employee success"}