{"jobID": "2694955437", "jobLocation": "New_York_NY", "jobTitle": "Analyst Intern", "companyRating": null, "companyInfo": {"Website": "www.yieldstreet.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Were working to change the way wealth is created. YieldStreet is disrupting the trillion-dollar lending and investment industry. We recently raised $113M in financing from world-class venture capitalists to help us scale. Our investor demand is soaring, and our team is expected to double in size this year. Do you have what it takes to join a booming startup that is changing the investment industry? About YieldStreet YieldStreet connects investors to opportunities in alternative asset classes like real estate and litigation finance that were historically unavailable to most. YieldStreet was created because our founders were frustrated by the lack of options regular investors had to participate in asset backed investment opportunities that exist outside of the stock market.  We believe top notch technology and data can help us build the worlds most robust alternative investment platform and create financial independence for all. Join us. About this role: YieldStreet is hiring a part-time analyst intern to work alongside the investment team. The intern will report directly to the Head of Origination and Investment Analyst. Conducting industry, market and company-specific researchReviewing teasers, confidential information memoranda and management presentationsPerforming financial analysis and financial modelingAssisting with the preparation of transaction marketing materials, including executive summaries and private placement memorandaResearching trends in various industry sectorsDeveloping and maintaining industry databasesProviding support to members of the Origination Team and performing other duties as assignedYou're an ideal candidate if you have:Bachelors degree in-progress from a top-tier university in business, finance or related fieldSolid quantitative and analytical skillsStrong proficiency in MS Office software (Excel, Word, PowerPoint, Excel)Excellent research and information management skillsAttention to detail while maintaining a big picture orientationSuperior organizational and time management skills, and the ability to efficiently manage multiple projects in a fast-paced work environmentExcellent written and verbal communication, listening, problem solving, interpersonal and relationship-building skillsDemonstrated maturity, integrity and the ability to perform in an entrepreneurial environmentAbility to work both independently as an individually and collaboratively as a team playerBe proactive and demonstrate readiness and ability to initiate actionAssume full responsibility and accountability for own actionsDemonstrate uncompromising adherence to ethical principlesRemain cognizant of our commitment to daily workflow and regulatory compliancePrevious experience in investment banking, credit, or specialty finance sectors is a plusBenefits We offer an attractive hourly rate. This is an opportunity to work with a group of diverse, smart, and friendly people from 8 different countries who speak a total of 17 different languages. Our team is comprised of successful entrepreneurs with combined exits of over $1B, and we get social with each other during happy hours in our work hard/play hard culture. Perhaps the best benefits are the tons of free snacks (Goldfish and Granola are our favorites, but always taking suggestions) and a variety of top tier scotch and whiskies at the company bar.  We're located in Midtown on 5th Ave and surrounded by plenty of culture with a vibrant dining and social scene. Our building is steps away from Rockefeller Center.  *** Please, no solicitors or recruiters. We're saving our dollars to pay the right candidate!"}