{"jobID": "2813369154", "jobLocation": "San_Jose_CA", "jobTitle": "Local Class A Driver", "companyRating": null, "companyInfo": {"Website": "www.cleanharbors.com", "Headquarters": "Norwell, MA", "Size": "10000+ employees", "Founded": " 1980", "Type": " Company - Public (CLH) ", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "For more information about driver career opportunities, please call us at 1-833-32-DRIVE (1-833-323-7483), Monday - Friday 7:00am - 7:00pm CST. Please have this 5 digit job ID ready - 53848.Our San Jose, CA location is currently looking for a Local Class A Driver to join our team on a full time, permanent basis. As a Class A Driver you will operate a tanker truck for local transport of hazardous and non-hazardous liquid waste from our San Jose facility to our rail facility in Redwood City. This position is home every night with no travel and opportunities for overtime.Key Responsibilities:Ensures Health and Safety is the number one goal by following policies, processes, and acting in a safe manner at all time;Completing pre and post trip vehicle inspections;Waste pick up from customer locations utilizing vans and tankers;Loading and offloading;Maintaining daily logs, time sheets, expense reports, dispatch and trip reports as well as vehicle inspection reports.Key Qualifications:High school diploma or equivalentMust have a Class A CDL with Hazmat and Tanker EndorsementsExperience driving tanker trucks is requiredAbility to use a hand held deviceClean Harbors is the leading provider of environmental, energy and industrial services throughout United States and Canada, as well as Mexico and Puerto Rico. The Company serves a diverse customer base, including a majority of the Fortune 500 companies, thousands of smaller private entities and numerous federal, state, provincial and local governmental agencies. Through its Safety-Kleen subsidiary, Clean Harbors also is a premier provider of used oil recycling and re-refining, parts washers and environmental services for the small quantity generator market. For many positions, we have implemented a Competency Based Progression and Pay Program, which directly rewards employees for developing increased proficiency in their key job functions through training and experience. At Clean Harbors you are offered unique opportunities for all stages of your career. What We Offer:Health and Safety is our #1 priority and we live it 3-6-5!Competitive wages based on experience and skills for this full time permanent position;Comprehensive benefits after 30 days of full time employment;401K with matching, Tuition Reimbursement & Generous Paid Time Off;Company paid certifications, license, and training;Positive and safe work environments;Opportunities for growth, development, and internal advancement.To learn more about our company visit us at www.cleanharbors.com.  We thank all those interested in joining the Clean Harbors team; however only those that complete the online application and meet the minimum job qualifications will be considered for this role. Clean Harbors is a Military & Veteran friendly company. *CHCAN *CH#LI-POST"}