{"jobID": "2800720092", "jobLocation": "Oakland_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.mastechdigital.com", "Headquarters": "Moon Township, PA", "Size": "1001 to 5000 employees", "Founded": " 1986", "Type": " Company - Public (MHH) ", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job Description: Mastech Digital provides digital and mainstream technology staff as well as Digital Transformation Services for leading American Corporations. We are currently seeking a Data Scientist for our client in the Healthcare domain. We value our professionals, providing comprehensive benefits, exciting challenges, and the opportunity for growth. This is a Contract position and the client is looking for someone to start immediately.  Duration: 24 Months Contract  Location: Oakland, CA  Compensation: Best Market Rates  Role: Data Scientist  Primary Skill: Python  Role Description: The Data Scientist would need to have at least 2+ years of experience. Required Experience and Skills:Strong understanding of Machine Learning, NLP tools (Word2Vec, Glove, T-SNE), Big data, Data Analysis and Statistical Model development.Over 2 years of experience working as a Data Scientist and has worked extensively on Data Analysis and Machine Learning tools.Has implemented variety of NLP tools like Word2Vec and has also worked with Python, Hadoop and Hive.Has good understanding of statistical models like LDA to study similarity patterns of Data.Proficient with Python programming and frameworks like DJANGO/FLASK.Additional Skills:Analytical ThinkingPattern RecognitionDimensionality Reduction AlgorithmsUnsupervised LearningR, PythonData VisualizationClustering Algorithms Education: Masters/Bachelors degree in Computer Science, Electrical/Electronic Engineering, Information Technology or another related field  Experience: Minimum 2+ years  Relocation: No, this position will not cover relocation expenses  Travel: N/A  Local Preferred: Yes  We are looking only for candidates willing to join us directly as W2 employees  Recruiter Name: Kumar Swetank  Recruiter Phone: 877.884.8834 (Ext: 2163)  Equal Employment Opportunity  Minimum Education Required: Bachelor Years of Experience Required: At Least 3 Years Expected Travel Time: None"}