{"jobID": "2741704131", "jobLocation": "Anaheim_CA", "jobTitle": "Intern - Project Engineer", "companyRating": "3.3", "companyInfo": {"Website": "www.l3t.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1997", "Type": " Company - Public (LLL) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": "L3 Power Distribution is searching for a Project Engineer Intern to join our team. The Power Distribution Division, with anticipated sales in 2017 of $283M, is a newly formed organization made up of four formerly separate operating divisions within L3. This opportunity is located at our Anaheim Ball Road site (Power Paragon). Our Power Paragon facility is a worldwide leader in the engineering, development, manufacturing and integration of power conversion and distribution systems for defense, governmental and advanced industrial applications. Our company’s power conversion, power conditioning and power protection solutions can be found in a wide range of demanding military and commercial environments around the world.The duration of this internship will be through the summer.Responsibilities:Develop project metrics and create tools/processes to streamline the data collection and report generation. Will require exercising the entire product development cycle from user needs definition to development to verification and validation.Will work with Senior Project Engineers (end users) to define and document metric needs and requirements.Develop processes and tools to defined requirements. Developed processes will be documented in via standard flowcharts and work instructions while tools will be developed using MS Office Products (e.g., MS Access, MS Excel, MS Visio, MS Word, etc.)Create/execute test procedures and deliver test report(s) that verify and validate that the developed tools and processes meet requirements and project engineer needs.Qualifications:Minimum of entering sophomore year in college, in process of earning four-year BS in engineering degree (in the area of Electrical Engineering, Mechanical Engineering, Industrial Engineering, Systems Engineering or Computer Science/Engineering)Basic understanding of database developmentAdvanced knowledge of ExcelWorking knowledge of MS AccessWorking knowledge of Visual Basic for Applications (VBA) Candidates must be able to obtain and maintain a security clearance. Turn your interest into action – apply today!Power Distribution is an equal opportunity employer – minorities/females /veterans/individuals with disabilities/sexual orientation/gender identity."}