{"jobID": "2807901534", "jobLocation": "Brooklyn_NY", "jobTitle": "Business Sales Account Representative - Brooklyn/Queens", "companyRating": null, "companyInfo": {"Website": "www.bjs.com", "Headquarters": "Westborough, MA", "Size": "10000+ employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Costco Wholesale, Sam's Club"}, "estimatedSalary": null, "jobDescription": " BJ's Wholesale Club was the first retailer to introduce the warehouse club concept in the northeastern United States. Today, we’re a multibillion dollar operation with more than 200 clubs in 16 states from Maine to Florida.  While our Members know us for helping them save up to 25% off grocery prices every day, our Team Members love us for providing a supportive and engaging workplace that’s committed to developing great talent.  If you’re a motivated and enthusiastic person who enjoys working collaboratively and is committed to providing great service for our Members, we want to hear from you. BJ’s offers a fast-paced, team environment with great training opportunities and competitive salary and benefits packages to help you succeed. BUSINESS SALES ACCOUNT REP The responsibility of the Business Sales Account Rep to generate new BJ's Business Source sales orders within their assigned territory, specifically focused on selling products to new accounts and/or non-BJ’s members. Additional responsibilities include, but are not limited to: Responsible for generating incremental sales volume for the department by building relationships with the potential new business members and handling their accounts from start to finish, which includes: preparing, pricing (subject to approval), ordering, and closing their own deals by utilizing the departments existing IT systems and business processesAbility to generate leads through B2B cold calling, as well as partnering with the Club(s) to obtain customer referralsAbility to work within an assigned multi-club territory and efficiently schedule and plan daily activities, while working in a fast-paced environmentData Entry (will be required to enter sales information into an IT system for all customer orders)RequirementsBachelor's Degree preferred2 plus years of experience in sales, customer service, and/or business developmentHighly experienced and proficient with Excel and other Microsoft Office softwareExperience with SAP is a plusOutstanding sales, negotiation and communication skillsAbility to prioritize workload and work well in a fast-paced environmentHighly experienced and proficient with Excel and other Microsoft Office softwareAbility to be organized at all times while completing tasks accurately and on time BJ's Wholesale Club is committed to a policy of equal employment opportunity for all qualified team members and applicants for employment without regard to race, religion, color, sex, sexual orientation, age, ancestry, national origin, physical and/or mental disability, genetic information, atypical cellular or blood trait, marital and/or familial status, pregnancy, gender identity and expression, military or veteran status, or any other characteristics protected by applicable law."}