{"jobID": "2826298928", "jobLocation": "San_Francisco_CA", "jobTitle": "Health Data Analyst Lead, Rx Reporting", "companyRating": "3.2", "companyInfo": {"Website": "www.blueshieldca.com", "Headquarters": "San Francisco, CA", "Size": "5001 to 10000 employees", "Founded": " 1939", "Type": " Nonprofit Organization", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "122000", "jobDescription": " Looking for a chance to do meaningful work that touches millions? Come join the hardest working, nonprofit health plan in California and help us shape the future of health care. Blue Shield of California's Mission is to ensure all Californians have access to high-quality care at an affordable price. Blue Shield is focused on improving health care delivery by working closely with providers and making it more accessible, affordable and customer-centric. Being a mission-driven organization means we do much more than serve our 4 million members: we were the first health plan in the nation to limit our annual net income to 2 percent of revenue and return the difference to our customers and the community, and since 2005 we have contributed more than $325 million to the Blue Shield of California Foundation to improve community health and end domestic violence. We also believe that a healthier California begins with our employees, so we provide them with resources to develop and maintain a healthy lifestyle through our award-winning wellness program, Wellvolution.  We're hiring smart thinkers and doers who want to work for a leader and innovator in the challenging, ever-changing healthcare space. Come and help us make health care better for everyone. Description: Blue Shield of California ( BSC ) is looking for a Lead Health Data Analyst for our Pharmacy Analytics and Reporting group.  The Lead Health Data Analyst will be a key analyst within the Pharmacy Analytics and Reporting team to design, develop, maintain, and implement internal data management processes, custom reports and analytic tools/applications to support Blue Shield pharmacy Medicare Part D compliance, Commercial Audits, and Formulary Strategy processes. The Lead Pharmacy Analyst will also work with other analysts within the Pharmacy Analytics and Reporting team and cross functionally to meet the business objectives.  Reporting Structure and Job Location Reporting to the Manager, Rx Operational Analytics, the Lead Health Data Analyst may be based in our Woodland Hills or San Francisco office.  Business Unit Overview Provide an overview of the business unit and describe the purpose of the unit: Describe the context of the role and how it operates within the unit.  The purpose of the Pharmacy Analytics and Reporting team is to develop consultative analytic methods to transform pharmacy data into accurate and meaningful information to meet client requirements, facilitate performance monitoring, and assist with business strategy planning.  Key Pharmacy Analytics & Reporting accountabilities include:  1) Provide consultative analyses and RFP data to support membership growth and retention 2) Conduct trend driver analyses, outcomes reporting and benchmarking to support Cost of Health Care (COHC) trend management and forecast  3) Develop reports to support efficient operations and regulatory requirements  4) Develop pharmacy data, reporting methods and tools to facilitate pharmacy program and business strategy planning  Key Responsibilities include: 1) Leads report development and maintenance and analytic tool development for Pharmacy Benefits Implementation and Claims Quality.  2) Leads reports development and maintenance and analytic tool development for Pharmacy Prior Authorization/Drug Utilization Review.  3) Leads reports development and maintenance and analytic tool development for Pharmacy Incident Management.  4) Understands the overall business and analytic objectives, recommends and develops proper analytic plan and statistical methods to support the evaluation.  5) Utilizes programming software to efficiently develop process or tools to analyze relevant data from various sources (e.g., claims, membership, operation and other ancillary data sources), interprets and presents analytic results for all ad hoc and ongoing reporting requests.  6) Serves as pharmacy data liaison to key stakeholder areas (e.g., Pharmacy Benefits & Claims, Health Information Technology, and IT/business intelligence) and supports business and strategic project planning and implementation.  7) Develops innovative analyses and reports using understanding of the business need for information. Conducts independent analysis of high complexity under minimal supervision and guidance.  Supports design, implementation and maintenance of data logic and processes to support pharmacy data integration into health data technology platform, online and mobile tools. Qualifications:Qualification/Education Desired: Describe education, certifications, knowledge, and skills required and preferred.Requires BA/BS degree in health science, quantitative social science, public health, health services research or business.SAS Certified Advanced Programmer or equivalent experience required. Must be able to develop new SAS programs and SQL scriptsExperience with Visual Analytic tools required (Tableau, SAS Visual Analytics, Power BI)Experience with Python or other scripting languages requiredRequires advanced data analytic skils with SAS, Business Objects, Microsoft Office (e.g. Access and Excel including VBA). Other data analytic experience is a plus (e.g. Crystal Reports, Unix, SQL/PL-SQL ).Requires 3-5 years experience in health care (Health Plan, Pharmacy Benefit Management or government payer).Must have sufficient familiarity with the technical, clinical, and financial concepts necessary to adequately perform the duties described above.Demonstrated ability to work with pharmacy claims data and familiar with pharmacy data parameters available for analysis. Prior experience and demonstrated ability to work with large datasets required.Experience with designing analytic plan using sound statistical approach to solve complex questions or evaluate program ROI.Exhibits \"can do\" attitude and solution-oriented approach to resolve challenges.Produces accurate work under tight deadlines.Possesses strong collaboration and partnership skills in a matrix work environment. Possesses excellent verbal and written communication skills. "}