{"jobID": "2802905218", "jobLocation": "Boston_MA", "jobTitle": "Registered Nurse - ICU Float Pool - 36 Hours - Nights", "companyRating": "3.6", "companyInfo": {"Website": "www.bmc.org", "Headquarters": "Boston, MA", "Size": "1001 to 5000 employees", "Founded": " 1996", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "43", "jobDescription": " In 2014, Boston Medical Center embarked on an ambitious, four-year redesign project with a goal of transforming our campus into the most modern hospital in the city. Patient experience will be enhanced by consolidating services to the Menino side of the campus, expanding our Emergency Department, modernizing surgical suites, and offering patients and staff the most efficient clinical care spaces possible.  Our Critical Care Teams have just completed the move into their expanded facility. Please review the job description below and submit your application and resume. Our team will contact you regarding your experience and fit.Full Time: 36 Hours  Nights and Every Other Weekend  Union: SEIU  Menino Pavilion Minimum Qualifications:One year of experience as a working and licensed Registered Nurse.Graduate of an accredited school of nursing with an Associates degree or Baccalaureate degree in nursing (BSN). BSN preferred.Candidates who do not have a BSN must be enrolled in a Baccalaureate program within 6 months of hire and must complete their BSN within 36 months of hire.Registration and current RN licensure in the state of MA in good standing required.12 Months of Critical Care experience is REQUIRED.Requires current basic life support (BLS) certification. Some units may require Advanced Cardiac Life support (ACLS) certificationAdditional certifications may be required for certain practice area.Willingness to work every other weekend.Essential Responsibilities:Basic computer proficiency inclusive of ability to access, enters, and interpret computerized data/information.EPIC experience preferred.Effective interpersonal skills to facilitate communication with various members of the health care team, patients, and families.Organizational skills to set priorities and efficiently complete assigned work.Multilingual skills (beyond that of English) in languages appropriate to the patient populations served by the medical center preferred.Relevant clinical experience and/or specialty, certification required for certain practice areas, e.g., enterostomal therapy, epidemiology, perioperative areas.Analytical ability to solve clinical nursing issues and conduct quality improvement research utilization projects.Ability to effectively delegate appropriate patient care activities.Effective verbal and written communication skills appropriate to the patient populations served.Physical ability to meet the core job responsibilities in accordance with practice setting demands for the patient populations regularly served.Ability to effectively manage stress due to critical issues related to patient care, changing organizational climate and personnel issues."}