{"jobID": "2547508359", "jobLocation": "San_Francisco_CA", "jobTitle": "Project Coordinator", "companyRating": "4.5", "companyInfo": {"Website": "www.marxokubo.com", "Headquarters": "Denver, CO", "Size": "51 to 200 employees", "Founded": " 1982", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "59000", "jobDescription": " Candidates for this position are generally recent graduates or architects- or engineers -in-training who are seeking practical, hands-on experience in architecture, engineering, project management, and/or construction. Working under the guidance of professional architects and engineers, project coordinators will: Assist in the review and evaluation of existing buildings and new construction.Perform field observations for project condition assessment surveys, construction loan monitoring, and new construction.Perform plan reviews for general code compliance and adequacy of construction, including coordination, detailing, and building materials and systems.Prepare cost evaluations of new and existing construction.Perform existing building replacement cost evaluations.Assist in architectural/engineering repair documents for existing buildings. Our work covers most commercial building types, including office, retail, industrial, hotel/hospitality, and multi-family. Desired Skills and ExperienceBachelor or Masters degree in architecture or engineering, or background in construction or related fields.Minimum 2-3 years experience at an architecture, engineering, or construction company.For architectural candidates, in progress on AXP requirements and/or taking ARE exams.For Engineer candidates, in Training (EIT) Certified, preferable.Proficient in Microsoft Office, particularly Word and Excel.Proficient in AutoCAD; Bluebeam, Plan Grid, and BOX, knowledge of Photoshop, Illustrator, Sketchup a plus but not required.General understanding of building materials and methods.General understanding of state and federal codes as it applies to construction and design.Strong organizational skills.Ability to manage and delegate a multitude of tasks, assignments and changing priorities efficiently.Strong verbal and written communication skills. Compensation will be commensurate with qualifications and experience. The ability to travel out of town is a requirement for the position.  To apply, please submit a resume to SanFranResumes@marxokubo.com. Please indicate the office location and position for which you are applying in the subject line of the email."}