{"jobID": "2803228609", "jobLocation": "San_Francisco_CA", "jobTitle": "Software Engineer Intern", "companyRating": null, "companyInfo": {"Website": "www.pmd.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The medical software industry is experiencing a revolution, and pMD is looking for a Software Engineer Intern who has the talent and drive to help us change it forever. You'll have a huge impact on health care in America by using cutting edge technology to change the way that physicians practice medicine.  A developer’s career at pMD is nothing like the stereotype of a programmer. In addition to brilliant engineering, it involves high-level decision making and interaction with customers who love using our product. Our development team is small and collaborative, so you'll experience rapid career growth through real mentorship. You'll be a name (or a nickname) on the team and at happy hour, rather than Intern #300.  At pMD, you’ll wear many hats, have a lot of responsibility, and be part of a fun, smart, and creative team. We are bootstrapped and profitable, have extremely happy customers, and make up a team of people as talented and passionate as you are. We love what we do and care about doing good in the world. We strive to work like a beautifully engineered German car: fast, efficient, and fun.  Our software is highly usable, fast, scalable, mobile, and interoperable. These challenges demand a database-savvy intern who can master modern Web paradigms such as AJAX and REST, and who can write software that is reliable and easy to use on mobile devices. You:bring a strong interest in Web or mobile development... plus a lifetime of curiosityseek broad project exposure with a small, fun, fast-paced teamare enthusiastic, creative, and get things donecommunicate fluidly in a team environmentwant to jump-start your career, to learn a lot, and to take responsibilitydesign applications that are intuitive, fun to use and make the world a better placeWe:never set foot in a cubicle farmlike to play with machines named after fruits and robotsshare a beautiful office in San Franciscolove our workprefer Mac and Linux to... other operating systemsare always looking for the next hot thingenjoy coffee, tea, beer, and snacks in the break room At pMD, you can grow as quickly as you want to. Our startup environment means nothing is holding you back from doing your best work and learning new technologies. You’ll have the opportunity to complete an exciting and impressive project - your own project - during your time at pMD. You'll be able to see the impact of your work immediately and you'll hear directly from our users how your efforts have improved their lives."}