{"jobID": "2829286353", "jobLocation": "Burbank_CA", "jobTitle": "DATG R&D; Intern, Burbank, CA - Fall", "companyRating": null, "companyInfo": {"Website": "www.disney.com", "Headquarters": "Burbank, CA", "Size": "10000+ employees", "Founded": " 1923", "Type": " Company - Public (DIS) ", "Industry": " Media", "Revenue": " $10+ billion (USD) per year", "Competitors": " News Corp, WarnerMedia, NBCUniversal"}, "estimatedSalary": null, "jobDescription": " Disney ABC Television?s R&D; group is a small and agile technology strategy organization that incubates new technology, executes proof of concepts, transfers new technology to operating groups, and provides strategic recommendations on new technology opportunities. The scope is any technology related to television production, creative development, digital media, newsgathering, distribution, operations and IT. The group was started in summer 2012 and reports to the CTO of Disney ABC Television Group.  The R&D; Intern will report to the Director, R&D; and contribute to the general goals of the group. During the internship there will be at least one major initiative the intern will be responsible for. The work will be very entrepreneurial; in some cases, the intern will be responsible for vision, strategy, hiring, analysis, execution, project management, reporting, and socialization. Some administrative duties will be part of the internship. *Responsibilities :** ? Manage proof of concepts for new technologies or technological areas ? Hold hands on ?product owner? role in contributing to research and prototyping process  ? Writing strategy documents or white papers on new technology  ? Assist in defining technology innovation processes and values  ? Socialize concepts and results across Disney ABC Television Group?s business units  ? Interface with other technology groups across the broader Walt Disney Company *Basic Qualifications :** + Experience with data visualization and/or production technology development  + Experience in media technology as an engineer or media production  + Experience interfacing with senior executives  + Creativity, desire to learn new things, obsession with innovation *Preferred Qualifications :** + Programming experience in one (or more) of the following areas a big plus: game engine (Unity, etc.), application or web development and/or data science *Required Education :** Junior, Senior, Graduate Level student or recent graduate (within 6 months of graduating) pursuing a Bachelor's or Master's Degree in Computer Science, Data Science, Business Analytics or related field. *Preferred Education :** Graduate Level student or recent graduate (within 6 months of graduating) pursuing an MBA degree or related graduate level degree. *Additional Information :** Program Eligibility  + At least 18 years of age  + Unrestricted work authorization  + Available to work part-time (minimum 20 hours/week) or full-time (maximum of 40 hours/week) in Fall 2018 (August/September - December).  + All candidates must be able to have a consistent, reliable work schedule throughout the session  + **Ability to provide own relocation, housing and transportation. Position is located in Burbank, CA.**  + Enrolled in an undergraduate or graduate program at an accredited college/university taking at least one class in the semester prior to participation in the internship program, or recently graduated within six months at time of application *Job ID:** 555318BR*Location:** Burbank,California*Job Posting Company:** Media Networks"}