{"jobID": "2767663048", "jobLocation": "New_York_NY", "jobTitle": "Technical Consultant (Sales Engineer)", "companyRating": "3.6", "companyInfo": {"Website": "www.similarweb.com", "Headquarters": "Tel Aviv-Yafo, Israel", "Size": "201 to 500 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " comScore, App Annie, Alexa Internet"}, "estimatedSalary": "99000", "jobDescription": "SimilarWebs market intelligence solutions provide customers with insights to help them understand, track and grow their digital market share. At SimilarWeb we bring together the industrys top talent to work together and create a product that transforms the way that businesses make decisions.So what is a Technical Consultant?Work extensively with prospects, partners, customers and account executives to identify technical and business needs then recommend technical solutions to business problems by utilizing the companys data. Youll have the opportunity to directly advise the biggest companies in Europe and the world on their digital strategy.Key responsibilities include:Technical Methodology ConsultancySimilarWebs data collection methodology is unique and customers often have a lot of questions about how it works and why numbers wont always align with other systems.Understanding where customers queries come from, then analysing our data and their setup to diagnose problems.Feedback back to the R&D; function at HQ on perceived accuracy and ongoing issues.Building SolutionsSpeak to customers and prospective customers about their needsBuild custom solutions for them using our API.Support internal enablement by templating advanced analysisWhat will I bring to the team?Analytical mindset with the ability to quickly digest a problem and identify a solutionExcellent problem solving and critical thinking skillsDeep API knowledge and implementation experienceStrong Excel skills2+ years of client facing experienceDegree in a technical subjectNice to have: Digital marketing experience (agency is a plus)Why choose SimilarWeb?Impact: We are changing the way decisions are made and youll be a core part of that movement. We provide insights that help businesses understand the digital world, their market and their competition. With our digital market intelligence businesses can put their own data into context and make real data-driven decisions.Talent: We only the most talented ambitious professionals who are eager to work hard, take chances and share ideas. Our passion, enthusiasm and drive for success are why we win together.Opportunity: We are the perfect place to grow. SimilarWeb has been named one of Business Insiders Top 50 Enterprise Startups to bet your career on."}