{"jobID": "2817586950", "jobLocation": "Austin_TX", "jobTitle": "Data Scientist - IoT Cloud Services", "companyRating": "4.3", "companyInfo": {"Website": "www.arm.com", "Headquarters": "Cambridge, United Kingdom", "Size": "5001 to 10000 employees", "Founded": " 1990", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Intel Corporation, Imagination Technologies, NXP Semiconductors"}, "estimatedSalary": "102000", "jobDescription": " Job ID #: 13785 Job Category: Research & DevelopmentEmployment Type: Experienced ProfessionalsDivision: ResearchDepartment: ResearchPrimary Country: USAPrimary Location: Austin (TX) We are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.Job Description  We are looking for an experienced data scientist and machine learning practitioner to join Arm's IoT cloud services research team. This is a unique opportunity to join a small startup-like team and help drive IoT cloud services efforts at Arm. You will develop advanced data analytics solutions to augment our IoT data platform. You will play a vital role in defining and implementing the platform services for deriving value and actionable insights from massive amounts of IoT data generated by billions of interconnected devices.  What will I be accountable for?  Arm Research plays a central role in identifying gaps in current technologies and in conducting world-leading research to fill those gaps. You will join a team developing fully-managed cloud based data platform and analytics solutions for IoT applications.  A preferred candidate will be a hands-on data scientist with deep expertise in advanced analytics especially for time series sensor data. Your work will include developing machine learning algorithms like asset optimization, anomaly detection, and failure prediction for different industry verticals and IoT use cases. You will be expected to identify benefits and limitations of various open source technologies and use them to develop end-to-end analytical services optimized for IoT specific requirements.  An ideal candidate will have following traits: You are a hands-on data scientist with keen interest in machine learning, and optimization.You have significant experience in developing data analysis applications that can generate value from massive volumes of data.You have in-depth knowledge of core data analysis concepts such as noise filters, statistical distributions, pattern recognition.You have worked with several open source data analysis libraries like NumPy, Pandas, TensorFlow and have a good working knowledge of data engineering tools like Kafka, Spark, Cassandra.You have deep experience in time series data analysis aggregated from distributed sensors and can deep dive into topics like outlier detection, mean time to failure, non-convex optimization, etc.You possess the ability to see the big picture, question the norm, and articulate the problem.You can translate relatively abstract ideas into concrete workable solutions.You enjoy experimenting with cutting-edge technologies that may be relatively immature at the time of their use.You are data driven and good in identifying the algorithmic trade-offs associated with various solutionsYou can synthesize pragmatic solutions to the problems at hand by judiciously using published and open-source solutions.You are a strong programmer and are not afraid to dive in large code bases. You take pride in your code and enjoy contributing to open source projects.You are thrilled at the prospect of enabling and shaping the vision of a trillion interconnected devices. #LI-JS1Job Requirements  What skills, experience, and qualifications do I need? Bachelor or advanced degree (MS or PhD) in Computer Science or quantitative fields like physics, statistics, operations research.A minimum of 5 years of work experience in data science, preferably in developing applications to analyze data from large scale industrial systems.In depth knowledge of statistical concepts and data analysis algorithms like anomaly detection, pattern recognition especially for time series data.Expert level proficiency in at least one data analysis library like TensorFlow, Spark ML, Pandas.Hands-on experience with data pipelines and data engineering technologies like Kafka and SQL/NoSQL databases.Track record of participation in open source software is highly desiredExcellent networking and communication skillsDesired behaviours for this role: Arm is proud to have a set of behaviours that reflect our visionary culture and guide our decisions, defining how we work together to defy ordinary and shape extraordinarily. These behaviours are assessed during the recruitment process:  We Not I Take daily responsibility to make the Global Arm community thriveNo individual owns the right answer. Brilliance is collectiveInformation is crucial, share itRealize that we win when we collaborate and that everyone misses out when we don't Passion for Progress Our differences are our strength. Widen and mix up the pool of people you connectDifficult things can take unexpected directions. Stick with itMake feedback positive and expansive, not negative and narrowThe essence of progress is that it can't stop. Grow with it and own your own progress Be Your Brilliant Self Be quirky not egocentricRecognize the power in saying I don't knowMake trust our default positionHold strong opinions lightly#LI-JS1Benefits Your particular benefits package will depend on position and type of employment and may be subject to change. Your package will be confirmed on offer of employment. Arm's benefits program provides permanent employees with the opportunity to stay innovative and healthy, ensure the wellness of their families, and create a positive working environment. Annual Bonus PlanDiscretionary Cash Awards401(k), 100% matching on first 6% eligible earningsMedical, Dental & Vision, 100% coverage for employee only, shared cost for dependentsBasic Life and Accidental Death and Dismemberment Insurance (AD & D)Short Term (STD) and Long Term (LTD) Disability InsuranceVacation, 20 days per year with option to buy 5 more.Holidays, 13 days per yearSabbatical, 20 paid days every four-years of serviceSick Leave, 7 days per yearVolunteering, four hours per month (TeamARM)Office location dependent: caf on site, fitness facilities, team and social eventsAdditional benefits include: Flexible Spending Accounts for health and dependent care, EAP, Health Advocate, Business Travel Accident Program & Commuter programs. ARM, Inc. (USA) participates in E-Verify. For more information, please refer to ******************** About Arm  Arm technology is at the heart of a computing and connectivity revolution that is transforming the way people live and businesses operate. From the unmissable to the invisible; our advanced, energy-efficient processor designs are enabling the intelligence in 86 billion silicon chips and securely powering products from the sensor to the smartphone to the supercomputer. With more than 1,000 technology partners including the world's most famous business and consumer brands, we are driving Arm innovation into all areas compute is happening inside the chip, the network and the cloud.  With offices around the world, Arm is a diverse community of dedicated, innovative and highly talented professionals. By enabling an inclusive, meritocratic and open workplace where all our people can grow and succeed, we encourage our people to share their unique contributions to Arm's success in the global marketplace.  About the office  The Arm Austin office employs staff from across all divisions of ARM and is considered the engineering hub for North America. Austin has the nickname of Silicon Hills thanks to the high number of tech companies in the area, and is also known as the Live Music Capital of the World\". Events such as South by Southwest, Austin City Limits Music Festival and the F1 Grand Prix are but a few of the many activities that make Austin a top destination for both residents and travelers. Austin, TX USA  Arm Inc.  Encino Trace  5707 Southwest Pkwy  Bldg 1 Suite 100  Austin, TX. 78735"}