{"jobID": "2721278120", "jobLocation": "Santa_Clara_CA", "jobTitle": "Caregiver, Senior Care", "companyRating": "3.7", "companyInfo": {"Website": "www.24hrcares.com", "Headquarters": "El Segundo, CA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "13", "jobDescription": "24Hr HomeCare is an award-winning leader in the healthcare industry providing a needed service for the aging U.S. population. We are looking for compassionate, dedicated, and experienced healthcare professionals to join our team! If you are a caregiver who would like to provide one-on-one care for an elderly adult in his or her home, this job is for you! Summary: We are looking for a committed individual who has excellent communication skills and the ability to quickly problem-solve. Our Caregivers will perform non-medical homecare for clients who, due to advanced age, physical disability, and/or mental deficiency, need supervision. Caregivers also may work flexible schedules of their choice. These shifts can occur during the morning, day, evenings or overnight. Whether you are looking to gain more caregiving experience or simply enjoy working with seniors discover how working at 24Hr HomeCare, can change your life, along with your clients’ lives, forever! Caregiver Responsibilities:Arrive to and from assigned shift on time and properly document all shifts workedAppropriately report any changes to client’s mental/physical health or home environment immediatelyMaintain proper documentation pertaining to client health and follow specific instructions pertaining to client health and other duties assignedComply with rules and regulations pertaining to client health information, specifically HIPAA’s policies and proceduresAdhere to all policies and procedures of 24Hr HomeCareRepresent 24Hr HomeCare to the best of your abilityPromote positive, supportive, and respectful communication to client/family and 24Hr HomeCare staffRequirements/Qualifications:Professional caregiving experience, CNA graduate, or current LVN student w/ completion of clinical rotations2 professional references (able to verify caregiving duties)Proof of negative tuberculosis test/chest x-rayProfessional appearance and demeanorTwo forms of ID compliant with I-9 requirements (ex. driver’s license, passport, social security card, etc.)Registered Home Care Aide (HCA) (CA only)Cleared criminal backgroundWe Care For You!Competitive pay (different rates apply depending on shift length)Flexible scheduling to fit your lifestyle with full-time and part-time availabilityPaid orientation/trainingSupportive staff and management to help you achieve your career goalsShort commute times – we try to match you to opportunities near your homePaid overtime (hourly and/or weekly) and mileageCaregiver Recognition/Benefits:Employee recognition awardsEmployee appreciation month (win cash prizes, free food, gift cards)Incentives for good performance (gift cards, movie tickets, caregiver of the month)24Hr HomeCare perks include discounts on restaurants, travel, and more!Discounts on wireless providersDiagnosis-Specific Nutrition trainingMedical Benefits Keywords: Healthcare, Home care, CNA, HHA, Homemaker, Caregiver, Private Duty Aide, Home Health Aide, Home Health Assistant, Nursing aide, Certified Nursing Assistant, Nursing Student, PCT, Patient Care Tech, PCA, Patient Care Aide, Personal care aide, Companion, healthcare assistant, Private Duty Certified nursing assistant, Nursing Student, Nurse Extern, Home Health, Aide, certified nursing aide."}