{"jobID": "2814537639", "jobLocation": "Bothell_WA", "jobTitle": "Sr. Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.intellitro.com", "Headquarters": "Sunnyvale, CA", "Size": "1 to 50 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Work AuthorizationUS CitizenGCEAD (OPT/CPT/GC/H4)H1BPreferred EmploymentCorp-CorpW2-PermanentW2-Contract1099-ContractContract to HireJob DetailsExperience:ArchitectRate/Salary ($):130Duration:Sp. Area:Data Warehousing/ETLSp. Skills:Data Analyst Permanent Direct Hire H1B OK H1B Sponsorship AvailableFULL_TIME Direct Client RequirementRequired Skills : Analysis, Computer, Database, Data Modeling, Developer, Development, Modeling, Performance, Software, SQL, SQL ServerPreferred Skills :Domain : IT/SoftwareWork AuthorizationUS CitizenGCEAD (OPT/CPT/GC/H4)H1BPreferred EmploymentCorp-CorpW2-PermanentW2-Contract1099-ContractContract to HireJob DetailsExperience:ArchitectRate/Salary ($):130Duration:Sp. Area:Data Warehousing/ETLSp. Skills:Data Analyst Permanent Direct Hire H1B OK H1B Sponsorship AvailableFULL_TIME Direct Client RequirementRequired Skills : Analysis, Computer, Database, Data Modeling, Developer, Development, Modeling, Performance, Software, SQL, SQL ServerPreferred Skills :Domain : IT/Software INTELLITRO INC Las Vegas, NV  Post Resume to  View Contact Details &  Apply for JobJob Description : The ideal candidate should be comfortable designing solutions to solve complex integrated reporting issues utilizing very large data sets in a highly available environment. They must also be comfortable working with a wide range of stakeholders and functional teams to create solutions that will be usable across many organizations.  This position would be best suited to an individual that has a passion for data and analytics. It requires critical thinking, logic, organization, self-motivation and attention to detail.  Key Roles and Responsibilities for Data Analyst  Responsible for analyzing data in response to new business requests, performing maintenance and changes on interfaces, and identifying and resolving data discrepancies across multiple business applications.  Works directly with the client user community and business analysts to investigates and resolves data issues across platforms and applications, including discrepancies of definition, format and function and advises on best reporting practices.  Determines and documents data mapping rules for movement of medium to high complexity data between applications. Adheres to and promotes the use of data administration standards.  Work independently to gather requirements and deliver on a variety of team projects that enhance our Adobe Analytics implementation.  Supports data selection, extraction, and cleansing for corporate applications, including data warehouse and data marts.  Support continuous improvement by investigating alternatives and new technologies and presenting these for architectural and functional reviews.  Design and recommend system enhancements for Adobe Analytics and its integration with Adobe Audience Manager and Adobe Test & Target.  Work with stakeholders throughout the organization to identify opportunities for improving delivery of analytics.  Provides direction and technical or analytical guidance to teams that span multiple organizations and may also include outside suppliers/vendors.  Extracts and analyzes data from specific applications, systems and/or databases to create reports and provide recommendations based on the analysis of the data  May create data models, including robust data definitions, which may be entity- relationship-attribute models, star, or dimensional models. May also create data flow diagrams and process models and integrates models across functional areas and platforms. May work closely with DBAs to transition logical models to physical implementation.  May be responsible for employing data mining techniques to achieve data synchronization, redundancy elimination, source identification, data reconciliation, and problem root cause analys"}