{"jobID": "2756015102", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.getvim.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Overview The mission at Vim is to lower the overall cost of healthcare in America while improving care quality and transforming the patient experience. We partner with healthcare organizations to connect members with high-value medical providers through our online marketplace. Vim is a healthcare services company fueled by technology with a relentless focus on customer and provider experience. Headquartered in San Francisco and backed by Sequoia Capital and GreatPoint Ventures, Vim serves Fortune 100 employers and health plans across the country.  We are looking for a Data Analyst but above all, we seek those who will work well with our team of mission driven, humble and resilient people who want to change healthcare for the better. Your Role Vim has unique access to health insurance and electronic health record data. Our goal is to use our unique access to this information to help our members and their providers improve the health of the populations we serve. You will be part of team responsible to organize and transform this data into actionable insights that will help Vim members and providers. In doing so, you will: Create dashboards and reports that measure KPIs for consumers and providersResearch trends in key business metrics for internal stakeholdersWork with our engineering team to ingest, organize and link structured and unstructured healthcare dataWork with our product team to build consumer and provider facing tools that help them make better healthcare decisionsWork with our clinical team to build analytical systems and visualizations that enrich the care experience for our consumers and providersDevelop expertise in healthcare and population healthWe ValueSuperstars who arent afraid to tell us what to do (and are right most of the time)Self-starters who thrive by turning problems into opportunitiesOptimists who are confident, creative and grittyRequirementsBachelors degree in quantitative discipline (Applied Math, Economics, Finance, Statistics, etc.) or 2+ years of quantitative professional experienceStrong knowledge of SQL, some knowledge of Python or R preferredExperience with data visualization and crafting narratives from dataExcellent communication skills including distilling results of complex analysis for a non-technical audienceResiliency and creativity in the face of data access barriers, incomplete and insufficient data. Attention to detail while prioritizing what is important.Healthcare experience is a plus but not requiredData Challenge There are two tables shown below, providers and appointments.Please write a SQL query that generates a list of provider names along with the total number of visits (not consultations) for each provider and include the query in your cover letter.providers"}