{"jobID": "2710808127", "jobLocation": "Quincy_MA", "jobTitle": "International Data Intern", "companyRating": null, "companyInfo": {"Website": "www.nfpa.org", "Headquarters": "Quincy, MA", "Size": "201 to 500 employees", "Founded": " 1896", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The National Fire Protection Association’s mission is to help save lives and reduce loss with information, knowledge and passion. Dedicated to the elimination of death, injury, property and economic loss due to fire, electrical and related hazards, the Association delivers information and knowledge through more than 300 consensus codes and standards, research, training, education, outreach and advocacy; and by partnering with others who share an interest in furthering the NFPA mission. Want to be part of something big? As an intern at the National Fire Protection Association, you get see firsthand how we have a key role in keeping first responders safe, helping to provide architects with guidelines for building design and safety, providing education to children in schools, and so much more. Interns at NFPA get to work with and learn from some of the brightest minds in the Data Science, Fire Protection and Life Safety Industries, and are able to apply these learnings to their work in the classroom, as well as their future careers. Project Areas:Identify national-level collection and reporting systems for structure and wildland fires outside the USDocument relevant government and non-government agencies responsible for these data systemsSummarize (a) technical data models and collection platforms and (b) policy requirements for their useDevelop case study assessments of the strengths and weaknesses of particular data systems of interest Necessary Skills and Backgrounds:Interest in learning data-driven solutions to public policy and safety problemsYou are operational/professional proficiency in Arabic, Chinese, or Spanish at a CEFR C1/IRL 3 or aboveYou have basic knowledge of applied data collection and analysis concepts, such as survey methods and question design Nice to have skills:Experience working in a data analysis fieldBasic knowledge of database systems"}