{"jobID": "2826773720", "jobLocation": "New_York_NY", "jobTitle": "Customer Insights Intern, Fall 2018", "companyRating": null, "companyInfo": {"Website": "www.birchbox.com", "Headquarters": "New York, NY", "Size": "201 to 500 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Sephora"}, "estimatedSalary": null, "jobDescription": "About Birchbox Founded in 2010, Birchbox is a leading beauty and grooming retailer, offering an efficient, personalized way to discover and shop for new products. We redefined the e-commerce experience by pairing a monthly subscription of samples with a curated online shop featuring more than 800 best-in-class brands. Every month, subscribers receive five prestige samples tailored to their unique profile along with inspiring editorial content that creates a seamless path to purchase full-size versions of their favorites on Birchbox.com. In 2012, we launched Birchbox Man and expanded internationally, and in 2014, we opened our first brick-and-mortar store in Soho. Today we have more than one million subscribers and operate in five countries, including France, Spain, UK, and Belgium. Birchbox is headquartered in New York City. The Customer Insights Intern at Birchbox will: Support the Customer Insights and Loyalty Marketing functions with day-to-day needs and work independently on a project throughout the semester.  In this role you will have the opportunity to gain an understanding of customer psychology and gather data from surveys, focus groups, customer interviews, and industry reports to help track customer satisfaction and answer big business questions.  We are looking for a high achiever who is curious about consumer behavior and marketing. The Customer Insights Intern at Birchbox is responsible for:Supporting customer research projects, including both qualitative and quantitative researchProgramming surveys and drafting reports of survey dataRecapping customer focus groups and distilling key takeawaysReviewing industry reports and other companies' campaigns to conduct competitive analyses**Note that the research projects will be focused on more traditional market research techniques such as surveys and focus groups; this is NOT a data science role**A successful Intern candidate will have:A self-starter attitude and ability to take direction, but also work independentlyComfortable with data analysis and working with Excel and PowerpointAn approachable and positive attitudeA strong interest in marketing and consumer psychology (and an interest in the beauty industry helps!)Extremely organized with a high level of attention to detailEnthusiasm for the Birchbox brandPrevious internship experience in an office environmentDemonstrated academic excellenceBusiness or social sciences majors preferred** Please note that this internship is for credit only. Candidates should be able to dedicate a maximum of 25 hours per week during the fall**"}