{"jobID": "2661716894", "jobLocation": "Boston_MA", "jobTitle": "Research Associate Intern", "companyRating": "3.1", "companyInfo": {"Website": "www.earthwatch.org", "Headquarters": "Boston, MA", "Size": "1 to 50 employees", "Founded": " 1971", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "39000", "jobDescription": "Location: Boston, MA, United States Position Type: Intern (unpaid) Department: Research POSITION SUMMARY:Earthwatch supports field research that utilizes highly motivated non-specialist volunteers, also called citizen scientists, to collect data.  The Research Department is responsible for soliciting, reviewing, and recommending research proposals for funding and supporting researchers throughout their Earthwatch careers. Earthwatch supports cutting-edge science through field-based expeditions that address: What is changing? (Discovery)Why is it changing? (Understanding)What can we do? (Action) Research Associate Interns will assist the Research Department in a variety of tasks to help support the research team and Earthwatch scientists.RESPONSIBILITIES:  Internships offer training in a variety of tasks and provide individuals an opportunity to be part of an exciting and dynamic team. Internship responsibilities may shift with seasonal needs. Responsibilities may include: Tracking impacts of field-based research projects on local ecological systems, socio-cultural systems, management plans,and on regional, national, and international policiesEvaluating project contributions to the increase of scientific knowledge through scientific peer reviewed journal articlesWriting scientific outputs and outcomes of Earthwatch projects in a way that is accessible to the publicData entry and management REQUIREMENTS:  This is an office-based position. Ideal candidates will have: Understanding of biology, ecology, environment, anthropologyGood attention to detailAdaptability, multi-tasking skills, and the ability to be a self-starter As part of Earthwatch’s Intern Program, interns earn expedition credits and travel stipends that can be used towards a qualified Earthwatch Expedition. Interns are also invited to participate in Earthwatch activities. We require a minimum commitment of 120 hours over a minimum of one month. We also encourage use of the internship for academic credit, thesis, or practicum work towards degree or certificate programs.  All applicants must make their own living arrangements for them to stay within commuting distance to Boston, placement will be based on qualifications and availability.  To apply, please submit one document in the resume field below containing all of the following items. Incomplete applications will not be considered. A Cover Letter illustrating your qualifications, why you are interested in this internship, and what you are looking to gain from this internshipA current resume, detailing relevant office and/or field experienceYour availability (days per week, and months of availability)Full contact information for three professional and/or personal referencesA recent writing sample excerpt (1 page max)"}