{"jobID": "2798429026", "jobLocation": "New_York_NY", "jobTitle": "Intern - Software Engineer", "companyRating": "4.4", "companyInfo": {"Website": "www.persistentsystems.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Telecommunications", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "76000", "jobDescription": " Job Description & ResponsibilitiesPersistent Systems is looking for a Software Engineer Intern for the Fall 2018 semester to assist in the development and implementation of a wide range of networking software for our industry-leading Wave Relay® products. You will have the opportunity to work alongside a team of senior engineers to develop technology that enables our customers to solve their most difficult networking problems. To excel in this internship, you should have experience developing software in C/C++ for Linux systems, an interest in embedded systems development, and an eagerness to solve challenging problems.  POSITION RESPONSIBILITIESAssisting in the development and implementation of a wide range of low-level embedded softwareAssisting with hardware developmentAssisting with the development of application software running on the Wave Relay® network, which may include device drivers, Linux kernel modules, network stack development, porting existing software to new embedded platforms, and other low level programming activitiesSupport in-house engineering activitiesAssisting in the integration of other systems, sensors, and components with the Wave Relay® systemAssisting with writing technical proposals Job Qualifications & ExperienceMINIMUM QUALIFICATIONSMust be working toward a Bachelor’s degree in Computer Science, Computer Engineering, or relatedExperience developing software in C/C++ for Linux systemsMust have a United States security clearance or the ability to obtain a United States security clearancePREFERRED QUALIFICATIONS / SKILLSExperience with embedded systemsExperience with Linux kernel and kernel module developmentKnowledge of mobile ad hoc networking (MANET)Ability to work with a great deal of autonomyExcellent verbal and written communication skillsAbility to work effectively in a team environmentExcellent problem-solving skills Company OverviewHeadquartered in New York City since 2007, Persistent Systems, LLC is a global communications technology company which develops, manufactures, and integrates a patented and secure Mobile Ad Hoc Networking (MANET) system: Wave Relay®. The company’s industry leading R&D; team has designed wireless networking protocols to support their cutting edge Wave Relay® system and technology. Wave Relay® is capable of running data, video, voice and other applications under the most difficult and unpredictable conditions. Their suite of products is field proven and utilized in Commercial, Military, Government, Industrial, Agriculture, Robotics, and Unmanned System markets."}