{"jobID": "2737417247", "jobLocation": "Austin_TX", "jobTitle": "Junior Data Scientist, Dell HR - Finance", "companyRating": "3.8", "companyInfo": {"Website": "www.dell.com", "Headquarters": "Round Rock, TX", "Size": "10000+ employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " IBM, Apple, HP Inc."}, "estimatedSalary": "87000", "jobDescription": " Dell provides the technology that transforms the way we all work and live. But we are more than a technology company we are a people company. We inspire, challenge and respect every one of our over 100,000 employees. We also provide them with unparalleled growth and development opportunities.  The core purpose of the Junior Data Scientist on the Dell People Insights Team is to provide advanced analytical capabilities to support HR data science initiatives. This role will focus primarily on initiatives in Talent Acquisition and Talent and Culture but will be called upon to help in our support of broader initiatives that yield tangible results for the company.  In addition, the Junior Data Scientist is responsible for taking the lead in consulting with stakeholders who do not have data science background on analytics projects, developing expertise in problem analysis, solution implementation, and ongoing optimization. The Junior Data Scientist is expected to stay current on industry trends, emerging technologies, new methodologies, and interact with multiple support team members to accomplish their objectives.  To accomplish this, the Junior Data Scientist must have a strong interest in data science, statistical analyses, customer behavior, and the retail space, while demonstrating comfort in dealing with ambiguity. Also, the Data Scientist must possess a high level of intellectual curiosity in proactively identifying opportunities for improved results. Job Responsibilities include:Selecting features, building and optimizing classifiers using machine learning techniquesExpertise machine learning and modeling platformsExpertise in HR organization hygiene and large enterprise org structure such as span of control, reporting structures and other HR leversExpertise in Statistics and validation of statistics and the development of forecasting models to include time series and curve fittingEnhancing data collection procedures to include information that is relevant for building analytical systemsProcessing, cleansing, and verifying the integrity of data used for analysisDoing ad-hoc analysis and presenting results in a clear manner with typical skills in powerpoint and presentationsWorking with teams to create automated anomaly detection systems and track performance of internal initiativesPreferred Education Background:Bachelors degree in a mathematical field such as but not limited to: Physics, Computer Science, Mathematics, Statistics, Data Science, Biology or EngineeringSkills and ExperienceExperience in software packages including R, other data science and data science tools such as Microsoft Azure, Spark, Informatica, etc.Experience with Sql, Hadoop ecosystem, WorkDay, Peoplesoft and/or Tableau, Qlikview and other BI Tools is helpful but not requiredExperience in talking with stakeholders and familiarization with Design thinkingBenefits We offer highly competitive salaries, bonus programs, world-class benefits, and unparalleled growth and development opportunities all to create a compelling and rewarding work environment. Apply now! Dell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Learn more about Diversity and Inclusion at Dell here."}