{"jobID": "2647079974", "jobLocation": "San_Jose_CA", "jobTitle": "Logistics and Inventory Manager", "companyRating": "4.6", "companyInfo": {"Website": "www.outsetmedical.com", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " NxStage, Baxter, Intuitive Surgical"}, "estimatedSalary": "72000", "jobDescription": "Position Overview The Logistics & Inventory  Specialist is responsible for managing logistics and inventory activities  in a manner that shall meet business fulfillment requirements in parallel with  the goal of transportation cost reduction. Assists with the selection and  management of third party logistics (3PL) partner and to ensure distribution  center capabilities. Continual focus to optimize inventory levels  while maintaining or lowering overall supply chain risk. Execute and  build on the company’s inventory controls, policies, standard procedures, and  utilize systems to achieve accurate inventory data and reporting. Essential Job  FunctionsManages activities  throughout the order fulfillment and transportation cycle to ensure on time  deliveries to customers.Assist with selection process and  management of a 3PL partner.Participates in the development  and implementation of warehousing procedures including receiving,  warehousing, material movements and inventory control.Ensures optimum inventory levels  at multiple locations working closely with Master Scheduler and  distribution center personnel.Responsible for creating and  maintaining distribution center kit packaging requirements.Complete documentation such as  bills of lading and shipping orders utilizing ERP system.Manage 3PL inventory cycle  counts, physical inventory projects and reconciliation of both.Communicate with freight forwarder  to ensure prompt pick up and on time deliveries.Monitor 3PL shipping metrics and freight forwarder  performance to provide feedback and resolve issues.Plan and track shipment of final products specific  to customer orders.Create processes for setting up 3PLs distribution  network.Implement Distribution Requirements Planning (DRP)  at a multi-site environment.Financial responsibility of company inventory and  assets.Reconcile shipping invoice discrepancies and  determine department allocations.Proactively reviews and reduces shipping costs and  transportation rates.Requirements/QualificationsPrefer four-year bachelor’s degree from an accredited college in business  administration, material management, engineering, or equivalent work  experience.7+ years working experience in logistics, inventory control, planning,  and ERP systems.APICS certification preferred.Self-motivated, energetic, dependable, honest, and thorough.Leadership skills with the ability to effectively delegate work to  subordinates, and the ability to evaluate and positively influence performance.Strong planning, organizational, analytical, communication, and  networking skills are required.Ability to change direction and handle multiple responsibilities and  tasks on a regular basis.Team attitude; eager to cooperate with others with exceptional  interpersonal communication skills.Exceptionally high level of commitment to the success of individuals and  overall projects.Competent with computer software such as QAD, SAP, Microsoft Office,  Microsoft Project and Microsoft Visio."}