{"jobID": "2809119097", "jobLocation": "Waltham_MA", "jobTitle": "Data Analyst - Customer Experience", "companyRating": null, "companyInfo": {"Website": "www.apintego.com", "Headquarters": "East Rochester, NY", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " AP Integos mission is to provide small business owners peace of mind so they can pursue their dreams. Every day, were inspired by one simple idea: that it should be easy and delightful for small businesses to find and manage the right insurance coverage for their needs.  We're searching for our first full time Data Analyst who will use customer feedback and data to improve our Customer Experience. We're looking for candidates with a couple years of data and analytics experience who'll be interested in learning and growing our customer experience program. In this role candidates will deep dive into customer data, providing quantitative and qualitative analysis. Analysts will use their data know how and creativity to design surveys and questionnaires that get to the heart of our customers experience. Analysts will have access to a number of data sources and translate complex data points into usable information to help transform our customer experience. Heres what youll do day to day:Deep dive into quantitative and qualitative data, including NPS, CSAT, and user researchUtilize data to find trends in customer pain pointsEngage with our customers to gain qualitative feedbackCollaborate with business analysts on customer survey design and reporting needsContinuously identify opportunities for an improved customer experienceOwn our company-wide monthly Voice of the Customer insights updateCandidate Qualities Include:At least 2 years of professional experience as a data analystPassionate about data and analytics - and using it to impact businessExperience using data sources to build and deliver real world solutionsBachelors degree or equivalent practical experienceAbility to work effectively cross-functionally and collaborativelyExcellent written and verbal communication skillsExperience working in a contact center environment a plusAbout AP Intego AP Integos mission is to give small business owners peace of mind so they can pursue their dreams. By making insurance easy to understand, to use and to pay for, AP Intego is combining insurance know-how with the latest technology to reimagine the insurance experience for small businesses. Founded in 2006, AP Intego has offices in Waltham, MA, Rochester, NY and Denver, CO. We offer an amazing combination of compensation, benefits and opportunity for outstanding individuals to thrive in a vibrant, entrepreneurial environment."}