{"jobID": "2823663153", "jobLocation": "Middleton_MA", "jobTitle": "Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.quartzbenefits.com", "Headquarters": "Sauk City, WI", "Size": "501 to 1000 employees", "Founded": " 2017", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " SSM Health, Group Health Cooperative of South Central Wisconsin"}, "estimatedSalary": "57000", "jobDescription": " Quartz is seeking an individual who is interested in growing a career as a Data Analyst. This role assists in the development, maintenance, and support of the Quartz enterprise data warehouse system and corresponding data marts.Key Responsibilities include:Gather requirements from end users or research production issues to identify root cause and developing remediation plans.Use standard data tools to gather required data to fully profile the data and analyze its ability to meet the requirements.Work with designers, as necessary, to design solution(s).Document processes for getting data to move accurately through the solution.Write and execute test plans and work with developer(s) to remediate any defects.Analyze the data to identify data inconsistencies, report them to senior employees and follow through to make sure they are adequately logged and addressed.Ensure vendor data feeds are meeting departmental and organizational standards, along with fulfilling business requirements.Understand the business processes and rules that create the data including claims, enrollment, billing, etc. and work with the subject matter experts in those areas to ensure they understand and can leverage their data as needed.Identify opportunities for improving effectiveness and/or efficiency of processes and controls that can be improved upon. The preferred candidate will possess the following skills/qualities: Associate’s Degree (or higher) is preferred, however relevant experience will be considered in lieu of education requirement.1-4 years of relevant experience analyzing or querying data in a professional data warehouse setting.Health insurance experience is preferred – specifically in an analytical role related to fees, provider set up and benefit plansIntermediate knowledge of SQL, analytical software and personal computersIntermediate knowledge of data warehousing principles including provenance, lineage, modelling, etc. and applies best practices along with modern data architecture principles including the enforcement of data policies and access controlsExperience using query tools (BusinessObjects, Cognos, MS Query or SAS) is preferred.Ability to problem solve using analytical thinking skills.Works well independently – must be inquisitive and seek answers to complex questions without being prompted.Ability to develop rapport with end users, co-workers and third-party vendors.Strong organizational and time management skills. This role will work out of our office located in Middleton, WI. Quartz offers an excellent benefit and compensation package, opportunity for professional growth and a professional culture built upon the foundations of Respect, Responsibility & Relationships.  Quartz values and embraces diversity and is proud to be an Equal Employment Opportunity, Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, gender identity or expression, sexual orientation, age, status as a protected veteran, among other things, or status as a qualified individual with disability.  "}