{"jobID": "2802527834", "jobLocation": "Culver_City_CA", "jobTitle": "Data Analyst (Contract)", "companyRating": "4.2", "companyInfo": {"Website": "www.snacknation.com", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Consumer Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": "At SnackNation, were working hard to inspire more conscious food decisions at over 4,000 offices across the country every month. Were shaking up the market by building the foremost source of snack preferences and recommendations to enable emerging brands to succeed and get better-for-you food into the hands of individuals such as yourself.The Role:SnackNations Technology team is seeking a Data Analyst (6-month contract) who will help gather, manipulate, clean, and analyze datasets to identify business insights that inform strategy to our leadership team.Who You Are: B.S. or B.A. in Business, STEM, or other quantitative field1-3 years of analyst experience with a heavy focus on data1+ years of experience working with TableauAn absolute guru at MS ExcelExperience with extracting and manipulating data using SQLA stickler for the detailsConstantly seeking opportunities for growthExcellent oral and written communication skills with a proven ability to influence and articulate data stories to business and technical audiencesWhat Youll Do:Work with stakeholders throughout the duration of a data project to gather requirements, develop timelines, communicate progress, and present findings/resultsTake on responsibility of existing internal reporting for various departments-Standardize reporting and define important metrics/KPIsRespond to ad-hoc reporting needs while ensuring data accuracy and integrityDesign reports that measure the success of campaigns and initiatives throughout their lifetimeAnalyze product feedback data to discover meaningful and actionable insightsOptimize complex reporting workflows by identifying inefficiencies in techniques and data collection methodsDevelop dashboards and design data visualizations that effectively communicate complex analyses and trends and that track performance over timeWrite efficient queries and stored procedures using SQL that will gather data in the right format to be used by the end user for various analysesAbout SnackNation:We exist to inspire more conscious food decisions by connecting healthier brands with engaged consumers through a smart marketplace. SnackNation cares about making a positive impact on the world, with a wellness-minded culture and values.We look for people who aren't afraid to be themselves. Because that's our vibe. Whether it's health or sales goals, our mantra is Better Every Day. In fact, we offer meditation, yoga and bootcamp during work hours, not after.If you're a wellness-loving professional that wants to do impactful work, take on a lot of responsibility and be a part of our driven company culture, join us. You'll be surrounded by good people wanting to do amazing work and make an impact in our booming CPG space. We promise to help you find your better you."}