{"jobID": "2768326904", "jobLocation": "San_Francisco_CA", "jobTitle": "Account Director - Digital Advertising", "companyRating": "3.3", "companyInfo": {"Website": "www.tmp.com", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Jibe, Phenom People, SmashFly Technologies"}, "estimatedSalary": "82000", "jobDescription": " As an Account Director, you will manage client relationships while developing and leading multi-faceted digital strategies leveraging our integrated software solutions and digital delivery teams -- all for some of the most recognized brands in the world. Youll identify and drive growth opportunities, fostering innovation that delivers on our clients business goals. And youll constantly push the limits of talent acquisition to change the way companies and candidates connect. Its one of the only roles at TMP that allows you to engage with all of our offerings from software, media and metrics to creative and brand. What does a great Account Director do?As a principal point of contact for assigned client relationships, you'll be responsible for helping to build long-term client relationships, anticipating client needs, and working with your supporting teams to coordinate efforts aimed at solving those needs.The Account Director is responsible for coordinating the development, management, measurement and presentation of multi-channel digital strategies aligned to client goals.The Account Director works with Digital Strategists, Creative, Support and Delivery teams to efficiently deliver strategies, solutions, flawless execution and results for presentation to the client.You will lead the integration and/or aide in the sale of our proprietary career site software as a central point of your clients digital strategy, and will ensure our software platform is a productive part of that strategyStaying attuned with your clients digital presence and the changing digital landscapes, you'll be responsible for managing and anticipating a list of delivery tasks and working with support teams to ensure tasks are being completed in a timely manner. You'll also be expected to work with teams to put processes in place aimed at prevention or timely resolution.You will partner directly with the Analytics Team and Digital Strategists to ensure progress towards client goals is actionably measured and that results are incorporated into client deliverables.You'll be responsible for leading many client meetings, as well as working with the Client Strategist to coordinate the agenda and presentation materials.You'll be expected to mentor Account Executives, as well as participate in exercises aimed at connecting and educating members of other teams throughout TMP.Requirements for ConsiderationMust have 3+ years of experience developing and presenting custom digital solutions within a digital marketing, PR, and/or advertising agency environmentA deep understanding of digital mediums, technologies, and trendsStrong analytical skills and working knowledge of Google AnalyticsStrong presentation skills Join the global leader in talent acquisition technologies thats committed to finding new ways to leverage software, strategy and creative to enhance our clients employer brands across every connection point. Were looking for unconventional thinkers. Relentless collaborators. And ferocious innovators. Talented individuals who are ready to work towards solutions that transform the way employers and job seekers connect. We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.#GDAccountServices"}