{"jobID": "2826785493", "jobLocation": "San_Jose_CA", "jobTitle": "Perception Engineer, Autonomous Driving", "companyRating": null, "companyInfo": {"Website": "www.samsung.com/global/business/semiconductor", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 1983", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Perception Engineer, Autonomous Driving The Smart Machines team at Samsung Strategy and Innovation Center (SSIC) is seeking perception SW Engineers for its Autonomous Vehicle teams. In this team, you will be responsible for developing and maintaining software for vehicle perception using various sensor input devices including Cameras, LIDAR, RADAR, GPS, IMU and others. You will help drive multi-object tracking, state estimation, sensor fusion and etc. You will also work on efficient software and hardware implementations on current and/or upcoming Samsung product platforms.  You should have strong communication, organizational, and analytical skills. Experience with GPU technology, image processing, computer vision, and multimedia are highly valued. Familiarity with deep learning / artificial intelligence is desirable. Responsibilities:Work on AI solutions that are targeted towards disruptive opportunities for Smart Machines business such as perception, computer vision, and etc.Craft perception software for Autonomous Vehicle products and integrate your work into our cutting-edge platformDesign and maintain system tools for product development and verificationWork with hardware and software partners to develop cutting-edge platforms for training and inferencePerformance optimization and benchmarkingPerform other duties as necessary for completion of projects and achievement of goals.Education:MS/PHD (CE, EE or CS equivalent)Publications in Deep Learning, Machine Learning, computer vision, or related field are preferredQualifications:Experience with Machine Learning, Deep Learning or other Artificial Intelligence paradigmsExperience with object detection and classification, segmentation, and sensor fusionA deep understanding of programming languages such as C, C++ and PythonExperience with software engineering tools and Linux environment (e.g., Git, CMake, gdb, etc)Standout skills:Has work/project examples available to review (GitHub, etc.), could be private projects as wellExperience working with embedded systems with real-time constraintsExperience with CUDA and/or OpenCL are desirableExperience with OpenCV and/or OpenVX are desirable"}