{"jobID": "2655802647", "jobLocation": "Santa_Clara_CA", "jobTitle": "Systems Firmware and Kernel-mode Engineer (Computer Vision)", "companyRating": "4.3", "companyInfo": {"Website": "www.nvidia.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1993", "Type": " Company - Public (NVDA) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "161000", "jobDescription": " We are hiring a software engineer to develop Firmware and Linux Kernel modules for a new Programmable Computer Vision Acceleration engine in the Tegra SoC platform. Our team delivers new features and improvements to realize the groundbreaking potential of NVIDIA mobile systems, ranging from self-driving cars, AV/VR, intelligent video editing and autonomous mobile robotics.  You will need to have a deep understanding of SoC principles, general systems architectures, memory management, CPU, threading, real-time scheduling, synchronization, computer networks and be comfortable around hardware specs.  Required expertise include operating systems principles, device drivers, memory management and scheduling, multithreading, strong programming in C/C++, computer networks, data structures, real-time systems and problem solving capabilities. What you'll be doing: As a member of the team, you will use your design abilities, coding expertise, and creativity to deliver state of the art real-time firmware and kernel mode drivers for a low power, high performance computer vision accelerator engine. You will craft elegant and tightly optimized solutions to exciting problems, take part in shaping the future direction of a new computational paradigm inside NVIDIA's mobile platform and engage in reciprocal work with your peers across NVIDIA. You'll participate in design and implementation of new features and modulesHelp define forward-looking improvements to the system architectureWrite safety-critical, robust, effective, maintainable, and well-tested code, mainly in CDesign and develop solutions in both the micro and macro scalesWhat we need to see:BS or MS degree in Computer Science, Electrical Engineering​ or related field with 4+ years of experienceStrong C and C++ programming skillsKernel mode and Firmware development experienceExperience with SoC software developmentFamiliarity with Data structures and Algorithms, Networking and OS fundamentalsIntimate familiarity with concepts like threads, processes, scheduling, synchronization and virtual memoryGood written communicationExcellent written and verbal social skills, autonomously and multi-tasking.Ways to stand out from the crowd:Deep Understanding of system level architecture, such as interconnects, memory hierarchy, interrupts, and memory-mapped IOKnowledge of memory coherence and consistency modelsExperience in VLIW, SIMDAssembly language developmentFluency in Makefile and build scripts.Experience with embedded Linux and/or QNXExperience with Domain Specific Language development toolchainComputer Vision, Deep learning experience is a plusHaving hands on experience with automotive safety qualification is a huge plus NVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most brilliant and talented people in the world working for us. If you're creative and autonomous, we want to hear from you!NVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression , sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law."}