{"jobID": "2822936386", "jobLocation": "Boston_MA", "jobTitle": "Board Certified Behavior Analyst (BCBA) Part-Time or Full-Time", "companyRating": null, "companyInfo": {"Website": "www.keyautismservices.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Full Time = $55,000 - $85,000 + BenefitsPart Time = $65 per hourWe are looking for dedicated BCBAs who share our passion of helping children with Autism to join our team! Are you looking for a change? This is an opportunity with an amazing organization that fosters freedom and growth opportunities. Don’t let it pass you by!I would love an opportunity to speak with you to explain why working with us may be the best career move you can do.Job Responsibilities:Conduct initial & ongoing assessments and write progress reports.Develop & monitor individualized treatment plans and behavior support plans.Supervise and train ABA Therapists.Develop and monitor individual behavior management protocols and behavior intervention plans for children.Provide support, instruction, and feedback to families and caregivers with regard to managing challenging behaviors and teaching replacement behaviors.Conduct Functional Assessments and Functional Analysis for all problem behaviors.Review program effectiveness, make recommendations, monitor data collection, and chart progress.What we offer:Excellent competitive hourly rates, commensurate with experience and educationExcellent Health insurance401K matchTraining and professional development opportunitiesFree access to our on demand training library with opportunity to earn up to 50 CEUs including content in ethics and supervisionPromotional and bonus opportunitiesOpportunities to network with other experienced BCBAs on the KEY teamVirtual electronic data collection system to allow for light paperworkFlexible hours and the ability to choose your work schedule.Do you know someone a BCBA or Paraprofessional who is looking for a job? We offer referral bonuses for BCBAs and Paraprofessionals!"}