{"jobID": "2806908750", "jobLocation": "Boston_MA", "jobTitle": "Data Scientist or Senior Data Scientist - Legal Analytics & Data Science", "companyRating": "3.3", "companyInfo": {"Website": "www.libertymutualgroup.com", "Headquarters": "Boston, MA", "Size": "10000+ employees", "Founded": " 1912", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Travelers, Allstate, State Farm"}, "estimatedSalary": "123000", "jobDescription": "Advance your career at Liberty Mutual - A Fortune 100 Company!The legal  world is in the midst of a Data Science and AI revolution. The Liberty Mutual  Legal department has been on the forefront of Legal Analytics for years and has  seen the substantial benefits of applying modeling, including predictive  modeling and deep learning, to legal data. We are looking for a talented data  scientist to join our team building AI and decision support tools that help our  clients and policyholders obtain better outcomes on legal related issues.  In this  role, you will collaborate closely with a team of data scientists, analysts, and  IT developers. You and the team will work with clients across the company to  develop strong understanding of business needs. You will research and apply machine  learning and statistical algorithms to projects aimed at revealing the drivers  of legal cost and related outcomes. Example projects include using deep learning  based NLP models classify millions of text-based legal records, developing  machine learning models to predict the outcome of a case, and using Bayesian  hierarchical models to estimate causal effect of legal decisions. Responsibilities:Develop predictive  and explanatory models that help improve legal decision makingDevelop  models and analysis on unstructured text using deep learning and other NLP  (Natural Language Processing) techniquesPerform  all data preparation and exploratory data analysis stepsGuide implementation,  testing, and evaluation of models.Work with  clients to develop strong understanding of business needs and use business  understanding to help design effective analytical solutionsManage  and execute all aspects of analytic initiatives, including developing project  plans and guiding other team membersPresent  methodology and results of analysis to a broad range of audiences, including  both technical and non-technical, at all levels of the organizationCollaborate  closely with other members of the Legal Analytics and Data Science team and the  Liberty Mutual Data Science communityQualifications:Bachelors  degree in Statistics, Economics, Computer Science, or any quantitative  discipline with relevant work experience, required; advanced degree a definite  plusSignificant  professional experience required applying quantitative analysis and modeling to  solving real-world business problems including experience in model validation,  testing and deploymentAdept at  framing business questions and practices in analytic terms, and translating  business requirements into corresponding datasets, analyses, models, and reportsExperience  communicating technical results to both technical and non-technical users using  effective story telling techniques and visualizationsDemonstrated  ability to perform high quality work both independently and collaboratively as  a project team member or leaderDemonstrated  proficiency in R or Python requiredExperience  applying Deep Learning and/or NLP techniques (especially RNNs using Tensorflow  or PyTorch) on large unstructured data highly preferredBenefits:We value your hard work, integrity and commitment to positive change. In return for your service, its our privilege to offer you benefits and rewards that support your life and well-being. To learn more about our benefit offerings please visit: https://LMI.co/BenefitsOverview:At Liberty Mutual, we give motivated, accomplished professionals the opportunity to help us redefine what insurance means; to work for a global leader with a deep sense of humanity and a focus on improving and protecting everyday lives. We create an inspired, collaborative environment, where people can take ownership of their work; push breakthrough ideas; and feel confident that their contributions will be valued and their growth championed.Were dedicated to doing the right thing for our employees, because we know that their fulfillment and success leads us to great places. Life. Happiness. Innovation. Impact. Advancement. Whatever their pursuit, talented people find their path at Liberty Mutual.Job: Analytics Primary Location: United States-Massachusetts-Boston Schedule: Full-time Salary: $103,000-$145,000 Education Level: Bachelor's Degree (±16 years) Travel: Yes, 10 % of the Time"}