{"jobID": "2755215222", "jobLocation": "San_Jose_CA", "jobTitle": "Procurement & Logistics Specialist", "companyRating": "3.6", "companyInfo": {"Website": "www.247.ai", "Headquarters": "San Jose, CA", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Nuance, RightNow Technologies"}, "estimatedSalary": "58000", "jobDescription": " The Procurement & Logistics Manager oversees the life cycle of assets in our data centers including RFQ's, purchase requests, tracking incoming /outgoing shipments, invoice approvals and metrics based reporting. Responsibilities:Work with data center operations team to manage inventories and to assure timely acquisition of equipment and supplies for sparing, maintenance and new projects.Development of appropriate procurement metrics for process improvement, streamlining of costs, and to increase the quality of the procurement and logistics functions.Maintain up-to-date metrics dashboards and create reports for internal tracking and planningContinually seek ways to streamline and decrease costs and increase quality of purchasing servicesDrive standardization of processes and procedures for purchasing, inventory, asset managementOwn and manage vendor relationshipsManage support contracts and renewals of services and software licenses.Review inventory, inbound and outbound shipments and ensure proper stock levels are maintained to support build activities in all locations.Work closely with project managers, internal procurement and vendors to fulfill orders quickly and accuratelyUnderstand and abide by all security and operational policies.Qualifications:5+ years of work experience in logistics & purchasing for data center infrastructureInventory and Asset management experienceAbility to research and evaluate product sources and conduct cost analysis for competitive pricing and positioningExperience in the development of project controls, cost estimating, cost control and reportingMust have experience dealing with freight haulers, overnight shippers, and air freighters.Experience with the creation and evaluation of RFQs for equipment and suppliesMust be comfortable working with global cross-functional teams to achieve a common goalAbility to manage multiple projects and tasks simultaneouslyAdvanced proficiency with Microsoft Office applications (Word, Excel, PowerPoint, and Outlook), Oracle, Jira & ConfluenceProfessional presentation & communication skillsCSCP, CPIM, CPSM certification (not required but nice to have).ABOUT [24]7.ai: [24]7 is redefining the way companies interact with consumers. Using artificial intelligence and machine learning to understand consumer intent, [24]7’s technology helps companies create a personalized, predictive and effortless customer experience across all channels. The world’s largest and most recognizable brands are using intent-driven engagement from [24]7 to assist several hundred million visitors annually, through more than 1.5 billion conversations, most of which are automated. The result is an order of magnitude improvement in digital adoption, customer satisfaction, and revenue growth.  Learn more at www.247.ai We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. #LI-PS1"}