{"jobID": "2711631652", "jobLocation": "New_York_NY", "jobTitle": "Manager, Financial Data Operations - Healthcare Experience Preferred", "companyRating": null, "companyInfo": {"Website": "www.vnsny.org", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1893", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Overview Visiting Nurse Service of New York (VNSNY) is the nations largest not-for-profit community-based health system. VNSNY provides a comprehensive array of home- and community-based programs, including health plans, tailored to the needs of high-risk, vulnerable New Yorkers, improving their quality of life. Each day,more than 18,000 VNSNY employees including nurses, rehabilitation therapists, social workers, dieticians, other allied professionals, and paraprofessionals deliver compassionate care, unparalleled medical expertise, and 24/7 solutions and resources tomore than35,000 patients, helping them to live the best lives possible. Responsibilities Responsible for overseeing the budgeting activities. Analyzes and coordinates the activities needed to produce a consolidated departmental budget. Develops and maintains sophisticated models to properly reflect all budgeted Departmental metrics including but not limited to: therapy volume, staffing, and expense projection allocations. Manages financial and operational data analysis to ensure departmental resources are effectively utilized in the most cost-effective manner. Works with the Regional Managers to develop sound business practices and updates them with operational and financial analysis in order to make optimal business decisions. Works under general supervision. Plans, develops and maintains the departmental budget model, which produces the departmental budget by region, program, and payor mix. Plans, develops and maintains financial models, such as, but not limited to, expense allocations, therapy volume visits, admissions, ADRs and other financial analysis. Assists Administrator in establishing therapist productivity targets, used to support the departmental budget process. Manages the maintenance and modifications of the staffing salary and fringe benefits budget to properly reflect FTE and salary/fringe data at the job code level. Ensures that all salary and fringe components are incorporated to produce an accurate representation of these expense components. Develops strategic business analyses and assists the Management Team in making appropriate business decisions. Trains and assists department staff in the development and understanding of budgets and budgeting approaches through in-services and one-on-one meetings. Participates in special projects and performs other duties as required. Education: Bachelor's Degree in Accounting, Finance, Business Administration or a related technical field required. Masters in Business Administration or Public Administration preferred. Experience: Minimum of five years progressively responsible experience in budgeting, financial planning and analysis, preferably in a health care setting required. Strong quantitative and qualitative analytical skills required. Proficient with personal computers, including Excel and other MS office applications required. Knowledge of People Soft financial module preferred. CA2018"}