{"jobID": "2755009172", "jobLocation": "San_Jose_CA", "jobTitle": "Systems Design Engineer", "companyRating": "3.7", "companyInfo": {"Website": "www.xilinx.com", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 1984", "Type": " Company - Public (XLNX) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Qualcomm, Intel Corporation, AMD"}, "estimatedSalary": "98000", "jobDescription": "DescriptionXilinx is the leading provider of All Programmable FPGAs, SoCs, MPSoCs and 3DICs. Xilinx's all-programmable devices are designed into tens of thousands of products that improve the quality of the everyday lives of billions of people worldwide. For over 30 years, Xilinx has been behind some of the greatest advancements in technology and science - from the industry's first fabless semiconductor model to the NASA Curiosity Mars Rover, to today's autonomous vehicles and hyperscale data centers. Xilinx uniquely enables applications that are both software-defined, yet hardware optimized - enabling smart, connected and differentiated applications across technology's biggest megatrends, including Machine Learning, 5G Wireless, Embedded Vision, Industrial IoT and Cloud Computing and more.Platform Applications Engineering group is a fast paced and dynamic group with a charter to deliver high quality “go to market” collateral like Reference Designs/Platforms, Demos and Application Notes targeting key markets including Video, Vision, Data Center Acceleration, Automotive, Industrial including emerging areas like Machine Learning. The team is also actively engaged in solving customer issues and enhancing customer experience. We are looking for a candidate with good experience and strong skills in System Design and Hardware development. Candidate will be responsible for developing and delivering Reference Designs/Platforms, Applications and Solutions. Candidate will work with a cross functional team on enhancing customer experience by solving customer issues for Xilinx’s All Programmable System on a Chip Product line.  Job Responsibilities: Develop key System/Hardware components of Reference Designs/Platforms and Solutions working collaboratively with teams comprising of hardware and software engineersParticipate in and resolve critical customer support cases in software applicationsDevelop documentation to support customer collateral like User Guides, Application Notes and White Papers to enhance user experienceEducation RequirementsBachelors or Masters Degree in Electrical Engineering or Computer Engineering Years of Experience2-3 (Masters), 3-5 (Bachelors)Ideal Candidate will haveExperience in RTL based FPGA Design, Verification and ValidationExperience and knowledge in one morehigh speed interfaces (DDR2/3, PCIe, Ethernet, SD, SATA, USB etc) and computer systemsSystem Validation and bring up of Embedded SystemsExperience in debugging and troubleshooting systems based on SoCSource management experience with GIT or equivalentGood communication skills and methodical working practices"}