{"jobID": "2756284894", "jobLocation": "San_Jose_CA", "jobTitle": "Parent Partner - WRAPAROUND", "companyRating": null, "companyInfo": {"Website": "www.unitycare.org", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 1993", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job Title  Parent Partner - WRAPAROUND  Position  ID 27056727 Duration  Location  San Jose,  CA 95126 Other Location  DescriptionABOUT UNITY CARE Our mission is to provide quality youth and family programs for the purpose of creating healthier communities through lifelong partnerships.  Headquartered in San Jose, with incredible weather, culture and sports, and the SF Bay and ocean just minutes away. Unity Care offers a wide range of services benefiting at-risk and foster youth and their families throughout Northern California. Its signature program, established in 1993, focuses on serving the housing needs of youth in foster care and beyond. The organization provides more than two dozen community-based, education and behavioral health programs, transforming the lives of over 6,000 youth and families annually.  We are proud to have one of the most ethnically and culturally diverse workforce in the Bay Area. We have a friendly, servant-leader culture with significant growth opportunities. OVERVIEW: The purpose of this position is to provide active, hands-on peer support to parents/caregivers of youth receiving services. Effective peer support should be friendly, helpful, accessible and flexible. Peer support may be delivered in individual or group settings at the agency, in family homes or in community environments. The role of the Parent Partner is to provide peer support but also to work collaboratively to support systems change by increasing family involvement and decreasing unintentional, bias about parents. DIRECT REPORTS:NoneQUALIFICATIONS:RequiredMust be the biological, adoptive, kin parent, or non-related family member of a youth with emotional or behavioral challenges or has had systems experience with their child in a child serving system ((i.e. mental health, child welfare, probation and special education).Must have direct experiences with child serving systems (i.e. mental health, child welfare, probation and special education).It is optimal for the Parent Partner to have experienced the level of care with their youth equivalent to program assignment.Must have life experience as the parent of a youth with emotional or behavioral challenges. Education in the area of social services is optimal but not necessary.Demonstrates an ability to maintain a non-judgmental attitude towards families.Have the experience and ability to provide MediCal documentationPreferredMHRS County Certification preferred.Bachelor’s degree preferred.Speak, read, and/or write another language fluently, with a demonstrated ability to work with diverse ethnic populations a plus.RESPONSIBILITIES INCLUDE (but not limited to): ESSENTIAL FUNCTIONS OF THE ROLE OF FAMILY SPECIALIST II1.Engagement Phase Core Skills Decide collaboratively with the facilitator details about the initial engagement meeting with the family.Introduce yourself as a peer who is the parent of a child with emotional or behavioral challenges and explain the role of the Parent Partner.Encourage the family to share their own story including their culture, beliefs, and situation.Consider the family’s story to identify family strengths, possible team members, and what parts of the Parent Partner’s story would be helpful for the family to hear.Effectively share your own story in a way which builds connection, confidence, and hope for the family relevant to the family’s culture, beliefs and situation.Explore the parent’s situation regarding the need for respite, relief, and safety and work collaboratively with the facilitator to develop and support stabilization.Work collaboratively with the family and facilitator to determine potential team members, both formal and informal, and what might motivate them to participate in the team processSecure agreement with family about the attendance of team members at the first child and family team meeting.Planning Phase Core SkillsExplain the parent’s perspective, culture, and beliefs in a way that increases understanding by others while decreasing differences and highlighting similarities.Assess the level of support that is needed by the parent based on the families support network, their ability to involve their support network, and the ability of the parent to be heard by others.Meet with the family regularly and consistently in order to encourage and support an understanding of their vision for the future.Work with the parent to develop plans/strategies of how the Parent Partner can support the parent during meetings to ensure the parent’s culture, beliefs, experience, voice and choice are heard by the team and are incorporated into the Family Support Plan. Share information with other wraparound team members about the parent’s perspective, culture, and beliefs including how the parent experiences being heard by the team.Participate with the facilitator and the family in planning and developing a family team meeting agenda that includes timelines.Assist the team in recognizing and acknowledging the family’s lived experience, culture, and beliefs to build agreement for a common team vision statement.Assist the team to reach agreement about underlying unmet needs that may be driving the situation in the family. Clarify unmet needs versus service provision.Actively participate as needed, by speaking up and through actions, to support the family’s perspective during the family team meeting.Assist the team during brainstorming with identifying additional needs and strengths.Participate with the team in brainstorming a wide range of interventions to prioritize needs, reminding team members of potential family strengths that will match interventions.Volunteer for tasks if the Parent Partner’s strengths match the intervention and encourage all team members to do the same.Actively participate with the family and other team members in the development of the initial Family Support PlanAssist the team in making sure that the family’s culture, beliefs, voice and choice is reflected in the Family Support PlanImplementation Phase Core SkillsProvide individualized, peer to peer support to parents.Attend and participate in all Family SupportDevelop plans/strategies with family to ensure their concerns and perspective are heard and understood.Communicate on a regular basis with families, according to their identified needs.Support, respond, and/or implement proactive responses to families in crisis, both during and after business hours as designated in the safety/crisis plan.Connect the family with identified community resources. Assist in introducing and engaging the family with the community resource, ensuring they can access the service after transition.Provide direct interventions as specified in the Family Support PlanMaintain direct communication with the parent between team meetings on the effectiveness of the interventions.Communicate information about the effectiveness of the interventions/process related to the Family Support Plan with the facilitator for inclusion on team meeting agendas.Work with parents and other team members to continue to identify unmet needs that the team has agreed to address.Recognize, celebrate and document team strengths and successes collaboratively with the team.Transition Phase Core SkillsHelp introduce the transition phase of Wraparound and the completion of the Wraparound process to the family and team members.Practice implementation and rehearse crisis responses with the family as identified in the Family Support PlanContinue to assist the family in accessing needed resources/supports utilizing the family’s culture and beliefs and each team member’s individual strengths ensuring that the family is engaged with new resources.Assist the facilitator in preparing the transition phase of the Wraparound process by ensuring the family’s culture; beliefs, their mission statement and their identified needs, voice and choice are evident in the process.Celebrate the family accomplishments with a Transition/Family Achievement Portfolio and event that highlights their progress always considering the family’s culture.Other duties as assigned.ESSENTIAL DUTIES: To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform essential job functions. Ability to read and interpret documents and procedure manuals. Ability to write routine reports and correspondenceAbility to speak effectively before groups of students or employees of organizationAbility to apply common sense understanding to carry out instructions furnished in written, oral, or diagram form.Ability to deal with problems involving several concrete variables in standardized situationsAbility to identify negative disruptive behaviors and redirect behavior using mediation techniquesWhile performing the duties of this job, the employee is occasionally required to stand; walk; sit; use hands to handle, or feel objects, tools or controls; reach with hands and arms; climb stairs; balance; stoop; kneel, crouch or crawl; talk or hear; taste or smell.The employee must occasionally lift and/or move up to 50 pounds.The employee may be required to make and/or receive physical contact in the process of delivering First Aid/CPR or Handle with Care, or in training to those methods.Specific vision abilities required by the job include close vision, distance vision, color vision, peripheral vision, depth perception, and the ability to adjust focus.Ability to get CPR and First Aid certificate within 30 days of start date, and maintain a current certificateMust clear a Department of Justice (DOJ) and Federal Bureau of Investigation (FBI) background check including fingerprinting before start date and maintain clearanceMust clear a health screening, including TB before start date and maintain clearanceMust be at least 21 years of age and able to work in a Community Care Licensed FacilityMust be able to drive, have a valid driver’s license, clean driving record and maintain a clean driving record.Meet and maintain the minimum vehicle liability and property insurance limits (in order to be insured by our insurance carrier for transportation of residents)COMPENSATION: We value our employees’ time and efforts. If you are committed to helping others, we work to maintain the best possible environment for our employees where people can learn and grow with the organization. Plus we are committed to your success and offer competitive compensation and an excellent benefits package which includes paid vacation and sick time, medical, dental, vision and life insurance for all full time staff. We strive to provide a collaborative, creative environment where each person feels encouraged to contribute to our processes, decisions, planning and culture. TO APPLY: Please send a resume and compelling letter of interest indicating how your skills, knowledge and experience match the responsibilities articulated in the job description in confidence to:  Deepika Bettadapura  dbettadapura@unitycare.orgOpenings  1"}