{"jobID": "2787686523", "jobLocation": "Santa_Monica_CA", "jobTitle": "Data Scientist (NLP)", "companyRating": "4.0", "companyInfo": {"Website": "www.gumgum.com", "Headquarters": "Santa Monica, CA", "Size": "201 to 500 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Vibrant Media"}, "estimatedSalary": "111000", "jobDescription": " DescriptionGumGum's Data Science team is working on a variety of cutting edge multilingual NLP problems such as Topic Detection, Sentiment Analysis, and Named Entity Recognition. We have an opening for an experienced NLP Data Scientist at our headquarters in Santa Monica, CA.  We are looking for a Data Scientist with a degree in NLP, Machine Learning, or related field. The ideal candidate should possess expert knowledge as well as extensive experience working with textual data. Responsibilities:Work on a variety of NLP and Machine Learning projectsPerform hands-on Machine Learning tasks and statistical analyses with tools like SciKit-Learn, NumPy, and NLTKApply Deep Learning frameworks to a wide range of problemsOwn projects from their inception to production release (and beyond)Write efficient, clean, and maintainable Python codeHelp find, create, and evaluate multilingual corpora and integrate them into our workflowWork with your team members and members of other teams to implement scalable and maintainable cloud-based solutionsRequirements:Master's or PhD in NLP, Machine Learning, or related field> 3 years relevant professional experienceIntermediate knowledge of PythonExperience working on various NLP projectsStrong team player and capable of working on a variety of projectsStrong problem solving skillsFluent in English and advanced knowledge of at least one other languagePerksStock options401k, great medical/dental plansUnlimited PTOGreat co-workers, monthly happy-hoursLocated in hotbed of tech startups, just blocks from the beach!"}