{"jobID": "2653138005", "jobLocation": "Jersey_City_NJ", "jobTitle": "Data Analyst Account Manager", "companyRating": "2.9", "companyInfo": {"Website": "www.computershare.com", "Headquarters": "Abbotsford, Australia", "Size": "10000+ employees", "Founded": " 1978", "Type": " Company - Public (CPU) ", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": "Computershare is a global market leader in transfer agency and share registration, employee equity plans, mortgage servicing, proxy solicitation and stakeholder communications. We also specialize in corporate trust, bankruptcy, class action and utility administration, and a range of other diversified financial and governance services.Founded in 1978, Computershare is renowned for our expertise in high integrity data management, high volume transaction processing and reconciliations, payments and stakeholder engagement. Many of the world’s leading organizations partner with us to streamline and maximize the value of relationships with their investors, employees, creditors and customers.Computershare is represented in all major global financial markets and has over 16,000 employees worldwide who are key to delivering exceptional value and outcomes. Our career opportunities span many business units, including Computershare Loan Services and Kurtzman Carson Consultants – join our growing team of financial services professionals!The Account Manager is part of an active team setting with focus on researching Asian Corporate issuer’s global shareholder base.The final product is prepared for a corporate issuer’s use to apply to its global strategy for the purpose of marketing directly to the shareholder. Additionally, the data/analysis is used to ensure that client complies with the appropriate laws they are obliged to adhere to.Identify any company’s institutional shareholders through extensive research and analysis of available private and public data.(25>)Be able to supplement, as needed, our network of contacts within the bank/broker and investment management community in addition to various client relationships.(10>)Analyze shareholder-related data for accuracy and how it relates to the company’s shareholder base.(25>)Be able to work effectively and efficiently on various projects.Stay informed of what is happening in the industry by reading industry journals, and various other publications. (10>)Be able to communicate thoughts and/or concerns of Fund Managers and Analysts to clients. (10>)Utilize research tools such as Bloomberg, Internet and additional databases Be able to work independently on projects while sharing new information with the team (10>) Be able to respond to client queries.(10>)The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.Qualifications:To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Required:· Enhanced MS Office knowledge, in particular MS Excel and Access.· Detail Oriented· Good with numbers and problem solving· Excellent written communication skills.Preferred:1-2 years’ experience in investor relations, public relations, finance background.  Ability to be proactive, autonomous and use interactive technology. Computershare is an Equal Opportunity Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity or expression, national or ethnic origin, age, disability, protected veteran status, or other characteristics protected by applicable law.This job specification should not be construed to imply that these requirements are the exclusive standards of the position. Incumbents will follow any other instructions and perform any other related duties as may be required by business needs and communicated by their supervisor."}