{"jobID": "2788890233", "jobLocation": "Santa_Clara_CA", "jobTitle": "Iron Worker/Welder", "companyRating": null, "companyInfo": {"Website": "www.cagreatamerica.com", "Headquarters": "Santa Clara, CA", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Subsidiary or Business Segment", "Industry": " Arts, Entertainment & Recreation", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Overview Under occasional supervision, inspects, maintains and repairs ride machinery and track structures, ensuring efficient and safe operations at all times. Maintains and repairs Park equipment and vehicles. Fabricates, welds, installs, and repairs components as necessary. Performs related duties as required. Reports to the Ride Mechanic Foreperson.QualificationsAbility to pass a mandatory (or random) drug test, per Company policy, unless prohibited by state or provincial law.Ability to pass a background check, if 18 years of age or older, which may include, but is not limited to, credit, criminal, DMV, previous employment, education and personal references, per Company policy, unless prohibited by federal, state, or provincial law.Ability to work nights, weekends and holiday periods to meet business needs.Driver's LicenseResponsibilitiesProvides ground support for welders and crane operators.Operates vehicles, overhead crane, fork lift, man lift, welding equipment, metal working equipment, and other shop equipment.Refers to policy and procedure manuals, maintenance manuals, technical manuals and diagrams, blueprints, etc.Prepares and/or processes sketches and drawings.Maintains assigned vehicle, tools and equipment.Assists co‑workers and other departments in the repair of ride / attraction / facility mechanical systems and equipment. Offers training of other employees as necessary.Fabricates parts as needed to maintain, modify and improve machine efficiency and operation.Designs and produces specialized tooling for all Park departments; produces computer‑aided and hand drawings of parts, prototypes and tooling.Designs, welds, fabricates and installs new structure / equipment components and parts for mechanical, hydraulic and pneumatic systems.Maintains and repairs ride machinery, track structures, and other metal features of the Park, including sign posts, fences and railings, coaster trains, production equipment, etc.Assists with the analysis of part / equipment failures. Helps determine proper repair methods.Inspects rides, tracks, ride foundations, and other steel structures for safety and maintenance needs.Provides guest service according to Cedar Fair standards when serving the guest or working with subordinates, including initiating guest interactions, answering questions and giving directions.Maintains cleanliness and safety in assigned work area and performs all duties in compliance with Cedar Fair Safety guidelines and requirements and reports all unsafe or unusual conditions to supervision.Meets scheduling availability requirements, including nights, weekends, and holiday periods to meet business needs.Meets Cedar Fair's attendance requirements as outlined in Cedar Fair's attendance policies.Adheres to Cedar Fair's Rules of Conduct including specific costuming and grooming standards as outlined in Employee Guidelines and other park/division specific policies and procedures.Other duties may be assigned."}