{"jobID": "2563209459", "jobLocation": "New_York_NY", "jobTitle": "Intern - Intellectual Property - Campus", "companyRating": null, "companyInfo": {"Website": "www.navigant.com", "Headquarters": "Chicago, IL", "Size": "5001 to 10000 employees", "Founded": " 1996", "Type": " Company - Public (NCI) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About Navigant Navigant Consulting, Inc. (NYSE: NCI) is a specialized, global professional services firm that helps clients take control of their future. Navigant’s professionals apply deep industry knowledge, substantive technical expertise, and an enterprising approach to help clients build, manage and/or protect their business interests. With a focus on markets and clients facing transformational change and significant regulatory or legal pressures, the Firm primarily serves clients in the healthcare, energy and financial services industries. Across a range of advisory, consulting, outsourcing, and technology/analytics services, Navigant’s practitioners bring sharp insight that pinpoints opportunities and delivers powerful results. More information about Navigant can be found at navigant.com. Practice Information Navigant’s D&I; practice focuses on assisting corporations and their counsel in addressing the issues associated with complex disputes, forensic accounting issues, global investigations and compliance, and technology services. Our disputes professionals provide expert testimony and privileged consulting on damage quantum, liability and valuation issues on complex commercial disputes. Our forensic accounting specialists deliver privileged and independent consulting on complex accounting and financial reporting issues which may result in expert testimony and reporting to management, boards and regulators on accounting disputes, auditor malpractice, individual white collar defense and GAAP/GAAS investigations. In global investigations, we combine deep investigative law enforcement, industry and accounting skills on anti-money laundering, bribery & corruption, public sector & monitoring, healthcare and government contracting compliance & investigative matters. We deliver technology services to assist in the litigation and investigation process and in solving business problems practice areas, including discovery services, compliance technology and complex data management.  . ResponsibilitiesPosition Summary Our Summer Associate program has been created to give students an opportunity to learn what life as a consultant is like at Navigant. As a Summer Associate, you will work on a variety of projects with different engagement teams. We will try to give you exposure to the breadth of our services and clients. You will work closely with our professionals – Consultants through Managing Director – and gain first-hand experience in consulting. Essential Duties and Responsibilities for Summer Associates at Navigant Summer Associates work on project teams and perform a variety of tasks that include performing in-depth research through review of forensically obtained emails and documents, investment analyst reports, and SEC filings; performing financial, accounting, economic, and statistical analyses; and preparing work product that includes expert reports, trial exhibits, financial models, and client briefing presentations. Qualifications We seek undergraduate students who are completing the third year of their undergraduate studies and are majoring in Finance, Accounting, Economics, Engineering or Computer Science. They should exhibit a solid academic performance in their course of study with a 3.2 GPA or better; a working knowledge of Word, Excel, PowerPoint, and Access programs; and strong research and analytical skills. Students should also demonstrate strong oral and written communication skills. Additional qualifications include initiative, adaptability, creative problem solving skills, and an ability to work well with teams. Must demonstrate willingness to travel and work overtime when needed. Students possessing F-1 or J-1 visas are excluded from interview schedules or being hired for this position.  Navigant is an Equal Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, national origin, ancestry, citizenship status, protected veteran status, religion, creed, physical or mental disability, medical condition, marital status, sex, sexual orientation, gender identity or expression, age, or any other basis protected by law, ordinance, or regulations. Mental/Physical RequirementsStrong conceptual, as well as quantitative and qualitative analytical skillsWork as a member of a team as well as be a self-motivator with ability to work independentlyConstantly operates a computer and other office equipment to coordinate workFrequently travels by airplane, train or car as necessary to perform work at another locationRegularly uses close visual acuity and operates computer equipment to prepare and analyze and transmit dataGenerally works in an office environmentEEO/C&B; StatementThe company offers competitive compensation packages including an incentive compensation plan, comprehensive medical/dental/life insurance, 401(k) and employee stock purchase plans.Navigant does not accept unsolicited resumes through or from search firms or staffing agencies. All unsolicited resumes will be considered the property of Navigant and Navigant will not be obligated to pay a placement fee.Navigant is an Equal Employment Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, national origin, ancestry, citizenship status, military status, protected veteran status, religion, creed, physical or mental disability, medical condition, marital status, sex, sexual orientation, gender, gender identity or expression, age, genetic information, or any other basis protected by law, ordinance, or regulation.Navigant will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of applicable law or ordinance including the Fair Chance Ordinance of Los Angeles and San Francisco."}