{"jobID": "2811138134", "jobLocation": "New_York_NY", "jobTitle": "Data Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.invesco.com", "Headquarters": "Atlanta, GA", "Size": "5001 to 10000 employees", "Founded": " 1935", "Type": " Company - Public (IVZ) ", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Vanguard, BlackRock, Fidelity Investments"}, "estimatedSalary": "104000", "jobDescription": " We’re a leading independent investment management firm seeking a globally minded Lead Data Scientist to spearhead development and innovation with our Disruptive Technologies team. As a financial services company, data is our lifeblood. Seriously, we deal in numbers and data all day, every day, but in this position, you’ll be responsible for trying to combine financial data with AI models and emerging tech to create something new and exciting in the world of FinTech. You’ll also have incredible opportunities for experimentation. Everything we do, we do to deliver a superior investment experience, and excellence is par. Our Technology team operates under a OneTech mindset, so we are a highly collaborative crew. In this position you’ll be expected to translate your ideas to your team and motivate them to execute, and to execute at the pace of technology —FAST. This position will be well-suited for someone who is a dreamer and executer who values speed and innovation. Do you love your work in data? Good, because this position will be demanding and will challenge you in the best ways possible, and we expect that if you truly love what you do, this position will enable you to do amazing things. Key Responsibilities / Duties: You like Big Data, and you cannot lie; This is essential because you will be responsible for designing, developing, and implementing Big Data platforms using Cloud architecture with structured and unstructured data sources  You will be our proverbial data Zen garden — you’ll be responsible for bringing clarity to the chaos  You can bring the complex algorithms your dreams are made of and make them a reality, and you can easily analyze and translate the complex models and algorithms of others’ dreams  Perform machine learning and statistical analysis methods, such as classification, collaborative filtering, association rules, sentiment analysis, topic modeling, time-series analysis, regression, statistical inference, and validation methods  Analyze and model structured data using advanced statistical methods and implement algorithms and software needed to perform analyses  Build recommendation engines, sentiment analyzers and classifiers for unstructured and semi-structured data  Perform explanatory data analysis, generate and test working hypotheses, prepare and analyze historical data to identify patterns  Design rich data visualizations to communicate complex ideas to customers or company leaders  Utilize state-of-the-art methods for data mining  Extend IVZ data with third party sources of information, as required  Process, cleanse, and verify the integrity of data used for analysis  Perform ad-hoc analysis and present results in a clear manner QualificationsWork Experience / Knowledge: 10 to 15 years professional experience  7+ years of experience with top-tier firms in big data analytics, management consulting, or comparable role in corporate setting  4+ years of experience with machine learning  5+ years of experience with SQL  4+ years in financial services preferred  Excellent understanding of machine learning techniques and algorithms, such as k-NN, Naive Bayes, SVM, Decision Forests, etc  Good applied statistics skills, such as distributions, statistical testing, regression, etc  Extensive predictive analytics experience with Python  In-depth knowledge of statistical software packages (e.g. SAS and R)  Experience with data visualization tools preferred  Experience with big data technologies such as Hadoop, R, and Java / MapReduce a plus  Experience with NoSQL databases, such as MongoDB, Cassandra, HBase, DynamoDB a plus  Experience with data and machine learning services using Azure, Amazon Web Services (AWS), and / or Google Cloud a plus  Familiar with Agile software development (Scrum is a plus)  DevOps knowledge is a plus Skills / Other Personal Attributes Required: Comfortable working with ambiguity (e.g. imperfect data, loosely defined concepts, ideas, or goals) and translating these into more tangible outputs  Strong analytical and critical thinking skills  Self-motivated  Capable of working with little or no supervision  Strong written and verbal communication skills  Enjoy challenging and thought provoking work and have a strong desire to learn and progress  Ability to manage multiple tasks and requests  Must demonstrate a positive, team-focused attitude  Ability to react positively under pressure to meet tight deadlines  Good inter-personal skills combined with willingness to listen  Structured, disciplined approach to work, with attention to detail  Flexible – able to meet changing requirements and priorities  Maintenance of up-to-date knowledge in the appropriate technical areas  Able to work in a global, multicultural environment  Formal Education: (minimum requirement to perform job duties)  PHD of Statistics, Computer Science or other similar advanced degrees from a top tier educational institution preferred Working Conditions: Normal office environment with little exposure to noise, dust and temperatures  The ability to lift, carry or otherwise move objects of up to 10 pounds is also necessary  Normally works a regular schedule of hours, however hours may vary depending upon the project or assignment  Hours may include evenings and/or weekends and may include 24 hour a day on call support by pager and/or cell phone  Able and willing to travel both domestically and internationally  Frequency and duration to be determined by manager  Estimate: 10-15%"}