{"jobID": "2702232344", "jobLocation": "Boston_MA", "jobTitle": "Data Scientist and Cognitive Software Engineer II", "companyRating": "3.1", "companyInfo": {"Website": "www.statestreet.com", "Headquarters": "Boston, MA", "Size": "10000+ employees", "Founded": " 1792", "Type": " Company - Public (STT) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " J.P. Morgan, BNY Mellon, Northern Trust"}, "estimatedSalary": "92000", "jobDescription": " In your role as Data Scientist and Cognitive Engineer will work with other Cognitive agile team members through the phases of use-case data exploration and prototyping to the design, implementation and deployment of the resulting Cognitive services supporting the use-case.  Responsibilities: Work with a team of data scientists, machine learning engineers, software engineers and QA engineers.Perform data collection, preprocessing, feature engineering, data visualization and analysis.Build automation of data collection and preprocessing.Build models to address business problems.Engage with lines of business, users and analysts to explore and prototype opportunities and use-cases exploiting data and the application of cognitive and machine learning technologies.Design, develop, test and support Cognitive microservices to operationalize and productize deployment of resulting models and cognitive solutions.  Highly preferred skills and experience:Modern, object-oriented or functional programming experience, (Java, C++, Python, Scala, SQL, R)Data Science and Machine Learning Frameworks (“R”, Apache Spark / MLlib, TensorFlow, Scikit-learn, etc…)Natural Language Processing (NLTK, CoreNLP, Gensim, Spacy, etc..)Experience with Big-Data technologies and cloud (AWS, other)Linux / Bash scriptingRelational databases (Oracle, PostgreSQL, MySQL, etc.)Agile development methodologyCI/CD Development environments and tools (GIT, Maven, Jenkins, etc)RESTful Microservice APIsStrong analytical skills. Previous experience or education focused on statistics or data science is valuable.  Qualifications:Bachelors degree in Computer Science or related degree.2 - 4 years related work experience.Experience in working on an Open Source project a plus but not required.Good English language skillsAppreciate the value of diversity (in all its forms) brings to our team and company  State Street appreciates the value diversity (in all its forms) brings to our firm.  SSTGTS18"}