{"jobID": "2701067150", "jobLocation": "New_York_NY", "jobTitle": "Digital Media Strategist", "companyRating": "3.4", "companyInfo": {"Website": "www.icedmedia.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "56000", "jobDescription": "Introduction:At iced media, we are ALL digitally social and we love it. We seek a full time Paid Social Media Strategist who is highly in tune with the digital world and can leverage data and insights to plan, execute, and report on successful paid digital media programs and campaigns.Our Paid Social Media Strategist will be versed in all aspects of platform targeting capabilities, product releases, and positioning in the marketplace. This person will work with our internal teams & clients to create and meet objectives and the role requires multitasking and includes working directly with and supporting the Director of Digital Strategy & Media.At iced media we seek kind, caring, responsible team members who like to go home each day proud of their work. This is an opportunity for someone who wants to learn so much more, is data driven and detailed orientated.Key Points:We seek a person will plan, buy, and optimize social media ads, mainly Facebook Business Manager, keeping in accordance platform best practices and the algorithms behavior, applying real time recommendations by analyzing data sets.We seek a person who can manipulate Excel data and shape stories from the results, translating complex data points into narratives clients can understand.We seek a person who easily collaborates with strategy and creative teams to outline overall media delivery strategy. The ideal candidate will use critical thinking to develop media plans that ensure appropriate audiences are reached effectively.Specific Roles and Responsibilities: Media Planning – Drafting media plans that include campaign projections, budget allocations, objectives, ad format recommendations, and KPIs.Media Buying & Optimizing – Loading creative assets into Facebook Business Manager and formatting copy & creative with correct targets & media spends. Monitoring campaigns to ensure media is spending effectively and analyzing media performance to boost campaigns and deliver on client expectations.Reporting – Collecting data from completed campaigns and organizing into templates that can be easily translated by team members and clients alike. Giving overviews of strategic assessment of performance to help shape the data story for reporting.Requirements:2-4 years of paid digital media experienceStrong background in social media planning and buying, namely in Facebook Business manager. Comfortable creating media plans to achieve client goalsOrganized and data driven, self-starter who is capable of managing multiple tasks at once with careful attention to detailMust be flexible to occasionally work non-standard hours (monitoring campaigns that fall outside of 9-5 i.e. weekends/evenings )In-depth understanding of social media and digital marketing landscape, familiarity with best practices for SEO/SEM, as well as knowledge of social advertising beyond Facebook/Instagram (Youtube, Pinterest, Snapchat, Twitter etc.)Experience managing multiple campaigns at once, with overall monthly budgets of more than $50KStrong entrepreneurial mindset—a creative thinker and assertive problem solver with an analytical mindProfessional and enthusiastic collaborator with both team and clients, with the ability to work autonomously and in a team environmentExperience in luxury, beauty retail, or consumer packaged goods preferred, but not requiredWillingness and ability to learn and do whatever is needed to see a project through to completionOur East Coast headquarters are based in the heart of SoHo - the chicest neighborhood in Manhattan, the perfect hub for our digital world. We are a close knit, small team with weekly happy hours and free snacks and so many beverage options!Include a link to your LinkedIn and/or portfolio (if you have one) with your application to be considered.iced media is an equal opportunity employer (EOE). We strongly support diversity in the workforce.Job Type: Full-timeExperience:paid social: 2 years (Preferred)digital media: 2 years (Required)"}