{"jobID": "2826841801", "jobLocation": "San_Francisco_CA", "jobTitle": "Salesforce Administrator - Wave Analytics", "companyRating": null, "companyInfo": {"Website": "www.financialforce.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "SALESFORCE ADMINISTRATOR - WAVE ANALYTICSPortland, OR ABOUT FINANCIALFORCE FinancialForce is the leading cloud ERP for the new services economy. The #1 ERP native to the Salesforce platform, FinancialForce unifies data across the enterprise in real-time, enabling companies to rapidly evolve their business models with customers at the center. Founded in 2009 and headquartered in San Francisco, FinancialForce is backed by Salesforce Ventures, Technology Crossover Ventures, Advent International, and UNIT4. For more information, visit www.financialforce.com.  THE ROLE We are currently recruiting an experienced, highly motivated and enthusiastic Salesforce Administrator with hands on Wave Analytics Experience. This individual will be working in FinancialForce’s internal Salesforce org, which includes platform, internal and 3rd party managed packages. Experience around security, governance as well as Sales and Marketing clouds highly desired.  RESPONSIBILITIESGenerate reports and dashboards via Wave AnalyticsMaintain, Create and Improve Analytics Dataflows and DatasetsSupporting the internal FinancialForce Salesforce.com (SFDC) OrgProvide routine support and user maintenance for SFDC – new starters, position changes, profile changes, leavers, user lockouts and password resetsInstall and configure Salesforce packagesDesign, configure and administer SFDC including, but not limited to, Apex code and supporting test classes, Custom Objects, Workflow Rules, Custom Fields, Validation Rules and VisualForce PagesMaintain a holistic view of all business processes and users in the system to understand cross-functional impacts with regard to configuration, process, workflow and reportingAssist with the internal implementation of FinancialForce applicationsSupport the integration of third-party Force.com applications with the internal OrgWork with Salesforce.com to understand their platform roadmap and how to apply enhancements to internal business challengesContribute knowledge and expertise around security models and org governanceInitiate, plan and execute projectsExecute other assigned tasks as delegatedProvide general user training on using SalesforceMaintain excellent communication with all end usersPromote service excellenceBASIC QUALIFICATIONS4+ years’ experience as a Salesforce Administrator or Developer including technical implementation, day-to-day operation, long-term projects and org maintenanceSalesforce.com Admin CertificationsExperience with unit testing, deploying change sets from Salesforce sandbox environments, and familiar with common software development practices and methodologiesBachelor’s degree or related experience  PREFERRED QUALIFICATIONSAbility to recognize, analyze and effectively solve problems in a timely and organized manner using industry best practices and proceduresAbility to multi-task in a fast-paced environmentExperience with Sales and Marketing Clouds a huge plusExperience configuring and maintaining a proper security model (permissions, sharing) As an equal opportunity employer, FinancialForce does not discriminate against any applicant or employee based on race, color, sex, sexual orientation, gender identity, marital status, religion, national origin, ancestry, age, disability, military or veteran status, genetic information or any other basis protected by applicable federal, state, or local laws. If, and as required by the San Francisco Fair Chance Ordinance or any other applicable federal, state, or local law, FinancialForce considers qualified applicants with arrest and conviction records for employment. FinancialForce also has an accommodation process to reasonably accommodate applicants and employees with disabilities. For more information or if you have a need, contact EmployeeSuccess@FinancialForce.com  #LI-AP1"}