{"jobID": "2724519200", "jobLocation": "New_York_NY", "jobTitle": "Pharmaceutical Sales - Biologics (Dupixent)", "companyRating": null, "companyInfo": {"Website": "www.sanofi.com", "Headquarters": "Paris, France", "Size": "10000+ employees", "Founded": " 1973", "Type": " Company - Public (SNY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Pfizer, GlaxoSmithKline"}, "estimatedSalary": null, "jobDescription": " Description Sanofi Genzyme focuses on developing specialty treatments for debilitating diseases that are often difficult to diagnose and treat, providing hope to patients and their families. Sanofi Genzyme has pioneered the development and delivery of transformative therapies for patients affected by rare and debilitating diseases for over 30 years. We accomplish our goals through world-class research, collaboration with the global patient community, and with the compassion and commitment of our employees. With a focus on rare diseases, oncology, immunology and multiple sclerosis, we are dedicated to making a positive impact on the lives of the patients and families we serve. Sanofi Genzyme's portfolio of transformative therapies, which are marketed in countries around the world, represent groundbreaking and life-saving advances in medicine. At Sanofi Genzyme, we are committed to the growth of our people, connected in purpose by career, life and health. Dupixent Area Business Manager The Area Business Manager (ABM) is responsible for engaging Allergists and Pulmonologists and other key customers within an assigned geography and presenting clinically focused selling message to create and grow revenue and to consistently deliver product goals. The ABM will demonstrate initiative, drive, and independence, and take ownership for meeting and exceeding individual business goals. This will be accomplished by driving performance and delivering results in a compliant manner with a high degree of integrity strictly following all Sanofi Genzyme US policies and in compliance with all policies and procedures governing the promotion of pharmaceutical/biological products in the US. Engage Allergy/Immunology/Pulmonology customers within assigned geographical territory and deliver clinically focused message to introduce, launch, grow brand-share and revenue and to consistently deliver on product goals. Collaborate and Coordinate with other key field-based stakeholders such as Regeneron Sales Professional counterpart, Medical Science Liaisons, Field Access Specialists, Market Access teammates, Thought Leader Liaisons, and others in their territory to proactively address customer needs, identify market dynamics and trends, develop strategies which support brand and corporate objectives, and ensure optimal account success within their assigned geography. Develop strong working relationships with asthma experts and all additional Allergy/Immunology/Pulmonology specialists in assigned geography as well as biologic coordinators, office staff and other important health care personnel and key patient advocacy support groups as directed. Drive results by identifying key opportunities and developing strategic business plans to generate product utilization and grow territory business. Plan, organize, and execute local promotional speaker programs and activities. Maximize budget allocated to the geographic territory to support execution of strategies and tactics and generate/ grow the business. Participate and help lead initiatives to support sales success as assigned (e.g. participate in industry related congresses, local and regional meetings and medical conferences). Own business opportunities within respective geographic area, which includes coordination and calling upon large group practices and other key targets to drive overall product results. Establish relationship with thought leaders in assigned territory. Primary objective is to drive industry leading customer value. Basic Qualifications Bachelors degree from an accredited four-year college or university. 3+ years of pharmaceutical, biotech or medical device sales experience. 2 years calling on allergists or pulmonologists OR 2 years experience selling sub-cutaneous self-injectable (or office administered IV) biologics. Demonstrated ability to learn and apply technical and scientific product-related information. Ability to travel to meetings/trainings/programs as necessary - additional travel may be required within the assigned territory. Proven success and positive track record of consistent sales performance in complex markets with diverse customer segments operating with a high degree of integrity within compliance guidelines. Ability to operate as a team player in cooperation with collaboration partners and internal colleagues to reach common goals. Valid Drivers License. Preferred Qualifications 2+ years selling sub-cutaneous self-injectable (or office administered IV) biologics. 2+ years selling experience in Asthma or other Immunology disorders such as Psoriasis, Multiple Sclerosis, Crohns Disease or Ulcerative Colitis strongly preferred. 2+ years selling experience calling on Allergists and/or Pulmonologists. Co-promotion experience preferred. Demonstrate advanced clinically-based selling skills. Results oriented with a proven track record of success with product launches. Experience with in-servicing and training office staff, nurses and office managers. Demonstrate a passion and learning aptitude for science and is proactive in strengthening knowledge related to disease-state, treatment options and healthcare trends. Highly organized with strong account management skills. Sanofi, a global healthcare leader, discovers, develops and distributes therapeutic solutions focused on patients' needs. Sanofi is organized into five global business units: Diabetes and Cardiovascular, General Medicines and Emerging Markets, Sanofi Genzyme, Sanofi Pasteur and Consumer Healthcare. Genzyme Corporation (a Sanofi company) and its U.S. affiliates are Equal Opportunity and Affirmative Action employers committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race; color; creed; religion; national origin; age; ancestry; nationality; marital, domestic partnership or civil union status; sex, gender, gender identity or expression; affectional or sexual orientation; disability; veteran or military status or liability for military status; domestic violence victim status; atypical cellular or blood trait; genetic information (including the refusal to submit to genetic testing) or any other characteristic protected by law. #LI-GZ #GD-GZ Sanofi is dedicated to supporting people through their health challenges. We are a global biopharmaceutical company focused on human health. We prevent illness with vaccines, provide innovative treatments to fight pain and ease suffering. We stand by the few who suffer from rare diseases and the millions with long-term chronic conditions. With more than 100,000 people in 100 countries, Sanofi is transforming scientific innovation into healthcare solutions around the globe. Sanofi, Empowering Life"}