{"jobID": "2763983756", "jobLocation": "South_Hackensack_NJ", "jobTitle": "Sales Project Manager", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Seeking an experienced and professional Sales Project Managerto join our Glass Division team based in South Hackensack, NJ. The Sales Project Manager must have a thorough knowledge and background in the Architecture & Design community or commercial construction industry. He/she will be responsible for expanding and promoting the Glass Division products and services to the A&D; Community, Specifiers, and Construction Management firms. Guide the Architectural spec prior to issuance of final CDs. The successful candidate will be proactive in demonstrating initiative, excellent client relationship building, deadline driven, and solutions oriented. Primary roles and responsibilities include, but are not limited to: Primary Roles:Positively represent the Glass Division heightening product awareness and expanding reachProvide sales and project management support working together as an integral part of the Glass Division teamIdentify and cultivate potential clients and generate quality leadsManage and nurture leads, and convert to opportunities and ultimately salesPrimary Responsibilities:Drive and grow new business revenue with new and existing accountsProactively engage the A&D; community, general contactors, and clients for potential leadsConduct product presentations to the A&D; communities, specifiers, and CM groups in an effort to guide the specPartner with the internal sales team including mining the Salesforece database for new leads and opportunitiesTrack RFP’s, proposal due dates, follow-ups, final awardConduct face-to-face meetings with perspective leads 2x a week on averageCultivate and nurture all leads culminating from, but not limited to, existing industry contacts, internal sales team, company website, and incoming calls and emailsEnter new opportunities in Salesforce and review bi-weeklyPartner with the marketing team in the development of sales and marketing materialMaintain print and electronic product marketing material and samples for presentationDevelop key metrics, and track and report leads, opportunities, and job status on a monthly basisAnalyze market potential and competitive marketplace providing strategic guidance and recommendations on an ongoing basisAttend internal sales and project management meetings as well as required meetings with external customers as necessaryMust have a valid U.S. driver’s license with a clean recordExperience / Skills:Minimum of 10 years in sales and project management within the A&D; or commercial construction industryKnowledge of glass wall systems and space management solutionsProficiency in reading and understanding contract documents (blueprints, specifications, etc.)Strong client relations, interpersonal, and communications skillsStrong organizational skills and acute attention to details with the ability to manage multiple projectsAbility to work well within a teamStrong work ethic with a sense of urgencyProficiency in desktop and iPad applications (Salesforce, Microsoft Office, and Dropbox)What we offer:Medical, dental, and vision401K PlanPaid sick days, vacation, and holidaysApplicants without cover letters or resumes will not be considered."}