{"jobID": "2424705264", "jobLocation": "Seattle_WA", "jobTitle": "Senior Data Scientist", "companyRating": "4.4", "companyInfo": {"Website": "www.rover.com", "Headquarters": "Seattle, WA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Consumer Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "123000", "jobDescription": "Who we are:Rover.com connects pet parents with the nations largest network of pet sitters and dog walkers. On Rover, pet parents can easily discover, book, and manage personalized care for their dogs including pet sitting, dog walking, and doggy day care. Founded in 2011 on the belief that everyone should have the opportunity to experience the unconditional love of a dog, Rover improves and simplifies life for pet parents and the dogs they love.We're headquartered in downtown Seattle. We're an agile, fast-growing startup, and our leadership comes from some of the country's most respected tech companies. Our Senior Leadership team has been recognized by Forbes, Seattle Business, and Geekwire. We've been named among Seattle's \"Best Places to Work\" in Seattle Met magazine, Seattle Business Magazine, and the Puget Sound Business Journal in 2016 and 2017. We're also the recipient of Worlds Most Dog-Friendly Offices in 2016 by Inc.com. Needless to say (but we're going to say it anyway)we love dogs, and we wouldn't dream of going to work without them by our sides.Who we're looking for:The Senior Data Scientist at Rover will possess broad enough experience to contribute to each of the three classes of problem outlined above, while also being deep enough to lead at least one of them end-to-end. In every case, and regardless of the specific techniques employed, the Senior Data Scientist will be responsible for managing long-running experiments with significant impact on how users interact with Rover.com, participate in our marketplace, and find care for their dogs. This is a non-trivial responsibility: on the one hand, there is tremendous value to be driven in continuing to optimize the Rover marketplace, while on the other hand the opportunity cost associated with long-running experiments (in time and dollars) is very high.For this reason, real-world experience in this class of problem is a requirement, and experience working in an online marketplace specifically is strongly preferred.What does Data Science mean at Rover?There are three broad classes of core Data Science problems with which we are engaged at Rover:1. Multivariate modeling: the creation of models that lead to better search outcomes, providing better matches between dog sitters and owners. Here, success is measured in terms of impact on marketplace efficiency2. Machine learning: the ongoing development of the machine learning infrastructure that enables continuous learning from our data, where success is also measured in terms of marketplace efficiency gains as well as the rate at which different aspects of the user experience are incorporated into our ML systems3. Scaling user testing: the parallelization and democratization of end-user testing across all aspects of the product and user experience, where success is measured in terms of testing velocity across the organization Your Toolset Includes: SQLPythonProbably at least one additional programming language / computational programming environment; e.g., R, Matlab, C++, etcGoogle Analytics or similar user funnel analytics toolsTableau, Looker, or similar data visualization toolsData-informed decision making with rigorous split testing.Integrated teams with developers, designers and analysts working side-by-side.Your Qualifications:B.S in a quantitative discipline required; advanced degree (MS or PhD) preferredStrong technical and coding skillsDeep expertise in one or more core data science disciplines (e.g, supervised learning, machine learning, etc)Marketplace experience strongly preferredExperience in online user testing strongly preferredWhy Well Hire You:You are familiar with more than just the basics, and have more than cursory experience with at least sub-discipline in the broad field of data science. In other words, you know where the sharp edges are, and can lead decisions around what techniques are and are not appropriate to employ for particular classes of problemYoure a deeply analytical thinker who is passionate about finding structure in data, and using data to drive real value to the end user (and thus the business).You are passionate about our core business. You will instinctively dig into every aspect of what it means to be a dog sitter and a dog owner on the Rover platform.You can take abstractly defined problems and work with (imperfect) data to drive decisionsYou are a great partner to engineers and business owners alikeYou can pitch your own ideas and shepherd them through to completionYou show pattern of being self-started, self-taught and self-directedYou favor open communication with willingness to ask and answer questionsYou are output- and outcome-orientedYou have excellent written and verbal communication skillsYou play nicely with others (and dogs)Benefits of Working at Rover.com: Competitive compensation401kStock options4 weeks paid time offCompetitive benefits package, including medical, dental, and vision insuranceCommuter benefitsBring your dog to work (and unlimited puppy time)Doggy benefits, including $1000 toward adopting your first dogStocked fridges, coffee, soda, and lots of treats (for humans and dogs)Free catered lunches semi-monthlyRegular team activities, including happy hours, snow tubing, game nights, and more50 free dog walks a yearRover embraces diversity and opposes discrimination.This position is based at Rover HQ in Downtown Seattle.Candidates must be eligible to work in the US."}