{"jobID": "2808511365", "jobLocation": "San_Francisco_CA", "jobTitle": "Strategy & Business Operations Manager", "companyRating": "4.0", "companyInfo": {"Website": "www.fundingcircle.com", "Headquarters": "London, United Kingdom", "Size": "501 to 1000 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " LendingClub, OnDeck, Bond Street"}, "estimatedSalary": "125000", "jobDescription": " The Strategy and Business Operations team works across the business to define and deliver high value initiatives to drive business growth. We're looking for a smart and motivated candidate who will spearhead the development and delivery of new growth areas or efficiency initiatives, such as launching new products and analyzing potential M&A.; Birds-eye view of the role: Funding Circle is seeking a Strategy & Business Operations Manager to develop and drive the business strategy and to tackle complex business problems across the organization. This role will report to the Head of Strategy and Business Operations, U.S. and .will have the following responsibilities: Working with the senior management team to shape Funding Circles growth strategy and business operations.Spearhead the development of new growth areas or efficiency initiatives e.g., financial products for Funding Circle USAs small business borrowers, range of investors, and improve business processes. Activities include: conducting primary and secondary market research,evaluating pros and cons of new product development/efficiency opportunities and prioritizing opportunities by developing quantitative business cases/financial models,developing new market entry strategies and operational processes with senior management to deliver products to the market,Working with a broad range of stakeholders to ensure development of practical ideas and leading the implementation and delivery of these projectsProvide end-to-end project management to deliver successful projects including; planning- kicking off, collaboration with internal-external stakeholders and post-implementation supportAnalyzing potential acquisition and partnership opportunities including: a) conducting detailed strategic due diligence on opportunities, b) building financial models to evaluate the net benefit of opportunities to Funding Circle, and c) developing operational integration plans in partnership with senior management.Forming and maintaining relationships with participants in the industry (executive teams, investment bankers, consultants, others). Our ideal teammate has:3-5 years of experience in Strategy Consulting, Corporate Development, and/or Private Equity at a first class organization.Excellent analytical and problem solving skill set demonstrated through growth strategy development, new business line / market entry strategy development, and/or operational ownership and improvementAbility to draw strategic insights from analysis and communicate concisely and effectively with stakeholders across the businessAdaptability and willingness to roll sleeves up and get involved with all parts of the businessStrong communication and interpersonal skills - ability to work effectively and collaboratively with individuals from different parts of the organization with different background and perspectivesFamiliarity with marketplaces and/or small business lending is a plus but not requiredEnthusiasm for a high-paced, team-oriented start-up environmentSome travel may be requiredIdentification with our mission, to build a better financial world.Alignment with our core values: Think Smart, Make It Happen, Be Open, Stand Together, Live The Adventure.Why join Funding Circle?: Happy employees are productive employees, which is why we offer a hearty benefits package. From learning and development and commuter stipends, to a competitive salary, equity, and health benefits, weve got you covered! That being said, have you heard about what we're doing?! Our mission is what really motivates us to come to work each day: We're supporting small business, the engine of economic growthWe're helping facilitate higher yields for investors and lower interest rates for borrowersWe can fund loans extremely quickly, all online!We have a clear competitive advantage globally in areas like our marketplace model, domain expertise and regulatory processes To learn more about our work environment, culture, and perks, visit: www.fundingcircle.com/us/careers Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.  Funding Circle provides equal employment opportunity to all individuals regardless of their race, age, creed, color, religion, national origin or ancestry, sex, gender, disability, veteran status, genetic information, sexual orientation, gender identity or expression, pregnancy, or any other characteristic protected by state, federal or local law.  #LI-SC1"}