{"jobID": "2810085260", "jobLocation": "New_York_NY", "jobTitle": "Senior Data Scientist - Revenue Optimization", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " WeWork is the platform for creators, providing hundreds of thousands of members across the globe with space, community, and services that enable them to do what they love and craft their life's work. Our mission is to build a world where people work to make a life, not just a living, and our own team members are central to that goal. WeWork is crafting a layer of technology to power our vision of space as a service. From identifying and building a new location, to bringing that space to market in an elastic, easy-to-consume way, to seamlessly operating these spaces to delight our members, we are building state-of-the-art systems to automate, optimize, and improve the experience. The data we are collecting is being used to dynamically optimize utilization, pricing, even layout and form factor. This technology advantage has allowed WeWork to scale to 200+ buildings in 20+ counties and will be our competitive advantage as the company continues to grow. The mission of Revenue Optimization is focused on building the foundations for pricing/yield management and inventory optimizations through state-of-the-art analytics and predictive modeling. The group will act as an in-house consulting team analyzing data to define strategies and execute on initiatives that will maximize our revenue streams for WeWork. Are you someone with a strong creative streak? Do you enjoy fast paced exciting environments? Are you looking to contribute to making a real impact across many different communities and cultures around the world with the work that you're doing? If so, then we may have the opportunity for you. Responsibilities: Work with large, complex data sets to develop advanced analytical methods, mathematical modelling, and large-scale implementation strategies Experiment and develop machine learning algorithms for tasks including demand forecasting, elasticity calculations, and inventory optimization Take ownership of whole end-to-end predictive modelling projects - from data processing, training, optimization to real-time monitoring and maintenance Requirements Minimum 5 years of professional working experience designing and deploying machine learning models / applying and developing advanced analytics solutions. MS / PhD degree in a quantitative discipline e.g., computer science, mathematics, statistics, operations research, econometrics, artificial intelligence, etc. Applied experience of machine learning algorithms using Python We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}