{"jobID": "2805741309", "jobLocation": "Long_Beach_NY", "jobTitle": "Data Engineer", "companyRating": "3.3", "companyInfo": {"Website": "www.lancerinsurance.com", "Headquarters": "Long Beach, NY", "Size": "201 to 500 employees", "Founded": " 1985", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "102000", "jobDescription": "Lancer Insurance Company is looking for a Data Engineer to develop, maintain, test and evaluate data solutions in support of business goals. The person will also develop data models, corresponding data architecture documents and API’s. The right candidate should be an excellent communicator and strategic thinker.Duties and ResponsibilitiesCreate, design and maintain reusable datasets for analysis by data scientists.Assess new data sources to better understand availability and quality of data.Provide governance and best practices of data structures, data integrity, and querying.Interpret business needs from requests, and rapidly implement effective technical solutions.Design, implement and enhance ETL (extract, transform and load) processes.Write SQL queries to answer questions from stakeholders.Maintain source code repository of scripts (SQL, Python, R) and other data products (dashboards, reports, etc.).Work with technology teams (BA,QA, Dev and Admin) to understand data capture and testing needs.Automate and improve creation/maintenance of reports and dashboards.Skills & ExperienceBA/BS or Master's degree with emphasis on coursework of a quantitative nature (e.g., Statistics, Computer Science, Engineering, Mathematics, Data Sciences).Advanced SQL and relational databases including queries, database definition and schema design.Python or R experience required.Writing and maintaining ETL on a variety of structured and unstructured sources.Experience sourcing data via REST web services.Excellent written and verbal communication skills.Microsoft SQL Server, SQL Server Integration Services (SSIS), Business Intelligence Development Studio (BIDS), Excel (pivot tables).Insurance experience a plus."}