{"jobID": "2725082406", "jobLocation": "New_York_NY", "jobTitle": "Data Scientist, Product", "companyRating": "4.4", "companyInfo": {"Website": "www.betterment.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "144000", "jobDescription": " Data Science & Analytics is one of the fastest growing teams at Betterment. We operate with a 360-degree view of the company, partnering closely with teams such as Finance, Marketing, Product, and Operations, and always with our users in mind. Our projects range from creating beautiful dashboards to developing machine learning models. These projects add tremendous value to the business and we are looking for more thoughtful, driven, and curious people to push the business even further.About the right team member:At Betterment, there is nothing more important than building the best product we possibly can for our customers. Data plays a central role in how we decide what to build, how we design the customer experience, and how we monitor the performance and adoption of our products. We are looking for a talented data scientist to help lead these efforts. Betterment is in a growth stage and our product team’s analytics needs are fairly broad, so the work is bound to stay interesting. At any one time, projects may include working with engineering to improve our AB testing framework, research potential market fit for a new venture, study customer behavior, assess strategic initiatives and assist in fulfilling ad-hoc data requests from the product and design teams.At Betterment you will get to: Partner closely with cross-functional teams of product managers, engineers, designers, and user researchers.Influence the product roadmap and help monitor feature performance.Build and improve models of customer behavior, including lifetime value and churn.Support ad hoc analysis requests as needed, but over time translate them into tools and metrics.Conduct A/B testing to drive iterative improvement through efficient experimentationContribute to Betterment’s data-driven culture, and influence best practices.Be a member of the broader data science community in NYC, staying abreast of new ideas and trends, and contributing thought leadership. You will be effective if you have: 4+ years experience applying data science to product development or insights.Have deep familiarity working with and assessing the success of multiple concurrent AB tests.Experience using NLP to extract insight from raw text.Experience applying statistical (or machine learning) models to real-world challenges.Experience building and iterating on customer LTV models.Self-starter with a track record of seamless execution of complex projects with minimal guidance.The ability to write SQL in your sleep.Strong ability to code in Python or R.A willingness to be flexible, prioritizing problems that are most pressing and using tools that are most appropriate.Strong communication skills (both written and verbal) with a focus on efficiency and clarity.A desire to build strong relationships with colleagues and stakeholders and have the ability to explain complex topics in simple terms.Experience with data science libraries in these languages.An eye for beautiful and effective data visualizations, and experience creating them programmaticallyBonus points if you have:An advanced degree in a quantitative field; for example, mathematics, statistics, physics, cognitive science, etc.Experience working in a fast-moving, ever-changing environment.A positive attitude toward the prospect of mentoring more junior members of our Analytics organization. About BettermentBetterment is the largest independent online financial advisor with more than $13 billion in assets under management. The service is designed to help increase customers’ long-term returns and lower taxes for retirement planning, building wealth, and other financial goals. Betterment takes advanced investment strategies and uses technology to deliver them to more than 330,000 customers across its three business lines: direct-to-consumer, Betterment for Advisors, and Betterment for Business.Learn more.Come join us!"}