{"jobID": "2807992367", "jobLocation": "San_Jose_CA", "jobTitle": "Apartment Maintenance Technician II", "companyRating": "4.4", "companyInfo": {"Website": "www.elevatetosequoia.com", "Headquarters": "Walnut Creek, CA", "Size": "201 to 500 employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " Unknown / Non-Applicable", "Competitors": " Greystar, FPI Management"}, "estimatedSalary": "22", "jobDescription": " Service Technicians at Sequoia keep our residents happy.  To maintain is your middle name. You’ve repaired things – like basic electrical switches, appliances, a showerhead, and holes in drywall. You take pride in your work and want things spotless. Your hands will perfect someone’s home before move-in day.  You love people. Chatting with a neighbor makes your day and a smile on your face is never optional.  You are in it to win it.  We’re not just any property management company. Join us as we elevate the industry.  This position is for a new acquisition in the East Bay of San Francisco.  Must haves: Positive attitudeDesire to learnSpeedSense of humorOn call availabilityUnderstanding of basic areas of home maintenance Great to haves: Prior renovations or construction experience What we’ll do for you: Provide a great place to work – you’ll want to show up and give your best self everyday, we promiseAllow you to crush it – by providing you the best training programs in the industryMake sure you’re covered – superior health, dental, and vision insurance and a 401(k) program/match that keeps you on track for your futureGive you a break – paid time off for vacation, sick days, holidays, and your birthdayReward you – apartment rent discounts, fun days, generous monthly perks, cash bonuses, and recognition for a job well doneLet you give back – through our purpose program Sequoia Equities is an Equal Employment Opportunity employer and promotes a drug free workplace."}