{"jobID": "2723069480", "jobLocation": "Mountain_View_CA", "jobTitle": "Business Analyst Intern, Summer", "companyRating": "4.4", "companyInfo": {"Website": "www.google.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (GOOG) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Apple, Facebook"}, "estimatedSalary": "77000", "jobDescription": "Applications are now closed. Please check back next year for 2019 opportunities.You can see different angles of a product or business opportunity, and you know how to connect the dots and interact with people in various roles and functions. You have substantial experience with analytical tools and techniques, and bring a solid skill-set in analyzing data and communicating recommendations. You will deepen your skill-set by working with analytical thought leaders across the company.  Data Scientists are changing the world one technological achievement after another.  Experimentation is at the core of what you do. In this role, you will work to effectively turn business questions into data analysis, and provide meaningful recommendations on strategy. This is a unique role that will focus on your knowledge of data infrastructure and your ability to drive insights.  Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From AdWords to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another. Responsibilities Conduct data analysis to make business recommendations (cost-benefit, invest-divest, forecasting, impact analysis).Deliver effective presentations of findings and recommendations to multiple levels of stakeholders, creating visual displays of quantitative information.Develop and automate reports, iteratively build and prototype dashboards to provide insights at scale, solving for analytical needs.Collaborate with cross-functional stakeholders to understand their business needs, formulate and complete end-to-end analysis that includes data gathering, analysis, ongoing scaled deliverables and presentations.Help Google to focus on key decisions to improve products and services. Qualifications Minimum qualifications:"}