{"jobID": "2828301857", "jobLocation": "San_Jose_CA", "jobTitle": "Vice President of API's", "companyRating": null, "companyInfo": {"Website": "www.tomtom.com", "Headquarters": "Amsterdam, Netherlands", "Size": "1001 to 5000 employees", "Founded": " 1991", "Type": " Company - Public (TOM2) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Garmin, Nokia, Google"}, "estimatedSalary": null, "jobDescription": " Career Opportunity- Vice President of API’S- San Jose, CA Job Description: Are you passionate about APIs and creating a great developer experience, and building a community of highly engaged and enthusiastic TomTom Maps APIs developers? This is what we need at TomTom. We are continuing TomTom’s transformation into a modern set of capabilities and services for our clients and partners. We deliver a unique API technology platform to developer, enterprise companies and governments around the world that increases efficiency and saves vast amounts of time. In this rapidly growing business we are searching for a skilled Vice President to lead the deployment and adoption of our Maps APIs through growing and nurturing our robust developers' ecosystem. The VP of Maps APIs will create and evolve the Maps APIs organization including Developer Relations, Developer advocacy, API portal development and the inside sales team. The VP of Maps APIs will also define and own the strategy to grow our Maps APIs developer community and revenue. In this position, you will work very closely with different stakeholders to define and align the strategy around our API first approach when it comes to delivering our products, content, and data to our clients. You will also work hand in hand with the various Product Unit’s executives to ensure we deliver the right API product capabilities, features and benefits to our targeted markets and our growing client base. ResponsibilitiesBuild a strong team to advocate our Maps API’s • Provide guidance to peers and leaders (management and technical) across a vast organization to deliver on the Maps APIs strategy • Recruit and onboard talented sales people for the inside sales team • Create, prioritize, and execute on platform roadmap • Document and manage product requirements, stories and backlog • Manage user documentation (e.g. use cases, tutorials, videos, quick start guides) and tools to better highlight and promote the Maps APIs features towards developers. • Interact and collaborate with other internal departments to formulate recommendations and improvement actions • Build and track performance metrics and make enhancements to existing metrics and reports • Motivate the teams to generate a high volume of sales activities including outbound calls and webinars • Manage the performance to meet monthly, quarterly and annual goals and related KPI’s • Evangelize benefits and reasoning behind our API strategy • Evaluate and assess emerging technology capabilities to enable product strategy and vision  Qualifications8-10+ years of experience in leadership and executive positions • Experience building developer community and measuring success as it relates to broader company-level goals • Passion for Maps APIs, developer advocacy and creating a great developer experience; strong empathy for the developer audience • Ability to understand, evaluate and discuss technical integration scenarios and architectural concepts • Excellent leadership skills to mentor a sales team • Deep knowledge of developers as a market segment; familiarity with APIs/code a big bonus • Experience growing a technical audience through integrated marketing programs • Exceptional communication skills • Data-oriented, strategic, with demonstrated business acumen • Working with marketplaces is a plus • Experience presenting strategy and operational updates to senior executives • Excellent critical thinking, communication, presentation, documentation, troubleshooting, and collaborative problem-solving skills • Understanding of Mapping platforms is a plus • 30-40% travel required What do we offer? The chance to work in a fast moving, innovative and international environment where team work and creative ideas are nurtured • The opportunity to work with passionate colleagues from different countries Who are we? TomTom created the easy-to-use navigation device, one of the most influential inventions of all time. Since then, we have grown from a start-up, into a global technology company. • Our software and navigation technologies power over hundreds of millions of applications across the globe. This includes industry-leading location-based products and mapmaking technologies, embedded automotive navigation solutions; innovative portable navigation devices and apps, and advanced telematics fleet management and connected car services. • We continue to shape the future, leading the way with autonomous driving, smart mobility and smarter cities. • Headquartered in Amsterdam with offices in 37 countries, we offer advanced digital maps that cover 142 countries and 33 territories, and our hyper-detailed and real-time TomTom Traffic information service reaches more than five billion people in 69 countries. • To read our story, visit www.tomtom.com Apply to say hi!  We want to meet you! Apply to say hi.  We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, or disability status."}