{"jobID": "2542134441", "jobLocation": "San_Francisco_CA", "jobTitle": "Intern - Life Sciences - Campus", "companyRating": null, "companyInfo": {"Website": "www.navigant.com", "Headquarters": "Chicago, IL", "Size": "5001 to 10000 employees", "Founded": " 1996", "Type": " Company - Public (NCI) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Navigant Consulting, Inc. (NYSE: NCI) is a specialized, global professional services firm that helps clients take control of their future. Navigant’s professionals apply deep industry knowledge, substantive technical expertise, and an enterprising approach to help clients build, manage and/or protect their business interests. With a focus on markets and clients facing transformational change and significant regulatory or legal pressures, the Firm primarily serves clients in the healthcare, energy and financial services industries. Across a range of advisory, consulting, outsourcing, and technology/analytics services, Navigant’s practitioners bring sharp insight that pinpoints opportunities and delivers powerful results. More information about Navigant can be found at navigant.com.  Navigant Life Sciences is the Life Science strategic consulting arm of the Navigant’s Healthcare Practice. Our clients include companies in the pharmaceutical, biotechnology, medical device, drug delivery and diagnostic industries. Examples of Navigant Life Science’s diverse consulting assignments include therapeutic area strategy development, product opportunity assessments, commercial strategy, business development search and evaluations, due diligence, market access strategy, new product launch planning and positioning, and payer landscape assessments. Our clients are worldwide and range in size from start-ups to multi-nationals. Navigant Life Science’s culture is distinguished by its collegial, team approach. We value hard work of the highest quality and also encourage creativity, entrepreneurship, and having fun.  This position will allow the intern to develop the analytical, creative, and interpersonal skills essential to effective general strategy consulting. Summer associates work with Navigant Life Science teams providing support through all aspects of project work. Specific tasks include the following: scheduling and conducting interviews with physicians, payers, and other thought leaders in healthcare; gathering and analyzing medical literature, healthcare market reports and databases; and participating in document writing, production, and client presentations. Currently completing an undergraduate degree between December 2018 and June 2019 with an interest in the Life Sciences industryUnderstanding of financials, budgets, and ability to develop quantitative models for forecasting populations/salesMust be able to demonstrate written and oral communication and presentation skillsStrong project management skills are imperative for leading small teamsPowerPoint and Excel skills are required – must be able to think graphically Strong conceptual, as well as quantitative and qualitative analytical skills Work as a member of a team as well as be a self-motivator with ability to work independently Constantly operates a computer and other office equipment to coordinate work Frequently travels by airplane, train or car as necessary to perform work at another location Regularly uses close visual acuity and operates computer equipment to prepare and analyze and transmit data Generally works in an office environmentThe company offers competitive compensation packages including an incentive compensation plan, comprehensive medical/dental/life insurance, 401(k) and employee stock purchase plans.Navigant does not accept unsolicited resumes through or from search firms or staffing agencies. All unsolicited resumes will be considered the property of Navigant and Navigant will not be obligated to pay a placement fee.Navigant is an Equal Employment Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, national origin, ancestry, citizenship status, military status, protected veteran status, religion, creed, physical or mental disability, medical condition, marital status, sex, sexual orientation, gender, gender identity or expression, age, genetic information, or any other basis protected by law, ordinance, or regulation.Navigant will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of applicable law or ordinance including the Fair Chance Ordinance of Los Angeles and San Francisco."}