{"jobID": "2699558430", "jobLocation": "Sunnyvale_CA", "jobTitle": "Research Intern - Fujitsu Labs", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Title: Research Intern  FUJITSU LABORATORIES OF AMERICA, INC. (FLA) was established in 1993 as a wholly owned subsidiary of Fujitsu Laboratories Ltd., which is a wholly owned subsidiary of Fujitsu Ltd., focusing on contributing to Fujitsu's technology value chain. FLA conducts advanced research in Device, Component, and Platform Innovations, Network and Trusted Systems Innovations, and Internet Service Innovations. FLA also conducts research in an open and networked laboratory environment, and contributes to Fujitsu global business through developing and expanding leading edge technologies, promoting the creation of new businesses, and the creation of global value chain while fulfilling its social responsibilities. FLA contributes to the world of research communities through joint research projects with universities and research organizations, and through the free exchange of ideas at technical conferences.  Fujitsu Laboratories of America (FLA) is the U.S. R&D; arm of Fujitsu, the global information and communications technologies leader headquartered in Japan.  The Digital Life Lab at FLA is looking for bright and energetic interns to join our research team starting in May, for part-time or full-time 3-6 month positions. We have a variety of active research projects that look at adding transparency to AI systems, to enable application engineers, business architects, and end-users to understand and interact with AI fluidly. Some areas relevant to our projects include Deep Learning, Machine Learning, Natural Language Processing, Topic Models, Generative Adversarial Networks, Adversarial Learning, Human Computer Interaction, Behavioral Science, and Computational Cognitive Science. A qualified candidate would possess:Research or experimentation experience in one or more of the areas mentioned above. Students in M.S. and Ph.D. programs with relevant coursework or research experience are invited to apply, and we are open to advanced undergraduates who can demonstrate relevant experience.The ability to work quickly and creatively. We believe in agile research.The ability to digest various information sources, even those outside of your regular area of expertise. Most of our projects are multi-disciplinary.Excellent communication skills; fluency in written and spoken English is required.The ability to work independently as part of a mutually supportive team is crucial. We're looking for self-propelled self-starters with excellent teamwork skills. Finally, if you're interested in problems that fit within our Lab's purview adding transparency to AI systems to enable understanding and fluid interaction with humans-in-the-loop -- but don't see your area reflected above, feel free to send us a short note describing a problem that you'd like to work on, and we will consider it.SDL2017"}