{"jobID": "2677494455", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior / Lead Data Scientist - Security Analytics", "companyRating": "4.3", "companyInfo": {"Website": "www.salesforce.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1999", "Type": " Company - Public (CRM) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Oracle, SAP, Google"}, "estimatedSalary": "159000", "jobDescription": "The Team The Security Analytics Team at Salesforce is looking for an experienced, driven, and creative Principal or Lead Data Scientist to join the team. We explore, invent, build and scale new ways to secure the Salesforce platform. We leverage Big Data and machine learning to advance behavior- and signature-based techniques of many forms. We own our solutions, from inception, through proof-of-concept, production-ready software engineering, testing, packaging, and efficacy monitoring. We are a growing, highly visible, and highly agile team where experimentation, collaboration, and spirited discussion are the norm. About You - You’re intensely curious about data and highly adept in analyzing large volumes of data, then teasing out valuable signals therein. You’re able to seamlessly merge rigor in statistics with awareness of their application to business problems. - You thrive in researching, experimenting with, applying, and proving out new techniques in machine learning and data mining. You maintain a healthy curiosity and investment in keeping abreast of emerging techniques. - You partner with threat experts to understand evolving threat patterns and their detection. You collaborate effectively with software engineers to champion proven detection techniques, consult in their software implementation, possibly even help build production software. Responsibilities: - Conduct and document rigorous exploratory data analyses of potential source datasets. - Conduct literature searches on current techniques in data mining, machine learning, and threat detection. - Collaborate with internal incident-response and threat-research teams on evolving threats and their detection - Formulate,build, test, and document proofs-of-concept for new techniques in threat detection. - Consult with and/or assist in engineering scalable, production-ready software for proven techniques. - Provide periodic efficacy measurement, analysis, and reporting for deployed techniques. - Champion your research and the larger teams’ with executive stakeholders. Required Skills: - ​PhD or Masters and 5+ years experience in Computer Science, Math, Statistics, or related quantitative discipline. This is NOT an entry level role. - Demonstrated, extensive experience in machine learning and data mining - Strong fundamentals in applied statistics and probability - Facility with current big-data tools, including Apache Spark and HBase - Strong programming skills in Java, Python, or Scala - Excellent communication skills - Experience formulating, leading, and executing applied-research projects and assisting in their production implementation. Preferred Skills: - Strong understanding of security, including threat propagation and signal correlation. - Experience in applying big-data techniques to security, specifically in anomaly detection, pattern recognition, behavior-based analysis, and correlation. - Experience in stream-data processing (e.g. Storm or Herron) - Related experience in genomics, high-speed trading, or other domains involving pattern recognition or behavior-based analysisPosting StatementSalesforce.com and Salesforce.org are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Headhunters and recruitment agencies may not submit resumes/CVs through this Web site or directly to managers. Salesforce.com and Salesforce.org do not accept unsolicited headhunter and agency resumes. Salesforce.com and Salesforce.org will not pay fees to any third-party agency or company that does not have a signed agreement with Salesforce.com or Salesforce.org.Pursuant to the San Francisco Fair Chance Ordinance and the Los Angeles Fair Chance Initiative for Hiring, Salesforce will consider for employment qualified applicants with arrest and conviction records."}