{"jobID": "2754291283", "jobLocation": "San_Jose_CA", "jobTitle": "Sr. Full Stack Engineer", "companyRating": null, "companyInfo": {"Website": "www.careers-continental.com", "Headquarters": "Hannover, Germany", "Size": "10000+ employees", "Founded": " 1871", "Type": " Company - Public (CTTAY) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Michelin, Bosch Security"}, "estimatedSalary": null, "jobDescription": "About Continental With sales of €44 billion in 2017, Continental is among the leading automotive suppliers worldwide and currently employs more than 238,000 employees in 61 countries. Information management in and beyond the vehicle is at the very heart of the Interior division. The product portfolio for different types of vehicles includes: instrument clusters, multifunctional and head-up displays, control units, access control and tire-information systems, radios, infotainment systems, input devices, control panels, climate control units, software, cockpits as well as services and solutions for telematics and Intelligent Transportation Systems. The Interior division employs more than 46,000 people worldwide and generated sales of €9.3 billion in 2017. Auto req ID 91361BR Job Title Sr. Full Stack Engineer Country United States Posting Location San Jose, CA Job Description Overview  We are seeking technology innovators and systems thinkers, makers and hackers who can re­imagine what we already do, what we could be doing next and have the creativity, technical expertise and hands­on experience to make it happen.  In this role you will be part of a new and growing cross divisional team of R&D; innovation in our Corporate Technology Office working on our innovative IoT platform and services enabling Continental’s future cyber­physical systems of physical products seamlessly blended with computation and cloud.  Your focus will be on developing innovative UI/UX’s for IoT products and services as well as the IoT platform itself in a fast paced global team. You will step into the backend to build out functionality, advise on architectural design, create APIs and help out on any of the end­to­end solution pieces.  Core Responsibilities Build­out our innovative IoT product front ends, primarily for the webDevelop, maintain and enhance our IoT platform’s administrative and management front endApply your creativity and experience to help product teams identify IoT service opportunities and new valuable customer experiences across many different verticals through development of Minimum Viable ProductsContribute to software architecture designs for future software and technical architecturesTake part in R&D; and proof of concepts on new technologies and present findings to relevant technology leaders in the companyCollaborate with cross­functional teams to define, design and ship new features in an agile working modeDevelop standards, CI/CD and reusable code to improve the overall efficiency of Continental’s connected service offerings Job Requirements Basic Qualifications"}