{"jobID": "2767341138", "jobLocation": "Seattle_WA", "jobTitle": "Data Analyst - Bits", "companyRating": "2.9", "companyInfo": {"Website": "www.twitch.tv", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2011", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "79000", "jobDescription": "Twitch is seeking an experienced Data Analyst to be part of a small but nimble team focused on driving data insights for the Bits product and business teams.Data is central to Twitch’s decision-making process, and analysts are a critical component to evangelize data-driven decision making in all of our operations. As a Data Analyst at Twitch, you will be in on the ground floor with the Bits business team, shaping the way performance is measured, defining what questions should be asked, and scaling analytics methods and tools to support our growing business. Additionally, you will play a key role in supporting the vision for business analytics, solutions architecture for data related business constructs, as well as tactical execution such as campaign performance reporting. Ultimately, you are paving the way for high quality, high velocity decisions making in support of growth.For this role, we're looking for an experienced data analyst who will be working cross functionally with the go-to-market functions, including growth marketing, product marketing, content marketing, events, and brand. You will be responsible for driving insights to inform our channel investments (both on-platform and off-platform) as well as provide guidance on success/failure metrics.Responsibilities Evangelize data knowledge and insights: manage communications with your stakeholders and other teams, collaborate with both technical and non-technical colleagues to complete data projects and ensure all parties can use the insights to further improve.Maintain a customer-centric focus: strive to be a domain and product expert through data, develop trust amongst your peers and stakeholders, and ensure that your team has access to data to make decisions.Prioritize and execute in the face of ambiguity: work with stakeholders and mentors to distill the problem, adapt your tools to answer complicated questions, and identify the trade-offs between speed and quality of different approaches.Create analytical frameworks to measure team success: partner with cross-functional teams to define success metrics, create approaches to track the data and troubleshoot errors, quantify and evaluate the data, then develop a common language for all colleagues to understand these KPIsSupport data processes - provide the team with ad-hoc analysis, automated dashboards, and self-service reporting tools so that everyone gets a good sense of the state of the businessRequirements 2+ years of domain experience in a consumer internet business, or in a high-velocity, high-growth product or business unit.Expert SQL skills. Ability to tap into Twitch’s data pipeline will be key to success.Proven track record of using data to generate insight and drive business results.Fluency in data analysis and communication around data, including time series analysis, experimentation, data visualization, and defining KPI strategy for your business.Strong written and verbal communication skills.Sound business judgment; strategic and analytical capabilitiesAbility to prioritize and multitask; ability to adapt to a fast moving environmentExcellent team player with ability to maintain strong internal and external relationshipsBachelor’s degree requiredBonus Points Technical background with some programming experienceStatistics and AB testing experience or knowledge is always a plusPassion for video gaming and TwitchPerks Full benefits, including medical, dental, vision and life401(k) savings plan with a company matchCatered daily lunch and dinners (and hearty breakfasts three times a week)Unlimited snacks and drinksMonthly in-office massagesCorporate gym membershipCommuter benefitsFlexible time off policyWeekly happy hours and opportunity to attend one gaming event or tournamentTop of the line technology to help you build your own workspaceTwitch is the world’s leading video platform and community for gamers, with more than 100 million visitors per month. We connect gamers from around the world by allowing them to broadcast, watch, and chat with each other. Twitch’s live and on-demand video platform forms the backbone of a distribution network for video game broadcasters including pro players, tournaments, leagues, developers and gaming media organizations. Twitch is leading a revolution in gaming culture, turning gameplay into an immersive video experience. Learn more at: http://twitch.tvWe are an equal opportunity employer and value diversity at Twitch. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records."}