{"jobID": "2795337239", "jobLocation": "Fremont_CA", "jobTitle": "Market Development Director", "companyRating": "3.9", "companyInfo": {"Website": "www.pivotinteriors.com", "Headquarters": "Santa Clara, CA", "Size": "201 to 500 employees", "Founded": " 1973", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " One Workplace, Tangram Interiors"}, "estimatedSalary": "153000", "jobDescription": "SUMMARYThe priority of this position is to acquire new customers by selling the benefits of Pivot’s experience, services and products. Responsible for the achievement of quarterly and annual sales goals for volume and margins, and the development of new business while ensuring the highest level of customer satisfaction. Builds a network of different industry sales professionals who share the same customer, uncovering new opportunities. Create the sales strategy around an opportunity, work with internal team members to support selling efforts and transition to Account Management team once won.ESSENTIAL DUTIES AND RESPONSIBILITIES include the following. Other duties may be assigned.Develops and maintains an innovative sales/marketing strategy for assigned market segments.Creates and maintains strong relationships with clients, prospective clients, vendors, and referral sources to increase customer satisfaction and generate referral business.Promotes and sells design, installation, project management, architectural products and other Pivot Interiors services. Provides prompt and effective follow-up of leads and new prospects.Conducts presentations, demonstration, and tours as appropriate at various points in the sales cycle.Secures dealer-held agreements with major clients as required.Develops and participates in leads groups, attends business development functions, cold calls, attends lunch/dinner and other functions with business influencers (brokers, A&D;, construction, etc.) and schedules appointments with new prospective clients.Develops and maintains C-suite executive relationships.Maintains a current working knowledge of developments in all vertical markets, including related products, applications, and design concepts. Makes recommendations to design/sales leadership based on trends, insights and developments in the market.Consistently devotes time to personal and professional development through a variety of continuing education sources and appropriate business and professional associations.Position requires travel throughout the Bay Area with occasional overnight stays.Performs other duties as assigned.SUPERVISORY RESPONSIBILITIESThis position has no supervisory responsibilities.QUALIFICATIONS To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.EDUCATION and/or EXPERIENCEBachelor's degree (B.A.) or equivalent from four-year college or technical school and up to 5 years related experience and/or training; or equivalent combination of education and experience. Must have experience with and knowledge of MS Office.LANGUAGE SKILLSAbility to read, analyze, and interpret general business periodicals, professional journals, technical procedures, or governmental regulations. Ability to read and analyze architectural drawings and blueprints. Ability to write reports, and business correspondence (such as proposals, quotations, letters), in English. Ability to effectively present information, written and verbal, in English, and respond to questions from groups of managers, clients, vendors, and the general public.MATHEMATICAL SKILLSAbility to calculate figures and amounts such as discounts, interest, commissions, proportions, percentages, area, circumference, and volume. Ability to apply the algebraic and geometric concepts involved in project design desirable.REASONING ABILITYAbility to solve practical problems and deal with a variety of concrete variables in situations where only limited standardization exists. Ability to interpret a variety of instructions furnished in written, oral, diagram, or schedule form.CERTIFICATES, LICENSES, REGISTRATIONSProof of valid California state drivers’ license, and proof of insurance of an operable vehicle required.PHYSICAL DEMANDS The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.While performing the duties of this job, the employee is regularly required to sit; concentrate intensely; talk and hear. The employee frequently is required to stand; walk; and use hands to finger, handle, or feel, and operate a computer keyboard, mouse, and telephone keypad. The employee is occasionally required to reach with hands and arms and stoop, kneel, crouch, or crawl. The employee must regularly lift and/or move up to 10 pounds, frequently lift and/or move up to 25 pounds, and occasionally lift and/or move up to 50 pounds with assistance and/or equipment. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and ability to adjust focus.WORK ENVIRONMENT The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.While performing the duties of this job, the employee is occasionally exposed to moving mechanical parts, outside weather conditions, and risk of electrical shock if working at client site. The noise level in the work environment is usually moderate.Equal Opportunity Employer–minorities/females/veterans/individuals with disabilities/sexual orientation/gender identity."}