{"jobID": "2812165693", "jobLocation": "San_Carlos_CA", "jobTitle": "Operations Intern", "companyRating": null, "companyInfo": {"Website": "www.juntosglobal.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Named Best New Product for the Underserved by the Center of Financial Services Innovation and the global winner of the G20 Innovation Award for Financial Inclusion, JUNTOS designs and manages empowering text-message conversations for and with millions of financially underserved households across four continents. Our team combines scalable technology with empathy-driven design to increase financial inclusion around the world.  Reporting to our Senior Operations Manager, our Operations Intern will take on the responsibility of managing partnerships around the world. This role will engage with cross-departmental teams in a complex and fast paced startup environment. Operations InternA good candidate for this role:Is currently enrolled in graduate program interested in developing operations and/or product development skillsHas experience working with and using data to make strategic decisionsCan balance urgent results-oriented work with strong process creationWill proactively engage with all relevant stakeholders across our team of engineers, analysts, and content designersEnjoys problem solving; identifying root causes, gathering relevant information, and generating possible solutionsIs familiar with user-centric and iterative design thinking Our Operations Intern will: Coordinate cross-functional teams that contract, design, build, and implement customized solutions for our partnersDrive the analysis of our data with considerable coordination across the teamImplement scalable design and product management processes across a diverse set of partners distributed around the worldToggle between high-level strategic planning and detailed task management execution Location: San Carlos, CA  Compensation: $1,500/week, plus flight to/from Bay Area (if applicable)  Internship length: 10-12 weeks with flexible start and end dates  Application deadline: May 15th, 2018  Juntos is venture backed by Aligned Partners and Omidyar Network and headquartered in San Carlos, CA. To apply, send a CV and a cover letter explaining why this position & Juntos are appealing to you to join.the.team@juntosglobal.com"}