{"jobID": "2562985224", "jobLocation": "Santa_Clara_CA", "jobTitle": "GPU / Deep Learning Architect", "companyRating": null, "companyInfo": {"Website": "www.nvidia.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1993", "Type": " Company - Public (NVDA) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "We are now looking for a GPU / Deep Learning Architect: Are you passionate about exploring computer architectures for deep learning? Are you motivated to push the limits of GPU capabilities for visual computing? If so, our GPU architecture group is looking add you to our team. What you'll be doing:Analyze the performance of various machine learning/DL algorithms on existing/new architecturesIdentify bottlenecks and propose creative solutions to improve them.Explore the commonality between deep neural networks and visual computingAdd new capabilities to GPU architecturesWhat we need to see:You have an MS or PhD degree in computer science, computer architecture, electrical engineering or related field. Alternately, a 2+ years work/research experience in GPU architecture/DNN/3D-graphics, also works for us.You have explored architectures for Machine learning (with focus on DNN)You have a good exposure to GPU architectures, computations for 3D graphics.You love performance analysis and modelingYou are a strong C++/python programmer.Strong communication and interpersonal skills are required along with the ability to work in a dynamic, product oriented, global team. Your history of mentoring junior engineers and interns is a huge plus.Ways to stand out from the crowd:You have good intuitions about low power design trade-offs.You are familiar with DL frameworks/fundamentalsYou have valuable insights in numerical range/precision analysis, convergence of iterative algorithms etc.What is so exciting about this Job? Nvidia has been at the forefront of pushing the boundaries of visual computing and now using that platform for deep learning and AI. It begins with the most advanced GPUs and the systems and software we build on top of them. We innovate at architecture level as well as at the algorithm level to deliver maximum the performance for DL and visual computing algorithms at given power envelope.  With competitive salaries and a generous benefits package, we are widely considered to be one of the technology world’s most desirable employers. We have some of the most brilliant and talented people in the world working for us and, due to unprecedented growth, our elite engineering teams are rapidly growing. If you're a creative and autonomous engineer with a real passion for computer architecture and technology, we want to hear from you.  NVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression , sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.#deeplearning"}