{"jobID": "2787659707", "jobLocation": "Beverly_Hills_CA", "jobTitle": "Content Data Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.nbcuni.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1906", "Type": " Company - Public (CMCSA) ", "Industry": " Media", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "65000", "jobDescription": "Job Title Content Data Analyst  22-May-2018 Business Segment Filmed Entertainment Group ResponsibilitiesSenior Analyst, Content Analytics Fandango seeks an experienced, talented, and passionate Senior Analyst to join our growing Analytics team. The ideal candidate will have exceptional quantitative skills, a passion for data analysis, and the ability to synthesize learnings into actionable insights for our Rotten Tomatoes brand. Responsibilities:Leverage data to understand our products in depth, identify areas of opportunity, and execute projects to drive conversion and engagement of Fandango usersApply your expertise in quantitative analysis, data mining, and the presentation of data to see beyond the numbers and understand how our users interact with our core productsPartner with content teams of Rotten Tomatoes brand to solve problems and identify trends and opportunities, make recommendations, predict trends and perform ad-hoc analysisDeliver persuasive presentations that simplify complex analyses into actionable insights and recommendationsInform, influence, support, and execute content decisionsBuild/maintain reports, dashboards, and metrics to monitor the performance of our content effortsJob Number41305BRPosting Category Digital Media Country United States Sub-Business Film Fandango About Us At Fandango, we love movies. From showtimes and ticketing, to engaging content and innovations in movie going- we strive to deliver the perfect movie going experience—anytime, anywhere. And to be the go-to destination for moviegoers, we think it’s all about collaboration. Anyone can build a website or app, but it takes a special group across many disciplines to create an experience that can live across multiple platforms and connected devices. Thanks to an exceptional team, we’re working hard to make Fandango a little bit better every day. Our 30 million (and growing!) online and mobile monthly visitors can now buy movie tickets at over 25,000 screens nationwide and stay for exclusive trailers, our award-winning original video series, movie reviews, celebrity interviews and more. So, if you’re looking to inspire, be inspired and work at the intersection of entertainment and technology look no further than Fandango. Visit Fandango.com/careers for a behind-the-scenes look at Fandango and follow us on LinkedIn for the latest news and updates. Fandango is an NBCUniversal Company. State/Province California Career Level Experienced Qualifications/RequirementsBS or MS in Computer Science, Math, Physics, Engineering, or related quantitative field3+ years of quantitative or statistical analysis experienceAbility to initiate and drive projects to completion with minimal guidanceAbility to communicate the results of analyses in a clear and effective mannerAbility to use web analytics tools (Adobe Analytics, Google etc.) to generate actionable insightsBasic understanding of statistical analysis or machine learning (e.g. classification & clustering techniques, regression modeling, etc.)Very strong proficiency with SQLProficiency with at least one of the following tools: Python, R, SASSelf-starter and self-motivated with the proven ability to multi-task and deliver results in a fast-paced, high-energy environmentWorks effectively both independently and as a member of a cross functional teamMust be available and willing to work extended hours as occasionally needed including weekends and holidays, to meet business needsAble to exercise discretion and keep strictest levels of confidentialityMust maintain regular and acceptable attendance at such level as is determined at the company’s sole discretionDesired CharacteristicsExperience analyzing user behavior across digital, consumer-facing products (e.g. gaming, e-commerce, etc.)Experience with AWS Redshift/S3, Apache SparkWorking knowledge of digital media, film, and e-commerce industriesExperience with experiment design and execution (e.g. A/B, multivariate testing)City Beverly Hills Notices NBCUniversal’s policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law. NBCUniversal will consider for employment qualified applicants with criminal histories in a manner consistent with relevant legal requirements, including the City of Los Angeles Fair Chance Initiative For Hiring Ordinance, where applicable. "}