{"jobID": "2516732985", "jobLocation": "Boston_MA", "jobTitle": "Fundraising/Environmental Outreach Intern", "companyRating": null, "companyInfo": {"Website": "www.earthwatch.org", "Headquarters": "Boston, MA", "Size": "1 to 50 employees", "Founded": " 1971", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Location: Boston, MA, United States Position Type: Intern (unpaid) Department: Field Research ExpeditionsPOSITION SUMMARY:The Fundraising/Environmental Outreach Intern will manage an online and/or in-person auction to raise funds for two scholarship programs available for underserved, urban youth in Boston and New York City. The scholarship programs send high school students interested in pursuing post-secondary education in the STEM disciplines on a fully funded Earthwatch expedition. Work on the auction has been started by a previous intern. The Intern may also choose to assist with a variety of tasks relating to recruiting volunteers to participate in citizen science and experiential learning trips, with a focus on high school aged groups. RESPONSIBILITIES: Internships offer training in a variety of tasks and provide individuals an opportunity to be part of an exciting and dynamic team. Internship responsibilities may shift with seasonal needs of the Public Program. Responsibilities may include: Run a silent auction online or in-person eventsSeeking out potential silent auction donorsResearching additional fundraising toolsPlanning and coordination of volunteer outreach events (2-3 events)Researching industry best practices for volunteer outreachAssisting in the recruitment of volunteers for participation on international research expeditionsREQUIREMENTS:Experience in event planning and interest in fundraisingInterest in business management or biology/ecology/environmental scienceBackground or experience with data analysis using Microsoft ExcelDemonstrated flexibility, initiative, resourcefulness, and collaboration skillsAbility to multitask while staying organizedDetail-oriented and a team playerSense of humor! Earthwatch interns can take part in the Intern Credit Program in which they receive credits to use towards a qualified Earthwatch expedition and are invited to participate in all Earthwatch activities. Although three or more months are preferred, we require a minimum commitment of one month and 120 hours. We also encourage use of the internship for academic credit, thesis, or practicum work towards degree or certificate programs.  We are only able to accept-Massachusetts based applicants into the program, or those with a confirmed place to stay within commuting distance to Boston. Applicants must currently be eligible to work in the United States. All interns are required to have individual health insurance. Placement will be subject to qualifications and availability. To Apply: Please submit one document in the resume field below containing all of the following items. Incomplete applications will not be considered. A Cover Letter illustrating your qualifications, why you are interested in this internship, and what you are looking to gain from this internshipA current resume, detailing relevant field and/or office experienceYour availability (days per week, and months of availability)Full contact information for three professional and/or personal referencesA recent writing sample excerpt"}