{"jobID": "2796357539", "jobLocation": "Boston_MA", "jobTitle": "Software Quality Assurance Engineer", "companyRating": "3.8", "companyInfo": {"Website": "www.cengage.com", "Headquarters": "Boston, MA", "Size": "1001 to 5000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Media", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Pearson, McGraw-Hill Education, EBSCO Industries"}, "estimatedSalary": "79000", "jobDescription": ". Do you dare to reinvent the future of education?At Cengage, we are harnessing the power of tech to build a future where all learners have the tools and confidence to achieve their goals.As a Cengage employee you will pioneer transforming the way people learn. Collaborating with the best of the best, you will feel challenged and inspired to do breakthrough work. With the support of our united team, there is no limit to what you can imagine, create and set in motion.Are we right for you?We bring our “A” game, unique talents and point of view to the table every day. We are curious and comfortable with change and are willing to take risks to transform education. Most importantly, everything we do, we do for the learner.  Senior Software Quality Assurance Engineers (SQA) are primarily responsible for getting the work done to ensure systems and projects are working as designed (and required), with a high degree of quality. The primary function of the role is to design, develop and implement test strategies for validating features an.) While they have no direct management or leadership responsibilities, they are encouraged to take part in defining directions and setting goals. As SQA increase in skill, they will likely be considered experts in their field(s) of expertise (i.e. their engineering domain).What You'll Do Here: Expert knowledge of SQL (MySQL), Linux/Unix and API, GUI testing and codingWorks independently with minimal directionCreates test plans from a technical design document and/or requirements document with moderate supervisionCreates test plans from a technical design document and/or requirements document with no supervision Executes manual test cases and regresses bugsTroubleshoots issues (in QA or on live) as assigned with moderate supervisionAssists in the review of test plans from junior membersProvides reliable and accurate task estimates for assigned work with review from a Senior Engineers Is competent in concepts of Quality Assurance and software development, Agile and Test Driven DevelopmentAnalyzes requirements and designs to assist Development in design process, to look at overall project Effectively reuses existing test collateral and creates both when neededContributes to engineering domain design discussions and to test strategy creation as requestedAssists in mentoring and/or educating junior engineers in best practices, proprietary technology, and in newest technology and methodsContributes to SQA policy-making discussions as requestedShows strong initiative in seeking out opportunities to identify and deal with issues in both the systems they own as well as the systems other people ownSkills You Will Need Here:BA/BS in Computer Science or Engineering or equivalent experienceExpert at coding in one or more of the following Java, PHP, Groovy, C# or RubyStrong knowledge of the following tools (SoapUI, Selenium, JIRA, Zephyr or Eclipse IDE)Expert working knowledge of SQL (MySQL), Linux/UnixIs proficient in concepts of Quality Assurance and software development, Agile,TDD & BDDShows good initiative in seeking out opportunities to identify and deal with issues in both the systems they own as well as the systems other people ownReviews and supervises automation created by otherStrong understanding of Performance Testing & Security Testing(theory and why they-re important),Accessibility & Cross Browser Testing 1"}