{"jobID": "2645521731", "jobLocation": "Boston_MA", "jobTitle": "Occupational Therapy", "companyRating": null, "companyInfo": {"Website": "www.navy.com", "Headquarters": "San Diego, CA", "Size": "1001 to 5000 employees", "Founded": " 1775", "Type": " Government", "Industry": " Government", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " \"About This JobNavy Occupational Therapists assist Sailors and their families and those in need in meeting everyday demands after illness, injury or any other kind of impairment. They aid in restoring lost skills of daily living. And assist those who have suffered injury, illness or impairment in achieving high independent function. Partnering with first-rate health-care providers, including physicians and physical therapists, Occupational Therapists are a critical part of a multidisciplinary team.As an Occupational Therapist and Officer in Navy Clinical Care, you will: Work, on an inpatient or outpatient basis, with those who have had a stroke, injury, disease or other impairment Use tools such as a goniometer for measuring range of motion, and a dynamometer and pinch meter, for recording hand and finger grip as well as pinch strength Help rehabilitate functional daily living skills, such as bathing, dressing and eating, with or without the use of adaptive devices Assess patients who may require aiding devices  Provide custom-made garments for an ailment or conditionYou could also: Evaluate and treat patients referred for multiple diagnoses, who require acute rehabilitation within inpatient and outpatient settings Receive extra training in modalities, such as electrical stimulation or ultrasound for pain management, and placement activities for dexterity Train as an upper-extremity neuromusculoskeletal evaluator or pediatric occupational therapist, or pursue a postgraduate degree Specialize in hand therapy, pediatrics or ergonomics  Take on a teaching position in a dual-service occupational therapy assistant programNavy clinical care providers may serve at any one of more than 250 Navy and medical facilities around the globe, in some of the most dynamic environments imaginable: Hawaii to Japan, Germany to Guam, and Washington, D.C., to Washington state.As an Occupational Therapist, you could also work at one of the highly acclaimed National Naval Medical Centers in Bethesda, Md.; Portsmouth, Va.; and San Diego, Calif. Using the new ReoGo neuro-rehabilitation unit to help rehabilitate patients upper extremities following a traumatic brain injury or stroke. Or you could provide occupational therapy support aboard one of two dedicated hospital ships: the USNS Comfort and USNS Mercy.Upon graduation from graduate school, those pursuing an Occupational Therapist position are required to attend Officer Development School (ODS) in Newport, R.I. ODS is a five-week program that provides a comprehensive and intense introduction to the responsibilities of Navy Staff Corps Officers. Here they learn about the military structure of the U.S. Navy, its rich history of traditions and customs, leadership development and military etiquette.Promotion opportunities are regularly available but competitive and based on performance.\""}