{"jobID": "2729873965", "jobLocation": "Sunnyvale_CA", "jobTitle": "Data Analyst, Vudu", "companyRating": "3.2", "companyInfo": {"Website": "www.walmartlabs.com", "Headquarters": "San Bruno, CA", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, eBay, Google"}, "estimatedSalary": "96000", "jobDescription": "Position DescriptionOur ideal candidate is a sharp, thoughtful problem solver, who enjoys identifying key business levers and challenges, and then building analytical framework to impact strategic decision making. What you'll do:Write SQL/Hive/Spark queries to extract necessary data and present the information either in Tableau or PowerPoint and analyze the results to generate business insights.Proactively perform data exploration on user behavior to discover future testing opportunities.Work collaboratively with a cross-functional team (Product, Marketing & Engineering) to solve complex business/product/marketing problems.Create and manage business/operational dashboards to monitor business line performance.Present your research and insights to all levels of the company, clearly and concisely.Minimum Qualifications• Bachelors degree in a quantitative field (e.g. mathematics, statistics, computer science, engineering, or physics) or minimum of 2 years analytics work in industry.You have extensive experience using SQL and Tableau. Looker is a Plus.Outstanding written and oral communications skills.You have a solid foundation in basic statistics, e.g., regression analysis, modeling, forecasting etc.You understand experimentation, hypothesis testing, and causal inferenceAdditional Preferred QualificationsCompany SummaryWalmart Global eCommerce is comprised of Walmart.com, VUDU, SamsClub.com, and our technical powerhouse @WalmartLabs. Here, innovators incubate next gen e-commerce solutions in real-time. We integrate online, physical, and mobile shopping experiences for billions of customers around the globe. How do we do it? We continuously build and invest in new technology including open source tools and big data innovations. Data scientists, front and back-end engineers, product managers, and web and UX/UI teams collaborate alongside e-commerce experts to envision, prototype, and bring revolutionary ideas to life in a dynamic, flexible and fun work culture.Position SummaryWrite SQL/Hive/Spark queries to extract necessary data and present the information either in Tableau or PowerPoint and analyze the results to generate business insights. Proactively perform data exploration on user behavior to discover future testing opportunities.  Work collaboratively with a cross-functional team (Product, Marketing & Engineering) to solve complex business/product/marketing problems.  Create and manage business/operational dashboards to monitor business line performance.  Present your research and insights to all levels of the company, clearly and concisely. "}