{"jobID": "2830863578", "jobLocation": "Boston_MA", "jobTitle": "Application Security Engineer & Coordinator", "companyRating": "3.8", "companyInfo": {"Website": "www.amadeus.com", "Headquarters": "Madrid, Spain", "Size": "10000+ employees", "Founded": " 1987", "Type": " Company - Public (AMS) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Travelport"}, "estimatedSalary": "97000", "jobDescription": " Are you ready for the next step in your career? Then you need to keep reading! When we're looking to hire at Amadeus, we look internally first. Our teams get the benefit of your experience and you get more chances to grow and progress. So, if you are ready for a new challenge and want to drive your career, apply now!  I. Summary of the role  Security & privacy of our platforms and applications is of utmost importance for Amadeus. We have legal, contractual, and moral obligations to our customers and partners to secure their data and protect against threats. We are looking for a motivated individual with a background in security to be the front line of defence in the Boston office.  This Application Security Engineer (\"White Hat\") will have responsibilities both for specific SGB/Hospitality projects (especially project NEXT) as well as serving a general Application Security Coordinator and local point of contact for the Boston R&D; office.  Ideal Candidates will display Passion for application security (ideally already trained and exposed to application security, but if not, very motivated and fast learner)Good architectural understanding (for threat modelling)Strong application development background with Dev Sup competencies (need to setup workbench, to analyse/triage PTRs, to support pentests, etc)Good communication and coordination skills (training, threat modelling, triage, ) II. Main responsibilities Scope of Responsibilities:Deploy and control the Amadeus Secure Development LifecycleSupport audits & compliance (e.g., PCI DSS, ISO27K, SSAE18, GDPR)Support security SHIELD program initiativesSupport technical investigations and corrections in case of a security incidentWork in close collaboration with other Hospitality Application Security Engineers in Portsmouth, Nice and Breda, as well as with SGB Head of Security & Privacy and corporate Application Security Office.Detailed Activities:Becoming the Subject Matter Expert for all development security activitiesEnsuring the software workbench contains automated & continuous Dev Sec tools & controls (static code analysis, application scanning, )Source Code Application Scan: progress Fortify triage and PTR fixesBuild Automated Security Checks: Signup for 3rd party application dependencies (e.g., open source) OSS/frameworks 0day rss/email lists/website notifications and communicate 0days and mitigations to product lines and whitehat community Build Automated Security Checks: Transfer any available TP8 build sectooling into build/compile toolchain with whitehats Threat Modeling: organize/attend and support Threat Modeling workshopsDeveloper SecTools: Joint DevSecOps: get webapp/webserver config files and run Nester against and review report/improvementsDeveloper SecTools: application log analysis for sensitive data leakagePenetration Testing: Raise pentest WO (work-order) per procedure in SDL portal for all product lines handling Personal information, credit cards or other sensitive customer/corporate data. Support kickoff call and adhoc support as needed during pentesting of product linesSource Code Application Scan: Secure code reviews - and co-develop checklists with SDL team to add to SDL portal for communitySkills/Awareness: Take eLearning classes & give monthly awareness sessions (mandatory topics: OWASP top 10/Mitre 25 - reusable content in SDL portal) Public Attack Surface protection: Help build/maintain product inventory & meta-dataGovernance: Quarterly review of Security Maturity Matrix SDL touchpoint status/updates/comments to keep up to date with progress on product linesGovernance: Attend regular meeting with Security Manager to review SDL topics and concernsIII. Education: Bachelor's degree in Computer Science or related field, or equivalent. Relevant work experience:Software developer for at least 5 years in C++, Java, javascript, groovy, python, plus 3-5 years in software security as a security analyst/coordinator/engineerSome initial security project coordination & planning experience - or involvement with suchPassion and knowledge about application securitySoftware developer security coaching and support for fixing found vulnerabilities in codeDefensive secure development training deliverySecure Development Lifecycle (SDL, SSDLC, BSIMM, OWASP SAMM or other similar) knowledge/awareness & scanner/sectools deployment/take-up experienceSecurity tool hands on experience (fortify, qualys, protocode, sonarqube are a plus)Security certifications are a plusAbility to work in a globally matrixed and complex organizationGood presentation and speaking skillsJob level and compensation commensurate with experience and ability To apply: https://amadeus.contactrh.com/jobs/9064/26412327"}