{"jobID": "2824885968", "jobLocation": "San_Jose_CA", "jobTitle": "Employment Supervisor", "companyRating": null, "companyInfo": {"Website": "www.fredfinch.org", "Headquarters": "Oakland, CA", "Size": "201 to 500 employees", "Founded": " 1891", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Lincoln, Seneca Family of Agencies"}, "estimatedSalary": null, "jobDescription": " Job Summary:  The Employment Supervisor is responsible to ensure high quality and effective daily operations  of employment services. Duties include providing training (individual or group), supervision  (including field mentoring) of Employment Specialist staff, oversight of all phases of service  delivery and personnel management including hiring and evaluation. The phases of employment  services include: program intake, engagement, assessment, job development/job placement, job  coaching, and job retention supports. The Employment Supervisor provides leadership congruent  with applicable regulation and agency policy, values, and mission; provides management reports  as required; and manages to fidelity any evidence-based employment models used by FFYC to  deliver employment services. The Employment Supervisor also acts as a liaison to other  departments and agencies, and has responsibility for providing employment services for  participants in the program.  Essential Functions (Duties and Responsibilities):  Service Development: 1) Assumes responsibility for every aspect of the daily operations of the  program. 2) Encourages staff commitment to agency values of providing participant centered,  individualized, outcome driven, and strength-based services that are trauma informed and inclusive  of natural supports identified by the participant. 3) Establishes and utilizes mechanisms to assure  the quality of the services, including documentation, standards of practice, adherence to fidelity  for any evidenced based approaches, and compliance with external regulatory agencies and  funders. 4) Assumes responsibility for developing, implementing, and ensuring compliance with  eight program principles: Focus on Competitive Employment: staff are committed to competitive  employment as an attainable goal for people with serious mental illness seeking employment;  Eligibility Based on Client Choice: People are not excluded on the basis of readiness, diagnoses,  symptoms, substance use history, psychiatric hospitalizations, homelessness, level of disability, or  legal system involvement; Integration of Rehabilitation and Mental Health Services: IPS  programs are closely integrated with mental health treatment teams; Attention to Worker  Preferences: Services are based on each person?s preferences and choices, rather than providers?  judgments; Personalized Benefits Counseling: Employment specialists help people obtain  personalized, understandable, and accurate information about their Social Security, Medicaid, and  other government entitlements; Rapid Job Search: employment program uses a rapid job search  approach to help job seekers obtain jobs directly, rather than providing lengthy pre-employment  assessment, training and counseling. Systematic Job Development: Employment specialists  systematically visit employers, who are selected based on job seeker preferences, to learn about  their business needs and hiring preferences; Time-Unlimited and Individualized Support: Job  supports are individualized and continue for as long as each worker wants and needs the support.  5) Assumes responsibility for developing, implementing, and ensuring compliance with program  standards, including but not limited to: program enrollment, assessment, job development, job  retention/follow along planning and support, tracking of employer contacts, collection of  participant outcome data such as number of job starts and employment rate, employment staff  productivity, Medi-Cal, MHSA, and other vocational services best practice standards.  Community Development: 1) Acts as a liaison to other community service providers, especially  those that serve the TAY population. 2) Communicates regularly with mental health supervisors  to ensure that employment services are integrated with mental health services. 3) Facilitates  meetings as needed with other agencies and mental health teams to act as a proponent for  employment and to resolve any issues or challenges regarding integration. 4) Works with the  Department of Rehabilitation to coordinate services and communication regarding shared  participants. 5) Attends county oversight meetings or other meetings as assigned and works  collaboratively with county behavioral health staff and other relevant governmental agencies.  Supervision: 1) Assigns each Employment Specialist (ES) to mental health teams and participants.  2) Attends mental health treatment team meetings monthly to enhance integrated services. 3)  Provide weekly individual outcome-based supervision for each Employment Specialist focused on  setting individual employment services goals, reviewing of outcomes and goal attainment and  helping ES refine their skills to improve outcomes. 4) Provides frequent (weekly or every other  week) field mentoring especially for ES who are new to their jobs and/or ES?s with outcomes that  are not meeting expected program established outcomes targets. 5) Facilitates weekly group  supervision focused on discussion of cases as well as sharing job leads, strategies for participant  engagement, success stories and resources. 6) Encourages ES to utilize, whenever appropriate,  community resources and natural supports to assist with engaging participants in employment  services. 7) Facilitates monthly staff meeting to share program outcomes, status on maintaining  fidelity to evidence-based practices being employed (if applicable) and updates on program  operations (e.g. intake process, integration of ES with mental health teams, collaboration with  other providers such as DOR or benefits advocacy organization).  Program, and Agency Leadership: 1) Provides programmatic leadership to program team to  ensure highest quality of service for program participants. 2) Integrates best practices, fidelity and  regulatory (agency, local, state, and federal) compliance in all aspects of services, service  documentation and clinical record management. 3) Collects participant employment outcomes  monthly and shares outcomes for the program with the mental health teams, the Senior Director  and the Employment Services team. 4) Works with all program staff to ensure program attains  fiscal and contract outcomes. 5) Acts as agency emissary to build collaborative relationships with  community members and providers, mental health teams and county stakeholders. 6) Arranges for  program fidelity reviews and assists with the development of action plans based on  recommendations from the review. 7) Organizes, leads and/or participates in steering committee  meetings to help with employment services program implementation and sustainability.  Training: 1) Recruits, hires, coaches, and trains program staff; 2) Coordinates initial and ongoing  trainings in evidence-based practices and ensures competence and compliance of staff to  techniques being used and funder requirements; 3) Facilitates trainings and outreach with program  staff in the community as needed.  Compliance: 1) Maintains excellent professional boundaries and adheres to all professional  ethical standards including abuse reporting, maintenance of participant confidentiality and FFYC.  2) Adheres to all agency and program policies including Boundary Code of Ethics, Core  Competencies, Code of Conduct, Employee Handbook and state and federal regulations. 3) Ensure  adherence to fidelity for any evidenced based approaches used by the program.  Direct Services: 1) Provides supported employment services to a caseload of participants,  including all phases of employment services. 2) Responds to participant/family complaints and  suggestions.  Professional Development: 1) Participates in weekly supervision with Senior Director. 2)  Participates in trainings and provides training as assigned. 3) Participates in quality improvement  and peer reviews.  Documentation/Administrative Duties: 1) Responsible for ensuring supervisees meet all clinical  documentation standards. 2) Reviews all assessments (e.g. Career Profiles), Job Search Plans, Job  Start and End forms, job retention plans (e.g. Follow Along Support), progress notes, and reports  written by supervisees. 3) Adheres to administrative and employment services goals. 4) Prepares  all program and employment outcomes reports for submission to the funder(s) and others. 5)  Completes routine management reports and collects data on program activities and outcomes as  assigned.  Other Duties: 1) Other related duties as assigned. 2) Drives on agency business as required.  Qualifications  Required  1. Bachelor of Sciences in rehabilitation services or related field.  2. A minimum of one (1) year of supervisory experience.  3. Demonstrated cultural responsiveness in working with diverse participants, families  and communities.  4. Demonstrated experience of providing rehabilitation services to young adults.  5. Must have access to dependable transportation available and personal car insurance,  unless using agency vehicle.  6. Clean driving record, current CA Driver’s License or ability to obtain within 10 days  after hire.  7. Basic computer and keyboarding competence with the ability to use Microsoft Office  Suite.  Preferred  1. Master’s Degree in rehabilitation counseling  2. A minimum of one (1) year of supervisory or program manager experience.  3. Experience as a consumer of services: social services, mental health, residential  treatment or group home placements, foster care services, wraparound services,  community resources and educational services for youth with special needs.  4. Experience with or knowledge of implementing evidenced based programs.  5. Bilingual/bicultural and fluency in prevailing language(s) of the community.  6. One (1) or more years of experience with program target population (Example: young  adults living with a severe and persistent mental illness).  Physical Demands:  The physical demands and work environment described here are representative of those that must  be met by an employee to successfully perform the essential functions of this job. Reasonable  accommodations may be made to enable individuals to perform the essential functions. The noise  level in the work environment is usually quiet and, at all times is maintained within safe California  Division of Occupational Safety and Health (CAL/OSHA) standards.  Communication  1. Communicates clearly and effectively with co-workers, clinical staff, and youth.  2. Must be able to comprehend, follow, and clearly convey instructions to others.  3. Must be computer proficient and be able to work on a computer for up to 20 hours per  week.  Physical Activities  1. Must be able to handle or manipulate objects, tools, and operate controls.  2. Must be able to operate office equipment requiring repetitive hand movement and fine  coordination including use of a computer keyboard.  3. Must be able to reach for stacked items, store and retrieve file boxes.  4. Must be able to push, pull, lift and/or carry as much as 10 lbs.  5. Occasional travel for trainings may be required.  6. Must be licensed and have the ability and skill to drive a vehicle."}