{"jobID": "2602732113", "jobLocation": "Boston_MA", "jobTitle": "Research Data Analyst- Healthcare Disparities (FT, 40 hrs, Days)", "companyRating": "3.6", "companyInfo": {"Website": "www.bmc.org", "Headquarters": "Boston, MA", "Size": "1001 to 5000 employees", "Founded": " 1996", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": " Boston Medical Center (BMC) is more than a hospital. It´s a network of support and care that touches the lives of hundreds of thousands of people in need each year. It is the largest and busiest provider of trauma and emergency services in New England. Emphasizing community-based care, BMC is committed to providing consistently excellent and accessible health services to alland is the largest safety-net hospital in New England. The hospital is also the primary teaching affiliate of the nationally ranked Boston University School of Medicine (BUSM) and a founding partner of Boston HealthNet an integrated health care delivery systems that includes many community health centers. BMC provides a full range of pediatric and adult care services, from primary to family medicine to advanced specialty care.  BMC is also committed to our employees, who are a very important piece to who we are. We pride ourselves in providing equal employment opportunity and non-discrimination for all employees and qualified applicants without regard to a person's race, color, gender, age, religion, national origin, ancestry, disability, veteran status, genetic information, sexual orientation or any characteristic protected under applicable law. BMC will make reasonable accommodations for qualified individuals with known disabilities, in accordance with applicable law.  Our team's primary research is on evaluating impact of policy (health reform, ban on ambulance diversion) on disparities in healthcare use and outcomes, using a variety of large administrative data (Medicare, AHRQ state discharge data, Marketscan). The research team is multidisciplinary with clinicians, economists and other social scientists.  While the primary responsibility will be data processing and statistical analyses, we encourage wider participation in discussion of methods and findings, attending departmental research seminars, and developing new research questions. Our previous students have gone on to enroll in PhD programs. The department has a number of research assistants and analysts from all disciplines.Master's degree in Economics or Biostatistics, or a bachelor's degree plus at least 3 of years training and/or experience in a statistical or programming role involving health data. Experience with statistical programming languages (e.g. STATA, SAS, R) is required. Experience interacting with database environments (e.g. SQL, MS Access, Oracle) is preferred. Strong computer skills are essential (Excel/Word /Outlook/PowerPoint). Good communication skills. Ability to interpret and apply statistical techniques, and to explain methods and findings to non-statistician team members and audiences. Ability to set priorities while managing several projects simultaneously."}