{"jobID": "2795076762", "jobLocation": "Roseland_NJ", "jobTitle": "Transformation Leader/API Architect", "companyRating": null, "companyInfo": {"Website": "www.jsrtechconsulting.com"}, "estimatedSalary": null, "jobDescription": " JSR Tech Consulting, a national consultancy firm is seeking a Transformation Leader/Senior API Architect to join our client located in Roseland NJ or Iselin NJ for a Contract to Hire position. Travel to Shelton CT is required periodically. The selected API Architect will help create a comprehensive catalog of Public/Open APIs, through which our clients businesses can more rapidly engage in digital business opportunities with partners and customers as they arise. Specifically, we are looking for this role to: Decompose the Life and Annuities business models into core business capabilities (e.g. create an illustration, submit an application, change a beneficiary etc.)Define the fully digital equivalent of each core capability, expressed in the form of a public APIFor each API, identify any gaps in internal automation that will be exposed once the API is made publicly available, and partner with key architecture and delivery team partners to eliminate those gaps where necessaryIdentify the appropriate technology stack that should be used to build each APIIdentify foundational capabilities required to support the deployment and management of a Public API catalog, including but not limited to: API documentation and specifications (e.g. OAS), API security (e.g. JWT), API publishing and policy management (e.g. Apigee) etc Aligning the boundaries of APIs with core capability ‘building blocks’, this role will enable both us and our external partners to rapidly redeploy and/or re-compose services exposed through public APIs in new places and in new and differentiating ways. RequirementsExtensive experience in business capability modeling and business process decomposition, within the context of a large, multi-line corporation. Life and Annuity-specific experience preferred though not required.Able to articulate definitive steps involved in developing a public API catalog ‘from scratch’Two or more years’ experience defining & designing public APIs, using OAUTH / Web API / Open API specificationsDeep experience with solution architecture, working specifically with full stack solutions (.net, MEAN etc.), RESTful services, and large legacy application portfolios, in both monolithic and micro-services contextsExperience in designing a developer portal or API MarketplaceProven ability to articulate the value of foundational technology approaches to executives (e.g. the pros & cons of micro-services architectures in a given context)Solid understanding of modern data architectures (e.g. event driven architectures, data democratization, platform approaches to support ML/AI at scale, stream processing, etc)Demonstrated ability to own and nurture key relationships both up and downstream of the Architecture team to ensure delivery."}