{"jobID": "2817063012", "jobLocation": "Boston_MA", "jobTitle": "Business/Data Analyst-Consultant", "companyRating": null, "companyInfo": {"Website": "www.itstaffing.com", "Headquarters": "Norwell, MA", "Size": "501 to 1000 employees", "Founded": " 1980", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Kforce, Robert Half, TEKsystems"}, "estimatedSalary": null, "jobDescription": "Job Description / Purpose of Role: The candidate will be responsible for defining, planning and implementing technology solutions to achieve Securities Finance strategic and tactical directives and industry/regulatory mandates. The individual will be responsible for working with Business and Technology counterparts across global sites as a Business Analyst and use their knowledge of the business systems, industry, and system development lifecycle methodology to direct the execution of complex projects throughout their life cycle. Major Responsibilities:Lead business working sessions, interview end users, and perform system analysis to gather requirements.Drive the analysis of current processes and recommend solutions and improved processes; may provide counsel on impact of systems changes to business processes.Decompose abstract and complex details/concepts into business and functional requirements that can be understood by the stakeholders (i.e. end users, developers, testers, etc.)Document project requirements and other project related documents with clear and concise language consistent with methodology framework.Advocate for business area regarding system needs and requests. Negotiate with the various delivery teams to ensure solutions meet time to market and business needs.Work with the project team to develop and manage project plans including issue resolution and risk mitigationConsult with users, developers, testers, and implementation specialists.Direct the development of end user training plans, (business level) user acceptance test plans, and implementation plans; communicates to senior management and business representatives.Instruct, guide and supervise project team in the resolution of issues, risks and impediments.Partner with technology and business managers providing overall strategic leadership in developing and maintaining disciplined processes.Ensure governance with the project methodology standards, documentation, and approvals (e.g. project artifacts, tollgates, etc.)Manage participation from required stakeholders to ensure accurate deliverablesManage cross team dependencies with other business and IT areas.TCM is an EEO/Vets/Disabled Employer.Level of Education / Qualifications:Bachelor's degree in technology, finance, business or equivalent.Skills and Experience:At least 6+ years of related professional financial services and project management experience.High Level of proficiency in Microsoft Access, MS Office (including Project, EXCEL, Word, PowerPoint, and Visio) and SQL.Experience with market/settlement processes (e.g. Custody Services, Securities Finance/Lending).Background in software implementation in the Financial Services industry working as a Business Analyst and/or Product Owner.Experience with mainframe and open system (e.g. Java, Oracle) applications.Proven experience implementing financial systems using standardized SDLC methodologies and tools (e.g. AGILE).Experience working in an environment managing multiple, concurrent projects with shifting priorities, demands, and timelines.Excellent analytical, interpersonal and collaborative skills.Superior verbal and written communication skills, presentation and facilitation skills."}