{"jobID": "2667252147", "jobLocation": "San_Jose_CA", "jobTitle": "PICU RN", "companyRating": "3.9", "companyInfo": {"Website": "www.gshvin.org", "Headquarters": "Dayton, OH", "Size": "1001 to 5000 employees", "Founded": " 2001", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "51", "jobDescription": "About Good Samaritan HospitalGood Samaritan Hospital is a 474 bed acute care hospital in the heart of Silicon Valley, with two locations, the main campus in San Jose, California and the Mission Oaks campus in Los Gatos, California. Recognized nationally for quality and safety, it has an ‘A’ from The Leapfrog Group and has been voted a “Family Favorite” hospital for more than ten years. It is one of only ten hospitals nationwide to be awarded the Outstanding Achievement Award from the American College of Surgeons Commission on Cancer four consecutive times. Good Samaritan is a leader in neurosciences, high-risk obstetrics, advanced cardiology and innovative surgery techniques, and is a Joint Commission-certified Comprehensive Stroke Center and an accredited Chest Pain Center. The Pediatric Intensive Care Unit (PICU) Nursing team are dedicated, healthcare providers with excellent services for patients at Good Samaritan Hospital. Interested in joining this team? Apply online now.Schedule: 0.6 (24 hours per week) Shift: Nights with rotating weekendsGENERAL SUMMARY:Under general supervision, provides clinically competent professional nursing care.The Registered Nurse is responsible for patient assessment, development, implementation and coordination of the patients’ plan of care including the medical treatment plan and the evaluation of patient treatment. The Registered Nurse will function within the full scope of the RN licensure, according to the California Nursing Practice Act.The Registered Nurse has primary accountability for monitoring patient outcomes. As the team coordinator of the patient care team (including but not limited to: physicians, registered nurses, licensed vocational nurses, technicians, and support and clerical staff), the Registered Nurse collaborates, directs, delegates, assigns, guides and serves as a resource to the department and the patient care team for patient care delivery.The Registered Nurse promotes a cooperative working relationship with care team members, physicians, other disciplines and the public by facilitating and enhancing communication, displaying honesty and respect, displaying sensitivity to cultural and age differences, and expressing and accepting feedback in a professional manner.The Registered Nurse supports the mission, philosophy and goals of the Good Samaritan Hospital.MINIMUM KNOWLEDGE, SKILLS AND ABILITIES REQUIRED:1. Current California Registered Nurse License.2. Current Basic Cardiac Life Support (BLS) certification.3. Advanced Life Support (PALS) certification as required by specific hiring department criteria.MINIMUM EXPERIENCE:1. A Registered Nurse who has one (1) year of full-time equivalent or more prior PICU experience as a Registered Nurse.2. Ability to learn and utilize computerized patient care management system."}