{"jobID": "2633259757", "jobLocation": "Boston_MA", "jobTitle": "SaaS Sales Professional", "companyRating": null, "companyInfo": {"Website": "www.touchplan.io", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Autodesk, Oracle"}, "estimatedSalary": null, "jobDescription": "SaaS Sales Professional Touchplan® is seeking an experienced sales professional to join our team. The ideal candidate will have a proven track record exceeding quota and develop customer accounts in a fast-paced, high growth environment. Must be a self-starter with exceptional networking and customer acquisition skills, who thrives under pressure, and who knows how to close deals.Responsibilities:Become an expert in the value, benefits, features, and application of Touchplan®Build and maintain a strong sales pipeline to consistently meet or exceed quotaWork with Marketing to ensure consistent lead generation.Drive new sales by networking, sourcing, cold calling and converting leads into opportunitiesDefine success criteria and value propositions with each customerSchedule and deliver online product demonstrationsNegotiate and close sales ordersCreate groundswell and drive accounts for enterprise-wide salesRequirements:2-5 years of technology sales experience, preferably SaaS technologyExperience developing and maintaining customer relationships in a B2B environmentCommitted to operating with a sense of urgency and a positive winning attitudeExcellent writing / verbal communication skills to interact with prospects/customersProficient with Salesforce and Microsoft Office productsBachelor’s degree in a relevant fieldA Plus:AEC (architecture, engineering, construction) software sales experienceFamiliarity with construction management, architecture, engineering or project controlsExperience with Lean Construction or the Last Planner® system.Touchplan® is the best construction field planning and management SaaS tool for increasing your bottom line. Headquartered in Boston, MA, Touchplan serves everyone from Subcontractors, Superintendents, and Project Managers to Project Executives, Architects, and Owners for more than 15 years. By reducing overall project time, improving team communication, enabling smoother projects and implementing the Last Planner® System, Touchplan eases the pain of complex construction.For immediate consideration, please send your resume and cover letter to mnc@touchplan.io."}