{"jobID": "2808050666", "jobLocation": "Seattle_WA", "jobTitle": "Data Scientist - Inference - Entertainment and Media Industry Opportunity", "companyRating": "4.1", "companyInfo": {"Website": "www.airbnb.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "127000", "jobDescription": " Airbnb is a global platform that connects travelers and hosts from over 34,000 cities. At the backbone of this is a world class customer support team and the innovative technology that enables them. The Support Products team aims to provide personalized, on-demand support for our users to resolve their issues quickly, surface the most useful information at the right time, and enable Airbnb Support to scale with the growing business.We are looking for a strong data scientist to identify and execute scalable ways to improve the customer service experience and to take a scientific approach to decision making.  Examples of projects we currently need help with:  Design and execute controlled experiments to quantify the effects of both customer and agent-facing product changes.  Recommend relevant Help Center articles based on customer metadata.  Develop methodologies to determine whether a customer seeking help has successfully used our products to self-solve their issue.  Determine how to measure customer satisfaction of interactions with our products and/or agents, and quantify how these metrics affect customer lifetime value.  Understanding how to efficiently utilize call waiting time when customers phone in.  We have a strong team of Data Scientists, our work is highly sought-after, and our impact on the business is tremendous. If you have a proven background in this field and are excited to help build Airbnbs community, we want to hear from you.  Here are some examples of traits we value:  A passion for Airbnbs mission of helping people Belong Anywhere  Ability to write clean and concise code, especially in R or Python  3+ years in industry experience and a Master's degree in a quantitative field; PhD is a plus  Solid understanding of statistics  Keen eye for detail and thoughtful investigation of data before relying upon it  Intuition for data science best practices, stemming from proven experience  Steadfast focus on creating impactful change  Ability to partner with cross-functional teams using strong written and verbal communication."}