{"jobID": "2831086730", "jobLocation": "New_York_NY", "jobTitle": "Executive Assistant", "companyRating": null, "companyInfo": {}, "estimatedSalary": "55000", "jobDescription": "Executive Assistant Job Responsibilities:  Prominent high-profile non-profit looking for a competent Executive Assistant to provide personalized administrative support and assistance to executive staff in a well-organized and timely manner.  Responsibilities may include:  -  Answering and managing incoming calls, taking messages  -  Acting as the point of contact between the executives and internal/external constituencies  -  Recording, transcribing and distributing minutes of meetings  -  Conserving executive's time by reading, researching, and routing correspondence, drafting letters and documents, initiating telecommunications  -  Managing and maintaining executive's appointment schedule by planning, coordinating and scheduling meetings, conferences, teleconferences, and travel Preparing reports and financial data  -  Welcoming guests by greeting them, in person or on the telephone, answering or directing inquiries.  -  Developing and utilizing an efficient filing and retrieval system  -  Producing reports, presentations and briefs  -  Occasional out of office assignments during the work week for special events  -  Handling requests and queries appropriately  -  Interacting with external clients  -  Liaising with internal staff  -  Monitoring office supplies and researching advantageous deals or suppliers  -  Coordinating project-based work  -  Reviewing operating practices and implementing improvements where appropriate  -  Maintaining member confidence and protecting operations by keeping information confidential  -  Securing information by completing database backups  -  Contributing to team effort by accomplishing related results as needed Executive Assistant Skills and Qualifications:  The position requires:  -  Strong organizational skills that reflect the ability to perform and prioritize multiple tasks seamlessly with excellent attention to detail  -  Excellent interpersonal skills and the ability to build relationships and to work well with stakeholders, all levels of internal management and staff, board members and external partners  -  Proven ability to handle confidential information with discretion, be adaptable to various competing demands, and demonstrate the highest level of customer/client service and response  -  Proven experience as an executive administrative assistant, senior executive assistant or in other secretarial position  -  Full comprehension of office management systems and procedures  -  Excellent knowledge of MS Office  -  Proficiency in English  -  Problem analysis and problem solving skills  -  Demonstrated proactive approaches to problem-solving with strong decision-making capability  -  Initiative  -  Attention to detail and accuracy  -  Adaptability  -  High level verbal and written communications skills  -  Exemplary planning and time management skills  -  Ability to multitask and prioritize daily workload  -  Emotional maturity  -  Highly resourceful team-player, with the ability to also be extremely effective independently  -  Demonstrated ability to achieve high performance goals and meet deadlines  -  Forward-looking thinker, who actively seeks opportunities and proposes solutions Education and Experience Requirements Bachelor's degree an advantage. Strong work tenure of at least three (3) years of experience supporting executives. Proficient in Microsoft Office (Outlook, Word, Excel, and Power Point), Adobe Acrobat, and Social Media web platforms. Proficient computer skills and in-depth knowledge of relevant software such as MS Office Suite. Knowledge of standard office administrative practices and procedures  We are an equal opportunity, affirmative action, and veteran-friendly employer. We encourage qualified persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law to apply. We make reasonable accommodations for qualified applicants with disabilities.  Nothing in this job posting should be construed as an offer or guarantee of employment."}