{"jobID": "2678141966", "jobLocation": "Cupertino_CA", "jobTitle": "Account Manager", "companyRating": null, "companyInfo": {"Website": "www.huawei.com", "Headquarters": "Shenzhen, China", "Size": "10000+ employees", "Founded": " 1987", "Type": " Company - Private", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " Ericsson-Worldwide, Cisco Systems, Apple"}, "estimatedSalary": null, "jobDescription": "Huawei is a leading global information and communications technology (ICT) solutions provider. Through our dedication to customer-centric innovation and strong partnerships, we have established end-to-end advantages in telecom networks, devices and cloud computing. We are committed to creating maximum value for telecom operators, enterprises and consumers by providing competitive solutions and services. Our products and solutions have been deployed in over 170 countries, serving more than one third of the world’s population. Huawei has over 180,000 employees, approximately 80,000 of which are engaged in Research & development. Huawei operates a global network of 12 regional headquarters, 14 R&D; Centers, 36 Innovation Centers jointly operated with customers, and 45 Training Centers. Huawei is leading the way by rethinking the future. From devices to telecom infrastructure to cloud computing and convergence solutions, we are rethinking every link in the chain with ICT based innovation to deliver a better future...faster. Account Manager Location: Cupertino, CA (Enterprise) Req #: 9314 # of Openings: 1 DescriptionResponsibilities: Independently develop accounts in his/her territory and follow the LTC process.Knowing the Semi conductor market including EDA industry and chipset design industry.Develop enterprise customer or channel partnersHas knowledge of IT solution, such as Server, Storage, Cloud and NetworkingOut going personality, aggressive for success, eager for sales credit. Requirements: Min. 3 years sales experience in semi conductor industryResult driven, strong relationship building with a track record of sales successHuawei Inc. is proud to be an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Why work for us?In 2017, Huawei's revenue reached CNY600 billion (US$92 billion based on the year-end exchange rate), an increase of 15% (YOY)We invest in engineering and innovation - 80,000+ of our 180,000+ global employees work in R&D;, and we invest roughly 10% of our annual revenue in to R&D.; U.S. R&D; efforts are carried out by Futurewei Technologies, Inc.Futurewei’s commitment to R&D; is a major reason why Huawei holds one of the largest patent portfolio’s in the world: Since 2008, Huawei has been a top five international patent filer, per the World Intellectual Property Organization.We support green energy - Lowered CO2 emissions by 13,000 tons via Huawei’s green packaging solutionsFuturewei works with leading universities to further R&D; efforts, investing more than $10million USD each year to support programs at Harvard, MIT, Stanford and Yale, among others. Are you a returning applicant?Previous Applicants:Email:Password: If you do not remember your password click here. Back to Search Results New SearchCopyright © Huawei Technologies Co., Ltd. 1998-2017. All rights reserved."}