{"jobID": "2811221464", "jobLocation": "Campbell_CA", "jobTitle": "Assistant Kitchen Manager", "companyRating": "3.7", "companyInfo": {"Website": "www.burgerlounge.com", "Headquarters": "San Diego, CA", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Restaurants, Bars & Food Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "28000", "jobDescription": " Burger Lounge is accepting applications for the Assistant Kitchen Manager position for our BRAND NEW Campbell location.The AKM's primary area of focus is supporting the KM and ensuring all food items are prepared to company standards and are completed in a timely manner. AKM's are \"multi-tasking experts\" who remain calm under pressure and are able to coach and motivate in busy times. They oversee all food preparation and ensure all modifications are executed well. AKM's will be responsible for placing any orders when the KM is off or on PTO. AKM's ensure kitchens are always clean and safe. The work schedule fluctuates based on business need requiring employees to work days, nights, weekends and holidays. QUALIFICATIONS• Minimum of 3 years recent experience in a fast-paced kitchen environment. • Ability to remain calm under pressure and fast-paced environment.• Reliable transportation and ability to arrive to work on time and maintain a positive attendance record. • Ability to work a flexible schedule, including weekends and evenings.• Good communication, organization, and interpersonal skills to establish and maintain effective working relationships.• Current Food Handlers Card.COMPANY PERKSAs a member of the Burger Lounge team, you can expect to enjoy: • Competitive pay DOE- paid bi-weekly (every other Friday)• Comprehensive benefits package offered after 60 days at a fair cost (Medical, Dental, Vision, Life, Long term disability) • Opportunities for career advancement. We are growing, and we want you to grow with us.• Education reimbursement (up to $1000/year)• Free Shift Meal + Discounts Burger Lounge is proud to be an Equal Opportunity Employer, and participates in E-Verify. These positions would also be subject to a criminal background check. For more information on our company, please visit burgerlounge.com"}