{"jobID": "2822790278", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.capitalgroup.com", "Headquarters": "Los Angeles, CA", "Size": "5001 to 10000 employees", "Founded": " 1931", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": "Req ID: 16522 Experience Level: Professional Other Location(s): N/A Relocation offered: Yes Travel required: None Come grow with us At Capital Group, how we work is defined by shared values that include absolute integrity, respect and collaboration. But it’s more than that. It’s smart and highly driven people united in purpose to serve our investors and one another.  Bring your energy and unique perspective to Capital and you’ll have the opportunity to grow with us professionally, personally, and financially. You’ll be part of a team that genuinely cares about helping you succeed. You’ll work alongside talented colleagues, many of whom build long careers while progressing through multiple roles, establishing lifelong friendships and making a difference in our communities. In return for your contributions, you’ll receive premier compensation and benefits, and a company-funded retirement plan that ranks among the most generous.  Information Management is a department within Capital Group’s Investment Operations with focus on defining Capital Group's investment data strategy to establish a comprehensive set of data capabilities. Our Data Strategy and Operations team is focused on implementing and evolving Capital Group's investment data strategy to enable the full range of business objectives; data for minimizing risk, data for efficient processes, and data for growth and innovation. It also delivers a set of capabilities to source, automate, and curate data assets to enable and enrich core investment and distribution processes, quantitative analytics, reporting and analysis, and advanced analytic efforts such as artificial intelligence.  As a Data Solutions Analyst based in Los Angeles, you will partner with different facets of the business to develop solutions that source, structure, curate, and visualize data to enable business operations, insights, and advanced analytics. Responsibilities: • Identify opportunities to improve data-use within business processes  • Strengthen existing partnerships with IT and other business units to develop and deliver enterprise-scale solutions that extract, transform, and integrate investment data from different data sources  • Design and build business-developed technical solutions in support of data delivery, data enablement, automation, or self-service  • Leverage the analytics workbench to develop solutions that source, transform, enrich, validate, and load investment management data  • Provide requirements and user-acceptance testing for large-scale IT solutions  • Recognize and adopt best practices in data automation: data integrity, test design, analysis, validations, and documentation Qualifications: • 2+ years of experience with business intelligence, reporting, and data transformation  • Bachelor's degree required  • Advanced knowledge of SQL required  • Proficient with technical and functional designs for databases, ETL, data warehousing, and reporting  • Proficient with scripting tools for automation such as R, Python, Alteryx, etc.  • Proficient with reporting/data visualization tools such as Tableau, SSRS, etc. Company Overview: Founded in 1931, Capital Group is one of the world’s largest and most trusted investment management companies and home to the American Funds. We manage more than US$1.39 trillion in assets, and our 7,500 associates make our clients their first priority every day. When we do our job right, millions of investors around the world fulfill their dreams and financial goals, from home ownership and higher education, to a comfortable retirement. Our long-term investment results and outstanding service set us apart from our competitors, while our workplace sets us apart from other employers. We are an equal opportunity employer, which means we comply with all federal, state and local laws that prohibit discrimination when making all decisions about employment. As equal opportunity employers, our policies prohibit unlawful discrimination on the basis of race, religion, color, national origin, ancestry, sex (including gender and gender identity), pregnancy, childbirth and related medical conditions, age, physical or mental disability, medical condition, genetic information, marital status, sexual orientation, citizenship status, AIDS/HIV status, political activities or affiliations, military or veteran status, status as a victim of domestic violence, assault or stalking or any other characteristic protected by federal, state or local law."}