{"jobID": "2723095185", "jobLocation": "Sunnyvale_CA", "jobTitle": "Data Analyst, Trust and Safety", "companyRating": "4.4", "companyInfo": {"Website": "www.google.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (GOOG) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Apple, Facebook"}, "estimatedSalary": "106000", "jobDescription": "Google's brand is only as strong as our users' trust--and their steadfast belief that our guiding principles are what's best for them. Our Trust and Safety team has the critical responsibility of protecting Google's users by ensuring online safety by fighting web abuse and fraud across Google products. On this team, you're a big-picture thinker and strategic leader. You understand the user's point of view and are passionate about using your combined technical, sales and customer service acumen to protect our users. You work globally and cross-functionally with Google developers and Product Managers to navigate challenging online safety situations and handle abuse and fraud cases at Google speed (read: fast!). Help us prove that quality on the Internet trumps all.  As a Trust and Safety Strategist, you are responsible for protecting the integrity of some of Google's key products, including Google Search, Google Maps, AdWords, Adsense, Google Checkout and Google Product Search. You investigate financial fraud, account-related abuse, questionable business practices, violations of Google's policies, and general misuse of our products. You are introduced to dynamic analytical techniques and you leverage custom-built technology to have a direct impact on improving the experience of millions of Google users. You subscribe to a \"user-first\" philosophy and are interested in improving Google's user experience and product integrity. You are comfortable navigating ambiguity and thrive in a fast-paced environment. You harness your analytical and technical skills to drive tool development and process improvements.  At Google we work hard to earn our users’ trust every day. Gaining and retaining this trust is critically important to Google’s success. We defend Google's integrity by fighting spam, fraud and abuse, and develop and communicate state-of-the-art product policies. The Trust and Safety team reduces risk and protects the experience of our users and business partners in more than 40 languages and across Google's expanding base of products. We work with a variety of teams from Engineering to Legal, Public Policy and Sales Engineering to set policies and combat fraud and abuse in a scalable way, often with an eye to finding industry-wide solutions. Trust and Safety team members are motivated to find innovative solutions, and use technical know-how, user insights and proactive communication to pursue the highest possible quality and safety standards for users across Google products. Responsibilities Perform statistical analyses on huge data sets to determine trends and develop business insights in order to protect Google’s users.Utilize machine learning to scale, and optimize and automate our abuse fighting efforts.Assist with designing and building infrastructure to facilitate analysis and experimentation.Develop metrics for measuring and understanding Google’s effectiveness at combating fraud. Conduct investigations into sophisticated forms of abuse, take action on fraudsters and close attack vectors.Translate business needs into data modeling initiatives and work with engineers to put predictive models into production. Qualifications Minimum qualifications:"}