{"jobID": "2664574541", "jobLocation": "Seattle_WA", "jobTitle": "Principal Data Scientist (Catalog Platform and Quality)", "companyRating": "3.7", "companyInfo": {"Website": "www.coupang.com", "Headquarters": "Seoul, South Korea", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "146000", "jobDescription": "Coupang is one of the largest and fastest growing e-commerce platforms on the planet. Our mission is to create a world in which Customers ask How did I ever live without Coupang?We are looking for passionate builders to help us get there. Powered by world-class technology and operations, we have set out to transform the end-to-end Customer experience -- from revolutionizing last-mile delivery to rethinking how Customers search and discover on a truly mobile-first platform. We have been named one of the 50 Smartest Companies in the World by MIT Technology Review and 30 Global Game Changers by Forbes.  Coupang is a global company with offices in Beijing, Los Angeles, Seattle, Seoul, Shanghai, and Silicon Valley.  ________________________________________  Our goal is to build the best e-commerce experience for our customers. We get millions of products from sellers and we want to build a consistent experience by automatically detecting features from catalog, and enriching the catalog with structured information. We use machine learning to develop models to extract missing data from text, detect inaccuracies and fix them automatically. We strive to build efficient workflows allowing humans to apply their judgment only when necessary.  On a daily basis, we solve problems from different kinds product categories ranging from cellphone cases to fashion, consume various sources of data such as catalog, reviews, views etc. to continually enhance the catalog.And we do all of this at scale that is growing at a rapid pace.  As a data scientist you will use your knowledge to build algorithms that help us with automatic understanding of text (NLP/Information extraction), and robust scalable and maintainable machine learning models. You will bring scientific rigour to problem solving and provide key inputs to business and engineering teams on overall strategy for catalog. You will work with our top engineers to put your solutions into production systems that impact how our customers shop.  Responsibilities:  Extract product data from unstructured data by designing and testing new algorithms and techniques, thereby improving discovery of products.  Analyze large amounts of data to discover patterns and build robust models to extract valuable information from various sources (e.g. product catalog, customer reviews, clicks etc.) that vary in quality of data and structure.  Automatically classify products into customer facing category with high accuracy.  Normalize variations (by language and spelling) for attributes like as brand, size or color.  Identify products that are identical or similar from millions of incoming selection of products.  Identify illegal products that are not allowed on the website.  Define product information that is important for customer experience.  You will put such algorithms and techniques to improve what customer sees on website, resolving many use cases automatically and identify cases that need inputs from catalog experts.  You will help improve customer experience on the website by enabling them to see high quality data for products, discover items that are not otherwise visible and help merchants to improve their business.  Requirements:  Masters degree in Computer Science (Machine learning, data mining, information retrieval), Statistics or related field.  2+ years of experience in machine learning, data mining, big data  Good working knowledge of R/Python/Tensorflow/Keras  Experience with distributed frameworks like Spark/MapReduce/Hadoop.  Excellent problem solving skills with out of box solutions.  Ability to decompose informal business problems into problem statements and build solutions.  Preferred:  Ph.D degree in Computer Science (Machine learning, data mining, information retrieval), Statistics or related field.  Proven practical experience in machine learning, data mining or statistics with track record of publications.  Desire to guide junior engineers and data scientists.  Strong verbal and written communication skills. Perks:Autonomy to make decisions in a rapidly growing companyFree medical, dental, and vision insurance18 days PTO + 12 national holidays off401K matchingPre-IPO stock optionsMobile & fitness reimbursementFlexible working hours It is the policy of Coupang Global LLC to afford equal opportunity for employment to all individuals regardless of race, color, age, national origin, physical or mental disability, history of disability, ancestry, citizenship status, political affiliation, religion, gender, transgender, gender identity, marital status, status as a parent, sexual orientation, veteran status, genetic information or other factors prohibited by law, and to prohibit harassment or retaliation based on any of these factors."}