{"jobID": "2341119502", "jobLocation": "San_Francisco_CA", "jobTitle": "Contingent: Digital Analytic Lead", "companyRating": null, "companyInfo": {"Website": "www.firstrepublic.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 1985", "Type": " Company - Public (FRC) ", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Silicon Valley Bank, City National Bank (Texas)"}, "estimatedSalary": null, "jobDescription": " Overview First Republic is an ultra-high-touch bank that provides extraordinary client service. We believe that one-on-one interactions build lasting relationships. We move quickly to serve our clients’ needs so that their financial transactions are handled with ease and efficiency. Client trust and security are paramount in our line of business. Ultimately, our goal is unsurpassed client satisfaction which will lead to personal referrals – our number one source of new business. We recognize that our competitive advantage starts with our people and our culture. At First Republic, we work hard and move quickly as a very coordinated team. If you are looking for an opportunity to grow and contribute in a fun, fast-paced environment, First Republic is the place for you. We have exceptional people focused on providing extraordinary service.As a Digital Technology Client Identity Developer , you'll be responsible for understand the requirement, analysis , design and implementing Client Identity Management Solution for Online Banking Single Sign-on solution and client portal integration . In depth knowledge and expertise with Identity Management System implementation, SAML SSO integration, Java/J2EE development best practices, spring framework and REST services in Linux infrastructure will be necessary to succeed in this role. Responsibilities Establish and maintain strong business partnership with the Digital Channel team and Private Wealth team.Learn and implement common practices and trends for digital initiatives.Service new and exiting client needs, to includes support the performance optimization, software updates, disaster recover and application migrations, problem management around anticipated traffic surges.Build an integrated solutions across digital platform, including internal systems as well as external 3rd party hosted systems.Client IDMS design and implementation.Lead vendor single sign-on design and implementation.Lead and participate in new development projects through the entire SDLC, including requirements, design, version control, development, testing, release, delivery/launch and maintenance.Create and maintain a strong working relationship with multiple business teams, technology teams and key vendors.Understand business changes and analyze impact on the change.Keeping up-to-date on new technology, standards, protocols and tools in areas relevant to rapid changing digital environment.Support Customer Conversion/migration activities.Perform duties and responsibilities specific to department functions and activities.Performs other duties and responsibilities as required or assigned by supervisor.Responsibilities include the following:adhering to and complying with all applicable, federal and state laws, regulations and guidance, including those related to Anti-Money Laundering (i.e. Bank Secrecy Act, USA PATRIOT Act, etc.),adhering to Bank policies and procedures,completing required training,identifying and reporting potential suspicious activity to the BSA/AML Officer, andknowing and verifying the identity of any customer(s) that enters into a relationship with the Bank. Qualifications Requires a minimum of 5 or more years professional experience in software development specially including online and mobile app delivery; preferably 3 or more years related to online/portal product deliver to external clients.Requires strong communication skills and track record of partnership across organizations.Requires working knowledge of Identity Management System Integration.Requires experience working with vendors to deliver integrated solutions to external clients (integration across a mix of internal and external 3rd party systems).Desired: In depth experience in Web development and integrated solution using REST or SOAP services.Desired: Security standards and protocol SAML, OAuth, OpenID for web security integration.Desired: Junit, Jenkins, TFS/CVS, Jira, SOAPUI.Desired: 4+ years J2EE Web Development.Undergraduate degree is required, preferably in a technical discipline.Team player.Provides extraordinary service.Furthers the First Republic Bank culture and values.MENTAL/PHYSICAL REQUIREMENTS: The ability to learn and comprehend basic instructions; understand the meanings of words and respond effectively; and perform basic arithmetic accurately and quickly.Vision must be sufficient to read data reports, manuals and computer screens.Hearing must be sufficient to understand a conversation at a normal volume, including telephone calls and in person. Speech must be coherent to clearly convey or exchange information, including the giving and receiving of assignments and/or directions.Position involves sitting most of the time, but may involve walking or standing for brief periods of time.Must be able to travel in a limited capacity."}