{"jobID": "2738696617", "jobLocation": "Boston_MA", "jobTitle": "PhD Intern Research Scientist - ML/NLP", "companyRating": "1.9", "companyInfo": {"Website": "global.rakuten.com/corp", "Headquarters": "Tokyo, Japan", "Size": "10000+ employees", "Founded": " 1997", "Type": " Company - Public (4755) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " eBay, Amazon, Yahoo"}, "estimatedSalary": "78000", "jobDescription": "Rakuten, Inc. is the  largest e-commerce company in Japan, and third largest e-commerce marketplace  worldwide. We seek to  empower merchants to deliver Omotenashi, a hospitality mindset, which helps  sellers create lasting relationships with customers. The Japanese word \"Rakuten\" means optimism.  Along with the global marketplaces, Rakuten supports an ever expanding list of  acquisitions and strategic investments in disruptive industries and growing  markets.  Rakuten Institute of Technology (RIT) http://rit.rakuten.co.jp/ is the corporate R&D; department of the Rakuten group and is responsible for leading strategic technological progress. RIT’s targets vary from basic technologies to innovative new services. RIT consists of highly motivated research scientists located in Tokyo, NYC, Paris, and Boston who are driven by strong curiosity and interests.  RIT-Boston is calling for Intern Research Scientists. As an intern,  you will get to work on challenging projects with experts in ML and  NLP. Some of the research projects can involve topic modeling,  recommendation systems, deep learning, discriminative learning, structured  predictions, belief propagation for dynamic networks, virtual assistants,  parsing, machine translation, etc. Responsibilities:Propose visions for services and technology modelsCreate  prototypes that can be commercialized in 1 to 3 yearsCreate  core components for our services (engines, frameworks and libraries)Publish  your research and file patentsQualifications:PhD graduate or a PhD student in computer science or a  related fieldResearch  experience in machine learning (classification, regression, clustering,  recommendation and content personalization) or data miningProgramming  in C/C++, Java, Python, or RubyAcademic  publication at peer-reviewed international conferences and in journalsPreferred Qualifications:Background in big-data computation, such as, Hadoop,  Hive, etcExperience  with AWS platformExperience  with deep-learning algorithms and systemsTo Recruiting Agencies:Recruiters and/or agencies must hold a valid contract for service and  obtain approval from Rakuten's Global Human Resources Department on an  individual requisition basis in order to submit resumes. Rakuten will NOT bear  any costs for any placement resulting from the receipt of an unsolicited resume  and (Rakuten) reserves the right to pursue and hire the candidate without any  financial responsibility to the recruiter or agency."}