{"jobID": "2795164121", "jobLocation": "Boston_MA", "jobTitle": "User Experience Designer Intern", "companyRating": "2.5", "companyInfo": {"Website": "www.nanthealth.com", "Headquarters": "Culver City, CA", "Size": "501 to 1000 employees", "Founded": " 2014", "Type": " Company - Public (NH) ", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "53000", "jobDescription": "User Experience Design InternDescriptionNantHealth is looking for a User Experience (UX) Design intern/co-op who will have the opportunity to work with a trend-setting team on NantHealths many software solutions/products. He/she will work with UX designers, researchers, and visual designers, getting exposure to several disciplines in the design industry. Other collaborators include: product managers, software engineers, information developers, and marketing analysts. The internship will go from July through December, and is located in NantHeath's Boston offices.The BasicsWork closely with UX partners and product managers to ideate and define.Create low, medium, and high-fidelity prototypes.Help conduct user-research, field studies and compile research data for presentation.Produce quality design that accurately reflect a visual design language or brand guideline.Working with typography, color, grid, and composition, demonstrate best practices for pixel-perfect production considerations and methods.Produce and test interaction flows and mock-ups that accurately communicate product functionality to the UX team, product, and engineering.What You BringAs member of the UX team you will be expected to bring fresh perspective and creativity focusing on our users and their specific needs improving their experiences and the quality of our products.Minimum QualificationsCumulative GPA 3.0/4.0.Currently pursuing a BA/BS degree in graphic design, human-computer interaction, computer science, or related field.Currently enrolled in a full-time degree program and returning to the program after (or during) this internship.A design portfolio that demonstrates design principles for web and/or mobile platforms.Preferred QualificationsSome experience with design tools (e.g. Axure, Sketch, Illustrator, Adobe Photoshop, After Effects, Quartz Composer, Framer Studio, etc.).Ability to apply brand visual assets in a user interface context and understanding of user-centered design principles.Solid analytical, creative, and visual thinker with excellent communication skills.Understand modern web and/or mobile environments such as HTML, CSS, JavaScript, Android UI, and iOS UI.NantHealth, Inc. is a next-generation, evidence-based, personalized healthcare company enabling improved patient outcomes and more effective treatment decisions for critical illnesses. NantHealths unique systems-based approach to personalized healthcare integrates novel diagnostics with large-scale, biometric and phenotypic data to track patient outcomes and deliver precision medicine.  Thank you for your interest in pursuing a career at NantHealth. NantHealth is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to their race, color, religion, ancestry, national origin, sex, sexual orientation, age, disability, marital status, domestic partner status, or medical condition.  This job description is intended to describe the general nature and level of work being performed by the person assigned to this position. The primary duties and responsibilities are intended to describe those functions that are essential to the performance of this job. This job description does not state or imply that the above are the only duties and responsibilities assigned to this position. There are other duties and responsibilities that are considered incidental or secondary to the overall purpose of this job. Employees holding this position will be required to perform any other job-related duties as requested by management. All requirements are subject to possible modification to reasonably accommodate individuals with a disability."}