{"jobID": "2811244291", "jobLocation": "New_York_NY", "jobTitle": "General Manager", "companyRating": "3.2", "companyInfo": {"Website": "www.car2go.com", "Headquarters": "Austin, TX", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Transportation & Logistics", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "80000", "jobDescription": "We’re car2go car2go began as a radical  idea at Daimler, the company that invented the automobile and operates Mercedes-Benz.  Today, we are the world’s largest, fastest-growing carsharing service, helping  our members in North America, Europe, and China get to where they want go  through instant, affordable mobility. With a fearless attitude and a focus on  member happiness, we helped create the sharing economy by disrupting the status  quo. We may have well over two million members, but we still exude the scrappy,  passionate attitude that got us here. Our Family The best work happens  when smart people rally around a common purpose. At car2go, we’re shaping the  future of mobility, and we do that as a team. We help each other out. We don’t  take ourselves too seriously. We know that the best ideas can come from  anywhere. And we believe great cultures start with great people who trust one  another to do great work. The Opportunity The General Manager is  responsible for the development and growth of the car2go business in their  respective city. They directly oversee local business development, stakeholder  relations and negotiations and parking management. They will directly manage  one employee, the Location Specialist. The General Manager will also work  closely with HQ departments to ensure success within Fleet, Operations, and  Marketing to ultimately drive usage, revenue, and membership. Your Impact Daily Responsibilities  Include: Responsible for forging partnerships and  relationships with local businesses, including establishment of corporate  accounts and engagement with local transportation and business groups.Manage day-to-day communication and collaboration  with external stakeholders, including city and state stakeholders, parking  providers and employee sourcing providers.Responsible for acting as “face” of the company  at the location and participating in interviews, conferences and panel discussions  to further brand presence in the market.Direct 1 fulltime employee, including  performance management, building/ maintaining engagement, and fostering an  environment of open communication.Responsible for articulating company vision and  key objectives to team members and creating individually-tailored functions and  projects to accomplish these goals.Review, verify, and approve location invoices  and spends. Weekly Responsibilities  Include: Participate in weekly or bi-weekly calls with  Regional Director and other General Managers, reviewing prior week’s events and  accomplishments, best practices at the location and any other relevant  discussion topics.Prepare weekly reports that highlight major  accomplishments from past week, as well as progress on larger-scale projects.  Reporting also includes analysis of weekly revenue/rental/usage/membership  statistics and significant patterns or trends. Also highlight areas of concern  that may require additional assistance from HQ or Germany.Host weekly meetings with employees to review  current/previous week’s progress and obstacles, location KPIs and goal tracking  and achievements.Allocate necessary funds to individual vendor  PRs.Review annual spend and present updates to HQ  management as needed.Perform any/all necessary departmental audits. Monthly and Ongoing  Responsibilities Include: Lead management of city stakeholders (Department  of Transportation/Public Works/Mayor’s Office/Airport Authority), in  collaboration with Regional Directors and Business Development Managers.Foster and oversee all community engagement  activities (neighborhood group meetings, transportation focused community  groups, attending/presenting at local conferences, etc.).Manage all external parking providers, including  providing monthly reports, contract negotiations and vendor relations.Assist in the creation, development and  implementation of location P & L– including revenue/EBIT projections and  fulfillment of location goals.Participate in Monthly P&L; Review meeting  and analyze location P & L. Identify areas for cost containment and revenue  generation in immediate and near-term future and execute on agreed-upon ideas.Review and analyze monthly ticket tow report  to understand patterns/trends on where we receive bulk or majority of tickets  tows and devise solutions to ameliorate major problem areas and reduce costs.Review, monitor and audit overall work  performance by third-party contract fleet vendor. Based on analysis, recommend  changes to fleet management.Oversee ongoing training and/or career  development for direct reports.Potentially participate in completion of any large-scale fleet projects, including:"}