{"jobID": "2806729670", "jobLocation": "Cambridge_MA", "jobTitle": "Product Data Analyst", "companyRating": "4.3", "companyInfo": {"Website": "www.cargurus.com", "Headquarters": "Cambridge, MA", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Public (CARG) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "77000", "jobDescription": " Meet CarGurusthe #1 visited online car shopping website in the US. At CarGurus, were building the worlds most trusted and transparent automotive marketplace where its easy to find great deals from top-rated dealers.  Founded in 2006 by Langley Steinert (co-founder of TripAdvisor), CarGurus is a technology company with a passion for data and its power to simplify every aspect of the car shopping experience. Using proprietary technology, search algorithms and innovative data analytics, we provide unbiased validation on pricing, dealer reputation and vehicle history.  CarGurus Product Management team is looking for Data Analysts across a range of experience levels to join our new Revenue Optimization and Analytics team. We are looking for strong technical skills to spearhead data analysis supporting the overall product and business strategy. The candidate will be excited to work with business intelligence tools, a variety of analytics techniques and analyzing complex data to arrive at insightful conclusions. We want people to drive business decisions and product development priorities.  The candidate must be comfortable working cross-functionally with many departments and stakeholders to solve shared business problems. The candidate must be a self-starter, multi-tasker and work well under pressure to meet ongoing and overlapping deadlines within short time constraints. Successful individuals in this role will crave empowerment and ownership, have exceptionally high intellectual curiosity and have the tenacity to overcome hurdles on the road to creating better business solutions What Youll Do:Partner with the product, engineering, marketing, sales, and finance departments to grow our business including recommending and advocating for performance improvement ideas to cross-functional stakeholdersDesign and analyze A/B tests to validate your ideas and hypothesesCreate business intelligence dashboards and data visualization tools to track product performance and cross-functional business objectivesConduct ad hoc data mining and analysis to better understand performance of existing product features and opportunities for new product offeringsSupport Analytics Engineering in maintaining a KPI dictionary, data integrity and single source of truth across multiple internal databases and reporting systemsBe a voice and advocate for using data to improve the quality of our decision makingSupport and influence CarGurus Analytics Guild which is a community of analysts and analytics engineers across the company charged with democratizing dataEnsure efficient and accurate reporting systems and data management platforms that scale with the businessIntegrate analysis across disparate data sources including website usage, consumer and dealer behavior patterns and customer insightsPresent data analysis, visualizations, and insights to key stakeholdersWho You Are:Bachelors degree or equivalent required; Masters in a related field preferred (e.g. Economics, Math, Statistics, or Computer Science)2 to 10 years of experience in data analysisAdvanced level knowledge of SQL and database structures requiredProficiency in data analysis tools (e.g., Python, R)Strong statistical knowledge including a working understanding of confidence intervals, test sample sizes, various forms of regression and clustering analysesKnowledge of BI and reporting tools or demonstrated ability in getting up to speed on new tools (e.g. Looker, Tableau, or similar business intelligence tools)Ability to work independently and in a cross-functional settingFamiliarity with web and mobile analytics datasets and A/B testing methodologiesExcellent verbal and written communication skillsKnowledge and background in online advertising or related industry a plusCarGurus Culture: At the core of our company culture is a spirit of innovation, curiosity and collaboration. True to our start-up roots, were nimble, flexible and hardworking. We have a great respect for testing and learning and a healthy aversion to scheduling meetings to discuss meetings. Lunch is catered daily. Gym membership is free. Foosball and ping pong are played often. Now a publicly-traded company, were as committed as ever to cultivating the culture that got us here.  In addition to the US, CarGurus operates sites in Canada, the UK and Germany with other markets on the horizon. Our offices are located in Cambridge, MA, Detroit, MI and Dublin, Ireland. If youd like to learn more, please visit our careers page."}