{"jobID": "2823680719", "jobLocation": "Seattle_WA", "jobTitle": "Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.washington.edu", "Headquarters": "Seattle, WA", "Size": "10000+ employees", "Founded": " 1861", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "56000", "jobDescription": " As a UW employee, you have a unique opportunity to change lives on our campuses, in our state and around the world. UW employees offer their boundless energy, creative problem solving skills and dedication to build stronger minds and a healthier world.  UW faculty and staff also enjoy outstanding benefits, professional growth opportunities and unique resources in an environment noted for diversity, intellectual excitement, artistic pursuits and natural beauty. All of which has allowed the UW to be nationally recognized as a Great College to Work For for four consecutive years.  The Institute for Health Metrics and Evaluation (IHME) is an independent research center at the University of Washington. Its mission is to monitor global health conditions and health systems, as well as to evaluate interventions, initiatives, and reforms. IHME carries out a range of projects within different research areas including: the Global Burden of Diseases, Injuries, and Risk Factors; Future Health Scenarios; Costs and Cost Effectiveness; Local Burden of Disease; Resource Tracking; and Impact Evaluations. The aim is to provide policymakers, donors, and researchers with the highest-quality quantitative evidence base to make decisions that achieve better health. IHME is hiring for multiple Data Analyst positions on a number of different teams. Placement onto a team is determined by specific needs of the team and candidates' qualifications.  These positions position must develop an understanding of different research needs and analytic functions across multiple projects to best meet researcher needs. The Data Analyst must be able to independently translate requests into actionable results through interactions with research databases, formulation of displays of results, and development of complex code to be applied to a variety of quantitative data. The position calls for dexterity working with complex databases and the ability to assess, transform, and utilize quantitative data using multiple coding languages such (Stata, Python, R, SQL). The individual must then quality control results to ensure that other team members have exactly what they need to incorporate the data and results into their own components of the analytic process, presentations, and papers.  Additionally, this position will work alongside other Data Analysts on complementary projects and will require knowledge and skill sharing and collective problem solving. Overall, the Data Analyst will be a critical member of an agile, dynamic research team. This position is contingent on project funding availability. Please note: These positions are open to U.S. Citizens and permanent residents; H1B visa sponsorship is not available.  Research Teams for which Data Analyst positions are currently available include: Global Burden of Diseases, Injuries, and Risk Factors enterprise (GBD)_: A core research area for IHME is the Global Burden of Diseases, Injuries, and Risk Factors enterprise (GBD). A systematic, scientific effort to quantify the comparative magnitude of health loss due to diseases, injuries, and risk factors by age, sex, and geography over time, the GBD is the largest and most comprehensive effort to date to measure epidemiological levels and trends worldwide. The GBDs aim is to provide policymakers, donors, and researchers with the highest-quality quantitative evidence base to make decisions that achieve better health.Local Burden of Disease:_ IHME is seeking to revolutionize the way we track diseases around the world by developing innovative geospatial analytic methods to produce increasingly granular estimates of diseases and determinants. Just a few of the diseases this revolutionary work will touch on are pneumonia and its etiologies, diarrhea and its pathogens, malaria, HIV/AIDS, tuberculosis, Ebola, as well as select neglected tropical diseases. Through the development and use of geospatial techniques to synthesize information at the local level, and in partnership with key collaborators around the world, IHME will present results in interactive high-resolution maps to illuminate levels, trends, and disparities in health outcomes.Central Computation_: At the core of both the GBD and Geospatial Analysis is the need to take innovative analytic methods and devise ways to carry them out more easily and routinely. By creating and applying novel coding and computational solutions, the Data Analyst helps resolve thorny challenges to enable the timely and efficient production of high-caliber scientific and policy-relevant results. The solutions developed must allow databases, analytic engines, and creative data visualizations to function seamlessly with one another.Resource Tracking__: The Financial Resources for Health (FRH) research team is a longstanding core research team at IHME whose focus is to systematically, scientifically track resources spent on health and measure their impact. This research covers both domestic and internatio"}