{"jobID": "2739891332", "jobLocation": "Seattle_WA", "jobTitle": "Data Analyst I Single cell transcriptomics in neuroscience", "companyRating": "3.2", "companyInfo": {"Website": "www.alleninstitute.org", "Headquarters": "Seattle, WA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": " The Allen Institute for Brain Science is seeking an exceptional candidate who will be part of a Seattle-based multidisciplinary team within the Cell Types Program. The successful candidate will be a member of the Molecular Genetics team, which produces large-scale single-cell transcriptomics data from the primary mouse and human brain tissue. Job Responsibilities:Timely evaluate single cell transcriptomics data from our internal pipeline, perform QC, provide data visualization that will inform future scRNA-seq data production.Maintain Molecular Genetics R/Shiny web site and update weekly pipeline production visualizations.Help with centralized data storage, provenance information and communication with collaborators.Work with members of the Molecular Genetics team to develop new data analysis and visualization approaches for single cell RNA-seq data.Help with data analysis and visualizations for manuscript preparation.Basic QualificationsB.S. or M.S. in science or engineering.Experience with programming in R and Linux shell scripting, or any other programming languages (Perl, Python).Preferred QualificationsExperience with RNA-seq, ATAC-seq and/or ChIP-seq data, preferably at the single cell level.Ability to work independently as well as part of a team to meet aggressive timelines in a collaborative environment. **Please note, this opportunity does not sponsor work visas and has no relocation assistance**  It is the policy of the Allen Institute to provide equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, the Allen Institute will provide reasonable accommodations for qualified individuals with disabilities."}