{"jobID": "2801904762", "jobLocation": "New_York_NY", "jobTitle": "Senior Desktop Engineer", "companyRating": "4.6", "companyInfo": {"Website": "www.xantrion.com", "Headquarters": "Oakland, CA", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Eze Castle Integration, Synoptek, Endsight"}, "estimatedSalary": "96000", "jobDescription": " Since 2000, continued growth has hastened our need for senior desktop engineers. This information technology position is based in the Tri-State area, and is ideal for people who are ready to be challenged by real world applications and want to develop their system administrator skills. As part of our service team you will go onsite in Manhattan with customers as needed, and resolve email support requests in a timely manner. Two years from now, you will look back and discover you have taken your senior desktop engineer skills and success to the next level. Required Technical Support Experience and Qualifications5 to 10 years of technical support or 1 - 2 years junior system administrator experience.Authorization to work in the U.S.Exceptional communication skills.Knowledgeable about current Microsoft Office Suites.Familiar with backup technologies (VEEAM, Crashplan, etc.)Familiar with anti-virus technologies (AV Defender, etc.)Familiar with software deployment technologies (ghost, repackaging tools).Knowledgeable about basic networking (TCP/IP, DNS, routing, subnetting).Familiar with remote access technologies (VPN, dial-up, terminal services).Knowledgeable about current Microsoft Windows operating systems.Desired Technical Support Experience and Qualifications4 year Bachelor's degree.Relevant certifications (MCP, CCNA, etc.)Experience in customer service.Benefits Salary commensurate with senior desktop engineer experience. 100% of medical, dental, vision for you and your family, 80% covered for Kaiser. 401K with company match up to 4% of salary. 17 days/year PTO. Certification and training reimbursement. Bonuses for referring new clients or employees. If you're among the best of the best and ready to take your senior desktop engineer career to the next level, apply today."}