{"jobID": "2725444485", "jobLocation": "New_York_NY", "jobTitle": "HR Coordinator", "companyRating": "2.3", "companyInfo": {"Website": "www.fbbrands.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1901", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "56000", "jobDescription": " The Human Resources Coordinator is responsible for supporting the overall execution of HR programs, including recruitment, associate engagement & recognition programs and workplace compliance for the New York, NY location. This individual will ensure the New York site is aligned with the HR direction set by the company. PRIMARY RESPONSIBILITIES:Oversee recruitment efforts for all temporary resources.Facilitate weekly new hire orientation.Help manage benefits and leave of absence administration (STD, FMLA, etc.) in partnership with HR Associate and corporate benefits team.Respond to associate inquiries in a timely and effective manner.Support development and execution of site HR programs and administrative processes such as Town Hall, site celebrations/programs, open enrollment, etc.Actively participate in all site wellness initiatives.Maintain an updated understanding of all HR policies, procedures, benefits and relevant law and immigration topics. Required SkillsMINIMUM QUALIFICATIONS:Bachelor’s Degree in Management, Human Resources Management, Organizational Psychology or a related field is preferred1-2 years Human Resources/Generalist experienceComputer proficient: MS Office skills with emphasis on Excel & OutlookAbility to develop strong working relationships with all levels of the organizationAbility to handle sensitive information with confidentialityHighly motivated, self-starter with excellent verbal and written communication skillsStrong interpersonal and project management skillsCreative, detail oriented and organized team playerRequired Experience Job Location  New York, "}