{"jobID": "2644201773", "jobLocation": "Seattle_WA", "jobTitle": "Senior Data Scientist - Media and Mobile Marketing", "companyRating": "3.3", "companyInfo": {"Website": "jobs.groupon.com", "Headquarters": "Chicago, IL", "Size": "5001 to 10000 employees", "Founded": " 2008", "Type": " Company - Public (GRPN) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Amazon, Google, Facebook"}, "estimatedSalary": "211000", "jobDescription": " The Data Scientist role for Push Marketing on Mobile is responsible for understanding customer behavior and translate that to actionable insights that can impact revenue and user experience. The role not only requires background in math and programming, but also a passion for business, a desire to go into uncharted territory with bold new ideas, and a willingness to go the last mile on execution! ​Design and develop processes and systems to consolidate and analyze unstructured, diverse “big data” sources to generate actionable insights.Interact with product and service teams to identify questions and issues for data analysis and experiments.Design and code software programs, algorithms and automated processes to cleanse, integrate and evaluate large datasets from multiple disparate sources.Identify meaningful insights from large data and metadata sources; interprets and communicate insights and findings from analysis and experiments to product, service, business managers and customer service operations lead.Requirements:Strong analytical background, at least an MS or PhD, degree in computer science, statistics or related quantitative field, with an emphasis on predictive analytics, data mining, statistics, machine learning, algorithms or similar field.Understanding of applied math topics such as probability and statistics, linear algebra, basic optimization techniques, etc.5-8+ years work experience as a data scientist or a related roleHands on experience with predictive analytics tools and machine learning techniques/algorithmsHands on experience with tools such as R, Jive and familiarity with Teradata/Hadoop environment,Expert in R/Python with experience in machine learning related packagesExperience defining and analyzing multivariate testsExperience in big data technologies like Hadoop, Spark and HiveA successful history of translating business objectives and problems into analytic problems, and analytic solutions into actionable business solutionsGroupon’s purpose is to build strong communities through thriving small businesses. To learn more about the world’s largest local ecommerce marketplace, click here for the latest Groupon news. Plus, be sure to check out the values that shape our culture, guide our strategy and make our company a great place to work. And just don’t take our word for it. Hear from real Groupon team members and learn more about our employee resource groups. If all of this sounds like something that’s a great fit for you, then click apply and let’s see where this takes us."}