{"jobID": "2318775081", "jobLocation": "San_Diego_CA", "jobTitle": "Research Intern", "companyRating": "3.5", "companyInfo": {"Website": "www.sdccd.edu", "Headquarters": "San Diego, CA", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " School / School District", "Industry": " Education", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "51000", "jobDescription": " Posting Details (Default Section) Closing Date: Open Until Filled Yes Classification Title Research Intern Working Title Recruitment Limits Location District Wide Pay Information Click here for the hourly pay rate.  If you would like to open the link in a different tab or window, right click and select the option.Bargaining Unit AFT - NANCE Range (na) Department District Wide The Position FUNCTION:Under the direction of the Manager of Institutional Research, assist in the planning, organization, development, and coordination of the Districtwide Research function.Major Responsibilities  Assist in planning, organizing, developing, and coordinating the District and campus based Research Programs.  Prepare research designs, conduct studies, perform analysis, prepare reports and initiate special projects to support institutional and campus based decision-making.  Assist in the development of and refinement of projection models in areas needed by the District and campuses.  Provide technical and analytical support and leadership to departments, committees, faculty, staff and administrators.  Answer complex research questions and present research data and analysis in an understandable fashion to the stakeholders.  Coordinate research activities and priorities with appropriate agencies, State Chancellor’s Office and other districts.Qualifications REQUISITE TRAINING AND EXPERIENCE AND ABILITIES INCLUDE:Knowledge of advanced research techniques and methodologies, including both quantitative and qualitative research methods; principles of classroom based research methods, particularly student learning outcomes; project and research planning and design, data collection, analysis, report preparation and presentation of results; correct English usage and strong report writing and presentation skills; computer operation and software and statistical packages related to research; and computer data management and analysis applications. Ability to research and analyze data and information; evaluate and make recommendations in operations, systems, procedures, policies and methods; perform statistical and qualitative analyses; prepare written analysis, recommendations and complex reports; demonstrate proficiency in the use of complex software programs designed to import, manipulate and organize large databases; communicate effectively both orally and in writing and establish and maintain effective working relationships with others. Experience coordinating the research, study and analysis of management, budget, administrative, organizational, functional or procedural problems.Desired Qualifications Licenses/Certificates/Credentials: Commitment to Diversity: All applicants must have demonstrated cultural competency and sensitivity to and understanding of the diverse academic, socioeconomic, cultural, disability, gender identity, sexual orientation, and ethnic backgrounds of community college students and staff.Working Conditions Varies upon assignmentSpecial Instructions to Applicants: Conditions of Employment: THE FOLLOWING MUST BE COMPLETED PRIOR TO EMPLOYMENT:Provide a Certificate of Tuberculosis Exam for initial appointment (Note: The certificate must be renewed every 4 years as a condition of continuing employment);Have fingerprints taken by a Live Scan computer at the candidate’s expense (Clearance must be received prior to first day of employment); ANDPresent original documents for proof of eligibility to work in the United States.Posting Number NC00323 "}