{"jobID": "2517165861", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Product Owner, Connectivity", "companyRating": "3.5", "companyInfo": {"Website": "www.agoda.com", "Headquarters": "Singapore, Singapore", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "148000", "jobDescription": " Are you looking for a unique opportunity to work at the cutting edge of travel technology? Would you want to work in a rapidly growing company with some of the sharpest minds in the industry? How about living in one of the worlds most beautiful countries, one top-rated by expats? Then Agoda is the place for you! This role is based in our Bangkok, Thailand office. Agoda is an online hotel and accommodation booking website part of the Booking Holdings Group (alongside Kayak, booking.com, rentalcars.com, and others), which is by far the largest and fastest growing travel portfolio in the world. The best part is that each brand operates independently, meaning we have the resources of a big enterprise, but the mentality of an entrepreneurial startup.  The Senior Product Owner - Connectivity, is a senior role overseeing a team of 5+ Product Owners that work together with 10+ software development scrum teams. This role reports to the Director of Product.  Connectivity is at the core of several companywide strategic initiatives with revenue impact in the billions of dollars, and you will need to have strong business acumen together with a track record of leading the vision and roadmap of major cross functional initiatives. Importantly, youve had prior experience leading a team of Product Owners/Managers in an agile environment, ideally working with external facing APIs. Responsibilities:Lead company-wide product innovation in connectivity product development by overseeing the roadmaps and overall vision of the team.Communicate your vision and results extensively with stakeholders across the organizationCoordinate and be ultimately responsible for projects and products in connectivity, and be able to define and track key KPIs.Initiate and lead strategic supply partnerships that have potential to have significant impact on Agodas top and bottom linesBecome an expert in connectivity: the technology, the features competitors provide to accommodation partners, how the market is evolving, how to drive behavior beneficial to our end customers through the design of the product, amongst others.Requirements:Extremely comfortable with data and analysis. Proven ability to leverage analytics and quantitative methods to inform and influence decision-makingDemonstrated ability to influence and build relationships with people across all levels and organizations internally and externally, across multiple geographiesHighly organized and comfortable with making tough prioritization decisions. Able to effectively keep track of moving parts across projects, and adapt to new information and goals. Prior success in managing complex projects.Ability to motivate and inspire a team to achieve beyond what they imagined possible. Prior experience managing a team. Preferred QualificationsMBA, advanced computer science or engineering degreeExperience with high volume external facing APIsExperience in the travel technology industry Apply!"}