{"jobID": "2683361676", "jobLocation": "San_Jose_CA", "jobTitle": "Construction Project Engineer", "companyRating": "4.0", "companyInfo": {"Website": "www.henselphelps.com", "Headquarters": "Greeley, CO", "Size": "1001 to 5000 employees", "Founded": " 1937", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": " The Project Engineer is responsible for all on-site project administration. In this role, the Project Engineer will report to and receive support from the Project Manager in that daily project administration. The Project Engineer is responsible for managing the Office Engineers and the Project Administrator.  \",\"PositionRequirements\":\"Essential job functions include: Materials management including submittals, shop drawings, tracking/expediting material deliveriesPreparation of monthly Owner Pay ApplicationsAssist with production analysis studiesRun weekly Owner/Architect/Contractor meeting and staff meetingsAssist with monthly margin analysisManage, train and mentor Office EngineersDevelop, manage and maintain cost controls and labor recaps in conjunction with the Project Manager and Project SuperintendentAssist in development and updates to the project scheduleProcess, estimate and negotiate change orders with the owner and subcontractorsQuality control and support of our safety planPersonnel evaluation and development Preferred qualifications: Strong communication skillsComputer software - Microsoft Office Suite, specifically Excel based templates, Prolog, Primavera and AutoCADMinimum of 3-6 years’ experience on large commercial construction projectsA 4 year degree in Civil, Structural, Architecture or Construction Management \",\"PositionNotes\":\"Hensel Phelps is an equal opportunity employer and contractor. All qualified applicants will receive consideration for employment without regard to their protected veteran status, nor will they be discriminated against on the basis of disability.  EOE AA M/F/Vet/Disability  Hensel Phelps will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with Hensel Phelps’ legal duty to furnish information."}