{"jobID": "2757296096", "jobLocation": "San_Jose_CA", "jobTitle": "Floor Supervisor", "companyRating": "3.2", "companyInfo": {"Website": "www.westerndental.com", "Headquarters": "Orange, CA", "Size": "5001 to 10000 employees", "Founded": " 1903", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " InterDent"}, "estimatedSalary": "18", "jobDescription": " Requisition Number 18-1324 Title Floor Supervisor City San Jose State CA Zip Code 95123 DescriptionLet us help you take the next step in your career at our Western Dental/Brident Offices as a Floor Supervisor!  At Western Dental/Brident Offices we have modern, fully equipped state of the art dental practices that you will be proud to be affiliated with. We recognize that our team members are part of the Western Dental/Brident family  where we provide excellent professional, financial and personal growth for your dental career. ResponsibilitiesSupervise all back office staff including scheduling, training, performance evaluations and holding staff accountableParticipate in the hiring, selection and retention for back office staffResponsible for Patient management by partnering with Dentists, providing patients with proper pre and post-treatment instructions and ensuring patient satisfactionMonitor patient flow by effectively reviewing sign in sheet and appointment book and making necessary adjustments to the scheduleResponsible for ensuring sterilization of the office and equipmentEnsure compliance with all OSHA, Dental Board, and Corporate policies and proceduresConduct all weekly/monthly/quarterly inspectionsMaintain dental supplies and inventory; stock supplies in operatories, restrooms, lab, etc. as neededMaintain proper patient treatment recordsLead, inspire, and motivate back staffParticipate in monthly operational meetingsPrioritize UPE (Ultimate Patient Experience) Western Dental/Brident offers a competitive benefit package designed to enhance the lives of our team members. Team members are eligible for benefits based on their full time status. Paid Time Off (PTO)Medical and dental insuranceVision coverage401K planHighly competitive salariesOutstanding professional trainingExceptional growth and career advancement opportunities Requirements Experience supervising a team of 8-12 team members with the ability to demonstrate authority, delegate responsibility and hold a team accountableWorking knowledge of dental equipment and terminology, OSHA and safety complianceMust have a current X-Ray License. (Or an agreement must be signed that the X- Ray license will be obtained within six (6) months of employment)"}