{"jobID": "2805970549", "jobLocation": "Boston_MA", "jobTitle": "Senior Superintendent- Commercial Construction", "companyRating": null, "companyInfo": {"Website": "www.proconinc.com", "Headquarters": "Hooksett, NH", "Size": "51 to 200 employees", "Founded": " 1935", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Company DescriptionPROCON is an award winning architectural and construction management firm.  We offer fully integrated design build and construction management services for hospitality, multi-family residential, senior living, commercial/corporate, industrial, athletic, educational, and healthcare projects throughout the Northeast.  Since 1935 we&apos;ve maintained a steadfast commitment to professionalism, customer service and quality in all aspects of our work. That experience and industry expertise allows PROCON to build on lasting client relationships and complete hundreds of millions of dollars in design and construction volume annually, on- time and on- budget.Job DescriptionPROCON, the Northeast&apos;s premier design-build commercial construction company is looking for a Senior Superintendent to join our fast-paced, growing team.  Do you know quality work when you see it? Can you keep a project running on time by leading subcontractors as well as your own small crew? Is safety #1 on your site? Are you constantly walking the site checking things over? Can you navigate software as well as a set of paper plans? Yes!  This is the job for you! Candidates throughout New England are encouraged to apply.DESCRIPTION:Candidates must be able to manage projects ($5M-$75M), from Pre-Construction to completion.Ideal candidates must understand commercial design-build projects.Comprehensive understanding of drawings and specifications, materials, constructability issues, schedules, and management of the onsite workforce.Ideal candidates should be able to create a motivated workforce, develop cooperative subcontractor relationships, and create long-term client relationships.Superintendents must effectively manage the project and be able to communicate clear expectations to subcontractors, onsite PROCON employees, the Project Manager, and Project Executives.Travel to job sites in New England and the Tri-State area is required.Bilingual abilities are a huge plus but not requiredQualificationsMinimum of 10 years of exp. in a Superintendent position for commercial projects $20M+Strong organization, judgment, multi-tasking and decision-making abilitiesProficiency in construction management and scheduling softwareAbility to develop and maintain positive client/consultant/internal relationshipsEffective oral and written communication skills are necessaryExperience working in design-build construction firms is highly desirableTechnical training or Bachelor degree in Construction Mgmt., Engineering or Architecture is highly desirableAdditional InformationWe are conveniently located off of Rt 93.Our expanding portfolio and supportive work environment provide excellent opportunities for growth and development.We offer Health, Vision & Dental Insurance, 401(k), tuition reimbursement and a comprehensive benefits package.Salary is commensurate with experience.Visit our website: www.proconinc.com"}