{"jobID": "2778273218", "jobLocation": "San_Jose_CA", "jobTitle": "Chef Manager", "companyRating": "3.1", "companyInfo": {"Website": "www.guckenheimer.com", "Headquarters": "San Mateo, CA", "Size": "1001 to 5000 employees", "Founded": " 1965", "Type": " Company - Private", "Industry": " Restaurants, Bars & Food Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "66000", "jobDescription": " Food. Cooking. Creativity. Is this your life? Do you believe that commitment unlocks unlimited potential? We are the perfect Company to launch or further your career. We are all about great ingredients, culinary innovation and nourishing inspiration. Oh yeah, we don't work weekends unless we are opening a new location or kicking it at some cool industry event.  Guckenheimer, is a national foodservice management company that pioneered restaurant style, healthful dining in the workplace. We encourage our team members to join in community events such as Chef Ann Foundation to support the #RealSchoolFood campaign, promoting cooking healthy meals with real ingredients at schools., Second Harvest Food Bank, Girls on the Run, and many more community programs.  We offer fantastic health and wellness benefit options that include but not limited to medical, HSA, a rewarding wellness program, dental, vision, FSA, commuter benefits, EAP, free meal each day, free pair of safety shoes at time of hire, and much more. Guckenheimer's own Learning Management System at your fingertips and a yearly tuition reimbursement program will enable you to enhance your career development in your new and exciting position with Guckenheimer!  We encourage you to apply to our Chef Manageropportunity and bring your knowledge and passion of high quality food and customer service to our culinary program CONNECTING PEOPLE THROUGH REAL FOOD Working at Guckenheimer as a Chef Manager s not your typical foodservice experience. To start, our people are simply the best. Our fair, team-based culture encourages our teams to work hard, collaborate and have fun. Our chefs are compulsive creators and that energy flows throughout the company; everyone works together to improve, innovate and be the best. WHO WE’RE LOOKING FOR: Not only are you creating imaginative (and delicious!) menus each and every day, you also know how to make your customers feel at home. You are a people person and a culinary wizard all in one. POSITION DETAILS: You are the brand representative of Guckenheimer for your team and for your client. You are leading a team and responsible for efficiently overseeing culinary and operation functions within the guidelines established by the client organization, health department, state regulations as well as Guckenheimer’s standards and expectations. ADDITIONAL RESPONSIBILITIES:Oversee the purchase, preparation and execution of high quality, cost effective food service.Hire, train and schedule staff. Participate in corporate training and be involved in staff development programs.Prepare and maintain accurate and timely accounting and financial records within your operating budget.Maintain sanitary and safe operation in accordance with Federal, State and local health regulations. This includes following HACCP guidelines to prevent food borne illnesses.Represent the company in a courteous, friendly manner. Engage with your customers, listen to feedback and make changes to better meet the needs of both clients and customers.SKILLS/REQUIREMENTS:Culinary Arts degree, preferredculinary experience in a similar volume food service establishmentfood service training with experience in food preparation techniques according to HACCP processes and recommendationsUnderstands restaurant merchandising and marketing for service preparation and presentationEffectively communicate and present information to customers, clients and employeesIMMEDIATE SUPERVISOR: Area Manager  Guckenheimer embraces equal opportunity employment  Guckenheimer participates in the E-Verify Program, as required by law"}