{"jobID": "2750979073", "jobLocation": "Waltham_MA", "jobTitle": "Lead Data Scientist", "companyRating": "4.3", "companyInfo": {"Website": "www.carbonblack.com", "Headquarters": "Waltham, MA", "Size": "1001 to 5000 employees", "Founded": " 2002", "Type": " Company - Public (CBLK) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "131000", "jobDescription": "Why Carbon Black? At Carbon Black, you’ll have the chance to make an impact in the ever-evolving cybersecurity space. Our advanced technology tackles even the toughest challenges and stays ahead of the latest threats.  If you want to join an agile fast growth company that’s building leading edge cloud based security solutions, then Carbon Black is the place for you. Driven by passionate people who are dedicated to making the world safer, led by a world class leadership team and enabled by a market leading product, it’s no wonder we’ve been named a “Top Place to Work” by the Boston Globe for four consecutive years. Join us! Why You Matter You know Machine Learning algorithms better than most and know which to apply where. You have created, trained, validated, and deployed models in Production and know the challenges that come along with it. You see Data Mining and Machine Learning go hand-in-hand. You are entrepreneurial in nature and are not afraid of trying your data science skills to solve the next problem, be it engineering, marketing, or sales. Is this you?  Reporting to the VP, Customer Data Science, you will be a key member of the team that is tasked to accelerate our revenue growth and optimize our customer retention leveraging data science and big-data techniques. You will help us decide the Machine Learning algorithms to use, the models to create, and the data mining techniques to apply while collaborating with other members of the team. This role is integral to the success of the team. What You’ll DoPrototype Machine Learning experiments and evaluate their effectiveness and performance.Design, develop, and deploy Machine Learning models for big-data analytics.Automate deployments and updates to the models in the cloud.Automate access and transformation of large volumes of data for building and running models.Collaborate in a cross functional agile environment with teams of Software Engineers, Big-data Architects, Data Engineers, Data Analysts, and SMEs.What You’ll BringMS or Ph.D. in Computer Science, Electrical Engineering, Statistics, or related quantitative field.5+ years of experience in applying Machine Learning algorithms and Data Mining techniques to huge data sets.Deep understanding of supervised and unsupervised learning methods as it relates to sentiment analysis, topic modeling, text analysis, classification, regression, and clustering.Expertise in one or more Machine Learning libraries – R, Python, Spark.Experience with AWS, Hadoop, Hive, Java is a plus.Experience with observational data and study is a plus.Experience with automated Machine Learning tools like DataRobot and RapidMiner is a plus.Who We Are Carbon Black is a leading provider of next-generation endpoint security. Carbon Black serves more than 3,700 customers globally, including 33 of the Fortune 100. As a cybersecurity innovator, Carbon Black has pioneered multiple endpoint security categories, including application control, endpoint detection and response (EDR), and next-generation antivirus (NGAV). Leveraging its big data and analytics cloud platform – the Cb Predictive Security Cloud – Carbon Black solutions enable customers to defend against the most advanced cyber threats, including malware, ransomware, and non-malware attacks. Deployed via the cloud, on premise, or as a managed service, customers use Carbon Black solutions to lock down critical systems, hunt threats, and replace legacy antivirus. Carbon Black, Inc. is an EEO/AA employer.Carbon Black is an inclusive employer that believes in workplace equality, supports diversity, creates a welcoming environment, and respects the unique qualities each individual brings to the company."}