{"jobID": "2749053559", "jobLocation": "Boston_MA", "jobTitle": "Health Benefit Plan Drafting Consultant", "companyRating": null, "companyInfo": {"Website": "www.phiagroup.com", "Headquarters": "Braintree, MA", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "The Phia Group's Health Benefit Plan Drafting Consultant is responsible to draft, analyze and review health plan documents and plan amendments. Communicate with clients regarding plan documents. Assist our PGC department team members and clients with our online Plan Document drafting software (i.e. coding, testing, updating, and training clients). Key Responsibilities ConsultationAnalyze, draft, edit and review health plan documents and plan amendments for self-funded and other plans as required.Review documents for federal and state law compliance and cost containment.Provide language recommendations to improve plan documentation.Follow relevant best practices, company templates and policies and utilizes editing features of software to show client’s plan document changes.Research state and federal mandates applicable to self-funded employee benefit plans.Responsible for identifying issues and non-standard provisions. Product DevelopmentCreating / Implementation of the client specific template and checklists onto the PDM system. Will assist in coding the PDM templates / checklistsUpdate the software developer team on testing of product enhancements and what can be pushed to the “live” serverTesting of the developed product enhancements Maintaining and/or keeping the client checklists and templates up to date per client requests and per compliance with healthcare regulations. GeneralMaintain security and confidentiality of client plan information.Communicate with appropriate team members to build context to ensure changes are well documented and easily understood.Streamline the process of gathering and compiling data, drafting documents, editing, submitting and record keeping.Perform other duties as requested or required. Experience and QualificationsBachelors Degree or equivalent combination of education and experience preferred.Ability to listen and communicate (written and verbal) with all levels of staff, vendors and clients.Proficiency with Microsoft Office Word, Excel and Outlook applications.Ability to perform at high levels in a fast paced ever-changing work environment.Ability to anticipate work needs and follow through with minimum direction.Proficient organizational, time management and prioritization skills.Proven ability to have strong accuracy and attention to detail skills.  "}