{"jobID": "2633871879", "jobLocation": "Burlington_MA", "jobTitle": "Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.arcadia.io", "Headquarters": "Burlington, MA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Evolent Health, Health Catalyst, Truven Health Analytics"}, "estimatedSalary": "67000", "jobDescription": " OverviewJoin the product development team of a high growth Population Health and Analytics software company. Reporting to the VP of Product Development and joining a talented team of Product Managers, Analysts and Data Scientists. This is a hands-on position designing promoting the next wave of advanced healthcare data connectivity, analytics and workflow products. Ideate with the best minds in healthcare through our advisory network. Build with engineers that have 5+ years using Hadoop, Scala, and Spark to get jet engines to communicate, others that spent 10 years working in the data trenches created by healthcare’s switch from fee for service to fee for value, and still others with unparalleled capabilities in using data viz to make sense of massive data sets – all focused on pulling healthcare tech into modernity.Responsibilities Investigate possible future products and/or support the R&D; projects of one or more Product ManagersPrepare, analyze and visualize tens of millions of records of healthcare data – to support marketing and ROI analyses, customer requests, and product R&D;Evaluate all stages of any data pipeline and storage to ensure fitness for use, and data qualityInteract with and support our engineering team, responding to requests and qualifying features or development questionsSupport sales and marketing in the growth and visibility of these new products in a fast-moving healthcare analytics marketQualificationsBachelors degree in hard science, with math/statistics backgroundAbility to query and manipulate relational databases with SQLExperience with analytics tools and languages such as R, SAS, Spark, Hadoop, SQLFast learnerPreferredAbility to code in languages such as Python, Java and/or ScalaExperience using statistical modelling and/or machine learningUnderstanding of JavaScript, css, HTML5, GGPLOT and/or D3 preferredExperience working with a product or product management team a plusExperience with healthcare a plus"}