{"jobID": "2786616365", "jobLocation": "Boston_MA", "jobTitle": "Platform Data Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.cengage.com", "Headquarters": "Boston, MA", "Size": "1001 to 5000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Media", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Pearson, McGraw-Hill Education, EBSCO Industries"}, "estimatedSalary": "51000", "jobDescription": ". Do you dare to reinvent the future of education?At Cengage, we are harnessing the power of tech to build a future where all learners have the tools and confidence to achieve their goals.  As a Cengage employee, you will pioneer transforming the way people learn. Collaborating with the best of the best, you will feel challenged and inspired to do breakthrough work. With the support of our united team, there is no limit to what you can imagine, create and set in motion.Are we right for you?We bring our “A” game, unique talents and point of view to the table every day. We are curious and comfortable with change and are willing to take risks to transform education. Most importantly, everything we do, we do for the learner.  We are looking for a Data Analyst to join as a key member of the Technical Product Management (TPM) Platform Analytics team. Platform Analytics plays a central role working with our software development and key internal stakeholders (Product, Marketing, Sales, Strategy, etc.) to turn platform usage data into actionable insight in support of key business priorities and improving student outcomes in our products.  Platform Analytics owns the development, analysis and visualization of data-driven solutions and analysis in support of critical business and customer pain points across the company’s digital portfolio. This is an opportunity to join a small, nimble team comprised of data analysts, software engineers and data architects working on high priority, high visibility programs in the company. The Platform Data Analyst will support specific deep-dives and critical analysis on a project basis and have direct ownership and accountability of assigned projects.What You'll Do Here: Form a deep understanding of Cengage’s strategic goals at corporate and business unit / functional levelsAnalyze digital platform data and usage characteristics to create actionable insight and tangible business valueSupport implementation of Analytics products (examples of work: workplan development, activities tracking, risks identification, training)Conduct ad hoc analyses for special projects as neededCollaborate with key business unit stakeholders and data engineers to define high quality, synthesized outputSynthesize analyses and present findings to management at multiple levelsWork with Analytics partners to identify new opportunities to enhance the overall performance of the teamSkills You Will Need Here:Minimum of 1-2 years of relevant experience working on data analysis, modeling and reporting systemsBA/BS with high proven achievement requiredStrong understanding of data analysis tools (including SQL) and techniques with experience working with Business Intelligence (BI) platforms to deliver synthesized reports and data-driven insightsComfortable wearing multiple hats working across the organization including working with end-users to define pain points/critical data needs and working with engineers/developers to identify and access necessary source dataStrong writing and verbal presentation skills, enabling her/him to prepare and present information and recommendations to a broad and diverse audienceDemonstrated ability to define business KPIs and establish measurement frameworksAble to self-manage progress and deliverables with a high degree of accountability and personal urgencyTravel expected (primarily domestic, less than 10%) Personal AttributesHigh degree of accountabilityHighly analyticalComfort with and eagerness to tackle ambiguous problemsInterest and/or previous experience in education and/or software, and/or publishing industries a plusStrong interpersonal skills with ability to build working relationships with all levels of management and stakeholders"}