{"jobID": "2764567713", "jobLocation": "New_York_NY", "jobTitle": "Junior Accountant", "companyRating": "3.3", "companyInfo": {"Website": "www.gny.com", "Headquarters": "New York, NY", "Size": "201 to 500 employees", "Founded": " 1914", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Travelers, Chubb, Crum & Forster"}, "estimatedSalary": "44000", "jobDescription": "Job DetailsLevel ExperiencedJob Location New York (Home Office) - New York, NYPosition Type Full TimeEducation Level 4 Year DegreeSalary Range UndisclosedTravel Percentage UndisclosedJob Shift UndisclosedJob Category AccountingDescriptionGreater New York Mutual Insurance Company (\"GNY\") is an A+ rated, financially stable and growing property casualty insurance company with locations throughout the Northeast. We currently have an opening for a Junior Accountant in our Finance department at our company headquarters. This individual will be responsible for financial planning, analysis, and assist in general accounting processes. Duties and Responsibilities including :Prepares various financial related data, analyses, and reports on the companies premium accounts.Prepares monthly expense reports, budget analysis, and review of expense general ledger accounts.Responsible for reporting cash balances of operating and investment cash accountsCreate ad-hoc reports as business needs emerge.Perform functions necessary to maintain and update the accounting books and records in compliance with statutory accounting principles.May perform additional related duties as required.QualificationsBachelor's degree in Accounting1-2 years of experience related experienceProficient in Microsoft Office products including Excel, Word, and Outlook. Intermediate to advanced Microsoft Excel skills (including V-lookups and pivot tables)Familiarity with Access is preferredExcellent written/verbal communication skills, organizational skills, attention to quality, self-motivation and a desire to succeedExperience in the insurance industry A+ Apply Now!"}