{"jobID": "2548247954", "jobLocation": "Menlo_Park_CA", "jobTitle": "Research Intern, Machine Learning (PhD University Student)", "companyRating": null, "companyInfo": {"Website": "www.facebook.com", "Headquarters": "Menlo Park, CA", "Size": "10000+ employees", "Founded": " 2004", "Type": " Company - Public (FB) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Google, Snap, Uber"}, "estimatedSalary": null, "jobDescription": " Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities we're just getting started.Facebook is seeking Research Interns to join various teams in developing next generation products and platforms doing research and engineering at scale. As a Research Intern, you will help us bring the best of Artificial Intelligence technology to Facebook products. Our efforts are to push the bar in three directions: build reliable platforms that scale to thousands of engineers, push state of the art in AI for maximum product impact and build new experiences using AI. Focus areas include: Machine Learning, Computer Vision, Computational Photography, Speech Recognition, Natural Language Understanding, Augmented Reality and more.  The duration of this internship is 16 weeks with Summer, Fall, and Winter start dates. We have openings in our Menlo Park and Seattle offices. Internships will be awarded on a rolling basis and candidates are encouraged to apply early.  To learn more about our research visit https://research.facebook.com Responsibilities:"}