{"jobID": "2538588107", "jobLocation": "San_Bruno_CA", "jobTitle": "Software Engineering Intern (Front|Back|Cloud|Mobile|Web) Summer", "companyRating": "3.2", "companyInfo": {"Website": "www.walmartlabs.com", "Headquarters": "San Bruno, CA", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, eBay, Google"}, "estimatedSalary": "103000", "jobDescription": "Position DescriptionYOUR INTERN PROGRAM EXPERIENCE  Far beyond your specific assignment, the program immerses you in business, allows you to develop cutting edge technology, and shows off your socials skills, all in-between a lot of fun! Over the 10 to 11 week period you connect with executives, learn advanced skills, participate in HackDay, and network at social events. Whether you are playing in the Intern Olympics or going to a Giants game, there is always something going on. With the San Francisco Bay Area as your playground the opportunities both inside and outside of work are endless!Minimum QualificationsABOUT YOU A visionary engineer or technologist with a passion for learning new technologies, programming wizardry, and translating them into working software.Experience with software design, development and automated testingFamiliar with agile or other rapid application development metExperience with design, editing, and programming across one or more platforms and languages (Java, JavaScript, C/C++, Perl, Python, R, Ruby, Shell Scripting, CSS, HTML, HTML5), data structure fundamentals and relational databases, Big Data, Cloud Computing, (Hadoop/HBase/MapReduce), Linux system and networksDemonstrated experience with object-oriented design and coding with variety of languagesUnderstanding of XML, JSON , Web Services technologies, and, with experience in multi-threaded programming a plusAndroid, iOS, or Windows Phone development experience is strongly preferred, but not requiredPassionate about user experienceAn awesome programmer with high levels of creativity and quick solving capabilities to change the world in a huge way!EDUCATIONAL REQUIREMENTSCurrently enrolled and pursuing a Bachelors, Masters, or PhD in Computer Science, Software Engineering, Computer Engineering, Electrical Engineering or a related field.Graduating December 2017 or laterAdditional Preferred QualificationsNone at this timeCompany SummaryWalmart Global eCommerce is comprised of Walmart.com, VUDU, SamsClub.com, and our technical powerhouse @WalmartLabs. Here, innovators incubate next gen e-commerce solutions in real-time. We integrate online, physical, and mobile shopping experiences for billions of customers around the globe. How do we do it? We continuously build and invest in new technology including open source tools and big data innovations. Data scientists, front and back-end engineers, product managers, and web and UX/UI teams collaborate alongside e-commerce experts to envision, prototype, and bring revolutionary ideas to life in a dynamic, flexible and fun work culture.Position SummaryABOUT SOFTWARE ENGINEER INTERNS The teams within @WalmartLabs design, prototype and build technology-fueled products that bridge the gap between what's next and what's best. The engineering teams are grounded in the principles of open source. As an intern, youll have the responsibility to make a difference on a grand scale, working on code for millions of users and taking on other challenging projects. Our interns work with very small team to create new, awesome features for millions of users. Write code with one or more programming languages (e.g., Java, C/C++ JavaScript)Function as a core member of an agile team working on API specs, conducting code reviews and testing in ongoing sprints, or doing proof of concepts/automation toolsDesign and develop new customer-facing applications on multiple channels like native iOS, Android, web, social integration, java services / APIsDesign and implement web-enabled systems for data collectionWork on the scalability, resilience, and efficiency of backend componentsWork closely with teams across product engineering, product management and interaction design"}