{"jobID": "2831192120", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Clinical Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.usdm.com", "Headquarters": "Santa Barbara, CA", "Size": "201 to 500 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Data Scientist  Reporting to the Predictive Analytics (gPA) Team Lead. The gPA group supports clinical development in the area of trial design, study planning and the creation and application of predictive algorithms. The role will require cross-functional interactions with Clinical Science and Clinical Operations. The Data Scientist will act as a consultant and be required to both establish and apply new machine learning methods to specific problem domains within those functions.  The Data Scientist will primarily be responsible for the development and the deployment of machine learning methods in early clinical development with particular focus on the application to protocol writing, and clinical trial planning and forecasting, and study execution. In addition the data scientist may work to apply methods from the ECD AI (Artificial Intelligence) team to specific problem domains. ResponsibilitiesLead key machine learning pilots to ensure successful completion and develop plans to integrate capabilities into the normal early clinical development processAccess, process, manipulate data of large volumes and from diverse sources (e.g. Oracle Clinical, Teradata, Medidata RAVE, ClinicalTrials.gov)Development of new and novel machine learning methods for predictive modeling and simulation-based modelingProject and predict business processes including clinical site activation, patient screening and enrollmentDetect trends and anomalies in data and analysesConduct ad hoc requests to support clinical development business needsPossess in-depth knowledge of multiple real-world data assets and share information about these data to business partners and the ECDi team.Qualifications________________________________________Degree in a relevant technical field such as Statistics, Mathematics, Computer Science. Masters or PhD is a plus2+ yrs experience in using Statistics, Mathematics, Computer Science (1+ yrs with a PhD)3+ yrs experience in Clinical Development, Pharmaceutical, or healthcare industryProficiency in PythonExperience using machine learning toolkits such as SciKit learn, XGboost,Experience using spark, sql andDesirable, experience using a probabilistic programming library or language such as PyMC3, Edward or FigaroStrong analytical and problem-solving skillsExcellent oral and written communication skillsAbility to lead cross functional multi-disciplinary teams Able to work in teams and collaborate with others to solve the most challenging business problems"}