{"jobID": "2807631397", "jobLocation": "Santa_Clara_CA", "jobTitle": "GIS Data Analyst, Maps", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "88000", "jobDescription": "GIS Data Analyst, Maps Job Number: 113903481Santa Clara Valley, California, United StatesPosted: Jun. 8, 2018Weekly Hours: 40.00 Job SummaryAre you a self driven GIS Data Analyst passionate about complex geographic data and interested in a new opportunity? We are looking for you to lead a motivated team of contractors dedicated to analyzing, managing, and qualifying data going into Apple Maps for the Data Delivery Operations Team. We're looking for a talented and passionate person to join this amazing team, if you feel this is you, we'd love to hear from you.Key Qualifications You possess the following:Project management skills: prioritization of work, experience crafting and distributing projects authoritatively, delegation of tasksSkilled in complex data analysisExcellent communicator and critical thinkerDatabase experience and scripting language familiarity: SQL, Bash, and PythonExpertise in road network connectivityAbility and experience collaborating within and across teams; multi-functional communicationThrive in a demanding, dynamic and fast-paced environmentTrend and Statistical analysis skillsExperience in automation and optimization of processesInnovative thinker and self starter that can hit the ground running DescriptionBe a hands-on leader, guide and motivate team leads and contractors  Report projects, team metrics and results in ad hoc and scheduled reports  Analyze trends within large datasets; execute data driven decisions based on analysis  Innovate and optimize methods for team productivity and maintaining data qualityEducationBachelors or Masters degree in Geography, GIS, or equivalent field  3+ years of industry experience with GIS analysis, preferably 1+ year in a leadership position  Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}