{"jobID": "2796124538", "jobLocation": "San_Francisco_CA", "jobTitle": "Head of Enterprise Architecture", "companyRating": null, "companyInfo": {"Website": "www.fishercareers.com", "Headquarters": "Camas, WA", "Size": "1001 to 5000 employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OverviewLooking to provide a new vision for technology for an organization? We are currently seeking qualified candidates to serve as the Head of Enterprise Architecture.  You will be reporting to the Executive VP & Chief Technology Officer and as the Head of Enterprise Architecture, you will be responsible for the creation of an Enterprise Architecture function and organization that will help lead the strategic technology direction for our company. The successful candidate will define our future technology architecture including critical new technology capabilities across the enterprise to drive our business, deliver amazing client experiences, and ensure scale to support our aggressive growth objectives.  Working closely with the business, applications, security and infrastructure teams, the Enterprise Architecture team will analyze business and technical problems and develop the appropriate framework to deliver business solutions that will meet Fisher’s current and future business’s objectives. The VP of EA will create, champion and implement the architecture vision and strategy, associated standards, processes, and procedures to be used across the enterprise including the development and acquisition of new technological innovations, solutions and tools to improve internal operations and customer experience.  The ideal candidate will have led Enterprise Architecture in the Financial Services, or other regulated industry, and have a successful track record of building teams and influencing change cross-functionally. Key Responsibilities:•Collaborates with the CTO, other members of the Technology Leadership team and key stakeholders from the business functions, develop an Enterprise Architecture Vision & Strategy•Links Fisher’s business vision to its Technology strategy through the creation of architectural models that show how the current and future technology needs of the organization can be met and potential paths to pursue•Define and communicate the company’s strategic platforms and target architecture – publish and maintain the business-system capability map and reference architecture•Engage and develop relationships with leaders across the global organization to understand functional business requirements and identify opportunities to introduce new technology solutions•Establish and oversee EA governance framework and ensure integration with the IT operating model•Educate, mentor and coach architects across the technology organization.•Provides oversight of infrastructure, security, data and application architecture•Define SOA architecture, including middleware, integration, and data management frameworks•Work with Information Management team to define enterprise master data standards, establish and lead enterprise MDM governance•Identify emerging information technologies to be assimilated, integrated, and introduced within the company•Develops road map for evolution of the application portfolio from current to future state •Facilitate evaluation and selection of software product standards, as well as the design of standard software configurations.•Assist in the creation and assessment of request for proposals for vendor, software and hardware selection.•Acts as an expert advisor, coach and mentor to technology leadership and management team on latest architecture principles and approach•Attracts, motivates and leads a small team of highly technical and systems minded individuals Qualifications and Requirements:•Minimum 15+ years of industry experience in a complex global organization with 7+ years’ experience as an enterprise, solution or technology architect.•Minimum of 7 years’ experience in a senior leadership role(s) with a track record for building high quality teams. •Exceptional at influencing senior business and technology stakeholders across the organization, effectively leading change, originating ideas, and championing and gaining commitment.•Strong written and verbal communication skills articulate and effective communicator and presenter, able to describe complex problems and solutions in simple or understandable terms.•Expertise spanning all architecture layers (technology/infrastructure, applications, information and business process) and will have previously interacted across several areas of an enterprise with business leaders and technology teams that support them.•Possesses mature understanding of foundational architectural concepts (design, business technology strategy, quality management, human dynamics, and IT environment).•Experienced with cloud based technologies, integrations and design; latest mobile architectures.•Demonstrates both strong analytic and big picture capabilities in problem solving approaches•Ability to consider upstream and downstream process impacts and implications•Ability to establish and manage priorities in a high change environment•Proven ability to execute swiftly without compromising quality•Exhibits acute business acumen and understanding of organizational issues and challenges•Versatility and willingness to work in dynamic environment with positive outlook and energy  Fisher Investments is an Equal Opportunity Employer."}