{"jobID": "2822578463", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.aspiration.com", "Headquarters": "Marina del Rey, CA", "Size": "1 to 50 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Aspiration seeks an experienced Data Scientist to join the credit analytics team. This is a pivotal role within the organization and is central to fulfilling Aspirations mission. We are looking for a team player with strong modeling skills and statistical knowledge who has the ability to work closely with the business through the full life-cycle of a problem, from intent development to execution. This is a cross-functional role involving business strategy, product development, data engineering and marketing teams. The goal will be to effectively leverage multiple data sources to build predictive models and deploy solutions to our customer base.In this role you will...Use your predictive modeling expertise to create models to assess incoming or existing customer riskBe a proven self starter with demonstrated strong end-to-end ownership. You are comfortable taking a whitespace problem from inception, work through unstructured data, and propose solutionsBe comfortable with a wide range of modelling and feature selection techniques.Be comfortable adapting to non-stationary data as rapid product improvements can lead to very different behaviorsBe able to clearly document results of your projects and share with peersHave demonstrated capability to effectively evaluate models, features and potential blind spotsHave strong communication skills to work with and influence technical and non-technical audienceWe are looking for someone with...3+ years experience doing quantitative or data analysisAdvanced degree in Computer Science, Math, Physics, Engineering, Statistics or other technical fieldStrong understanding of statistical concepts and their implications to business problemsExcellent written and verbal communication skillsTop notch programming skills in R, Python or other similar programming languagesStrong desire to work in a fast-paced, high-growth environmentPrevious experience working in Financial Services is a plus*Aspiration will consider sponsoring a newly qualified applicant for employment authorization for this position"}