{"jobID": "2822117947", "jobLocation": "San_Jose_CA", "jobTitle": "Behavior Specialist I", "companyRating": "3.7", "companyInfo": {"Website": "www.upliftfs.org", "Headquarters": "Campbell, CA", "Size": "501 to 1000 employees", "Founded": " 1867", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "15", "jobDescription": "Title: Behavior Specialist I Classification: Non-Exempt Salary Range: $17.75-$24.86 Actual offers will be determined by the candidate’s creditable years of experience in conjunction with internal equity considerations and based on the organization’s current compensation practices.Job Code: 353 Job Summary Works within the vision, mission, and philosophy of the agency. Under direct supervision, develops and implements positive behavior supports and intervention strategies to address significant behavioral problems for youth and their families/caregivers in a variety of environments. Works collaboratively with others on the clinical team to support creation and implementation of stabilization and service plans.  Works independently with youth and or families in a variety of settings including homes, community, and/or treatment settings. Essential Duties 1. Provides direct services to youth and families.  2. Assists teams in developing a hypothesis of function and underlying unmet needs in an effort to develop individualized, strength based strategies, and interventions that will result in positive behavior change.  3. Develops intervention plans that support the decrease in behaviors while incorporating strengths into skill development plans, a time-line regarding implementation and transition of plans to the youth and family, as well as both proactive and reactive strategies that can be used before, after and during escalating incidents.  4. Understands and engages in therapeutic opportunities in crisis situations and provides corrective experiences in times of crisis.  5. Offers constructive feedback and creative suggestions in the use of non-aversive approaches to behavior change to all members of the team.  6. Models, trains, and practices with the child, family, and natural supports behavioral interventions and skill development plans.  7. Provides positive demonstration of professional behavior in all aspects of his/her role, maintaining positive relations with customers and modeling the value of these relationships internally and externally.  8. Attends and participate in weekly supervision, weekly staff meetings, in-service training and treatment team meetings.  9. Actively participates in continuous quality improvement processes and projects.  10. Employee is required to meet applicable productivity and documentation requirements  Other Duties  11. Driving to appointments with clients and their families or other key contacts  12. Physical interactions with children of variable ages such as, but not limited to, games, sports and other activities Qualifications To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. All employees are responsible for keeping job requirements up to date. This can include but are not limited to certifications, licensure, and maintaining a clear criminal record. Education Requirements • Bachelor's Degree (BA/ BS) required. Preferred Education Qualifications • Bachelor's Degree (BA/ BS) in Psychology, Behavioral Science, Education or related field preferred.  * Bilingual Spanish preferred Experience Requirements • One (1) year experience working with children who have Serious Emotionally Disturbed (SED) children and their families required. Other Specific Requirements • Must pass Department of Justice (DOJ), Federal Bureau of Investigations (FBI), and Child Abuse Index Check (CAIC) background clearance, if applicable.  • Valid California Driver's license with two years experience driving and clean driving record will required. Work Environment/Conditions Reasonable accommodations may be made to enable qualified individuals with disabilities to perform the essential functions.  While performing the duties of this job, the employee may be required to use hands to handle or feel objects, tools or controls; reach with hands and arms; and taste or smell.  Specific vision abilities required by the job include close vision, distance vision, color vision, peripheral vision, depth perception and the ability to adjust focus.  In addition, this position requires standing, sitting, walking, climbing and kneeling. Employee Statement of Understanding I have read and understand the job description for my position. I am able to perform all of the essential functions of this position. I agree to successfully complete all required training indicated for this position. I agree to keep all of my required certifications and licenses current and up to date and provide proper documentation of the same to the Human Resources Department. I agree to comply with all Agency policies and procedures. I agree to comply with the agency compliance plan and all laws, rules, regulations and standards of conduct relating to my position. As an employee, I understand my duty to report any suspected violations of the law or the standards of conduct to my immediate supervisor. As an employee, I will strive to uphold the mission and vision of the organization. All employees are required to adhere to the values in all their interactions with youth and families and fellow employees."}