{"jobID": "2831147648", "jobLocation": "El_Segundo_CA", "jobTitle": "Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.aerospace.org", "Headquarters": "El Segundo, CA", "Size": "1001 to 5000 employees", "Founded": " 1960", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "120000", "jobDescription": "Requisition ID: 41050All Locations: El Segundo, CA (California) A trusted partner. A national resource. A leader in national security space. We are THE Aerospace Corporation. A team that takes pride in our readiness to solve some of the most complex technical challenges in existence. With challenges spanning government to commercial, you’ll have the unique opportunity to work on projects that are literally evolving our nation&apos;s space and launch capabilities. We all share a common passion and aspiration – to serve a mission much bigger than ourselves. When you join our team, you’ll be part of a rare collection of thought leaders and game-changing innovators. Are you ready to launch your career?ResponsibilitiesDevelop analytics, machine learning, and software solutions in support of National Security Space, civil and commercial customers. Possible projects include remote sensing analytics, document recommender systems, trend forecasting, dashboard building and other typical machine learning problems.This position is available as an Aerospace Corporation Member of the Technical Staff or Senior Member of the Technical Staff.Key FunctionsDevelop analytics, machine learning, and software solutionsMaintain awareness of cutting-edge machine learning/deep learning, computer vision, and natural language processing techniques and researchRecommend innovative approaches to solving nationally important analytical challengesWork individually and as part of a cross-organizational data science teamSummarize and present analysis findings to corporate and government customersQualificationsRequired QualificationsBachelors degree in a natural science, engineering, mathematics, economics or related disciplineTwo or more years of post-bachelor's degree related experience, which can include graduate studiesIn-depth knowledge of Statistical methods and Machine Learning MethodsComfortable working with messy structured data sets and turning them into machine learning productsFamiliar with Statistical, Machine Learning and Data Processing Libraries in Python, Scala or JuliaExperience with non-structured data, signal data, text, or imageExperience building Deep Learners and Shallow feature extractors in Tensorflow or Keras (or similar)Experience in either Natural Language Processing (recommenders) or Computer VisionAble to distill business and engineering problems into data-driven problemsSQL/NoSQL skillsU.S. Citizen, with the ability to obtain a Secret clearancePreferred QualificationsGraduate degree in a STEM fieldExperience with AWSExperience with virtual containers (Docker, etc.)Experience with Hive, Pig, Hadoop, or SparkExperience with D3 and FlaskKnowledge in Design of ExperimentsQUALIFICATIONS FOR SENIOR MTSRequired QualificationsBachelors degree in natural science, engineering, mathematics, economics or related disciplineFive or more years of post-bachelor's degree related experience, which can include graduate studiesIn-depth knowledge of Statistical methods and Machine Learning MethodsComfortable working with messy structured data sets and turning them into machine learning productsExperience with Statistical, Machine Learning and Data Processing Libraries in Python, Scala or JuliaExperience with non-structured data, signal data, text, or imageExperience building Deep Learners and Shallow feature extractors in Tensorflow or Keras (or similar)Experience in either Natural Language Processing (recommenders) or Computer VisionAble to distill business and engineering problems into data-driven problemsSQL/NoSQL skillsU.S. Citizen, with the ability to obtain a Secret clearancePreferred QualificationsGraduate degree in a STEM fieldExperience with AWSExperience with virtual containers (Docker, etc.)Experience with Hive, Pig, Hadoop, or SparkExperience with D3 and FlaskKnowledge in Design of ExperimentsTranscript RequirementTranscripts are required for this position.Additional Requisition DetailsSystem Job Title: MEMBER-TECH STF Clearance Requirement: Secret Access: None Polygraph: None Relocation Available: Yes Employment Type: Regular Work Schedule: Full Time Company StatementThe Aerospace Corporation has provided independent technical and scientific research, development, and advisory services to national security space programs since 1960. We operate a federally funded research and development center (FFRDC) for the United States Air Force and the National Reconnaissance Office, and support all national security space programs. We also apply more than 50 years of experience with space systems to provide critical solutions to technologically complex systems in such areas as communications, shipping, law enforcement, and cyber, among others.From our inception, our highly skilled technical staff has focused on ensuring the success of every mission and developing the most effective and economic space-related hardware and software in the world. Our greatest asset is the technical expertise of our people. Our state-of-the-art laboratory facilities are staffed by some of the leading scientists in the world.Equal Opportunity CommitmentThe Aerospace Corporation is an Equal Opportunity/Affirmative Action employer. We believe that a diverse workforce creates an environment in which unique ideas are developed and differing perspectives are valued, producing superior customer solutions. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, gender, gender identity or expression, color, religion, national origin, sexual orientation, protected veteran status, or disability status.You can also review The Equal Employment Opportunity is the Law poster and the supplement, as well as the Pay Transparency Policy Statement."}