{"jobID": "2747568756", "jobLocation": "New_York_NY", "jobTitle": "Lead Data Warehouse Developer", "companyRating": "3.1", "companyInfo": {"Website": "www.vnsny.org", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1893", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "116000", "jobDescription": " Overview Visiting Nurse Service of New York (VNSNY) is the nations largest not-for-profit community-based health system. VNSNY provides a comprehensive array of home- and community-based programs, including health plans, tailored to the needs of high-risk, vulnerable New Yorkers, improving their quality of life. Each day,more than 18,000 VNSNY employees including nurses, rehabilitation therapists, social workers, dieticians, other allied professionals, and paraprofessionals deliver compassionate care, unparalleled medical expertise, and 24/7 solutions and resources tomore than35,000 patients, helping them to live the best lives possible. Responsibilities Education: Bachelors degree in Computer Science, Information Systems, or a related field of Engineering required. Experience: Minimum five years with development of ETL framework; creation of mappings, mapplets, sessions, worklets, and workflows; development of Oracle database for data warehouse projects which includes using database parameters and variables, writing complex SQL queries, and performance tuning of SQLs; Unix/Linux shell or Python scripting, work w/advanced scheduling tools such as Autosys, Control-M or Tivoli required. Experience with performance tuning techniques on mapping and session levels (DTM buffer/block size configurations, partitioning etc.) required. Working knowledge of data modeling, and conceptual, logistical and physical modeling of data warehouse systems projects required. Experience with PL SQL functions, procedures and packages required. Knowledge of SQLServer SQL queries and T-SQL procedures required. Familiarity with Oracle SQLLoader, BCP or other data loading tools. Familiarity with NoSQL databases and general Big data concepts and technologies required. Ability to work independently, take initiative and contribute to new ideas required. Familiarity with cloud related technologies as related to data integration required. Working knowledge of an analytics platform/Visualization tool such as Oracle OBIEE, Microstrategy or Tableau required. CA2018"}