{"jobID": "2705441440", "jobLocation": "Mountain_View_CA", "jobTitle": "Senior Sales Data Analyst - Technical", "companyRating": "3.7", "companyInfo": {"Website": "www.upwork.com", "Headquarters": "Mountain View, CA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "81000", "jobDescription": "Upwork is the world's largest freelancing website. Each year $1.5 billion of work happens through Upwork, allowing businesses get more done and helping professionals break free of traditional time and place boundaries and work anytime, anywhere on projects they love. At Upwork, you'll help build on this momentum. Together, we'll create economic and social value on a global scale, providing a trusted online workplace for businesses to connect with extraordinary talent and work without limits.The Upwork Analytics team harnesses all of our data to inform and empower the company with insights about the business. As the technical Senior Sales Data Analyst you will lead all aspects of the Sales data pipeline including data source integrations, ETL processes, master data management, reporting requirements and dashboard delivery. You will make a significant impact within our growing organization, as you own the development and management of our analytics stack for Sales. This is a true career opportunity with tremendous professional upside for you, with your true passion for turning data into a strategic asset that scales with the company. Your Responsibilities:Project manage strategic projects in our data warehouse architecture and ETLsImplement and run reporting through front end analytics systems to drive self-service functionalityDevelop models and reports and monitor the validity of the data across various data storesCollaborate with the DBA, IT and Product teams to ensure data integrity and reliabilityCapture requirements from business users and product managers to define business metrics toward product strategy, business optimization, and issue resolution"}