{"jobID": "2783668469", "jobLocation": "Boston_MA", "jobTitle": "Data Analyst", "companyRating": "4.2", "companyInfo": {"Website": "www.criteo.com", "Headquarters": "Paris, France", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Public (CRTO) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " MediaMath, Conversant, AppNexus"}, "estimatedSalary": "87000", "jobDescription": "Who we areAt Criteo, we connect 1.4 billion active shoppers with the things they need and love. Our mission is to create an open, transparent and fair marketing ecosystem. With more than $600 billion in annual commerce sales and 600 terabytes of daily shopper data, we deliver performance at scale. And, with over 30 offices across the world, our company DNA is truly international. Do you want to have an impact on more than half of the worlds internet users? Join us and be part of something big.Criteo is in search of a passionate, highly motivated Data Analyst to join our Mid-Market Data Science & Analytics team in Boston, MA. You will be working closely with the Strategic Accounts team focused on our largest Mid-Market clients to optimize their campaigns, present actionable insights, and answer challenging analytical questions. The position involves technically rigorous work, including the use of SQL, Excel, Hive, Python, and other leading-edge data tools.Criteos high-growth business model brings both opportunities and challenges. This position involves dealing with a considerable amount of complex, real-world data and requires a candidate who is comfortable thinking of new and innovative ways to analyze data and solve problems. We are looking for a team player who will work with cross-functional business units (Account Strategy, Creative, Technical Solutions, Sales, Analytics) to turn data solutions into business solutions. The ideal candidate will be able to properly convey the business impact of their analysis to both technical and non-technical audiences.What you will be doing: Develop a deep knowledge of Criteos technology, products, and position in the marketplaceProject Manage and leads the prioritization of technical projects that drive efficiencyEnsure client and commercial requests are tracked and distributedLeverage Python, R, and SQL to answer commercial requestsOwn and maintain reports in Tableau, R and other data visualization toolsConduct ad-hoc analysis, problem-solving, and troubleshootingWhat we need:Bachelors degree or higher in a quantitative field (Mathematics, Computer Science, Engineering, Physics, Economics, etc.)0-2 years of work experience, with a strong desire to be within the analytics and data science industryGood communication skills and the ability to present & defend results to both technical and non-technical audiences.Strong intellectual curiosity and ability to structure and solve difficult problems with minimal supervision.Conceptual and practical understandings of relational databasesInterest in internet advertising technology & the role of marketing channelsKnowledge of SQL & ExcelExperience in any of the following is a plus: Python, R, Tableau, Hive/Hadoop, Vertica#LI-BD1At Criteo, we dare to be different. We believe that diversity fuels innovation and creates an energy that can be seen and felt all over Criteo. We champion different perspectives and are committed to creating a workplace where all Criteos are heard and feel a sense of belonging.Criteo collects your personal data for the purposes of managing Criteo's recruitment related activities. Consequently, Criteo may use your personal data in relation to the evaluation and selection of applicants. Your information will be accessible to the different Criteo entities across the world. By clicking the \"Apply\" button you expressly give your consent."}