{"jobID": "2783600722", "jobLocation": "Burbank_CA", "jobTitle": "Customer Relationship Management (CRM) Data Analyst – Project Hire", "companyRating": null, "companyInfo": {"Website": "disney.go.com/disneypictures", "Headquarters": "Burbank, CA", "Size": "201 to 500 employees", "Founded": " 1923", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Summary: It’s the magic of immersing yourself in a motion picture masterpiece, or a new track from your favorite band, or the spectacle of a live Broadway show. It’s hard to define and even harder to create, but that’s what we do at The Walt Disney Studios. Ours is a culture of innovation, collaboration and creativity. We raise the bar, then step over it, blazing trails through the production and distribution of world class entertainment around the globe. If you want to help tell compelling, enduring stories through movies, music or stage plays, then we want to hear from you.  Are you curious, creative, and love data? Do you love to learn new things and collaborate with stunning colleagues to solve hard and interesting problems? Do you want to be on the cutting edge of breakthroughs in data and analytics, encouraged to discover, challenged to think bigger, and supported to learn new things personally and professionally? Do you love the challenge and excitement that comes with not knowing today, what problem you might be working on tomorrow? Do you thrive in a high paced environment? Do you want to “make a difference” with the work you do?  The Walt Disney Studios seeks a Business/Data/Social Analyst to join the Studio Consumer Insights & Analytics team. This team is a highly visible department that plays an integral part in key business decisions across the Studio organization and the company. The goal of the Analytic Insights team is to create a competitive advantage for TWDS by leveraging data and advanced analytics. This position requires passion, curiosity, analytical, and story-telling skills. This position also requires the ability to work closely with business segments to gain perspective and a strong understanding of objectives. A curious, proactive, independent, high-energy, positive attitude is a must. The Business/Data/Social Analyst is responsible for segmentation and personalization of the contact strategies for Disney Movie Rewards and Disney/Lucas/Marvel/Pixar home entertainment CRM efforts. As an integrated member of the team, the CRM Data Analyst leverages the Studio consumer database to provide comprehensive analysis and reporting on campaign performance across promotions & email campaigns.  This is a 12 month project hire role.  Responsibilities: Manage day to day operation of email execution including scheduling, segmentation, and analysisLeverage both known and unknown user data to delivery personalized and dynamic contentCollaborate with CRM marketing leads on strategizing the development of both targeted and triggered based life-cycle campaignsUnderstanding client requirements in regards to business intelligence, reporting, and analyticsDesign and analyze surveys to measure impact of marketing tactics & understand consumer behaviorDevelopment of prototype solutions, reports and dashboards, and robust analytics to support analytic insights and visualization of complex data setsProvide optimization recommendations that drive KPIs established by CRM teamDeliver timely analytics and dashboards to support decision-making including website, product, and marketing efforts \u2028Leverage analytical tools (Omniture and Google Analytics) to understand onsite behavior, e.g. click through rates, golden pathways, conversion analysis, marketing effectivenessDevelop and deploy testing hypotheses and analyze test results, providing the necessary analytical rigor to ensure data quality, consistency, repeatability, and accuracy of insightsAsk and answer the next question(s) after gathering and analyzing the data to make insights more powerful – not just delivering what was asked for!Apply data science skills to develop more advanced solutions that drive action in the businessDesire to participate in an “Open Source” learning environment where sharing, documenting, teaching, and collaborating with others is the cultureAdvocate compliance based on best practice knowledge around permission-based marketing, privacy, SPAM/CASL regulation, deliverability, corporate guidelines and email browser compatibilityBasic Qualifications:1-3 years of experience in CRM Analytics including CPA, LTV, Attribution Modeling, Reward Redemptions & ROI analysis1 -3 years of experience with SQL and/or Spark SQL1-3 years of experience as a data analyst with experience in Adobe AnalyticsExperienced with maintaining a loyalty/rewards programs and its disciplines (acquisition, retention & win back strategies)Solid capabilities for analyzing email marketing & other digital marketing channelsProficiency with social media analytics provided by Facebook, Twitter, YouTube, and InstagramAbility to extract data and combine with other data sources to develop a rich, complete picture for the businessAbility to tell a story with data – What does the analysis tell you? What do you think the business should do next? Why do you think what is happening, is happening? Ability to influence others with the story of what you’re seeing in the data to make business recommendationsAbility to communicate complex and technical concepts to non-technical users and translate insights into actionable business recommendationsAbility and desire to lead projects independently from start to finish, working with internal and external teams to make decisions and maintain momentumExcellent time and project management skills, with the ability to manage detail work and communicate project status effectively to all levelsProven track record in meeting aggressive deadlinesStrong proficiency in MS Excel & PowerPoint/KeynotePreferred Qualifications:Google Optimize, Databricks experienceMachine learning experienceExperience with any common BI tools such as Cognos, Business Objects, Microstrategy, or Tableau desiredPrevious experience with a major media company (film/TV/digital), particularly on the content distribution/acquisition sideKnowledge of integrated marketing and D2C disciplines (including email, push notifications, SMS, and custom audience) Required Education Bachelor degree in a field of analytic study About The Walt Disney Studios:For over 90 years, The Walt Disney Studios has been the foundation on which The Walt Disney Company was built. Today the Studio brings quality movies, music and stage plays to consumers throughout the world. Feature films are released under the following banners: Disney, including Walt Disney Animation Studios and Pixar Animation Studios, Disneynature, Marvel Studios and Lucasfilm. The Disney Music Group encompasses the Walt Disney Records and Hollywood Records labels, as well as Disney Music Publishing. The Disney Theatrical Group produces and licenses live events, including Disney on Broadway, Disney On Ice and Disney Live!. Ours is a culture of innovation, inspiration and collaboration that brings together visionary artists, gifted technologists and savvy business minds to conjure up magical entertainment experiences for a global audience.About The Walt Disney Company:The Walt Disney Company, together with its subsidiaries and affiliates, is a leading diversified international family entertainment and media enterprise with the following business segments: media networks, parks and resorts, studio entertainment, consumer products and interactive media. From humble beginnings as a cartoon studio in the 1920s to its preeminent name in the entertainment industry today, Disney proudly continues its legacy of creating world-class stories and experiences for every member of the family. Disney’s stories, characters and experiences reach consumers and guests from every corner of the globe. With operations in more than 40 countries, our employees and cast members work together to create entertainment experiences that are both universally and locally cherished.  This position is with Walt Disney Pictures, which is part of a business segment we call The Walt Disney Studios.  Walt Disney Pictures is an equal opportunity employer. Applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Disney fosters a business culture where ideas and decisions from all people help us grow, innovate, create the best stories and be relevant in a rapidly changing world."}