{"jobID": "2828882593", "jobLocation": "Milpitas_CA", "jobTitle": "HR Intern", "companyRating": "3.7", "companyInfo": {"Website": "www.kla-tencor.com", "Headquarters": "Milpitas, CA", "Size": "5001 to 10000 employees", "Founded": " 1976", "Type": " Company - Public (KLAC) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Applied Materials, Nanometrics"}, "estimatedSalary": "88000", "jobDescription": " Company Overview  KLA-Tencor Corporation, a leading provider of process control and yield management solutions, partners with customers around the world to develop state-of-the-art inspection and metrology technologies. These technologies serve the semiconductor, data storage, LED, and other related nanoelectronics industries. With a portfolio of industry-standard products and a team of world-class engineers and scientists, the company has created superior solutions for its customers for more than 35 years. Headquartered in Milpitas, Calif., KLA-Tencor has dedicated customer operations and service centers around the world. Additional information may be found at www.kla-tencor.com.  Group/Division  Human Resources partners with management to attract, develop, engage and retain highly qualified people globally to meet the business' needs. HR is responsible for designing and implementing the company's talent management tools and processes, and for delivering consultative services to management in support of talent decisions. Our primary areas of strategic focus include: Talent Acquisition, Individual and Organizational Assessment and Development, Performance Management, Inclusion and Engagement, and Rewards. Responsibilities KLA-Tencor is looking for two high-energy and learned HR interns for some exciting projects this coming summer in the sunny and exciting high tech haven of Silicon Valley!  This position delivers high quality analysis, problem solving, and human capital management recommendations to HR leaders at KLA-Tencor while participating in the execution of corporate level project(s). The individual in this role will assume responsibility for all or part of a major HR project in alignment with HR strategic and/or operational goals and will interact with both the corporate team to which they are assigned and the greater HR community to complete the assigned project(s).  Potential project topics could include the following: Developing manager skillsMapping external suite of competencies with internal customer feedback to create manager training and effective coaching relationships.Career path for technical resourcesResearch on trends for career growth and development, especially in flat, nimble engineering organizations.Provide recommendations on how KT should articulate career expectations at time of hiring and for existing ees, what skills it should develop in its different employee segments (early career, mid-career, senior), how it should incent engineering top talent looking for growth, and how to manage their performance, goals and objectives within PMP.Job levelingComparing benefits of job levels vs. grades for executing talent management initiatives.Work with the KT compensation team on execution of job levelling as a talent initiative.Knowledge retention for successionCreating a supportive environment to collect and retain institutional knowledge and expertise during planned transitionTransition to different roles, or planned exits from the company, create knowledge gaps that can hinder succession plans and productivityExamining knowledge and skills that are most prone to be lost, and recommend actions to retain the sameFuture of work trendsMaking KT an attractive place to work by adopting technological, economic and sociological trends in the workforce and work habitsReviewing emerging trends in talent managementExamining their applicability in KLA-Tencor's culture and industry Preferred Qualifications Excellent project management skillsStrong analytical capabilitiesAbility to apply concepts and theories from behavioral and management sciences to achieve organizational capability and competitive advantageStrong consultative and relationship building skillsSuperior written and verbal communication and interpersonal skills; team player; customer and results oriented; positive influencing skillsMust demonstrate perseverance, team workAbility to work collaboratively across the business units and corporate functions and partner with individuals across different geographies, as neededCuriosity about how the different parts of a business worksMinimum Qualifications Currently enrolled in 2 year graduate program in HR/OD with immigration authorization to undertake corporate internship projects.  Equal Employment Opportunity  KLA-Tencor is an Equal Opportunity Employer. Applicants will be considered for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other characteristics protected by applicable law."}