{"jobID": "2784005119", "jobLocation": "Austin_TX", "jobTitle": "Software Engineer Graduate Intern", "companyRating": "3.8", "companyInfo": {"Website": "www.intel.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1968", "Type": " Company - Public (INTC) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": "Job DescriptionAs a Test Development Engineer Intern you will be involved in activities such as Develop test plans for Advanced Multicore Communication Processor modulesUnderstand the functionality of the Next Generation Communication processor and develop application to test various functional blocks.Write and execute test plans for customer environment and applications.Hands-on test execution and automationReport issues found during test execution, and track them to completion.Work closely with manager and team lead to reproduce and resolve problems, reported from field.Coordinate with other team members.-Must be a team playerQualificationsYou must possess the below minimum qualifications to be initially considered for this position. Experience listed below would be obtained through a combination of your school work/classes/research and/or relevant previous job and/or internship experiences. Minimum Requirements:Must be pursuing a M.S. program in Electrical Engineering, Computer Engineering, or Computer Science.Minimum of 6 months of experience with: Programming and scripting experience in CNetworkingTCP /IP protocolsPreferred Qualifications:Experience with multicore CPUs PPC/MIPS/ARM/x86 Logic design, synthesis and simulation.HW and SW debugging skillsInside this Business GroupThe Data Center Group (DCG) is at the heart of Intels transformation from a PC company to a company that runs the cloud and billions of smart, connected computing devices. The data center is the underpinning for every data-driven service, from artificial intelligence to 5G to high-performance computing, and DCG delivers the products and technologiesspanning software, processors, storage, I/O, and networking solutionsthat fuel cloud, communications, enterprise, and government data centers around the world.Posting Statement. Intel prohibits discrimination based on race, color, religion, gender, national origin, age, disability, veteran status, marital status, pregnancy, gender expression or identity, sexual orientation or any other legally protected status."}