{"jobID": "2750111799", "jobLocation": "San_Jose_CA", "jobTitle": "Staff Systems Engineer", "companyRating": "2.8", "companyInfo": {"Website": "www.labcyte.com", "Headquarters": "San Jose, CA", "Size": "201 to 500 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " TECAN U.S., Hamilton, EDC Biosystems"}, "estimatedSalary": "108000", "jobDescription": " JOB #272Staff Systems Engineer  Location: San Jose, CALabcyte Inc. seeks a highly motivated candidate to join its R&D; System Engineering team. This position involves the development of new liquid handling instrumentation, process optimization, acoustic transfer optimization, and sustaining engineering for Labcyte’s capital equipment and consumable products. Qualified candidates must be able to work independently and as a member of multi-disciplined development teams, executing tasks on-time and to spec. Development responsibilities may include system specification and design, signal processing, algorithm development, design verification testing, and technology transfer to Manufacturing.Job Responsibilities Work with team to define detailed technical specsParticipate in research and design targeting new features and methodsSupport engineering team in testing of subsystemsLead system integration planning and executionDefine and execute design verification test planDefine and execute product validation test planDevelop procedures and required tools for Manufacturing and Service system testTrain Mfg. and Service personnel on system test proceduresSupport Mfg. personnel during production ramp-up Education, Skills, Experience, and Requirements BS with >10 years experience, MS with >6 years, or PhD with >3 years in Physics or Engineering (BioMed or EE)5-10 years of experience in the development, test, and analysis of analytical instrumentation or complex electromechanical equipment.Skills and Attributes Required Superior problem solving skillsAnalytical, methodical, and detail-oriented in planning, experimentation, and analysisDemonstrated ability to integrate, test, and troubleshoot electronic, mechanical, and software subsystemsExperience with a compiled programming language such as C, C++, or C#Experience with scripting languages such as python or MATLABExperience with statistical analysis, data analysis and data reduction techniquesTenacious and deadline drivenExcellent communication skills, both written and verbalDemonstrated contribution in delivering capital equipment instrumentation from concept to marketExperienced with lab measurement tools for electrical, optical, and mechanical technologiesDetail and quality orientedA `can do` attitude and the desire to learnDesirable Skills and Attributes: Modeling of physical systemsMachine learning experienceUnderstanding of fluids, and fluid/solid interface issues.Good understanding of image or signal processingExperience using statistics and DOE methods for process optimizationAbility to design test fixturesProject management experienceSome knowledge of chemistry and good lab practicesLOCATION: San Jose, CA  Candidates only, no recruiters or agencies.About LabcyteLabcyte, a global biotechnology tools company headquartered in San Jose, California, is revolutionizing liquid handling. Echo liquid handling systems use sound to precisely transfer liquids. Labcyte instruments are used worldwide by all twenty of the top twenty pharmaceutical companies, as well as by small to mid-size pharmaceutical companies, biotechnology firms, contract research organizations and academic institutions. Labcyte’s customers work across a wide spectrum of biology including drug discovery, genomics, proteomics, diagnostics, imaging mass spectrometry."}