{"jobID": "2786393104", "jobLocation": "Pleasanton_CA", "jobTitle": "Senior Tax Accountant", "companyRating": null, "companyInfo": {"Website": "www.depretis-cpa.com", "Headquarters": "Pleasanton, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Unknown", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Overview We are seeking a self-starter with excellent client service skills to join our team. We do not departmentalize, so this individual will work on tax, accounting and consulting engagements.  The Senior Tax Accountant will primarily be responsible for the preparation of income tax returns for individuals and businesses of all entity types, including the analysis of financial statements, preparation of accounting adjustments, and tax research as applicable. This individual will also assist with preparing tax plans and recommending tax strategies to our clients. Why DePretis CPAs? At DePretis CPAs, we believe that people matter more than business. That's why we do our best to offer our team members a place where they can cultivate a rich and rewarding career without having to sacrifice the things that matter most in life.  If you are an experienced tax professional seeking a lifestyle change (or want to reduce your commute) that will better balance your professional and personal life, we invite you to apply for a position with our firm! Three reasons to join the team at DePretis CPAs: OPPORTUNITY—we offer the opportunity for limitless professional growth by combining technical training with direct client engagement. BALANCE—we work together with our team members to find an arrangement that complements their unique lifestyle and family needs, while also helping them to achieve their career goals. ENVIRONMENT—we offer a low-stress atmosphere which is evidenced by higher productivity and low staff turn-over. Key ResponsibilitiesPrepare federal and state income tax returns for all entity typesRecommend tax strategies by researching federal, state and local tax issuesDevelop and maintain ongoing business relationships with clientsIdeal Candidate Profile3+ years of recent tax experience in a CPA firmUndergraduate degree in AccountingCPA License (preferred)Exceptional oral and written communication skillsHighly motivated to learn and produce excellent workWorks effectively with team membersPositive attitude and high ethical standardsBenefitsFull-time or Part-time schedules available to balance professional and personal life15+ days of PTOEligible for bonus programParticipation in Group Health Insurance401(k) Plan available"}