{"jobID": "2795116504", "jobLocation": "Santa_Clara_CA", "jobTitle": "Business Development Representative", "companyRating": null, "companyInfo": {"Website": "www.datastax.com", "Headquarters": "Santa Clara, CA", "Size": "201 to 500 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Are you looking for the opportunity to contribute momentum to a high velocity, rapidly scaling company? Then were looking for you!  Industry leading companies, who are disrupting and evolving the way companies and customers do business globally, use DataStax technology. We are seeking a Business Development Representative to help take DataStax to the next level. As a BDR, you are responsible for aggressively prospecting, identifying, qualifying and developing the sales pipeline. This role is the first step in the selling process, and presents the first impression of DataStax to our prospective customers. Were seeking highly professional, enthusiastic hunters with a sales orientation and a drive to succeed. Essential Job Functions:Aggressively identify qualified sales opportunities in enterprise accountsInteract with benefactors, application architects and designers, and business decision makers via telephone and emailUpdate lead and prospect activity in Salesforce.com to ensure effective lead managementObtain thorough knowledge of the prospects potential use cases, while identifying the business outcomes to which DataStax will align.Work closely with Field Account Executives and Professional Services to understand the territory and the plans to grow the customer baseNurture early phase opportunities for future pipeline potential.Qualify marketing leads and make introductory appointments for account executivesAchieve or exceed all monthly and quarterly qualified opportunity quotasJob Requirements:Fluency in English Required. Multilingual in regional languages, preferred.Excellent knowledge of sales development best practices; successful track record of account research and discoveryA team player with a positive outlook and high energy3+ years of Sales and Lead Generation experience, with track record of meeting and preferably exceeding targeted goals, is highly preferred.Proven track record of exceeding measurable goals in a highly automated metrics based phone and email-based sales environmentPossess the ability to confidentially navigate through all levels of an organizationPrior use of Salesforce.com and web conferencing tools such as Skype, Go-to-Meeting or WebEx a plusExcellent written and verbal communication skillsBachelors degree preferredLocation: Santa Clara"}