{"jobID": "2747020348", "jobLocation": "San_Jose_CA", "jobTitle": "Director, Omni Channel", "companyRating": "3.6", "companyInfo": {"Website": "www.firsttechfed.com", "Headquarters": "Mountain View, CA", "Size": "1001 to 5000 employees", "Founded": " 1952", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "124000", "jobDescription": " The Omni Channel Director will drive the strategic roadmap for all products related to Omni Channel– CRM and Online Account Opening - by creating and implementing the product vision, direction, and business plans. This role will lead a team of professionals and partner with key stakeholders to ensure digital Omni Channel products meet strategic goals. Qualified applicants must have a minimum of 7 years’ experience managing digital Omni Channel products, and 5 years’ experience leading a diverse team.  Here's what you can expect from the job and what you need to be successful: Job dutiesDrive the strategic roadmap for all products related to Omni Channel– CRM and Online Account Opening; create and implement the product vision, direction, and business plansMonitor staff performance and ensure team(s) work efficiently and quickly to meet aggressive service/production level timelinesPartner with key stakeholders including business units, retail, contact center, and other internal partners as well as external stakeholders to ensure digital Omni Channel products meet strategic goalsLead multiple large, complex and/or highly-visible programs that have significant financial, reputational, or regulatory risk, and requires deep and broad subject matter expertiseDesign, maintain, and deliver key performance indicator’s (KPI’s) and reporting to business leaders; identify opportunities to improve the employee and member experienceIdentify and manage potential areas of risk associated with existing and new digital Omni Channel products and policiesLead users and stakeholders to implement and support agreed upon solutions through consensus building and alignmentEssential skillsMinimum 7 years’ experience managing digital Omni Channel products required; experience within a bank or credit union a plusMinimum 5 years’ experience leading a diverse team including hiring, coaching and performance management requiredExperience in deploying products within a Scrum Agile environment a mustExperience delivering complex technology products and services in a high growth environment with a demonstrated ability to translate customer needs into business and product requirementStrong analytical skills, with the proven ability to make data driven decisions and draw insights from large data sets to iterate product enhancements quicklyDemonstrable strategic and operational business acumen with broad and deep technical knowledge and expertiseKnowledge of user experience and interaction design best practicesHands-on expertise in business process and data analysis, functional design, modeling, product development processes, and software testingBachelor’s degree in Business Administration or other related field of study or equivalent work experience; MBA preferredAgile or Lean Development certification preferredLocation: San Jose, CA 95134 First Tech is not currently offering Visa sponsorship or transfers I acknowledge that if hired by the company, employment is on an at-will basis. This means the company is free to terminate my employment at any time, with or without cause or advance notice. Similarly, I am free to terminate my employment with the company at any time for any reason. I agree to conform to the rules and regulations of the company, and I understand that the company has complete discretion to modify such rules and regulations at any time, except that it will not modify its policy of employment at-will."}