{"jobID": "2806746736", "jobLocation": "Boston_MA", "jobTitle": "Quantitative Analyst Intern", "companyRating": "3.8", "companyInfo": {"Website": "www.gmo.com", "Headquarters": "Boston, MA", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Private Practice / Firm", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "104000", "jobDescription": "Position Overview – Asset Allocation Quantitative Analyst Intern The Quantitative Research team within the Asset Allocation group is looking for a talented and driven individual to join our quantitative infrastructure development efforts. The team is responsible for conducting research across various asset classes to inform portfolio management decisions, which involves maintaining and enhancing the firm’s proprietary 7-year asset class forecasting framework.  The successful candidate will work on a number of projects related to improving robustness and breadth of the asset allocation quantitative research infrastructure. He/she will gain insights into Asset Allocation forecasting methodology, will participate in various research meetings and will be provided with opportunities to learn about and meet with other teams at GMO. This position is for the fall 2018 semester and may be a full-time or part-time internship. Intern Profile and RequirementsWorking on a degree in Computer Science, Applied Mathematics/Statistics, Engineering or similarHands-on experience with programming in Matlab, or another language like R, Python, Java, C# or JuliaProgramming proficiency in SQL is strongly preferredBasic understanding of statistics and econometric conceptsInterest in understanding the sources of returns for major asset classes, portfolio theory, value investing and financial historyExceptional attention to detailAbility to prioritize multiple tasks, set goals and meet deadlinesAbility to work effectively and efficiently with moderate supervisionEffective verbal and written communication skillsPosition ResponsibilitiesCreate and enhance interactive tools for analysis and visualization of the proprietary 7-year forecasts and other signals produced by the quantitative team.Improve and extend Asset Allocation’s research data libraries and data access.Assist various members of the Asset Allocation team with quantitative research and data inquiries.Department Profile The Asset Allocation team is responsible for managing multi-asset portfolios and conducting research across a variety of asset classes. The team values clarity of roles and decision-making while maintaining a culture of intellectual curiosity, debate, respectful disagreement, candor, and collegiality. Company Profile Founded in 1977, GMO is a private partnership committed to delivering superior investment performance and advice to our clients. We offer strategies where we believe we are positioned to add the greatest value for our investors. These include multi-asset class portfolios as well as dedicated equity, fixed income, and absolute return offerings, many of which employ the firm’s proprietary 7-year asset class forecasting framework. Our client base is comprised primarily of institutions, including corporate and public defined benefit and defined contribution retirement plans, endowments, foundations, and financial intermediaries.  GMO, whose sole business is investment management, employs approximately 500 people worldwide and is headquartered in Boston with offices in San Francisco, London, Amsterdam, Sydney, and Singapore. We manage roughly $70 billion in client assets using a combination of top-down and bottom-up approaches that blend traditional fundamental insights with innovative quantitative methods to identify undervalued asset classes and securities. Our valuation-based approach embeds several key factors, including: a long-term investment horizon, discipline, conviction, and a commitment to research. Our research emphasizes not only identifying and exploiting pricing dislocations but also understanding the long-term drivers of return in the markets in which we invest. We are known for our candor in sharing our views with clients and for our willingness to take bold, differentiated positions when opportunities warrant."}