{"jobID": "2827319768", "jobLocation": "Round_Rock_TX", "jobTitle": "GBO Data Scientist - Sr. Advisor", "companyRating": "3.8", "companyInfo": {"Website": "www.dell.com", "Headquarters": "Round Rock, TX", "Size": "10000+ employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " IBM, Apple, HP Inc."}, "estimatedSalary": "111000", "jobDescription": "Data Scientist Sr. Advisor: The Global Business Operations Sales & Talent Analytics team supporting Commercial Sales is looking for a Data Scientist to join the team. This individual will be responsible for identifying, defining, analyzing and recommending best practices for improving the effectiveness of Dell's Sales Talent Lifecycle (sales rep recruitment/hiring/development/retention), the productivity of Dell Sales teams, and the growth of Dell's overall business. The team member will use robust data analytics skills and work with internal stakeholders and external partners to provide insights and recommendations on projects such as predictive hiring models, improvement of new-hire sales ramp time, effectiveness of sales onboarding/training programs, sales productivity models, sales efficiency metrics, and build specific actionable recommendations to improve Sales performance and Customer experience.  Assists Commercial senior management with tracking implementation and monitoring effectiveness of organizational changes, including designing analytical approaches, data collection and analysis, report writing, tracking project tasks, and helping to ensure the overall success of the department. Works under general supervision. Also, supporting strategic and operational projects from ideation through execution. Role Responsibilities:Design, develop and program methods, processes and systems to consolidate and analyze unstructured data from multiple sources to generate actionable insights and solutions.Produce actionable and compelling recommendations by interpreting, exploring, identifying and communicating insights discovered from complex data sets.Support the full project lifecycle from ideation through launch. Work cross-functionally to gain buy-in, support, and assistance.Establish strong relationships with HR, LnE, sales, and be a thought leader to take Dell's GTM to the next level.Create projections that include multiple scenario and provide what-if functionality. Lead activities in defining the scope of smaller projects and actively participates on a number of other projects, including developing project plans, and ensuring forward momentum of projects toward stated goals. Tracks and monitors project work plans, including objectives, tasks and time frames to ensure deliverables are completed on time. Responds to changing project circumstances and communicates issues to project leadership. Takes a flexible, team player approach, willing to pitch in whenever and wherever needed.Collects and analyzes data required for projects. Summarizes, creates, and distributes reports as needed.Writes reports, presentations, memos and other communications as needed. Coordinates report production as needed.Participate in special projects and performs other duties as required.Interacts with business leaders to understand business strategy, conditions, and problem areas.Partners with both internal & external sources to gather & examine data from disparate sources with the goal of discovering previously hidden insights.Develops and codes software programs, algorithms and automated processes to cleanse, integrate and evaluate large datasets from multiple disparate sources.Develop and implement predictive models, optimization algorithms and probability enginesVerifies model and algorithm effectiveness based on actual results.Academic requirements:Masters in Data Science, Statistics, Business Analytics, Mathematics, operations research, management science, industrial engineering or Computer Science. PhD preferred.Good academic record.Skills Requirement:Statistical and Mathematical Modeling experience with attention to detailKnowing areas of application and limitations of: Multivariate regression, logistic regression; decision trees, regression trees, boosting and bagging, HLM; ANOVA; categorization and cluster analysis; techniques of re-sampling parametric/non-parametric bootstrap, MCMC; optimization tasks.Excellent communication skillsAttention to details and ability to work with ambiguityKnow and understand statistical limitations of data; keen understanding of analysis of variance.Research and develop new forms of analytic methods to achieve business objectives.Ability to explain statistical approaches/models used, rationale/merits of different approaches, results and 'visualized' results to team membersDemonstrated excellence in handling ambiguity, working in multi-disciplinary teams, having a can-do attitude and strong desire to learn & developExperience:4 years of work experience Prior relevant experience in data management, automation, IT programming, financial forecasting, data mining or statistical modeling.Proficient with Tableau, Advanced Excel (including Pivot tables, Lookups, Macros, etc), Access, and Power Point required. Strong capability with SQL and willingness to become expert with building queries / manipulating. Interest in statistical programming including R preferredProject management and facilitation skills required."}