{"jobID": "2642645789", "jobLocation": "New_York_NY", "jobTitle": "Licensed Real Estate sales agent", "companyRating": null, "companyInfo": {"Website": "www.calibernyc.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " Unknown / Non-Applicable", "Competitors": " Keller Williams, Citi Habitats, TRIPLEMINT"}, "estimatedSalary": null, "jobDescription": "CALIBER IS SEEKING ENTREPRENEURS WHO ARE READY TO CHANGE THEIR LIVES. Caliber is rewriting the rules for what it means to be a Real Estate Agent in New York City and it all  starts with you. Agent enrichment, training, and motivation is our number one priority and we  work relentlessly to ensure agent satisfaction. Each prospective agent is hand-selected and vetted  by management for cultural fit, expertise, and attitude. With over $100M in annual transaction  revenue and 150 agents and counting, Caliber is growing at an unprecedented rate with  competitive year over year growth. Are you ready to build your real estate legacy? CALIBER HAS COMPETITIVE OFFERINGS: ● Unparalleled dedication to agent training and education. Caliber recruits industry  disruptors to host seminars and trainings in our offices.  ● Enjoy up to a 70% commission split and payroll processed weekly.  ● Quality sales and rental leads will be provided to you from day one through our  proprietary lead distribution system.  ● Caliber offers cutting-edge technology to every single agent including access to an  all-in-one agent dashboard that provides you with instant access to your client  interactions, CRM, latest listings, real-time availability and market data, and more.  ● We deploy a highly targeted and refined social media strategy every month that enables us  to reach over 1M New Yorkers and brings in more quality leads.  ● Hungry for more perks? Caliber offers complimentary access to Street Easy Broker  Premiere, professional listing photographers, digital staging software, marketing advice for  your listings, a flexible work schedule for every agent and gym membership incentives.  ● Caliber’s offices serve as an enclave for the city’s top real estate talent. Meet them through  some of Caliber’s exclusive agency events. IF THIS SOUNDS LIKE YOU: ● Licensed Real Estate Agent (or currently enrolled in licensing courses, which we can help  cover the cost of), and Bachelor’s Degree is a plus.  ● Meticulous, organized and detail oriented.  ● Motivated and entrepreneurial spirit -- not willing to take “no” for an answer and have a  relentless desire to be successful.  ● The pressure and thrill of the industry drives you to do better.  ● An ace multitasker with the ability to juggle multiple deals and responsibilities.  ● A tech-first thinker who loves the latest software and technology for the modern realtor.  ● You’re a people person who loves meeting new people and building relationships. Ready to apply? Caliber Management is excited to review your application.Get started: https://www.calibernyc.com/nyc_real_estate_careers"}