{"jobID": "2821200021", "jobLocation": "Sunnyvale_CA", "jobTitle": "ROCKSTAR MAINTENANCE TECHNICIAN", "companyRating": "3.9", "companyInfo": {"Website": "www.fpimgt.com", "Headquarters": "Folsom, CA", "Size": "1001 to 5000 employees", "Founded": " 1968", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "19", "jobDescription": " Property Name:CITRA-F35Full-Time/Part-Time: Full-time Years of Experience:1+Property Type: Conventional Valid Driver's License Required: Yes Bilingual Preference:N/ASoftware Skills Required: Basic Computer Skills Maintenance Skills Required: N/A, Basic Computer Skills, Complete Apartment Turns, Appliance Repair, Boiler Systems, Carpentry, Electrical, HVAC Certification, Landscaping and Grounds, Painting, Plumbing, Pool Certification, Rehab, Other Proposed Pay Rate: $DOE hourly (bonus eligible) Job Details:FPI Management is currently looking for a Maintenance Technician to join our team! OUR IDEAL CANDIDATE has verifiable work experience in an Apartment Maintenance or Facilities Maintenance role. Has the ability to be on-call, and has basic computer skills (email and internet). Is a self-motivated, customer service-oriented individual with exceptional attention to detail, and is someone who takes great pride in the quality of their work and is passionate about providing exemplary customer service! MINIMUM REQUIREMENTS for consideration are: a High School diploma or equivalent, English language proficiency (read, speak and write), and the ability to pass a full background check and drug screening (Note: As it relates to marijuana use, FPI will consider any applicable state law when dispositioning test results). Why look at FPI for your next career step? We are the 4th largest (THE largest in Affordable communities) third-party property management company in the Nation, an industry leader, with over 700 properties (over 100,000 units) across 14 states under our management. We offer comprehensive compensation and benefits packages, on-going training and professional development, and plenty of growth opportunities. Come join Team FPI! Interested? Click the Apply button above to learn more about this great opportunity to work with an industry leader! #WeAreTeamFPIEEO/EVerify Statements FPI Management is an Equal Opportunity Employer. All qualified applicants are encouraged to apply. FPI Management participates in the E-Verify program."}