{"jobID": "2225420083", "jobLocation": "Menlo_Park_CA", "jobTitle": "Line Cook at Largest Social Media Company", "companyRating": null, "companyInfo": {}, "estimatedSalary": "18", "jobDescription": "Line Cook – $19.95/hr – Full Benefits *Weekends Off* - Menlo Park, CA Looking to gain a work-life balance? Tired of working long hours? Want to really focus on why you got into this industry the first place? Do you want to be part of a team that provides the best food menu options to our customers while working in a fast-pace environment and supporting our mission of creating amazing, high-quality food dishes while having fun?  This may be your opportunity...if you think you are the best Cook in the industry that can deliver a broad-range of international cuisine then we encourage you to apply to this amazing opportunity before it goes away.  We are looking to support the largest social media company in the world with the best cooks in town.  As a Line Cook for our company you will be responsible for producing consistent quality food products through the use of standard recipes. While doing so you will follow all safety, local and state sanitation guidelines. Essential Functions: Follow production sheets, portioning and merchandising details as instructed by the Kitchen Manager, Sous Chef, and Executive ChefHas knowledge of and follows food safety and sanitation practices. Has Serve safe certification or level of knowledge.Responsible for setting up, organizing, cleaning & sanitizing their stations and the kitchen.Requirements:4+ years’ experience working in a high volume corporate casual/ or high volume kitchenRequires a positive attitude in a high volume fast paced environment.Ability to work under pressure in a fast-paced environment.Proficient knife skills, and understands how to read and execute a recipe.Must have a great attitude, be a team player, and have the ability to communicate with coworkers & customersMust have and maintain an active Food Handlers Card, as required by the California Health Department.Benefits:Above industry pay11 Paid HolidaysMedical, Vision, DentalDiscounted -80 hours of accrued sick and vacation 1st year401k -portion company matchYearly performance reviewsChild/Adoption fundsCareer Enhancement reimbursementsWEEKENDS OFFApply here:  http://www.flagshipinc.com/company/jobs?gnk=job&gni;=8ad8dbd13b809171013b8b1308b75d35&gns;=Other Job Type: Full-time Salary: $19.95 /hour"}