{"jobID": "2556940367", "jobLocation": "Santa_Clara_CA", "jobTitle": "Senior Graphics System Software Engineer", "companyRating": null, "companyInfo": {"Website": "www.nvidia.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1993", "Type": " Company - Public (NVDA) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We are the leading artificial intelligence computing company and are paving the way with innovations in self-driving cars, machine learning, supercomputing, gaming and visualization.  NVIDIA gives automakers, tier-1 suppliers, automotive research institutions, and start-ups the power and flexibility to develop and deploy breakthrough artificial intelligence systems for self-driving vehicles. Our unified computing architecture enables training deep neural networks in the data center, and then seamlessly runs them on NVIDIA Drive PX 2 inside the vehicle. Today, we are working with over 80 partners that are using our platform in the development of autonomous cars, trucks, shuttles, and taxis. What you’ll be doing:You will be working on our Automotive Graphics software stack, responsible for the development of our graphics system software, including safety-critical code.Providing technical leadership for team members working on graphics software, developing drivers, and hardening the system for production.Planning and executing on multiple projects with changing priorities and requirements.Design and implementation of Vulkan, OpenGL ES, and EGL drivers to support new HW features in collaboration with other software teams.Loves driving designs, architecture, new feature definition and process improvements within and outside of the team.What we need to see:BS or MS degree in Computer Science, Computer Engineering or Electrical Engineering.You have five plus years work experience with modern 3D graphics APIs like OpenGL, OpenGL-ES, Vulkan, or Direct3D.You have a strong software engineering, architecture, and design skills (8+ years).You will need to have excellent C/C++ programming and debugging skills combined with a dedication to solve hard problems.A deep understanding of 2D/3D graphics fundamentals.You have excellent analytical, communication and inter-personal skills. Ways to stand out from the crowd: Are you experienced with ISO 26262 software certification or Automotive SPICE?Do you have experience with the Agile development methodology?An in-depth knowledge of GPU and CPU architecture is a plusExperience with X11, Wayland, or similar window systems.Experience with ARM CPU architecture and hardware considerations (memory controllers, buses, caches, etc.).Flexibility to work and communicate effectively in a multinational, multi-time-zone corporate environment. NVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most brilliant and talented people in the world working for us and due to unprecedented growth, our premier engineering teams are rapidly growing fast. If you're creative, autonomous and enjoy having fun, then what are you waiting for, apply today!  NVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression , sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law."}