{"jobID": "2794315280", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.zoosk.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "113000", "jobDescription": "Are you looking to join a team that strives to bring a positive, real-life impact to the lives of millions of people? At Zoosk, we have the tremendous and rewarding challenge of facilitating meaningful connections between over 40 million users worldwide and growing. Our users span 80 countries worldwide and exchange millions of messages in 25 different languages every single day.Zoosk is seeking Senior Data Analyst to join our team. This person will study Zoosk’s massive database of rich behavior and preferences to identify interesting trends and signals.Data Analysts at Zoosk are a core part of the strategic decision making processes throughout the company. As a member of the Data team, your primary responsibility will be to work with department leaders to derive insights that improve business performance. This includes exploratory analysis of large data sets, metrics identification, report creation, and development/maintenance of analytics systems. This role will broadly influence the company’s products, operational effectiveness, and elevate the role of data as an asset to the business. The ideal candidate will be able to quickly derive insights from large data sets and translate findings into plain English. What you'll do:Conduct original research into what behavior leads to subscriptionsBuild statistical models that help us understand the significance of experimentation resultsWork with the BI team to create and tune machine learning modelsBuild reports, dashboards, and metrics to monitor the performance of our company and changes in user behaviorPresent findings to the senior leadership teamPartner with other departments to solve problems and identify trends/opportunitiesProvide advice and education in the usage and interpretation of data to business usersBuild sustainable, impactful reporting assetsDevelop new insights and analyses that inform decisions and help us continue grow the business while delighting our usersData mining, statistical analysis, and visualization of data to help understand how users are interacting with our product"}