{"jobID": "2828231021", "jobLocation": "Santa_Monica_CA", "jobTitle": "CTD 2018 Financial Analyst Internship", "companyRating": "3.6", "companyInfo": {"Website": "www.cbs.com", "Headquarters": "New York, NY", "Size": "5001 to 10000 employees", "Founded": " 2000", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "33000", "jobDescription": " CTD 2018 Financial Analyst Internship REF#: 31186 CBS BUSINESS UNIT: CBS Television Distribution  JOB TYPE: Paid Intern  JOB SCHEDULE: Part-Time  JOB LOCATION: Santa Monica, CA ABOUT US: CBS Television Distribution is the preeminent company in television syndication. CTD produces or distributes 10 first-run series, including the long-running, critically acclaimed hits Judge Judy, Dr. Phil, Entertainment Tonight, Wheel of Fortune, Jeopardy!, Inside Edition and Rachael Ray, and holds the largest distributed television library at 70,000 hours strong. CTD's popular off-network product includes the CSI, NCIS and Star Trek franchises, as well as classic series such as Everybody Loves Raymond and Frasier. In addition, CTD handles the domestic television distribution of CBS Television Studios, CBS News, CBS Films and Showtime. CTD is a unit of CBS Corp. For more information, go to [1] www.cbstvd.com.  References  Visible links http://www.cbstvd.comDESCRIPTION:PLEASE NOTE: THIS IS FOR CURRENT UNDERGRAD STUDENTS ONLY CBS Television Distribution is currently seeking a Financial Analyst Intern. The Financial Analyst Internship is an excellent opportunity for students to gain experience working in a fast-paced work environment in the entertainment industry. As an intern, you will be exposed to many different facets of the business cycle. Responsibilities include assisting with data gathering and fact-finding, data analysis and presentation of findings. You will prepare journal entries for monthly, quarterly and year-end closing. Other projects will be assigned as needed. This is a long term internship- one year commitment. QUALIFICATIONS:Required: Must be a Junior at an accredited college or university, majoring in Accounting or Finance. Knowledge of MS Excel, Word, and Oracle is preferable. Must be available to work at least 20 hours a week. Ideal candidate will be working towards a Bachelor's degree in Finance. One will possess demonstrated analytical and accounting skills and should be proficient in Microsoft Word and Excel. A team player who takes initiative is a must. One should have excellent interpersonal skills with the ability to think outside of the box. MUST BE IN SCHOOLEEO STATEMENT: Equal Opportunity Employer Minorities/Women/Veterans/Disabled"}