{"jobID": "2766755051", "jobLocation": "San_Francisco_CA", "jobTitle": "Territory Sales - IT Operations Management - Silicon Valley", "companyRating": "2.9", "companyInfo": {"Website": "www.microfocus.com", "Headquarters": "Newbury, United Kingdom", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (MCRO) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " SAP, EMC, Oracle"}, "estimatedSalary": "97000", "jobDescription": " At Micro Focus, everything we do is based on a simple idea: The fastest way to get results is to build on what you have. Our software solutions enable organizations to do just that. Secure and scalable, with analytics built in, they bridge the gap between existing and emerging ITfast-tracking digital transformations across DevOps, Hybrid IT, Security, and Predictive Analytics. In the race to innovate, Micro Focus customers have the clear advantage.  Our portfolio spans the following areas:  DevOps | IT Operations| Cloud | Security | Info Governance | Big Data, Machine Learning, & Analytics About the Role Micro Focus is seeking an experienced Territory Sales Representative to lead large accounts throughout the Pacific Northwest for Enterprise IT Ops software. Our portfolio includes: Performance & Availability Management, Hybrid Cloud Management, Service Management, Network Operations Management, Data Center Automation, Application Performance Management & Backup /Recovery Software.  In this role, you will: Apply understanding of Micro Focus strategy and portfolio to customer priorities and build a plan that drives revenue growth and customer success.Initiate sales activities to drive pipeline growth, close deals and ensure revenue goals are exceeded.Be a subject matter expert who understands the market and competitive landscape to deliver winning solutions for our customers.Qualifications3+ years successful of software sales experience in similar space/accounts with proven track record in negotiating large enterprise software deals.Demonstrated, verifiable achievement of consistent, over-quota attainment.Ability to navigate and collaborate across a matrixed organization to drive customer success.Bachelors degree preferred.Preferred Location: San Francisco, Bay Area  #LI-MC1"}