{"jobID": "2797056170", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.thestudiodubai.com", "Headquarters": "Dubai, United Arab Emirates", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " As the senior Data Analyst at The/Studio, you will be responsible for ensuring the data integrity systems and processes, measuring KPIs, and providing insights to every department to improve efficiency. You will work closely with the Executive Management team, Product, Operations and Marketing teams to identify data trends, issues, challenges and provide analysis of changes in data, data forecasts and suggest ideas for business performance optimization.  You are experienced in pulling actionable insights from large sets of data, measuring business performance, and running research using advanced analytical and experimental testing. You will play a central role in measuring the success and growth of all aspects of this disruptive marketplace business.  The ideal candidate will take ownership of experiments and analysis projects intended to continuously improve reporting quality, while also working to generate key insights, reports and analytics across systems and monitor all sides of our manufacturing-as-a-service marketplace.  This is a fantastic opportunity for an intellectual, curious and self-motivated person to make a significant contribution to disrupting an entire industry. What Youll DoEvaluate and select a cross-departmental analytics and/or BI platform and components for the companyWorking with the CEO, collaborate with multiple teams to define requirements and sources for reportingConduct hands-on data mapping, modeling/analytics, and analysis of data from disparate sources into clear, actionable insightsDefine, create and maintain forecasts, reports, and KPI dashboardsDevelop, evaluate, refine, and automate analytic models using data to address business needsPrepare visualizations of data in order to explain and persuadeProvide insights, analysis and recommendations to departmental heads and teamsDesign and analyze A/B and multivariate tests to drive KPI improvement (experience using Optimizely or similar A/B testing tools is desired)What You Need3+ years experience as a Data Analyst, preferably for a SaaS or software companyBS/BA with a focus in a quantitative field (i.e. finance, mathematics, statistics, economics, etc.)Ability to work independently, be self-motivated and results-oriented, while working in sync with other teamsGoogle Analytics management experience, including custom events and attributionExperience creating dashboards using Google Data StudioStrong analytical and data mining skillsAdvanced MS-Excel experience required (pivot tables, macros, etc.)Prior use and understanding of SQL is requiredData modeling, statistical analysis and/or predictive modeling experience is a plus (R, SAS and/or Python)Exposure to BI tools such as TableauSuperb presentation and communication skills (PowerPoint)Ability to thrive in a fast paced, multi-country environment that requires the ability to multi-task and implement high priority initiativesNice to HaveAn MBA is a huge plusUnderstanding of e-commerce and the associated transaction funnel analyticsUnderstanding of manufacturing operations and processesHands-on experience with product lifecycle management or supply chain management products / processesMarketing attribution modelling experienceCohort testing & analysisA/B testing and LTV analysis over 3-6 months leveraging cohortsBenefitsCompetitive salary, stock options, modern office, and great benefits. Flexible work schedule at our DTLA office in Little Tokyo.This is not a remote position.Must be eligible to work in the USA - no sponsorships.About The/Studio We are building a company that could be equivalent in scale and relevance to Amazon. Sounds like an exaggeration — but let us explain:  Amazon (and e-commerce in general) have completely disrupted the \"last mile\" — from ordering products easily to getting those products delivered to your door. But the \"first mile\" in the supply chain, where the product is actually produced, hasnt changed in over a hundred years. In spite of that, its value of this market is immense and only keeps growing. Fashion / apparel manufacturing alone is a $1.2 trillion industry.  We've built an on-demand manufacturing platform (manufacturing-as-a-service) that meets the needs of the 21st century economy. We bootstrapped our way to a $15M run rate and just closed a $10M Series A with a top-tier Silicon Valley VC. We believe we can create enormous value and literally change the world by making fast-turn, low volume manufacturing accessible to everyone.  The/Studio is hiring game-changing marketing, technology and supply chain experts for our Los Angeles and San Francisco offices."}