{"jobID": "2821486162", "jobLocation": "Seattle_WA", "jobTitle": "Data Analyst : 18", "companyRating": null, "companyInfo": {"Website": "www.akraya.com", "Headquarters": "Santa Clara, CA", "Size": "201 to 500 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Palo Alto Staffing, Artech Information Systems, TEKsystems"}, "estimatedSalary": null, "jobDescription": "Job Description Akraya is looking for a Data Analyst III for one of our clients. If the job description below is a fit, please apply directly or call Mahip Patel at 408-512-2352.  If this position is not quite what you're looking for, visit akraya.com and submit a copy of your resume. Our recruiters will get to work finding you a job that is a better match at one of our many clients.  Primary Skills: ETL, Data Warehouse, BI Reporting, Automation, Tableau, Data Analysis  Duration: 7+ Months  Contract Type: W2 only Responsibilities:Develop SQL/ETL queries, access data warehouse, generate automated daily / weekly reports, create relevant KPIs and Metrics for performance of both teams and fulfillment operations.Provide business insights based upon data to further improve operations and processes.Participate in requirements definition, data collection and analysis, documentation and report-out activities.Develop reporting solutions that include, but are not limited to complex reports, dashboards and data mining.Extensive operational reporting, ad hoc reporting to produce routine metrics and dashboards for management.Work with a wide range of data technologies (e.g. Oracle, Redshift, EMR, Quicksight and Tableau etc.) and stay abreast of emerging technologies, investigate and implement where appropriate.Required Skills:Bachelor's degree in Computer Science, Mathematics, Statistics, or other technical field.Strong Proficiency with SQL, data warehouse and statistical analysis tools.Experience building tables and ETLs.Coding proficiency in at least one modern programming/scripting language (e.g. Python, Ruby, etc.)Experience with business intelligence reporting and data visualization tools (e.g. Tableau, Quicksight, Datanet, SQL, etc.)Experience with Redshift or similar OLTP database architecture.Experience building on the AWS Cloud, including EC2, S3, and EMR.Ability to work effectively with both technical resources and non-technical business owners; gather and translate end user requirements. Apply directly with your updated resume or call Mahip at 408-512-2352  About Akraya  Akraya, Inc. is an award-winning staffing firm that works with many of the leading, technology-based companies around the world. We have been ranked as one of the \"Best Staffing Firms to Temp for\" by Staffing Industry Analysts on multiple occasions and are a preferred staffing vendor within numerous staffing programs. Please visit akraya.com to search through all of our current openings or to submit your resume to our recruiting team."}