{"jobID": "2830901830", "jobLocation": "Seattle_WA", "jobTitle": "Senior Data Scientist, Data Acquisition", "companyRating": "4.2", "companyInfo": {"Website": "www.zillow.com", "Headquarters": "Seattle, WA", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Public (Z) ", "Industry": " Real Estate", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Realtor.com, RentPath, Redfin"}, "estimatedSalary": "160000", "jobDescription": " Collaborate with a wide range of teams to compile robust data sets describing the end-to-end status of our data acquisition efforts.  Develop, maintain, and improve forecasts outlining the progress of our existing strategy. Improve the precision of our forecasting by incorporating advanced analytical methodologies to understand fluctuations in workforce performance and seasonality in underlying trends.  Work with others to identify potential new strategies or tweaks to the existing one, analyze the impacts to our existing trajectory, and provide recommendations for next steps.  Develop materials for and lead discussions in monthly and quarterly business reviews and annual planning sessions. Always push for clear and concise recommendations based on thorough, thoughtful, and well-informed analysis. Identify goals, measure progress toward goals (both quantitatively and qualitatively), and identify new opportunities for performance improvements.  Dive into our internal data sets (think SQL Server, Redshift, S3, Hive, and Presto) to create new data sets full of relevant information useful to the team in their acquisition efforts and to yourself.  Coordinate efforts with other analysts, product managers, business managers, and executives to develop a common language and approach to analyzing and communicating information and insights related to data acquisition.  Who you are  Were looking for a motivated data scientist that has:  The technical skills to absorb and disentangle tons upon tons of data.  Communication skills to work with a diverse set of partners to develop and implement multiple concurrent and complex project roadmaps.  Curiosity to push our entire company toward newer and innovative ways of thinking.  Tenacity to embrace and complete a challenging work stream. More specifically: Undergraduate or Masters degree in a quantitative field (e.g. economics, finance, statistics, science).  6-8 years of work experience involving quantitative data analysis and complex problem solving (preferably focused on inventory and/or supply chain management).  Tremendous business acumen.  Foundational analytical skills (proven understanding of SQL, total command of Excel, and experience using a statistical package like R or Python).  Worked with gigantic data sets and are comfortable accessing those data (even if theyre in JSON) with Hive and Presto.  Strong written and verbal communication skills, and work well on teams of all sizes with representatives from a broad set of technical backgrounds.  You have experience successfully coordinating and leading large, long-term, multi-team, multi-disciplinary projects.  Willingness and ability to travel to other ZG offices to maintain strong partnership with business leadership.  Passion for what you do."}