{"jobID": "2831153753", "jobLocation": "Boston_MA", "jobTitle": "Research Intern", "companyRating": "3.6", "companyInfo": {"Website": "www.bmc.org", "Headquarters": "Boston, MA", "Size": "1001 to 5000 employees", "Founded": " 1996", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "32000", "jobDescription": " Under the general supervision of the department director or manager, provides analytical and administrative assistance to department staff. Responsible for participating in project meetings as necessary, data collection & analysis, and other duties as necessary to support the successful completion of project / initiative work.  Duties may vary based on the departments need but may include projects such as updating content on the website, updating and maintaining databases and links, and providing general support to the department. Must learn and understand the basic principles and methods used in the department, always following established protocols.Under the general supervision of the department director or manager, provides analytical and administrative assistance to department staff. Responsible for participating in project meetings as necessary, data collection & analysis, and other duties as necessary to support the successful completion of project / initiative work.  Duties may vary based on the departments need but may include projects such as updating content on the website, updating and maintaining databases and links, and providing general support to the department. Must learn and understand the basic principles and methods used in the department, always following established protocols.  Recent college graduate or student enrolled in a related graduate or undergraduate degree program, preferably beyond a second semester junior. Must have the ability to perform multiple tasks and prioritize dutiesAbility to work independentlyMust possess excellent interpersonal, verbal and written communication skillsMust have an interest in performing new and varied work assignments, and be flexible with regard to work assignmentsExtensive knowledge of Microsoft Excel, Access, PowerPoint and Word is required. Knowledge or ability to learn Minitab.Must have the ability to maintain confidentiality"}