{"jobID": "2809321878", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Business Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.spectraforce.com", "Headquarters": "Raleigh, NC", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Position: Business Data AnalystLocation: South San Francisco, California, 94080Duration: 12+ monthsTop 3 skill sets: 1. Data visualization expertise with financial data  2. Programming expertise with financial and portfolio data (cost and resource)  3. Excellent soft skills (working well in teams, etc)  Software: Expertise in some analytics platforms like Tableau, Cognos, Microstrategy, etc or familiar with financial data terminology Ideal Candidate- Has background in pharmaceuticals or Biotech that has worked in finance or business operations with experience in research forecasting, portfolio planning, and expense analytics. Job Description: The position will require the individual to build and implement data infrastructure and reporting for portfolio planning and provide technical expertise in business data analytics along with project management services (as mentioned below). The individual will create dashboards and data models to support prioritization of projects and resources. The individual will work in a matrixed environment to gather requirements and design solutions to enable both portfolio planning/prioritization as well as resource utilization and forecasting. Skills: Technical expertise with data management and analytics (both theory and application), experience with financial analytics and analytical solutions design, project management experience, works well in teams and in a matrix environment. Tableau analyst experience is a must.  Daily responsibilities: gathering requirements and designing solutions for business analytics, leading the execution of the reporting workstream in support of the Translational Sciences Product and Portfolio Management implementation. Education:Required: Finance, Portfolio Management experience, Data analytics and visualization, Programming Education: BSc, MBA preferred, 5-7 years in Business Data Analytics and handling Financial Data"}