{"jobID": "2793108610", "jobLocation": "Framingham_MA", "jobTitle": "Sales Operations Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.uipath.com", "Headquarters": "Bucharest, Romania", "Size": "501 to 1000 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Automation Anywhere, WorkFusion, Blue Prism"}, "estimatedSalary": null, "jobDescription": " What if you could shape the future of work and be part of the team that creates the digital workforce of tomorrow, using Robotic Process Automation?  UiPath has a grand vision of liberating the human workforce from tedious, repetitive tasks, by means of Robotic Process Automation.  If you like to think ahead, like we do and if you think AI, cognitive computing and intelligent RPA will shape the way we work in the future, then we must talk.  Here's what you would be doing at UiPath:Who you are: You're a Business Analyst with experience driving insights to support revenue growth and strategy. You love making sense of large amounts of data to discover new efficiencies and areas of growth and prioritization. You're highly analytical and detail oriented.  You're commercially minded. You take the initiative to own projects and deliver results with the goal to make the organization more successful. You're passionate about bringing your strategic and analytical skills to a growing organization.  As a Business Analyst, you will report to the VP, Sales Operations to support go-to-market planning and analysis. Your responsibilities would include data analysis, market research, competitive analysis, pricing and revenue optimization. Key Responsibilities:Identify and present trends (positive and negative) and insights from business data sets that inform business decisions and strategyTrack and analyze key metrics and drive insight such as win/loss analysis, areas / markets for growth opportunitiesTranslate business data into digestible information and reports that continuously improves our resultsProvide analysis to assist in decision-making regarding the entry into new markets and commensurate resource-allocationsPerform market sizing analysis and pricing analysis based on existing sales data to optimize for growth, opportunity and process-designHelp define market priorities based on sales performance dataMake recommendations for changes in approach, rate-cards and other tactics that can drive greater resultsDevelop presentations that analyze sales and marketing activities and achievementsDesired Skills & Experience:Bachelor's degree in analytical field, MBA a plus3-5+ years in Business Analyst or similar role within Sales Finance, Sales Analytics, and/or Strategy ConsultingStrong experience with SQL, Excel and PowerPoint requiredStrong quantitative and qualitative analytical skillsExperience extracting data from large, complex databasesExperience in data visualization and building scalable reporting tools"}