{"jobID": "2831152047", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": "2.8", "companyInfo": {"Website": "www.williams-sonomainc.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1956", "Type": " Company - Public (WSM) ", "Industry": " Retail", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Room & Board, Design Within Reach, Pier 1 Imports"}, "estimatedSalary": "130000", "jobDescription": "Requisition Number: SS-13003  Area of Interest: Information Technology  Organization: Corporate  Brand/Division: Shared Services  Position Type: Full-time JOB DESCRIPTION At Williams-Sonoma, we are unlocking our business by harnessing the power of machine learning and predictive analytics to discover trends across and build a world-class big data strategy. The Williams-Sonoma Technology organization is seeking an energetic and talented Data Scientist to deliver high value, high-quality business capabilities to our data technology platform.  Our data team is working with business teams across our 6 amazing brands -- Williams-Sonoma, West Elm, Mark and Graham and the Pottery Barn family. As a Data Scientist, you will be utilizing your expertise applying analytical methods, performing data classification and reduction, and applying advanced machine learning techniques to discover and solve challenging problems. This is an opportunity to make a big impact on the operations of the company.  With a background in software development and machine learning, you will collaborate with business leaders, software engineers, data engineers and domain experts in Supply Chain and Inventory management to develop data and machine learning products.  Key Job Functions As a Data Scientist, you will be utilizing your expertise by applying analytical methods to understand complex business problems (e.g. regression, data classification and reduction, Bayesian inference or other advanced machine learning)You will be building Machine Learning capabilities on our Cloudera/Hadoop ecosystem so your expertise with R, Spark or Python and writing scripts that are part of a production analytic solution is critical.Bringing your solid technical database knowledge (Oracle, Hadoop, Teradata, data modeling) and experience optimizing SQL queries on large data will be invaluable.You will be instrumental in building Communities-of-Practice in key data technologies across the ML & AI spaceYou will be analyzing large amounts of business information to discover trends and patterns. Using the results propose solutions and strategies to improve our business strategyPresent information using data visualization techniquesWork with data engineering team members you will establish data ingestion techniques and assist with data-related technical issuesThrough a partnership with product development team, you will build a common understanding of various opportunities and use cases.REQUIREMENTS AND QUALIFICATIONSRequirementsStrong analytical and quantitative problem-solving ability3+ years professional experience as a Data ScientistSupply Chain and Retail Inventory and DC operation optimization a plusKnowledge of SQL is essential (MySQL or PostgreSQL ideally), and good knowledge one or more programming languages such as Python, Scala, Java, JavaScript, etc. and related frameworks (e.g. Flask, Django, Spring, AngularJS, React)Experience using business intelligence toolsFamiliarity with big-data stack (e.g. Kafka, Hadoop, Storm, Spark, Hive, Airflow, ElasticSearch, TensorFlow)Experience with relational (e.g. Postgres, MySQL) and/or non-relational (e.g. Cassandra, MongoDB) databasesStrong math skills (e.g. statistics, algebra)Outstanding written, verbal, and presentation skills with the ability to develop and present conclusions and recommendation to senior executives Additional Requirements BSc/MS degree in Computer Science, Computer Engineering or relevant field; Ph.D. in Data Science or quantitative field is preferredExperience in Supply Chain / Retail / eCommerce#LI-JQ1 Williams-Sonoma, Inc. is an Equal Opportunity Employer.  Williams-Sonoma, Inc. will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance, or other applicable state or local laws and ordinances."}