{"jobID": "2829539314", "jobLocation": "San_Francisco_CA", "jobTitle": "Personal Banker Registered 2", "companyRating": "3.5", "companyInfo": {"Website": "www.wellsfargo.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1852", "Type": " Company - Public (WFC) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "52000", "jobDescription": "Job DescriptionAt Wells Fargo, we want to satisfy our customers financial needs and help them succeed financially. Were looking for talented people who will put our customers at the center of everything we do. Join our diverse and inclusive team where youll feel valued and inspired to contribute your unique skills and experience.  Help us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you.  Community Banking operates one of the most extensive banking franchises in the country, serving customers through approximately 6,000 branches and 13,000 ATMs in 39 states and the District of Columbia. Our group includes Business Strategy and Administration; Customer and Branch Experience; Customer Remediation Office; Distribution Strategy Group; Regional Banking; Regional Services; and Customer Segments, and serves mass market, affluent, and small business customers. Our focus is on delivering an exceptional experience for our customers and providing the products and services that will help them realize their financial hopes and dreams.  Personal Banker 2s (Registered) at Wells Fargo are focused on building lifelong relationships with customers, both consumers and small businesses. Successful bankers demonstrate a genuine interest in their customers and ask questions to understand their financial priorities and meet their needs. Personal Banker 2s (PB2s) (Registered) develop strong relationships with other Wells Fargo partners that enable them to introduce customers to specialists who can assist with specific financial needs. PB2s (Registered) present options to customers about ways to make their banking easy and convenient, ensuring the needs of the customer always come first. PB2s (Registered) may also proactively contact customers by phone to follow up to ensure customer satisfaction, build relationships, and address any additional financial needs based on the customers financial priorities. Special emphasis is placed on assisting customers with more complex needs such as personal financial reviews, lending services, small business needs, investments, and retirement. PB2s (Registered) are required to maintain Financial Industry Regulatory Authority (FINRA) registration and state insurance license(s) for ongoing employment in this position.  This SAFE position has customer contact and job duties which may include the offering/negotiating of terms and/or taking an application for a dwelling secured transaction. As such, this position requires compliance with the S.A.F.E. Mortgage Licensing Act of 2008 and all related regulations. Ongoing employment is contingent upon meeting all such requirements, including acceptable background investigation results. Individuals in a SAFE position also must meet the Loan Originator requirements under Regulation Z (LO) outlined in the job expectations below.  Important Note: During the application process, ensure your contact information (email and phone number) is up to date and upload your current resume prior to submitting your application for consideration. If you are a Wells Fargo Team Member, in your Jobs Profile ensure that your email address is valid and updated to an address that can receive external emails outside of the banking network and is a different email address than the one you originally used when you joined WF. Initial contact with you will be made via e-mail. Please check your e-mail regularly for updates.Required Qualifications1+ year of experience offering products and services to customers based on their needs1+ year of experience assessing and meeting the needs of customers and/or solving customer problems2+ years of financial industry experienceSuccessfully completed FINRA Series 6 (or 7) and 63 (or 66) exams to qualify for immediate registration (or FINRA recognized equivalents)State Life Insurance license(s)Desired Qualifications1+ year of financial lending experienceBasic Microsoft Office skillsAbility to meet or exceed performance objectivesExperience interacting positively with unsatisfied customersExperience mentoring and peer-coaching othersGood communication skills including speaking clearly, succinctly, and accurately while using a pleasant tone and common conversational courtesiesRelevant military experience including working with military protocol and instructions, enlisted evaluations, officer/leadership reportingRelevant military experience including working in personnel benefits management, processing military personnel orders or transitions, wartime readiness operations, human resources or military recruitingExperience making work-related outbound phone callsBilingual speaking proficiency in Chinese (Mandarin)/EnglishBilingual speaking proficiency in Chinese (Cantonese)/EnglishJob ExpectationsObtaining and/or maintaining appropriate Financial Industry Regulatory Authority (FINRA) license(s) is required for ongoing employment in this position. In addition state registration, specific product licenses or SAFE licensing may apply. Additional requirements include meeting enhanced financial fitness and criminal background standards. Wells Fargo will initiate the FINRA review process at the time of offer acceptance.This position requires SAFE registration at the time of employment. Wells Fargo will initiate the SAFE registration process immediately after your employment start date. The Nationwide Mortgage Licensing System (NMLS) web site (http://fedregistry.nationwidelicensingsystem.org ) provides the MU4R questions and registration required for employment in this position.Individuals in Loan Originator (LO) positions must meet the Consumer Financial Protection Bureau qualification requirements and comply with related Wells Fargo policies. The LO qualification requirements include meeting applicable financial responsibility, character, general financial fitness and criminal background standards. A current credit report will be used to assess your financial responsibility and credit fitness, however, a credit score is not included as part of the evaluation. Successful candidates must also meet ongoing regulatory requirements including additional screening, if necessary.Street AddressCA-SF-North Beach: 1015 Stockton St - San Francisco, CADisclaimerAll offers for employment with Wells Fargo are contingent upon the candidate having successfully completed a criminal background check. Wells Fargo will consider qualified candidates with criminal histories in a manner consistent with the requirements of applicable local, state and Federal law, including Section 19 of the Federal Deposit Insurance Act.  Relevant military experience is considered for veterans and transitioning service men and women.  Wells Fargo is an Affirmative Action and Equal Opportunity Employer, Minority/Female/Disabled/Veteran/Gender Identity/Sexual Orientation."}