{"jobID": "2823814404", "jobLocation": "New_York_NY", "jobTitle": "Demo Engineering Fall Intern", "companyRating": null, "companyInfo": {"Website": "www.slack.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Microsoft, Atlassian, Facebook"}, "estimatedSalary": null, "jobDescription": " Demo Engineering Fall InternSlack is more than just a tech company, we are on a mission to make your working life simpler, more pleasant and more productive. We believe that culture is the compass to success and so our Slack values are woven into the fabric of all we do. We seek extraordinary talent that is eager to do the best work of their life while supporting others in doing the same.  We are looking for an intern to join Slack’s global Demo Engineering team in our New York office. This is a high transparency team that is focused on building powerful tools to help our Sales team deliver powerful product demonstrations. You will have not only the right technical chops, but a budding interest in understanding how businesses sell to other businesses. Demo Engineers are passionate about solving complex problems and thinking through the lense of business value. If the idea of building powerful bots on the Slack Platform and helping spread Slack to businesses across the world sounds appealing, this role is for you!Responsibilities: Contribute to the creation of the world’s best demo environment and tools for the Sales organization.Collaborate with Demo Engineers, Solutions Engineers, and more to gather technical and functional requirements.Build and ship mini apps to help showcase the Slack Platform.Develop expertise in Slack’s APIs and deliver creative ways to bring integrations to life.Track, research, and implement solutions to issues affecting those using demo environments.Provide thought leadership on demo development and execution.Find opportunities for automation and develop specifications for new toolsStay up to date on upcoming Slack featuresQualifications:Familiarity with Javascript, Java, Node.js, Web APIs, (Spring framework is a plus)Strong verbal communication skillsA love for design and building from scratch; problem-solving is in your DNAFamiliarity with Slack app developmentThe technical capability to understand system integrations, data migration, and implementation considerationsThe ability to work independently toward deadlines and a willingness to take ownership of issuesPursuing a bachelors in Computer Science or equivalent.Will be able to work full-time in our New York officeWill be graduating May 2019 or later Slack is the collaboration hub of choice for companies of all sizes, all across the world. By using Slack, they ensure that the right people are always in the loop, that key information is always at their fingertips, and new team members can get up to speed easily. With Slack, teams are better connected.  Launched in February 2014, Slack is the fastest growing business application ever and is used by thousands of teams and millions of users every day. We currently have nine offices worldwide, in San Francisco, Vancouver, Dublin, Melbourne, New York, London, Tokyo, Toronto and Denver.  Ensuring a diverse and inclusive workplace where we learn from each other is core to Slack's values. We welcome people of different backgrounds, experiences, abilities and perspectives. We are an equal opportunity employer and a pleasant and supportive place to work.  Come do the best work of your life here at Slack."}