{"jobID": "2798635961", "jobLocation": "Boston_MA", "jobTitle": "Marine Mammal & Sea Turtle Necropsy Intern", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Time commitment: TWO to THREE Full Days Per Week (8:00am - 6:00pm) The New England Aquarium is currently seeking a Marine Mammal and Sea Turtle Necropsy Intern to assist in the daily operations of the Marine Animal Rescue and Rehabilitation Department and focus on tasks that relate to post-mortem exams of stranded marine mammals and sea turtles. The ideal candidate will be highly-motivated, able to work independently, meticulous about detail, and have an interest in marine animal pathology. This position will report to the Necropsy Specialist and work occasionally with the larger Rescue and Rehab team of volunteers and staff. Duties/Responsibilities include, but are not limited to:Assist in post-mortem exams of stranded marine animals in the lab and in the field. This includes tissue sample collection, report writing, and photography.Basic data collection of dead stranded marine mammals in the field.Cleaning and maintenance of laboratory environment.Frozen and fixed tissue sample inventory and management.Data management and record keeping.Interns may also have the opportunity to assist with live animal care in the sea turtle hospital and with live animal stranding response.Interns may have the opportunity to assist in research projects.Skills/Qualifications:Must be at least 18 years of age.Must be able to handle the sight of blood and acrid smells.Must be able to perform significant cleaning tasks daily.This position requires physical tasks. Applicant must be able to lift and carry 50 lbs.Must have strong attention to detail.Must be proficient in a data management program (i.e. excel, access or similar).Must be able to work independently as well as with a team.Strong organizational skills are a must.Attend two professional development lunches with the Volunteer Programs and Internships office.Access to a vehicle is prefered.Note: This position is located at our offsite Animal Care Center in Quincy, MA and is not offered for January Term.Required Events:Orientation (takes place prior to first training or shift with department)Meet and GreetTwo Professional Development LunchesIntern CelebrationExit InterviewOrganizational Description: The New England Aquarium's mission is to protect the blue planet through hands-on programs, live animal and interactive exhibits, public lectures and forums, and research and conservation projects.  This mission is fulfilled through exhibits, and through education, conservation and research programs. Exhibits showcase the diversity, importance and beauty of aquatic life and habitats, and highlight critical aquatic conservation issues. Programs emphasize species, habitats and issues critical to New England. The Aquarium is also a pioneer in marine animal rescue and a leading ocean conservation organization with research scientists working around the globe.  The New England Aquarium serves as a responsive community resource that attracts and involves the broadest possible audience; seeks a culturally diverse staff and governing board that reflect our community; adheres to the highest standards of animal stewardship; and is committed to delivering the highest quality visitor experience in a welcoming and enjoyable manner that evokes wonder, curiosity, understanding, caring and action. Department Description: Established in 1968, the Marine Animal Rescue Team has responded to thousands of calls providing medical treatment to sick and injured whales, dolphins, porpoise, seals and sea turtles throughout the New England coastal region. The rescue team is also committed to advancing stranding science through post-mortem investigation into the cause of the strandings and/or disease of local marine animal populations.0 Job Posted by ApplicantPro"}