{"jobID": "2598578338", "jobLocation": "New_York_NY", "jobTitle": "Marketing Coordinator", "companyRating": null, "companyInfo": {"Website": "www.laneoffice.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 1922", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " At our company, titles don’t mean a lot – but these things do: IntegrityKindnessOptimismIntellectual curiosityStrong work ethicEmpathySelf-awareness The Marketing Coordinator skills and responsibilities include, but are not limited to: Lead the charge – deliver our company/brand message and inspire others to do the same.Produce and direct – all materials and media for pitch meetings, presentations and showspace tours.Sales support – interface with company Executives, Salespeople and Project Managers to meet client requests.Manage and attend – we are active participants in a slew of events, from industry associations and charities to sponsorships and awards galas. You run point on communication for everything we do.Coordinate – response to Requests for Proposal (RFPs) for new business opportunities. You help us put our best foot forward on the way to winning new accounts.Compile and analyze – data for shared marketing and brand materials, including open rates and direct responses.Be an expert – all Microsoft Office and Adobe Applications, including Acrobat and Illustrator.Gatekeeper of the company swag – and there is a lot of it!Graphic Design, Photography & Videography experience – and passion – preferred.Caretaker of marketing equipment and supplies.High HQ – “Hospitality Quotient” – we are in the service business – making others feel good, makes you feel good. Big ego? Thin skin? If you answered, “Yes” to either of these…move on to the next post. About Us:Located on West 38th Street in New York, occupying 2 floors in a recently renovated building, with easy access to Penn Station, Port Authority and numerous subway lines. Industry leader in compensation – offering full benefits and a minimum 50% match to employee 401K contributions. EOE"}