{"jobID": "2803991884", "jobLocation": "Bellevue_WA", "jobTitle": "Marketing Intern", "companyRating": "3.6", "companyInfo": {"Website": "www.hologic.com", "Headquarters": "Marlborough, MA", "Size": "5001 to 10000 employees", "Founded": " 1985", "Type": " Company - Public (HOLX) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " GE Healthcare, Illumina, Boston Scientific"}, "estimatedSalary": "49000", "jobDescription": " Marketing Intern  Post Date Jun 05, 2018 *Role Essential Duties and Responsibilities** This will be a very varied marketing support role covering a broad range of marketing activities and offers an excellent opportunity to gain valuable experience within a leading international medical devices business. You will have administrative duties supporting in implementing marketing strategies. This is a role that requires a high degree of initiative and good analytical skills. Specific duties will include: + Collect quantitative and qualitative data from marketing campaigns to measure ROI  + Research and create relevant market and competitive analysis  + Support the marketing team in daily administrative tasks such as creation of Purchase Orders and its monitoring. approval of assets with legal and regulatory, translations of materials liaising with appropriate agencies, and others that are assigned  + Maintains Promotional Materials System up to date refreshing with new assets sand cleaning old files  + Participate in the development and dissemination of marketing programs across multiple countries  + Support the monitoring of marketing programs budget tracking and keeping accurate records  + Help prepare and distribute collateral materials  + Help organize regional marketing events *Qualifications** Undergraduate or post graduate, preferably in Marketing, Business or Life Sciences *Education and Experience** Fluent in English (written and spoken). Previous experience of administrative duties is desirable. Interest in healthcare, medical devices or pharmaceuticals *Work Environment** This is an office based function with travel to Manchester to lean the function and travel to marketing meetings 1 x / Quarter"}