{"jobID": "2829532898", "jobLocation": "Needham_MA", "jobTitle": "Data Analyst, Restaurants", "companyRating": "3.4", "companyInfo": {"Website": "www.tripadvisor.com", "Headquarters": "Needham, MA", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Company - Public (TRIP) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Priceline.com, Airbnb, HomeAway"}, "estimatedSalary": "71000", "jobDescription": " TripAdvisor provides a unique, global work environment that captures the speed, innovation and excitement of a startup, at a thriving, growing and well-established industry brand. At TripAdvisor, you will be part of a dynamic, fun, and energetic team where you can immediately make meaningful contributions.As a Data Analyst of TripAdvisor Restaurant Solutions, your role is to gather, organize and aggregate large sets of data in order to produce meaningful business insight in various areas.As a key member of the Restaurants analytics team, the Data Analyst will be responsible for data driven insights that enable the TripAdvisor Restaurants team to optimize business processes and drive product innovations. The Data Analyst will gather, organize and aggregate large sets of data in order to produce meaningful business insight in areas such as product feature multivariate testing, sales funnel optimizations, consumer engagement modeling and marketing program effectiveness. If you would love being an owner-operator of a fast-growing complex online business with modern technology stacks, building analytical and infrastructure solutions, and driving profitability via analytics, the Data Analyst role is for you!What you'll DoWork closely with our developers to understand the data scheme, design our raw analytics tables & identify potential bugs.Lead analysis/reporting focused on new TripAdvisor Restaurant Solution products in order to measure performances, understand new features impacts, follow customers behaviorProvide timely insights and analytical support to different internal stakeholders to support effective business decision-makingCreate concepts, justify business cases and manage the implementation of changes to the website experience to improve customer engagement and value metricsIdentify key success indicators and determine best practices for measurement and reportingAssist with ad hoc queries and provide analytical support to our fast-growing business as it evolvesWhat We Seek4-5 years of experience in an analytical role (ideal backgrounds include: a similar business analyst role at a web company, a data-based consulting role, or other data strategy type positions)Excellent problem-solving and analytical skills, involving data analysis and predictive modelingAbility to work with large dataset and summarize findings in a clear formatYou live in SQL & you're Tableau expertProactive not reactive, with ability to work independently in a fast-paced environmentConfident with learning new tools, technologies, and methodologiesUndergraduate degree required with a preferred focus on engineering, economics, or business. MBA a plus. *LI-JK1"}