{"jobID": "2797670124", "jobLocation": "Boston_MA", "jobTitle": "Program Manager", "companyRating": null, "companyInfo": {"Website": "www.icer-review.org", "Headquarters": "Boston, MA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Institute for Clinical and Economic Review (ICER) is an innovative, independent non-profit health care research organization dedicated to sustainable access to high value care for all patients. Among ICER’s key initiatives are the California Technology Assessment Forum (CTAF), the Midwest Comparative Effectiveness Public Advisory Council (Midwest CEPAC), and New England Comparative Effectiveness Public Advisory Council (New England CEPAC). These public deliberative bodies represent a unique platform from which to advance collaborative efforts to analyze scientific evidence on what works best, to foster an honest dialogue about the evidence on effectiveness and value with the public, and to translate this evidence into action to improve patient care. Through these initiatives and all its other efforts, ICER thrives on the entrepreneurial spirit of its employees to empower patients, clinicians, and policymakers in their quest for better care at lower costs.  ICER is looking to expand its team, which includes a diverse set of clinicians, researchers, and policy experts. We are seeking a Program Manager to lead the development of three research reports per year to support three public meetings per year from our Boston headquarters. Details on the specific responsibilities and minimum qualifications are provided below. Before going there, however, ask yourself the following questions: Do you thrive in an entrepreneurial environment where you are responsible for ensuring the completion of a project from start to finish?Do you get excited by engaging and energizing multiple stakeholder groups, internal and external collaborators, and health policy leaders?Do you “get” the drug development, approval and pricing process, including an understanding of the many perspectives represented by the different stakeholders? If you’ve answered “yes” to each question, read on! Program Manager The Program Manager will lead three projects per year. This role is ideal for an established project or program leader with experience strategically directing the day-to-day and long-term goals of a key organizational program. The ideal candidate will have a robust understanding of the national health policy landscape, with some familiarity with pharmaceutical pricing policy, as well as a sophisticated understanding of the different perspectives represented across the health care industry. Each of the three meetings will focus on comprehensive reports developed by ICER on the comparative clinical effectiveness and comparative value of new drugs or other new interventions in the health system. The Program Manager will work closely with ICER’s Research Team to ensure achievement of all project goals. This position also requires close collaboration with the other Program Managers at ICER. The Program Manager will report to the Program Director. Job Responsibilities: The Program Manager is responsible for the direction and execution of three public meetings, including managing project timelines, communicating with key stakeholders, and interfacing with internal and external personnel to ensure top quality evidence reviews are created on-time each time. Specifically, the Program Manager will: Ensure report generation timelines are met, identifying and managing potential risks to meeting the deadlines, and producing final products that are top qualityManage relationships with multiple stakeholder groups, including patients, clinical experts, life sciences manufacturers, public and private payers, and external academic collaboratorsSupport topic selection for future comparative effectiveness reviewsRecruit and orient Policy Roundtable participants for each meeting, specifically, the identification of potential clinical experts, health system and insurer representatives, manufacturers, and patient representatives to serve at public meetingsProvide event planning and logistics oversight of three public meetings each year during which the independent councils deliberate on ICER reportsCoordinate with ICER’s other Program Managers and Program Director on program improvement and managementQualifications: The ideal candidate has prior experience managing large multi-stakeholder initiatives in the health care space. Specifically: Bachelor’s degree required; Master’s Degree in a health care related field preferred4+ years professional experience in program or project management, with an emphasis on leading large projects and managing diverse stakeholder interestsExperience working in health policy, clinical research or health system settings requiredExcellent organizational and interpersonal skillsSuperior written and verbal communications skills, especially around using electronic communication to lead projects with remote participantsAbility to work in a fast-paced environment, meet or beat deadlines, and adapt to changing environment a mustAbility to travel to public meetings a minimum of three times a yearConfidence, maturity and experience in dealing with high-level public and private officials ICER offers a competitive salary and benefits package. Interested candidates should e-mail a resume and cover letter; please also include contact information should we wish to schedule an interview.  It is not intended that the above listed duties reflect every job duty, responsibility or task that the employee may be called upon to perform. The employee is expected to perform all job-related duties and tasks assigned by his/her supervising manager or other authorized manager."}