{"jobID": "2791578449", "jobLocation": "Seattle_WA", "jobTitle": "Data Analyst", "companyRating": "4.3", "companyInfo": {"Website": "www.bridgepartnersconsulting.com", "Headquarters": "Seattle, WA", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": " Bridge Partners is a people-focused, customer-driven consulting firm that helps organizations drive growth, adapt to change, and create enterprise value. Our consultants take pride in their unwavering commitment to client service and bring real-world industry experience and deep subject matter expertise to every project. Through a unique, small practice model, we deliver better value, build longer-lasting relationships, and create happier clients.  We are consistently recognized for the quality of our work and the rapid growth of our business. With all the growth and achievement, Bridge Partners has maintained the transparency, authenticity, and flexibility that our employees love. Just a few of the reasons we are known as a “Best Place to Work.”  We are currently seeking a Data Analytst to join our team in Seattle, WA. As an integral member of our Analytics practice, the Data Analyst is responsible for enhancing the ability to make data-driven decision via thoughtful analysis of data assets. This includes both understanding a relevant set of business questions/scenarios and also understanding how to derive the most valuable insights from a particular data set. Critical to this role is also determining when a data set is not sufficient to answer a particular question or produce a metric.  The data analyst will partner with internal and client teams to be an expert in ‘mining the data’ for pieces of information that provide extended or unique perspective to a set of business decision makers. This person will know what methods should be tested or leveraged and can prioritize analysis to derive informative outcomes in a reasonable timeline. The ideal candidate is very curious about data in general and not only loves to analyze data but discuss and communicate results with a variety of audiences. Essential Duties and Responsibilities Work directly with internal teams (BI Architects, Practice Director, Client Directors) to deliver analytics products and services. Responsibilities include: Excellent ability to assess the quality of a given data set, and understand the potential correlation to a business problem or set of problems.Demonstrated knowledge of various methods of data analysis, from simple summary statistics to multi-variate or possibly predictive approaches.Ability to prioritize and sequence analysis approaches to maximize the likelihood of finding interesting insight early in the analysis phase.Proactively communicate progress and status of analysis, including summarizing findings for non-technical audiences.In-depth knowledge of data hygiene and ability to implement strategies to solve common issues.Ability to develop process that is repeatable and also flexible, to make adjustment easier as business needs change.Confidence to present analysis findings along-side Practice Director, Client Director, and other team members. Ability to ask clarifying questions or explain results clearly in client meetings.High level of adaptability as new business questions or data sets become relevant.Required Knowledge, Skills and AbilitiesThorough knowledge of Excel.In-depth knowledge of at least one database platform (SQL server, AWS, Azure, Hadoop, etc.) and how to extract data from those platforms.Excellent knowledge of data analysis methodologies, from generating summary statistics to identifying trends over time dimensions, to correlations and multi-variate analysis.Experience with R or Python preferred.Knowledge of BI and/or Advanced Analytics use cases, common approaches.Ability to summarize findings into Power Point or other client briefing formats.Thorough knowledge of data quality issue identification and management. Must be able to proactively identify key data issues that impact the overall quality of resulting insight.Ability to think creatively about how data can be used to answer a question.Curiosity about data and the stories that can be created, with an eye for accuracy and common sense outcomes.Education and ExperienceBachelor’s degree in BI, Analytics, Data Science, Economics, or similar.5+ years’ hands-on experience with one or more BI tools (Power BI, Excel, Tableau, Domo, etc.)3+ years’ in consultative role (either with a consulting firm or serving as internal consultant to various business groups) that required understanding a business problem ahead of designing or re-designing a solution.Ability to summarize and present results for both technical and non-technical audiences.A portfolio or previous work, demonstrating thoughtful analysis and ability to produce insight related to a business problem. Please include a resume with your application. Local Seattle candidates preferred. Due to the high volume of applications, we are not able to respond to every resume we receive. Thank you for your understanding.  Bridge Partners LLC is an EEO Employer"}