{"jobID": "2822553785", "jobLocation": "Staten_Island_NY", "jobTitle": "STATEN ISLAND SECURITY GUARD", "companyRating": null, "companyInfo": {"Website": "www.kentsecurity.com", "Headquarters": "North Miami, FL", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OverviewKent Services is a family-owned security, technology and building services firm with a renowned history of delivering unparalleled services through our close to 2,000 employees who cover the entire continental US. We offer an array of careers that deliver a rewarding experience, great benefits and professional growth and development. We challenge our colleagues each step of the way and provide them with the tools to succeed and accomplish their personal and professional goals. Together, we can… [more] deliver the highest quality of service to each of our customers and put you on the career path you have been looking for. [less]Job Skills / RequirementsQualified Candidates must: - Posses a NYS security license -Ability to stand for long periods of time - Undergo pre-employment drug screening - Deliver our professional stamp of customer service that our clients deserve Compensation is highly competitiveEducation Requirements (Any)High School Diploma or GEDCertification Requirements (All)NYS Security Guard License  8 hour Certification  16 hour certificationAdditional Information / BenefitsRequirements  ï¿½ Possess exceptional customer service skills and phone etiquette; prior experience is a plus  ï¿½ Able to multitask, write legible comprehensive incident reports, observe and record information, apply attention to detail and people skills, display vigilance, focus and diligence  ï¿½ Must be a good communicator, both verbal and written, must be capable of handling typical and crisis situations efficiently and effectively  ï¿½ Maintain high standards of attendance and punctuality  ï¿½ Maintain neat and professional appearance at all times  ï¿½ Exhibit a friendly and professional demeanor  ï¿½ Provide exemplary service in a manner consistent with the values and service mission of the company and the client  ï¿½ Bilingual Spanish is a PLUS Qualifications ï¿½ Must have valid Class D Security License  ï¿½ Prior contract security, military or law enforcement experience is a plus  ï¿½ Able to work in a team-oriented environment  ï¿½ Open availability including possible weekends and holidays  ï¿½ Must be at least 18 years of age or older as required by applicable law or contractual requirements  ï¿½ Outstanding interpersonal and communications skills  ï¿½ Ability to start work immediately upon approval  ï¿½ Clean driver license  ï¿½ Computer savvy  Benefits: Medical Insurance, Dental Insurance, Paid Sick Days, Paid Holidays, 401K/403b Plan  Screening Requirements: Drug Screen"}