{"jobID": "2776568167", "jobLocation": "Boston_MA", "jobTitle": "Project Manager", "companyRating": "3.0", "companyInfo": {"Website": "www.brockgroup.com", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1947", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Brand Energy And Infrastructure Services, Safway Group, Mobley Industrial Services"}, "estimatedSalary": "75000", "jobDescription": " Job Details  Own and lead projects from concept to on time completion utilizing project management methods; additionally, support the Sr. Project Manager and Operations Manager on larger scale programs and projects from concept to completion on time. This position is responsible for project controls, key performance measures (KPI’s), training, account management, and Brock’s Managed Program systems. Individuals may be developed and mentored into leadership roles that provide support to various administrative and operations management positions. Works under minimal supervision. Responsibilities: \\r\\n\\r\\nOwn the planning and implementation of a program/project by building detailed project plans which include timelines, scheduling, logistics, purchasing and training plans.Leading cross functional project team meetings to communicate project status while escalating risks and concerns; in addition, supports the Sr. Project Manager and Operations Manager on these duties related to larger projectsEnsure project schedules effectively allocate the resourcesCoordinates the management of day-to-day operational aspects of a projectPrioritize project tasksApply project management principles, establish tracking metrics, and deliver commitments to the business on time and on budget while minimizing riskSupport the change management process and own the communications plans throughout the entire cycle of a projectAssembles and approves deliverables prepared before passing to clientFacilitates team and client meetings effectivelyIdentifies opportunities for improvement and makes constructive suggestions for changeConducts effective performance evaluations and mentors those with less experienceTrains others through both formal and informal training programsPrepares status reports of projectChallenges others to develop as leaders while serving as a role model and mentorPossesses a thorough understanding of our capabilities, identifies business development and \\\"add-on\\\" sales opportunities as they relate to line of businessEffectively conveys our message in written and verbal business development discussionsProficient in estimating, planning, scheduling, cost control and metrics"}