{"jobID": "2816309931", "jobLocation": "Sunnyvale_CA", "jobTitle": "Machine Learning Research Interns", "companyRating": null, "companyInfo": {"Website": "www.baidu.com", "Headquarters": "Beijing, China", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Public (BIDU) ", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Baidu Research, headquartered in Silicon Valley, is looking to hire Machine Learning Interns with a background in machine learning or a related application area such as robotics, speech recognition, natural language understanding. Our mission is to advance AI state of the art, realizing significant impact on hundreds of millions of users. As a research intern at Baidu, you will be uniquely positioned to contribute to this mission and level up your research experience in an industry environment.  By providing a great learning environment and software/hardware infrastructure we aim to help you and your team make rapid progress on the most challenging AI research problems. We will give you the best possible platform to contribute to this mission through access to bleeding edge high performance computing (HPC) research systems, large datasets, and feedback from AI products deployed at scale in Baidu.  With an emphasis on deep learning, our work spans computer vision, speech recognition, natural language processing, and many other areas. Here's what you will do: Develop and perform research to advance AI state-of-the-art. This includes project planning, literature review, and developing proofs-of-concept.  Communicate your research both internally among AI researchers and externally through presentations, publications, and open source contributions.  Engage in team collaborations to meet research goals.  You will be working with a team of highly talented researchers and engineers, who are focused on advancing AI state of the art.  Here's what we'd like to see in you:  Pursuing a PhD in Computer Science, related technical field or equivalent practical experience.  A track record of influential research in AI or a related domain.  Able to write code. While we appreciate the theoretical understanding, it is important that you are also able to write good code in languages such as C++/Java/Python/CUDA (i.e., not just Matlab). Culture fit: Mission alignment: If you want to advance AI, we will give you the best possible platform to do that. If you are on a different mission, then we are not a good fit.  Team orientation: We work in small, fast-moving teams. We don't believe in lone wolves and go out of our way to support each other.  Self-directed: We work best with people that are driven, motivated, and aspire to greatness. Are you the sort of person that, if you had time on your hands, will independently find interesting and useful things to do?  Hungry to learn: We are eager to teach you new skills. But learning is hard work and this is something we hope you want to do.SDL2017"}