{"jobID": "2612564219", "jobLocation": "Cupertino_CA", "jobTitle": "Installer - Apple Service", "companyRating": null, "companyInfo": {"Website": "www.pivotinteriors.com", "Headquarters": "Santa Clara, CA", "Size": "201 to 500 employees", "Founded": " 1973", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " One Workplace, Tangram Interiors"}, "estimatedSalary": null, "jobDescription": "SUMMARY Installs and/or upgrades all product lines of contract office furniture. Must demonstrate ability to work efficiently and take direction from senior installation personnel. Must demonstrate dedicated commitment to departmental mandates and goals. ESSENTIAL DUTIES AND RESPONSIBILITIESinclude the following. Other duties may be assigned.Within each team, you own all areas of your job responsibility for the successful installation and completion of every job, to the absolute satisfaction of all of our customers.Brings all product and necessary tools/equipment ready and available for each job. Arrives at job site ahead of scheduled time. Always communicates with appropriate people, if late.Unloads product from trucks and stages as required.Inspects and documents product for damage and quality prior to installation or delivery.Loads and secures product on trucks as required.Understands the scope of the entire project and/or any special conditions or requirements as explained by lead installation personnel.Reviews installation plans with senior installation personnel as required and installs product in accordance with plans.With direction from lead or senior installation personnel, interfaces with clients and/or other contractors as required.Communicates frequently with Project Managers on project status (start of day, and end of day, minimum) and with client, before arrival and at end of job.Returns phone calls (leave voice mails), responds to voice mails quickly (leads to carry working phones while on jobs).Conducts preliminary walk-through with lead installer prior to customer walk-through.Provides own dependable transportation to job site or office as required, and provides own tools necessary to perform the job.Takes direction as required from senior installation personnel; monitors own work to ensure quality performance and results consistent with company mandates.Confers with lead installation personnel on product handling or installation issues.Accurately completes and submits all required paperwork at the end of each day (time cards, comments, etc.)Performs other duties, as assigned by senior installation personnel, as required.SUPERVISORY RESPONSIBILITIES This job has no supervisory responsibilities; however, from time to time installers may be asked to assist in on-the-job skills training of apprentice personnel. QUALIFICATIONSTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.EDUCATION and/or EXPERIENCEInstaller 1 - Requires a high school diploma or GED and up to 2 years of related experience including systems furniture installation; or equivalent combination of education and experience. Has knowledge of commonly-used concepts, practices, and procedures within field. Relies on instructions and pre-established guidelines to perform the functions of the job. Works under immediate supervision. Primary job functions do not typically require exercising independent judgment. Must possess ability to use power tools and demonstrate working knowledge of product handling, staging, and assembly of HMI and ancillary furniture lines. Installer 2 - Requires a high school diploma or GED and up 2-5 years of related experience including systems furniture installation; or equivalent combination of education and experience. Familiarity with standard concepts, practices, and procedures within field. Relies on limited experience and judgment to plan and accomplish goals. Must possess ability to use power tools and demonstrate working knowledge of product handling, staging, and assembly of HMI and ancillary furniture lines. Installer 3 (Lead) - Requires a high school diploma or GED and at least 5 years of related experience including systems furniture installation; or equivalent combination of education and experience. Familiar with a variety of the field's concepts, practices, and procedures. Relies on experience and judgment to plan and accomplish goals. Performs a variety of tasks. May lead, train and direct the work of others. A wide degree of creativity and latitude is expected. Must possess ability to use power tools and demonstrate working knowledge of product handling, staging, and assembly of HMI and ancillary furniture lines. Installer 4 (Master Lead) - Requires a high school diploma or GED and at least 7 years of related experience including systems furniture installation; or equivalent combination of education and experience. Familiar with a variety of the field's concepts, practices, and procedures. Relies on experience and judgment to plan and accomplish goals. Performs a variety of tasks. Leads and directs the work of others. A wide degree of creativity and latitude is expected. Must possess ability to use power tools and demonstrate working knowledge of product handling, staging, and assembly of HMI and ancillary furniture lines. LANGUAGE SKILLS Ability to fluently speak and understand English. Ability to read and interpret documents such as safety rules, operating and maintenance instructions, and procedure manuals. Ability to write routine reports and correspondence. Ability to speak effectively before groups of customers or employees of organization. Must communicate in English via telephone to management, customers, vendors, and/or other employees. MATHEMATICAL SKILLS Ability to add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions, and decimals. REASONING ABILITY Ability to apply common sense understanding to carry out detailed but uninvolved written or oral instructions. Ability to define problems, collect data, establish facts, and draw valid conclusions. Ability to deal with problems involving a few concrete variables in standardized situations. CERTIFICATES, LICENSES, REGISTRATIONS No additional licenses required. PHYSICAL DEMANDSThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is regularly required to use hands to finger, handle, or feel. The employee is regularly required to talk or hear. The employee frequently is required to stand, walk, sit, and reach with hands and arms. The employee is occasionally required to climb or balance; stoop, kneel, crouch, or crawl; and taste or smell. The employee must regularly lift and/or move up to 25 pounds, and occasionally lift and/or move up to 75 pounds with assistance or equipment. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and ability to adjust focus. WORK ENVIRONMENTThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is sometimes exposed to moving mechanical parts, fumes or airborne particles, and outside weather conditions. The noise level in the work environment is usually moderate.  EEO"}