{"jobID": "2540584757", "jobLocation": "Boston_MA", "jobTitle": "Senior Drone Software Specialist/Data Scientist", "companyRating": "2.6", "companyInfo": {"Website": "www.windwalker.com", "Headquarters": "Vienna, VA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": " Windwalker Group, a fast growing, Boston-based firm in risk management, physical/cyber security and professional services, seeks an innovative Senior Drone Software Specialist/Data Scientist to provide senior level support to the state's transportation agency. This will be a multiyear effort. The candidate will be capable of collecting, tracking, analyzing, managing and making sense of data, but also making sure unmanned vehicles can securely operate in the sky conforming to security regulations. Software is the brain of the drone, and without it the technology wouldn't be able to fly. This person must have knowledge and understanding from the autopilot actually managing the rotors and keeping the drone in the air, planning the path the drone will take, collecting useful data from onboard sensors, to getting it all back to the cloud platform, making gigabytes and terabytes of images useful and feasible to collect and how to analyze this data into an end user's browser. Since drone frameworks consists of a variety of drone app building tools, including flight control RESTful APIs, virtual simulator, analytics tools, and sensor APIs, knowledge of these tools are required. Software options are progressing rapidly and this person must be kept abreast of their progress to develop a software framework. This software framework will help control the architecture of aerial robotic systems, integrating multiple heterogeneous computational solutions (e.g., mapping methods, planning algorithms, etc.) hardware and software.Establish a software data platform that has the ability to capture imaging, process maps, and 3D models and interprets data in one platform with a powerful feature set.Drone orthomosaics (automated process for Orthorectifing the raw imagery and mosaicing them into one single image) and elevation models will often cover the satellite base layer below, making it unreadable. Research and Determine different ways we can toggle on different layers of data to be overlaid on top of our drone maps.Since there are applications that run on the drone aircraft itself to process all of the data and control the sensors, applications for the user to interact with the aircraft, and applications for pre- and post-flight activities such as stitching the images together to create a 2D map or 3D model. Our software specialist must provide a software solution that will give the ability to overlay a summary of map details, camera & image information GCP's, and processing results.Document architecture and describes business process for various concepts of operation (centralized, distributed and vendor)Participates in data governance decisionsOwns responsibility for the Data Services product plans, roadmaps, and product release plansUnderstand how to plan a mission, automatically fly and capture aerial imagery with dronesExpert knowledge in how to use imagery from any drone to create collaborative maps and 3D models.Explore trends, make measurements and have experience in incorporating drone data in open software that is used for everyday presentation tools for analysis purposesUnderstanding of ROS 2.0 is highly desiredWith the drone industry taking more and more interest in ROS, and already offering support for ROS (Robot Operating System) through built-in and optional add-on solutions, the OSRF (Open Source Robotics Foundation) has decided to make drone development a priority in its upcoming release of ROS 2.0.Knowledge of ROS 2.0 is highly desired. Since ROS 2.0 will include improved support for low-power embedded computers and microcontrollers, the ability to develop code with real-time execution re­quirements, and enhanced communication over low-quality or intermittent wireless links services will be a requirement.At least four (4) years of recent and relevant professional experience in technical or business/scientific analysis discipline; and included in the four (4) years there must be two (2) years of recent and relevant professional experience in technical efforts supporting UAV systems and components development.Understand the components of a Software Development Kit (SDK) for drones.Knowledge of how to develop applications in aerial robotics in problems such as infrastructure/surface inspectionsAt least 3 years of experience developing in C++, Python, Java, or another object-oriented programming languageExperience with web and/or mobile application developmentAt least 2 years of experience in a software testing roleExperience with automated testing frameworks and toolsKnowledge of testing methodologies, writing testing plans, and creating test casesAbility to empathize with our other Divisions and lead exploratory testing for new featuresCan identify areas of opportunity in test plans and drove solutions to correct themAbility to partner with an outsource partners to be an advocate for quality and lead by exampleAbility to report bugs and follow them through the development cycle until correctedExhibit an extraordinary attention to detail"}