{"jobID": "2546569812", "jobLocation": "New_York_NY", "jobTitle": "Special Education Teacher Support Services (SETSS) Teacher", "companyRating": "3.4", "companyInfo": {"Website": "www.bsnbcs.org", "Headquarters": "Brooklyn, NY", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " School / School District", "Industry": " Education", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Brooklyn Prospect Charter School, Ascend Public Charter Schools, Brooklyn LAB Charter School"}, "estimatedSalary": "62000", "jobDescription": "Bed-Stuy New Beginnings: Bedford Stuyvesant New Beginnings Charter School is an elementary and middle school proudly serving the students in our neighborhood in Brooklyn, affectionately known worldwide as 'Bed-Stuy'. Opened in 2010, we serve more than 670 scholars in Kindergarten - Eighth Grade through the pursuit of 21st century learning, project based & service learning, and traditional coursework strategies, students will be prepared to succeed in academically competitive schools as well as become responsible citizens of the global community.  We offer you the opportunity to change the future: one scholar at a time. Each BSNBCS Scholar (present and future) deserves the chance to receive the quality education they need to help prepare them for academic success and growth. You also deserve to work in environment that is collaborative, fosters professional growth and development, and that empowers each staff member to take ownership of the learning environment in their classrooms or functional area. This is your chance to join a great team with the intent of teaching young minds, helping our scholars grow, work in key roles within the school, and to develop your career. Our Special Education Teacher Support Services (SETSS) Teacher: We are looking for a dedicated Special Education Teacher Support Services (SETSS) Teacher who will take a creative and entrepreneurial approach to teaching and bring the learning environment to life for our Middle School scholars. We believe that every scholar can succeed with the right structures and support. As our SETSS Teacher for Middle School you will work with scholars in small group settings assisting them with ELA, Literacy, and Math concepts. You will also manage the IEP cases to actively create differentiated, scaffolded and engaging learning opportunities in small group settings for all your scholars. A day in the life of our Special Education Teacher Support Services (SETSS) Teachers:You will collaborate with your general education colleagues to ensure is differentiated and meets common core standards.You will also partner with your general education colleagues to create and implement creative lesson plans based on the needs of your scholars and that are in accordance with the BSNBCS Mission.You will work closely with peers and school administrators to develop multifaceted curriculum that integrates multiple subjects and instructional approaches to meet the needs of your scholars.We want you to take an entrepreneurial approach to your curriculum, teaching methods, and optional duties that allows you to be flexible, forward looking, and creative.As a SETSS Teacher, you will lead classroom differentiation through curricular modifications, instructional techniques, parallel instruction, small group pull-outs, and integrated classroom strategies.You will collaborate with the Middle Education Team to assess and develop goals and strategies for the IEP process and implement them into integrated classrooms.Youll need to be aware of the schools strategic initiatives and incorporate them into your work to ensure compliance with the BSNBCS Mission.Youll regularly report student progress while maintaining accurate and up to date records related to scholars achievement and performance.Through effective data analysis, you will amend your strategies and instructional approach to continue to meet the needs of the scholars and their IEP plans.Youll take an active role in your professional development by identifying and creating opportunities that expand your skills as an educator.Communication is important, so you will communicate frequently with scholars, parents, colleagues, and other school staff members with information that is pertinent to your scholars and their performance.As a SETSS Teacher, you will serve as the IEP case manager for an assigned group of students.You will also attend IEP meetings, parent conferences, and child study team meetings.BSNBCS puts a big focus on our community, so you will need to take an active role in community outreach.Youll need a strong understanding of and ability to implement the BSNBCS Mission, Vision and Values.Learning should be fun, so we want you to enjoy teaching and make every effort to make the learning environment engaging and exciting for your scholars!What you need to bring to the table:REQUIRED: You MUST have a valid and current New York State Teacher Certification in Special Education 1-6, 5-9, or K-12.REQUIRED: You MUST clear a fingerprint background check to work in any school in NY, so we require all teachers to be cleared through IdentoGo prior to starting employment with us. This cannot be waived and must be complete PRIOR to starting employment with us.You should have 2 years of experience as a classroom teacher with a measurable and proven track record of teaching success in a NY District or Charter SchoolYou must have at least two years of classroom teaching experience, preferably in an urban school.You must have a commitment to structuring learning opportunities so that all scholars can learn!What we offer you:A full-time position with a competitive salary that is commensurate with your experience and qualificationsAmazing benefits! As a member of the team, your care and well being are a top priority. You will have a great benefits package that is not only affordable but includes all the perks and benefits you deserve!We offer all of our staff tuition reimbursement and reimbursement for professional fees associated with attaining NY State Teacher and Teaching Assistant Certifications.The opportunity to shape the future. Each of our scholars has the potential to do great things. All they need is you to help show them how they can succeed!A friendly and collaborative working environment: Our classrooms use a co-teaching model that encourages partnership and collaboration with your fellow teachers. We provide weekly professional learning community engagement and opportunities to participate in school wide activities!The change to grow as a professional: You will be offered many opportunities to refine your skills and grow as a professional educator through quality professional development opportunities offered throughout the year!A learning environment that is innovative and creative: You will be empowered to be to take ownership of the learning environment in your classroom through 21st learning that is focused in project based, and inquiry based learning systems!Application Process Applications are accepted on an ongoing basis. Once we have received your application, we will review your qualifications and experience as quickly as possible and get back to you within one week of submission."}