{"jobID": "2827167446", "jobLocation": "Boston_MA", "jobTitle": "Data Analyst - VP", "companyRating": null, "companyInfo": {"Website": "www.ssga.com", "Headquarters": "Boston, MA", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Subsidiary or Business Segment", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " BlackRock, Fidelity Investments, Vanguard"}, "estimatedSalary": null, "jobDescription": " Enterprise Data Governance (EDGM) is a Corporate-wide initiative focused on the on-going governance of data in our Platforms. The EDGM Capabilities Team defines requirements and  design for on-going initiatives to support the Business users across the State Street enterprise including People, Process and Technology initiatives. The EDGM Capabilities team is looking for experienced people with skill sets that enable us to successfully deliver our many project objectives. The team works to define requirements and define/design enhancements for multiple Enterprise Platforms including KYC, MDM, Client Lifecycle, Data Governance and Enterprise Contract Management System (ECMS). This business/process analyst position will focus on defining and documenting enhancements for the ECMS enterprise platform.  Expertise required includes subject matter expertise relative to complex business process requirements and design; Gathering information from multiple sources and reconciling conflicts; decomposing high-level information into details, documentation, and use cases ResponsibilitiesGather business requirements from data consumers including Business Units, Compliance, Shared Services, and others. Write business requirement documents and data mapping specifications.Detailed understanding of mapping business requirements to the technologyEnsure data privacy and security needs are well defined. Design and ensure the development of data privacy and security in alignment with regulatory and jurisdiction based requirements.Collaborate with Data Governance and support their objectivesUtilize subject matter expertise to investigate and contribute to resolution of production problems, liaising with development, support and data consumersParticipate in other initiatives in EDGM as needed, providing business analysis and data expertise. Skills and Experience Expertise required includes subject matter expertise relative to complex business process requirements and design; Gathering information from multiple sources and reconciling conflicts; decomposing high-level information into details, documentation, and use casesUnderstanding of data modelsAdvanced reasoning; excellent verbal, written, and presentation skills.Ability to liaise between the business and technology teams, strong collaboration and relationship management skills"}