{"jobID": "2821992013", "jobLocation": "New_York_NY", "jobTitle": "Sales Development Representative (SDR)", "companyRating": null, "companyInfo": {"Website": "www.idioplatform.com", "Headquarters": "London, United Kingdom", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Are you ready to take the next step in your career? Do you have the ambition to join an energetic and collaborative SDR team?  Join Idio as a SDR (Sales Development Representative) to build up a wide range of experience, knowledge and network and play a major part in the company‘s global growth. Joining the SDR team at Idio you will be responsible for generating qualified sales opportunities, collaborate strategically with experienced Account Executives and the marketing team to research and target enterprise accounts and have a huge impact on Idio’s growth.  By selling the most innovative, disruptive predictive marketing solution, you will communicate, educate & challenge some of the largest companies in the world.  Idio's SDR work both independently and collaboratively. You will be utilizing a great sales stack including tools like Salesforce, LinkedIn Navigator, Yesware and many more. Ideal candidates should be driven self-starters who are excited to be a part of something big.  Kick-start your career at Idio! SDRs serve as a talent pool of high potentials for many other departments in the company, such as sales, customer success and marketing. This is where it all starts!  What you'll be doing: Achieve or exceed monthly goal of generating qualified opportunities within our target accountsDevelop new relationships through phone, email, and social media in order to establish meetings with senior level decisions makers in our target accountsArticulate and evangelize Idio’s value proposition to decision-makers across multiple industry verticals to assess their buying interestCollaborate daily with experienced Account Executives to research target accounts, identify key players, generate interest and develop target accountsAssist in the consultative sales process by learning as much as you can about a prospect, uncovering their business needs and sharing that information with the sales teamUtilize our CRM, marketing automation and sales acceleration tools to manage your pipeline and maintain accurate information about prospects and target accountsSupport marketing in driving attendance at our targeted industry eventsHave a lot of fun working with driven, intelligent and genuinely friendly team membersRequirementsBachelor's degree or higher in a relevant fieldIdeal, but not absolutely necessary: 3+ months of sales or sales development (SDR) experience (SaaS Sales a plus)Excellent communication skills in writing, speaking, listening and cold-callingHigh energy and positive attitudeAble to work independently in an entrepreneurial, start-up environmentAbility to understand and successfully articulate technical offerings and solution setsAbility to converse with and influence marketing organizationsExperience with Salesforce a plusSolid understanding of social media tools and vehicles including LinkedIn, Twitter, etc.BenefitsCompetitive base salary, plus share options in fast growing start-up, providing substantial upside in next 2-3 yearsMonthly uncapped commission on pipeline generation quota, plus commission on follow-on revenue wonOpportunities to advance career into sales, marketing or customer successGreat, flexible paid vacation packageReally fast paced, collaborative and fun sales cultureRegular team networking and social eventsReally smart colleagues who like to work hard and play hardFree Friday team lunch, fully stocked kitchen, great office coffee"}