{"jobID": "2822810587", "jobLocation": "San_Jose_CA", "jobTitle": "Training Manager", "companyRating": "4.5", "companyInfo": {"Website": "www.risesmart.com", "Headquarters": "San Jose, CA", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "102000", "jobDescription": "About The Job We are looking for a Training Manager that has experience designing, developing and launching enterprise trainings globally; leveraging industry tools, technologies and best practices. This is an Individual Contributor position and is a key member of our Practice Strategy Team. As the Training Manager you will standardize and enhance existing internal training materials and processes, develop new training materials for RiseSmart programs, business processes and technology products. The ideal candidate will have a passion for learning, cross-functional collaboration and be self-driven.  This position can be located in our San Jose office or remote. What You Will DoAct as instructional design SME across organizationDevelop standardized templates for training materials at RiseSmart. Make improvements to existing materials where needed.Conduct needs analyses. Collaborate with subject matter experts to design and develop new training materials (PPT decks, videos, and e-Learning) on RiseSmart solutions, processes, programs and products for global service delivery team members and end users.Assist in the development of career development resources and drive communication for new resource rolloutsTrack usage and, when possible, effectiveness of training materials and customer satisfaction with training materials. Use feedback to improve training materials and processes.Work with team managers to organize and store training materials. Manage the learning management system (LMS).Manage any training escalations.Make suggestions for general training approach improvements based on industry standards, new technologies and approaches.Keep up to date on latest industry standards, tools, and processes. Research and analyze training options, delivery methods and techniques. Act as an instructional design subject matter expert.RequirementsAbility to share portfolio of training materials demonstrating experience with power point, video and instructional design formats.5+ years experience in Curriculum Development / Instructional Design / multimedia developmentExperience working with product and engineering teams, including designing training for technology products.In depth experience with authoring and video editing tools (Evolve, Storyline, Camtasia, etc.) and LMS software. Technology savvy on web and mobile devices.Knowledge of training related analytics and reportingDemonstrated experience in assessing training effectiveness (e.g., Kirkpatricks four levels of evaluation)Specialized training in instructional design methodologies; ISD certification a plusStrong attention to detail and accuracyStrong verbal and written English skills comfortable/experienced doing voice overs for video contentExperience in developing standardized training materials that will later be localized by regional resourcesExperience building partnerships and consulting effectively across organization at all levelsMake decisions and solve problems while working under pressureManage multiple projects to meet target dates for implementationStrong Microsoft Office skills (Outlook, PowerPoint, Word, Excel)Understand and incorporate training best practices into curriculum developmentInnovative thinker with fresh ideas about the best methods to implement scalable training for enterprise solutionsExperience driving projects and results in a virtual, matrixed environmentConfortable working as an Individual Contributor with a remote teamAbout RiseSmart At RiseSmart, our mission is to transition talent to new beginnings. We provide industry-leading outplacement and redeployment solutions that support people through organizational changes, and we do so with passion, a commitment to excellence, and a relentless pursuit of results. Every day we enable impacted employees to find fulfilling work, and we give our Fortune 1000 customers the peace of mind that comes from knowing that they are working with a compassionate, contemporary, outcome-driven team. Our innovative technology has disrupted a $6B industry and helped us grow to become the nations fastest growing outplacement provider. Our expert coaching and professional branding teams have successful track records of empowering careers. And, ultimately our results speak for themselves: we have received enormous industry recognition, including Gartners Most Innovative Company, the Nations Best and Brightest Companies to Work For, Fortunes 100 Best Companies for Women, and Deloitte Fast 500 recognized as one of North Americas fastest growing technology companies with growth exceeding many impressive companies such as LinkedIn, Yelp, Marketo, Zillow, and ServiceNow.  For more information about RiseSmart's career transition solutions, visit www.risesmart.com.What's In It For You?Be a part of a winning team which is rapidly expanding both within the US and Globally.Competitive compensation.Excellent work environment with an award winning culture, Best Places to Work, Great Rated, Fortunes 100 Best Companies for Women, and check out our Glassdoor Rating of 4.0!Opportunity to learn and contribute to RiseSmart's continued success in a highly visible role.RiseSmart is proud to be an equal opportunity employer.  RSGD18"}