{"jobID": "2817239258", "jobLocation": "Seattle_WA", "jobTitle": "ML Data Scientist III", "companyRating": "3.4", "companyInfo": {"Website": "www.liveperson.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1995", "Type": " Company - Public (LPSN) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Oracle, Salesforce, 24/7 Real Media"}, "estimatedSalary": "143000", "jobDescription": " LivePerson makes life easier by transforming how people communicate with brands. Our 18,000 customers, including leading brands like Citibank, HSBC, Orange, and The Home Depot, use our conversational commerce solutions to orchestrate humans and AI, at scale, and create a convenient, deeply personal relationship a conversational relationship with their millions of consumers.  LivePerson is seeking an exceptional candidate in the areas of Natural Language Processing (NLP) and Understanding (NLU), dialogue management, and semantic parsing. We have one of the world's richest data sets to learn from and a great team of scientists and engineers to learn from. Opportunity:Apply cutting-edge methods of NLP/NLU to learn and derive value from one of the world's largest goal-oriented conversational data sets.Work on challenging unsupervised and semi-supervised problems related to intent and dialog management. Throughout your experience at LivePerson, you will grow expertise in the following Proposing and executing research efforts integrated with production systemsDesigning and building a modern, flexible NLU pipelineDeveloping measurement strategy, control methodology, and experimental designMinimum Qualifications:3-5 years experience in ML, specifically in NLU/NLPMasters or PhD in Computational Linguistics, Computer Science, Statistics, or Mathematics.Knowledge of modern Deep Learning approaches to NLPAbility to write Python code that is efficient and cleanExperience with scripting languages working in a Linux environmentAbility to work closely with teammates in a highly collaborative environment, as well as providing strong individual contributionsExperience with Python packages for Machine Learning (Scikit-Learn), NLP (SpaCy), and Deep Learning (Pytorch)Preferred qualifications:NLP techniques to solve problems such as sentence summarization, question answering, sentiment analysis, knowledge extraction and conversational botsExperience with multilingual NLP systems a plusResearch experience in NLP research or related fields, e.g. NLU, NLG, ASR/TTS and/or experience with dialogue systemsModeling to production and monitoring performance once completedDeep learning models with internal and external NLP datasetsMachine Learning tools, models for Natural Language Processing applications, experimental design, research methodologies, qualitative and quantitative analysisAnalyzing, problem-solving, communicationing, and critical-thinking skills"}