{"jobID": "1154563234", "jobLocation": "Foster_City_CA", "jobTitle": "QA Analyst", "companyRating": null, "companyInfo": {"Website": "www.lat36.com", "Headquarters": "Franklin, TN", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " TEKsystems, Collabera"}, "estimatedSalary": null, "jobDescription": " QA AnalystJob  code: 10573Job Category: QACity: Foster CityJob Description:# 7812 - QA Analyst - Senior-San Francisco, CA-12 Months QA Engineer – Web Services Automation  The QA Engineer is a key member of the team responsible for software test and evaluation efforts. This candidate will be responsible for developing systems and tools for QA with the capability to support continuous integration development and quality test cycles which are highly automated. In addition, this role will be responsible for designing and implementing solutions for QA in the area of Web services, UI Automation, Functional testing, usability, accessibility, Internalization, scalability and performance. The candidate should be able to translate business use cases into technical specification and implement the solution. In addition, this role will facilitate internal/external communication between the development team and Acceptance Test stakeholders, as well as validate that the development team adheres to established Agile Testing methodologies and processes.  Key Responsibilities:  • Collaborate with developers and QA leads to improve testability, automation, and tools.  • Design and develop Web services Automation Framework.  • Work with the team to increase the test coverage using Java or Ruby Programming.  • Execute automated and manual test during sprint and release cycles.  • Work with development and operations to improve efficiency and effectiveness of automation.  • Design and execute test plans, scenarios and scripts.  • Document software defects, using a bug tracking system, and report defects.  • Plan test schedules or strategies in accordance with project scope or delivery dates.  • Use Scrum methodology and participate in all phases of the iterative process.  • Monitor bug resolution efforts and track successes.  • Define test parameters, design tests, interpret test results and analyze test trends.  • Define and implement testing and verification strategies.  • Implement, gather, and report team and project metrics.  • Coordinate with offshore development and test teams.  Qualifications/Skills:  • 5+ years of experience in development or QA Web services Automation.  • 3+ years of strong technical competency and hands on experience with web applications and web services.  • Strong understanding of Agile, Scrum, and Quality Assurance processes and methodologies.  • Created a suite of automated SOAP UI tests for SOAP and REST Services.  • Experience with testing API and the Soap/Rest based web services using SOAPUI.  • Created Test Suites and performed parameterization using properties files for SOAPUI test cases  • Strong experience in building automation framework for web services using SOAPUI or any web services tool.  • Must have experience with Assertions like Schema Compliance, SOAP, XPath assertions using SOAPUI.  • Used properties files and Groovy Script for data driven testing using Soap UI.  • Troubleshooting skills for analyzing API logs for failure analysis.  • Knowledge of relational database design concepts and physical table structures and ability to write high-performance SQL.  • Experience and strong understanding of Internalization and localization testing.  • Need to have ability to translate design specs to browser behavior.  • Must have experience with any one of the automation tools like Junit, TestNG, Rake, Rspec, Cucumber, Selenium RC/Web Driver.  • Strong understanding of object-oriented programming concepts, distributed systems, web technologies (HTML, JavaScript, Ruby Programming, AJAX and Python).  • Experience with using Firebug or Fiddler for testing.  • Knowledge of iOS/Android development, JavaScript, HTML5.  • Experience with Mobile testing Emulators such as Device Anywhere, Perfecto Mobile, or Android’s Robotium  • Experience utilizing Xcode, iPhone SDK, or Android SDK.  • Experience with Tools like Rally, Jira, SharePoint, Wiki etc.  • Must have strong Cross Browser/OS Testing Experience.  • Must have experience in working for Production/Release Validations  • Excellent verbal, written and listening communication skills with an ability to influence and develop relationships with key partners.  • Experience in working in a cross functional organization with multiple stakeholders.  • Proven ability to work in a team environment.  • BS in computer science, computer engineering or relevant technical discipline required. Jaya Krishna | Latitude 36, Inc | Technical Recruiter Desk: 510-894-7002, Cell: 510-468-8632 | efax: 615-807-4999 | Fax:510-578-7573  Email: jayakrishna@Lat36.com Web: www.Lat36.com Connect with us on: Like us on Facebook  Follow us on Linked In  Tweet us on Twitter About us: Latitude 36 is a full-service staffing services firm, specializing in recruiting for Information Technology and Healthcare positions. Founded in 2000, Latitude 36 is a WBENC certified woman-owned company. Our clients include Fortune 1000, large (500MM+) privately-held companies and non-profit corporations. Latitude 36’s core service is staffing. Through time-tested recruiting programs, we offer our customers the highest-caliber, pre-screened resources to ensure our customers meet business and project objectives."}