{"jobID": "2766471082", "jobLocation": "Boston_MA", "jobTitle": "Product Business - Data Analyst", "companyRating": "4.3", "companyInfo": {"Website": "www.bcg.com", "Headquarters": "Boston, MA", "Size": "Unknown", "Founded": " 1963", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " McKinsey & Company, Bain & Company, Accenture"}, "estimatedSalary": "70000", "jobDescription": " Product Business - Data Analyst  08-May-2018 Position Summary The Data Analyst will play a critical role in driving the commercialization of the OrgBuilder tool and Organization Design topic. He or she will be collaborating in a fast-paced, multi-million dollar, multi-year, and globally distributed investment and should expect to interact on a daily basis with BCG’s consulting and client teams. Under general guidance from the Knowledge Team, this role will be responsible for producing org structural diagnostic analytics to be delivered in a proposal setting; this person will also help to drive innovation in Org Design analytics space. Job ID6568BRCompany Information The Boston Consulting Group (BCG) is a global management consulting firm and the world’s leading advisor on business strategy. We partner with clients from the private, public, and not-for-profit sectors in all regions to identify their highest value opportunities, address their most critical challenges, and transform their enterprises. BCG was founded in 1963 and is a privately owned firm with more than 14,000 employees across 85 offices in 48 countries. Integrity, respect for the individual, delivering value, and making an impact on society are just some of BCG's core values. BCG's commitment to both our clients' success and our own standards is what sets BCG apart as a world-class professional services organization. Join BCG - start your career at a company that is consistently ranked as the leader in its field, and is acknowledged as one of the best places to work. Employee Type Regular Basic Job RequirementsBS/BA Degree in software engineering, computer science, mathematics or related field2-3+ years of relevant experienceA strong technical foundation in building analytical solutionsAdvanced Excel proficiencyExperience in People & Organization/ HR topics a plusKey CompetenciesProblem solving, analytical skills and decision makingStrong analytical skills. Proficient in Excel and comfortable handling large databasesAbility to organize information and assess alternatives to make effective decisions and drive resultsStrong sense of accountability and ownershipInherent intellectual curiosity and appetite for continuous learningWillingness to learn and apply new technology platformsCommunication, interpersonal and teaming skillsExcellent at teamwork, interpersonal and communication skills; exhibits professionalismAbility to work with varied stakeholders and diverse teamsFluent, business-proficient written and spoken EnglishFamiliarity with slide writing/ PowerPointWork management, organization and planningExcellent organizational skills with strong attention to detail, efficient time managementAbility to prioritize work effectively and independently; proactively communicates issues, priorities, and objectives; manage expectations with relevant stakeholdersAbility to thrive in a dynamic, fast-paced, demanding environmentCustomer and business focusStrong collaborative skills and ability to adjust approach to effectively interact with varied customers at all organizational and technical levelsExcellent customer service and attentiveness to user needsValues and ethicsDemonstrates competence and character that inspires trust.Ability to respect all BCG and client information as personal and confidentialJob Type Full time Additional InformationWORK ENVIRONMENT:Must be able to perform successfully in a fast-paced, intellectually intense, service-oriented environmentAbility to work successfully within a complex matrix structured organization is essentialAble to within a diverse (different disciplines, seniority levels, cultures) and geographically dispersed teamNon-discrimination Statement The Boston Consulting Group is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, age, religion, sex, sexual orientation, gender identity / expression, national origin, disability, protected veteran status, or any other characteristic protected under federal, state or local law, where applicable, and those with criminal histories will be considered in a manner consistent with applicable state and local laws. In addition, as a federal government contractor, BCG maintains an affirmative action program which furthers its commitment and complies with recordkeeping and reporting requirements under certain federal civil rights laws and regulations.BCG is an E-Verify Employer. Click here for more information on E-Verify. VEVRAA Federal Contractor Country United States City/Town Boston, Chicago Function Software Product Business Job ResponsibilitiesEngage with proposal team, client, and knowledge team experts to understand context and scope of proposal diagnosticsJoin client calls to explain data requestReceive org data and review for completeness; structure communications for client to prioritize data issues and fixes; update database to reflect validated informationLeverage OrgBuilder to analyze organizational structure and produce reportsUse context and topic understanding to develop insights and identify deep divesApply critical thinking and creativity to push the limit of current diagnostics and identify new approaches/lenses to testing hypotheses; perform custom analytics, as requiredPresent output to proposal team, knowledge team experts, and clientsJob Title Data Analyst "}