{"jobID": "2764834847", "jobLocation": "San_Francisco_CA", "jobTitle": "Product Insights Data Analyst", "companyRating": "4.3", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "98000", "jobDescription": "About Uber We’re changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now we’re a part of the logistical fabric of more than 600 cities around the world. Whether it’s a ride, a sandwich, or a package, we use technology to give people what they want, when they want it.  For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer.  And that’s just what we’re doing today. We’re thinking about the future, too. With teams working on autonomous trucking and self-driving cars, we’re in for the long haul. We’re reimagining how people and things move from one place to the next. About the Role The candidate in this role will work extensively with Product Insights team and stakeholders across the organization to (1) improve customer experience and drive contact rate reduction at Uber and (2) drive strategy in collaboration with global stakeholders. The candidate will demonstrate ability to structure data, turn data into insights and insights into actions that assist senior management with decision making. What You’ll DoFocus on building relationships with and collaborating with global stakeholdersUnderstand tools, technologies, databases required to generate insights, and support processes to identify the factors influencing contact ratesProvide analytical support for the Program team and stakeholders from other Uber teamsBuild and maintain internal tools and dashboards for - Contact rate tracking and reporting, trend deep dive analysis, identifying top customer issue categories and granular root cause problemsBuild tools to accurately attribute impact to specific product, policy and process rolloutProvide vision and directions for future reporting and analytics requirementsDesign, implement, and iterate on a process to communicate and align better with our global stakeholders.Research and adopt tools and technologies for improved reporting and analyticsWhat You’ll NeedMinimum 2 years of professional experience in analytics and data analysisBA/BS/Masters in Business, Economics, Statistics, Analytics, Mathematics, Engineering or other quantitative focusStatistics and data management using Excel, Google Sheets, etc,Advanced proficiency in database querying (SQL) and dashboard toolsProficiency in R and/or Python  Interest in solving complex problemsStrong communication and project management skillsDeliver results in a dynamic and distributed work environmentStrong execution and organization skillsAbout the Team Community Operations is pioneering how Uber manages rider and driver support around the globe during our most critical incidents and accidents. The Product Insights team works with product, operations and community operations teams from across the organization to identify the most critical customer problems and influence product and policy requirements to address these needs."}