{"jobID": "2782959492", "jobLocation": "Newark_NJ", "jobTitle": "Communications Specialist – VISTA Member", "companyRating": null, "companyInfo": {"Website": "www.newjerseycommunitycapital.org", "Headquarters": "New Brunswick, NJ", "Size": "51 to 200 employees", "Founded": " 1987", "Type": " Nonprofit Organization", "Industry": " Finance", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Are you a communications professional who wants to make a difference? Interested in cutting-edge community development, neighborhood revitalization, and developing mission-driven communications strategies? If so, we have a year-long opportunity for you!We have partnered with AmeriCorps VISTA (Volunteers in Service to America) to offer three one year opportunities for you to bring your passion and perseverance where you can have an impact. You will living and working alongside community members to advance local solutions.What you’ll doAs a Communications Specialist VISTA you will assist in our effort to create visibility and enhance awareness of the extraordinary work we do. Each of the three positions will serve different but related programs and communities. One will be based in Newark focused on our Real Estate and Affordable Housing operation, Community Asset Preservation Corp. (CAPC). Another will be based in New Brunswick to work with NJCC’s Address Yourself® (AY), an affordable homeownership initiative that combines budgeting, pre-purchase, and credit counseling with access to low-cost mortgage products. The third opening is based in Trenton supporting our efforts in the East Trenton neighborhood and other targeted communities. Working with the Communications Manager & the two other VISTAs serving as Communication Specialists, you will:Facilitate an analysis of the accuracy and clarity of the NJCC and specific initiative brands -- along with the market awareness of our key programs.Based on your analysis, develop a comprehensive branding plan within our current and emerging markets.Assist in developing an intensive digital and social media strategy to reach our target audiences & market segments.The collection and analysis of community level data has been integral to the continued and growing understanding of the housing, community, and economic markets and needs in New Jersey neighborhoods.While you will work primarily for a specific NJCC program, you will also play a critical role in building NJCC’s overall marketing & communications infrastructure. The byproducts & impact of your work as a member of this invaluable VISTA team will live well beyond your time here with NJCC. The “return-on-investment” (ROI) of your work is enabling NJCC to significantly expand its brand as New Jersey’s largest CDFI and thought leader in community development. The skills you'll needWe’re looking for people who are motivated and driven to develop their career. To be successful in this role, you’ll:Have a passion for community service and a strong customer service attitude.Be curious and independent.Have completed some college level coursework in Communications, Marketing, Journalism, Urban Policy or Planning, Economic Development, or related courses.Have demonstrated writing skills, ability to translate between English and Spanish is preferredBe experienced with social media platforms and website development.Have superb interpersonal communications skills and the ability to establish rapport with divers groups easily.Be able to demonstrate proficiency with Microsoft office and Adobe Creative Suite.What else you'll need to knowAt our core, New Jersey Community Capital (NJCC) is a financial organization with a mission to create thriving communities. We do this through strategic investments and knowledge. Fulfilling the needs and improving the quality of life of thousands of individuals and families would not be possible without our talented and diverse staff, and motivating environment. At NJCC, we are always looking for great people to join our team. Our fellowship program accepts applicants on a rolling basis and targets current undergraduate or graduate students.We are all about taking a comprehensive approach to transforming New Jersey’s underserved communities. NJCC specializes in providing flexible, hands-on financing to nonprofits and other mission-driven entities, empowering them to grow and thrive. We provide an array of services to our borrowers, including financial training and portfolio management.Each year, NJCC and its affiliates provide millions of dollars in capital and substantial technical assistance to support the revitalization of communities across the state. These efforts provide quality housing, early care, education, and employment to thousands of low-income people. NJCC has also emerged as a national leader in developing creative strategies to reverse the distress created by the foreclosure crisis, implementing large-scale programs to acquire and redevelop vacant homes, modify nonperforming mortgages, and infusing flexible capital into collaborative community-level efforts to stabilize blighted neighborhoods.NJCC embraces diversity and equal opportunity in a serious way. We are dedicated to forming a team that represents a variety of backgrounds, perspectives, and skills. The more inclusive we are, the better our work will be. Check us out at www. newjerseycommunitycapital.orgCompensationAmeriCorps VISTA provides a living allowance to cover the cost of food, housing, and other basic necessities during your service. Amounts are low because you are expected to live at approximately the same economic level as the people you are serving. The living allowance stipend for this position varies based on location but starts at an annual allowance of $14,136 paid bi-weekly. (Federal income tax deductions are withheld from the living allowance. No state, county, or city tax deductions are withheld. However, you are responsible for paying those taxes, as appropriate.) AmeriCorps provides options for health care benefits, child care benefits, and a relocation allowance. Additionally, each member is eligible for either an Education Award of $5,920 or an $1,800 cash stipend at the end of the full year of service.To Apply  If this exciting opportunity appeals to you, please apply at the AmeriCorps VISTA site: https://my.americorps.gov/mp/listing/viewListing.do?id=80295&fromSearch;=true"}