{"jobID": "2693773709", "jobLocation": "Seattle_WA", "jobTitle": "Senior Data Scientist - Natural Language Processing", "companyRating": null, "companyInfo": {"Website": "www.curacloud.net", "Headquarters": "Seattle, WA (US), WA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Career Summary: CuraCloud is developing a new generation of AI-enabled diagnostic services for health systems and cancer researchers, with a focus on medical image analysis and cancer genomics testing. We are looking for multiple, talented data scientists and machine learning experts to help build our cloud-based data analysis platform. Responsibilities: As part of our core research and development team, you will: Research and design novel NLP products in the healthcare sectorDesign and develop cutting-edge machine learning/deep learning algorithms for successful implementation of NLP productsPerform statistical NLP analysis to process and extract information from unstructured medical/clinical reportsWork closely with other Research Scientist team members to write papers and patentsMentor intern NLP projectsQualifications:PhD degree in highly quantitative/analytical field, such as Computer Science, Electrical Engineering, Applied Math, Statistics, Operations Research and PhysicsDeep knowledge of NLP directions and business products, especially in the healthcare sectorSolid understanding of general NLP techniques such as HMM, CRF, LDA and deep learningHands-on experience of applying machine learning algorithms and deep learning to real-world NLP problems (mature industry products preferred)Expertise in deep learning libraries such as keras, Tensorflow and PyTorchStrong publication record related to NLP or machine learning/deep learning research/applicationsAbout CuraCloud: CuraCloud is a fast-growing AI healthcare services company with an R&D; center in Seattle and offices in Beijing and Shenzhen. We are working with healthcare delivery organizations, university-based researchers, innovative radiology practices and IT services providers around the world to make a positive impact on healthcare. You will work with organizations and individuals who see the future of AI in the medical industry, and want to create new solutions for their patients.  CuraCloud Corporation is an equal opportunity employer and all qualified applicants will receive consideration for employment. We will provide competitive salaries and benefits."}