{"jobID": "2830923103", "jobLocation": "New_York_NY", "jobTitle": "Private Duty RN Registered Nurse", "companyRating": null, "companyInfo": {"Website": "www.whiteglovecare.com", "Headquarters": "Brooklyn, NY", "Size": "1001 to 5000 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Private Duty RN Registered Nurse White Glove Community Care, the largest home health care company in New York and New Jersey is hiring compassionate Private Duty RN Registered Nurse to provide skilled nursing care to patients in the home setting. We are the hearts of 5,000 caregivers and trusted by over 2,000 families.If you are a compassionate and knowledgeable Private Duty RN Registered Nurse, we would love to hear from you! Job highlights: Private Duty RN Registered NurseFull-time and part-time positions availableFlexible scheduling with multiple shifts to choose fromStart Date: ASAPResponsibilities: Private Duty RN Registered NurseAssess patients’ condition during every visit and chart your observationsPerform evaluation tasks, including vital signs and medication reviewAdminister medication as prescribed by the patient’s PhysicianDress or redress open wounds and assess progress of healingEducate patients and their families on proper home health care strategies and proceduresBenefits: Private Duty RN Registered NurseSalary YOU deserveDirect Deposit – for your convenienceDaily/Weekly PayrollRefer-A-Friend Bonus24 Hour support by our caring teamFree health and dental insuranceMonthly cellphone reimbursementAs a Private Duty RN Registered Nurse with White Glove you’ll also get to enjoy complimentary perks that gives you access to 20 – 60% off on movies, hotels, shows, concerts, sporting events and more! Exclusively for White Glove employees… ask us more!Requirements: Private Duty RN Registered NurseRegistered Nurse RN NYS LicenseEligibility to work in United States"}