{"jobID": "2447076019", "jobLocation": "Cambridge_MA", "jobTitle": "Associate Director, CMC Regulatory Affairs", "companyRating": "5.0", "companyInfo": {"Website": "www.sagerx.com", "Headquarters": "Cambridge, MA", "Size": "201 to 500 employees", "Founded": " 2010", "Type": " Company - Public (SAGE) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "125000", "jobDescription": "General Scope and Summary SAGE Therapeutics is searching for a creative, resourceful, integrative thinker for a highly-visible role that is responsible for CMC regulatory activities, strategies and submissions supporting the development and commercialization of Sage's multi-product CNS portfolio. Sage has successfully been granted FDA Fast Track and Breakthrough Therapy designation, and received EMA PRIME designation, therefore this role will provide a very exciting opportunity to be involved with innovative regulatory strategies. Roles and ResponsibilitiesAs a member of the program teams, provide strategic guidance on FDA and global regulatory requirements for clinical development and registration of small molecule pharmaceuticals.Compile, review and approve CMC modules of development and marketing registration applications, amendments, and supplements for submission.Development and implementation of CMC RA strategies for the earliest possible product approval and assistance with preparation for agency meetings.Manage and ensure compliance with all reporting requirements, including annual and periodic reports.Serve as CMC regulatory lead at internal meetings as well as at meetings with business partners and regulatory agencies for all CMC related issues.Assess and communicate CMC regulatory requirements to ensure all development activities are in compliance with applicable regulations and guidelines.Collaborate with contract staff and vendors as needed to support regulatory activities.Provide create and innovative solutions while being an advocate for compliance.Experience, Education and Specialized Knowledge and Skills Must thrive working in a fast-paced, innovative environment while remaining flexible, proactive, resourceful and efficient. Excellent interpersonal skills, ability to develop important relationships with key stakeholders, good conflict management and negotiation skills, ability to analyze complex issues to develop relevant and realistic plans, programs and recommendations. Demonstrated ability to translate strategy into action; excellent analytical skills and an ability to communicate complex issues in a simple way and to orchestrate plans to resolve issues and mitigate risks. 5+ years of experience in Regulatory Affairs related to development of pharmaceuticals with a minimum of 4 years in Chemistry, Manufacturing and Control (CMC) regulatory environment, CNS experience preferredBachelor of Science in a scientific discipline (Chemistry, Biochemistry, or related pharmaceutical science), advanced degree preferred.Established working knowledge of regulatory guidelines and regulations (US and international).Regulatory experience supporting both development projects and marketed products.Strong knowledge of eCTD elements and structure and regulatory writing skills .Experience working with all levels of management and consulting with key business stakeholders. An ability to influence for greater outcomes.Attention to detail and the ability to work individually, within a multi-disciplinary team, as well as with external partners and vendors.Possesses strong written and verbal communication and presentation skills.Embrace our core values: Put People First, Do Big, Be Accountable, Grow through Learning and Change, and Work Fun.Excitement about the vision and mission of Sage."}