{"jobID": "2792129166", "jobLocation": "Boston_MA", "jobTitle": "ViralGains - Senior Data Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Senior Data Scientist  ViralGains is a leading video ad engagement platform looking for Data Scientists to power the next stage of explosive growth.  Job Description:  ViralGains is seeking a motivated Senior Data Scientist for our viral video marketing Software as a Service (SaaS) platform. Ideal candidates are passionate about discovering insights, and applying those insights to deliver massive business value. The candidates need to be process driven, detail-oriented, hands-on, fast learners and passionate about technology.  Responsibilities:  Apply tools and develop strategies/software to discover actionable insights from massive video-based ad tech marketing data  Develop tools/models to leverage those insights in the course of a media advertising campaign to optimize marketing strategy and execution  Clearly communicate insights to all employees including executives through written and verbal presentations  Requirements:  Experience with AdTech technology and industry.  Experience building machine learning models in Python, R, or similar language  Experience using SQL to query large data sets (e.g. Snowflake; RedShift; BigQuery)  Experience with business intelligence and data visualization tools such as Tableau, Excel, QlikView  Expertise in predictive analytics/statistical modeling/data mining algorithms  Experience applying Artificial Intelligence approaches for business outcomes  Hands-on experience building models using Regression algorithms, Classification algorithms, Unsupervised algorithms (e.g. Clustering; A Priori); Ensemble approaches  Experience with Regularization approaches; model performance optimization and hyper-parameter tuning  Must have knowledge/experience in some/all of the following: Multivariate Regression, Logistic Regression, Support Vector Machines, Bagging, Boosting, Decision Trees, Customer Lifetime Value analysis, common clustering algorithms, Optimization, Stochastic Processes; Deep Learning algorithms  Ability to make intelligent approximations of mathematical models in order to make them practical and scalable  Exceptional organizational skills, meticulous attention to detail, and ability to maintain focus in fast-paced, ever-changing environment  Solid understanding of marketing platforms (emphasis on Display/Ads) and experience using several consumer-oriented apps  Strong initiative, flexibility, and ability to learn quickly  Self-motivated and self-managed with a high degree of dependability  Analytical, problem solving skills, ability to learn and apply new tools & applications.  Nice to Have:  Experience using Linux, Apache Spark to develop and productionize machine learning models  Ideal Candidate:  3+ years of experience in similar role analyzing large amounts of data and generating actionable business value  BA/BS in Data Science, Data Analytics, Computer Science or related field  Interested in working in a dynamic and fast paced environment  Thrives on freedom and responsibility  Able to work at downtown Boston headquarters  Company Description:  ViralGains drives engagement and emotional connection between consumers and advertisers through the power of online video. ViralGains enables targeted, AI-optimized video distribution at scale by helping advertisers deliver video to those consumers who are most likely to engage with their brand across the most relevant channels. ViralGains is headquartered in Boston, MA, with offices in New York, Chicago, and Los Angeles.  Company Culture:  We believe in freedom and responsibility, brilliant colleagues to work with and learn from, accomplishing a lot of important work quickly, and having fun while doing it."}