{"jobID": "2831207098", "jobLocation": "Oakland_CA", "jobTitle": "HR Specialist", "companyRating": "3.5", "companyInfo": {"Website": "www.fairtradeusa.org", "Headquarters": "Oakland, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "53000", "jobDescription": "Fair Trade USA, a four-time winner of Fast Company Magazine's Social Capitalist award, promotes sustainable development and corporate social responsibility. We are an entrepreneurial, non-profit organization and the leading independent third-party certifier of Fair Trade products in the U.S. Our unique market-based model for sustainability links millions of farming families in the developing world to almost 800 leading US companies through more direct, equitable trading partnerships. Fair Trade allows farming families to improve their living standards and cultivate hope for the future while protecting the environment. At the same time, we strengthen global supply chains and make sustainability a driver of profitability for the business community. Since 1999, Fair Trade USA has generated over $400 million in additional income to hardworking farmers and farm workers around the world.Fair Trade USA is a fast-paced, dynamic environment driven by a passion for doing good in the world. We seek a highly detailed person to support the Human Resources department of our rapidly growing organization. The Specialist will primarily focus on supporting recruitment, onboarding, and benefit administration. The Specialist is responsible for the maintenance of accurate and current employee data, as well as producing management reports and aiding in organizational compliance. This position is one that touches all aspects of the organization and offers tremendous learning opportunities. The ideal candidate is one who loves to work with people as well as data!Key Responsibilities: Help conduct new employee orientations including enrollment, explanation of benefits, and HR policiesAdminister and maintain new hire orientation programMaintain data and produce reports from PayScale and internal records; Assist in research and implementation of HRIS systemMaintaining employee job descriptions; working with hiring managers to update or createPost open positions on the Careers page and external sites; manage Taleo users and serve as a point of reference for hiring managersMaintain updated benefits information and enrollment forms for new hire and open enrollments; assist in coordinating annual Open Enrollment for benefit programsInput, update, maintain, and terminate employee data; provide payroll with tracking information on new hires, merit increases, promotions, job changes, and all other necessary pay-related or personal dataWork closely with Senior HR Manager on processing of various benefits payroll deductions and special adjustments; maintain personnel recordsAssist Talent Team with legal compliance and internal policy updates and staff communicationsMaintain HR critical procedures updatesCreate and produce special HR management reports such as Total Benefit Compensation, which requires research and project managementAdministrative duties as assignedQualifications:BA/BS degree or equivalent work experience of two to three years of experience working in an analytic business environmentComfortably navigates various HR software tools for compensation, performance measurement, benefits and the likeProficiency in Microsoft products (Word, Excel and Outlook)Strong communication and interpersonal skills, including the ability to manage and discuss confidential and/or sensitive information or subjects appropriatelyDetail-oriented, logical, systematic, methodical, and highly organizedGood analytical skills including experience producing reports and spreadsheetsBasic knowledge of federal and state labor and tax lawsProcess driven, and can step back to look at the process and recognize when there might be a better wayAbility to work in a flexible, yet fast-paced and deadline-oriented environment, able to meet deadlines and share progress regularlyA passion for Fair Trade USA’s mission, vision, and accomplishmentsTo Apply: Please submit a resume and a cover letter to the attention of Sam McNaughton, HR Generalist at https://www.fairtradecertified.org/why-fair-trade/careers"}