{"jobID": "2759055490", "jobLocation": "Wakefield_MA", "jobTitle": "Client Advocate", "companyRating": null, "companyInfo": {"Website": "www.advocator.com", "Headquarters": "Wakefield, MA", "Size": "51 to 200 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OverviewWhen life changes, we can help! At The Advocator Group, we turn challenges into opportunities in order to enrich the lives of our clients. Our stunning Teammates are dedicated to preserving the financial well-being of clients by assisting them through the Social Security Disability benefits process.  The Advocator Group has achieved continuous growth in employee count, locations and revenue since our beginning in 2002. We operate as a subsidiary of Brown & Brown, one of the largest players in the insurance & financial services industry, with over 75 years of dedicated service.  We are looking for a compassionate, enthusiastic Teammate to join our team as a Client Advocate.Full time, 9am-6pm Monday-Friday$16/Hour starting salary and an extensive, paid training programLocated in Wakefield, MA- modern building with free parking & walking pathsResponsibilitiesChampion the insurance claims process by providing expertise knowledge of the insurance claims processImprove the lives of your clients by building a positive, trusting relationship to support them through a very difficult timeExceed clients’ expectationsby compassionately gathering necessary medical & work history information over the phone to complete social security disability applicationQualificationsExperience thriving in a fast paced, multi-task oriented environmentSuperb data entry and accuracy skillsTeam player with a passion for helping people through empathy & active listening skillsBachelor’s Degree preferredCustomer service, social security or insurance experience is a plusSalesforce or CRM experience is a plus Our Stunning Teammates are truly what makes our success possible! We are committed to providing a positive environment that fosters growth, innovation and collaboration. To support our Teammates, we offer…Tuition reimbursement, training & professional growth opportunitiesEmployee engagement- annual outings, MVP awards & bagel FridaysHealth, Dental, Vision & Pet Insurance plansPaid Vacation & Holiday time401K & employee stock purchase planWe play as individuals, but win as a team… We look forward to you joining The Advocator Group on our mission to change lives!PHYSICAL REQUIREMENTS Sedentary work: Exerting up to 10 pounds of force occasionally and/or a negligible amount of force frequently or constantly to lift, carry, push, pull or otherwise move objects, including the human body. Sedentary work involves sitting most of the time. Jobs are sedentary if walking and standing are required only occasionally and all other sedentary criteria are met. Physical requirements on a regular basis of this role include: Fingering: Picking, pinching, typing or otherwise working, primarily with fingers rather than with the whole hand or arm as in handling.Talking: Expressing or exchanging ideas by means of the spoken word in which one must convey detailed or important spoken instructions to others accurately, loudly or quickly.Hearing: Perceiving the nature of sounds at normal speaking levels or without correction. Ability to receive detailed information through oral communication and make fine discriminations in sound.Visual: Required to have close visual acuity to perform an activity such as: preparing and analyzing data and figures; transcribing; viewing a computer terminal; expansive reading.The Advocator Group is an Equal Opportunity Employer. We take pride in the diversity of our team and seek diversity in our applicants. M/F/D/V."}