{"jobID": "2823066696", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Analyst - Entertainment and Media Industry Opportunity", "companyRating": "3.9", "companyInfo": {"Website": "www.21cf.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public (FOX) ", "Industry": " Media", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "71000", "jobDescription": " Data Analyst, 21CF Global Inclusion (Part-Time/Temporary)OVERVIEW OF THE COMPANY21CF  21st Century Fox is the world's premier portfolio of cable, broadcast, film, pay TV and satellite assets spanning six continents across the globe. JOB DESCRIPTION 21CF is looking to hire a Data Analyst (Part-Time) to join our 21CF Global Inclusion Team. You will take responsibility for managing our master data set, developing reports, and troubleshooting data and stats issues. To do well in this role, you need a very fine eye for detail, experience as a data analyst and familiarity with positions on productions crews in the film and television industry. Duties/Responsibilities: Acquire data from primary or secondary data sources and input into databases  Identify, analyze, and interpret trends or patterns in data sets  Interpret data, analyze results and provide ongoing reports  Develop and implement databases, data collection systems, data analytics and other strategies that optimize efficiency and quality  Verify data by reviewing, correcting, deleting, or reentering data; combining data from various sources when information is incomplete; purging files to eliminate duplication of data  Compile information into Power Point decks and presentations. Desired Characteristics: Proficiency/mastery of Microsoft Excel, general spreadsheet knowledge required. Knowledge of Pivot Tables and advanced spreadsheet formulas preferred but not required.  Knowledge of television and film production roles preferred. Knowledge of television studio and network structure preferred.  Demonstrated experience inputting and updating data correctly/accurately.  Working knowledge of call sheets, current reports, final credits, crew lists, as well as online databases such as Variety Insight, IMDBPro, etc. preferred.  Ability to communicate professionally with internal/external partners/assistants/executives.  Detail-oriented, attentive, reliable, accurate, and timely.  Ability to maintain confidentiality.  We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, gender identity, disability, protected veteran status, or any other characteristic protected by law. We will consider for employment qualified applicants with criminal histories consistent with applicable law."}