{"jobID": "2769913097", "jobLocation": "Glendale_CA", "jobTitle": "Sr. Data Analyst, Product", "companyRating": "4.0", "companyInfo": {"Website": "www.servicetitan.com", "Headquarters": "Glendale, CA", "Size": "201 to 500 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " FieldAware, FieldEdge, SuccessWare"}, "estimatedSalary": "107000", "jobDescription": " We solve real world problems in the home services industry. We are passionate about bringing innovative and delightful solutions to traditional problems and workflows. Our ambitious team of product managers, designers, and product marketers works closely with our thousands of users to help make their lives easier through technology. We embrace agile development and design thinking to ship hundreds of new features every month. We measure our success based on our customer’s success. We strive for real impact. Sr. Data Analyst, Product ServiceTitan is looking for a Sr. Data Analyst to drive and oversee the tracking and reporting of key product adoption and user behavior analytics. Your work will play a critical role in informing the prioritization of the Customer Experience Team’s efforts, as well as those of the entire Product Management team. The ideal person for this role is someone passionate about data analysis as well as data-driven decision making and strategy. What you'll doAnalyze user behavior and feature usage of ServiceTitan’s SaaS products to provide key business insights based on user trends.Visualize key metrics on an ongoing basis to communicate out to product and executive teamImplement and manage internal and 3rd party metrics to drive product decisionsCollaborate with cross functional groups including Product, Design, Engineering, and Customer Success to identify key product opportunitiesDevelop quantitative analyses, ad hoc reports, models, and A/B tests to support product decisionsConduct ad hoc analyses to inform the prioritization of product development and key product and design improvementsWhat you'll need5+ years work experience in a quantitative field or equivalent educational experienceHighly motivated, proactive and able to solve diverse problems efficientlyProven history of decision making excellence and cross-functional influence through insightsExtensive experience with Google Analytics is requiredFamiliarity with other tracking tools like Pendo and/or Mixpanel strongly preferredPower user of excel (VBA), Access, Microsoft Office suiteStrong Experience writing advanced SQL queries and working with relational databasesFamiliarity with one or more data visualization tools (Tableau, Qlikview, Domo etc.)Excellent written and communication skillsEducation: BA/BS or Graduate degree in Business, Statistics, Mathematics, or related fieldAbout ServiceTitan ServiceTitan is a mobile, cloud-based software platform that helps home services companies streamline operations, improve customer service, and grow their business. ServiceTitan's end-to-end solution for the multi-billion dollar residential home services industry includes CRM, intelligent dispatch, custom reporting, marketing automation, mobile solution for field techs, and accounting integration with Intacct and QuickBooks. ServiceTitan brings a fully operational modern SaaS infrastructure to an industry traditionally underserved by software. ServiceTitan is the preferred software for hundreds of the world's most successful plumbing, HVAC, and electrical companies. For more information about ServiceTitan, visit www.ServiceTitan.com.  Los Angeles Business Journal Top 100 Fastest Growing Private Company for 2017  Inc. 5000 – America’s Fastest Growing Companies 2017"}