{"jobID": "2822933824", "jobLocation": "Boston_MA", "jobTitle": "Behavioral Technician (ABA Therapist / RBT)", "companyRating": null, "companyInfo": {"Website": "www.keyautismservices.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Seeking motivated and skilled ABA therapists to join our team!$20 - $25 an hour - Minimal Commute - Part-timeIf you are passionate about compassion, want to feel valued for the inspirational work that you do, and work with a team of people that recognizes that your time is precious too...meaning...MINIMAL driving, then Key Autism Services is a great fit for you!Seeking motivated and skilled ABA therapists to join our team!We are seeking ABA therapists to join our team of caring professionals, to provide ABA services for children with autism under the guidance of a behavioral supervisor (BCBA). With this position, you’ll be working in-home with families implementing ABA (applied behavior analysis) therapy programs established by a BCBA (Board Certified Behavior Analyst).Job Responsibilities:Work collaboratively with a BCBA supervisor to implement basic principles and teaching procedures of ABA therapyArrive on time and prepared for therapy sessionsProvide in-home Applied Behavioral Analysis therapyCollect behavior and skill acquisition data during sessionsBe responsive to the needs and requests of clients, their families and supervisorsBe goal-oriented and maintain professionalism in all aspects of your workWhat we offer:Competitive hourly rates and bonusesFlexible schedulesMINIMAL COMMUTEOpportunity to grow in the field of ABAA rewarding experience helping children and families reach their full potentialRequirements:Bachelor's Degree in related field preferredWorking experience with children for 1 year in a 1:1 settingAbility to demonstrate excellent written and verbal communication skillsPersonal means of transportation with a reliable vehicleAbout us:Key Autism Services (Key) provides services to children and adults throughout the states of Massachusetts and New Hampshire. Services include programs for children with Autism Spectrum Disorder and other related conditions. We have been serving families since 2014. At Key we work as compassionate partners with individuals, families, case managers and other professionals to provide the level of support needed to improve the lives of the clients we serve.At Key, all the autism treatment services we provide are guided by a common philosophy about the role of the family in a child's development. We strive to equip both the children and their families with necessary skills for strong, satisfying relationships with one another, because we know that learning happens best when it happens in the context of playful, reciprocal interactions with life partners.We believe family is the foundation for a child's development. Family is the ever-present guiding force in a child's life from the first breath through all the growing-up years. Family doesn't close for the holidays, go on vacation or call it quits at five o'clock. Family remains a persistent presence on a day-in, day-out basis, through all the seasons of the year, through all the years of childhood.Our team is committed to helping individuals and their families become self-sufficient and live as independently as their abilities allow. We hire compassionate, highly trained and dedicated individuals who show a passion to contribute their skills to make our client healthier and stronger.Website:http://keyautismservices.com/"}