{"jobID": "2707960702", "jobLocation": "Newark_CA", "jobTitle": "Senior Dev Ops Engineer", "companyRating": "3.3", "companyInfo": {"Website": "www.rms.com", "Headquarters": "Newark, CA", "Size": "1001 to 5000 employees", "Founded": " 1988", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " AIR Worldwide, EQECAT, Verisk Analytics"}, "estimatedSalary": "165000", "jobDescription": " Our team is responsible for automating the entire stack of high performance, large scale, geographically dispersed resources throughout its lifecycle. We will have over 5000 cores, and 2PB deployed this year with plans to significantly ramp capacity from there, and have an app stack that will challenge you and diversify your skills.  If your goal is to write code in a production cloud environment (preferably PaaS or SaaS) and code the cloud and your toolkit includes things like Docker, Mesos,OpenStack/KVM, Java, Chef, Python/Ruby, you like to work with truly agile teams, you like to be around big data problems, Fibonacci is more than a pizza place in New York to you, Linux is tattooed on your heart, and maybe you even dabble in machine learning or data mining, this is the job for you! The objective of the Senior DevOps Engineer:  As a key member of the RMS Cloud Engineering team, the Senior DevOps Engineer will contribute to the evolution of the automation framework design and toolchain selection, as well as write code and tests that continue to drive intelligence and efficiency into cloud operations and software development. Key Accountabilities & Deliverables:Defining and delivering cloud agnostic IaaS and PaaS components to support in-house developed software and data modelsDesign for a Cloud agnostic solution that has maximum flexibility and operabilityWork with both the Architecture group and our Application/Solution Development Lead to rationalize the right set of requirements and drive the selection of the right commercial/open-source technologiesBuilding and supporting a continuous integration and deployment pipelineCode Mesos Frameworks to support new applications.Design/manage process for Docker creation pipelineExperience Required:Experience in working with a Virtual team in a production cloud environment (preferably PaaS or SaaS)Experience with one or more tools from each category: IaaS Platforms: AWS, OpenStack, Digital Ocean, etcVirtualization: Docker, Vagrant, VMWare, Virtualbox, etcMonitoring: Nagios, Zenos, ZabbixLogging: Graylog, Splunk, etcConfig Mgmt: Chef, Ansible, Salt, PuppetCI / CD: CircleCI, Jenkins, GO Pipeline, etcScripting: Bash, Ruby, Python, Perl, etcNetworking: DNS, Routing, Firewalls, Load balancers, etcDatabases: PostgreSQL, MySQL, Experience with administrating Java environments (JVM, Maven, Ant, etc.). Web development experience is a strong plus.Strong communication skills (written and verbal)Excellent analytical and organizational skillsSelf-motivated and able to manage multiple tasks simultaneouslyInnate leadership skillsDesirableBS.Computer Science desired or 5+ years and equivalent work experience"}