{"jobID": "2760249408", "jobLocation": "San_Francisco_CA", "jobTitle": "Clinical Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.syapse.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "95000", "jobDescription": "About Syapse Maybe youve supported a friend or family member whos dealing with cancer. Maybe youve battled it yourself. At Syapse, our mission is to enable healthcare providers to deliver the best care to every cancer patient through precision medicine, and our personal connections to this mission are what unite us.  We integrate genomics and clinical data on a single platform and allow doctors to share important treatment and outcomes information across a national network. Our customers manage more than 1 million active cancer cases at hundreds of hospitals across the US and Asia. Now, were racing to meet growing demand and bring precision cancer care to every patient, regardless of location or income. About the Syapse Clinical Analytics Team Syapse has built a massive and revolutionary data-sharing network integrating clinical and molecular data from various health systems. The Syapse Clinical Analytics team is at the forefront of unlocking insights from this database to push forward the practice of precision medicine in cancer. We do so through direct querying of purpose-built databases to generate analytic outputs which are delivered to our partners across the healthcare ecosystem. These analytics often answer questions which were previously inaccessible. About the role Syapse is looking for a Clinical Data Analyst to accelerate the capabilities and delivery of this growing group.  The successful candidate will be excited by diving deep into clinical data. Youll enjoy solving the riddles associated with extracting insights from complicated healthcare concepts into digestible insights and executing against multiple projects simultaneously. You are also driven by our mission to improve cancer care for all patients via precision medicine.  Youll collaborate daily with a team of product managers, software engineers, ontologists, physicians and others in a fast-paced and mission driven environment. Through this collaboration, you will query our data and generate reports and dashboards that you will deliver to Syapses customers. You will use your knowledge of querying languages and strategic thinking to execute against customer and internal needs. What you bring to the table:You display a passion for our mission to improve cancer care for all patients via precision medicine.You have a bachelors or advanced degree in quantitative field such as economics, statistics, epidemiology, engineering or other.You have 0-4+ years of relevant work experience.You have demonstrated proficiency with SQL, R, Python and / or other languages used for analytics and visualization of data.You own solutions, not problems. You are an effective communicator. You enjoy working with teams. You have strong attention to detail. You are a self-starter.Bonus points if you have:Healthcare / oncology specific experienceExperience working with EHR, genomic or similar data setsEntrepreneurial experienceBenefits and perks Amazing Coworkers  Competitive pay and ownership in the company  100% company paid medical, dental and vision for employees  401(K) matching  Flexible time off  Transit assistance, CalTrain GoPass & Pre-tax commuter benefits.  Weekly catered lunches and office snacks  Company sponsored gym membership  And More! Next stepsAfter submitting an application a team member will reach out to you shortly. While each interview is unique to the role, our interview process typically consists of an introductory phone conversation with a recruiter, a second phone or video interview with a hiring manager or senior team member, a practical take home assessment and wraps up with a visit our to our office, usually lasting +/- 4-hours.Have a quick question about the role? Emailcareers@syapse.com or simply apply here."}