{"jobID": "2758304615", "jobLocation": "San_Jose_CA", "jobTitle": "Senior FPGA Timing Characterization Engineer", "companyRating": "3.7", "companyInfo": {"Website": "www.xilinx.com", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 1984", "Type": " Company - Public (XLNX) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Qualcomm, Intel Corporation, AMD"}, "estimatedSalary": "152000", "jobDescription": "DescriptionJOB DESCRIPTION:Responsible for developing methodologies to simulate and/or run STA Tools to capture FPGA Timing.Design, implementation, test, integration and delivery of system level digital designs for FPGA blocks timing verificationApply STA of concepts and related tools to generate, debug and validate timing models and correlate timing values to silicon measurements.Need to lead projects for single chip and stacked silicon full chip timing model validation and characterization and Tuning of Timing files.Provide project schedule estimates, progress updates and technical risk identificationDevelop design specifications based on project requirementsNeed to maintain an effective communication with local and remote teamsEnsure to complete design and timing verification tasks within allotted timelineXilinx is the leading provider of All Programmable FPGAs, SoCs, MPSoCs and 3DICs. Xilinx's all-programmable devices are designed into tens of thousands of products that improve the quality of the everyday lives of billions of people worldwide. For over 30 years, Xilinx has been behind some of the greatest advancements in technology and science - from the industry's first fabless semiconductor model to the NASA Curiosity Mars Rover, to today's autonomous vehicles and hyperscale data centers. Xilinx uniquely enables applications that are both software-defined, yet hardware optimized - enabling smart, connected and differentiated applications across technology's biggest megatrends, including Machine Learning, 5G Wireless, Embedded Vision, Industrial IoT and Cloud Computing and more. If you are a passionate, innovative and an out-of-the-box thinker that enjoys challenging projects, Xilinx is the right place for you. Our global team is growing and we are looking for bold, collaborative, and creative people to help deliver groundbreaking technologies that enable our customers to differentiate. Come do your best work and live your best life through collaboration, wellness and giving back to your community as a member of the ONEXILINX team. JOB REQUIREMENT:Bachelors or Masters in Electronics engineering with 8 to 12 years of experience in Digital Design or Silicon chracterizationShould be knowledgeable about all the internal blocks of FPGA like DSP, BRAM, I/O etcGood understanding of device technology, custom circuit and digital designs and electrical analysisStrong scripting skills using Perl, Python, C-shell or similar scripting languages.Experience with Xilinx FPGA design/ implementation tools a plusGood analytical, communication, presentation and troubleshooting skills are required"}