{"jobID": "2831432786", "jobLocation": "Boston_MA", "jobTitle": "Converse Lead Data Scientist", "companyRating": "3.9", "companyInfo": {"Website": "jobs.nike.com", "Headquarters": "Beaverton, OR", "Size": "10000+ employees", "Founded": " 1972", "Type": " Company - Public (NKE) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " adidas, Under Armour, lululemon"}, "estimatedSalary": "133000", "jobDescription": " Converse is the story of a sneaker that started on the court and moved to the stage and street. We're a company ready for change and that's who we hire: the most malleable, the most innovative, and the most creative. Our clothes and sneakers have been worn by rebels, rockers, rappers, artists, thinkers, and individuals. So that's why we hire individuals. So we're speaking the same language.  Description Overview: Converseis the story of a sneaker that started on the court and moved to the stage andstreet. We're a company ready for change and that's who we hire: the mostmalleable, the most innovative, and the most creative. Our clothes and sneakershave been worn by rebels, rockers, rappers, artists, thinkers, and individuals.So that's why we hire individuals. So we're speaking the same language.  Converse is setting a boldstrategic vision to lead with digital to connect the marketplace by positioningconverse.com as the first and best source for authentic Converse products andexperiences.  Asa key player of the Global Digital Analytics team, the Data Science Lead will beleveraging state of art analytics to add significant and measurable value tothe Converse planning and assortment optimization, pricing value management,product lifecycle management, consumer product data, etc. You will do thisthrough use of advanced mathematical optimization and statistical techniques toprovide insights and decision support at various milestone moments during thegame plan process.  We are looking for someonewho is passionate about delivering scalable and innovative data products andsolutions. Person in this role will lead research and development ofstatistical learning models for data analysis; design and build predictivemodels and algorithms for experimentation to continually drive scientific thinkingand advances predictive and prescriptive maturity within the company. Responsibilities:Develop algorithms and mathematical models that significantly improveour current ability to make decisions based on qualitative and quantitativedata.Continuouslyevolve advanced analytics techniques for forecasting and align the process andmethodology across Geo's and functions.Measure and continue to improve the predictive accuracy of models.Partner with functional partners in planning, merchandising and productcreation teams to drive adoption of analytical insights into theirdecision-making process.Educate the organization on new analytical techniques and theirapplicability within Converse.Accessing and extracting data from Converse systems and supportcontinued evolution of the Converse data capabilities.Work with globalpartners across the organization to identify and articulate the value that can bederived from analytical models.Work as a team player to improve data science methods and be a positiveinfluence on team advancement.Partner with our technology teams to ensure that once proven thesealgorithms are implemented in robust platforms to scale for deployment acrossthe organization.As required this person will perform tests and other tasks required toimprove the functioning of our analytics platform.QualificationsMS +5 years experience in aquantitative field - Statistics, Economics, Advanced Analytics, AppliedMathematics, Decision Sciences, Computer Science, Engineering or other relevantquantitative fields. Ph.D. preferred.Rock solid datascientist with demonstrated experience in Machine Learning, AI or distributedsystems development. Significant expertise in machine learning algorithms,time series, forecasting, understanding natural language or unstructured data.Strong technical and analyticalskillset in one or more data science languages like R and Python.Preferably, youhave machine learning publications, project code, or work on open source toshare with us.Experience withdata processing and storage frameworks like Hadoop or S3, Snowflake, etc.Experienceworking with Business Intelligence, Analytics and Data Visualization tools,e.g. Tableau is a plus.Understanding ofprinciples and techniques of web analytics and an understanding of the KPIsthat drive a digital retail business. Experience working with Site Catalyst, Discover or Google Analytics is aplus.Experience withagile software processes, data-driven development, reliability, and responsibleexperimentation.Affinity with Sportswear and Lifestyle Footwear/Apparel is aplus.Global experiences a plus. Converse is more than a company; it's a worldwide advocate for self-expression. This belief motivates our employees, permeates our working environment and inspires our products. No two of us look or think exactly alike. We are each one-of-a-kind. Individually and as a culture, we have the freedom to create and grow professionally. Generous benefits packages only sweeten the experience. From Boston to Shanghai, from Brand Design to Finance, Converse is a brand that celebrates the unique and creative people of the world. Together, we're different.  Job ID 00383173"}