{"jobID": "2831182010", "jobLocation": "San_Jose_CA", "jobTitle": "Product Marketing Manager, TomTom Maps - San Francisco Bay", "companyRating": "3.4", "companyInfo": {"Website": "www.tomtom.com", "Headquarters": "Amsterdam, Netherlands", "Size": "1001 to 5000 employees", "Founded": " 1991", "Type": " Company - Public (TOM2) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Garmin, Nokia, Google"}, "estimatedSalary": "124000", "jobDescription": "What if we told you that you can achieve more at TomTom in less time than at any other company? From developing the next product revolution, to marketing and selling it, we always want inspired people to join us! Where do you want to be? TomTom Maps is a leading provider of global map and traffic data sourced from a community of over 550 million connected devices. We offer a platform of cloud-based products allowing customers an easy access to TomTom Maps data and software components to create location-enabled applications and services. Our customer base ranges from application developers to internet-of-things companies, logistics services and fleet management experts, enterprises, system integrators, governments, and cloud services providers.  We are looking for an experienced, exceptional and results driven Product Marketing Manager to create winning propositions for our data and software products. As a key contributor to the growth of our business, you will work on a wide variety of software and data licensing opportunities to gather the related customer and market requirements that drive our investments and new product development. In this role, you will interface with customers, sales, marketing, product management and engineering teams to manage the product value proposition creation and new product introductions. The right person for this role has a solid knowledge in product and proposition development with hands-on experience in new data and software product introductions. Position overviewDrives product roadmaps and feature and functionality development together with product management and engineering teams by collecting and consolidating customer and market requirementsEstablishes business and revenue growth on new product and market opportunities by creating ground breaking propositions, business plans and go-to-market plansCreates and maintains a product portfolio strategy with continuously updated product propositions and pricing modelsTranslates technical product features and functionalities into commercial messages to drive new product introduction, sales and marketingManages the product market introduction process and launch plans, including piloting and testingContributes to business strategy creation, implementation as well as related financial planningExperience To be successful as a Product Marketing Manager you have: University degree in engineering or business, marketing, finance or a related field2+ years of experience in product management and proposition development with hands-on experience in new data and software product introductionsProven track record of commercial success on multiple product initiativesUnderstanding of data and software business and related licensing modelsDeep understanding of customer and market insights as well as value proposition developmentDemonstrated ability to create and implement strategic initiatives and concrete action plansStrong problem solving and analytical/reasoning skillsProject and program management skillsExcellent communication, presentation and consultative selling skillsWillingness to travelWhat do we offer?The opportunity to work for a leading location technology company with a world-class brand and products in an industry that is growing with extremely fast paceBe the driving force for securing new and strategic business for TomTom Maps within the cloud domainCompetitive salary, a bonus scheme, PTO days, company holidays and additional days off to perform community service annuallyComprehensive healthcare and 401kOffice snacks and drinks, team outings, and happy hours!Who are we? TomTom (TOM2) is transforming mobility. Every day millions of people around the world depend on TomTom to make smarter decisions. Our mission is to make maps so easy to use that everyone can benefit from them.  TomTom Maps offers a platform of cloud-based products that allow customers an easy access to the freshest maps and most up-to-date traffic data as well as software components to create location-enabled applications and services. Interested? Please apply by clicking on www.tomtom.com/careers .  Pre-employment screening is part of the selection process. EOE/Minorities/Females/Vet/Disabled"}