{"jobID": "2580584692", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": "4.1", "companyInfo": {"Website": "www.samba.tv", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "154000", "jobDescription": " Samba TV, recognized by Inc. Magazine as one of the fastest growing companies in the US and one of the \"most interesting ad-tech upstarts of the year\" by Business Insider, is seeking to hire a Data Scientist to join our Data Science & Analytics team and help us build the first real-time cross-screen TV analytics platform that brings the power of online analytics to TV data.  Samba TV is uniquely positioned at the forefront of the TV revolution. The way people discover, watch, and engage with television has fundamentally changed, and we're connecting the dots to help better understand audience trends and viewership habits for marketers.  The perfect candidate will have a background in math, stats, physics, econometrics, computer science or a related quantitative field, will have experience working with large data stores, statistical modeling, and will have experience building production level software. ResponsibilitiesDesign, build, and launch new data models for TV usage and associated online activity.Apply your expertise in quantitative analysis, data mining, and the presentation of data to see beyond the numbers and understand how users interact with our products.Partner with Product and Engineering teams to solve problems, build products based on data, and identify trends and opportunities.Mine massive amounts of data to extract actionable insights that inform, influence, support, and help execute our product decisions and product launches.Design and implement reporting and metrics that track and monitor the performance of our products, the quality of our data, and overall health of the business.Data InfrastructureWork with SQL, Map Reduce, and no-SQL databases.Design, build and launch new ETL processes.Build data sets to empower operational and exploratory analysis.Automate analyses.Product Operations & LeadershipDesign and evaluate experiments monitoring key product metrics, and understand root causes of changes in metrics.Build and analyze dashboards and reports.Influence product teams through presentation of findings.Communicate the state of business, experiment results, etc. to product and management teams.Exploratory Analysis & Statistical ModelingUnderstand ecosystems, user behaviors, and long-term trends.Identify levers to help move key metrics.Evaluate and define metrics.Build models of user behaviors for analysis and powering production systems.Identify and correct for any biases or errors in our data sets.Qualifications"}