{"jobID": "2685410643", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.pocketgems.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "141000", "jobDescription": " Pocket Gems wants to build the greatest games and interactive entertainment in the world. Thats the mission our founders began in an apartment above a pizza shop back in 2009 and we continue it today.  Pocket Gems has grown to over 250 people in San Francisco. With $155 million in backing from Sequoia Capital and Tencent, were constantly breaking new ground with graphically rich mobile games, fun new genres of mobile entertainment, and innovative technologies like our mobile-first Mantis Engine.  Our products have been downloaded over 325 million times by players around the world. Most recently, weve launched Episode, a mobile storytelling network and platform, and War Dragons, a visually stunning 3D real-time strategy game.  As a Data Scientist, youll work with product managers to set the analytics agenda for our Core Studio. Youll carry out research projects and develop machine learning models aimed at optimizing retention and monetization. Along the way, you'll develop a deep understanding of mobile gaming and will work with our talented, high-output team. Your work will have a significant, lasting impact on the profitability of our games. You'll have a great deal of independence we'll expect you to use it wisely. What Youll Do:Set the agenda and drive analytics initiatives for our Core StudioDevelop machine learning models to optimize retention and monetizationDeliver results and recommendations to key stakeholdersCollaborate with other data scientists and engineers on the analytics teamWhat Youll Bring to the Analytics Team:Minimum of 5 years of professional experienceAdvanced degree in a quantitative field such as math, physics, or economicsProficiency in SQL, and either R or PythonThe ability and desire to present complex results to non-technical audiencesAmbition to own the analytics function for a large game studioExtra Gems for:Masters Degree or PhDExperience developing and deploying production codeLeadership and/or consulting experiencePocket Gems is an equal opportunity employer. We do not discriminate based on race, color, ethnicity, ancestry, national origin, religion, sex, gender, gender identity, gender expression, sexual orientation, age, disability, veteran status, genetic information, marital status or any legally protected status.Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records."}