{"jobID": "2370352885", "jobLocation": "Waltham_MA", "jobTitle": "Healthcare Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.bhei.com", "Headquarters": "North Waltham, MA", "Size": "1 to 50 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " BHE is an established research and data analytics company providing custom research services and novel platform solutions. Our mission is to provide improve healthcare through innovative data analytics. Our continued growth has created opportunities at several levels. We currently are accepting applications for a Healthcare Data Analyst.  The ideal candidate for this position will have a strong interest in healthcare, excellent quantitative skills, and hands-on experience analyzing large, complex databases. The candidate must also possess excellent written and verbal communication skills so as to work effectively in cross-functional internal teams and communicate externally with clients. An ability to work in a fast-paced environment, sometimes under pressure, remaining flexible, proactive, resourceful and efficient, with a high level of professionalism is crucial to this role at BHE. Strong decision-making ability, attention to detail, and effective organizational and multi-tasking skills are equally important. PRIMARY RESPONSIBILITIESServe as an analyst on a variety of data analytics projectsProvide internal consultant support across a range of analytic projectsProvide writing support for database studies (e.g., proposals, protocols SAP's, reports, manuscripts)KNOWLEDGE AND SKILL REQUIREMENTS (only candidates meeting these requirements will be considered)A quantitative degree (Masters preferred)1-3 years of experience in database epidemiology and/or HEOR consultingDemonstrated analytical, organizational, creative problem solving and structured communication skillsAbility to manage own time and proactively identify prioritized tasks for multiple concurrent projectsExperience communicating with clientsFocus on attention to detailEntrepreneurial spirit, drive and work ethic for internal initiatives BHE has been recognized twice on the INC 5000 list of fast-growing small businesses. BHE offers a competitive compensation and benefits package, along with challenging work in a stimulating, collegial environment where everyone is dedicated to delivering the best services and products."}