{"jobID": "2576428918", "jobLocation": "Redwood_City_CA", "jobTitle": "Data Science Intern", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Organization Description  AutoGrids mission is to organize the exponentially increasing amount of energy data produced from a networked and automated grid and make it useful and actionable for electricity generators and providers, grid operators, and electricity users.  With deployments of smart meters, distributed generation, and other building and grid sensing technologies now reaching critical mass, all participants in the electricity supply chain find themselves having to process and analyze thousands of times more data than theyve had before. Most organizations that produce or consume electricity have yet to take advantage of this information to improve their decision-making processes and lower their costs.  AutoGrid enables Utilities, Electricity Service Providers, Grid Operators, DR Aggregators, and End-Users to precisely forecast, monitor and control power consumption securely and in real-time, maximizing the value of existing assets with Software Defined Power Plants.  Job Description  AutoGrid is seeking Data Science Interns for Summer 2017. We are a rapidly growing company with significant market traction and a large pipeline of diverse opportunities. As such the role will be dynamic and varied, requiring a versatile self-starter willing to dive in to multiple initiatives. Over 10+ weeks the intern can expect to become deeply involved in implementing user features and analytics models that will run in production.  Our goal is to give the intern exposure to a range of data science techniques and current big data technologies, through the experience of applying them to the energy industry. This role will provide an excellent opportunity to implement features that run in production, at scale.  Qualifications  Experience in one or more of the following:  Python  Stream processing frameworks SQL Big Data analytics  Algorithms in machine learning and econometrics: eg. random forest, SVR, ARIMA  Experience in energy and electric utilities is a plus"}