{"jobID": "2794055603", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist - Product Operations and Advanced Analytics", "companyRating": "3.6", "companyInfo": {"Website": "www.gap.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1969", "Type": " Company - Public", "Industry": " Retail", "Revenue": " $10+ billion (USD) per year", "Competitors": " Inditex, H&M, American Eagle Outfitters"}, "estimatedSalary": "189000", "jobDescription": " Our past is full of iconic moments but our future is going to spark many more. We're looking for the people who'll help make our next decade just as revolutionary as our first five. If you're one of the super-talented who thrive on change, aren't afraid to take risks and love to make a difference, you're the right fit. Come grow with us.  The Product Operations AdvancedAnalytics Team drivesbusiness benefits for Gap Inc. and its brands by applying industrial engineering/managementscience, statistical analysis and analytics to improve inventory and revenuemanagement.  The team'sprimary focus is creating analytical methodology for all tools and processes inproduct operations in Gap Inc. Areas ofexpertise include: demand planning, inventory replenishment, inventory andsupply chain optimization, pricing, flexible inventory and supply chaininitiatives. ESSENTIALDUTIES & RESPONSIBILITIES:Provide quantitativeresearch, modeling, analysis and support for identifying businessopportunities/issues and form hypothesesSynthesizefindings, prepare presentations and assist in presenting findings to all levelsof managementCreate revenue,inventory, price optimization modelsProvide assistanceneeded to implement the recommendationsIdentify and trackthe metrics to measure the success of a specific business opportunityManage projects orpart of larger initiatives, including modeling, analysis, etcREQUIREDQUALIFICATIONS:1)Knowledge, skills & abilities:Proven ability to develop and apply analytic solutions to solve business problemsAbility to work both at a detail level as well as to summarize findings and extrapolate knowledge to make strong recommendations for changeExperience developing short and long term visions for solutions that have significant business impactDemonstrated examples of working with business partners to deliver a solution that met objectivesKnowledge of inventory management, merchandising, pricing, supply chain management and optimization principles and conceptsExperience developing and working with inventory optimization, pricing and forecasting approaches for retail software or the retail industryAbility to collaborate with cross-functional teams and work independently with minimal supervision2) Minimum educational level:PhD in Operations Research, Industrial Engineering or Management Sciencerequired3) Minimumexperience:5+ yrs. of professional experienceHands-on experience with data analysis, statistical, optimization and simulation packages (SQL, MATLAB, SAS etc) is mustInventory management, pricing experience is highly desirableExperience working for retailers, consulting to retailers is highly desirableAbility to communicate effectively with cross-functional teamsExperienced at working with business process owners to understand the process impactKEY BENEFITS:Merchandise discount for our brands: 50% off regular-priced merchandise at Gap, Banana Republic and Old Navy, 30% off at Outlet and 25% off at Athleta.One of the most competitive Paid Time Off plans in the industry.*Employees can take up to five \"on the clock\" hours each month to volunteer at a charity of their choice.*Extensive 401(k) plan with company matching for contributions up to four percent of an employee's base pay.*Employee stock purchase plan.*Employees receive medical, dental, vision and life insurance.*Employees can apply for tuition reimbursement.*Family care programs.Commuter benefits.Pet Discount Program.For eligible employees Gap Inc. is an equal-opportunity employer and is committed to providing a workplace free from harassment and discrimination. We are committed to recruiting, hiring, training and promoting qualified people of all backgrounds, and make all employment decisions without regard to any protected status. In 2016, Gap Inc. was named one of the Best Places to Work by the Human Rights Campaign for the thirteenth consecutive year and was the sole winner of the Catalyst award for equality in the workplace in 2016.  ApplySDL2017"}