{"jobID": "2313901583", "jobLocation": "New_York_NY", "jobTitle": "Data Analyst", "companyRating": "4.9", "companyInfo": {"Website": "www.seatgeek.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "71000", "jobDescription": "Data-driven decision making has always been important at SeatGeek. Our Analytics team helps drive strategic decision-making by providing meaningful business insights from data. Were looking for a Data Analyst to join our growing team who can ensure the most relevant information is surfaced to each team to allow for well informed decisions. If youre a well-rounded, business-savvy, technically capable analyst with SQL chops and a knack for figuring out complex systems fast, wed love to talk with you.Who you are You love digging through mounds of data, but your understanding of what is relevant and your ability to communicate results in a concise way separates you from the pack. You look forward to open discussions around the gray area of business decisions, but aim to narrow that area with data driven insights as much as possible. You take pride in proactively providing data, analysis and findings in a collaborative manner. You also have many of the following: 2 to 4 years of relevant experience analyzing large and complex data sets, working with relational databases and writing SQLa degree in Mathematics, Economics, Statistics or another quantitative fieldadvanced working knowledge of SQL, perhaps with a side of Python or Ra keen sense of design, both in data architecture and dashboard presentation.knowledge of the transactional marketplace business model or consumer facing e-commerce products (bonus for mobile-first!)What youll dohelp drive strategic decision-making through detailed analysis, insights and reporting on key performance indicators (KPIs) and financial resultsinvestigate positive and negative trends in a wide array of business processescollaborate with departments across the company to understand needs while effectively prioritizing incoming requestswork with engineers and other source data experts to clean up messy data setscontinually improve visibility into benchmarks across the companycreate and maintain world class dashboards and data models in our BI platform, LookerPerksCompetitive base salary & equity stake in a well-funded growth stage company$120/mo to spend on live event ticketsA laid-back, awesome workplace with an endless supply of snacks/coffee/beer, frequent team lunches, and team eventsA superb benefits package that supports health/dental/visionCitibike, Spotify memberships and a discounted gym perk"}