{"jobID": "2796702763", "jobLocation": "New_York_NY", "jobTitle": "Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.northwesternmutual.com", "Headquarters": "Milwaukee, WI", "Size": "5001 to 10000 employees", "Founded": " 1857", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " New York Life, Prudential"}, "estimatedSalary": "106000", "jobDescription": "At Northwestern Mutual, we believe relationships are built on trust. That our lives and our work matter. These beliefs launched our company nearly 160 years ago. Today, they're just a few of the reasons why people choose to build careers at Northwestern Mutual. We're strong and growing. In a company with such a long and storied history, this may be the most exciting and important time to be a part of Northwestern Mutual. We're strong, innovative and growing. We invest in our people. We provide opportunities for employees to grow themselves, their career and in turn, our business. We care. We make a positive difference in our communities. Nationally, thousands have benefitted from our support of research and programs to fight childhood cancer. Each year, our Foundation, employees and financial representatives donate time, talent and financial support to causes they're passionate about.    We are an equal opportunity/affirmative action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender identity or expression, sexual orientation, national origin, disability, age or status as a protected veteran, or any other characteristic protected by law.   Responsibilities:Through a clear understanding of the business, provide predictive modeling, data mining, pattern analysis, data visualization and machine learning solutions to address customer needsUtilize analytical skills to drive business insight and make data-driven solutions to tackle business problems. Help business manage costs, lower risk, improve quality, understand its products and create new opportunities. Synthesize insights from analytics and modeling projects and present the results to technical and non-technical audiencesCollaborate with cross-functional teams and provide analytics expertise   Qualifications:2+ years of professional experience with a proven track record of leveraging data science to drive significant business impact or to develop data/algorithm based productsProfessional experience and knowledge in Disability insurance industry is highly desired: in-depth understanding of the operations of Disability products and past experience working in a technical role supporting Disability OperationsProgramming experience with a scripting language such as Python, Perl, Java, or RubyProficiency with a statistical analysis tool such as R or SASMachine learning experienceStatistical knowledge and intuition - ideally utilized in A/B testingExperience with distributed databases and query languages like Hive, Spark, Scala, or Pig is a plusBachelor's degree in Statistics, Mathematics, Operations Research, Computer Science, Econometrics or related fieldStrong time and project management skills, with the ability to manage detailed work and communicate project status effectively to all levelsAlways seeks ways to use their knowledge to make improvements on the job   Req ID: 23108 Position Type: Regular Full Time Education Experience: Master's Desired Employment Experience: 3-5 years Licenses/Certifications:FLSA Status: Exempt Posting Date: 05/31/2018"}