{"jobID": "2717834779", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist", "companyRating": "4.6", "companyInfo": {"Website": "www.pagerduty.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "159000", "jobDescription": "Why We Need You Do you relish the opportunity to impact the direction of a mission-critical application that is in use by hundreds of thousands of engineers and technology leaders around the globe? Are you excited about being on the ground floor of making machine intelligence an integral part of PagerDuty products? If so, read on to find out more about what makes PagerDuty a great place to be a Data Scientist!  We’re looking to give our customers insights into their event, incident and response data, and we’re building out an amazing team to conceptualize, design, build and deliver our vision of an autonomous, intelligent digital operations platform. Our Data Experience team is a small, talented, highly focused team where everyone is part of the product development process from ideation to design, prototyping, planning, and execution. How You Contribute to Our Vision: Key ResponsibilitiesAs the Senior Data Scientist on the team, you will design and build models and algorithms that will power the next generation of the PagerDuty product. You will apply your quantitative analysis, data mining and machine learning expertise to make sense of the vast quantities of our operational data and will help build out an infrastructure that allows for quick prototyping and rapid development.You will work alongside our Data Scientists and Software Engineers to unlock the power of data and bring modern, sophisticated machine intelligence to our product. You will influence product development, strategy and roadmap prioritization, and will serve as an ambassador of data science to the rest of the organization. With 10,000+ global customers and growing, you’ll be solving really interesting technical challenges while helping to push the product in new directions.About You: Skills and AttributesYou have a track record of stepping up and leading successful data science initiatives.You are a self-starter, able to work closely with other data scientists, engineers, product managers and other teams.You are comfortable with loosely defined requirements where you exercise your analytical skills to clarify questions, share your approach and collaborate with the rest of the team to build/test elegant solutions in an iterative manner.You proactively identify obstacles and don't let them stop you from delivering the best value to customers.You have a desire to stay ahead of the latest industry trends and technologies, and a commitment to continuous learning.You have experience coaching and mentoring others.You have an understanding of the importance of empathy: you should have an open mind to others - no matter how senior or junior they are.You have a calm, assertive approach to diagnosing and fixing urgent problems.You are a strong communicator with the ability to explain complex topics to a non-technical audience.Minimum RequirementsExperience working with data scientists and/or machine learning engineers, shipping product features with data science / ML capabilities.Experience working in an agile environment with iterative development and fast feedback.Good understanding of CS fundamentals, e.g. algorithms and data structures.Fluency with one or more programing language: Python, Ruby, Java, Scala, etc.Experience working with relational/SQL and NoSQL databases.Experience working with big data platforms such as Hadoop, Spark, Hive, etc.Experience in statistical programming tools such as R, Matlab, SAS, etc.Experience with data science toolkits: pandas, Jupyter, scikit, TensorFlow, etc.Familiarity with statistics concepts and analysis, e.g. hypothesis testing, regression, etc.Familiarity with machine learning techniques, e.g. classification, clustering, regularization, optimization, dimension reduction, etc.Benefits to Get Excited About In addition to working with deeply passionate and intelligent people in a dynamic and open environment, we also offer: Competitive salaries and company equityComprehensive benefits package including: medical, dental, and vision plans for you, your spouse and family; 401K, pre-tax commuter benefits, corporate discounts, cell phone allowance and more!Generous paid vacation (3 weeks vacation your first year, 4 weeks afterwards) in addition to 12 paid holidays and ample sick leave.Monthly company wide hack daysCatered lunch daily, breakfast on Wednesdays, and plenty of snacks and drinksConvenient office location in SoMa tech hub – accessible by BART, Muni and CalTrainHow We Work PagerDuty Engineering teams are set up to be mini innovation pods. We practice what we preach, and believe that every engineer can build great products to delight our thousands of customers.  Teams are set up to be able to achieve success autonomously while remaining accountable for results. Every team has full vertical ownership of their own services and are able to release as frequently as they want to. We practice the mantra of ‘Code It. Ship It. Own It.’ and believe that teams are most successful when they are able to own every decision in order to run their software. Every team gets to be a part of our growth by building highly resilient and durable software that scales from our startup customers to Fortune 100 companies.  We deploy over 1000 times a month and every engineer is able to ship high quality software to production on their own. Teams own their own tests and yes, we use PagerDuty to manage incidents. Teams own their own way of working and can use the agile practices of their choice to work collaboratively via incremental delivery.  We support engineers to explore ideas via monthly Hack Days, actively attackour own infrastructure weekly to learn and get better, host an annual internal technical conference called PagerCon, ask our engineers to represent PagerDuty at industry events, and contribute to the open source community.  Each team has a dedicated Engineering Manager, Product Owner, and agile coach to help support our people and teams to be successful. We believe that Management is a separate skill set and have different career paths for our engineers and managers including a full ‘stay technical’ career track. About Us PagerDuty is the leading digital operations management platform for businesses. Our SaaS-based solution empowers over 8,000 small, mid-size and enterprise global customers such as Comcast, eHarmony, Slack and Lululemon with the insight to intelligently respond to critical disruptions for exceptional customer experience. PagerDuty was founded to deliver a new and innovative approach to increase business response and efficiency. We follow agile methodology to build software that enables full-stack event intelligence, response orchestration, continuous learning and delivery, and facilitate the journey towards improved application, system, and service performance and availability. When brand reputation depends on customer satisfaction, PagerDuty arms businesses with the insight to proactively manage incidents and events that may impact customers across your IT environment. We were recently included in the 2016 Deloitte Technology Fast 500, Inc. 500 and Forbes Cloud 100 lists.  Our dedication to our customers, collaborative spirit, ‘risk, fail, learn’ attitude, and a Get Stuff Done ethos drive innovation through our product and our culture. We are incredibly proud of our people programs that enable our employees to deliver their best every day. From our performance achievement philosophy to our great benefits, our robust culture of recognition to our commitment to inclusion and diversity, solving complex technical problems to delivering an amazing customer experience, PagerDuty is where you can do the some of the best work of your career.  Learn more at www.pagerduty.com. Follow our blog and connect with us on Twitter, LinkedIn, YouTube and Facebook. PagerDuty is committed to creating a diverse environment and is an equal opportunity employer. PagerDuty does not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, parental status, veteran status, or disability status.  PagerDuty uses the E-Verify employment verification program.  Our stewardship of the data of many thousands of customers means that a background check is required to join PagerDuty. We will, nonetheless, consider qualified applicants with arrest and conviction records in accord with applicable law, including the San Francisco Fair Chance Ordinance."}