{"jobID": "2830413898", "jobLocation": "New_York_NY", "jobTitle": "Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.alphasights.com", "Headquarters": "London, United Kingdom", "Size": "501 to 1000 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "84000", "jobDescription": "Data Scientist At AlphaSights, we search through more than 500 million professionals working in the world today to find the small handful of experts qualified to answer our clients needs. They use these insights to drive amazing progress within their organisations. Our mission is to provide access to dispersed, hidden, and underutilized knowledge.  Weve made terrific progress working in this new space, but there is still an incredible amount of work to do. Weve only just scratched the surface on how we can apply technology to this problem.  AlphaSights' Data Scientists help to build new products, improve search and discovery, and perform predictive analysis to improve new client conversions. As a data scientist you will find patterns in a unique view into the world economy and develop an understanding of why clients seek experts. Ultimately, your work will power the next generation of features to help our clients find who their looking for.  We're looking for people who are interested in building software systems to an incredibly high standard, comfortable working across multiple languages, and learn quickly when new technologies are introduced. We care more about your engineering and data science skills versus your deep knowledge of a particular language or framework. You will:Improve the speed at which we can help clients find the advisors they are looking forDevelop data science products to improve workflow effeciencyWork in small, nimble teamsUnderstand our business context deeply and leverage your engineering and data science knowledge to propose creative solutions to problemsWrite production level code to expose the models that you buildContribute to our open source projectsYou might be a fit if you:Have 3+ years of industry experienceHave experience with Machine Learning, Statistical Modeling, Recommendation Systems, Natural Language ProcessingEnjoy writing code in a variety of languagesHave a proven track record of building product offerings end to endConstantly learn from and mentor othersSee yourself as an entrepreneur as well as a data scientistAre interested in working in a team applying data science to solve challenging business problemsDeep learning a plusYou might work on:Recommendation systemsPredictive models using real time data of the global economyTrend analysisWho you would work with:You would join a dynamic, multinational, and diverse team who enjoy solving interesting problems in a collaborative environmentWe have self-taught engineers and data scientists as well as graduates from top Computer Science and Engineering schoolsYour co-workers will include motivated recent graduates as well as experienced industry leaders from companies such as Google and Amazon Don't worry if your experience or background doesn't match all of these areas, we believe a broad spectrum of experience provides great perspective on solving problems in new and innovative ways and wed love to hear from you. Find out more"}