{"jobID": "2796275867", "jobLocation": "Bronx_NY", "jobTitle": "Registered Nurse - Hematology/Oncology", "companyRating": null, "companyInfo": {"Website": "www.vacareers.va.gov", "Headquarters": "Washington, DC", "Size": "10000+ employees", "Founded": " 1930", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "The James J. Peters VA Medical CenterJoin the VA Team - Caring for our Veterans! The James J. Peters VA Medical Center, Bronx VAMC affiliated with the Mt. Sinai School of Medicine (NYC), numerous Nursing Academic Affiliations and the Hospital for Special Surgery, is located in the NW Bronx on a self contained campus easily accessible by car (free parking for eligible employees) and public transportation.  We are currently recruiting for 1 Full-time REGISTERED NURSE for HEMATOLOGY/ONCOLOGY CLINIC. The Hematology/Oncology nurse duties include, but are not limited to the evaluation and care of patients who present to clinic for consultation, evaluation, and/or treatment of any medical conditions. Other functions of the RN include but are not limited to the following: patient medication reviews, assessing potential pharmacological drug interactions and toxicity monitoring, medication adherence, and drug administration training. Administering and monitoring standard of care chemotherapy/biologic therapy/immunotherapy and supportive treatments for all patients; teaching of patient/family how to safely give self-injections; chemotherapy education for patient and family; ordering and reviewing of blood counts and chemistry lab results for minimum requirements prior to treatment with oncologic agents; maintenance and assistance of care for primary care patients in hematology/oncology panel for reminders including vaccines and training other nurses requiring cancer treatment competency.  Tour of Duty: Monday - Friday (8:00am to 4:30pm). BASIC REQUIREMENTS Citizenship. Citizen of the United States. Non-citizens may be appointed when it is not possible to recruit qualified citizens in accordance with VA Policy.Graduation from a School of Nursing. Graduate of a school of professional nursing approved by the appropriate State, agency, and accredited by one of the following accrediting bodies at the time the program was completed by the applicant. The National League of Nursing Accrediting Commission (NLNAC), an accrediting arm of the National League for Nursing. The Commission on Collegiate Nursing Education (CCNE), an accrediting arm of the American Association of Colleges of Nursing (AACN).Registration. Condition of Employment: A Nurse will have a current, full, active and unrestricted registration as a graduate nurse in s State, Territory, or Commonwealth (i.e. Puerto Rico) of the U.S. or in the District of Columbia. The RN must have maintained a current, full, active unrestricted registration to continue employment with the VA.Physical Standards: See VA Directive and Handbook 5019English Language Proficiency: RNs appointed to direct patient care positions must be proficient in spoken and written English as required by 28 U.S.C. 7402(d).BCLS & ACLS RequiredPREFERRED QUALIFICATIONSBachelor’s Degree or Master’s Degree in Nursing preferredCertifications in Oncology: OCN and/or ONS/ONCC Chemotherapy Biotherapy Certificate preferred.Minimum of 2 years of experience with providing nursing care in an outpatient clinic settingMinimum of 2 years experience evaluating and managing patients with Hematology/Oncology issues We offer comparable salary. Note: Filing the Confidential Financial Disclosure (CFD) is not required for this position. Selected Applicant may be eligible to apply for an award up to the maximum limitation under the provisions of the Education Debt Reduction Program (EDRP). Please note that EDRP is contingent upon the availability of funding and is not guaranteed. Grade and salary will be determined by the Professional Nursing Standards Board.Reasonable Accommodation Statement: Federal agencies must provide reasonable accommodation to applicants with disabilities where appropriate. Applicants requiring reasonable accommodation for any part of the application and hiring process should contact the hiring agency directly. Determinations on requests for reasonable accommodation will be made on a case-by-case basis.  To be considered please send a detailed CV/resume, college transcripts, along with a copy of your RN license and the Application for Nurses and Nurse Anesthetists (VA-Form 10-2850a) available at: https://www.va.gov/vaforms/medical/pdf/vha-10-2850a-091998-fill.pdf to the Human Resources Management Program at:  Department of Veterans Affairs  James J. Peters VA Medical Center  Attn: Human Resources Program (05)  130 West Kingsbridge Road  Bronx, New York 10468  Or FAX to (718) 741-4598  Or email to elizabeth.houser@va.gov  The VA is an EOE M/F/V/H"}