{"jobID": "2827903464", "jobLocation": "New_York_NY", "jobTitle": "Intern, Strategic Analytics- Marketing - Part-Time", "companyRating": null, "companyInfo": {"Website": "www.automatic.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Metromile"}, "estimatedSalary": null, "jobDescription": " Temporary  Position Type: Internship  Session: Fall 2018 (September 17 - December 7, 2018)  Location: New York, NY Position Summary: SiriusXM interns don't just make coffee. They're on-air, on projects and making valuable contributions to SiriusXM. Join our internship program and learn about the world of radio and get hands-on experience in your field of study.  SiriusXM is looking for an intern to join our strategic analytics team to assist in tracking marketing campaign performance. Duties and Responsibilities:Review weekly model trend reports.Complete QC requirements for model use in campaigns.Support design of tests for marketing.Produce data visualization to monitor trends.Complete model decks and documentation.Communicate with the business intelligence solutions team.Perform other duties as assigned.Supervisory Responsibilities:None.Minimum Qualifications:Currently pursuing a Bachelor's degree or MBA in economics, statistics, mathematics, computer science, engineering or a related field.Minimum 3.2 GPA.Must be at least 18 years of age.Must be enrolled as a student in a U.S. based college, university or trade school at the time of applying and interning. Applicants must be have completed 2+ years of college or be enrolled in a graduate program.Requirements and General Skills:Understanding of statistical modeling techniques such as regression, decision trees, neural networks, support vector machines, clustering techniques.Excellent time management skills, with the ability to prioritize and multi-task, and work under shifting deadlines in a fast-paced environment.Strong attention to detail.Willingness to take initiative and to follow through on projects.Project management experience preferred.Experience working within an advertising agency or creative environment preferred.Familiar with marketing communications strategy and processes, including online media, application development and web site development.Strong interpersonal capabilities and excellent verbal and written communication skills.Well-organized, detail-oriented, energetic, independent and responsive to feedback.Spelling, grammar, proofreading and editing skills.Must have legal right to work in the U.S.Technical Skills:Thorough knowledge of MS-Office Suite (Word, Excel, PowerPoint, Access).Ability to develop statistical targeting models using SAS, R, Python, Weka, SPSS, MATLAB, etc.Understanding or experience working within an enterprise data warehouse environment, (including SQL, procedural SQL, and ETL). Please note that all SiriusXM internships are paid.  As an EEO/Affirmative Action Employer all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status.  The requirements and duties described above may be modified or waived by the Company in its sole discretion without notice."}