{"jobID": "2586421194", "jobLocation": "San_Francisco_CA", "jobTitle": "Mapping Engineer (Data Scientist)", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "What We're Building lvl5 builds HD maps for self-driving cars using computer vision. Our iPhone app, Payver, (http://www.getpayver.com) has thousands of drivers, sending us terabytes of driving data each day. We receive video and other telemetry measurements from our fleet, and run advanced computer vision algorithms on the data to map the roads with high precision -- down to just a few centimeters. Unlike traditional maps, HD maps contain all the nitty-gritty details of the road, such as where the car should look for traffic lights, and how to turn through a complex intersection. We work directly with automakers, and also with Tier 1 manufacturers to provide intelligent driver assist products as well as full localization capabilities for a \"Level 5\" self-driving vehicle.Responsibilities: Reduce terabytes of artifacts from our computer vision pipeline to find the accurate 3D pose of objects of interest. Automate the detection of changes to our HD map Manage tiling, building, and intelligent deployment of our maps to our customers Work through noisy sensors such as GPS and IMU to retroactively localize vehicles in our fleet.Requirements: 3+ years experience with Python, NumPy, Pandas, and SkLearn Bachelor degree in Computer Science/Engineering/Data Science, or equivalent real-world experience Passionate about self-driving technology and its potential impact on the world Attention to detail and a passion for quality Knows how to take a scientific approach to solving (near impossible) problems Ability to measure performance comparing ground truth Strong math & stats backgroundBonus Points: Masters/PhD in an discipline such as Computer Science, Computer Engineering, Physics, or Systems Engineering You have designed and trained models for various aspects of autonomous driving such as perception Self-starter, ability to operate without a manager Robotics / Autonomy background Running models at scalePerks: Health, Dental, and Vision Coverage $5k budget to spend on your developer workstation Free snacks, coffee, and drinks Flexible Work Hours Fun offsites"}