{"jobID": "2830504806", "jobLocation": "Amsterdam_NY", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.bookingholdings.com", "Headquarters": "Norwalk, CT", "Size": "10000+ employees", "Founded": " 1997", "Type": " Company - Public (BKNG) ", "Industry": " Travel & Tourism", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Booking.com BV (the company behind Booking.com, the market leading online hotel reservation service in the world) is looking for people to support the business in the fast-growing hotel markets. Booking.com is offering a unique opportunity for an Analyst to join our Content Agency Department, based in Amsterdam.  In this role, you will be building a robust analytics framework that facilitates data-driven decision making by developing performance indicators, optimising data capture processes and building scalable analytics tools/dashboards that offer actionable insight into the performance of the operational teams to all levels of the organisation.  B.Responsible Lead analytically-driven problem-solving sessions to develop actionable business insights and recommendations to the managementDrive operations analytics to help guide the growth of the services by designing key metrics that quantify the success of product initiatives and business healthBuild and maintain scaled self-service analytics tools for hundreds of users worldwide in TableauDevelop databases through data engineering and transformation in Hadoop and MySQLDesign and develop a robust centralized data warehouse for the content agencyProduct-own data collection that enable efficient data capture and improve data qualityDesign and implement decision making tools that enable data-driven decision makingMonitor data and information management processes to ensure data quality and consistencySupport operational teams in capacity planning, forecasting and resource planningIdentify new data sources, perform data discovery to understand data values and relationshipsActively use key data findings to give business advice to operational managersProvide ad hoc analysis for operational managers, including insights into key financial and non-financial data B.Skilled 3+ years of experience in a similar roleProven experience in conducting analyses and build new models with an operational/commercial focusExperience with Tableau or similar BI tool (Data Studio, Power BI, )Experience working with big data (experience in SQL, Hadoop, or BigQuery)Working knowledge in programming/scripting (Python, R, SQL, Google Apps Script, Bash, Matlab) is a plusExcellent communication skills (both verbal and written); the ability to convey complex analysis results clearly and with conviction to all levels of stakeholdersTeam player with strong interpersonal, relationship-building, and stakeholder management skillsExcellent organizational skills, attention to detail and analytical reasoningFluent level of written and spoke English is required The hiring company Booking.com BV is the company behind Booking.com, the market leading online accommodation reservation service in the world. Booking.com BV is looking for a Data Analyst in Amsterdam, the Netherlands. All references to \"Booking.com\" refer to Booking.com BV."}