{"jobID": "2796124669", "jobLocation": "San_Jose_CA", "jobTitle": "Investment Associate - Entry Level", "companyRating": null, "companyInfo": {"Website": "www.fishercareers.com", "Headquarters": "Camas, WA", "Size": "1001 to 5000 employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OverviewWhat you’ll do: As an Investment Associate, you’ll begin in one of several different entry-point roles at one of the world’s preeminent private money managers. Depending on our business needs along with which area fits you best, your initial duties may include such diverse tasks as: working directly with top brokerage houses (who act as our custodians)helping plan and coordinate complex client-focused events nationwidesupporting our outside sales representatives in an administrative capacityproducing detailed reporting and analysis for either our Private Client or Institutional groups Regardless of your starting area, you’ll learn about our business and the world of investments, all while working in an open environment alongside other talented individuals. More importantly, you’ll be on the path to helping us achieve our primary goal: exceeding our clients’ expectations every day. If you do well in this mission, the sky is the limit. What you’ll get: You’ll learn more about “real-world” finance in your first few months than any class ever taught you-- thanks in part to our unique mentor program. You’ll be encouraged to ask questions, improve processes, and propose novel solutions to problems. If you hate the idea of corporate bureaucracy and politics, you’ll love that we evaluate employee performance in a manner that is straightforward and metrics-based. Do your best, rise to the top of the ranks in your area, and you’ll be on your way to earning more advanced opportunities. That’s how our top executives got there, and we think you can do it too. In fact, we hope you’ll advance to your next role within 1 to 3 years (a typical outcome for successful employees). Add more value, get more value back. What we’d like: An unrelenting work ethic, a track record of success, stellar communication abilities, and a drive to succeed. And if you are a high-achiever with a background in something other than finance, don’t worry-- you won’t be alone at Fisher Investments, where some of our top employees studied subjects that span the humanities and the sciences. The bottom line: If this job posting seems different from those of our competitors, it’s because we really are different: it’s not just a slogan or a mantra. We are out to change an industry by building a better mousetrap. No tricks, no games, just top-tier money management and excellent service to our clients. To do that, we need to hire the best of the best. So, what are you waiting for?  We believe in providing the training needed to be successful in our entry-level roles. Accordingly, none of our entry-level jobs require the highly specialized knowledge needed for us to sponsor an H-1B visa and we therefore do not provide sponsorship for entry-level positions. Fisher Investments is an equal opportunity employer.#LI-FI1 #PDN"}