{"jobID": "2826559462", "jobLocation": "San_Jose_CA", "jobTitle": "Best Buy Mobile Sales Consultant", "companyRating": null, "companyInfo": {"Website": "www.bestbuy.com", "Headquarters": "Richfield, MN", "Size": "10000+ employees", "Founded": " 1966", "Type": " Company - Public (BBY) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "What does a Best Buy Mobile Sales Consultant do? Best Buy Mobile Sales Consultants excel at selling products and services and work closely with other sales team members. They accumulate the appropriate knowledge and expertise through continuous learning and self-development. Armed with the right tools and knowledge, they create ease and add value to the Best Buy Mobile experience; ensuring customers end-to-end needs are met. As a trusted advisor and partner, Best Buy Mobile Sales Consultants develop strong relationships with customers and bring them a little closer to family and friends by helping them close the gaps with technology.  The Best Buy Mobile Sales Consultant engages customers by utilizing selling skills to build the right solutions for our customers. They will sell a broad range of mobile products and services using a proven structured approach while at the same time developing in-depth knowledge of the latest mobile technology.  Job responsibilities include: Provide personalized service and exceptional expertise for customers.Takes complex technology and service plans and makes it simple for customers and other employees to understand.Fields questions about product features and explains benefits to consumers in a way that is engaging and promotes excitement in acquiring and using these products and services.They are patient, genuine and helpful while assisting customers in finding the right products and services.Demonstrates for each customer how finding the right products and services can enrich their livesWhat are the Professional Requirements of a Best Buy Mobile Sales Consultant? Basic Qualifications Ability to work successfully as part of a teamAbility to work a flexible schedule inclusive of holidays, nights and weekends Preferred Qualifications 3 months experience working in customer service, sales or related fields"}