{"jobID": "2650309969", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist - Mobile Games", "companyRating": "3.7", "companyInfo": {"Website": "www.productmadness.com", "Headquarters": "London, United Kingdom", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "100000", "jobDescription": "About Us Product Madness burst into life in 2007 as the brainchild of two Stanford Business MBA graduates who possessed an innate love of gaming. Initially, the entrepreneurs developed casual games for Facebook and mobile, before having a ‘light-bulb moment’ in 2009 and refocusing their efforts with laser-guided precision on the exploding social casino genre. They have been bringing world-class social slots to real slots fans ever since.  We are looking for a Data Scientist that will help us discover the information hidden in vast amounts of data, and help us make smarter decisions to deliver even better products. Your primary focus will be in applying data mining techniques, doing statistical analysis, and building high quality prediction systems integrated with our products. You should be interested in gaming domain and have passion for data. Who Are You (Requirements)?Degree or equivalent in a relevant field required (Math, Statistics, Engineering, Physics, etc.)Strong SQLExperience coding in Python (PyData stack) or other programming languageExperience with any BI tool is a plusHighly analytical and structured thinkingExtensive experience as a Data Scientist ; PhD is a plus!Demonstrable interest in Data Science, Big Data, Machine Learning and Predictive Analytics1-2 year experience in an analytical fieldWhat Will You Be Doing (Responsibilities)?Provide data insights for product management and marketing decision makingBuild new data productsParticipate in “deep-dive” research projects, such as detailed product analysis, customer segmentation, lifetime value analysis, etc.Identify potential business opportunities within your area and scope/design approaches to capture those opportunities.Translate business needs to technical requirements and AB-tests, and work with teams to ensure correct implementation to allow easy, precise analysis of the impact.Develop an analysis strategy and perform analysis of complex scenarios and AB-tests, both systematically and on a one-off basis.Carefully check, debug, and problem solve issues to ensure you deliver accurate and clear analysis and reports, quickly, even when confronted by subtle data complications.Provide an analytics perspective to discussions and prioritization within your team, so that the overall team selects the right ideas to work on.Be the pro-active owner of the entire data chain for your game(s).How Will You Be Doing it (Our Stack)?Analytics: Python (pandas, scikit-learn, pymc3, statsmodels, bokeh, mpl), SQL, Jupyter notebooksBig Data: AWS Redshift, Apache Spark, S3ETL: python, SQL, Spark, Scala, MongoDBData viz: D3.js, re:dash, Tableau, bokehWho are we looking for? As an employee of Product Madness, we’d expect you to be able to work in a fun, flexible, team-oriented, collaborative environment. You need to have exceptional communication skills, and be a self-starter. Why Work Here?We are located in San Francisco downtown, close to Union Square (walking distance to Bart station) in an open layout officeWe have an open, creative culture with great learning and growth opportunitiesWe like to work hard, but also have funYour work will have a direct impact. We have built most of our systems based on the inputs of our team membersA variety of delicious meal options at least twice a month, for freeUnlimited snacks and drinks provided at the office (we like to eat!)Competitive Health, Vision and Dental Insurance401k Retirement Plan (Includes employer match contribution) Product Madness’ dedication to promoting diversity, multiculturalism, and inclusion is  clearly reflected in all our content and across all our platforms. Diversity is more than a  commitment at Product Madness—it is the foundation of what we do. We are fully  focused on equality and believe deeply in diversity of race, gender, sexual orientation,  religion, ethnicity, national origin and all the other fascinating characteristics that make  us different."}