{"jobID": "2797806300", "jobLocation": "New_York_NY", "jobTitle": "Environmental Graphic Designer", "companyRating": null, "companyInfo": {"Website": "www.russelldesign.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "RUSSELL DESIGN, a well-established design firm in New York City, is looking for a recent graduate or someone with a year of experience with an interest in experiential design—wayfinding, signage, exhibits, interpretive graphics. Our clients, both here and overseas, include architects, landscape architects, engineers, real estate developers, park administrators, hospital directors and university faculty, for whom we provide smart, innovative and effective design. We are seeking an outstanding student designer, with some practical work experience if possible. Working with our director of EGD and senior designer, our ideal candidate will be energetic, self- motivated, able to be involved in a project from start to finish and be an all-round team player. Please do not apply if your interest is in being a designer for print or online; this is strictly for someone with an interest in environmental graphic designSpecific attributes/skills:Passion for great design with the ability to be stylistically flexibleFeeling for the built environmentA sophisticated typographic senseStrong verbal, written and analytical skills Solid working knowledge of Illustrator, Photoshop and InDesignExposure to working in architectural scale And an interest in learning:about materials used in wayfinding and signagehow to produce construction documents to scaleCAD tools, SketchUp and AutoCADabout Americans with Disabilities Act (ADA) and building code requirements  Eventual responsibilities, not necessarily right away:Research projects and assist in strategy/concept developmentClient and fabricator contactDesign exploration and preparation of design presentationsExecute all phases of the design and EGD fabrication process from concept to installationOn site installation supervisionSend resume and online portfolio to a.russell@russelldesign.comBe sure to visit our website : www.russelldesign.com"}