{"jobID": "2747446636", "jobLocation": "Seattle_WA", "jobTitle": "Intern - Lung Cancer Research", "companyRating": null, "companyInfo": {"Website": "www.swedish.org", "Headquarters": "Seattle, WA", "Size": "10000+ employees", "Founded": " 1905", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " University of Washington"}, "estimatedSalary": null, "jobDescription": "Swedish Medical Center is looking for an Intern (1.0 FTE, Days) in Lung Cancer Researchat the Swedish Research Center in Seattle, WA. The Intern provides support as needed for basic research, clinical research or research administration activities in support federal, commercial or privately funded research activities. In this position you will:Support data processing and coordination which may include some or all of the following: abstraction of data from medical, administrative or research-related records, coding, data key entry and completion of required forms such as Case Report Forms.Support collection and coordination of information required for staff or investigators which may include some or all of the following: retrieval of information from libraries, medical chart or records pulls, literature searches.Support specimen (tissue of serum) processing which may include some or all of the following: receiving, transferring, processing, storing, tracking/monitoring, or shipping.Support document preparation that may include some or all of the following: word processing, photocopying, distributing, tracking information, editing and proofreading.Support supply ordering and inventory of supplies, reception or phone duties, general office support including faxing, filing, shredding, mailing, transfer of documents, shipping, etc.Required qualifications for this position include:High school education or GED. Additional coursework in science or healthcare or enrolled in scientific/healthcare course of study.Working knowledge of computers, standard office software packages (Word, WordPerfect, Lotus, Excel, Access, Power Point, etc.), standard office equipment (photocopiers, facsimiles, telephones, pagers, etc.)Familiar with medical, scientific or healthcare environments either through coursework or experienceAbout the First Hill Campus The 697-bed tertiary-care center on the Swedish/First Hill campus is the flagship of the Swedish health-care system. Swedish/First Hill has one of the most active and advanced birthing programs in Washington state and houses a Level III neonatal intensive-care unit. More surgeries are performed each year at Swedish/First Hill than at any other facility in the region; volumes include more total joint replacements than any other medical center in the state."}