{"jobID": "2795645318", "jobLocation": "New_York_NY", "jobTitle": "Talent Acquisition Assistant", "companyRating": "3.4", "companyInfo": {"Website": "www.sothebys.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1744", "Type": " Company - Public (BID) ", "Industry": " Retail", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "76000", "jobDescription": " OverviewSotheby’s was founded in 1744 as a book auctioneer and has since expanded to sell many of the world’s most valuable fine and decorative arts, wine, jewellery and other precious objects. Sotheby’s was the first international auction house to expand from London to New York, and the first to conduct sales in Hong Kong. Today, Sotheby’s maintains 90 offices in 40 countries, with principal salesrooms in New York, London, Hong Kong and Paris.  Sotheby’s presents auctions in ten different salesrooms, including New York, London, Hong Kong and Paris, and Sotheby’s BidNow programme allows visitors to view all auctions live online and place bids from anywhere in the world. Sotheby’s offers collectors the resources of Sotheby’s Financial Services, the world’s only full-service art financing company, as well as the collection advisory services of its subsidiary, Art Agency, Partners. Sotheby’s presents private sale opportunities in more than 70 categories, including S|2, the gallery arm of Sotheby's Global Fine Art Division, and two retail businesses, Sotheby’s Diamonds and Sotheby’s Wine. In 2018, Sotheby's acquires a New York-based startup called Thread Genius, created by former engineers from Spotify, which uses image recognition technology to present users with art they might like based on personal preferences and Viyet.com, a four-year-old online marketplace for vintage and antique furniture and decorative objects.  Sotheby’s is the oldest company listed on the New York Stock Exchange (BID).ResponsibilitiesPOSITION SUMMARY: The Talent Acquisition Assistant is an integral role supporting the recruiting function, and contributes to the overall success of the team by providing a high level of customer service, administrative support, data analysis, and project coordination throughout the recruiting lifecycle.  This position will require the TA Assistant to develop an understanding of our recruiting processes for candidate management, benefits, relocation policy, visa government regulation compliance, company policy administration, and other related activities in support of recruiting team and company employees. PRIMARY RESPONSIBILITIES/ACCOUNTABILITIES OF THE JOB:Provide daily administrative support to the TA team including but not limited to calendar scheduling, travel arrangements, greeting of applicants and onboarding of temporary employeesMaintenance of applicant tracking system (Icims): opening and closing requisitions, tracking of posting positions, drafting offer lettersUtilize the Applicant Tracking System (ATS) for routing requisitions, tracking and maintenance of all resumesPerform background and reference checksVerify the integrity and completion of all New Hire documentationWork with VP of TA to identify process guidelines areas to modify and/or create based on data captured from ATSReconcile freelance and temporary employee invoicesSupport the planning, implementation and assessment of the Floater and Trainee Programs.Conduct and distribute reports related to recruiting function, including Time to Fill, Cost per Hire, Turnover, and year end reports in system as requestedAssist with HR department with adhering to federal record retention requirementsAd hoc projects as assigned QualificationsEducation: Bachelor’s degree required Skills:Excellent written, verbal, and interpersonal communication skills.Ability to show good judgementInterest in working within Human Resources and Talent AcquisitionInterest in Fine Arts industry, highly desirable.Extremely tech savvy, resourceful, and proficient experience in Outlook, Word, Excel and PowerPoint, WebEx, teleconferencing, Skype, FacetimeKnowledge of Applicant Tracking/HRIS systems, Icims, Success Factors is a plusProficiency and experience with social media outlets such as LinkedIn, Glassdoor.com, The Muse, IndeedHighly motivated and must enjoy fast-paced environmentExperience handling confidential and sensitive materials with discretionDetail-oriented and highly organized with a strong bias to action & a can-do-approachMust be able to handle multiple prioritiesMust be flexible to adapt to changing business needs or special projects"}