{"jobID": "2819658523", "jobLocation": "New_York_NY", "jobTitle": "ISA Inspections Specialist, Data Analytics", "companyRating": null, "companyInfo": {"Website": "www.pcaobus.org", "Headquarters": "Washington, DC", "Size": "501 to 1000 employees", "Founded": " 2003", "Type": " Nonprofit Organization", "Industry": " Accounting & Legal", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Requisition Number 18-0062  Post Date 6/18/2018  Title ISA Inspections Specialist, Data Analytics - New York  Division Division of Registration and Inspections  PT/FT Full Time  City New York  State NY  Description Our MissionThe Public Company Accounting Oversight Board is a nonprofit corporation established by Congress to protect investors and the public interest by promoting informative, accurate, and independent audit reports and to oversee the audits of public companies and broker-dealers.Job DescriptionThe PCAOB has full-time, regular positions for an IS Audit Inspections Specialist in the Division of Registration and Inspections in our New York, NY office. The Division of Registration and Inspections inspects registered public accounting firms in connection with the firm’s performance of audits, issuance of audit reports, and related matters involving U.S. companies, other issuers, brokers, and dealers. Audit professionals who join the PCAOB will directly contribute to the PCAOB’s mission of protecting investors.ResponsibilitiesAs an IS Audit Inspections Specialist you will have the opportunity to use your skills and experience in auditing IT general controls and application and process controls to participate in a rigorous program of inspections of registered public accounting firms including:Inspecting portions of audit work papers to assess the degree of compliance with the Sarbanes-Oxley Act, the rules of the Board, the Securities and Exchange Commission, and professional standards in connection with the performance of audits, issuance of reports, and related matters involving issuers; Assessing the firms’ quality control structures and the related impact these structures have on audit quality; Performing data analyses using data analytics and business intelligence tools in support of inspections procedures and assessment of data captured as a result of inspections, Meeting and interviewing firm personnel to (1) understand the firms’ quality control structures, (2) understand the audit approach to audit engagements, and (3) further develop and/or identify quality control and/or audit deficiencies; Gathering and organizing information to support identified inspection issues; Researching and consulting with others on technical issues; Communicating findings to firm personnel in meetings and in comment forms; and Preparing comment forms and assisting with drafting inspection reports. As an Inspections Specialist, you will also be able to:Enhance your technical skills through inspection activities and the ability to collaborate with highly skilled Inspection teams; Participate in inspection projects aimed at enhancing the effectiveness of the Inspection program; Participate in the development and/or facilitation of training courses; and Participate in the PCAOB’s recruiting process.  Requirements QualificationsCurrent CISA (Certified Information Systems Auditor) and/or CPA (Certified Public Accountant) license required; A minimum of five years of progressively responsible experience having attained the Manager level in the audit of companies traded on the U.S. markets in the areas of IT general controls and application and process controls; Bachelor's degree in a technology related field and/or Accounting; MBA/Master's degree is a plus; Experience performing data analysis using data analytics tools like SAS, SQL, R, Python and/or ACL Experience using business intelligence (BI) software and developing dashboard analytics Training or experience in basic data science techniques and their application Strong knowledge and experience in IT general controls and application and process controls; Strong knowledge of PCAOB standards, generally accepted accounting principles and/or international financial reporting standards; Strong communication skills, both written and oral; Ability to work independently and as a member of a team; Ability to travel 20-30% of time (including some non-U.S. travel);and Fluency in a foreign language is a plus. Our ValuesThe PCAOB encourages a spirit of cooperation and teamwork, and fosters an environment of professional growth where employees can exercise their leadership ability, creativity, technical competence, and public interest focus in helping the PCAOB fulfill its mission.Equal Employment OpportunityAll PCAOB employees are entitled to equal opportunity and a professional work environment, free of discrimination and harassment. A workplace free of discrimination is fundamental to professional success and to the PCAOB's mission. The PCAOB will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.#LI-DD1-R .ButtonClassNavigation, .ButtonClassDataModification, .ButtonClassTools, .ButtonClassFormReset { width: 150px; } .ButtonClassNavigation:hover, .ButtonClassDataModification:hover, .ButtonClassTools:hover, .ButtonClassFormReset:hover { width: 150px; } .ButtonClassNavigation:active, .ButtonClassDataModification:active, .ButtonClassTools:active, .ButtonClassFormReset:active { width: 150px; }  Send This Job to a Friend This site is operated by UltiPro. http://www.ultimatesoftware.com. Use of this site is governed by Ultimate Software Group’s policies and practices, including its Privacy Policy, which can be found at http://www.ultimatesoftware.com/Privacy-Policy."}