{"jobID": "2831001754", "jobLocation": "Palo_Alto_CA", "jobTitle": "APP: Nurse Practitioner/Physician Assistant - Psychiatry Clinic", "companyRating": "3.4", "companyInfo": {"Website": "www.stanfordhealthcarecareers.com", "Headquarters": "Stanford, CA", "Size": "5001 to 10000 employees", "Founded": " 1957", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Sutter Health, UCSF Medical Center and UCSF Benioff Children’s Hospitals, Kaiser Permanente"}, "estimatedSalary": "171000", "jobDescription": " The Nurse Practitioner/Physician Assistant (NP/PA) functions under the general Nurse Practitioner Standardized Process Protocol or general Physician Assistant Role Description approved by the Interdisciplinary Practice Committee (IDPC). The NP/PA provides routine care and management of the patient with acute and chronic complaints, in collaboration with the supervising physician and through implementation of standardized procedures. Specific functions pertaining to the Service, Clinic or Department are established by the NP/PA and the supervising physician(s), and approved by the appropriate medical and nursing administrators, the IDPC, and the Stanford Hospital and Clinics (SHC) Medical Executive Board and Board of Directors.  Equal Opportunity Employer Stanford Health Care (SHC) strongly values diversity and is committed to equal opportunity and non-discrimination in all of its policies and practices, including the area of employment. Accordingly, SHC does not discriminate against any person on the basis of race, color, sex, sexual orientation or gender identity and/or expression, religion, age, national or ethnic origin, political beliefs, marital status, medical condition, genetic information, veteran status, or disability, or the perception of any of the above. People of all genders, members of all racial and ethnic groups, people with disabilities, and veterans are encouraged to apply. Qualified applicants with criminal convictions will be considered after an individualized assessment of the conviction and the job requirements.  Nurse Practitioner  Education: Master\"s or Doctorate Degree in Nursing from an accredited college or university is, required.  License/Certification: BLS - Basic Life Support, required.  License/Certification: CA Registered Nurse (RN), required.  License/Certification: Certification as a Nurse Practitioner by a nationally recognized nursing organization (e.g., American Academy of Nurse Practitioners-AANP, American Nurses Credentialing Center-ANCC, or any successor organizations), required.  License/Certification: DEA - DEA Number from the US Drug Enforcement Administration, required.  License/Certification: CA NP - Nurse Practitioner, required.  License/Certification: NPF - NP Furnishing Number, required.  Physician Assistant  License/Certification: Current licensure as a Physician Assistant in the State of California is required.  License/Certification: BLS - Basic Life Support, required.  License/Certification: DEA - DEA Number from the US Drug Enforcement Administration, required.  License/Certification: Must be board certified from the National Commission on Certification of Physician Assistants (NCCPA) at the time of hire and maintain certification during employment at SHC.  Two years of Advanced Practice Provider experience preferred. Some psychiatric experience with a Geriatric background also preferred."}