{"jobID": "2726334276", "jobLocation": "San_Jose_CA", "jobTitle": "Territory Manager", "companyRating": "2.5", "companyInfo": {"Website": "www.apria.com", "Headquarters": "Lake Forest, CA", "Size": "5001 to 10000 employees", "Founded": " 1924", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Rotech Healthcare, Lincare Holdings, Addus HomeCare"}, "estimatedSalary": "39000", "jobDescription": " Job SummaryApria Healthcare is one of nation’s leading providers of home healthcare products and services including respiratory therapy, sleep apnea therapy, non-invasive ventilation therapy, enteral nutrition therapy, negative pressure wound therapy and home medical equipment. Headquartered in Lake Forest, California, Apria owns and operates branch locations across the nation and serves more than 1.8 million patients each year. With over $1 Billion in annual revenues, Apria is one of the largest home healthcare companies in the United States. Apria was the first company of its type to obtain voluntary accreditation from The Joint Commission and has been continuously accredited for more than 25 years. For more information, visit www.apria.com.  This position is responsible for selling all Apria products and services in the assigned sales territory. The Territory Manager works closely with branch staff, and the Customer Care Center to focus efforts on increasing sales. This position collects documents required for billing based on Apria policy. This position is also responsible for meeting both revenue and profitability goals for their assigned sales territory. The Territory Manager works with the Market Leader to develop and execute specific strategies to achieve these sales, customer satisfaction and profitability goals. DESCRIPTIONConducts daily sales calls to establish new and maintain ongoing business with referral sources in the medical community.Validates and develops territory call plans to qualify new and maintain existing accounts to grow the business.Enters call plan and logs calls along with the decisions and outcomes into the “Sales Management System” (SMS).Uses Apria reports and data such as target ratings to identify referral targets and helps in validating as well as updating of incorrect/old data.Partners with the Market Leader to review sales territory call plan to achieve strategic goals.Educates referral sources on the use and application of Apria products and services.Maintains the highest level of customer satisfaction by resolving and following up on customer concerns.Partners with branch management and staff as well as other functional areas within the company to drive sales growth.Communicates and explains Medicare guidelines around private insurance procedures, pricing information, and product information to referral sources.Maintains accurate records on prospective and active accounts ensuring information is sent to reimbursement offices for billing and collection.Ensures billing documentation is complete and accurate.Performs other related duties as directed by supervisor. Minimum Required QualificationsQUALIFICATIONS: (Knowledge, Skills, Abilities)A four year college degree is required.Must have experience in one of the following: military service, prior leadership in athletic, academic or voluntary service activities.Must be highly motivated, flexible, and service-oriented.Should have strong presentation and communication skills.Demonstrated ability to build and maintain solid working relationships with internal and external customers.Willingness to participate in ongoing training and development.Geographically located within the assigned territory.Physical Demands:The physical demands described here are representative of those that must be considered for an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.The position requires occasional sitting with constant standing, walking, and regularly kneeling, and stooping.The position requires the constant use of hands to write, use computers, and manipulate papers.The position requires constant talking and hearing.The position requires specific vision abilities to include close vision, peripheral vision, and the ability to adjust focus.The position requires occasional lifting and/or moving up to 25 pounds. EEO StatementAs an EOE/AA employer, Apria Healthcare is committed to providing all applicants and employees with equal access to employment opportunities, regardless of sex, race, age, color, national origin, disability, pregnancy, religion, genetic information, sexual orientation, transgender status, gender identity, marital status, veteran status, or any other characteristic protected by federal, state, or local law. Apria Healthcare shall abide by the requirements of 41 CFR 60-300.5(a) and 60-741.5(a). These regulations prohibit discrimination against qualified individuals on the basis of protected veteran status or disability, and require affirmative action by covered prime contractors and subcontractors to employ and advance in employment qualified protected veterans and individuals with disabilities. AA/EOE, M/F/Disability and Vet"}