{"jobID": "2693299017", "jobLocation": "Seattle_WA", "jobTitle": "Senior Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.myshyft.com", "Headquarters": "Seattle, WA", "Size": "1 to 50 employees", "Founded": " 2016", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job DescriptionCompany Description  Shyft Technologies Inc. is changing the way teams work. We are a mobile first technology company that helps teams manage shifts, share schedules and communicate with each other all in one app. Shyft is built to help make lives easier for the 250 million shift workers world wide who don’t sit at a desk, and it all starts with us here. Our loft style office is centrally located in the lower queen anne neighborhood just one block away from the water, close to great food and great Seattle views. We are growing quickly, building a dynamic team of innovators, entrepreneurs and creatives who see work differently, and want to help teams globally see work differently too.  Job Description  At Shyft, we use data to drive business decisions, create sales opportunities, improve product features and constantly deliver value to our customers. Data helps us put a pulse on the health of the business and navigate this market filled with unlimited growth potential.  We're rapidly growing and are looking for a strong data analyst who is passionate about finding hidden gems from vast amount of data. You will uncover valuable insights that stakeholders and clients would be using to improve the product and make important business decisions.  The contributions you make will affect the lives of hundreds of thousands of users and impact them on a daily basis. You will be working in an entrepreneurial environment with great team dynamics where everyone values integrity, transparency and good work ethics.  Qualifications:  · High proficiency in SQL, able to create complex queries to aggregate data and provide business insights.  · Proficiency working with large datasets using scripting languages such as R, python, ruby.  · Experience working with data tracking solutions such as Mixpanel, Fabric, Google analytics, Facebook analytics.  · Knowledge of statistics and experience using statistical packages for analyzing datasets (Excel, SPSS, SAS etc.)  · Experience with data visualization tools such as Periscope data, Tableau, Mode analytics  · Experience creating statistical models to make product improvement decisions.  · Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy.  Qualifications  · Develop data reports for business stakeholders and clients to assess account health and drive sales efforts.  · Implement data visualization solutions for business stakeholders and clients to use.  · Work with the engineering team to assist in the company's artificial intelligence and machine learning initiatives.  · Collect, sanitize, interpret and analyze data from various analytical tools.  Additional information  Our Benefits Work at the fantastic Northwest Lofts in Queen Anne. This vibrant work community is home to fantastic startups, gourmet restaurants, quick public transportation, and located right in the heart of Seattle.Medical benefits for all full time employees.Great company culture with expected startup style perks!  Apply online: http://smrtr.io/5d-jnA"}