{"jobID": "2790248270", "jobLocation": "New_York_NY", "jobTitle": "Data and Systems Analyst (Intern)", "companyRating": null, "companyInfo": {"Website": "www.c4q.nyc", "Headquarters": "Long Island City, NY", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "POSITION SUMMARYLocation: Long Island City, NY  Department: Fellowships  Time Commitment: Full-Time or Part-Time, Spring or Summer  Compensation: Unpaid or for credit  The Data & Systems Analyst will play a critical role in building C4Q’s data and systems capabilities. C4Q strives to be a data-driven organization, so maintaining and effectively utilizing good data is paramount. He/she will be the ‘go-to’ person for all matters data and systems related. The ideal candidate is proactive and strategically-minded who thrives in solving problems and is passionate about data. He/she will be service-oriented, providing technical and systems administrative support to the team, ensuring that all systems are utilized fully and appropriately.ResponsibilitiesData Management & IntegrationBe the go-to person for all data matters in the organizationManage all data sources, ensuring functionality, quality, etc. Update and improve database structures to make optimally conductive to analysis and reportingDevelop, and manage data modelsDrive data-quality related activities, be responsible for quality and cleanliness of data and structureImplement and recommend operation methods to improve processing, distribution, data flow, data collection, database editing proceduresRun data reports and dashboards as neededSystems Strategy and Operational PerformanceConduct analyses on optimal options for systemsConduct analyses to assess system performanceIdentify root causes for systems issues and implement solutionSystem Implementation & AdministrationManage data integration/implementation processes, including developing code for integrations where possibleSupport data mapping & transformation exercises for data migration / integrationSupport implementation of new systemsProvide systems administration for all systems (including new user set-up, permission-setting, configurations, etc)Own and provide training on all systems / data-related activities for the organizationServe as first-line support for all technical issues, provide troubleshootingLog and assess ongoing technical issues; identify and implement optimization opportunitiesQualificationsTechnical aptitude to learn software and technology quicklyKnowledge of data modeling and queries, e.g. SQLExperience with APIs, data integration, ETLsExperience in application development technologies e.g. Apex, JavaScriptProblem-solver and action / service - orientedNice to HavesKnowledge of tech industryExperience working with a nonprofit"}