{"jobID": "2671936651", "jobLocation": "San_Francisco_CA", "jobTitle": "Porter", "companyRating": null, "companyInfo": {"Website": "www.guckenheimer.com", "Headquarters": "San Mateo, CA", "Size": "1001 to 5000 employees", "Founded": " 1965", "Type": " Company - Private", "Industry": " Restaurants, Bars & Food Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Does it make your eyes twitch to see a kitchen is disarray? Do people marvel organized pantry? Do you like meeting new people while you work and making them smile? Does everything in your refrigerator have a place? If so, then keep reading because this job might just be perfect for you.  We are looking for an exceptional Porter to join the Guckenheimer Team. You would not only have the opportunity to put your teamwork skills into action, but you would also be able to be part of making a vision for more sustainable lifestyles and communities a reality.  Perks of the job include: NO WEEKEND WORK - That’s right - only work Monday through FridayWork with cool people who appreciate the importance of your roleGet your grub on! Meals and snacks are FREE to you on siteBe in an exciting environment where new ideas are constantly bubbling upLearn all about the world of food and gain an opportunity to grow. Set your sights high! This may be an entry level position, but once you are in, the sky's the limit.A job that offers a special financial housing subsidyA job that ALSO offers a special financial commuter benefit Now that we’ve got you hooked, here is what the ideal candidate would look like: Previous experience in maintenance or food service environment (1 year)Extreme attention to detail, time management skills, and ability to follow directions.Passion for food and a desire to want to be part of an amazing and unique program. The client’s food program raises the bar for food at work. Must make a commitment to understanding, adopting, and modeling the client’s food program mission, vision, and values.Take pride in their appearance and the appearance of their work areaWork in a safe manner when lifting trash into the dumpster while still using their knowledge of proper sorting.Ability to lift a minimum of 25 lbs and must be able to work on their feet for 7.5 hours per day excluding breaks. (Bonus points if you can leap buildings in a single bound.)Have open availability Monday-Friday Apply and think to yourself, “I’m Feeling Lucky.”  Guckenheimer is a national foodservice management company that pioneered restaurant style, healthful dining in the workplace.  Guckenheimer embraces Equal Employment Opportunity.  Guckenheimer participates in the E-Verify Program, as required by law."}