{"jobID": "2830884506", "jobLocation": "San_Francisco_CA", "jobTitle": "Intern - Member of Technical Staff- vCenter", "companyRating": "4.2", "companyInfo": {"Website": "www.vmware.com", "Headquarters": "Palo Alto, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (VMW) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "152000", "jobDescription": " VMware is a global leader in cloud infrastructure and business mobility. VMware accelerates customers digital transformation journey by enabling enterprises to master a software-defined approach to business and IT. With VMware solutions, organizations are creating exceptional experiences by mobilizing everything, responding faster to opportunities with modern data and apps hosted across hybrid clouds, and safeguarding customer trust with a defense-in-depth approach to cybersecurity.  At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Do you dare to do the stuff youve always dreamed about? Dare to explore at http://careers.vmware.com.  VMwares vCenter Server is the flagship management platform for Cloud services and the Software Defined Datacenter. We are looking to take our strength and leadership in compute and virtualization and extending it from a VM-centric focus to managing app-centric, containerized workloads using Kubernetes, Docker, and other emerging container technologies.  This is where you come in. We need your help to make our infrastructure platform easier, faster and more productive for application developers.  Are you passionate about open source? Do you enjoy working in a lean / agile development environment (Jira, MVPs, iterations)? Do you want to learn more about how things work and what a good design looks like? Are you someone who has a track record of delivering quality software products using test-driven development? If so, this may be a phenomenal internship opportunity where you will be a part of a highly technical, detail oriented team with focus on implementation excellence. As an intern you will gain experience and knowledge of the management of virtual and non-virtual data center environments which will be helpful to grow and develop you as an engineer.  Qualifications:"}