{"jobID": "2787498908", "jobLocation": "New_York_NY", "jobTitle": "Restaurant Assistant General Manager", "companyRating": "3.3", "companyInfo": {"Website": "www.dinosaurbarbque.com", "Headquarters": "Syracuse, NY", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Restaurants, Bars & Food Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": "Assistant General Manager- Located at our Harlem, NY location! Come join the Dino Fam!Company Mission: Culture and Community! Essential Duties and Responsibilities:The Assistant General Manager’s role (AGM) is to provide uncompromised excellence at all times, making the Guest and the Bar-B-Que the heart and passion of all they do. The AGM shares responsibility with the Managing Partner for the total operations by building sales, managing profit and loss, hiring/training of all Team Members, daily execution of safety/sanitation, quality food preparation and guest service.Resolution oriented- protects company assets; prevent/diffuse situations that create potential risks to the organization.Exercise good judgment and decision making in escalating concerns and aggressively resolving any issues timely.Manage day to day operations during scheduled shifts that include daily decision making, Team Member support, Guest interaction, scheduling, planning while upholding standards, product quality and cleanliness.Proactively organizes and plans work anticipating the ever- changing needs of the business.Responsible for appropriately communicating to Managing Partner and Director of Operations on a regular basis. This includes: daily accountability of restaurant sales, actions taken on projects, progress on company initiatives, situations discussed in Manager meetings, Guest comments, restaurant staffing and labor, Manager in Development performance and financial results.Communicates effectively with the entire Team.Ensures Team Member and Manager schedules support the positive performance of the restaurant by verifying the right people in place and par levels are scheduled according to PLOT forecasts.Uses Developmental Action Plans and coaching to develop those under him/her to become better Team Members.Ensures service standards are maintained consistently.Ensures food and beverage standards are maintained consistently. Conducts line checks consistently.Ensure adherence with Company cash handling policies and procedures.Effectively utilizes all communication tools: email, written correspondence and pre- shift notes.Responsible for compliance with OSHA, local health and safety codes as well as Company safety and security policies. Emphasize safety, sanitation, and security awareness, and ensure that Team Members are properly trained to create a safe work environment.Verifies all daily administration is carried out according to deadlines, policy and standards.Attends Manager Meetings weekly with an agenda and time allotted for discussion.Communicates effectively with vendors, addressing concerns as needed.Ensures all Team Member information – File Folders, Employee Records and signed documentation meets company policy.Provides direction, coaching and leadership for all Team Members including training, standards, safety and sanitation, and company policies and procedures.Responsible for the selection, on boarding and retention of Team Members through motivation, recognition coaching and development.Conducts new hire orientations and submits paperwork timely to HR/Payroll departments.Promotes sales building behaviors with Managers and Team Members.Assists MP in the accountability for the financial performance of the restaurant.Other duties as assigned.Education Requirements:High school diploma, or general equivalency diploma (GED);Associates degree in Hospitality, Restaurant Management, or related degree preferredWork Experience Requirements:2+ years’ experience as AGM or GM/MP.3+ years of full-service restaurant experience required.3 + years strong FOH experience with success with a reputable brand.Management of at least 15+ staff members.Solid knowledge of P& L, planning & preparation.Experience in people development.Benefits/ Why work for us:Great Health, Dental, and Vision InsuranceFSA, HSALife Insurance, Supplemental Life InsuranceDisability Insurance- Employer Paid401 k with Employer MatchPTO/ VacationWork/ Life BalanceFast- paced environmentFun, engaging work placeInternal PromotionsOpportunity to receive Quarterly Manager BonusesAnnual Performance ReviewsPart of a great teamPhysical Requirements:Ability to sit or stand for long periods of time and work in a restaurant environment.Ability to lift at least 50 pounds.While performing the duties of the Manager, they are regularly required to stand and walk; talk or hear, in person and use hands repetitively to finger, handle, feel or operate kitchen equipment and other standard office equipment; reach with hands and arms; bend, kneel and crouch and climb.NOTE: Dinosaur BBQ® reserves the right to revise or change the position plan as the need arises. This position plan is not all inclusive of total job responsibilities nor does it constitute a written or implied contract of employment.Dinosaur BBQ® is an Equal Opportunity Employer."}