{"jobID": "2811581778", "jobLocation": "New_York_NY", "jobTitle": "LPN", "companyRating": "4.1", "companyInfo": {"Website": "www.nportstaffing.com", "Headquarters": "Brooklyn, NY", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Private Practice / Firm", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "24", "jobDescription": "A CAREER WITH NPORTNPORT is the largest provider of contract nursing and therapy staffing services throughout New York and New Jersey. We provide thousands of hours of staffing every month with long-term, short-term, temp-to-perm and permanent placement positions to fit the needs of our clinicians and our clients. We offer high pay rates, fun and challenging positions with full benefit packages available to you... At NPORT, superior customer service and clinical excellence are our standards every day. We are a top performing therapy staffing company with the ability to service facilities of all types. We provide the most advanced therapists of all disciplines. Whether you are a new grad or a seasoned professional, we have many opportunities for you! We offer a number of standard services to facilities of all types. Standard programs include:long-term and short-term staffing SolutionsFull time, Part time, Per Diemlate admissionscoveragetraditional and non-traditional hoursweekend and holiday coverageSkilled Nursing FacilitiesHospitalsNport Staffing/Kindred, a leader in the professional healthcare industry, has openings for LPN’s, (License Practical Nurse) in the NYC Metro Area We are currently looking for license practical nurses who have at least 1 year of experience in an Acute Long/Short Term Care facility, Hospital, DOE, or Homecare settings to provide nursing care to our clients and patients. The positions range from FT, PT, Per Diem typically 1-5 days per week/weekends based on your availability. Summary Statement:The incumbent shall be responsible for providing a full range of nursing care including assessment, treatment planning and hands-on nursing care in an interdisciplinary environment consistent with the position's qualifications, professional practices and ethical standards. The incumbent shall also demonstrate accountability for and contribution to care planning development, quality improvement, problem-solving and productivity enhancement in a flexible interdisciplinary fashion.Nport/Kindred offer’s some of the following:Competitive Pay RatesDirect DepositMedical/Dental Options (Employee)Liability insurance coverage (Employee)Referral bonusesClinical SupportFlexible SchedulesLarge Client BaseVarious Clinical SettingsQualifications: The incumbent shall, at a minimum, be a graduate of an accredited LPN nursing program approved by the board of nursing in practicing state and hold an applicable and current license to practice. One to three years’ experience working as a LPN with patients/residents/clients in a related setting, preferred.If interested apply today Nport Staffing/Kindred looks forward to hearing from you!"}