{"jobID": "2797111160", "jobLocation": "Sunnyvale_CA", "jobTitle": "Commercial Property Manager", "companyRating": "3.7", "companyInfo": {"Website": "www.embarcaderocapitalpartners.com", "Headquarters": "Belmont, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": " Embarcadero Capital Partners is a real estate investment and management firm based on the San Francisco peninsula. We invest in dynamic, development-constrained U.S. markets that are known for intellectual capital and a creative business culture.Join a Diverse and Talented Team:  Embarcadero Capital Partners consists of a diverse team of seasoned industry professionals. We have the experience and expertise to identify and capitalize on opportunities in every major U.S. market. Our group's capabilities encompass all aspects of commercial real estate including acquisition, finance, development, leasing, management, and disposition. ECP's in-house management and leasing staff work with a variety of third-party brokers and property management groups to execute defined operating and investment objectives. Senior Property Manager: Embarcadero Capital Partners is seeking a highly motivated Senior Property Manager in South Bay portfolio, officed in San Jose, CA with properties in the surrounding cities.  The position is responsible for overseeing all aspects of managing the property including: Supervising all aspects of managing the propertyConducting regular property inspections and develop associated action plans to ensure curb appeal and maximize rent potentialEnsuring that lease terms are administered properly and on timeResponding to tenant inquiries and problem calls beyond the scope of other staffSupervising daily activities of all on-site management staff and engineering personnelBidding and managing capital improvements and major repairsOrganizing and leading semi-monthly operation/construction reviews with Client, management team, Chief Engineer and Project ManagerPreparing annual budgets, reforecasts and CAM recoveriesMonitoring parking garage operations regarding customer requirements, collections, pricing strategy and maintenance of parking facilities, and review monthly operation reportsPreparing monthly property performance reports and variance reportsCompetencies/Experience Required:10+ years in CRE industry, with a minimum of 5 years in PM roleExercises initiative and creativity, able to work with minimal supervisionAbility to communicate effectively across all levels of employees and corporate managementFirm understanding of leasing concepts and ability to partner with the broker to oversee leasing activity for propertyAbility to supervise in-house and third-party engineering personnelAbility to delegate to others and nurture career growth of staffDetail oriented, able to prioritize, and possesses exceptional organization skillsExperience with MRI and Kardin preferred We offer a comprehensive compensation and benefits package that is reflective of our high-quality standards."}