{"jobID": "2745464551", "jobLocation": "Brooklyn_NY", "jobTitle": "Behavior Intervention Specialist", "companyRating": null, "companyInfo": {"Website": "www.hhcsny.org", "Headquarters": "Brooklyn, NY", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Purpose of the job: This is a clinical position where the Behavior Intervention Specialist (BIS) will be responsible for the assessment of individuals’ habilitative and behavioral needs as well as the implementation of interventions to help improve those needs throughout the different programs throughout Heavens Hands Community Services. Essential Duties and Responsibilities: Identify the habilitative and behavioral needs of the individuals we serve and then educating the direct support professionals, supervisors and management team that work with these individuals.  Conduct on-going behavioral assessments of the individuals we serve, both via written questionnaires to the individuals, guardians and program supervisors, rating scales and informal observations.  Develop written, individualized behavior plans as determined by the needs of the individual.  Ensure that timely modifications are made to the created behavior plans based on the needs of the individual.  Work with the program supervisors to design effective progress monitoring systems and then timely making changes to the plan based on data collected demonstrating changes to the individual’s need.  Summarize the progress of each individual on their assigned behavior plan on a monthly basis.  Oversee the completion of all required paperwork, including monthlies, case conference notes are completed in conjunction with the agency philosophy.  Ensure that all interventions or behavior plans receive the proper approval prior to implementation such as informed consent.  Train direct support staff on a regular basis to provide group clinical supervision where the BIS will make sure that all clinical interventions are being properly administered while explaining the rationales behind why the plans are being administered and ensure that all direct support staff are comfortable in implementing each plan. This includes educating the support staff on the clinical needs of the individuals while following agency guidelines and HIPAA regulations.  Responsible to operate as a resource to other programs including, in home community service programs and Medicaid Service Coordination programs throughout the agency depending on the needs of those departments.  Responsible for attending the monthly supervisor, day hab department, and managers meetings, as well as the incident review committee.  Prepare a clinical agenda for the meetings that they attend, which may include leading a discussion on the clinical needs of the organization and providing training to the management team.  Initiate referrals for necessary psychological evaluations for the individuals. This includes making recommendations to the individuals and their families.  Assist in the coordination of the individual mental health and behavioral treatment between both the day habilitation program and the needs of the individuals at home.  Attend annual case conferences for individuals that are following any clinical plan administered by the BIS to gain a deeper understanding the person centered needs and to update all parties on the progress of the individual.  Ensure that all clinical material and records are securely maintained in conjunction with OPWDD and HHCS standards.  Meet with their supervisor on a regular basis for supervisions and to come to these supervisions prepared with an agenda, detailed with follow up to tasks delegated during the supervision process.  Function as a Direct Support Professional on an as needed basis based on the needs of the day habilitation programs.  Attend ISP meetings and meet with families to monitor and assess clinical implementation and satisfaction as needed.  Ensure a flexible schedule that will afford individuals, support staff and managers opportunities to meet at their convenience (may occasionally include evenings and/or weekends)  Other duties as assigned by your supervisor. Qualifications: · Master’s Degree in the field of Human Services or similar field preferred, Bachelor’s degree required.  · Minimum of 1 year experience working in the field of developmental disabilities working with OPWDD regulated services.  · Ability to work in a fast paced, ever changing environment while being asked to meet strict deadlines and handle multiple priorities. Travel to various programs throughout the queens and Brooklyn area and flexibility in schedule is required for the job.Strong leadership and organizational skills. This includes the ability to write clinical reports and treatment plans and then being able to train support staff and the management team in an effective manner.Excellent communication skills (verbal and written)."}