{"jobID": "2776394409", "jobLocation": "Palo_Alto_CA", "jobTitle": "Hardware Engineer Intern - Autonomous Driving - Fall", "companyRating": "3.8", "companyInfo": {"Website": "www.lyft.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Transportation & Logistics", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": "Fall 2018 full-time internship [September-December]  At Lyft, community is what we are and its what we do. Its what makes us different. To create the best ride for all, we start in our own community by creating an open, inclusive, and diverse organization where all team members are recognized for what they bring.We care deeply about delivering the best transportation experience; this means the best experience for the passenger and the best experience for the driver. We believe this quality of service can only be achieved with a deep understanding of our world, our cities, our streets how they evolve, how they breathe. We embrace the powerful positive impact autonomous transportation will bring to our everyday lives and with our ambition, we will become a leader in the development and operation of such vehicles. Thanks to our network, with hundreds of millions of rides every year, we have the means to make autonomy a safe reality.  As an intern on the Level 5 team, you will be interacting on a daily basis with optics, mechanical, electrical and software managers. You will be a technical contributor with a deep understanding of the technology involved in the specification, design, integration, testing/qualification and manufacturing of cameras, lidars, radar, and high power compute systems for harsh environments. You will work with engineers to implement bug prevention strategies, design for testability, and other quality standards. We are currently looking for interns on our various autonomous teams: Hardware Engineering, Mechanical Engineering, and Systems Engineering Experience & Skills:Currently pursuing Bachelor's, Master's, or Ph.D. in Electrical Engineering, Mechanical Engineering, or related fieldHardware functional testing experienceKnowledge of CS fundamentals + programming experience in C, C++, and Python, particularly in an embedded real-time environmentExcellent communication skillsPassion for community, sustainability, and/or transportationNice to Have:Some knowledge of design tools such as MATLAB, SolidWorks, Catia, Altium, Cadence, Mentor Graphics or other design toolsSome knowledge of robotics and/or automotive electromechanical requirements, design, simulations, and testingDemonstrated ability to work with cross-functional teamsSome experience in product design and manufacturingA proactive approach to troubleshooting problemsLyft is an Equal Employment Opportunity employer that proudly pursues and hires a diverse workforce. Lyft does not make hiring or employment decisions on the basis of race, color, religion or religious belief, ethnic or national origin, nationality, sex, gender, gender-identity, sexual orientation, disability, age, military or veteran status, or any other basis protected by applicable local, state, or federal laws or prohibited by Company policy. Lyft also strives for a healthy and safe workplace and strictly prohibits harassment of any kind. Pursuant to the San Francisco Fair Chance Ordinance and other similar state laws and local ordinances, and its internal policy, Lyft will also consider for employment qualified applicants with arrest and conviction records."}