{"jobID": "2831523145", "jobLocation": "Seattle_WA", "jobTitle": "Data Analyst 2", "companyRating": "3.6", "companyInfo": {"Website": "www.nordstrom.com", "Headquarters": "Seattle, WA", "Size": "10000+ employees", "Founded": " 1901", "Type": " Company - Public (JWN) ", "Industry": " Retail", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "83000", "jobDescription": " Nordstrom is a fashion specialty retailer founded on a simple idea: offer each customer the best possible service, quality, value and selection. Providing great customer service goes beyond the selling floor. It takes a team of individuals with different talents and skills to continuously improve service and our results.  Our Advanced Analytics team works in partnership with other areas of the Company to develop insights, algorithms, and data products that support decision making, products, and technologies used throughout Nordstrom. When you join our team, you are welcomed into a family dedicated to creating memorable and rewarding shopping experiences for our customers.A day in the life…As an integral part of our Advanced Analytics team the Digital Analyst is responsible for collecting, analyzing and presenting data to improve decision making around customer experience projects in Nordstrom’s high-growth Direct online channel. This individual should have a high degree of curiosity about the business and the skills to discover impactful insights from data and communicate those insights in a way that builds confidence and enables decisions that drive business value. Partner with key stakeholders on data analysis problemsMine complex digital behavioral data and transform it into actionable information.Apply common statistical methods, data modeling, and predictive analysis to answer strategic questions for the online businessUse advanced data visualization techniques to communicate solutions to business stakeholdersProvide exceptional customer service through professionalism, ownership and initiativeDemonstrate productivity through the efficient use of time and a commitment to strong results No sponsorship is available for this position.QualificationsQuantitative degree, preferably a Master's degree in mathematics, statistics, computer science, engineering, or similar quantitative analytics discipline.1 year of experience in online analytics (online retail a plus)1 year of professional experience writing SQL queries from scratch.1 years of professional experience using R or Python in an analytics capacity.Working understanding of statistics.Great with data visualization -- R graphics, Shiny, Tableau, or Python.Strong organizational and time management skillsGood verbal and written communication skills, ability to convey results to non-expertsAbility to work well in cross-functional teams and prioritize requests from multiple stakeholdersWe’ve got you covered…We offer a comprehensive benefits package that includes medical, vision and dental coverage, a fabulous merchandise discount, an employer-matched 401(k) plan, a profit-sharing plan and much more. We are an equal opportunity employer committed to providing a diverse environment. This job description is intended to describe the general nature of the work employees can expect within this particular job classification. It is certainly not a comprehensive inventory of all duties, responsibilities and qualifications required for this job.#LI-TL1"}