{"jobID": "2826813062", "jobLocation": "San_Leandro_CA", "jobTitle": "Data Analyst, Business Intelligence", "companyRating": null, "companyInfo": {"Website": "www.alamedahospital.org", "Headquarters": "Alameda, CA", "Size": "501 to 1000 employees", "Founded": " 2002", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Summary: Under general direction, will support data inquiry needs in various functional areas and may be assigned to Ambulatory Care, Business Intelligence Unit, or System Transformation and Re-engineering. These activities will include creating, investigating, analyzing, and executing organizational improvement projects at Alameda Health System. These activities also include data analysis and reporting within the Business Intelligence Unit. The role has three major areas of responsibility: 1) data system comprehension, report writing and analysis; 2) project management and team support; and/or 3) coaching and teaching. Performs related duties as required. DUTIES & ESSENTIAL JOB FUNCTIONS:NOTE: The following are the duties performed by employees in this classification, however, employees may perform other related duties at an equivalent level. Not all duties listed are necessarily performed by each individual in the classification.  1. Assist each team to design and build user-friendly data reports and graphs that can be  produced regularly. Bring knowledge of and expertise in improvement models and solutions from other places to assist AHS teams in developing solutions. Coach and mentor team members to understand and interpret the data reports.Coach the team members as they brainstorm, design and implement improvement plans and directives. Coordinate and mentor the team to become a cohesive work force able to effectively and continuously work to increase quality, efficiency and improve processes at AHS. Create & maintain work plan trajectory for each team.Provide meeting support, including tracking meetings and deadlines, maintaining roster, sending reminder emails to members, ensuring meeting decisions & action items are recorded and distributed. Support assigned teams to identify data sources, identify data items needed and obtain reports. Work with education department and other staff to create communication tools, periodic bulletins, and conduct trainings and workshops. Work with team leaders to develop meeting agendas, prepare handouts, etc. Minimum Qualifications:Education: Bachelor’s degree required. Advanced degree in health related field preferred. Minimum Experience: Two years experience in health-related process, quality improvement and/or business intelligence/analytics. Direct experience in hospital or health system settings coaching and supporting improvement teams with data, meeting facilitation and support, and process improvement tools. Training in process improvement models ( e.g., Improvement Model, PDSA, Lean, six-sigma) desirable."}