{"jobID": "2429275749", "jobLocation": "San_Jose_CA", "jobTitle": "OTR Company Driver Position", "companyRating": null, "companyInfo": {"Website": "www.driveforprime.com/?r=glassdoor", "Headquarters": "Springfield, MO", "Size": "1001 to 5000 employees", "Founded": " 1970", "Type": " Company - Private", "Industry": " Transportation & Logistics", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Prime Inc. was founded in 1970 by Robert Low and is North America's most successful refrigerated, flatbed, and tanker trucking company and provides safe, reliable, and continuous on-time service to its expanding international customer base.How To Get Started: Attend a 3-day orientation at Prime in one of the following locations: Springfield, MO; Pittston, PA; and Salt Lake City, UT. Prime provides bus transportation to orientation as well as 3 meals per day and hotel accommodations during orientation. Experience hands-on, computer based, and simulator training. Get the keys to your own truck and get on the road!Company Driver Starting Pay Rates: Refrigerated= .41 cpm (plus additional .05 cpm in a lightweight tractor) Flatbed= .43 cpm Tanker= .48 cpmCompany Driver Benefits:Health, life, dental and vision insurance plans (90 day waiting period)401k with company matchPaid vacationIncentives and Bonus Programs: Safety and Service Incentive Fuel Mileage Incentive Driver Referral Program Training ProgramEquipment: Freightliner, Peterbilt, and International 2014 Model Tractors & Newer APU & 1500 Watt Inverters Omnitracs Qualcomm with Electronic Logs and Navigation Prime Mobile App for Trip Scanning, Messaging, and MoreSupport: 24/7/365 Driver Support for for Operations/Dispatch and Road Assist Industry-Leading Amenities at our main terminals in MO, PA, & UT Driver Health and Fitness ProgramIf you have at least 6 months of recent tractor trailer experience, ask your Recruiter about Start Right Pay which offers guarantee pay of at least $800 per week for the first 3 weeks at Prime for experienced company drivers. Apply now on Glassdoor or call 877-491-1113 to speak with a Prime Inc. Recruiter!"}