{"jobID": "2684002053", "jobLocation": "New_York_NY", "jobTitle": "Customer Success Engineer - NYC", "companyRating": null, "companyInfo": {"Website": "www.looker.com", "Headquarters": "Santa Cruz, CA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Tableau Software, Chartio, Periscope Data"}, "estimatedSalary": null, "jobDescription": "WHO WE ARELooker is on a mission to bring better insights and data-driven decisions to every business. Everything we do is aimed at making sure our customers love every aspect of Looker, from our products and technologies to our ease of doing business and our support. We are looking for curiously brilliant individuals to join our team as we reinvent data analytics. Get data-driven and see yourself at Looker.WHAT WE'VE GOT GOING ONThe CSE works directly with customers, consulting with them to help drive Looker deployment, adoption, and analytics strategies. We are relentlessly focused on creating value and improving our customers’ satisfaction by identifying what they need to be successful - and delivering it. Beyond normal customer engagements this can include leading projects, building tools, and implementing custom solutions to help the Looker platform deliver maximum value. The Looker CSE proactively identifies issues impacting the customer base and works with other teams to address them. You will contribute resources to help scale our support of Looker customers using data, technology, and automation. Finally, you will have the opportunity to contribute to internal analytics projects related to Looker customer and user data.WHAT WE NEED YOU TO DO Design and implement tools, programs, and technology that proactively addresses common issues impacting Looker customer's successSet and manage customer expectations, negotiate appropriate resolutions to issues, and provide technical solutions in a professional manner within agreed timeframesTeach technical and analytics concepts to a variety of audiences including developers, data architects, business users, and IT professionalsAssist Looker’s customer facing teams in investigating and responding to technical requests from customers.Communicate product feedback from customers to improve user experienceBuild productive relationships internally and externally, fostering teamwork by keeping colleagues updated on activitiesWHAT YOU BRING TO LOOKER Bachelor's degree in a technical field and 5+ years of a relevant hands-on customer facing technical roleHands on experience with SQL, data warehousing and analytics toolsExperience with sysops, command line, scripting & general networking a plusSelf-directed with the ability to manage simultaneous, complex engagements with minimal supervisionExcellent critical thinking and analytical skillsStellar listening, speaking, presentation and writing skillsAbility to travel up to 10%A LITTLE MORE ABOUT LOOKERLooker is a complete data platform that offers data analytics and business insights to every department, and easily integrates into applications to deliver data directly into the decision-making process. The company is powering data-driven cultures at more than 1200 industry-leading and innovative companies such as Sony, Amazon, The Economist, Spotify, Etsy, Lyft and Kickstarter. The company is headquartered in Santa Cruz, California, with offices in San Francisco, New York, Chicago, Boulder, London and Dublin, Ireland. Investors include CapitalG, Kleiner Perkins Caufield & Byers, Meritech Capital Partners, Redpoint Ventures, First Round Capital, Sapphire Ventures and Goldman Sachs. For more information, connect with us on LinkedIn, on Twitter, Facebook, G+ and YouTube.Looker aspires to be a workplace that is not only free of discrimination, but one that fosters inclusion and belonging. We strongly believe that diversity of experience, perspective, and background lead to a better environment for our employees and a better product for our users. We encourage like-minded individuals to join us in changing the way businesses use data."}