{"jobID": "2830419909", "jobLocation": "New_York_NY", "jobTitle": "Intern, Data Science - Engineering - Part-Time", "companyRating": "3.1", "companyInfo": {"Website": "www.automatic.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Metromile"}, "estimatedSalary": "59000", "jobDescription": " Temporary  Position Type: Internship  Session: Fall 2018 (September 17 - December 7, 2018)  Location: New York, NY Position Summary: SiriusXM interns don't just make coffee, they're on-air, on projects and making valuable contributions to SiriusXM. Join our internship program and learn about the radio world and get hands-on experience in your field of study.  SiriusXM is looking for an intern to assist in data extraction (ETL), data analysis and data programing activities. This intern will join us for Theory Thursdays where we discuss theories and how they apply to computer science and machine learning. Some days, we simply prove TCS, Maths or STAT theorems. Duties and Responsibilities:Work closely with a senior data scientist to be mentored in machine learning and data analysis.Conduct data analysis, and build and test statistical models, such as classification algorithms and clustering models.Explore first-party and third-party data to generate insights for product and business leaders.Present and interpret analytics findings and participate actively in discussions of results.Supervisory Responsibilities:None.Minimum Qualifications:You must be 18 years of age or older.Must be enrolled in a U.S. based college, university or trade school to qualify. Students who have completed at least two years of college are preferred.Requirements and General Skills:Good project management and planning skills.Good personnel management skills.Interpersonal skills and ability to interact and work with staff at all levels.Excellent written and oral communication skills.Ability to pay attention to details.Ability to handle multiple tasks in a fast-paced environment.Willingness to take initiative and to follow through on projects.Must have legal right to work in the U.S.Technical Skills:Familiarity with basic data analysis and data wrangling.Thorough knowledge of MS-Office Suite (Word, Excel, PowerPoint, Access). PowerPoint is a must.Familiarity with R or Python. R is preferred.Experience with relational databases and SQL. SQL is a must.Enthusiasm to learn how to turn theoretical notions into code.Some knowledge of the following is preferred:Hadoop and Spark,Statistics, econometrics, or machine learning and experience applying that knowledge to data,ggplot2 ad Tableau. Please note that all SiriusXM Internships are paid.  As an EEO/Affirmative Action Employer all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status.  The requirements and duties described above may be modified or waived by the Company in its sole discretion without notice."}