{"jobID": "2815610518", "jobLocation": "New_York_NY", "jobTitle": "Paralegal Finance and Restructuring NYC", "companyRating": null, "companyInfo": {"Website": "www.kslaw.com", "Headquarters": "Atlanta, GA", "Size": "1001 to 5000 employees", "Founded": " 1885", "Type": " Private Practice / Firm", "Industry": " Accounting & Legal", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Alston & Bird, Vinson & Elkins, Gibson Dunn & Crutcher"}, "estimatedSalary": null, "jobDescription": "Paralegal Finance and Restructuring NYC  The paralegal in this position will assist attorneys in the finance/restructuring practice with a particular focus on the New York Corporate, Finance & Investments practice group. The person in this role must be able to work independently and efficiently in an environment that is heavily computer based, perform under strict time constraints, follow established client and team guidelines for case and matter management, maintain positive contact with clients and observe confidentiality of client matters.  Candidates will have the following responsibilities: Coordinate closing logistics; prepare closing index; oversee execution of documents and recordation of appropriate documents.Obtaining pleadings from all courts.Reviewing local rules for each court where cases are pending and verifying that all documents conform.Drafting pleading and discovery documents and assist lawyers in responding to pleadings.Working knowledge of bankruptcy code and rules for document review and preparation.Prepare and file UCCs with consideration for jurisdictional nuances.Order lien searches with firm approved vendors and prepare lien summary to include UCCs and court filings.Conduct intellectual property lien searches (Patents, Trademarks, and Copyrights) with the USPTO and Copyright Office; prepare intellectual property lien summary; file intellectual property security agreements.Draft post-closing memos according to client specifications.Track and update post-closing memos for each deal on a weekly basis.Prepare signature packets for multiple loan documents.Review loan documents prepared by co-counsel and provide comments and redlines to deal team.Ability to adhere to client specific policies and procedures.Draft legal instruments and corporate governance documents.Coordinate post-closing lien searches with vendor.Maintain positive relationships with firm attorneys, co-counsel, clients and vendors.Prepare and distribute paper/electronic closing sets and CDs.Research corporate filing practices.Assist with various licensure applications.Knowledge with Vehicle Titles and Applications.Process and track vendor invoices utilizing Chrome River.Keep accurate time records.Ability to work on multiple matters simultaneously and multi-task. Requirements: Bachelor's degree with a 3.5 GPA.At least three years of transactional law firm experience.Proficiency in MS Office Suite, Adobe Acrobat Professional, DTE Axiom, iRedline, DeltaView, iManage (DeskSite).Positive attitude and strong, concise communication and writing skills. Ability to organize, prioritize, and complete tasks under strict time constraints.Open and willing to continuously learn new concepts.Committed team player as well as a motivated self-starter.Able to work overtime as needed (including weekends and holidays), often without advance notice.King & Spalding LLP (K&S;) is committed to providing equal employment opportunity to all applicants and employees in full compliance with all state, federal, and local laws prohibiting discrimination on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, genetic information, age, disability or any other status protected by applicable law."}