{"jobID": "2821694299", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Intern, Discovery Biology", "companyRating": null, "companyInfo": {"Website": "www.secondgenome.com", "Headquarters": "South San Francisco, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Hi, we’re Second Genome. We are a fast-paced and innovative biotechnology company developing tomorrow’s breakthrough therapeutics at the interface of complex microbial communities and their host environments. We are leaders in microbiome science, host-bacterial interactions, genomics, and metagenomics. We love fresh approaches, we value process validation, and we welcome peer review. And we’re looking for a Discovery Biology Intern. We are seeking a highly motivated graduate-level discovery biology intern with a passion for new challenges. This intern will have the opportunity to contribute to the development of single-cell RNA-sequencing (scRNA-seq) protocols, in order to investigate the host response to microbial-derived bioactive molecules. We value team players who are eager and willing to learn and develop new technologies. Responsibilities and DutiesOptimize cell dissociation protocols to improve cell viability and minimize aggregation.Optimize preparation of cells to maintain unbiased gene expression.Assist in performing library prep and sequencing of scRNA-seq libraries.Work and communicate effectively within a highly collaborative team.Qualifications and SkillsMaster’s degree and/or pursuing a Ph.D. in biology, molecular biology, cell biology, developmental biology, immunology, or cancer biology.General knowledge of molecular biology.Lab skills including several of the following: primary cell culture, culture of complex cell types, organ dissection, RNA purification, and/or qPCR.Strong problem solving and troubleshooting skills.Strong interpersonal, communication, and presentation skills.Bonus QualificationsExperience dissociating complex tissues into single-cells.Experience designing qPCR assays.General knowledge of next generation sequencing technologies, specifically scRNA-seq.What’s it like to intern at Second Genome? In addition to our ground-breaking technology, we believe in embodying an authentically joyful workplace. Our Core Values: We are InnovatorsWe are Driven to ActionWe are Great ColleaguesWe Work SmartWe Respect the Data We understand and appreciate the hard work and emotional investment on the part of all our team members - it takes a lot to be a contributor at a startup that’s leading its industry. We make it a priority to mindfully design our work environment and employee offerings with our unique and dedicated team in mind. Fully stocked kitchen with sandwich materials, organic snacks, high-end coffee and other beverages.Our WellBiome health and wellness program: open standing desks, and weekly boot camp and yoga classes on-site.Friendly and open office environment with great colleagues and a culture that drives innovation, passion, collaboration, and fun!A picture is worth a thousand words. Check out our Instagram @secondgenomelife for a glimpse into our unique team culture. Second Genome provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Second Genome complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training."}