{"jobID": "2794966490", "jobLocation": "Santa_Clara_CA", "jobTitle": "Senior System Software Engineer - TEGRA Solutions Engineering Team Senior Embedded Software Engineer - Tegra Solutions Engineering", "companyRating": "4.3", "companyInfo": {"Website": "www.nvidia.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1993", "Type": " Company - Public (NVDA) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "146000", "jobDescription": " NVIDIA’s invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined modern computer graphics, and revolutionized parallel computing. More recently, GPU deep learning ignited modern AI — the next era of computing — with the GPU acting as the brain of computers, robots, and self-driving cars that can perceive and understand the world. Today, we are increasingly known as “the AI computing company.”  We're looking to grow our company, and build our teams with the smartest people in the world. Join us at the forefront of the technological advancement.  Are you dedicated, upbeat and dynamic with excellent analytical ability? Are you a software engineer passionate and highly motivated about solving complex problems? If so, you may be a perfect fit for our group.  We are now hiring a Senior Embedded Software Engineer for the Tegra Solutions Engineering team to work on advanced driving platform architectures. What you’ll be doing:You will collaborate with software engineers, hardware and arch teams to design, develop, test and optimize software on NVIDIA's self-driving platformCraft and maintain software features for core technologies involving HAL, scheduling and thread models to see them through the full software development lifecycle, from concept to productEngage directly with customers and support teams to develop and improve their world-class productsPerformance optimize various SW components in the driving platform stackCommunicate effectively with various teams throughout the company, as well as customers and partnersWhat we need to see:MS in Computer Science, Computer Engineering or closely related field with 5+ years of experience as an embedded engineerExpert programmer in C, C++ and PythonExperience with GPU computing using CUDAGood experience developing user mode system SW and drivers for HW acceleratorsWorked with source control systems (git, Perforce) and tools such as JAMA and JIRADeep understanding of operating system concepts, specifically embedded application design and implementation, and developing and debugging multithreaded/distributed applicationsExtensive experience with Linux, Android, or Real-time operating systemsEase of adapting to new technologies and platformsWays to stand out from the crowd:Experience working on GPU technology, imaging, camera, and multimediaFamiliarity with AI, Deep Learning and/or Computer Vision.Knowledge of real-time data processing, networking and communicationTrack record integrating and delivering functional and performance real-time and/or distributed systems NVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression , sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law."}