{"jobID": "2692504818", "jobLocation": "New_York_NY", "jobTitle": "UAS Auditor", "companyRating": null, "companyInfo": {"Website": "www.gnyservices.com", "Headquarters": "Brooklyn, NY", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " White Glove Placement, Premier Home Health Care Services"}, "estimatedSalary": null, "jobDescription": "UAS Auditor / ReviewerGreater New York Nursing Services, a vibrant home healthcare agency, actively seeks experienced Uniform Assessment System (UAS) Auditors for rewarding and flexible Full-Time, Part-Time or Per Diem positions in the five boroughs, as well as Nassau, Suffolk, Westchester, and Upstate Counties.  The UAS RN Auditor /Reviewer is responsible to review the assessments performed by the Field Assessors, ensuring quality and accuracy on documentation and compliance with State /program standards Review UAS and required documentation according to the plan requirements to ensure quality and accuracyCompare UAS and Tasking Tools/Workbooks to ensure correlationProvide Field Assessors with feedback on their documentation as well as guide them towards documentation improvementUAS Auditor Requirements:Required:Active and unrestricted NYS RN licenseExpertise/proficiency level with UAS assessmentsMinimum 3-5 years clinical/supervisory experience and knowledge of MLTC regulatory requirementsExcellent written and verbal communication skillsProficiency in the use of Microsoft Office toolsExcellent Patient Care and Assessment SkillsStrong problem-solving abilityPreferred: Knowledge of current community health practices for the frail adult population, behavioral health and cognitively impaired seniors and disabled including knowledge of physical health, aging and loss, appropriate support services in the community, frequently used medications and correlation with ICD 10 DX.CCM certificationRequired experience:About Us:Greater New York Nursing Services is a comprehensive care management company serving healthcare partners and patient communities throughout the NYC area. Giving care from a strong position of skill, knowledge and specialty we keep patients safe, dignified, comfortable and better able to face longevity. We take great care to build and maintain the finest network of truly skilled health caregivers. Our focus is on the terminally ill population, and Greater NY Nursing has garnered a stellar reputation for providing at-home care with a level of skill usually reserved for the nations leading hospitals. Our hand-selected RNs and LPNs manage a range of care programs and services that make the difference between life and strife. By always putting patient needs first, we built a care model that lasts. www.gnyservices.com If you believe you are a qualified candidate for our UAS Auditor role, apply today for immediate consideration! We are an equal opportunity employer M/F/D/V"}