{"jobID": "2608853264", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist - Economics & Legal", "companyRating": "4.3", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "141000", "jobDescription": " About Uber Were changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now were a part of the logistical fabric of more than 600 cities around the world. Whether its a ride, a sandwich, or a package, we use technology to give people what they want, when they want it. For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer. And thats just what were doing today. Were thinking about the future, too. With teams working on autonomous trucking and self-driving cars, were in for the long haul. Were reimagining how people and things move from one place to the next. About the TeamThis data science and economics team works with the Legal team on Ubers most important legal issues. We work with the Legal team to develop analyses and argumentsbased on data, economics, and the lawto defend Uber against risks in litigation and provide regulators answers to their requests for information.About this RoleData Scientists on the this team work at the intersection of data science, economics, and the law. The data analyst is responsible for developing a deep understanding of Uber's databases and their quirks as well as assembling, analyzing, and telling compelling stories with data. What You'll DoDescribe and explain Ubers data to lawyers, regulators, and other key stakeholdersGenerate ideas for analyses to advance Ubers legal goalsDesign queries of our databases that can be replicated to satisfy Ubers legal data reporting requirementsCollaborate with cross-functional teams across disciplines such as business development and engineeringWhat You'll Need2-4 years of experience and a bachelors or masters degree in Math, Economics, Statistics, Engineering, Computer Science, or other quantitative field preferredStrong data skills and a shown ability to use tools such as SQL, Python, and R to work efficiently at scaleBalance attention to detail with swift execution, including the ability to deliver on tight timelinesHustle is critical, as moving quickly and executing to allow for continual iteration is a strength of our teamSelf-motivated with the ability to work independentlyStrong communication and organization skillsJ.D. or experience working with a legal group is a plusInterest in Ubers global legal and policy issuesIdeally you are not only fluent in the language of data but are also an adept written and verbal communicator. You should have the ability to get through to external parties and help them understand the nuances of our arguments. Fluency in English, both oral and written, is critical."}