{"jobID": "2739509361", "jobLocation": "San_Francisco_CA", "jobTitle": "Lead Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.life360.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "94000", "jobDescription": "About Us:With over 10 million active users and $90 million in venture funding, Life360 is the world’s largest mobile app for families. Today, we are very focused on location sharing and safety, but our mission is to become the must-have Family Membership that gives families peace of mind anytime and anywhere.  Our team is focused on building technology that helps families feel safe and together even when they are outside of the home and apart. From personalized location-based alerts that help make daily coordination easier, to advanced sensor tech that can detect if you are in a car crash and automatically send you an ambulance, we are leveraging smartphones to their fullest extent to reinvent how families get through the day.  You will be joining Life360 at a key moment in our history. We doubled active users and tripled revenue in 2017, and we are scaling our team to accommodate this rapid growth. We currently have 75 full-time employees, with offices in San Francisco, Las Vegas, and San Diego.About the Job:This role will play a crucial part in driving smarter business decisions as we mature from startup to growth-stage company. As an early member of the Analytics team, you’ll make an immediate impact by partnering with cross-functional stakeholders to improve how we use data to deliver strategic value. We’re looking for someone to take our reporting platform to the next level by developing how we monitor KPI’s, extract insights, and predict performance to guide which actions to take. After nailing the business basics, your focus will expand to consumer monetization initiatives that apply premium subscription analysis and LTV modeling that create value for business.Responsibilities:Own business analytics and reporting platform that will help provide smarter business growth for Life360. This involves designing reporting pipelines, implementing processes, and developing visualizations that help the entire company make smarter, faster decisions as we scale.Create reports and build dashboards to maintain a strong pulse on the increasing amount of initiatives.Work with engineering to design and implement ETL pipelines to streamline processes for data reporting and communication.Work with leadership to define KPI’s and develop standards for tracking, monitoring, forecasting, and reporting actionable takeaways.Routinely analyze performance trends to communicate insights and recommendations to all levels of the organization.Use analytical frameworks to understand premium subscription lifecycles and develop LTV models that shape user and monetization growth strategies.Support various ad hoc projects that leverage data to drive organizational growth.Leverage tools like SQL, Python, Spark, & other software to drive effective analytics.Qualifications:5+ years in data analytics/science role (or equivalent) with a focus on business.BS/Masters in math, economics, statistics, CS, engineering, or other technical field.Strong reporting, visualization, and dashboard creation, and KPI management skills.Advanced SQL experience with manipulating large datasets (both structured and unstructured) from various data sources.Experience in scripting programming language for data analysis (e.g. Python).Building and/or planning automated ETL pipelines.Experience with premium subscriptions, user acquisition, and LTV modeling.Strong data-communication (written and verbal) skills with great attention to detail.Experience with mobile app and/or web analytics preferred.Managing and leveraging various analytics tools to make business decisions.Experience with statistical analysis and time series predictive modeling preferred.Experience with designing, executing, and evaluating AB Tests preferred.Creative problem solving, self-motivated attitude, and endless curiosity are a must!Perks:Fridays are Work From Home days at Life360Competitive pay and benefitsFree snacks, drinks (three ways to brew your favorite cup of coffee), and food in the officeCatered lunches throughout the weekHealth, dental and vision insurance plans401k plan$200/month Quality of Life perkA great office with plenty of light in the heart of the SOMA district in beautiful San FranciscoWhatever makes you stronger makes us stronger. We buy you the things you need to improve yourself and get your job done."}