{"jobID": "2830043254", "jobLocation": "Burlington_MA", "jobTitle": "Clinical Data Analyst II", "companyRating": "3.6", "companyInfo": {"Website": "www.abbott.com", "Headquarters": "Abbott Park, IL", "Size": "10000+ employees", "Founded": " 1888", "Type": " Company - Public (ABT) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "102000", "jobDescription": " At Abbott, we're committed to helping people live their best possible life through the power of health. For more than 125 years, we've brought new products and technologies to the world -- in nutrition, diagnostics, medical devices and branded generic pharmaceuticals -- that create more possibilities for more people at all stages of life. Today, 99,000 of us are working to help people live not just longer, but better, in the more than 150 countries we serve. JOB DESCRIPTION:Job Summary: Working under general supervision, is responsible for all aspects of data management activities in support of assigned clinical studies. These activities help to ensure high quality data is achieved in support of analysis for regulatory submissions, safety monitoring and publications. Ensures that Good Clinical Practices (GCP), Good Clinical Data Management Practices (GCDMP) and established processes are followed. Identifies and routinely uses the most effective, cost efficient and best business practices to execute processes; continually evaluates their effectiveness and appropriateness. Exercises judgment in planning, organizing and performing work; monitors performance and reports status within area of responsibility. Ensures that quality of services meets internal and external customer requirements. Job Duties:Performs all data management activities for assigned studies, as appropriateProtocol and Statistical Analysis Plan (SAP) review and inputCase Report Form (CRF) development and maintenanceEdit Check specifications development and maintenanceData Management Plan development and maintenanceData Quality Checks and discrepancy managementAnalyzes data, identifies trends; prepares data tables for reportsDatabase setup testing and Edit Check programming testingExternal data handlingDevice reconciliation and tracking for investigational productParticipate in Post Market Surveillance reporting as appropriateAdditional study specific activitiesEnsures that all data management activities for assigned studies are completed on time and with high quality or escalates as appropriateCommunicates well with peers, study teams and management as appropriate to support studies and goalsParticipates in efforts to improve Data Management processes, as needed/assignedRepresents the Data Management group at study team meetingsMay represent the Data Management group on cross-functional task forcesMay train and mentor other Clinical Data Associates (CDAs) and Clinical Data Coordinators (CDCs) on certain tasksApplies best practices and established standardsServes as a liaison between the study team and clinical data operationsIs a Subject Matter Expert (SME) in one or more areas within Data ManagementHas a general understanding of the clinical trial process and regulations that apply, engages in relevant professional associations or societies, and seeks continuing education about SJM devices and therapies.Communicates and collaborates with all levels of employees, customers, contractors, and vendors.Provides input to departmental Standard Operating Procedures (SOPs), Departmental Work Instruction (DWIs), and guidelines.Support all Company initiatives as identified by management and in support of Quality Management Systems (QMS), Environmental Management Systems (EMS), and other regulatory requirements.Complies with U.S. Food and Drug Administration (FDA) regulations, International Conference on Harmonisation (ICH), ISO 14155, other regulatory requirements, applicable company policies, operating procedures and processes.Performs other related duties and responsibilities, on occasion, as assigned.Qualifications:Bachelor's Degree in Computer Science, Health Sciences, Informatics, related field, or equivalent.Typically a minimum of four plus years' experience working in a clinical research environment, experience to include a good understanding of clinical data management processes.Good organizational and project management skills, as well as attention to detail.Highly skilled with MS Office, especially Excel, Word, Publisher and Powerpoint.Strong ability to work with Clinical Data Management Systems.Understands databases; good technical skills in querying and analyzing data (SQL, Oracle, SAS or equivalent).Certified Clinical Data Manager (CCDM) preferred.Ability to work in a highly matrixed and geographically diverse business environment.Ability to work within a team and as an individual contributor in a fast-paced, changing environment.Ability to leverage and/or engage others to accomplish projects.Strong verbal and writtenMultitasks, prioritizes and meets deadlines in timely manner.Ability to travel approximately 10%.Ability to maintain regular and predictable attendance. JOB FAMILY:Clinical Affairs / Statistics  DIVISION:MD Medical Devices  LOCATION:United States>Massachusetts : 168 Middlesex Turnpike ADDITIONAL LOCATIONS: WORK SHIFT:Standard  TRAVEL:Yes, 10 % of the Time  MEDICAL SURVEILLANCE:Not Applicable  SIGNIFICANT WORK ACTIVITIES:Continuous sitting for prolonged periods (more than 2 consecutive hours in an 8 hour day), Keyboard use (greater or equal to 50% of the workday)  Abbott is an Equal Opportunity Employer of Minorities/Women/Individuals with Disabilities/Protected Veterans.  EEO is the Law link - English: http://webstorage.abbott.com/common/External/EEO_English.pdf  EEO is the Law link - Espanol: http://webstorage.abbott.com/common/External/EEO_Spanish.pdf"}