{"jobID": "1987776084", "jobLocation": "New_York_NY", "jobTitle": "Primary Care Physician Internal Medicine/Family Practice", "companyRating": null, "companyInfo": {"Website": "www.pagny.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Overview Physician Affiliate Group of New York (PAGNY) is comprised of nearly 4,000 physicians and healthcare professionals who provide services to NYC Health + Hospitals, the largest public health system in the United States. Our practitioners are highly skilled professionals with outstanding credentials who deliver the highest level of quality healthcare to patients throughout New York City. Equal Employment Opportunity Employer M/F/D/V. Lincoln Medical & Mental Health Center, located just 15 minutes from NYC, is an acute care teaching hospital academically affiliated with Weill-Cornell Medical College. Dedicated to providing high quality patient care to a diverse community, Lincoln Hospital is a NYS designated Level I Trauma and Stroke Center and has Centers of Excellence in all medical specialties including its awarding winning Cancer and Breast Centers.  Lincoln Medical Center is part of the Generations+/Northern Manhattan Health Network and the network's Bronx Diagnostic and Treatment Centers, Morrisania and Segundo Ruiz Belvis, are affiliated specifically with Lincoln. Community residents who live in the Bronx communities of Highbridge, Hunts Point and Mott Haven can receive comprehensive quality healthcare services at both Morrisania and Segundo Ruiz Belvis. Responsibilities Under general direction performs professional medical work of ordinary difficulty in his field of specialty. Examines patients, orders or performs appropriate diagnostic tests, formulates diagnosis, directs or performs appropriate therapeutic treatment, and counsels patients. Consults with other members of the professional staff, gives guidance and direction to the house staff and to her members of the health care team. Participates in the teaching or house staff, in staff conference, and in research projects as directed; performs related work as required.  Previous Internal Medicine provider was carrying 89 HIV patients in addition to Monday through Friday with some late nights and Saturdays. *Outpatient care only**QualificationsBoard Certified in Internal Medicine or Family PracticeHIV Certification preferred but will send candidate for HIV training if needed.Graduate from approved medical schoolLicensed to practice in New York StateSpanish speaking preferred"}