{"jobID": "2761788098", "jobLocation": "New_York_NY", "jobTitle": "Editorial Intern (Summer/Fall)", "companyRating": null, "companyInfo": {"Website": "www.artsy.net", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " This role will have an equal focus on journalistic news writing and fact checking. The ideal candidate is a nimble and confident writer who excels at communicating clearly and concisely. She or he has experience writing in a journalistic capacity, is obsessed with meeting deadlines, and is excited about working in a fast paced online publishing environment. The ideal candidate is also obsessed with details and the accuracy of facts in both stories of other writers and their own writing. We want an intern who understands that the building blocks of becoming a good journalist are founding on the fundamental skill of fact-checking.  Our desired candidate will have a background in journalism, experience working at an arts or culture publication, and/or a background in art history. You are passionate about online publishing, spend most of your time thinking about the possibilities of the written word online, and feel very comfortable undertaking extensive independent research and fact-checking tasks. Additionally, you should have an expressed interest in contemporary art and art history with a strong desire to learn more.  Lastly, you are a strategic thinker, a proactive problem-solver, a confident and thoughtful writer, and a strong collaborator who is excited be part of a dynamic, close-knit editorial team, and you get a thrill out of working in a fast-paced environment.Key Responsibilities: This role will be focused equally on journalistic writing in the format of short, concise news reporting, as well on efficient, thorough, and diligent fact checking.You must be able to write clean, copy in shortform news format and comfortable filing multiple pieces a day on tight deadlines.You should have experience fact-checking the work of other writers and a firm understanding of how to meticulously confirm facts.You should have experience working in a newsroom setting with multiple editors and be comfortable structuring and pitching longer, reported stories. You must have experience working in a fast-paced environment and juggling multiple tasks at a time with a natural ability for prioritization.You understand the importance of being a clear and diplomatic communicator in a newsroom and that communication is essential to a successful publication.Candidate Qualifications:The ideal candidate is a nimble and confident writer who excels at communicating clearly and concisely.Has experience writing in a journalistic capacity, is obsessed with meeting deadlines, and is excited about working in a fast paced online publishing environment.You are comfortable handling long-term and large-scale research projects, as well as have thorough due diligence when it comes to fact-checking.Experience confirming veracity of both their own reporting and the reporting of others with thoroughness and speed. To ApplyThis is a paid six month internship and starts immediately in our Manhattan offices. To apply, please submit your resumé, a cover letter, and three writing samples published through a digital publication here.ABOUT ARTSYArtsy is a global platform for collecting and discovering art.  We think of Artsy less as a business with employees, and more as a community of people who have chosen to work together towards a common goal, and who share a common set of values.  Artsy empowers a global audience to learn about, discover, and collect art. We partner with leading museums, international galleries, auction houses, and art fairs to create the world’s largest marketplace for art, enabling the growth of the entire art market by effectively connecting supply and demand at a global scale.WHY ARTSYAt Artsy there are no specific work hours or policies, no pointless bureaucracy. We only care that you achieve inspiring results and are a joy to work with. This means you must be highly energetic, enthusiastic, and resourceful—no problem is too big or too small for you to tackle. You will enjoy both responsibility and autonomy in your work.WORKING AT ARTSYArtsy has five core values that will inform your experience at Artsy. Art x Science: We believe in uniting empathy with logic, emotion with data, and intuition with research in everything we do. Whether in business strategy or design, culture or code, we seek the magic that happens when the often separate worlds of art and science come together. People are Paramount: We spend extraordinary energy finding the best person for a job—and once found, we give them the trust and autonomy to be CEO of their role. We avoid pointless bureaucracy and prefer to empower people with information rather than limit them with process. Quality Worthy of Art: We aim to create an experience worthy of all the world’s art and so hold ourselves to the highest standards in all our work. We believe that the best long term quality comes from rapid shipping, iterating, and learning as we go. Positive Energy: We know positivity and optimism benefit our work, and we harness positive energy as a vehicle towards greater awareness, growth, and collaboration. We believe in cultivating a positive relationship to art as opposed to one based on exclusivity or scarcity. Openness: We believe in being open with each other and the world—whether in open-sourcing our code, sharing feedback, or building a diverse and inclusive work culture. We believe in bringing our full selves to work and manifesting an open world where everyone has access to art. Artsy is an equal opportunity employer. We value a diverse workforce and an inclusive culture. We encourage applications from all qualified individuals without regard to race, color, religion, gender, sexual orientation, gender identity or expression, age, national origin, marital status, disability, and veteran status."}