{"jobID": "2709671869", "jobLocation": "Concord_MA", "jobTitle": "Principal Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.bigr.io", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Principal Data Scientist  USA and Canada (remote, minimal travel required)  BigR.io is a technology consulting firm empowering data to drive innovation and advanced analytics. We specialize in cutting-edge Big Data, Machine Learning, and Custom Software strategy, analysis, architecture, and implementation solutions. We are an elite group with MIT roots, shining when tasked with complex missions. Whether its assembling mounds of data from a variety of sources, surfacing intelligence with Deep Learning, or building high-volume, highly-available systems, we consistently deliver.  With extensive domain knowledge, BigR.ios architects, engineers, and scientists design and build best-in-class solutions across a variety of verticals. This diverse industry exposure and our constant run-in with cutting-edge technology equips us with invaluable tools, strategies, and techniques. Our knowledge and horsepower bring innovative, cost-conscious, and extensible results to complex business challenges. We are creating a community of thought leadership and a culture that strives to learn, embrace, and invent new approaches to complex problems. Collaboration amongst like-minded individuals is contagious and we thrive on pushing the edge of the pattern.  About the job  Do you view the science of Machine Learning as a passion instead of just a job? If so, join our team of talented, high-caliber Data Scientists, Architects, and Engineers and work on the cutting-edge applications of Machine Learning. You will use your excellent knowledge of data structures, algorithms, and modern OOP, and your solid understanding of modern statistical data analysis techniques (such as Bayesian inference, Hidden Markov, and MCMC) to work on a myriad of real-world noisy datasets and NLP-based topic modeling and topic coherence.  You have: An MS or PhD in Computer Science, Statistics, Physics, or any related Engineering field.Worked with image segmentation: Image Knowledge Graphs (IKGs).Excellent knowledge of one or more of the following: Machine Learning, Signal Processing, Statistical Modeling, Time-Series Analysis, Optimization.Good working knowledge of Java/Scala, Python, Matlab, and/or R.Familiarity with Relational and Non-Relational databases (NoSQL).Familiarity with cloud computing and big data technologies (Hadoop, Hive, Spark, etc). Your Experience: Designed, built, and deployed Machine Learning algorithms for advanced analytics.Performed exploratory data analyses and visualizations on multivariate data sets.Worked with one of the well known neural network libraries such as TensorFlow, Theano, or Caffe.Experience with NLP and unstructured data parsing."}