{"jobID": "2794511798", "jobLocation": "Santa_Clara_CA", "jobTitle": "Senior Technical Accountant – Corporate Accounting – Global GL & Consolidation", "companyRating": null, "companyInfo": {"Website": "www.marvell.com", "Headquarters": "Santa Clara, CA", "Size": "1001 to 5000 employees", "Founded": " 1995", "Type": " Company - Public (MRVL) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Marvell is a multi-billion dollar publicly traded global semiconductor company based in Santa Clara, CA, with operations around the world. The Company has been growing by leaps and bounds with over $2B in annual revenues, $1.6B of cash on hand, and no debt – a very healthy balance sheet! Marvell has been going through substantial organizational change over the past 18 months. The new leadership team and Board have heightened focus and emphasis on embracing and encouraging organizational change to further the accounting organization’s laser focused goal – timely and accurate financial reporting, with effective processes and controls to support this. Most large public companies do not embrace or support change because they’ve been around a long time and continue to plod along with the same old routine, even if the routines, processes, controls, and systems are not optimal, or even good for the accounting organization. Marvell is the opposite – we want to hire smart, creative, energetic people who can help bring accounting best practices to the business.Are you ready to join an organization where you have the opportunity to have a meaningful financial role, and know that you will be able to directly see the value you bring and positive impact you can make on a day to day basis? Main Purpose of the RoleAs a key member of the Corporate Accounting team, the Senior Technical Accountant will be working in a fast-paced, dynamic environment building relationships within the corporate accounting team in the U.S. and worldwide, and with the larger organization (e.g. Treasury, FP&A;, SEC Reporting, Corporate Development, Internal Audit, etc.). The Senior Technical Accountant will be responsible for leading the monthly worldwide close and consolidation, including ensuring corporate accounting is technically accurate and complete (includes significant accrual estimates), ensuring worldwide consolidations are prepared accurately and timely, and ensuring complex accounting transactions are recorded accurately and timely in the general ledger in accordance with US GAAP. This is an exciting role with vast educational opportunities. It has a good mix of technical accounting combined with operational accounting exposure, and provides great experience working directly with the senior leadership team (CAO, CFO, CEO).Main Areas of ResponsibilityResponsible for performing the monthly corporate worldwide financial close activities, such as operation of the general ledger system, prepare journal entries related to significant higher risk accounts, create and upload journal entries, and perform month-end close work and account reconciliations for various accounts.Assess technical accounting issues for appropriate financial treatment in the global financial statements.Review reconciliations and analysis prepared by peers to ensure compliance with US GAAP and the Company’s policies. Perform financial statements analytics and provide relevant explanations for fluctuations.Make practical recommendations to improve effectiveness and efficiency of the monthly close process.Assist in the gathering and reviewing of consolidated monthly, quarterly and annual financial information for internal and external reporting, audits, reviews and tax compliance.Prepare financial reporting information for monthly results review meeting with the CFO and CEO. Prepare quarterly review and annual audit schedules. Interface with external auditors to ensure audit requests are delivered timely.Develop and maintain excellent positive working relationship with the external auditors.Assist in the integration process of acquired companies.Responsible for SOX compliance efforts, including executing internal controls, and completing and maintaining process documentation to ensure SOX 404 compliance for his/her functional area of responsibility.Assist in the development and documentation of business processes and accounting policies to maintain and strengthen global internal controls.Requirements3-7 years of accounting experience in a multi-national publicly traded company.Experience with Oracle 11i or R12 preferred.Accounting degree. Experience with technology sector or “Big 4” public accounting experience preferred. CPA preferred.Proficiency with Microsoft Excel, Word, and PowerPoint. A team player who is an effective oral and written communicator. Written analyses and presentations are clear, concise, and reflect polish and precision.A go-getter with a positive can-do attitude, sense of humor, and a roll-up-my-sleeves mentality: no ivory tower candidates need apply.Possess energy and passion for your work and a genuine interest in accounting.Your ultimate priority is to help ensure that the organization has accurate and timely accounting and financial reporting. Accurate, thorough, with strong attention to detail and a strong sense of ownership. Someone who consistently goes the extra mile.A problem solver who is collaborative, proactive, responsive, and reliable.Agility to change and think on your feet.Creative person with strong interpersonal skills and ability to contribute to our culture. Takes a customer service oriented approach. Strong organizational skills."}