{"jobID": "2804425273", "jobLocation": "Boston_MA", "jobTitle": "Vice President of Programs", "companyRating": null, "companyInfo": {"Website": "www.stmaryscenterma.org", "Headquarters": "Dorchester, MA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "SUMMARY Serve as V.P. of Programs for the organization, with primary responsibility for: Oversight and supervision of programs and services, including program decision making resource allocation decisions and implementation of program priorities, policies, and plans;Providing quality assurance for all agency programs and services, including establishing standards for staff development and training and supervision of personnel in agency programs and services;Assuring a high quality, fair, and diverse environment for all clients and employees in the agency.PLANNINGCollaboratively with the Senior V.P. of Operations and Compliance, develop and implement programs' annual planning process and work with Director of Risk and Program Compliance, Clinical Liaison, and Program Directors (the Program Team) to establish priorities that meet the needs of our clients and the community;Participate with the Senior V.P. of Operations and Compliance in preparation of the annual management plan, with primary responsibility for programmatic and strategic planning;Participate with the Administrative Team, to create and implement policies and procedures for programs and staff to increase program quality, and otherwise grow and improve the work and program environments at the agency;Participate in long range agency planning activities as necessary and requested by the Senior V.P. of Operations and Compliance, President and Board of Trustees.DATA, RESEARCH, AND COMPLIANCEAssume primary responsibility for ensuring that program effectiveness is monitored and evaluated on an ongoing basis;Serve as primary liaison for all evaluation and monitoring of studies completed by external agencies;Serve as primary contact for contract and licensing matters in the agency;Work with program teams to identify and participate in studies, research, and program partnerships to further the quality and reach of existing programs;Manage all reporting and compliance relative to studies, research, and program partnerships;Ensure all programmatic contract obligations are met;Ensure all legal obligations incumbent on programs are met, including incident management;Responsible for coordinating program and service components of the agency with fiscal and administrative quality control and auditing activities;Responsible for the development and implementation of agency-wide Standards of Care;Identify and implement trainings necessary for contract compliance, Standards of Care, and professional growth of all program staff, delegating as appropriate;Identify and implement formal, informal, and technical tools and systems toward: increasing data collection, tracking outcomes, increasing program partnerships and program activities, managing research projects, reporting on contracts, and ensuring compliance in all program areas, delegating as appropriate.MANAGEMENT/ADMINISTRATIONOversee the design, integration, coordination, and implementation of the agency's programs and services on a daily basis;Participate as a member of the agency's Executive and Administrative Teams and serve as a member of the Programs Committee for the Board of Trustees;Work closely with Senior V.P. of Operations and Compliance to direct and coordinate the work of the agency's service departments and programs, establishing the work priorities and assuring timely implementation;Supervise the Director of Risk and Program Compliance and the Clinical Liaison;Supervises the Program Directors including day-to-day program activities, identifying training, compliance, and professional growth opportunities;Serve as part of on-call supervisory team, managing incidents as needed to further the health and safety of staff and program participants;Partner with Program Teams to investigate all incidents requiring self-reporting to completion, making recommendations for policy, program, and staffing changes as necessary to ensure ongoing compliance and safety;Implement and direct programmatic components of annual plan.FINANCIALWork closely with the Senior V.P. of Operations and Compliance and the V.P. of Finance & Administration to develop and implement sound budgets, fiscally responsible programmatic spending, and sound payroll practices within the Programs;Communicate pertinent program information to the Senior V.P. of Operations and Compliance and the V.P. of Finance and Administration that has either short or long term financial implications;Collaborate with the Program Team, Senior Vice Present of Operations and Compliance and the V.P. of Development & Communications to identify outcomes or resources that support the agency’s fundraising work, keeping in mind clinical standards of care and client confidentialityPERSONNEL/AFFIRMATIVE ACTION/HUMAN RESOURCESAssume primary responsibility for interviewing, hiring, supervision, evaluation, and firing staff of the agency's service departments and programs or the appropriate delegation of these responsibilities to other management or supervisory staff;With HR, ensure compliance with background check requirements for all staff;Ensure personnel policies and procedures of the agency's departments and programs are implemented in a consistent, fair, and equitable manner;Review performance evaluations for Program Directors;Manage performance issues of Program Directors and program staff to address non-clinical personnel matters, and work with HR around performance management;Consult with Clinical Liaison regarding complex clinical supervision matters.MINIMUM REQUIREMENTS/QUALIFICATIONSProfessional/AcademicMaster's degree in human service fieldMassachusetts licensed independent clinical social worker for more than five (5) yearsNecessary Skills/AbilitiesClinical supervision and management skills;Personnel supervision and management skills;Excellent skills modeling and maintaining boundaries with clients, program participants, and staff;Systems orientation and demonstrated willingness to implement new and technical systems and skills;Ten years supervisory/administrative experience;Three to five years clinical experience;Experience participating in risk management assessments and compliance work;Demonstrated aptitude for research and reporting;Ability to manage and resolve conflicts at all levels;Flexible multi-tasker, able and willing to manage work schedule to meet agency needs;Ability to work well under pressure and manage client crises;Culturally competent and able to model and train cultural competence in others;Sense of humor;Valid MA driver's license. Job Type: Full-time"}