{"jobID": "2630363465", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.rallyhealth.com", "Headquarters": "Washington, DC", "Size": "201 to 500 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "195000", "jobDescription": "Senior Data Scientist Rally Health is seeking a senior data scientist to support our flagship wellness product area. The successful candidate will work with diverse data to generate insights and develop data strategies that help our products evolve to better serve our customers and users. Rally products inform users about their healthcare options and help engage them in their own healthcare. In this role you will closely collaborate with product leader, leveraging data to measure and improve our offerings through metric development and instrumentation, data investigations, designing and interpreting experiments, exploratory research, and impact evaluation. The data scientist will also also advise the product team on likely data strategies for product improvement, such as machine learning driven product features. Skills:Great at proactively identifying opportunities and solving challenging business problems with a wide variety of data tools in a fast-paced, collaborative environment.Ability to use predictive analytics and classical modeling techniques for statistical inference and creation of data insights.Ability to work in a variety of data environments, e.g., Hadoop HDFS, SQL, Mongo, etc.Strong proficiency in SQL and some scripting language (Python, R, etc.)Strong focus on quality, using/developing process that ensures the integrity of our analytic outputExperience:3+ years direct work experience as a data scientist supporting product developmentHistory of successfully driving analytic projects and investigations independently, owning them from design to delivery of results.Demonstrated experience with data-driven product development (A/B testing, time series analysis, propensity modeling, etc.); you know when a bar chart is good enough and when its notStrong track record of solving business challenges with data using scripting languages (such as Python or R) and SQLNice to Have:Healthcare or wellness specific business knowledge and/or experience with behavioral and claims dataExperience using ML to solve business problemsExperience in a big data environments, like Hadoop or SparkAdvanced (post-baccalaureate) degree in a quantitative fieldRally Health is committed to ensuring that its workforce reflects Americas diverse population. Rally Health knows that such diversity will enrich us with the talent, energy, perspective and inspiration it needs to achieve its mission. Rally Health believes in a policy of equal employment and opportunity for all people based on merit and commitment to the principles of diversity. It is our policy to recruit, hire, train, and promote individuals in all job titles, and administer all programs, without regard to race, color, religion, national origin or ancestry, citizenship, sex, age, marital status, pregnancy, child birth or related medical conditions, personal appearance, sexual orientation, gender identity or expression, family responsibilities, genetic information, disability, matriculation, political affiliation, veteran status, union affiliation, or any other category protected by applicable federal, state or local laws.  Individuals with disabilities and veterans are encouraged to apply. Applicants who require an accommodation related to the application and/or review process should notify Talent Acquisition (recruiting@rallyhealth.com).Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records."}