{"jobID": "2429128058", "jobLocation": "San_Francisco_CA", "jobTitle": "CDL Training Program", "companyRating": null, "companyInfo": {"Website": "www.driveforprime.com/?r=glassdoor", "Headquarters": "Springfield, MO", "Size": "1001 to 5000 employees", "Founded": " 1970", "Type": " Company - Private", "Industry": " Transportation & Logistics", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job DescriptionTruck drivers at Prime are responsible for safely operating a tractor trailer and delivering freight on-time to our customers across the United States and Canada. Over-the-road, regional, and dedicated opportunities are available in the refrigerated, tanker, flatbed, and intermodal divisions. Whether you want to be a company driver or an independent contractor, Prime has options and profitable opportunities for you. With 24/7 support and late-model equipment, we will provide you the tools to succeed. We offer Freightliner, Peterbilt, and International models available with APUs and 1500-watt inverters. All company and lease trucks also come with an Omnitracs Qualcomm unit for electronic logs, messaging, and navigation. The Prime Mobile App is an additional tool available to help our drivers be more effective with their time by allowing you to not be tied to your truck and Omnitracs Qualcomm unit inside your truck. Prime Student Driver (PSD) ProgramWith our Prime Student Driver (PSD) Program, youll get everything you need to launch your new truck driving career. Well take you every step of the way from learning how to pass your CDL Exam to starting your first day as a full-time Prime truck driver. As long as you drive for Prime for one year after earning your CDL, the only amount you pay is $155 to start. Prime's hands-on training program is accepting new entrants every week in Springfield, MO and Salt Lake City, UT. Orientation 4-day orientation at Primes Springfield, MO or Salt Lake City, UT Training Facility Prime pays for: Bus Ticket, 3 Meals A Day, and Housing at the Campus Inn Hotel Obtain the Class A CDL Learners Permito This part is self-study. Click Here for Study Guide. Experience hands-on, computer based, & simulator trainingCDL Instruction Get on the road: train with CDL Instructor for 3 - 4 weeks Develop the skills needed to pass the CDL Exam 1-to-1 student/instructor ratio Run real loads across the country with your InstructorCDL Exam Return to Springfield, MO or Salt Lake City, UT to take the final state CDL Exam Exam includes vehicle inspection, backing skills, & road test Get a $250 bonus if you pass the road test on your first try!Final Training Complete 30,000 additional team miles with a Prime Trainer Guaranteed pay of $700 minimum weeklyUpgrade Become an A Lead Seat solo driver or team up with a codriver Just take the ACE Orientation Upgrade Class Get the keys to your truck and get on the road!Company Driver Pay & Benefits Solo Pay = .41 cpm plus additional 5 cents per mile for a lightweight tractor Team Pay=.47 cpm split plus additional 20 cents per mile for all miles above 3,000 per week Health, life, dental, and vision insurance options 401(K) Plan with company match Paid Vacation Fuel Mileage Bonus - Earn up to 8.2 additional cents per mile for exceeding 7.75 mpg Tuition Reimbursement - Up to $1500 for CDL School graduates, if qualified Driver Referral Program - Earn money for referring new drivers to Prime Ability to become a CDL Instructor or Trainer & earn more moneyIndependent Contractor Benefits Earn 72% of revenue as a Refrigerated Contractor Volume discounts on fuel, tires, parts, & service Quarterly Mileage Incentives Longevity Incentives Rider Policy Passenger Policy (no cost) Pet Policy (no cost) Home Policy allows you to go home whenever you chooseQualifications Must be at least 21 years old with a valid license from your state of permanent residence including a tanker endorsement  Be able to obtain United States Passport, TWIC Card, and Hazmat Endorsement Have a verifiable work history and references Have an acceptable motor vehicle record Must be able to pass a physical compliant to the Federal Motor Carrier Safety Standards If any failed or refused drug or alcohol related test, must provide proof of completed Substance Abuse Counseling to consider Must present one or more of the following: US Passport, State Certified Copy of Birth Certificate, or INS paperwork that shows US Citizenship or that permanent residence has been established and is current An affirmative answer to the questions regarding criminal record will not automatically result in the denial of employment. An applicants criminal record will be evaluated based on the job for which the applicant has applied."}