{"jobID": "2766934978", "jobLocation": "San_Francisco_CA", "jobTitle": "School Partner Program Transition Specialist", "companyRating": null, "companyInfo": {"Website": "www.jvs.org", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 1973", "Type": " Nonprofit Organization", "Industry": " Education", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "We’re looking for School Partner Programs Transition Specialists! - (3 positions)What will you do? As part of the High School and Bridge department you will partner with select San Francisco high schools to provide industry aligned, work-based learning activities that support students’ current and future educational and employment success, JVS has received additional funding to expand our School Partner Programs at John O’Connell High School and Downtown High School. Each Transition Specialist will have a slightly different role based on the needs of each school and program model; these are all new positions.What do we need from our applicants? A passion for the JVS mission, and:Excellent presentation, public speaking and group facilitation skillsExcellent customer service; able to anticipate client and employer partner needs and resolve issues with diplomacy and tactAbility to cultivate existing relationships at schools and on the HSB team; reaches out to build new relationshipsStrong planning and organizational skills with attention to detail, accuracy, and ability to meet deadlines and objectivesAbility to work independently as well as in a team, and manage multiple projects in a very fast-paced, performance-oriented environmentAbility to work in a multi-cultural environment with a diverse staff and clienteleProficiency working with Microsoft, Salesforce and Google DriveIt would also be great if you have: Experience coaching and supporting students while using positive youth development practicesFamiliarity with Google Drive, Dropbox and SalesforceFamiliarity with SF Unified School District, work-based learning, postsecondary transition and/or Career and Technical Education (CTE)Fluency in SpanishAA or Bachelor’s Degree in a related fieldWant to Apply? Please email a cover letter and resume to recruit@jvs.org; Please use SPP Transition Specialist  in the subject line. Principals only, no phone calls, please.  JVS is an Equal Opportunity Employer and does not discriminate against any employee or applicant for employment because of race, color, ethnic background, religion, gender, gender identity, gender expression, sexual orientation, age, national origin or disabilities. Culturally and racially diverse applicants encouraged to apply. Please let us know if you need accommodations or auxiliary aids for the interview process.Are there benefits? These are a full-time, non-exempt positions eligible for benefits, which include, but are not limited to: medical, dental, vision, 403B, four weeks of vacation, sick leave, most federal and Jewish holidays.Who are we? Founded in 1973, Jewish Vocational Service (JVS) transforms lives by helping people build skills and find jobs to achieve self-sufficiency. JVS is a non-sectarian, nonprofit organization. For more information about the agency, and a full job description for this position, please visit our website at jvs.org."}