{"jobID": "2719754403", "jobLocation": "San_Francisco_CA", "jobTitle": "Sr. Microsoft Dynamics 365/AX Manufacturing/Production Functional Consultant", "companyRating": "3.6", "companyInfo": {"Website": "www.avanade.com", "Headquarters": "Seattle, WA", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Slalom, Cognizant Technology Solutions, Deloitte"}, "estimatedSalary": "115000", "jobDescription": " Avanade leads in providing innovative digital services, business solutions and design-led experiences for its clients, delivered through the power of people and the Microsoft ecosystem. Our professionals combine technology, business and industry expertise to build and deploy solutions to realize results for clients and their customers. Avanade has 27,000 digitally connected people across 23 countries, bringing clients the best thinking through a collaborative culture that honors diversity and reflects the communities in which we operate. Majority owned by Accenture, Avanade was founded in 2000 by Accenture LLP and Microsoft Corporation. Learn more at www.avanade.com.  The Avanade Dynamics 365 for Finance and Operations/AX Manufacturing/Production Functional Consultant takes an end-to-end, process-based approach to address key business challenges such as complexity reduction, lean manufacturing and operations excellence, process innovation, strategic cost reduction, enterprise transformation and growth through fast innovation. Functional Consultants are challenged to understand and respond to clients' varied business needs in both the private and public sector, and work with clients to rapidly enhance the internal capabilities needed to continuously improve operational and innovation performance. Our core offerings target different aspects of a client's value chain - both across the enterprise and at the intersections of assets, process, polices, and people delivering value.  Job Description:  As a Functional Consultant in the Avanade Dynamics 365/AX Practice, you will use your strategy and operations consulting skills, business process knowledge, and other methodologies and tools to quantitatively analyze issues and drive solutions to transform our client's business.  Avanade professionals are responsible for delivering large-scale, complex programs that marry processes with technology to help our clients achieve high performance. Dynamics AX professionals design, implement and deploy AX solutions to achieve defined business goals. They maintain skills in AX applications process design and configuration; AX application design, development, integration, testing and deployment; and AX application technical architecture.  Key responsibilities:  Business performance and process diagnostics and assessments  Supervising application design and architecture components  Supervising process and functional design activities  Creating functional requirements as an input to application design  Developing and testing detailed functional designs for business solution components and prototypes  Supervising application build, test, and deploy activities  Planning and executing data conversion activities  Driving test planning and execution  Project and program management that exhibits leadership in process re-engineering and implementation of process, technology, strategy, and organizational change  Qualifications"}