{"jobID": "2806596483", "jobLocation": "Cambridge_MA", "jobTitle": "Lead Data Scientist - Manager Boston", "companyRating": "3.3", "companyInfo": {"Website": "www.unitedhealthgroup.com", "Headquarters": "Minnetonka, MN", "Size": "10000+ employees", "Founded": " 1977", "Type": " Company - Public (UNH) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Aetna, Humana, WellPoint"}, "estimatedSalary": "126000", "jobDescription": " In this role you will be leading a ninja team charged with analyzing our internal IT data. You will help the team tap into databases, logs, chats, steaming data to help \"predict and prevent\" IT issues as well as introducing AI and machine learning to help with a variety of end user business issues. The team will also be creating and supporting an internal chatbot to assist in quick resolutions to helpdesk issues. Your creations and analytics will directly impact over 290,000 end users. You will be helping make users life's better through analytics. Work will be self-directed rather than prescribed. You must be able to communicate the results, setup KPIs and dashboards to assist in decision making. You will play a key role in shaping architecture, policy and the future direction of software and hardware management inside the company. Primary Responsibilities:Lead a team of associate data scientists as the SMESupporting and enhancing our internal chatbotInteracting with business intelligence team to explore use cases and mine data, and move proven models in to productionHelp architect and set policies around data storage and machine learning for our organizationAssisting our development teams learn and implement useful modelsRequired Qualifications:5 years of direct management experience7 years of R or Python (preferably both)5 years experience with NLP and free form text analysis7 years experience with statistical analysis and predictive models7 years experience with traditional data warehouse tools and ETL3 years experience with Hadoop or big data processing softwareExperience with machine learning platforms like Tensorflow, Jupyter notebook, Scikit or Apache [Spark, Hive, Kafka]Bachelor's Degree, MS or Ph.D. Preferably a statistics or big data focusPreferred Qualifications:Experience with Rasa.aiExperience with Cloud platforms (Azure or AWS)An understanding of ITIL or IT related processes and dataAn understanding of DevOps practices and cultureExperience with 6 sigma business analytics and processesExperience in traditional programming (Java or C#) Technology Careers with Optum. Information and technology have amazing power to transform the health care industry and improve people's lives. This is where it's happening. This is where you'll help solve the problems that have never been solved. We're freeing information so it can be used safely and securely wherever it's needed. We're creating the very best ideas that can most easily be put into action to help our clients improve the quality of care and lower costs for millions. This is where the best and the brightest work together to make positive change a reality. This is the place to do your life's best work.(sm)  Diversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law.  UnitedHealth Group is a drug-free workplace. Candidates are required to pass a drug test before beginning employment.  Job Keywords: NLP, R, Python, ETL, Hadoop, Tensorflow, Scikit, Predictive Models"}