{"jobID": "2820134681", "jobLocation": "San_Diego_CA", "jobTitle": "Data Science Intern - Summer", "companyRating": null, "companyInfo": {"Website": "www.myersmediagroup.com", "Headquarters": "San Diego, CA", "Size": "1 to 50 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Exclusively seeking candidates located in San Diego, California. This position is not eligible for relocation or remote work. Candidates outside of San Diego, California will not be considered for this position. Description Join Myers Media Group and work with a fun, fast-paced team that is changing the Macro SEO(Search Engine Optimization) game! Youll work on SEO based projects and product that deliver millions of pages of content for top companies such as Expedia, Travelocity, Sears, Orbitz, Flights.com, and more.  MMG has been around 10 years but feels like a start-up with a stocked kitchen, unlimited beverages, weekly catered meals, and exciting team building events. Help us continue to grow our use of data science and product lines to deliver big SEO results for our customers.  Full time employees have access to flexible work scheduling (some roles), unlimited PTO, 401K plus match, medical, dental, and vision, EAP, wellness program, and access to some of the best medical providers in San Diego! Myers Media Group (MMG) is seeking a Data Science Intern to partner with our senior software developers on projects using Python, Jupyter Notebooks, PostgreSQL, and more. EDUCATIONAL EXPERIENCE Completed 4 year Computer Science degree. Requires current enrollment, in Masters level Computer Science degree.JOB DUTIES/RESPONSIBILITIES Work on software development and data analysis projects using: Python, Pandas, Jupyter notebook, SQL and other toolsREQUIRED SKILLS 6 months educational or professional experience with Python Experience using SQL (MySQL or PostgreSQL preferred) Exposure to Spark / PySpark in course work or projects is a big plus Have completed course work in data science and machine learning Educational or professional experience with Jupyter Notebook for data analysis and visualization Experience using development tooling such as: Eclipse, Sublime, Pycharm, Visual Studio, or any other development environments Ability to work autonomously, self-disciplined Ability to communicate technical requirements to business teams, and interpret business requirements to clearly convert into technical requirements Ability to review and QA your own work Precise and concise oral and written communication skills Experience using Google GSuite (Gdocs)ADDITIONAL USEFUL TECHNICAL SKILLS (A PLUS) Currently taking Masters level course work in Data Science Familiar with version control systems (Git/Github or SVN) Python Packages: SciPy, NumPy, Pandas, NLTK, Matplotlib Docker Amazon Web ServicesABOUT MYERS MEDIA GROUP San Diego based Myers Media Group offers enterprise SEO products and services that help large web presences reach their broadest market share in highly competitive spaces. We develop the core components of a sustainable organic search marketing infrastructure, including the abilities to catalog and prioritize all SEO assets, control and direct a large internal link hierarchy, and generate and manage large quantities of SEO optimized content. WE ARE AN EQUAL OPPORTUNITY EMPLOYER It is the policy of Myers Media Group (MMG) that no employee or applicant will be discriminated against because of race, color, religion, sex, national origin, age, marital status, disability, or veteran status. MMG will consider all individuals for any position for which they are qualified and able to perform.TO APPLY Before you apply, make sure you meet the skills and location requirements specified in this job posting.Required: Cover Letter Resume"}