{"jobID": "2745468991", "jobLocation": "Pasadena_CA", "jobTitle": "Marketing Analyst Intern I", "companyRating": "3.7", "companyInfo": {"Website": "www.aarp.org", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 1958", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": " Business Unit Description AARP is a nonprofit, nonpartisan organization, with a membership of nearly 38 million that helps people turn their goals and dreams into 'Real Possibilities' by changing the way America defines aging. With staffed offices in all 50 states, the District of Columbia, Puerto Rico, and the U.S. Virgin Islands, AARP works to strengthen communities and promote the issues that matter most to families such as healthcare security, financial security and personal fulfillment. AARP also advocates for individuals in the marketplace by selecting products and services of high quality and value to carry the AARP name. As a trusted source for news and information, AARP produces the world’s largest circulation magazine, AARP The Magazine and AARP Bulletin.  The Community, State and National Affairs (CSNA) team is a key contributor to AARP's mission of social change for Americans 50+ and their families. CSNA drives social change through our advocacy work by giving our members a voice—at the federal, state, local levels and community levels—on issues important to them such as Financial Resilience, Health Security, and Personal Fulfillment.  With a network of 53 offices in each state, the US Virgin Islands, Puerto Rico and the District of Columbia, we live where we work. This allows us to do what we do best…meet the people and directly engage in our communities to find out what they need and want, enabling us to educate our members with programs and information that is relevant to them.  Our state offices work hand-in-glove with AARP’s national office in Washington, DC. This reach—from community to state to federal – enables CSNA to better empower people 50+ to enjoy the way they live and work today, while reaching their goals for tomorrow…their life – their way.Summary Statement The Driver Safety Program is looking for a Marketing Analyst Intern to support our Pasadena, California location.ResponsibilitiesResponsible for increasing awareness and registrations for a new AARP Driver Safety educational program focused on vehicle safety technology, Smart DriverTEK, within the market area of Los Angeles, California. The intern will initiate grassroots marketing within the community, working closely with program volunteers and staff to identify marketing and communication opportunities and facilitate the implementation of recommended tactics.Collaborate with AARP Driver Safety volunteers and staff to develop a marketing plan and execute tactics to advertise Smart DriverTEK workshops and drive participation. This will include seeking out free or cost-effective promotional channels to reach the target audience within the market, and utilizing a suite of turn-key materials and resources.Provide recommendations for the development of new marketing and communication materials to meet the needs of local grassroots marketing opportunities.Establish connections with local businesses, auto dealerships, civic organizations, non-profits, etc. to generate awareness for upcoming workshops, and to identify potential new host locations for workshops.Identify best practices for local marketing and communication initiatives at the community level that may be replicable in future markets.Other projects or duties as assigned.RequirementsInterns must be currently enrolled in a degreed program at an accredited college or university; maintain a minimum GPA of 3.0; and be considered rising undergraduate juniors or seniors. To Apply for this OpportunityClick APPLY to complete the online application and submit a current resume in response to this posting;Attach a copy of your transcript detailing the number of accumulated credits and your current GPA (a minimum GPA of 3.0 is required);Be prepared to submit two letters of recommendation; which can be from a college or university professor or a manager who is familiar with your work (please note that we cannot complete the hiring process without these references)Be prepared to submit writing samples, if required for the positionInstructions for Uploading Your DocumentsAttach your resume as part of the online applicationClick the SUBMIT button at the end of the applicationSelect VIEW SUBMITTED APPLICATIONSelect the MY ACTIVITIESSelect “Add Attachment” under the section labeled COVER LETTERS & ATTACHMENTSSelect the Attachment Type and list the Attachment TitleSelect Upload your documentSelect SaveIf uploading multiple documents, repeat steps 5-8Benefits Offered Internships are non-exempt positions and are not eligible for employee benefits.Equal Employment Opportunity AARP is an equal opportunity employer committed to hiring a diverse workforce and sustaining an inclusive culture. AARP does not discriminate on the basis of race, ethnicity, religion, sex, color, national origin, age, sexual orientation, gender identity or expression, mental or physical disability, genetic information, veteran status, or on any other basis prohibited by applicable law."}