{"jobID": "2812038857", "jobLocation": "Jersey_City_NJ", "jobTitle": "Construction Project Manager", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " We are a Real Estate Development and Property Management company based in Jersey City, New Jersey currently seeking a Project Manager with 5-10 plus years experience in leading the construction of mixed use projects. The candidate must be able to demonstrate their ability to manage complex and large scale projects. Responsibilities:Lead all aspects of the project from inception to close outBe able to read and interpret construction drawingsBuild and foster relationships with architects, engineers, professionals and sub-contractors to establish project requirements, budget, specifications and schedulesEnsure that the work is completed on time, within budget and to quality standardsPerform take offs and order materials on siteAnswer questions and liaison between the crew and owner on the projectChange order and RFI managementDirect day-to-day on-site supervision of field labor force - overseeing various trades including sheet rocking, drywall, framing, painting, plumbing, masons, electrical, etcUtilize value engineering and sustainable design concepts to improve projectsNegotiate and administer contract and subcontract agreementsOversee project performance including, project status, budget, schedule and teammatesProvide leadership in risk evaluation, contract negotiations, fee and pricing decisionsEnsure that all protocols are implemented to create a safe project environmentRequirements:Minimum 5-10 years of direct project management experience in ground-up, renovations, mid to high rise, \"mixed-use\" and \"interior\" constructionDemonstrated success as the primary manager of construction projects ranging from at least $5 to $25 million of contract valueExcellent written and verbal communication skills; proficiency with construction and financial computer applicationsThorough knowledge of construction cost, scheduling, estimating, purchasing and engineering principles and techniques, as well as accounting principlesExcellent negotiation and conflict resolution skills with the ability to individually negotiate change orders with clients and/or subcontractorsAbility to read, understand and interpret contract documents, drawings, specifications, scopes of work and project schedules.A positive attitude and desire to deliver exceptional resultsPersonal commitment to safety, integrity, and continual professional developmentBilingual a plus, but not required We are an an Equal Opportunity Employer.  Please email Cover Letter and Resume with salary requirements (as attachment in PDF or Word DOC format only please). Full-time Position Available immediately."}