{"jobID": "2802907060", "jobLocation": "Boston_MA", "jobTitle": "Staff Registered Nurse- Pulmonary/Allergy (FT, 40hrs, Days)", "companyRating": "3.6", "companyInfo": {"Website": "www.bmc.org", "Headquarters": "Boston, MA", "Size": "1001 to 5000 employees", "Founded": " 1996", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "49", "jobDescription": " Summary of Position: The Nurse for Pulmonary/Allergy clinic, whose responsibilities for include: developing and advancing the quality of the pulmonary/allergy nursing practice through specialized direct patient care, coaching, collaboration, consultation, education and research.  Job Specific:  Clinically:  1. Works collaboratively with physicians, mid-levels, nursing staff, quality improvement, clinical review, patients and /families, and community organizations to implement and evaluate the care for patients with complex the pulmonary/allergy patient. Works collaboratively with all departments involved in the identification, treatment, and discharge of patients to appropriate level of care and treatment.Reviews and carries out protocols, policies and procedures, order sets and processes specific to targeted population care needs.When the opportunity presents itself, she/he will participate on committees, project groups and task forces as necessary to achieve mission goals and objectives. program goals and objectives.Collaborates with providers other departments to support practice issues specific to the pulmonary/allergy patients and the staff who care for them.Provide clinical support (assessment, collaboration, education, interventions) as needed to all staff for patients with complex pulmonary/allergy needs.  12. Serves as a liaison with physicians, patients, /families, community organizations and staff  13. Demonstrates the ability to safely administer and document medications.  14. Demonstrate competence with ordering extracts, lab and/or x-rays.  15. The individual will be committed to the delivery of comprehensive treatment plans for allergic and/or respiratory conditions in the adult population.  16. The ideal candidate should have a comprehensive knowledge of clinical procedures in the pulmonary/allergy clinic. We will train experienced, and enthusiastic candidate nurses.  17. The ideal candidate should have an understanding of pulmonary function testing results.  18. The candidate should have a working knowledge of skin testing, oral challenges, and/or other pre-immunotherapy testing.  The candidate should have a general knowledge of providing immunotherapy Injections, clinical triage, and/or performing pulmonary/respiratory histories and assessments. They should have a operational knowledge of treatment for anaphylaxis, exercise induced asthmas, allergies to foods, stinging insects, medications, intravenous contrast dyes; and then be able to work closely with patient and families to set up for plans of care and education. Qualifications Required: Graduate of an accredited school of nursing; BLS.  Preferred: BSN or enrollment in BSN program preferred."}