{"jobID": "2613570580", "jobLocation": "San_Jose_CA", "jobTitle": "Restaurant Manager", "companyRating": "3.1", "companyInfo": {"Website": "www.dennys.com", "Headquarters": "Spartanburg, SC", "Size": "5001 to 10000 employees", "Founded": " 1953", "Type": " Company - Public (DENN) ", "Industry": " Restaurants, Bars & Food Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "44000", "jobDescription": " Denny’s is hiring! We are looking for candidates who love feeding people just as much as we do. So, if you’re interested in being part of America’s Diner and enjoy the smell of sizzling hot bacon, we’d love to hear from you. Our benefits include, but aren’t limited to:Competitive annual salaryQuarterly and annual paid bonus opportunity up to 15% of your base payInsurance including medical, dental, vision and life401(k) plan with company match up to 5%11 company paid floating holidays2 weeks of vacation accrual that begins 30 days after hireAdvancement opportunities locally & nationallyCell phone allowanceTuition Reimbursement ProgramWhat does a Restaurant Manager do? Reporting to the General Manager, Restaurant Managers are responsible for the supervision of approximately 15 - 20 crew members, proper execution of the restaurant operations on their assigned shift, providing guests with a great dining experience, and upholding the Denny’s Way service and quality standards. Restaurant Managers work a variety of day and night shifts, weekends, and some holidays as the schedules are rotated. Additional responsibilities include focus on hiring and retention, continuous operational improvement, understanding profit and loss statements, operating plans, and costs. Restaurant Managers must have a strong commitment to guest satisfaction and exhibit Denny’s Guiding Principles. Position qualifications include, but aren’t limited to:Minimum of two years restaurant, hospitality or retail experienceAdditional operations and/or leadership experience strongly preferredAssociates or Bachelor's degree preferred or equivalent combination of education and experienceServeSafe® Certification requiredGreat communication skillsProven ability to solve problemsstrong business acumen to understand financial statements and contributing factorsAbility to work day and evening shifts, weekends, and holidays as the schedules are rotatedReliable Transportation Denny's, Inc. is committed to providing equal employment opportunity for all persons regardless of age, race, creed, color, national origin, citizenship status, religion, sex, sexual orientation, gender identity, disability, genetic information, military or veteran's status, criminal background, or any other characteristic protected by Federal, State, or local law.  Applicants requiring reasonable accommodation for any part of the application process should contact 864-597-8000. PLEASE DO NOT CONTACT THIS NUMBER TO CHECK THE STATUS OF YOUR APPLICATION."}