{"jobID": "2788175024", "jobLocation": "Austin_TX", "jobTitle": "Data Scientist", "companyRating": "5.0", "companyInfo": {"Website": "www.blacklocus.com", "Headquarters": "Austin, TX", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "84000", "jobDescription": " POSITION PURPOSE A BlackLocus Data Scientist solves difficult business problems with advanced statistical analytics and optimization. They are responsible for full life cycle of analytics and take the solution from concept to final prototype. Working with resources in engineering, product and services along with other members of the data science team, they deliver a solution in the shortest amount of time. Data Scientists are expected to contribute to projects as hands on expert level resource, capable of synthesizing the business requirements, nuances of the data available and analytic techniques to help create best in class solution. JOB RESPONSIBILITIES Work with merchants and other business experts to define an distill requirements for analytic solutions Design analytic solutions leveraging advanced statistical modeling and optimization that are best suited to solve the business problems Provide thought leadership and establish a technical strategy and roadmap for advanced analytics Communicate timely and effectively both verbal and written to the peers, team, managers, and others at Home Depot Stay current with advancements in optimization, statistical modeling, programming techniques and advocates them where appropriate Reports to a Lead or Principal Data Scientist at Black Locus. EDUCATION REQUIREMENTS Masters degree in the domain of data science. ABOUT BLACKLOCUS We were a successful startup before we were acquired by The Home Depot, but our culture hasn't changed. And now that we no longer have to support a sales team or maintain multiple customer applications, we get to focus all of our research, analytics and engineering effort on solving hard problems, with no other distractions. Located in the heart of downtown Austin with garage parking provided, our light-filled office features a kitchen stocked with healthy snacks from Whole Foods and an automated espresso maker that does everything but drink it for you.  BENEFITS Excellent work-life balance Comprehensive benefit package Competitive base and bonus package Open and flexible PTO 401(k) eligible for matching company contribution after one year Restricted stock grants and Employee Stock Purchase Program Stocked kitchen with healthy snacks, tons of drinks, and an espresso maker Lots of team events including weekly catered lunches, happy hours, and other fun outings Located in the heart of downtown Austin with garage parking provided The Home Depot is an Equal Opportunity Employer LEGAL DISCLAIMER: BlackLocus and The Home Depot are Equal Opportunity/M/F/Vet/Disabled Employers. Available positions may vary by location. Bilingual candidates are encouraged to apply. ©2005-2018 Home Depot Product Authority, LLC. All rights reserved. Know your rights. Click here to view Federal labor law posters."}