{"jobID": "2817064880", "jobLocation": "Milpitas_CA", "jobTitle": "Senior Test Engineer for Smart Card/Banking Systems", "companyRating": "3.5", "companyInfo": {"Website": "www.cetecom.com", "Headquarters": "Milpitas, CA", "Size": "51 to 200 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Telecommunications", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "93000", "jobDescription": " Senior Test Engineer is responsible to perform the test activities in order to achieve efficient certification process. This includes being an interface to the customer, using the relevant test tools, analyzing and validating test results and report to the customer. This Senior Test Engineer can also participate in the development of test procedure documents and test specifications and training programs for colleagues and customers. Your ResponsibilitiesManage the creation and execution of CETECOM Americas’ demand generation plan. This includes gathering input from engineering, sales and the executive team, scheduling activities, and coordinating internal and external resources to execute the plan.Interface with customers and clarify their needsBeing able to interpret and understand the technical specifications of the products being tested.Perform tests according to test plan.Evaluate and verify test results.Supervise the test technicians. Support them in difficult test situations relevant to their knowledge.Assist the lab manager in evaluating the training need of test technicians Ensure high quality and proper management of client deliverables, client input documents and test results.  Delivery of timely and accurate reporting to customers.To be able to undertake any ad hoc duties as may be required.Performing maintenance and following up with calibration on test bench systems.Support of the Lab manager in decision making for strategic growth of the lab (equipment, test area)Professional QualificationsAt least 3 years of work experience in Smart Card related testing including but not limited to EMVCo and the payment schemes such as Visa, MasterCard, Amex, Discover, etc.Knowledge of EMVCo and payment scheme standards (MasterCard, VISA and Amex etc.)Strong background in Terminal/Reader contact and contactless Level 1 and 2 testing environmentsEquivalent work experience will be consideredDegree in either of the following: Electronic Engineering, Computer Science or Physics. Additional SkillsAbility to work independently, creatively to meet tight deadlines.Ability to demonstrate aptitude and a strong potential to learn quickly.Good professional attitude towards customers and colleagues to drive the business needs.  Strong communication skills in both written and spoken.Strong problem-solving skills  Excellent computer skills – Microsoft OfficeKnowledge of Android Software Development Kit (SDK)Organizational Skills  Sales activity related skillsFlexibility at working hours, as global meetings may need to be run outside of normal hours. We offer competitive salary along with an excellent benefits package including 100% employer paid medical/vision/dental/disability/life insurance, 401(K) plan with matching, tuition reimbursement, a generous PTO plan, paid holidays, and more."}