{"jobID": "2825152713", "jobLocation": "Sunnyvale_CA", "jobTitle": "Data Analysis Intern", "companyRating": null, "companyInfo": {"Website": "www.synopsys.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1986", "Type": " Company - Public (SNPS) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Cadence Design Systems, Mentor Graphics, ANSYS"}, "estimatedSalary": null, "jobDescription": "18126BR Job Description and Requirements  Synopsys technology is at the heart of innovations that are changing the way we live and work. The Internet of Things. Autonomous cars. Wearables. Smart medical devices. Secure financial services. Machine learning and computer vision. These breakthroughs are ushering in the era of Smart, Secure Everythingwhere devices are getting smarter, everythings connected, and everything must be secure.  Powering this new era of technology are advanced silicon chips, which are made even smarter by the remarkable software that drives them. Synopsys is at the forefront of Smart, Secure Everything with the worlds most advanced tools for silicon chip design, verification, IP integration, and application security testing. Our technology helps customers innovate from Silicon to Software, so they can deliver Smart, Secure Everything.  The broad DesignWare IP portfolio includes logic libraries, embedded memories, embedded test, analog IP, interface IP, security IP, embedded processors, and subsystems. To accelerate prototyping, software development and integration of IP into SoCs, Synopsys' IP Accelerated initiative offers IP Prototyping Kits and IP subsystems. Our extensive investment in IP quality, comprehensive technical support and robust IP development methodology enables designers to reduce integration risk and accelerate time-to-market.  This internship with be with our Solutions IP group. What you will learn: As an intern, you will develop routines using Tcl to process test chip data in the Yield Explorer tool to create charts and tables;  Will also help create test chip reports using either MS Word and either Yield Explorer or Excel. You will gain experience in data processing, user interface, and data analysis Skill Requirements:Experience with data analysis including pivot charts and scatter plotsProgramming experience in a major language such as C, Java, Python, TclExperience with Excel and MS WordEducation Requirements:Must be currently enrolled in a Bachelors Program pursuing Computer Science Business Title Data Analysis Intern  Hiring Location USA - California - Mountain View/Sunnyvale  Hire Type Intern  Job Category Interns/Temp  Country United States"}