{"jobID": "2572831986", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior DevOps Engineer", "companyRating": "4.1", "companyInfo": {"Website": "www.microsoft.com", "Headquarters": "Redmond, WA", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (MSFT) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Amazon, Apple"}, "estimatedSalary": "164000", "jobDescription": "Why we feel this is a unique opportunity: Over 2 million users trust MileIQ, the top grossing finance app in both app stores, to automatically log their mileage for their largest deductions and reimbursements ever.  At MileIQ, we work in small, independent, cross-functional Scrum teams to craft innovative software solutions for our customer's needs.  Our Services team is fast-paced and agile with weekly production pushes. We are a community of talented engineers who are passionate about building highly scalable, data intensive, solutions on an open source software stack.  We make architecture decisions collaboratively and iterate quickly. We keep alive an inherently startup-like, risk-taking culture but we also take the responsibility seriously to carry one of the world's most recognizable software brand names - Microsoft.  Join us in reinventing the future of productivity! What you will have ownership for delivering:Building and managing various components of web infrastructure focusing on continuous integration, automated software releases, configuration management and system management in a high-availability cloud environment.Taking Kubernetes and Docker to production for all our new Azure microservices. Leveraging latest Docker containers with KubernetesHosting Kakfa and CosmosDB (MSFT's highly scalable NoSQL data store; comparable to MongoDB)Taking ownership of features that range from services provisioning on PaaS/IaaS, deployment automation/configuration, Jenkins CI, and Nodejs/Python application development.Build and manage software delivery, systems integration, and developer support tools.Configuration management tools (Puppet, Chef, Ansible etc) to automate systems and processes.Support always-available cloud based software as a service (SaaS) applications and corporate web presenceSupport, troubleshoot, monitor and optimize production systems.Help streamline software development by contributing to implementation of a continuous integration process and automating manual processes.Provide expertise in and lead project work relating to networking (load balancing and traffic management choices) as well as security (SSL termination, cert management, etc.)Provides expertise regarding the integration, security and scalability of web applications.Ensures the integration of the Web servers and all other supporting systems.Conducts performance tuning, load testing, and optimization of information/data processing, maintenance and support of the production environment.Public cloud and managed services (AWS, Heroku, and/or Azure)Skills needed to be successful:Requires 5+ years of industry experience including 2 - 3 years of experience as DevOps.Software development background and scripting with one or more of the following languages: Ruby, Python, Perl, Javascript.Docker/containerization experience at scale.Sound technical understanding and administration of Linux distributions (eg Ubuntu, CentOS)Experience supporting 24x7, high availability internet application environments that include web, application and database servers and load balancing systemsWorking knowledge of web and application servers management and configuration (e.g. Load Balancers, Nginx, NodeJS, Python/Django)Experience with build and deployment automation tools (e.g. Jenkins)Experience with build automation and configuration management tools (e.g. Puppet, Chef, Ansible)Experience with Azure Web Services and technologies is a plus."}