{"jobID": "2828639465", "jobLocation": "Waltham_MA", "jobTitle": "Senior Clinical Data Scientist", "companyRating": "4.4", "companyInfo": {"Website": "www.alkermes.com", "Headquarters": "Waltham, MA", "Size": "1001 to 5000 employees", "Founded": " 1987", "Type": " Company - Public (ALKS) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Sunovion, Biogen, Vertex Pharmaceuticals"}, "estimatedSalary": "177000", "jobDescription": " Company Overview  Alkermes plc is a fully integrated, global biopharmaceutical company developing innovative medicines for the treatment of central nervous system (CNS) diseases. The company has a diversified commercial product portfolio and a substantial clinical pipeline of product candidates for chronic diseases that include schizophrenia, depression, addiction and multiple sclerosis. Headquartered in Dublin, Ireland, Alkermes plc has an R&D; center in Waltham, Massachusetts; a research and manufacturing facility in Athlone, Ireland; and a manufacturing facility in Wilmington, Ohio. For more information, please visit Alkermes' website at www.alkermes.com. POSITION DESCRIPTION: The Senior Clinical Data Scientist is responsible for the development and leading teams through the interpretation of algorithms, code, reports and visualizations in support of clinical trial operations activities with a focus on impactful data insights and clinical data review. The Senior Clinical Data Scientist will be inquisitive and passionate about data and how it applies to all phases of clinical trials with an eye towards collaboration, creativity, flexibility and innovation. Essential Duties:Produces standard and/or custom algorithms, dashboards, datasets, reports and visualizations using data analytics and visualizations tools to support data insights, oversight and review across Medical / Clinical Operations organizations.Leads data discovery and review, interpreting, facilitating discussion and communicating impactful findings to clinical study teams.Acts as the Lead Clinical Data Scientist for one or more clinical trials or across a Program, assuming responsibility for selecting key risk indicators and diagnosing and explaining data anomalies or trends using appropriate data visualization tools.Manages the data flow of electronic data from external data sources/vendors in partnership with the Data Management Lead and Technical Solutions. Liaises with vendors as needed to facilitate electronic data transfers and/or data specification requirements for the purpose of clinical data review.Provides leadership, training, guidance, and support to other department members on Risk-Based Monitoring techniques and tools, data visualization tools and in aspects of Data Sciences discipline.Proactively drives discussion with peers, project teams, and/or requestors to clarify and finalize data review and/or visualizations specifications; uses expanded technical and data sciences skills to meet evolving project needs.Spearheads the development, delivery and maintenance of clinical data review standards, tools and systems, across various data sources (e.g., clinical data, safety and operational data).Supports or leads initiatives for Technical Solutions, Data Management, Clinical Programming and/or Safety/Clinical Data Review bridging activities, meetings, discussions.Possesses and maintains a broad overall knowledge in the field of data sciences by reading related literature, self-training, attending training classes, attending professional meetings, etc.Qualifications:Data Science, Math or Statistics background; BS required, MS preferredMinimum 5-8 years' experience in clinical data science role or relatable lead data review role (i.e., data manager, data analysis/visualization lead), a plus if within the pharmaceutical/biotech settingAdvanced technical expertise in databases, EDC platforms, ETL, data imports/integrationsAdvanced programming and analytical skills using SAS, R and Python a plusKnowledge and use of data visualization or data review tools (JMP Clinical, D3.js, Spotfire, Tableau)Risk-Based data review, systems or monitoring experience; demonstrated ability to apply in review of clinical trial dataAbility to work independently to create various outputs as datasets, dashboards, reports, visualizations and to clearly communicate the information provided by these deliverablesKnowledge and understanding of data standards such as CDISCKnowledge of machine learning and statistical modeling/trending applied to clinical data review a plusStrong business analysis and project management skills, professional attitude, focusing on process and quality data improvementsExcellent written and oral presentation skills and ability to communicate effectively to other data scientists, programmers and non-technical colleaguesAbility to be collaborative and to mentor other data scientists, along with guiding the organization in the discipline of data sciencesStrategic mindset with the ability to influence without authority, form sound opinions and make sensible decisions in a dynamic environmentWindows applications: Word, Excel, PowerPoint, etc.Physical Demands and Work Environment:Travel domestic and international up to 20%In-house position based in Waltham, MA Alkermes, Inc. is an equal employment opportunity employer and does not discriminate against any applicant because of race, color, religion, sex, sexual orientation, gender expression and identity, national origin, ancestry, age, mental and physical disability, genetic information, any veteran status, military status or application for military service, or membership in any other category protected under applicable law."}