{"jobID": "2705216940", "jobLocation": "Seattle_WA", "jobTitle": "QUALITY ASSURANCE (QA) INTERN", "companyRating": null, "companyInfo": {"Website": "www.datstat.com", "Headquarters": "Seattle, WA", "Size": "1 to 50 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Quality Assurance (QA) InternQuality Assurance (QA) InternAs a Quality Assurance Intern,you are responsible for developing test plans and conducting test cases for projects of varying size, scope and complexity in order to deliver high-quality systems on schedule. The Intern documents and tracks all defects. The ideal candidate must be a self-starter, possessing sound judgment, and sound analytical skills. They must be able to work independently and in a fast-paced, team environment. They must be able to manage multiple and competing priorities. They must be willing to gain business and technical knowledge. They must be able to communicate effectively with a broad range of audiences. They will also have a strong sense of customer service and teamwork.As an ideal candidate, you will have: 1-3 years of PC software testing experience, particularly client/server network application testing and, web application testing.Progress toward B.S in Computer Science (or equivalent degree / experience).A strong track record of shipping high-quality products.Experience with stress and performance testing of network-based applications, particularly database driven applications.Superior communication skills, both written and verbal.Experience with the following technologies preferred: Windows Server, SQL Server 2005/2008, Active Server Pages, IIS 6/7, and various testing and performance tools.Check out what you will be doing! Maintain quality requirements that include the design and implementation of methods and procedures for testing and debugging programs.Ensure that products are bug-free and stable.Ensure that all products perform to written specifications regarding functionality, usability, performance, robustness, and reliability.Certify products as ready for release.Write test cases.Ability to Produce and Execute Test Cases Produce and Execute Test Cases Defect Reporting and Tracking Sign-off on Product Release.Sales Account ExecutiveSales Account ExecutiveDatStat provides leading health researchers and healthcare organizations with platform-powered digital health solutions that empower patients to take a more active role in managing their health and wellness. We are looking for a highly entrepreneurial, organized, motivated, and technically savvy sales representative who is interested in driving their sales career in the rapidly growing Health IT/Health Research IT field. As a Sales Account Executive (SAE), you will help Customers transform the patient experience through better technology. You will envision and recommend solutions built on DatStat’s Platform, exceed sales objectives, and develop sales territories. Key performance indicators are sales results, client satisfaction, and territory growth. As your abilities grow, so will your career opportunities!As an ideal candidate, you will have: 2-4 years B2B sales experience with platform-powered, enterprise software solutionsConsistent over-achievement of quota objectivesGreat personality and ability to work as part of a teamExceptional verbal, written, and presentation skillsA strong passion for technology and CRM expertiseBachelor’s degreePrevious experience in health research /healthcare industry (preferred)Check out what you will be doing! Hit your (aggressive) sales numbers.Develop and maintain an understanding of the territory, market, competitive offerings, and other business issues relevant to this position.Leverage relationships and success with assigned customers to achieve organic growth to include expansion, product, and service up sell/cross sell.Maintain a position as a thought leader in your assigned territory through blogging, social presence, and participation in associations, and networking groups.Develop a pipeline to ensure consistent and predictable success.Generate and qualify leads based on your own efforts.Deliver presentations and demonstrations for all services & solutions.Manage the sales process through qualification, needs analysis, evaluation, negotiation and close.Consistently document daily sales activities in the CRM and provide regular reporting of pipeline and forecast.Work closely with service and product & development teams to align strategic sales opportunities with company capabilities.Represent the company, at the highest level, with all customers.Bring positivity and teamwork to promote a culture of service, quality, integrity and cooperation.Software Development EngineerSoftware Development EngineerAs a Software Development Engineer, you will work with the DatStat engineering team in the design, and implementation of DatStat’s next generation survey and research management platform. Our new platform will have you working with cutting edge web and cloud technologies, and you will play a key role as we revolutionize online research. You will need to be a self-starter who can operate in both a team and self-directed contexts. You will have a passion for delivering high-quality web experiences and care deeply about our customers. This position requires healthy doses of initiative and flexibility in a very dynamic environment.As an ideal candidate, you will have: Experience with industry standard web technologies, including HTML, CSS, JavaScript, Jquery, AJAX, JSON, etc. More than passing knowledge of emerging technologies, including HTML5, CSS3, etc.Knowledge and experience with a broad number of Javascript frameworks / libraries, including Bootstrap, Jquery, Angular JS, etc.Experience in building scalable web application front-ends in a cloud / SaaS architectural model.Experience developing with the Microsoft technology stack, including IIS, .NET, SQL Server, MVC, etc. using C#Worked in an “agile” environment, using SCRUM for iterative development.A strong attention to detail and a feeling of pride and ownership over the design and quality of the products you work on.The ability to advocate for best practices, great usability, and exceptional quality.Strong verbal and written communication skills.Great organizational skills and a strong feel for the process.BS in Computer Science (or equivalent degree/experience).A passion and desire to work at a company trying to change the world.Check out what you will be doing! Be involved with early planning to understand how new features are intended to work.Work with the DatStat engineering team in conceptualizing, designing, and implementing industry-leading features on new applications.Bring your experience and knowledge to bear in solving web front-end challenges, and in crafting an industry leading, next generation “Rich Internet Application” user experience.Have a great time working with great people in redefining how online research is done."}