{"jobID": "2814305666", "jobLocation": "Mountain_View_CA", "jobTitle": "(USA-CA-Mountain View) Data Analyst, Hardware Marketing", "companyRating": "4.4", "companyInfo": {"Website": "www.google.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (GOOG) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Apple, Facebook"}, "estimatedSalary": "106000", "jobDescription": " Help serve Google's worldwide user base of more than a billion people. Business Analysts provide quantitative support, market understanding and a strategic perspective to our partners throughout the organization. As a data-loving member of the team, you serve as an analytics expert for your partners, using numbers to help them make better decisions. You weave stories with meaningful insight from data. You make critical recommendations for your fellow Googlers in Engineering and Product Management. As a self-starter, you relish tallying up the numbers one minute and communicating your findings to a team leader the next.  As a Data Analyst, you'll build and lead a Performance and Analytics team that enables decision making across a wide range of business functions for a growing portfolio of hardware products and brands across an expanding global footprint. Youll have the opportunity to design innovative data solutions and solve challenging problems using Googles large-scale production data infrastructure. You will use your business and customer knowledge to formulate hypotheses and develop data analyses to test them.  Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google's products solve the world's problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.  ## Responsibilities Model data in order to create quantitative models including forecast, operational, and statistical models of business dynamics.Collect, analyze, synthesize, and present data to derive insights and identify strategic solutions.Develop automated reports and dashboards.Work with cross-functional stakeholders to gather requirements, manage implementation, and drive delivery of projects. ## Qualifications Minimum qualifications:Bachelors degree in a quantitative/analytical field, or equivalent practical experience.4 years relevant work experience.Experience analyzing data and creating reports with database query experience (e.g. SQL), statistical, quantitative modeling and forecasting experience.Experience with a language for statistical programming (e.g. R, SAS, Stata, etc.)Preferred qualifications:Experience in building data visualizations for complex business applications (e.g. Tableau, Dashboards, Data Studio, Power BI, etc).Ability to understand the implications of data analysis and build a strategic story from this data.Demonstrated passion for developing and analyzing large, complex data sets and converting them into insights that drive business decisions at all levels of the organization.Excellent oral and written communication skills, including the ability to communicate complex findings in a structured and clear manner to a non-technical audience.* * At Google, we dont just accept difference - we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you have a disability or special need that requires accommodation, please let us know.  To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees or any other company location. Google is not responsible for any fees related to unsolicited resumes."}