{"jobID": "2468108881", "jobLocation": "New_York_NY", "jobTitle": "Endocrinologist Site Director", "companyRating": "3.3", "companyInfo": {"Website": "www.pagny.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "360000", "jobDescription": " Overview Physician Affiliate Group of New York (PAGNY) is comprised of nearly 4,000 physicians and healthcare professionals who provide services to NYC Health + Hospitals, the largest public health system in the United States. Our practitioners are highly skilled professionals with outstanding credentials who deliver the highest level of quality healthcare to patients throughout New York City. NYC Health + Hospitals/Jacobi is the largest public hospital in the Bronx (500+ beds) and a Level 1 Trauma Center. Jacobi is a major academic affiliation and teaching site of the Albert Einstein College of Medicine. Recognized as the regional hyperbaric center and regional snakebite center for the tri-state area, Jacobi offers state of the art medical care, delivered with compassion, dignity, and respect. From preventive medicine to cutting-edge specialty services, Jacobi provides first class care in a wide range of services and specialties. NYC Health + Hospitals/North Central Bronx is a modern, state-of-the-art community hospital located in an attractive and safe residential Bronx neighborhood just 20 minutes north of Manhattan. It is a North Bronx Healthcare Network hospital affiliated with Jacobi Medical Center and a teaching site and academic affiliate of the Albert Einstein College of Medicine. It offers a full continuum of acute care inpatient and outpatient services in diverse medical and surgical specialties, including psychiatry. The department of psychiatry has 70 adult and geriatric acute inpatient beds, a partial hospital program, psychiatric emergency and consultation-liaison services, an adult ambulatory practice, and a community-based assertive community treatment program. The department employs evidenced-based best practices in providing the highest quality care to its patients, in a patient-centered approach that is respectful of their individuality, culture, and community. ResponsibilitiesThis position is purely an ambulatory position which involves actively seeing patients in 6 half day sessions at NCBH and one half day session at Jacobi Hospital. (Endocrine clinic with Endocrine fellows)The clinic sessions in NCBH is divided into Endocrine and Diabetes and includes performing fine needle biopsy for thyroid nodules.Other responsibilities include:Supervising internal medicine residents rotating through the endocrine and diabetes clinicsSupervising a nurse practitioner working in the diabetes clinicReviewing and editing endocrine/diabetes clinic notes written by internal medicine residentsAvailable by phone/email consults for primary care providers and house staffParticipating in interactive endocrine case based lecture with internal medicine residents rotating through ambulatory medicine. (once every 3-4 months) This position offers a competitive salary, outstanding benefits package and a great work/life balance! QualificationsBoard Eligible/Board Certified Endocrine PhysicianEOE M/F/D/V"}