{"jobID": "2802755944", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Intern, Technical Development for Corporate Strategy Group", "companyRating": null, "companyInfo": {"Website": "www.sap.com", "Headquarters": "Walldorf, Germany", "Size": "10000+ employees", "Founded": " 1972", "Type": " Company - Public (SAP) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Salesforce, Oracle, Microsoft"}, "estimatedSalary": null, "jobDescription": "Requisition ID: 146016 Work Area: Software-Development Operations Expected Travel: 0% Career Status: Student Employment Type: Intern    COMPANY DESCRIPTION    As market leader in enterprise application software, SAP helps companies of all sizes and industries innovate through simplification. From the back office to the boardroom, warehouse to storefront, on premise to cloud, desktop to mobile device – SAP empowers people and organizations to work together more efficiently and use business insight more effectively to stay ahead of the competition. SAP applications and services enable customers to operate profitably, adapt continuously, and grow sustainably.    Company Information    SAP is the world’s largest business software company and leader in enterprise applications, analytics, mobile and in-memory technologies. SAP has nearly 300,000 customers across 200+ countries. Companies everywhere depend on SAP to run their businesses, including leading brands like UnderArmour, BMW, eBay, or the NBAWith a large portfolio of innovative offerings ranging from Big Data solutions to cloud applications, SAP generated more than $23 billion in revenue in 2016, maintaining strong, profitable growth. Today, SAP has more users on its cloud offerings than any other cloud application provider.   SAP has built its leadership position in the market by delivering on a promise of business process expertise across 25 industries. The company has developed the largest corporate benchmarking dataset on the planet and uses that data to tailor its software solutions across the different industries. We are in the middle of a remarkable transformation into a highly innovative cloud company focused on helping our customers transform into Digital Businesses. This has enabled SAP to become the partner of choice as CEOs look to drive business model innovation leveraging next generation digital technologies.    Group Mission and Vision    SAP's Corporate Strategy Group (CSG) is responsible for shaping SAP strategy and identifying the growth engines that will drive significant value creation for SAP, including technology and product portfolio, Go-To-Market execution, and M&A; strategy. The team focuses on answering questions that impact SAP’s mid/long-term strategic direction as well as short term priority objectives for the CEO and the SAP Board in a fact-based, objective manner that is laser focused on organizational impact.   Recently the group also expanded its scope to drive internal and external incubation efforts under the umbrella of SAP.io. Specifically, the team is focusing on driving external startup engagement including early stage investments in startups and driving startup acceleration within SAP accelerators/incubators.    Expectations & TasksThe chosen candidate will build custom code projects and innovative prototypes to support the work of SAP Corporate Strategy GroupThe work will include working with a variety technologies and SDKs in areas as Big Data, Machine Learning, Chatbots, AR/VR, IoT, DBaaS, Drones and more. Skills / CompetenciesThe ideal candidate is a self-starter, self-learner and has proven record of picking up new technology with little or no help.She/he should be a quick learner with a passion for solving tough problems and a “hacker” mindsetShe/he should have very strong verbal and written communication and presentation skills.Ability to work both independently and collaboratively (including in virtual teams).The candidate must be proficient in computer science fundamentals and algorithms.She/he must have proficiency in at least one programming language of the following: JavaScript, PHP, Python, AngularJS, Node.js, Erlang and C++.Previous working experience (full-time or part-time) in software development is preferred.Hands-on experience with Big Data technologies (e.g. Hadoop and Spark), AR/VR engines (e.g. Unity) or Drones/Robotic SDK (e.g. DroneKit) is an advantage.She/he should have the capacity for multi-threading. She/he should have a passion for the technology industry and software development.   Educational RequirementsDegree in Computer Science or Engineering is required.Academic distinction (Dean’s List, Cum Laude, Summa Cum Laude) is an advantage. Qualifications:Requires candidates to currently be enrolled in an undergraduate, Masters, MBA or PhD degree program which is applicable to the position.   SAP'S DIVERSITY COMMITMENT    To harness the power of innovation, SAP invests in the development of its diverse employees. We aspire to leverage the qualities and appreciate the unique competencies that each person brings to the company.     SAP is committed to the principles of Equal Employment Opportunity and to providing reasonable accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team (Americas: Careers.NorthAmerica@sap.com or Careers.LatinAmerica@sap.com, APJ: Careers.APJ@sap.com, EMEA: Careers@sap.com). Requests for reasonable accommodation will be considered on a case-by-case basis.     EOE AA M/F/Vet/Disability:     Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, gender, sexual orientation, gender identity, protected veteran status or disability. Additional Locations:"}