{"jobID": "2670397638", "jobLocation": "New_York_NY", "jobTitle": "Paid Social Planner", "companyRating": null, "companyInfo": {"Website": "www.neoogilvy.com", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " 2006", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Social Media PlannerPlanners are the day-to-day focal point of the account. The MP is expected to have a complete and unquestioned understanding of their assigned client’s social media business and overall marketing objectives The position is usually supported by the AMP and reports to a Media Supervisor level.Responsibilities:· Day-to-day management of the social media plan including oversight of buy recommendations, execution details, budgets/accounting· Management of the platform relationships including Facebook, Twitter, Pinterest and Snapchat· Develops analysis that leads to optimization recommendations· Works with senior management to develop strategies and recommendations for social channels· Delegation, oversight and training of Asst. Media Planners· Handle day-to-day client requests and questionsRequirements:· 1-3 years of paid social media planning & buying experience· Experience with Facebook Ads Manager and Twitter Ads, Pinterest & Snapchat experience preferred· Good writing and verbal communication skills (including presentation skills)· Bachelor’s Degree· Strong analytic skills and ability to relate results to client business objectives· Knowledge of media tools (ad serving, research) and procedures (both media and inter-department)· Excellent time management and multi-tasking skills· Understands the concepts of reach, frequency, frequency management, ROI and latency· Strong relationships with publisher and technology partnersAbout Us: Neo@Ogilvy is the world’s leading digital and direct media agency, with more than 650 professionals in 39 offices across 32 countries. We provide a full range of digital and direct media services, including media strategy, planning and buying, search marketing, performance marketing, analytics and technology, mobile marketing, social media marketing, digital out-of-home marketing and others. Our missions is to be the best in class, full-service digital and direct global media network that delivers performance results to our clients’ 360 strategy. "}