{"jobID": "2827649203", "jobLocation": "Seattle_WA", "jobTitle": "Sales & Marketing IT Applications Intern", "companyRating": "3.9", "companyInfo": {"Website": "www.f5.com", "Headquarters": "Seattle, WA", "Size": "1001 to 5000 employees", "Founded": " 1996", "Type": " Company - Public (FFIV) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Citrix, VMware, Juniper Networks"}, "estimatedSalary": "79000", "jobDescription": " Come work at a place where innovation and teamwork come together to support the most exciting missions in the world! Position Summary F5’s Sales & Marketing Applications team in IT is seeking an intern for a six-month position.  An intern on this team will participate in several initiatives and projects across F5’s IT organization in close partnership with other team members. You will have the opportunity to assist with business and systems analysis work using database technologies. You will execute on projects using your SQL programming skills and will use and learn with Salesforce.  You will work in a largely cooperative manner, being closely paired with other team members or others in the IT organization. You will gain experience in identifying priorities, effectively participating in projects in a manner that supports and extends the goals of team, department, and F5, and understanding F5’s business needs from an enterprise architecture perspective. You will be mentored by more-senior team members to guide successful completion of assigned work in a manner consistent with F5’s corporate principles and policies. What will you do?Strives to fulfill IT customers’ business requirements in alignment with corporate and IT strategies.Participates in assigned work with an emphasis on applying scholastic skills to a corporate environment.Develops growth and learning plan in conjunction with the Sr. Manager and assigned mentor(s).Work closely with Business Analysts and other teams to identify dependencies and develop analysis and reporting for existing projects and initiatives.Consult with and engage Subject Matter Experts (SMEs) as appropriate.Attend meetings as required.Responsible for upholding F5’s Business Code of Ethics and for promptly reporting violations of the Code or other company policies.Performs other related duties as assigned.Students should be/possess:An ideal candidate for the intern position should be enrolled in a Computer Science, Software Development, Information Management Systems, or a closely-related sciences or technical program.They would have successfully completed Data Structures and Algorithms or a comparable course and should have an interest in data analysis and/or programmingExperience with SQL databases, reporting, ability to query dataApproaching their Junior year or beyond at the time of the internshipAvailable for a 10-12 week internship between July 2018 to December 2018Ability to commit to 40-hours per weekExcellent collaboration and interpersonal skillsStrong communication skillsProficient in Microsoft Suite OfficeOrganized, with an ability to prioritize time-sensitive assignmentsExcellent problem-solving skillsSalesforce exposure/understanding would be a plus Internships are an excellent way to get to know F5. If you are looking to be a member of an amazing, exciting company, you have come to the right place! ***Please note that we cannot sponsor work Visas for these positions. The Job Description is intended to be a general representation of the responsibilities and requirements of the job. However, the description may not be all-inclusive, and responsibilities and requirements are subject to change. Equal Employment Opportunity It is the policy of F5 to provide equal employment opportunities to all employees and employment applicants without regard to unlawful considerations of race, religion, color, national origin, sex, sexual orientation, gender identity or expression, age, sensory, physical, or mental disability, marital status, veteran or military status, genetic information, or any other classification protected by applicable local, state, or federal laws. This policy applies to all aspects of employment, including, but not limited to, hiring, job assignment, compensation, promotion, benefits, training, discipline, and termination. Reasonable accommodation is available for qualified individuals with disabilities, upon request."}