{"jobID": "2763072148", "jobLocation": "New_York_NY", "jobTitle": "RN, Hospice Admissions (11:00 a - 7:00 p)", "companyRating": "3.1", "companyInfo": {"Website": "www.vnsny.org", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1893", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "41", "jobDescription": " Overview Visiting Nurse Service of New York (VNSNY) is the nations largest not-for-profit community-based health system. VNSNY provides a comprehensive array of home- and community-based programs, including health plans, tailored to the needs of high-risk, vulnerable New Yorkers, improving their quality of life. Each day,more than 18,000 VNSNY employees including nurses, rehabilitation therapists, social workers, dieticians, other allied professionals, and paraprofessionals deliver compassionate care, unparalleled medical expertise, and 24/7 solutions and resources tomore than35,000 patients, helping them to live the best lives possible. Responsibilities Responsible for coordinating and providing high quality multidisciplinary health services for patients in the Region/Program consistent with Agency philosophy, policy, goals and objectives, and Standards of Nursing Practice. Works under moderate supervision. Licensure: License and current registration to practice as a registered professional nurse in New York State, required. Valid drivers license may be required, as determined by operational/regional needs. Education: Bachelors Degree in Nursing from an approved program, required. Experience: Minimum of one year of clinical nursing experience including at least six months of Hospice, or Med/Surg or ICU or Emergency Dep&rsquot;t or Home care, Palliative Care, Oncology or Long Term Care experience, required. Bilingual skills may be required, as determined by operational needs. Demonstrated computer skills may be required based on operational needs. CA2018"}