{"jobID": "2733737435", "jobLocation": "San_Francisco_CA", "jobTitle": "Sr. Data Scientist - Valor Water", "companyRating": "3.6", "companyInfo": {"Website": "www.xylem.com", "Headquarters": "Raleigh, NC", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Landis+Gyr, Itron, GE"}, "estimatedSalary": "172000", "jobDescription": "Xylem (XYL) is a leading global water technology company committed to developing innovative technology solutions to the worlds water challenges. The Companys products and services move, treat, analyze, monitor and return water to the environment in public utility, industrial, residential and commercial building services settings. Xylem also provides a leading portfolio of smart metering, network technologies and advanced infrastructure analytics solutions for water, electric and gas utilities. The Companys more than 16,500 employees bring broad applications expertise with a strong focus on identifying comprehensive, sustainable solutions. Headquartered in Rye Brook, New York with 2017 revenue of $4.7 billion, Xylem does business in more than 150 countries through a number of market-leading product brands.  The name Xylem is derived from classical Greek and is the tissue that transports water in plants, highlighting the engineering efficiency of our water-centric business by linking it with the best water transportation of all that which occurs in nature. For more information, please visit us at www.xylem.com.  The Role: Valor Water, a Xylem brand, seeks a talented, diligent data scientist to help transform the water utility industry. Come join our small team of scientists, engineers and economists working collaboratively in a startup-like environment. Through the deployment of software, data analysis, and artificial intelligence, we have recently begun to solve conundrums that have persisted in the industry for decades.  As Senior Data Scientist for Valor Water Analytics, you will help scale water efficiency and affordability water software, globally. This is an exciting opportunity to help develop analytical solutions to solve one of the worlds most vexing issues: water scarcity. You'll work closely with engineers, designers, product managers and marketers to help us to analyze and integrate data from millions of water customers around the globe. The ideal candidate enjoys working with cross-functional teams, has built commercialized machine learning products is highly analytical and enjoys solving complex puzzles.  Essential Duties/Principal Responsibilities: Identify and implement solutions to data-centric problems based on actual or hypothetical data setsLead development of testing and production environments for machine learning / AI productsLead development of scalable AI solutionsDevelop data models and algorithmsEvaluate precision and accuracy of algorithmsDevelop processes to monitor and analyze model/algorithm performanceFollow latest data science techniques and trends Minimum Qualifications: Education, Experience, Skills, Abilities, License/Certification: Minimum of 3 years relevant experience building commercialized data science applicationsDegree in data science, computer science, mathematics, statistics, economics, or a related fieldPythonSQLAmazon Web ServicesProblem solvingData miningData cleaningData visualizationExperimental designMachine learning (clustering, decision trees, neural networks, etc.)Statistics (regression, distributions, etc.)Strong written and verbal communication skillsTime management skills Additional Information:  Physical Demands  (The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.) Light lifting (20-25 lbs.), office environmentRegularly required to sit or stand, reach, bend and move about the facility Work Environment  (The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.) Office: Standard office equipment; work usually performed in an office setting free from any disagreeable elements. Standard weekly job hours: 40 hours EOE/Females/Minorities/Protected Veterans/Disabled"}