{"jobID": "2802119117", "jobLocation": "Los_Angeles_CA", "jobTitle": "Software Engineer Intern with Westlake Financial Services", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The position listed below is not with LA Interviews but with Westlake Financial Services  LA Interviews is a private organization that works in collaboration with government agencies to promote emerging careers. Our goal is to connect you with supportive resources to supplement your skills in order to attain your dream career. Job Description Do you have a strong interest in web development? Are you self-motivated and a quick learner? If you flourish in a fast paced, results-oriented environment, if you want to achieve individual success within a “team first” organization, then our Technology team may well be just what you’re looking for.  Westlake Financial Services, the largest privately held finance company in the Nation, is looking for Software Developer Interns to join our Technology team. Westlake Financial is one of the fastest growing multi-million-dollar companies in the United States. The Los Angeles Business Journal named Westlake Financial the 7th fastest growing large company in Los Angeles County in 2012. WHAT YOU WILL LEARN/GAIN: How to build applications for the web  How to collaborate with the engineering team to design and implement new features  How to identify techniques to optimize web performance  Working on interesting projects with a small and supportive team  The intern will be compensated for his or her work while with Westlake. It is our goal to find a number of interns that will one day find full time placements at Westlake. Local candidates only  Duration of the program: Minimum of 8 - 12 weeks  Approximate hours per week: 20-40 hours ESSENTIAL DUTIES: Shadow developers and software QA team members to develop knowledge of software development and QC process  Learn software development tools and protocols  Assist developers with design and development of the following software project/module  Migrating the Stored procedure from MySQL to Oracle  Converting existing MySQL based report to Oracle Based  Writing Spring apps, Spring Batch and web services ESSENTIAL KNOWLEDGE SKILLS: Knowledge of Java /SQL/Javascript  Great attitude/ energetic/dynamic/team builder.  Skilled at multitasking  Comfortable working in a high pressure environment  Knowledge and experience in Linux, Perl, Shell scripting, awk and sed a Plus EDUCATION: Currently pursuing a Bachelors or Master’s degree in Computer Science or related technical field.  Every Full-Time position at Westlake Financial offers the following:  Medical, Dental, and Vision benefits  Life Insurance, Flexible Spending Account  401K matching, Employee Stock Ownership Program in a $2.6 Billion Company, plus company matching  Wellness Program, Daily Team Exercises, Fresh Fruit for all employees  Metro Tap Card and Metro-link Reimbursement  Westlake University, Certification Programs  Career Path Opportunities  Discounts on Parks, Museums, Movie Tickets, and Attractions  Wireless, Computer, and Satellite Discounts  Rental Car Discounts, Dell Member Purchase Program  Employee Loan Assistance  Onsite DMV  Westlake Bike Share (Free Bikes onsite)  Onsite Gym, onsite Yoga, Treadmill Desks, Gym Membership Discounts  Annual Flu Shots, Biometric Screenings ACKNOWLEDGMENTS We will consider for employment all qualified Applicants, including those with Criminal Histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance.  We are an equal opportunity employer and do not unlawfully discriminate in employment. No question on this application is used for the purpose of limiting or excluding any applicant from consideration for employment on a basis prohibited by local, state, or federal law. Equal access to employment, services, and programs is available to all persons. Those applicants requiring reasonable accommodation to the application and/or interview process should notify a representative of the organization.Company DescriptionABOUT US  People. Purpose. Passion.  These are the hallmarks of Westlake Financial Services, and have been since our inception in 1988. Westlake specializes in prime to sub-prime automotive financing, helping car dealerships do what they do best: sell cars. Our unique credit approval software (known as \"The Buy Program ©\"​) allows dealers to get an on-the-spot loan approval without waiting for callbacks, fax-backs, or rehashes.  Westlake Financial Services is an Internet based, privately held finance company that specializes in the acquisition and servicing of sub-prime and non-prime automotive retail installment contracts. Headquartered in Southern California, Westlake originates indirect retail installment contracts through a network of 21,000 new and used car dealers throughout the United States. All collections and servicing are performed in-house from its central facility located in the Mid-Wilshire area of Los Angeles.  Westlake's success didn't just happen overnight. It took years of hard work, cultivation, and smart intuition to get to where we are today. Not content to rest on our laurels, Westlake continues to build and refine, always keeping our dealers and customers in mind. ACKNOWLEDGMENTS We will consider for employment all qualified Applicants, including those with Criminal Histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance.  We are an equal opportunity employer and do not unlawfully discriminate in employment. No question on this application is used for the purpose of limiting or excluding any applicant from consideration for employment on a basis prohibited by local, state, or federal law. Equal access to employment, services, and programs is available to all persons. Those applicants requiring reasonable accommodation to the application and/or interview process should notify a representative of the organization. CONTACT US Email: Careers@WestlakeFinancial.com  Apply"}