{"jobID": "2761881040", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.zendrive.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Imagine a world where every driver with a smartphone is safer and where massive amounts of data and insights make cities safer and reduce insurance costs for everyone. Zendrive is rapidly executing its mission of making all roads safer using data and analytics and is focused on building products to support the evolution of transportation.If you are passionate about transportation and leaving a meaningful impact on the world and if you believe that the mobile revolution, alongside machine learning and big data, can help transform industries that are lagging, you will love what we do at Zendrive.This position is based in Zendrives San Francisco office.Responsibilities As a data scientist, you will be working on the next generation of the core algorithms to model driving behaviors and identify risky drivers for insurance purposes. You will be leveraging Zendrives rich and massive datasets (100+ billion driver miles) and employing modern machine learning and behavioral analytics techniques to create cutting-edge technologies for driving safety.Our ideal candidate is extremely curious with a strong background in statistics and machine learning and is continuously looking for new algorithms or new data sources for better results. This candidate should be passionate about being at the forefront of applying AI and big data to driving behavior and should have the ability to balance sophistication with simplicity, scientific rigor with pragmatism, and agility with quality. Skills and Experience Requirements MS or PhD (preferred) in Statistics, Applied Math, CS, EE, or other quantitative engineering fields with a focus on machine learning, statistical, and mathematical algorithms2+ years of experience in developing statistical models and machine learning algorithms for real-world problemsExperience handling massive datasets and expertise in big data technologies Hands-on experience with statistical analysis and data mining tools, such as R and Python, etc.Ability to balance theory and pragmatics to develop and apply advanced analytics to real-world problems Bonus Past experience in the insurance industry (risk modeling, underwriting, pricing, etc.) is a plus.Domain knowledge and experience in analyzing driving patterns, traffic safety, and transportation systems is a plus.Experience with Geospatial and temporal data is desirableZendrive is an equal opportunity employer and values diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.To all recruitment agencies: Zendrive does not accept unsolicited resumes. Please do not forward resumes to Zendrive employees or any other company location. Zendrive is not responsible for any fees related to unsolicited resumes."}