{"jobID": "2827982647", "jobLocation": "Austin_TX", "jobTitle": "Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.keywcorp.com", "Headquarters": "Hanover, MD", "Size": "1001 to 5000 employees", "Founded": " 2008", "Type": " Company - Public (KEYW) ", "Industry": " Aerospace & Defense", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " CACI International, SAIC"}, "estimatedSalary": "116000", "jobDescription": " As a Data Scientist, you will support our customer’s mission looking for new and innovative ways of discovering devices, classifying devices, and extracting pattern-of-life from non-traditional sensors (including cyber network data). Work with a variety of structured/unstructured data sources. Produce novel research into anomaly detection, classification, discovery, and pattern-of-life from non-traditional sensor sources. Apply statistical processes and formulas to solve critical mission needs by extracting information from raw sources of non-traditional sensor data. Communicate findings to a non-technical audience of decision makers. Collaborate with an interdisciplinary team of data scientists, software engineers, dev ops engineers, and subject matter experts.  Required Skills: 7+ years’ experience applying quantitative/statistical principles to multiple types of dataExperience applying machine learning algorithms to large (TB/PB scale) data setsRecognized key contributor to a previous data-driven projectAbility to produce fundamental research results and objectives with minimal technical supervisionProven expertise in identifying salient machine learning algorithms to apply to new types of data with actionable results Location: Austin, TX  Clearance: Must be able to obtain and maintain a clearance, TS/SCI eligible  KeyW is an EEO employer. We are committed to providing fair and equal employment consideration, regardless of race, color, religion, national origin, gender, sexual orientation, age, marital status or disability.  KeyW is a pure-play national security solutions provider for the Intelligence, Cyber and Counterterrorism Communities' toughest challenges. We support the collection, processing, analysis and dissemination of information across the full spectrum of their missions. We employ and challenge more than 2,000 of the most talented professionals in the industry with solving such complex problems as preventing cyber threats, transforming data into intelligence and combating global terrorism.Apply!"}