{"jobID": "2824471891", "jobLocation": "San_Francisco_CA", "jobTitle": "Wireless Release Analyst", "companyRating": null, "companyInfo": {"Website": "meraki.cisco.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2006", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Aruba Networks, Aerohive Networks"}, "estimatedSalary": null, "jobDescription": " At Cisco Meraki, we know that technology can connect us, empower us, and drive us. By simplifying powerful technology we can free passionate people to focus on their mission. As the fastest growing cloud-managed networking team in the world, our products and technology architecture are changing the face of enterprise networking and making cloud-managed IT a reality.  We are seeking a senior leader for the Product Engineering and Hardware Program Management Team. We need a demonstrated leader and team builder to develop the people that will produce our next generation of products.Reporting directly to the Director of Hardware, this role offers a great opportunity to lead, hire, and develop a stellar team of technical leaders and program managers. A unique blend of strong design engineering and business minded program management, the Hardware Program Manager takes the lead on product, from architecture to sustaining. They control every aspect of creation from initial sketches to mass production, and are driving the rapid growth of Meraki's portfolio. What you will do:Manage a team of 10-20 Hardware Program Managers and product line technical leadsAllocate resources ranging from intern to senior across dozens of simultaneous projectsAssemble dynamic program teams on a per program basis, working with the other HW department leadsServe as the escalation path for all of Meraki's JDM R&D; leadsTrack and report status of all NPI programs to senior managementProvide leadership, mentorship, and development to all members of HWPM teamYou are:Phenomenally clear. You are able to distill complicated ideas to just the right number of words. You are an expert listener and can pinpoint what compels an audience.You are able to work between cross-functional teams, minimize conflict, and advise team members on building consensus.You use data and team member inputs to make decisions on prioritization and resource allocation. You set measures for success and are committed to quantifying impact.Fiercely collaborative. You take an organization-level view and are equally invested in the success of other departments. You invite and act on different points of view.Career champion. You invest in your team's development, both technically and career wise. You take the time to know what inspires and motivates each person and commit to making work meaningful.Talent manager. This team manages tight deadlines and works with the newest technology. You will provide opportunities for growth while managing workload.Protector. You are protective of Meraki's talent. You work to protect our strategic JDM talent and build the best external teams.You have:5+ years of leadership experience, managing a team of engineers in a joint development manufacturing (JDM) environment.10+ years in a hardware/product related roleExperience/Knowledge of technologies aligned with Meraki's portfolioEnd-to-end development on products of reasonable complexity.Familiarity with matrixed organizations, modern agile/lean engineering methods and modern philosophies of team building and retentionBS and/or MS in EE or related discipline.Minimum of 5 years of experience working with Asian supply chains.Able to travel up to 20% to Taiwan and China. Cisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records."}