{"jobID": "2769931321", "jobLocation": "Boston_MA", "jobTitle": "Principal Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.ge.com", "Headquarters": "Boston, MA", "Size": "10000+ employees", "Founded": " 1892", "Type": " Company - Public (GE) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Philips, Siemens, Microsoft"}, "estimatedSalary": "133000", "jobDescription": "About Us: Avitas Systems is a wholly owned subsidiary of GE, the worlds Digital Industrial Company. At GE and Avitas we are transforming industry with software-defined machines and solutions that are connected, responsive and predictive. Through our people, leadership development, services, technology and scale, Avitas delivers better outcomes for global customers by speaking the language of industrial inspection.  Avitas offers a great work environment, professional development, challenging careers, and competitive compensation. Avitas is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.  GE offers a great work environment, professional development, challenging careers, and competitive compensation. GE is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law. Role Summary: The Principal Data Scientist will be a key leader in the Data Analytics and Machine Learning team that will be responsible for curating and analyzing large sets of business and operations data of GEs customers across several industry verticals. This is an opportunity to make an impact across multiple industries in a fast paced environment where rapid prototyping and experimentation are prized. Essential Responsibilities:This role will be responsible for analyzing the data and creating descriptive and predictive models, by applying physics and data science modeling techniques. The Principal Data Scientist will very closely work with Subject Matter Experts, Business Analysts and customers to rapidly understand the domain, and build, test and iterate the analyses and models to create high-fidelity automated analytics solutions.  Responsibilities include but are not limited to:Work closely with Subject Matter Experts to gain deep understanding of various business and operations related data sets.Participate in data science workouts to shape data science opportunities and identify opportunities to use data science to create customer value.Conceive, design and implement machine learning and advanced analytics solutions to improve various business KPIs.Provide expertise in physics based modeling towards high fidelity predictive capability Work with the engineering team to incorporate your analyses and solutions, including working with the visualization team to create intuitive UI and rich UX stories.Communicate effectively with technical experts, business managers and customers.Collaborate with cross-functional teams across multiple offices and regions.Qualifications/Requirements: Qualifications/Requirements: Ph.D. with specific focus on machine learning, advanced data analytics or closely related quantitative discipline.Minimum 10 years of industry work experience.Experience with analytics development for industrial applications in a commercial/industrial setting.Experience with commercialization of analytics driven information solutions / SaaS, including field experience working with customers and clients.Proven experience in using well-established supervised and unsupervised machine learning methods for large industry-strength data analysis problems.Up to date with industry best practices for production-grade machine learning systems.Fluent with frameworks and languages such as Spark, Scala, R, Python, and MATLAB.Desired Characteristics:Experience  in physics based predictive modeling.Production-quality  developer in Python, C/C++, or Java.System  Engineering and API based integration experience for large production  systems.Excellent  organizational, interpersonal, communication (writing and public speaking)  skills.Locations: United States; Massachusetts; BostonGE will only employ those who are legally authorized to work in the United States for this opening."}