{"jobID": "2767424131", "jobLocation": "El_Segundo_CA", "jobTitle": "Senior Data Analysts", "companyRating": "3.2", "companyInfo": {"Website": "www.blueshieldca.com", "Headquarters": "San Francisco, CA", "Size": "5001 to 10000 employees", "Founded": " 1939", "Type": " Nonprofit Organization", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "81000", "jobDescription": "JOB DESCRIPTION Commercial Risk Adjustment is new to the industry (outside of Medicare Advantage), and will require deep and significant analysis, and data-mining, to help identify when a diagnosis is missing from a claims/encounter submission. This position will need to work closely with a multitude of departments, and be able to rapidly understand and navigate new situations and create solutions on the go.  In order to create an effective team, nearly every single individual on the team needs to be extraordinarily strong in their technical background, and have the ability to learn quickly. In particular, the analyst needs to be able to lead and develop new programs and new processes while simultaneously being able to develop analytical tools to support these new programs.  Senior Data Analysts need to be able to take charge and lead in situations where there is little guidance available, and still have the soft communication-skills to be able to articulate complex concepts to individuals lacking in a technical background. At the same time, their technical ability needs to be extraordinary strong as they will be working with IT to help trouble shoot any IT build-out to support these programs. Responsibilities include:Constructing analytics to support marketing positions and new business activities.Becoming knowledgeable of healthcare-related governmental regulations, procedures, and requirements.Other responsibilities as assigned.Education/Requirements:Requires minimum of a bachelor’s degree in a technical or quantitative field (GPA: 3.0 ) or equivalent combination of experience and education.Requires a minimum of 3 years of healthcare industry experience.Excellent interpersonal, verbal and written communication and presentation skills – especially presentations of complex, technical information to non-technical audiences.Leadership positions, public-speaking experience preferred.Programming knowledge required (sample code required).SQL knowledge required.Independent problem solver, proactive, able to multitask. Patience for working on large scale problems.Basic proficiency with MS Office assumed (including Excel, Access, Word, PowerPoint, and Visio). Preferred experience: Medicare or Commercial Risk Adjustment Experience.SAS programming knowledge preferred.VBA programming knowledge preferred.Finance experience, including revenue and expense accounting.Healthcare Enrollment and Claims processing experience.Other healthcare experience, especially technical experience."}