{"jobID": "2768375337", "jobLocation": "New_York_NY", "jobTitle": "Global Macro Quantitative Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.worldquant.com", "Headquarters": "Old Greenwich, CT", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "113000", "jobDescription": "WorldQuant develops and deploys systematic financial strategies across a variety of asset classes and global markets. We seek to produce high-quality trading signals (Alphas) through our proprietary research platform to employ trading strategies focused on exploiting market inefficiencies. Our teams work collaboratively to drive the production of Alphas and financial strategies the foundation of a sustainable, global trading platform.WorldQuants success is built on a culture that pairs academic sensibility with accountability for results. Employees are encouraged to think openly about problems, balancing intellectualism and practicality. Great ideas come from anyone, anywhere. Employees are encouraged to challenge conventional thinking and possess a mindset of continuous improvement. Thats a key ingredient in remaining a leader in any industry.Our goal is to hire the best and the brightest quantitative researchers. We value intellectual horsepower first and foremost, and people who demonstrate an exceptional talent. There is no roadmap to future success, so we need people who can help us create it. Our collective intelligence will drive us there.The Role: Research is at the core of WorldQuant. Through rigorous exploration and unconstrained thinking about how to apply data to the financial markets, our researchers are in constant search of new Alphas. We strive to understand data in ways our competitors dont believe is possible. Researchers at WorldQuant employ tested processes seeking to identify Alphas that we believe are undiscovered by the wider market. These signals are mathematical expressions of data that are used as inputs in our quantitative models.WorldQuant is seeking an exceptional individual to join the firm as a Global Macro Quantitative Analyst and help drive the build out of a new quant macro business. While prior finance experience is not required, a successful candidate must possess a strong interest in learning about finance and global markets. Candidates will have a research scientist mind-set; be a self-starter, a creative and persevering deep thinker who is motivated by unsolved challenges. A successful candidate will focus on theorizing, reasoning, and investigating how to address various aspects of trading in the macro space.Its Impact: Quant Macro is a new business line that aspires to be a strong contributor to WorldQuants continued growth and success. WorldQuant continues to diversify our unique investment platform, which is a leader amongst its peers. We desire people who are driven by new challenges and will help us in our relentless pursuit to succeed.What Youll Bring:Ph.D. or M.S. degree from a leading university in a quantitative or highly analytical field (e.g. - Electrical Engineering, Physics, Computer Science, Mathematics, Financial Engineering)Graduated at the top of your respective educational program, with excellent problem solving abilities, insight, and judgment with a strong attention to detailDemonstrated ability to program, preferably in Python, C++ or another leading languageAdvanced practitioner-level knowledge of statistical inference, machine learning, software solvers, and/or mathematical optimizationStrong communication skills; ability to express complex concepts in simple terms"}