{"jobID": "2728293850", "jobLocation": "Cambridge_MA", "jobTitle": "IT Systems Engineer", "companyRating": "3.3", "companyInfo": {"Website": "www.aurora.aero", "Headquarters": "Manassas, VA", "Size": "501 to 1000 employees", "Founded": " 1989", "Type": " Company - Private", "Industry": " Aerospace & Defense", "Revenue": " Unknown / Non-Applicable", "Competitors": " General Atomics, Northrop Grumman, Raytheon"}, "estimatedSalary": "90000", "jobDescription": " Job Qualifications: Exciting opportunity for someone who is ready to grow with a cutting-edge company and further their career. Qualified candidate will provide computer, network, and infrastructure support to ensure end users can accomplish organizational tasks. This involves managing and monitoring all installed systems and infrastructure; installing, configuring, testing and maintaining operating systems, applications software, and system management tools; maintain security, backup, and redundancy strategies; participate in the design and deployment of information and operational support systems; and providing technical support and advice to users of the Aurora network at the Cambridge site and associated satellite offices. Specific Responsibilities: The Systems Engineer will be responsible for managing all phases of client technical assistance to Aurora employees, contractors, and guests at the Cambridge facility and associated satellite offices of Aurora. The candidate would report directly to the IT Manager for AMA. Responsibilities include: •Adhere to all AFS information technology and security policies, maintaining a focus on data security •Provide the capability for hardware and software engineers and developers to work unrestricted in a safe environment with a methodology to securely transfer work products to our enterprise network •Manage and monitor information systems and infrastructure •Install, configure, test and maintain operating systems, applications and system management tools •Proactively ensure the highest levels of systems and infrastructure availability •Write and maintain custom scripts to increase system efficiency and reduce touch labor •Participate in the design of information and operational support systems •Monitor and test network and application performance for potential bottlenecks, identify possible solutions, and work to implement fixes •Maintain security, backup, and redundancy strategies •Liaise with vendors and other IT personnel for problem resolution •Prioritize work to meet level of service deadlines •Entering, prioritizing, documenting, and actively resolving user support requests •Provide cross-site support, both remotely and when necessary in-person. •Active Directory administration Requirements: Qualified candidate must have BS/MS in Computer Science or related field; proven work experience in installing, configuring, and troubleshooting software development environments; experience with virtualization and containerization; networking and scripting skills, five to eight years of experience in Information Technology and be comfortable working in a fast-paced dynamic environment. The candidate must have experience supporting Windows and Linux operating systems. Candidate MUST be a US person. Required: Candidate must have experience in the following technologies and disciplines: •Experience managing software development environments and working with software developers •Network device, service, and topology management and troubleshooting methodologies •Windows and Linux administration in an Windows domain using Active Directory •Virtualization experience in a VMware based infrastructure environment Preferred: A preferred candidate is an enthusiastic self-starter, with initiative and drive to get the job done. The candidate can show a successful track record of client facing projects in an enterprise environment, as well as starting-up new sites. •The candidate is familiar with NIST 800.171 and ITAR compliance strategies in an enterprise environment •Office365 platform (Skype For Business, Office 2016, SharePoint, OneDrive) •Experience with revision control technologies (eg. GIT and SVN) •Experience supporting/designing Skype for Business/Teams Room Systems with attached AV equipment •Experience with KACE ESMA Physical Requirements: The Candidate must be able to lift and transport moderately heavy objects such as computers and peripherals. Shift Requirements: On occasion work after normal office hours will be required to address outages and perform some maintenance tasks. Occasional travel to other sites to assist in projects/client support will be required. Aurora Flight Sciences is an Equal Opportunity Employer"}