{"jobID": "2610648428", "jobLocation": "Boston_MA", "jobTitle": "Clinical Supervisor", "companyRating": null, "companyInfo": {"Website": "www.ne-aba.com", "Headquarters": "Wakefield, MA", "Size": "51 to 200 employees", "Founded": " 2015", "Type": " Unknown", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " New England ABA, a leading provider of ABA therapy in the Greater Boston area, is currently seeking a full time BCBA! What we offer at New England ABAHighly competitive salary! New England ABA will never lose an amazing candidate over pay rate and will match or exceed any competitive offers.Comprehensive benefits package (medical, dental, vision) for all full time BCBAs.Professional Development yearly stipend to attend conferences, seminars, etc.Unique monthly employee incentive program.The chance to join a growing practice with great career growth potential for interested BCBAs. Our culture is one of collaboration, consistent communication, and support for all of our staff.Small/manageable caseloads focused on clinical quality.Caseload located in specific region to reduce travel distance and time.Flexible scheduling and ability to work remotely or in office setting during morning and early afternoon hours.Our in house office support team handles all billing, scheduling and other administrative tasks so our BCBAs can focus solely on delivering state of the art ABA therapy to our clients!Part-time positions available!Overview Looking to make an impact in the lives of children, adolescents and their families living with Autism? Would you like to join a thriving ABA practice where you can build a career?  BCBAs at New England ABA provide clinical oversight to Behavior Technicians in the field. Duties include writing behavior intervention plans, establishing how goals are targeted, structuring sessions in a productive manner, evaluating Behavior Technicians clinical growth and mastery of professional development goals and other clinically related tasks. Our BCBAs are leaders within our organization who help grow our staff by leading trainings and providing workshops. Most client sessions are from 3-8PM providing flexible scheduling during morning and early afternoon hours. Perfect opportunity for a BCBA working in a school district looking to grow their career! Job requirementsCurrent licensed applied behavior analyst (LABA) in the state of Massachusetts required.2-5 years working directly with children and adolescents with ASD required.Experience with VB, PECS, DTT, PRT and ESDM a plus.What we are looking forPositive, solution focused attitude.Our culture is one of an open minded, family first approach.Leadership skills needed to fill potential management roles within the practice.Strong knowledge of ABA fundamentals and a person centered approach to therapyInterested in professional growth through the use of a growth oriented mindset.Proven track record of growth and success in prior employment.New England ABA provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics."}