{"jobID": "2778104315", "jobLocation": "Los_Gatos_CA", "jobTitle": "Business Operations - Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.import.io", "Headquarters": "Los Gatos, CA", "Size": "1 to 50 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Connotate, Scrapinghub, Mozenda"}, "estimatedSalary": null, "jobDescription": " We are smart, scrappy, fun, and committed to being enormously successful!  Effective use of data can provide incredible efficiency and value to almost any business, from the smallest independent company to the largest multi-national. But, it can also advance education, academic research, charitable work, investigative journalism, and many other efforts that help to make our world a better place.  Import.io delivers a SaaS product that enables users to convert the mass of data on web sites into structured, machine readable data with no coding required. Our highly efficient and scalable platform allows customers to process 1,000s of URLs concurrently or on a schedule and gain access to millions of rows of data that they use for hundreds of different use cases. Most common uses include building training/testing sets for machine learning models, doing retail price monitoring analysis, lead generation activities, application development, market research, academic research, store locations etc.  JOB DESCRIPTION:  We are looking for a data rock star. Your sweet spot is developing insights through complex analysis, and presenting those findings and recommendations in an intuitive, consumable way. You have outstanding analytical skills and a data-driven mindset to effectively structure complex problems and ideas into easily digestible frameworks. You have an entrepreneurial mindset (self-motivated, tenacious, resourceful, no handbook necessary). In addition to being business-savvy, you are technical and can support a cloud-based data storage approach (think AWS) coupled with visualization/distribution.  You will start by developing a detailed understanding of our business. Anchoring yourself to the overall corporate financial plan, you will help develop the repeatable data analytics that enable us to better plan and track success. You are comfortable exploring large data sets to develop insights and proactively generate compelling recommendations.  RESPONSIBILITIES:  Build and maintain strong trusted technical relationships with prospects and customers: Work with CEO and leadership as a trusted advisorConnect data from multiple sources to uncover findings, support actionable solutions, and tell a compelling storyBuild models, dashboards, and track key business metricsWork collaboratively cross-functionally on process improvement which minimizes impact but improves data quality standardsProvide and support ad-hoc reportingMaintain all standard Saas metrics such as CAC, LTV, funnels, cohorts, retention, DAUs/MAUs, Pirate Metrics (AARRR)Collaborate cross functionally to develop a deeper understanding of business needs as well as secure various points of view to create alignment SKILLS: Comfortable working with large data setsWizardry in ExcelYou are working towards being a Tableau/Looker expert but you are a SQL ninja and may also have experience with advanced analysis - R, PythonExcellent communication skillsAttention to detailCreative problem-solving skills and a can-do positive attitudeStrong intellectual curiosityBachelors Degree in Computer Science, Statistics, Applied Mathematics, or Data Science required We provide competitive compensation and generous benefits. This is a very collaborative and inclusive work environment where individuals strong on aptitude and attitude will have an opportunity to grow their professional careers through working with some of the most advanced technology."}