{"jobID": "2788949973", "jobLocation": "Boston_MA", "jobTitle": "Lead Data Scientists and Cognitive Software Engineer", "companyRating": null, "companyInfo": {"Website": "www.statestreet.com", "Headquarters": "Boston, MA", "Size": "10000+ employees", "Founded": " 1792", "Type": " Company - Public (STT) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " J.P. Morgan, BNY Mellon, Northern Trust"}, "estimatedSalary": null, "jobDescription": " The Lead Data Scientist and Cognitive Engineer will lead one of our Cognitive agile teams through the phases of use-case data exploration and prototyping to the design, implementation and deployment of the resulting Cognitive services supporting the use-case.  Responsibilities:: Become Subject Matter Expert in Data Science and Machine LearningLead a team of data scientists, machine learning engineers, software engineers and QA engineers.Lead and mentor junior team members in data collection, preprocessing, feature engineering, data visualization and analysis.Engage with lines of business, users and analysts to explore and prototype opportunities and use-cases exploring data and the application of cognitive and machine learning technologiesBuild automated data collection and preprocessing pipelines.Build models to address business problemsLead the design, development, testing and support of Cognitive microservices, operationalizing and productizing resulting models and cognitive solutions.Qualifications:Bachelor’s degree (preferably in Computer Science), Masters preferred5+ years of modern, object-oriented or functional programming experience, (Java, C++, Python, Scala, SQL, R)Proven experience as a Data Scientist, Data Analyst or Machine Learning engineer.Strong background in math, statistics and analysis.Experience in any of the following is highly desirable: o Leading a software development team  o Data Science and Machine Learning Frameworks (“R”, Apache Spark / MLlib, TensorFlow, Scikit-learn, etc…)  o Natural Language Processing (NLTK, CoreNLP, Gensim, Spacy, etc..)  o Experience with Big-Data technologies and cloud (Hadoop, AWS, other)  o Linux / Bash scripting  o Relational databases (Oracle, PostgreSQL, MySQL, etc.)  o Agile development methodology  o CI/CD Development environments and tools (GIT, Maven, Jenkins, etc)  o RESTful Microservice APIs Strong analytical skills. Previous experience or education focused on statistics or data science is valuable.Communication skills. The ability to communicate at the right level with all parties involved, including senior management and business owners."}