{"jobID": "2830872851", "jobLocation": "Palo_Alto_CA", "jobTitle": "Business Operations Analyst Intern", "companyRating": "4.2", "companyInfo": {"Website": "www.vmware.com", "Headquarters": "Palo Alto, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (VMW) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "106000", "jobDescription": " VMware's Solutions and Product Marketing organization is looking for a high-energy, top-tier Business Data Analyst to join our Business Operations team. Your primary focus will be to apply your real passion for data analysis and business insight to craft new ways to drive optimization and improvement of marketing techniques and business strategies.  If you are a self-starter, creative, diligent, energetic, and passionate and ready to work with an experienced, fun team in a dynamic environment, then you'll have significant impact on VMware's business globally. Skills:Outgoing personality - able to work interactively and independently Possess strong eye for business - possess a broad, enterprise-wide view and understanding of processes and capabilities, enabling technologies, and governance Communication - Clearly articulate requirements and process within and across the team verbally and in writing AnalyticalApproach Visualize, articulate, or conceptualize complex & uncomplicated problems and make decisions. Use data to support conclusions and actions. Extraordinary interpersonal skills - Able to communicate effectively, provide and accept delegation. Responsibilities:Analyze data for quality, quantity, and accuracyPerform proof of concept analysesDevelop, collect and analyze metrics and data to formulate fact-based decisions and actively implement process improvementsPerform analysis due diligence to discover root cause of challenges and articulation of business needsCollaborate with subject matter experts, marketing and sales leaders, operational MDM and BI teams to understand business processes, identify business challengesAnalyze several project datasets for early data modeling prototypesDesired Requirements:Currently pursuing a BS degree in Analytics, Business, Marketing or a related fieldKnowledge crafting and optimizing SQL queries for Postgresql and SAP HANA environmentsAbility to use Tableau, Power BI and SAP Business Objects effectivelyStrong Microsoft Excel and PowerPoint skillsStrong analytical skillsExcellent written and verbal communication skillsPossess excellent time management and prioritization skills to meet multiple deadlinesComfortable working in a high-paced/high production environment Note to Students from outside the US: While any student with a legal right to work in the U.S. may apply for this role, you should be aware that VMware does not sponsor work visas for the entry-level roles these Internships may prepare you for."}