{"jobID": "2683985837", "jobLocation": "San_Jose_CA", "jobTitle": "Social Media Marketing Intern", "companyRating": "2.9", "companyInfo": {"Website": "www.toshiba.com/taec", "Headquarters": "Irvine, CA", "Size": "1001 to 5000 employees", "Founded": " 1989", "Type": " Subsidiary or Business Segment", "Industry": " Manufacturing", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Texas Instruments, Intel Corporation, Samsung Electronics America"}, "estimatedSalary": "46000", "jobDescription": " Here at Toshiba Memory America, our creative force in the world of storage represents an extraordinary talent of people with a diverse range of skill-sets, interests and backgrounds carefully orchestrated to architect and design innovative SSD solutions.  Our culture is composed of intelligent, curious people who collaborate respectfully together and are stimulated when being stretched beyond technical comfort zones and who thrive on challenges and technological diversity. Simply put, our internship program will engage students with the opportunity to experience the real world of high tech while providing a practical understanding of SSD technologies as well our culture.  TMA is looking for passionate and driven students from all disciplines and beyond to be a part of our summer internship. We offer an invigorating program where interns will be contributing to projects with meaningful outcomes this is not a coffee and copy internship. Our internship runs eight weeks during the summer between June and August and is open to students with a minimum of two years of college from an accredited 4-year university. While our goal is to groom a talent pool of future employees we cannot guarantee an internship will transition to full-time position. Corporate Marketing Intern We are seeking an intern to join our Flash Matrix team for summer of 2018! Do you have an eye for design, an aptitude in product/technical marketing, a passion for using social media to drive awareness, and/or an interest in the modern marketing transformation? Are you a person with enthusiasm and out of the box thinking ability, with capabilities to work within a marketing organization in order to take a brand new, unique, state-of-art product into newly formed markets using social media? Then this role is just for you!  Key Responsibilities will include: Working with product and outbound marketing to create and drive a social media strategyCreating measurable results for implementing such a strategyWorking with marketing to generate social media collateralAdministering and oversee all social media activitiesAligning our social media activities with marketing communications activities such as conferences, consortia, product announcements and marketing materialsWorking with product and outbound marketing to involve our ecosystem partners on planning and executing social media activities Requirements: 3 years of Engineering studies or equivalent (Junior / senior status) OR3 years or Business Administration studies with a minor in any science discipline (Junior / senior status)IoT (Internet of Things) domain experience or social media experience a plusExperience / studies with any type of cognitive computing (machine learning, language processing, video analytics, etc.) a plusExperience / studies with Big Data and storage a plus We are an Equal Opportunity/Affirmative Action Employer including: Minorities/Women/Individuals with Disabilities/Protected"}