{"jobID": "2785352307", "jobLocation": "New_York_NY", "jobTitle": "Partner - Pharma Brand Insights", "companyRating": null, "companyInfo": {"Website": "www.hallandpartners.com", "Headquarters": "London, United Kingdom", "Size": "201 to 500 employees", "Founded": " 1991", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Kelton, Ipsos, Millward Brown"}, "estimatedSalary": null, "jobDescription": "Who we are We help our clients build brand relationships that matter, that are commercially and emotionally rewarding. We do this by understanding people and closing the relationship gap between businesses and people.  Our positioning is as a strategic brand consultancy, powered by data and insight. We work with some of the world’s biggest companies shaping their brand relationships for them.  We do this through disciplined strategic thinking. This then acts as a driving force to extract hidden insights from further research investigation and data analytics. Role As a Partner, you will play a key leadership role in our business. You lead a team and business and are responsible for growing revenue from existing clients and building new revenue streams from new clients through new services and products.  You recognize the changes in the competitive landscape and the need to digitally transform our business. You drive adoption of the new thinking, new tools and methodologies to stay ahead. You use clear strategic thinking and your broad experience to build strong personal relationships and influence clients’ strategic decision-making. You are responsible for the profitability and efficiency of your business.  You are well networked and skilled in building strategic client relationships at a senior level. A Partner position shows that you also have the entrepreneurial drive and strategic capability to build the business.  You join the management team and so have a responsibility to inspire your office/division to experiment with different ways of delivering strategic advice to clients. You’ll have a strong relationship with the Managing Partner in your office; - supporting them, raising their awareness of key issues, leading initiatives you develop together and taking responsibility with them for running the business. You recognize and support the need to build a strong team culture in your teams and across the wider business. Core responsibilities Act as a strategic advisor and develop senior-level relationships.  Lead our digital transformation in a local office or business area driving our new way of working through the Hub.  Well-networked, identifying and winning new business opportunities. Leading pitches and looking for opportunities to develop existing clients.  Responsible for overall profitability and business development over core accounts. Achieving a large revenue target and healthy profit margin. Seek new ways to develop revenue and cross-selling.  Lead a team, creating an environment in which employees are empowered and can do their best. Helps the team acquire the skills needed to deliver our strategy by identifying and actioning ways for them to learn, stretch and grow.  Embrace new thinking, innovation, technologies and methodologies, ensuring teams have the information and tools to run with them.  Live and breathe our strategy internally and externally. Create a plan to bring the strategy and business tools to life for all the team in their roles.  Oversee the team’s output ensuring that only the highest quality work is presented to clients. Ensure understanding and use of our thinking and tools.  Have a strong understanding of the evolving media landscape, the role of digital and the H&P; products. Ensures digital is integrated into client strategies.  Collaborate with other H&P; divisions as needed to deliver outstanding and unexpected business solutions on both new pitches and continued client relationships.  Actively network and stay up to date with developments in our industry and beyond, identifying and actioning new ways of doing things. Build relationships with external experts and Omnicom partners. Key attributes We are looking for a proactive, positive strategic leader with who can inspire and lead teams to deliver our business vision. 12+ years of experience in blended research healthcare/pharma approaches (quantitative and/or qualitative research) is a must. Courageous. Proactive, gets involved and takes decisions when needed. Change agent, helping your teams to look forward, take risks and focus on the big picture. Creative. Demonstrates a love of people and brands, steps outside the ordinary to surprise and delight clients with inspiring deliverables. A problem solver, thinking pragmatically to make the complex simple. Curious. Shows a hunger to learn and innovates and experiments at work. Embraces new ideas and ways of working. Collaborative. Inspiring people leader and coach with strong emotional intelligence. Leads with a positive attitude and has a pragmatic, problem-solving approach.  Commercially-focused and able to create and sell broad thinking and innovative solutions.  Strong project and stakeholder management skills. Able to lead and prioritize to deliver outstanding quality on time.  Outstanding presentation and storytelling skills.  Highly motivated and driven, with a hunger to win and grow our business.  Able to travel extensively as the job requires. What we offer you We believe we have a unique culture. It’s a difficult thing to put into words but it’s all about being challenging yet treating each other with respect. We are naturally curious and we love to learn and discover new things.  We nurture opinions and really respect people who have a point of view and aren’t afraid to share their thinking. We work as teams and responsibilities sit with everyone in that team, whatever their job title. A can-do attitude goes a long way in our business and we don't tolerate egos!  We are passionate about helping our people to learn, stretch and grow. We want this to be a place where people feel challenged, as well as guided and supported. They learn a lot from the people around them and taking on new challenges or stretch projects.  We are part of Omnicom Media Group and there are extensive opportunities to network, learn from and partner with other agencies across the group. Benefits We want our people to feel rewarded for the great work they do. Here are some of the benefits we offer.  Comprehensive benefits program (including medical, dental and vision coverage)  401k program  Group life insurance  Generous vacation policy  Discretionary summer Friday bonus days  Employee Discount programs  To find out more about Hall & Partners click here to check us out online. Hall & Partners is an equal opportunity employer and are strongly committed to promoting equal opportunity. We maintain an Equal Opportunities, Diversity and Anti-Harassment Policy to inform, guide and encourage equal opportunities practices within the Company. We are also part of the Omnicom group and together we promote and embrace equality and diversity through anumber of initiatives such as Omniwomen, ADCOLOR and Open Pride. You can read more about our commitment to do equalityand diversity here: http://www.omnicomgroup.com/culture/diversity/."}