{"jobID": "2727537604", "jobLocation": "New_York_NY", "jobTitle": "Senior Associate - Technical Accounting Consulting (TAC)", "companyRating": null, "companyInfo": {"Website": "www.rsmus.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1926", "Type": " Private Practice / Firm", "Industry": " Accounting & Legal", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " RSM is looking for a dynamic Senior Associate to join our new Technical Accounting Consulting (TAC) team in our NYC office. Changing economies, new accounting policies and evolving tax regulations mean that business and professional services firms face an ever-changing business landscape. With more than 80 years of industry expertise, RSM has helped thousands of firms to achieve their business objectives. Our clients include firms in a variety of industries, including financial services, technology, and commercial to name just a few. Experienced in serving clients with a local, national or international presence, and a number of diverse organizational structures, our professionals can help develop meaningful solutions for your business.  Responsibilities:  · Participate in multiple engagements within the Technical Accounting Consulting practice to provide technical accounting and financial or business advisory guidance to clients  · Demonstrate basic to intermediate knowledge of complex financial accounting concepts  · Commit to maintaining and developing current and effective technical accounting capabilities by leveraging extensive firm resources  · Provide timely, high quality client service that meets or exceeds client expectations including coordinating the development and execution of the consulting work plan and client deliverables  · Collaborate directly with the engagement manager and partner and the client  · Develop an understanding of the client's business and industry and begin to recognize key performance drivers, trends and developments  · Actively participate with engagement team and function as an in-charge facilitating field work by monitoring and reporting regarding productivity and adherence to work plan schedules on each assignment  · Assist in the preparation of technical memos and other client deliverables  · Identify performance improvement opportunities  · Understand RSMs service lines and work as a team in providing an integrated service delivery  · Recognize and inform management of opportunities to increase level and types of services to clients  · Willingness to travel 10% of the year, depending on clients  Required Qualifications:  · BS/BA Degree in Accounting or equivalent degree  · 2+ years of current or recent experience in a public accounting environment, auditing financial statements  · CPA Certification or demonstrated progress towards obtaining CPA certification, including required coursework  Preferred Qualifications:  · Strong technical knowledge in GAAP for both public & private companies  · Experience with revenue recognition, complex debt and equity financings, financial instruments, business combinations  · Advanced written and verbal communication skills  · US certified public accountant (CPA) license in the US state of primary work location or sufficient coursework to achieve US CPA certificationYou want your next step to be the right one. You've worked hard to get where you are today. And now you're ready to use your unique skills, talents and personality to achieve great things. RSM is a place where you are valued as an individual, mentored as a future leader, and recognized for your accomplishments and potential. Working directly with clients, key decision makers and business owners across various industries and geographies, you'll move quickly along the learning curve and our clients will benefit from your fresh perspective.  Experience RSM US. Experience the power of being understood.  RSM is an equal opportunity/affirmative action employer. Minorities/Females/Disabled/Veterans. "}