{"jobID": "2750985943", "jobLocation": "Sunnyvale_CA", "jobTitle": "Research Intern - FLA", "companyRating": null, "companyInfo": {"Website": "www.fujitsu.com", "Headquarters": "MINATO-KU, Japan", "Size": "10000+ employees", "Founded": " 1935", "Type": " Company - Public (FJTSY) ", "Industry": " Unknown", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Atos, Hewlett Packard Enterprise | HPE, IBM"}, "estimatedSalary": null, "jobDescription": "Title: Research Intern FUJITSU LABORATORIES OF AMERICA, INC. (FLA) was established in 1993 as a wholly owned subsidiary of Fujitsu Laboratories Ltd., which is a wholly owned subsidiary of Fujitsu Ltd., focusing on contributing to Fujitsu's technology value chain. FLA conducts advanced research in Device, Component, and Platform Innovations, Network and Trusted Systems Innovations, and Internet Service Innovations. FLA also conducts research in an open and networked laboratory environment, and contributes to Fujitsu global business through developing and expanding leading edge technologies, promoting the creation of new businesses, and the creation of global value chain while fulfilling its social responsibilities. FLA contributes to the world of research communities through joint research projects with universities and research organizations, and through the free exchange of ideas at technical conferences.Job Description for Internship at Cyber-Physical System LabThe candidate will work on either or both of the following tasks.Implement intelligent data processing solutions combined with web automation technique to improve automated testing platformAlgorithm implementation and improvement (e.g. NLP, machine learning) to identify concepts and entities in textThe candidate must be a Master student in computer science, EE or similar field. He or she should be proficient in Python, and/or Java (preferably Python). Moreover, the candidate should have basic knowledge on how REST/WEB APIs work and Server/Client side programming. In addition, knowledge and experience in Natural Language Processing (NLP) and Machine Learning (ML) techniques and data processing are highly preferred. "}