{"jobID": "2707883353", "jobLocation": "Weehawken_NJ", "jobTitle": "Investment Analytics - Delivery Lead", "companyRating": null, "companyInfo": {"Website": "www.ubs.com", "Headquarters": "Zurich, Switzerland", "Size": "10000+ employees", "Founded": " 1862", "Type": " Company - Public (UBS) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Deutsche Bank, Credit Suisse, Morgan Stanley"}, "estimatedSalary": null, "jobDescription": "Your RoleThe Data Analytics Technical Lead will provide architectural and technical leadership to a growing team focused on delivering cutting edge data intensive analytical platforms & solutions.  A Data Analytics Technical Lead will be responsible for delivery and will take a hands on approach in the design and build phases. The team utilise the latest in Big Data, Cloud, Open source & Data Science tools & techniques. Major Duties/Responsibilities: · Working with business domain experts to identify detailed data needs, sources, and structure to support solution development.  · Determining technical approaches to be used, and defining the appropriate methodologies  · Providing overall solution architectural leadership including the ability to influence other technical experts and drive teams to align on technical solution options quickly  · Must be capable of working in a collaborative, multi-site environment to support rapid development and delivery of results and capabilities (i.e. AGILE SDLC)  · Effectively communicating technical analyses, recommendations, status, and results to IT and business management and executives in business terms  · Excellent leadership skills: Ability to build effective partnerships with leaders in the businessYour teamUBS Asset Management's growth strategy requires a highly scalable and robust global operating platform for effective and efficient investment research, low organizational complexity, ability to grow top line without linear cost growth, and fully align investment with strategic growth priorities. In order to achieve this goal, Asset Management is renovating its front-office technology stack to. AM Investment Domain Data Program will create a competitive advantage for the business through unique and adaptive data, analytics & research capabilities. Current AM data architecture is highly fragmented and does not satisfy divisional needs. The objective of AM Investment Domain Data Program is to drive a centralized set of services, with data integrity & governance, high performance, smart analytics & flexibility.Your experience and skillsMinimum Required Skills and Education:  · Bachelors (IT/Computer Science Preferred); Master’s Degree preferred (IT/Computer Science Preferred) or equivalent experience  · 8-10 years of industry experience in analyzing source system data and data flows, working with structured and unstructured data, and delivering data and solution architecture designs.  · Experience with clustered/distributed computing systems, such as Hadoop/MapReduce, Spark/SparkR, Lucene/ElasticSearch, Storm, Cassandra, Graph Databases, Analytics Notebooks like Jupyter, Zeppelin etc  · Experience building data pipelines for structured/unstructured, realtime/batch, events/synchronous/asynchronous using MQ, Kafka, Steam processing.  · 5+ years of experience as a data engineer/solution architect designing and delivering large scale distributed software systems, preferably in large scale global business- preferably using open source tools and big data technologies such as Cassandra, Hadoop, Hive, Prestodb, Impala, HBase, Spark, Storm, Redis, Drill etc  · Strong hands-on experience of programming with Java, Python, Scala etc  · Experience with SQL, NoSQL, relational database design, and methods for efficiently retrieving data for Time Series Analytics.  · Knowledge of Data Warehousing best practices; modeling techniques and processes and complex data integration pipelines  · Experience gathering and processing raw data at scale (including writing scripts, web scraping, calling APIs, write SQL queries, etc.)  · Excellent technical skills – able to effectively lead a technical team of business intelligence and big data developers as well as data analysts. Optional Skills: · Experience in Machine Learning, Deep Learning, Data Science  · Experience with Cloud architecture & service like AWS, Azure  · Experience with Graph, Sematic Web, RDF Technologies  · Experience with Text Analytics using SOLR or ElasticSearchWhat we offer"}