{"jobID": "2814971182", "jobLocation": "Boston_MA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.optimusride.com", "Headquarters": "Boston, MA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About Optimus RideOptimus Ride is a self-driving technology company working to enable safe, sustainable, and equitable mobility solutions. We aim to transform cities and lead the way for a more sustainable future through the introduction of self-driving technologies.Optimus Ride is based in the Boston Seaport District. Our team hails from a diverse set of backgrounds, and cumulatively has decades of experience building self-driving vehicles, electric vehicles, manufacturing robots, surgical robots, autonomous drones, and more. We aim for a highly collaborative, hands-on, and open environment where peers learn from each other while building technologies for real-world environments.The RoleOptimus Ride vehicles and systems generate large volumes of rich, complex data that are used both on- and off-vehicle to make decisions with real world consequences. We are looking for data scientists who are excited by the challenge of handling and processing complex dataflows to help make self-driving vehicles a reality. You will work with people across the company to both identify the important questions to ask and develop the tools and techniques to answer those questions.Our team is focused on a rapid path to market in order to maximize the benefits of self-driving technologies for all. To do this, we need our scientists and engineers to be versatile, have leadership qualities, and be enthusiastic about tackling problems across the full range of our systems. Working at Optimus Ride you will innovate with engineers and designers who cumulatively have decades of experience in software development, computer vision, machine learning, sensing and actuation, human-machine interface, and design. You will be creating new technologies through software development that integrates your areas of expertise to enable self-driving systems to be possible today.Responsibilities Develop algorithms and software to analyze self-driving vehicle dataCollaborate with the operations and engineering teams to identify key questions, and develop the tools to answer those questionsDesign, implement, and drive large data processing projectsDevelop and maintain production quality codeRequirementsBS/MS/PhD in computer science, statistics, a related field, or equivalent experienceExperience with Python and Java, or ScalaExperience with one or more distributed computing environments, such as Spark, MapReduce, etcExperience with relational databasesExcellent communication skillsInterest and ability to learn additional skills and technologies as required Bonus Experience in statistical analysisExperience in data visualizationExperience with Git, Linux, shell scriptingBenefits and Working EnvironmentAt Optimus Ride, we strive to support our employees by offering competitive compensation, comprehensive benefits and a world class working environment that is centered around the team. We nurture creativity and provide expansive opportunities for growth and development."}