{"jobID": "2830930225", "jobLocation": "New_York_NY", "jobTitle": "Merrill Lynch Financial Advisor Development Program", "companyRating": null, "companyInfo": {"Website": "www.bankofamerica.com", "Headquarters": "Charlotte, NC", "Size": "10000+ employees", "Founded": " 1904", "Type": " Company - Public (BAC) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Description: THE FADP PROGRAM SETS YOU UP FOR SUCCESS AS A FINANCIAL ADVISOR  Our advisor development program is an award-winning program[1] for professionals who wish to build a wealth management business. You will be a part of a best-in-class training curriculum and new advisor mentoring that has been our strength since 1946. The program is designed to help you come up to speed quickly as a successful financial advisor. Well help you develop the critical skills and knowledge necessary for establishing a robust wealth management businessacquiring clients, developing relationships, providing tailored strategies and more.  You will also be able to use the deep resources and full capabilities of both Merrill Lynch and Bank of America. With our tools, powerful platform and ongoing team support, you can spend more time on what matters most to you and your clients. Our open-door, collaborative culture will give you the type of leadership support you need and the confidence that your firm is always behind you.  Compensation and program benefits: Base salary through the full 43 months with bonus potentialPreparation for registration exams, including Series 7 and Series 66Ongoing access to firm and banking partners to meet client needsMarket viewpoints, investment strategies, and model portfolios that help you scale efficiently from a unified Chief Investment OfficeWealth Outlook tools platform to manage clients goals-based financial strategies  What youll do: As a Merrill Lynch Financial Advisor, you will leverage your Merrill Lynch support team to help your clients pursue and meet their goals.  Your responsibilities are, but not limited to: Developing and/or growing a book of business to meet and exceed pre-defined goalsEffectively sourcing prospective clientsRecommending investment products and services that are suitable for prospects and clients based on their goalsBalancing investment management, sales activities, and new client developmentEstablishing and maintaining a relationship with the management team to effectively deliver reports and receive mentorship  Who you are: You are open-minded and ready to make a career transition to grow as a Financial Advisor. You demonstrate rapid advancement by exceeding goals while adhering to high professional standards and integrity. You are not afraid to take initiative, actively use our resources, and are uncompromising about serving your clients best interests.  You have: Strong relationship and interpersonal skillsBachelors degree or higher  About us Merrill Lynch Wealth Management is a leading provider of comprehensive wealth management and investment products and services for individuals and businesses. We specialize in goals-based wealth management, including planning for retirement, education, legacy, and other life goals through investment advice and guidance. Our advisors help clients pursue the life they envision through a one-on-one relationship committed to their needs. Were here to provide a supportive environment so you can focus on assisting your clients better and deepen relationships.  [1] Merrill Lynchs Financial Advisor Development program (FADP), formerly called Merrill Lynch Practice Management Development (PMD) program, won a Gold Award for Best Sales Training and Performance Program in the 2017 Brandon Hall Group Sales Performance Awards. Shift:1st shift (United States of America)Hours Per Week:37.5"}