{"jobID": "2823961503", "jobLocation": "Seattle_WA", "jobTitle": "Data Scientist, Analytics - Ads Foundations", "companyRating": "4.5", "companyInfo": {"Website": "www.facebook.com", "Headquarters": "Menlo Park, CA", "Size": "10000+ employees", "Founded": " 2004", "Type": " Company - Public (FB) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Google, Snap, Uber"}, "estimatedSalary": "139000", "jobDescription": " Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities we're just getting started.The Ads Foundations team builds the bedrock infrastructure that Facebook's Ads are built on to help us achieve this mission. We are responsible for building solutions for Facebooks largest advertisers and partners through our APIs as well as hundreds of Facebook engineers who rely on our work to build stable solutions. We are focused on building for the future of Facebook ads which includes things like building more transparent systems, building more intuitive ads creation and management, rethinking the infra Ads systems run on to increase efficiency, among many others. This role has a wide opportunity for impact across many of the Ads systems at Facebook, directing the future of our technology, and impacting teams that create products that drive tens of billions of dollars of ad spend. We are looking for a Data Scientist who loves a technical challenge and doesn't shy away from difficult problems and can drive data science initiatives across a team of at least 40 engineers. Responsibilities:"}