{"jobID": "2771140271", "jobLocation": "Oakland_CA", "jobTitle": "Job Coach - Office Setting", "companyRating": "3.5", "companyInfo": {"Website": "www.eastbayinnovations.org", "Headquarters": "San Leandro, CA", "Size": "51 to 200 employees", "Founded": " 1994", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "35000", "jobDescription": " We are looking for a candidate who has great teaching skills and the ability to learn and teach data entry, computers, scanning, indexing, and other office support tasks to people with disabilities. The schedule is usually Monday through Friday 8:30AM to 5:30PM. QUALIFICATIONS:Experience working with individuals with disabilities, previous job coaching experience, experience performing administrative tasks and knowledge of task analysis are all a plusMust be able to work effectively as part of a team as well as independentlyMust be willing to drive own car (we do offer mileage reimbursement) and carry auto insuranceABOUT OUR ORGANIZATION: Established in 1994, East Bay Innovations (EBI) is a human services and social services non-profit that supports people with developmental disabilities, such as intellectual disabilities, autism, and cerebral palsy.  Our person-centered services, including the Supported Employment Services program, support people with developmental disabilities to live in their own homes, make choices about how they live, work in jobs of their choosing, and enjoy being part of their communities. We are part of a social justice movement and endeavor to further the human rights and empowerment of people with disabilities seeking to lead lives of meaning as part of their communities.  Our Supported Employment Services department is continuing to expand and is currently looking for committed individuals to help us improve employment outcomes for individuals with disabilities in our Project SEARCH internship program. BENEFITS AND COMPENSATION: $16.00 per hour plus comprehensive benefits including: medical,dental,vision,paid sick and vacation (at FT),paid holidays,employer sponsored 403b,commuter benefits,flexible Medical and Dependent Care Accounts,ongoing paid staff training in multiple areas,focus on wellness, including bi-monthly yoga classes at our main office, annual health and wellness fair and annual flu shot clinic."}