{"jobID": "2815024546", "jobLocation": "San_Jose_CA", "jobTitle": "RF Engineering Technician", "companyRating": "3.4", "companyInfo": {"Website": "www.skyworksinc.com", "Headquarters": "Woburn, MA", "Size": "5001 to 10000 employees", "Founded": " 1962", "Type": " Company - Public (SWKS) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "132000", "jobDescription": "    If you are looking for a challenging and exciting career in the world of technology, then look no further. Skyworks is an innovator of high performance analog semiconductors whose solutions are powering the wireless networking revolution. At Skyworks, you will find a fast-paced environment with a strong focus on global collaboration, minimal layers of management and the freedom to make meaningful contributions in a setting that encourages creativity and out-of-the-box thinking. Our work culture values diversity, social responsibility, open communication, mutual trust and respect. We are excited about the opportunity to work with you and glad you want to be part of a team of talented individuals who together can change the way the world communicates.  Requisition ID: 47951  RF Engineering Technician    Skyworks San Jose design center is seeking RF Engineering Technician talent!  In this role, the RF technician will support engineering activities in an RF lab developing cutting edge RF chips used in mobile devices. Responsibilities include building prototypes, and RF tuning. Daily tasks include assembly of die and small components, die mounting, wire bonding, installing MCMs on circuit boards, and RF testing/tuning. Technician will review test results with engineers, make modification of prototypes and retest until performance meets specifications. Technician will take an active role in the development of products by making tuning decisions, participating in meetings, and being a team player.    Job Requirements Associate Degree with 2 years of related experience. Strong Assembly and Manual Bonding skills required.Proficiency using hand tools (e.g., Tweezers, Vacuum pencils, Soldering Irons, Die Bonding, Wire Bonding or Ball Bonding)Experience with handling and soldering 0201, 01005 size SMT components.Assembly experience working on a hot plate using a microscope.Familiarity with RF and electronic instruments such as spectrum analyzers, network analyzers, oscilloscopes, signal generators, power meters, DC supplies and multi-meters.Must have team-oriented attitude, accountability and ownership.   Open Market Platforms (OMP) The Open Market Platforms team at Skyworks develops industry-leading, front-end solutions targeting mass market devices deployed by smartphone manufacturers worldwide. Our design engineers have diverse expertise and utilize a broad range of technologies (SOI, silicon CMOS, GaAs, IPD, TC-SAW, and pHEMT) to create differentiated products that meet the intersection of performance and cost requirements for LTE RF front ends. These solutions include high-efficiency power amplifiers, multi-gain LNAs, multi-throw switches, controllers, acoustic filters and integrated modules. Skyworks’ OMP team is an ideal place for motivated engineers who enjoy collaboration in a dynamic environment and designing for performance, cost and quality in the fastest growing segment in mobile.     #LI-DD1        Skyworks is proud to be an equal opportunity employer supporting diversity in the workplace."}