{"jobID": "2822760601", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.modsy.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Senior Data Analyst  Modsy (modsy.com) is defining the future of home shopping. Imagine experiencing products, professionally curated to your taste, in your own living space! You are saying, “wait, did I read that right?” Yep, we are creating hyper-personalized shopping experiences for everyone with consumer data at its core.  As a Senior Data Analyst on the Finance team, you’re number one mission will be using data to drive strategy. You’ll work closely with Operations, Merchandising, and CX, and own and lead projects around user analytics. You’ll dive into complex datasets to analyze trends, identify opportunities and quantify the potential value of new initiatives.  WITHIN 1 MONTH, YOU WILL Organize backlog and prioritize opportunities for analysisEstablish relationships with Operations, Merchandising & CX to understand business objectives and opportunitiesDevelop knowledge of data and warehouse infrastructure with Engineering  WITHIN 3 MONTHS, YOU WILLEstablish working dashboards and a solid cadence with each team for planning and communication with stakeholdersQuickly deliver actionable insights and recommendations around key business questionsBecome the go-to person for data analysis from anything like new business initiatives to Board presentations  WITHIN 12 MONTHS, YOU WILLBecome the customer insight guru within Modsy with a full understanding of customer funnels and purchasing behaviorLead new ideas on measurement and modeling of LTV and differentiated cohorts  WHAT YOU’LL NEED TO BE SUCCESSFULBachelor's and/or Master's Degree in Economics, Math, Statistics, Management Science or other quantitative field4+ years of experience in an analytical role using SQL and you have experience extracting, manipulating, and analyzing large data sets using SQL and understand basic statisticsStrong applied analytics - you love data, gleaning insights from data, and making decisions based on dataProficiency in one or more analytics & visualization tools (e.g. Chartio, Looker, Tableau)Strong business judgment. You've got the ability to take ambiguous problems and solve them in a structured, hypothesis-driven, data-supported wayExcellent communication and presentation skills - effectively presenting insights is as important as the insights themselves and have the ability to succinctly explaining complex ideas to technical and non-technical audiencesAbility to collaborate and work effectively with cross-functional teamsA positive and “can do” attitude - those comfortable in a fast-paced, dynamic environment who are passionate about Modsy will thrive here!Are self-sufficient, learn autonomously, and are self-motivated and have excellent follow-through, responsiveness, and are not easily overwhelmedStrong time management skills; multi-task and prioritize workloads; demonstrated analytical capabilities; effectively identify and resolve problemsExperience with marketplaces or economics is a plus"}