{"jobID": "2825067435", "jobLocation": "San_Francisco_CA", "jobTitle": "Sr Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.schwab.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1973", "Type": " Company - Public (SCHW) ", "Industry": " Finance", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "151000", "jobDescription": " Description:San Francisco - CA, SF211MN, 211 Main St, 94105-1905  Lance Alan Britton  20180110-249 We believe that, when done right, investing liberates people to create their own destiny. We are driven by our purpose to champion every client’s goals with passion and integrity. We respect and appreciate the diversity of our employees, our clients, and the communities we serve. We challenge conventions strategically to create value for our clients, our firm and the world. We live and bring to life the concept of ‘own your tomorrow’ every day. We champion our employee strengths, guide their development, and invest in their long-term success. We hire optimistic, results-oriented, curious, innovative, and adaptable people with the desire to help our clients and one another succeed.  As a company, we were established by Chuck over 40 years ago to champion Main Street over Wall Street, and to help Americans transform themselves from earners to owners. Through advocacy and innovation, we work to make investing more affordable, accessible and understandable for all. As we enter our fifth decade, we are looking for talented, innovative and driven people who believe they can help themselves, and our clients, create a better future. Our Opportunity: The Analytics & Business Insight (ABI) organization supports multiple business units across Schwab through quantitative-based decision support. Our mission is to help Schwab better understand the needs and behaviors of our prospects and clients through statistical analysis, predictive modeling, market research, and business intelligence.  The data science team within ABI leverages machine learning and artificial intelligence to provide the organization with advanced quantitative analyses and insights that help guide development of new product/service offerings, better target prospects and clients through informed marketing efforts, increase acquisition of desired prospects, understand the ROI of advertising and marketing promotions, measure and assess the impact of business strategies, and identify strategies to grow client engagement, retention, and loyalty. Our services are in heavy demand as our team is a critical component in Schwab's commitment to being a leading data-driven organization. What you’ll do: The Senior Data Scientist will partner with business teams across a variety of areas and applications. He/she will work with business partners to understand business objectives and scope data science projects that deliver insights and results. He/she will work hands-on with large disparate datasets and analyze them leveraging state-of-the-art techniques and tools. He/ she will also work in a cross-functional manner with other consultants, analysts, statisticians, data engineers, and external vendors to deliver insights and solutions based on machine learning, statistical and econometric analyses.  Displaying strong business acumen and communication skills, the Senior Data Scientist will communicate analytical results to business partner in various settings to help drive results. Our business partners place great emphasis on our ability to translate statistical and mathematical results in a way that tells a clear story and guides them in actionable decisions.  Responsibilities include: Scope data science projects including identifying resources and assets needed, determining analysis approach, conducting analysis, and developing execution plans.Work independently or collaboratively throughout the complete data science project lifecycle including data extraction/preparation, design and implementation of scalable machine learning analysis and solutions, and documentation of results.Refine, improve and take ownership of existing machine learning models, systems and implementations; Refine and improve data science workflow and processesPartner with technical and non-technical resources across the business to leverage their support and integrate our efforts.Partner with infrastructure and platform teams to configure, tune tools, automate tasks and guide the evolution of internal big data ecosystem; serve as a bridge between data scientists and infrastructure/platform teamsPro-actively analyze data to uncover insights that increase business value and impact.Support various business partners on a wide range of analytics projects from ad-hoc requests to large-scale cross-functional engagements.Approach analytical problems with an appropriate blend of statistical/mathematical rigor with practical business intuition.Hold a point-of-view on the strengths and limitations of statistical models and analyses in various business contexts and demonstrate ability to evaluate and effectively communicate the uncertainty in the results.Approach analyses in multiple ways in order to evaluate approaches and compare results.Bring a creative approach to quantitative analysis and problem solving and demonstrate an ability to comfortably think outside traditional methodologies (such as those from the academic literature, for example).What you have:B.S. degree in Statistics, Mathematics, Computer Science, Economics, Operations Research, Engineering or similar quantitative fieldGraduate degree in a quantitative field highly preferred5+ years of industry experience as a data scientist or machine learning engineerExperience in financial services would be a plus but not necessarily a requirementStrong understanding of how analytics supports a large organization including being able to successfully articulate the linkage between business objectives, analytical approaches & findings and business decisionsExcellent analytical skills with demonstrated ability to solve problemsMastery of Python plus SQL programming/data processing experience; knowledge or ability to learn Scala, R as necessaryStrong experience with Apache Spark and related ecosystemAbility to work with large transactional databases across multiple platforms (Teradata, Oracle, HDFS, SAS)Experience in visualizations and visualization frameworks such as d3 would be a plusGood oral and written communicationStrong interpersonal skills to successfully build long-term relationships with colleagues and business partnersA results-driven individual with a passion for data/analytics who can work collaboratively with others to solve business problems that drive business growthWhat you’ll get:Comprehensive Compensation and Benefits packageFinancial Health: 401k Match, Employee Stock Purchase Plan, Employee Discounts, Personalized advice, Brokerage discountsWork/Life Balance: Sabbatical, Paid Parental Leave, New Mothers returning to work Program, Tuition Reimbursement Programs, Time off to volunteer, Employee Matching Gifts ProgramEveryday Wellness: Health and Lifestyle Wellness Rewards, Onsite Fitness Classes, Healthy Food Choices, Wellness ChampionsInclusion: Employee Resource Groups, Commitment to diversity, Strategic partnershipsNot just a job, but a career, with an opportunity to do the best work of your life Learn more about Life@Schwab.  Charles Schwab & Co., Inc. is an equal opportunity and affirmative action employer committed to diversifying its workforce. It is Schwab's policy to provide equal employment opportunities to all employees and applicants without regard to race, color, religion, sex (including pregnancy, childbirth, breastfeeding, or related medical conditions), gender identity or expression, national origin, ancestry, age, disability, legally protected medical condition, genetic information, marital status, sexual orientation, protected veteran status, military status, citizenship status or any other status that is protected by law. Schwab also does not discriminate against applicants or employees because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. At Schwab, we believe that every employee, through their diverse abilities and experiences, can contribute to our growth, innovation and client loyalty. We embrace diversity and are committed to providing equal opportunity to all employees and applicants. If you have a disability, and require reasonable accommodations in the application process, call Human Resources at 800-725-3535. We will be happy to assist you. Schwab will only share your accommodation request with those individuals who have a specific need to know. The request for an accommodation will not affect Schwab's hiring decisions. All other submissions should be performed online.Job Specifications  Relocation Offered?: No Work Schedule: Days Languages: English - spoken Current Licenses / Certifications: None Relevant Work Experience: Analyst/Strategy-2-5 yrs, Financial Services-6+ yrs, Analyst/Strategy-6+ yrs, Financial Services-2-5 yrs Position Located In: CA - San Francisco Education: BA/BS Job Type: Full Time Category:Marketing Analytics  Activation Date: Thursday, February 1, 2018  Expiration Date: Sunday, July 1, 2018  Apply Here"}