{"jobID": "2802495631", "jobLocation": "Seattle_WA", "jobTitle": "Sr. Data Analyst - Seattle, WA", "companyRating": null, "companyInfo": {"Website": "www.avidtr.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Looking for experienced Data Analysts to support various business and regional reports, standardize key metrics and help develop automated reports across businesses. You'll be developing SQL/ETL queries, access data warehouse, generate daily/weekly reports, create relevant KPIs and metrics for performance. Experience with advanced BI tools and data visualization will be important as well.  No 3rd party candidates, only direct W2 Basic Requirements:5+ years of experience as data analystBachelors degree in Computer Science, Mathematics, Statistics or relevant majorStrong proficiency with SQL, data warehouse and statistical analysis toolsExperience building tables and ETLs.Demonstrated experience with business intelligence reporting and data visualization tools (e.g. Tableau, Quicksight, Datanet, etc.)Experience with Redshift or similar OLTP database architecture preferredAbility to work effectively with both technical resources and non-technical business owners; gather and translate end user requirements Want to see more of our open IT jobs? Follow us on LinkedIn. We post new jobs daily. About AVID Technical Resources: AVID (Applications, Voice, Internet, Data) Technical Resources is a contract and permanent IT recruiting company. Headquartered in Boston with offices around the US, AVID specializes in placing information technology professionals with either an Infrastructure Support or Applications Development background.  Since our inception in 2003, AVID has grown to be among the leading IT recruiting firms in the area. This explosive growth has led to a number of awards and recognition. Inc. Magazine listed AVID three times on their exclusive Inc. 500/5000 Fastest Growing Privately-Held Companies in the US. AVID was named one of the Leading IT Staffing Agencies in the Northeast by Forbes Magazine and the Boston Business Journal ranked AVID Technical Resources the 7th Fastest Growing Privately-held Company in Massachusetts. AVID Technical Resources has not only been recognized by local and national business and staffing organizations, but also by its most important critics: our clients and candidates. Check out our reviews on Glassdoor, Indeed, and Google here.  Contact one of our IT recruiters today: www.avidtr.com."}