{"jobID": "2830664187", "jobLocation": "Rahway_NJ", "jobTitle": "Executive Director/Distinguished Scientist, Clinical Safety and Risk Management, Oncology (CSRM)", "companyRating": "3.7", "companyInfo": {"Website": "www.merck.com", "Headquarters": "Kenilworth, NJ", "Size": "10000+ employees", "Founded": " 1891", "Type": " Company - Public (MRK) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "186000", "jobDescription": " Merck & Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck?s success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.  Merck is on a quest for cures and is committed to being the world?s premier, most research-intensive biopharmaceutical company. Today, we?re doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck?s leading discovery capabilities and world-class small molecule and biologics R&D; expertise to create breakthrough science that radically changes the way we approach serious diseases.  Under the general direction of the CSRM TA Lead and Vice President, Chief Safety Officer, the Executive Director for Oncology will be responsible for overall clinical risk management and safety surveillance of assigned investigational products. Additionally, the incumbent will provide senior safety leadership for assigned marketed products across the Merck portfolio of products. The Executive Director will drive delivery of safety input to clinical development of oncology assets. This includes all aspects of safety data evaluation, including assessing safety from a variety of sources, e.g. clinical trials, literature, and post-approval use.  Responsibilities for risk communication include ensuring completeness of safety information in company core safety documents. The successful candidate will be responsible for leading and driving safety strategy for the development of assigned products. He/She will collaborate with appropriate cross-functional Merck departments and the therapeutic area head to ensure efforts are aligned to meet global risk management strategies for the product portfolio. He/She will be responsible for leading all interactions regarding product safety issues with MRL governance committees and regulatory agencies. This senior role works closely with CSRM Leadership to implement the evolving direction for the risk management and safety function of the department, as well as helping to develop and align processes to support departmental objectives. He/She also will manage a team of safety physicians and have an oversight role for their products. Education Requirement: + Required: MD, DO, or equivalent  + Preferred: Board Certification Required: + Minimum 3 years clinical experience  + Minimum 5 years experience in drug development, drug safety preferred.  + Demonstrated organizational leadership skills, preferably in the employment areas noted above.  + Excellent communication, writing and analytic skills Preferred: + Industry experience in clinical development, drug safety or regulatory preferred  + Experience managing people  Your role at Merck is integral to helping the world meet new breakthroughs that affect generations to come, and we?re counting on your skills and inventiveness to help make meaningful contributions to global medical advancement. At Merck, we?re inventing for life.  If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request to staffingaadar@merck.com . Search Firm Representatives Please Read Carefully: Merck & Co., Inc. is not accepting unsolicited assistance from search firms for this employment opportunity. Please, no phone calls or emails. All resumes submitted by search firms to any employee at Merck via email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Merck. No fee will be paid in the event the candidate is hired by Merck as a result of the referral or through other means.  Visa sponsorship is not available for this position.  For more information about personal rights under Equal Employment Opportunity, visit:  EEOC Poster at http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf  EEOC GINA Supplement? at http://www1.eeoc.gov/employers/upload/eeoc_gina_supplement.pdf  Merck is an equal opportunity employer, Minority/Female/Disability/Veteran ? proudly embracing diversity in all of its manifestations. *Job** _Drug Safety Surveillance (MD)_ Merck is an equal opportunity employer, Minority/Female/Disability/Veteran ? proudly embracing diversity in all of its manifestations. *Other Locations:** _NA-US-NJ-Rahway_*_Title:_** _Executive Director/Distinguished Scientist, Clinical Safety and Risk Management, Oncology (CSRM)_*_Primary Location:_** _NA-US-PA-Upper Gwynedd_*_Requisition ID:_** _DRU000850_"}