{"jobID": "2695125701", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst - Automatic Labs", "companyRating": "3.2", "companyInfo": {"Website": "www.siriusxm.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1990", "Type": " Company - Public (SIRI) ", "Industry": " Media", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "88000", "jobDescription": "SiriusXM is looking for experienced analysts to join our Data team and help drive the understanding, growth, and success of the product. The ideal candidate has an eye for detail, great communication, and a keenness for problem solving. Examples of projects you would work on include, but are not limited to, creating mission critical dashboards, building self-service tools and reports to drive awareness of key metrics and investigating challenging questions around user behavior. Working alongside Data Scientists who dig deep into Automatic's data, you will help them translate complex findings and results into a compelling narrative. In this role, you will have tremendous cross-functional exposure as the Data team's mouthpiece to product, biz. dev. and engineering. If you're passionate about leveraging data to drive business and product decisions, we want to hear from you. Duties and Responsibilities:Clearly and effectively communicate the results of complex analyses and coordinate with a diverse group of stakeholders.Define goals and identify key metrics for existing features and new releases.Use quantitative analysis to impact key business or product decisions.Grasp common statistical applications and methods (experimentation, probabilities, regression).Supervisory Responsibilities:None.Minimum Qualifications:Bachelor's degree in computer science, engineering or related field, or equivalent relevant experience.Strong experience writing production queries in SQL/Hive AND building internal data reports/dashboards OR tools for ETL, experimentation etc.Experience working in a scripting language like Python.Experience with data analysis and visualization tools like Tableau, Looker, Periscope, Excel etc.Comfort with basic HTML/CSS/JS.Academic and/or professional experience in a quantitative field.Requirements and General Skills:Interpersonal skills and ability to interact and work with staff at all levels.Excellent written and verbal communication skills.Ability to work independently and in a team environment.Ability to pay attention to details and be organized.Willingness to take initiative and to follow through on projects.Excellent time management skills, with the ability to prioritize and multi-task, and work under shifting deadlines in a fast-paced environment.Must have legal right to work in the U.S.Technical Skills:At SiriusXM, our engineers use technology to solve business problems. In this role, the tech stack your team will use includes:Databricks,Apache Spark,AWS,SQL/HIVE,Dashboarding and data visualization tools,Python scripting,Google Analytics.Equal Opportunity/Affirmative Action Employer - Minorities/Females/Protected Veterans/Disabled.The requirements and duties described above may be modified or waived by the Company in its sole discretion without notice.}"}