{"jobID": "2821762715", "jobLocation": "Grand_Rapids_MI", "jobTitle": "Insurance Sales Producer", "companyRating": null, "companyInfo": {"Website": "www.hubinternational.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "HUB InternationalInsurance Sales Producer (Outside Sales Representative)Job DescriptionHUB International is a leading global insurance brokerage that provides a broad array of property and casualty, life and health, employee benefits, investment, and risk management products and services. We are seeking dynamic and highly motivated Sales Professionals to join our team of Insurance Sales Producers .  As a HUB Insurance Sales Producer, you will have the opportunity to sell insurance products and services for a global leader in the industry. We offer rewarding opportunities for experienced professionals and training for motivated individuals seeking career development. If you are a career-driven, entrepreneurial self-starter, this is an opportunity to achieve your full potential with HUB International! Benefits At HUB International we want you to achieve an even work-life balance, and our benefits package allows you to manage your health, wellness, and financial future. As a Producer, you will build a book of business and therefore build residual income year over year. Our top Producers in the company make $200K+ in just residual income, and our lines of insurance are a necessity that is always in demand! HUB International will foster your learning, support your endeavors, and encourage your growth. We provide opportunities for career-driven individuals to move upward in our organization. Our successes breed your opportunity!  Other benefits you will enjoy as a Producer include: Rewards for top ProducersMedical, Dental, and Vision (PPO, HMO, and HSA)Comprehensive Wellness Program401(k) Retirement PlanLife and Disability PlansVacation, Sick, and Personal Time OffFlexible Spending Accounts for:HealthcareDependent careParking and transit expenseInsurance Sales Producer Outside Sales RepresentativeJob Responsibilities As a HUB Insurance Sales Producer, you will prospect for business based on your local networks, connections, and communities. This role is vital to our success in all our product lines from personal, commercial, employee benefits, and other coverages. As a HUB Producer, you will be supported by the HUB International corporate office and regional offices with the opportunity to create your own entrepreneurial journey. You will be the cornerstone of our superior customer service and will be charged with ensuring client satisfaction.  Other responsibilities of the Producer role include: Conducting sales, service, and solicitation of all forms of insurance businessMaximizing growth and client retention through superior customer serviceDeveloping accounts and cross selling available products and servicesGenerating and pursuing new client opportunitiesPresenting our services and solutions at prospect meetingsBringing new business prospects to closureRetaining clients by maintaining solid business-to-business relationshipsJob Requirements In the Insurance Sales Producer role, youmust be an independent self-starter who isable to sell and develop strong business-to-business relationships. We are seeking confident professionals who are not afraid of cold-calling and developing new business. This is an excellent opportunity for experienced and novice professionals alike, with a range of 3-15 years of business-to-business sales experience.  Other requirements of the Producer role include: 3+ years of previous business-to-business sales experienceCommercial Insurance sales experience highly preferredBachelors degree requiredExperience selling to a specific industry a plusRequired to obtain the appropriate state licensing with 90 days of hirePreference given to those with existing insurance licensure and/or industry designationsAbility to work under pressure and within deadlinesGood listening skills and ability to determine clients needs efficientlyInsurance Sales Producer Outside Sales Representative Insurance RepresentativeAbout Us HUB International is a recognized global leader dedicated to helping individuals and companies navigate risk and manage the complexities of insurance. Ranked 9th among theWorld's Largest Brokers at http://www.hubinternational.com/uploadedfiles/devsite/about/businstop10brokers(1).pdf by Business Insurance_"}