{"jobID": "2724438934", "jobLocation": "Lackland_AFB_TX", "jobTitle": "Sr. Environmental Scientist", "companyRating": null, "companyInfo": {"Website": "www.t3w.com", "Headquarters": "San Diego, CA", "Size": "51 to 200 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " T3W Business Solutions, Inc. is looking for Senior Level Environmental Scientists provide a full range of Advisory and Assistance Services (A&AS;) and deliverables in support of the Environmental Restoration Program (ERP) under the Air Force Civil Engineer Centers (AFCEC) Environmental Directorate (CZ).Duties include but are not limited to:1). Experience in environmental chemistry and laboratory performance evaluations.2). Knowledge of state and federal environmental regulations, Defense Environmental Restoration Program (DERP) and Federal Acquisition Regulations.3). Strong written and verbal communication skills.4). Utilizing and applying computer software including Microsoft Office (Excel, Word, PowerPoint).5). Experience in reaching out to experts/resources as needed, determining conclusions, and presenting the results in a logical and concise manner.6). Proficiency in organizing and gathering project data, conducting analysis, preparing reports and providing recommendations7). Experience interacting with state and federal environmental regulatory agencies.8). Experience performing critical process analysis evaluations of remediation systems.9). Experience modeling environmental remediation systems (fate and transport of environmental contaminants).10). Experience working Green and Sustainable Remediation (GSR) Initiatives with United States Environmental Protection Agency (EPA).11). Experience with assessing chemicals or materials as emerging issues/emerging contaminantsEducational Level/Years of Experience:BA/BS or MA/MS Degree from an accredited university in Civil Engineer, Environmental Engineer, or other related field.8 years of experience in the environmental fieldEnvironmental restoration experience accomplished under the Resource Conservation & Recovery Act (RCRA) and the Comprehensive Environmental Response, Compensation and Liability Act (CERCLA) and identified as a recognized Industry leader for a given area of expertise.Experience needs to include conducting effective technical presentations to management and professional/tactful coordination with a variety of project stakeholders.A significant portion of environmental restoration experience shall be with the Air Force ERP."}