{"jobID": "2671040723", "jobLocation": "San_Francisco_CA", "jobTitle": "Mid-Market Account Executive", "companyRating": null, "companyInfo": {"Website": "www.newrelic.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2008", "Type": " Company - Public (NEWR) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " AppDynamics, Datadog, Dynatrace"}, "estimatedSalary": null, "jobDescription": "New Relic  Mid-Market Account Executive  San Francisco, CA Are you a software sales pro looking to take your career to new heights? Do you want to work with a company – and a product – on the fast track? Take a look at New Relic!  We are looking for an accomplished, quota carrying, sales professional to share their skills to drive our technology and delight our customers. If you have a passion for SaaS sales and an interest in how it can impact businesses AND gain SMB technology sales experience, we want to talk with you.  This opportunity provides unique opportunities to grow personally and professionally. You could be an ideal candidate if you . . .Easily communicate the business impact of exceptional software to both technical and business customers;Are excited about developing sales plans to strategically grow and expand the accounts within an assigned geography;Have prospected and generated relationships with new customers;Have managed the success, adoption and expansion of existing customers;Have a passion for customer adoption and satisfaction. Skills and Experience needed to do the job:2+ years in SaaS or related direct application sales;Excel in both personal ambition AND collaborative teamwork;Have excellent communication (interpersonal and presentation) and closing skills, and have successfully applied these in inside sales;Ability to work in a fast paced, team environment;Inside sales experience with limited travel requirements (<15%) “Icing on the cake” skills:Technical background, with basic understanding of infrastructures and SaaS industry in general;SFDC experience and able to manage a variety of software business tools, including PowerPoint, WebEx, etc. At New Relic, we hire people who are eager to contribute to our culture, and we empower them to do just that. We take pride in thinking beyond our day-to-day job descriptions, and encourage you to actively seek out opportunities to create the type of work environment that you want to be a part of. What does this look like in action? You should be ready to be a “culture add” to New Relic and spend ~5% of your time finding meaningful ways to make this an even better place to work. A little about us: New Relic provides the real-time insights that software-driven businesses need to innovate faster. New Relic’s cloud platform makes every aspect of modern software and infrastructure observable, so companies can find and fix problems faster, build high-performing DevOps teams, and speed up transformation projects. Learn why more than 50% of the Fortune 100 trust New Relic at newrelic.com.  New Relic is a San Francisco Best Places to Work award winner, an Oregon “Top Workplace” award winner, named a leader in the Gartner’s 2012, 2013, 2014, 2015 & 2016 “Magic Quadrant” for APM companies, a Top 100 OnDemand Company, Best of SaaS (THINKStrategies), Top 100 Coolest Cloud Computing (CRN); 10 Cloud Management Companies to Watch (NetworkWorld) – the list of accolades goes on. More important than all of that: we provide challenging work, opportunities to learn, high quality teammates, a standard-setting product, and a company on the move.  Our office is in the tech-rich urban center of San Francisco, with easy commute access and a plethora of good eats. We provide competitive compensation, equity and big-company benefits (medical, dental, etc) -- all while maintaining the energy, agility, and fun of a start-up. We can help with relocation and are open to H1-B transfers.  New Relic is most decidedly an equal opportunity employer. We eagerly seek applicants of diverse background and hire without regard to race, color, gender identity, religion, national origin, ancestry, citizenship, physical abilities, age, sexual orientation, veteran status, or any other characteristic protected by law.  Note: Our stewardship of the data of many thousands of customers means that a criminal background check is required to join New Relic. We will, nonetheless, consider qualified applicants with arrest and conviction records in accord with applicable law, including the San Francisco Fair Chance Ordinance."}