{"jobID": "2695265516", "jobLocation": "Commerce_CA", "jobTitle": "Marketing Analytics Manager", "companyRating": "3.5", "companyInfo": {"Website": "www.24seventalent.com", "Headquarters": "New York, NY", "Size": "201 to 500 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Aquent, The Creative Group, JBCStyle"}, "estimatedSalary": "92000", "jobDescription": "MARKETING Manager, Marketing Analytics  This position reports to the VP - CRM, Analytics and Digital Marketing and is responsible for performance analysis and insight for all marketing and promotional efforts. Supports the Marketing, Merchandising and Operations teams in driving profitable sales for the organization through evaluation of strategic efforts, business trends and promotional activities. Oversight of marketing databases and SAS cubes with responsibility for developing reporting and analytics that allow business partners to leverage the data within for use in developing go forward strategies.  Minimum requirements:  · Applicants must have a Bachelor's degree from four-year College or university; MBA preferred with 3-5 years of experience in an analytical role.  · Retail background is highly desirable.  · Grocery experience a plus.  · Proficiency with SAS and transactional databases required.  · Superior knowledge of Microsoft Excel, Powerpoint, statistical analysis and data modeling.  ·  Specific duties include, but are not limited to:  • Analysis of all marketing efforts to understand response, financial impact and insights to be used in future efforts. Proactively make recommendations based on findings.  • Develop reporting and analysis to support the Marketing, Merchandising and Operations teams on an ongoing and ad hoc basis.  • Support the VP building and maintaining relationships as an analytical partner across organization.  • Oversight and ownership of marketing databases and maintaining integrity of each.  • Primary analytical, quantitative, statistical expert within Marketing and across organization.  • Develop modeling to optimize forecasting, tracking and analysis of key performance indicators and strategic efforts including:  • New store openings o Performance across store formats  • Multi-channel marketing (traditional advertising, direct mail, in-store, online, social)  • Customer relationship management and field marketing  Skills:  • Requires PC proficiency with knowledge of Windows, Outlook, Word, Excel and PowerPoint.  • Experience managing databases.  • Excellent oral and written communication skills are imperative"}