{"jobID": "2616009436", "jobLocation": "San_Jose_CA", "jobTitle": "Data Scientist AI/ML", "companyRating": "4.2", "companyInfo": {"Website": "www.adobe.com", "Headquarters": "San Jose, CA", "Size": "10000+ employees", "Founded": " 1982", "Type": " Company - Public (ADBE) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Apple, Microsoft"}, "estimatedSalary": "165000", "jobDescription": "The challenge Adobe Target powers the personalized experiences and recommendations for many household name-brand companies. Serving roughly a billion hits per day, Target is one of the most sophisticated users of data science in the entire Adobe Experience Cloud.  The Adobe Target data science team is looking for an exceptional data scientist/machine learning expert to help drive the advancement of cutting-edge analysis, modeling, and recommendations algorithms. In this role, you will be asked to help find, analyze, and predict the patterns in the millions of records of web and mobile transaction data that we collect every day. You will also develop the models and algorithms that will make the decisions on what major Fortune 500 companies will present to their customers – often on their own home pages!  The ideal candidate will have a deep knowledge of math, statistics, and computer science with an eye towards solving practical problems. We are looking for someone who is both well versed in the science of AI/ML and who is also excited about putting the science into practice. What you’ll doAnalyze live and historical data to provide insightsResearch, prototype, and validate new models and algorithmsImplement machine-learning algorithms in a practical production settingInterface with other research teams across AdobeWork with consultants and customers to help them succeedWhat you need to succeedPh.D. in CS, Math, Stats, EE, Physics, or related quantitative fieldGood command of statistics, AI/machine learning/data mining models and algorithms including classification, regression, and deep learningStrong object-oriented programming skills.Ability to write production-quality code in Scala, Java, or PythonExperience with handling large data sets in distributed environments using Hadoop or SparkExperience with SciKit-Learn, Spark ML, Tensor Flow or related modeling toolsGood communication skills as evidenced by a record of talks and publicationsExperience in specialized areas such as optimization, recommendation systems, clustering, and marketing applications of data science is a plus At Adobe, you will be immersed in an exceptional work environment that is recognized throughout the world on Best Companies lists. You will also be surrounded by colleagues who are committed to helping each other grow through our unique Check-In approach where ongoing feedback flows freely.  If you’re looking to make an impact, Adobe's the place for you. Discover what our employees are saying about their career experiences on the Adobe Life blog and explore the meaningful benefits we offer.  Adobe is an equal opportunity employer. We welcome and encourage diversity in the workplace regardless of race, gender, religion, age, sexual orientation, gender identity, disability or veteran status."}