{"jobID": "2836801089", "jobLocation": "McLean_VA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.iconma.com", "Headquarters": "Troy, MI", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Modis International, Experis"}, "estimatedSalary": null, "jobDescription": " Location: McLean, VA  Duration: 12 months with Possible Contract to hire/Possible Extension Job Description: - Partner with consumers, business SMEs and source system teams to analyze, internalize and translate business requirements and source data to develop:  - Data requirements for upstream source systems  - Source to target mapping  - Data quality requirements  - Processing requirements (business rules, aggregation, transformation) - User acceptance test cases- Negative test scenarios - 5+ years’ experience with Financial Services clients - Desired business knowledge: familiar with regulatory rules, such as DLCR, 2052a, and NSFR, as well as Treasury products- Desired Common skill sets: Oracle, VB and UNIX 5+ years’ experience OLAP/SQL Tools, 5+ yrs experience with Teradata, AWS- Nice to have skill sets: Python, and experience with Oracle OFSAA - Responsible for the design, development and administration of transactional and analytical data constructs/structures and associated documentation  - Included within those responsibilities are the areas of data access and delivery technologies.  - Includes expertise in data quality, data organization, metadata, and data profiling.  - May provide technical support on data warehouse teams.  - Data set sizes are usually huge (in excess of hundreds of millions of records).  - Demonstrated ability to move from one sequential assignment to the next (work environment and priorities can change quickly depending on business needs).  - Demonstrated ability to move data between production systems and across multiple platforms  - Experience with major querying tools desired  - Ability to communicate strategies and processes around data modeling and architecture to cross functional groups and senior levels  - Ability to influence multiple levels on highly technical issues and challenges  - Strong Agile, CI/CD delivery knowledge and training and/or practical experience ."}