{"jobID": "2798416507", "jobLocation": "Burbank_CA", "jobTitle": "Data Engineer", "companyRating": "3.7", "companyInfo": {"Website": "www.warnerbros.com", "Headquarters": "Burbank, CA", "Size": "5001 to 10000 employees", "Founded": " 1923", "Type": " Company - Public (TWX) ", "Industry": " Media", "Revenue": " $10+ billion (USD) per year", "Competitors": " NBCUniversal"}, "estimatedSalary": "114000", "jobDescription": "Posting  Job Title Data Engineer Time Warner  Division Warner Bros. Entertainment Group WB Business Unit WB Technology Industry Film Production and Distribution Area of  Interest Technology/Information Technology Location United States - California - Burbank Requisition # 164381BR Position  Type Full Time Company Overview Warner Bros. has been entertaining audiences for more than 90 years through the world’s most-loved characters and franchises. Warner Bros. employs people all over the world in a wide variety of disciplines. We're always on the lookout for energetic, creative people to join our team. Business Unit Overview WB Technology combines Warner Bros.’ industry-leading technologists and disciplines to ensure global alignment with business strategy and accelerated delivery of innovative technology solutions studio- and industry-wide. From pre-production through archiving, the WBT organization will provide critical business and technology intelligence and services to all Studio business units. WBT manages the Studio’s enterprise systems and solutions, emerging platforms, information security, consumer intelligence, content mastering and delivery, and more. Posting Job Description What part will you play? Warner Bros. Entertainment Inc. seeks a Data Engineer for the Content Technology & Operations: Asset Lifecycle Management department. The Data Engineer is responsible for the design and implementation of search and data relationship functionality for the WB content platform. The Data Engineer must have experience with data modeling, modern database technologies, and API driven search design and development. The Data Engineer makes design decisions and partners across the organization in a collaborative manner to achieve results for our mission critical content and data management and distribution applications. Develop core data relationship, data ingest, data transformation services and search capabilities. Creates functional and technical specifications. Creates and executes against a plan to launch and maintain applications.Review project objectives and determine best technology for implementation. Implement best practice standards for development, build and deployment automationEvaluate software products and vendors for WB Technology and other divisions. Recommend action, develop and lead implementation of selected products/services.Work with internal and external developers to ensure WB Technology code standards and best practices are performed for development of applications.What do we require from you?B.S. in Computer Science or equivalent experience.3+ years data engineering experience.Demonstrated proficiency in data modeling and data structures.Demonstrated experience implementing database technologies such as NoSQL, Graph, and Relational.Demonstrated expertise and experience in ElasticSearch.Demonstrated expertise and experience in modern databases such as Cassandra, Mongo, Neo4j, or equivalent.Highly proficient in modern query languages including cypher, gremlin, or graphql. xQuery preferred but not required.Highly proficient in XML, JSON and YAML data exchange formats. Experience in XSDs and triple stores.Proficient in API design and development, specifically REST APIs. Experience with Swagger 2.0 and AWS API gateway is highly preferred.Demonstrated experience in data analytics tools such as Tableau, Kibana etc.Experience in working with data streaming technologies such as Amazon Kinesis, Apache Kafka etc.Experience integrating with big data architectures, data warehouses and data lakes including Hadoop, Spark, Map Reduce, Redshift etc.Experience in working with requirements provided by data scientists.Experience in AWS at scale leveraging services such as Dynamo, RDS, Redshift, Neptune and ec2.Highly proficient in at least one modern programming language such python, java, or node.js.Experience with source code and knowledge repositories such as git, jira, or equivalent systems.Proficient in a Linux environment.Proficient in core DevOps principles.Proficient in the SDLC in an agile environment.Systems design and architecture.Ability to work with outside vendors and clients under sometimes adverse circumstances and under time critical constraints. Technologies We UseData Streaming: Hadoop, Spark, Map Reduce, Redshift Hadoop, Spark, Map Reduce, Redshift  Cloud: AWS  NoSQL Databases  ElasticSearch - Kibana  Visualization Tools: Tableau But Wait, There's More! At WBT we look for members who want to: Be Curious: Seek out opportunities to learn, and who aren’t afraid to ask questionsOwn It: Be the driver, and take accountabilityEmbrace Change: The technology landscape is ever changing – we’re looking for people who are ready to change along with it.Engage and Influence: Share your passion for technology, and develop great relationships with colleagues and collaboratorsRespect: Show empathy and respect to all, and operate with the best intentionsLive the #WBLife: At WBT we look for team members who want to “Contribute to Our Community*The Warner Bros. Entertainment Group of Companies is an equal opportunity employer and considers all candidates for employment regardless of race, color, religion, sex, national origin, citizenship, age, disability, marital status, military or veteran's status (including protected veterans, as may be required by federal law), sexual orientation, gender identity or any other category protected by law."}