{"jobID": "2831313290", "jobLocation": "Menlo_Park_CA", "jobTitle": "Senior Scientist- Product Development", "companyRating": null, "companyInfo": {"Website": "www.clearlabs.com", "Headquarters": "Menlo Park, CA", "Size": "1 to 50 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We are seeking a talented and driven Senior Scientist to join our dynamic interdisciplinary start-up. The successful candidate will be involved in product development of new molecular assays, towards molecular characterization of microorganisms. Tasks & Responsibilities:Developing new DNA/RNA-based molecular tests in fast-paced product development environment.Take a leadership role in projects and guide technical areas independently. Make decisions involving designing, performing, troubleshooting, analyzing and reporting results for development and verification and validation studies.Identify, evaluate, and plan experimental details leading to new robust sequencing-based assays.Design, implement, analyze and present experiments to demonstrate feasibility of new methods and efficiently move products through pipeline up to and including transfer to manufacturing and scale up.Optimize assay conditions to achieve commercial levels of stability, robustness, and performance.Lead and perform risk analyses and creation of test plans, procedures and reports.Be both a strong individual contributor as well as a collaborative team member.Conduct clear and concise communication with colleagues (cross-functional) and supervisors through oral updates, written reports and technical meetings.Be organized with ability to document procedures and resultsCommunicate effectively and to work independently and collaboratively is essentialRequirementsPhD/Msc in molecular biology, genetics, genomics, microbiology or related field5 or more years experience in commercial product development or industrial settingStrong background in genetics, genomics, biochemistry, microbiology and a solid understanding of genetic assay development required.Experience with next-generation sequencing and library preparation is a plus.Demonstrated ability to plan experiments, analyze data sets, interprets results, trouble-shoot experiments, prepare reports, and present results.Motivated, enthusiastic, detail-oriented, organized individual with a strong desire to innovate/develop new products. Desire to be part of a fast-paced dynamic research and development environment.Good written and verbal communication skillsBenefits401K and health insurance4 hot meals/week"}