{"jobID": "2661608507", "jobLocation": "San_Francisco_CA", "jobTitle": "Audit Senior", "companyRating": null, "companyInfo": {"Website": "www.sldcpa.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 1944", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " AUDIT SENIOR - PUBLIC ACCOUNTING Are you an experienced Audit Senior professional who is interested in working with a great set of clients? The Audit Senior provides a full range of professional accounting and auditing services to companies in a variety of industries. The primary responsibilities of this position include senior accountant supervision of the day-to-day activities of audit and review engagements, monitoring and training staff accountants assigned to the engagement, and communication of any accounting or auditing matters that arise during those engagements to the management team. About Our Firm Shea Labagh Dobberstein (SLD) is one of the largest accounting and business consulting firms, by revenue, in San Francisco and a Top 200 firm in the country. We have more than 80 employees, another office in San Mateo, and we're growing fast. You will be working with a smart, dedicated and expanding team of professionals. We've got the energetic culture of a startup, with the reputation and stability of a 70-year-old firm. SLD's primary services include assurance (audits, reviews, and compilations), tax (corporate and individual planning and compliance) and accounting. Assurance clients are typically private companies located in the San Francisco Bay Area. Clients operate in industries which include manufacturing, distribution/wholesale, real estate, construction, nonprofit, and food and beverage. SLD also has a large employee benefit plan audit practice. Shea Labagh Dobberstein encourages workforce diversity, is an equal opportunity employer and prohibits unlawful employment discrimination as specified by local, state and federal law.RequirementsJob RequirementsMinimum of 2 years public accounting experience primarily in the area of accounting and auditingBachelor’s degree in accounting or related fieldCPA or CPA candidateExcellent verbal and written communication skillsAbility to work within a team environmentMust be currently authorized to work in the United States on a full-time, permanent basisBenefitsTop Reasons to Work with Shea Labagh DobbersteinPublic accounting firm with a long-standing reputation in the community; you will get to work with a team of highly experienced industry specialistsCulture of promoting from within and opportunities for professional growthCompetitive compensation and benefitsGreat work-life balance"}