{"jobID": "2736220926", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst", "companyRating": "4.5", "companyInfo": {"Website": "www.stripe.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Braintree, Authorize.Net, PayPal"}, "estimatedSalary": "102000", "jobDescription": " Stripe is the best software platform for running an internet business. We handle billions of dollars every year for hundreds of thousands of businesses around the world. One third of Americans bought something on Stripe in the last year.  With all this data, we’re looking for talented data analysts to join the Data Science team. The ideal candidate is data curious, detail oriented, great at communication, and loves solving problems.  Guide to the onsite interview (PDF)You will: Work closely with product and business teams to identify important questions, define key success metrics, and shape data-informed product/business strategiesDevelop compelling dashboards to measure the impact of new product features or business initiativesDevelop strong hypotheses, independently solve problems, and share insights in a compelling narrativeDesign, execute, and analyze experimentsCommunicate results and influence key product and business leadersYou’d ideally have:4+ years experience in a highly analytical roleDegree in a quantitative field (e.g., Economics, Statistics, Sciences, Engineering)Highly skilled at writing SQL to query relational databasesStrong communication and presentation skillsExperience and passion for developing the right metrics and dashboards/visualizationsNice to have:Experience with Tableau, Looker, etc.Familiarity with R or Python You should include these in your application: A resume and LinkedIn profile.Description of the most interesting data analysis you’ve done, key findings and its impact."}