{"jobID": "2836098919", "jobLocation": "Sacramento_CA", "jobTitle": "Senior Data Modeler, Assistant Vice President", "companyRating": null, "companyInfo": {"Website": "www.ubmich.com", "Headquarters": "Lake Odessa, MI", "Size": "51 to 200 employees", "Founded": " 1934", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Analyze Business Requirements , design logical data models and systems functions and present to stakeholders  Coordinate and interact with technical and business groups within the department  Define Standard Integration points for data being captured into the Data Platforms  Define Standard Output constructs which allow business users to extract their own data consistently across business units where needed  Integrate Master Data and Reference data processes into the path  Work with the enterprise architecture team to define and implement the future state architecture and an interim strategy to move us towards the path.  Define data/information architecture standards, policies and procedures for the organization  Structure, attributes and nomenclature of data elements, and apply accepted data content standards to technology projects.  Ensure existing data/information assets are identified, stewarded and leveraged across the enterprise.  Review, verify and approve the Conceptual and Logical data models done by the owner teams for modeling standards, naming convention and properly defining all objects and relationships.  Convert the Logical models in to Physical models, and generate the delta or forward engineer DDL script, and execute in the database.  Create complex views and materialized views and tune for performance.  Administer and manage the users and privileges on Erwin or ER/Studio Data Architect tool & Portal Repository server.  Manage the repository server and all projects to follow the best standards and to keep them in sync with Prod.  Create/modify macros in the ER/DA tool to generate more user friendly reports in aiding the creation of the business glossary document in the format requested by business.  Enable enterprise wide metadata management using the MDR and Colibra tools  Publish data models, conduct training on DW model to developers, BAs, DAs, and QA resources  Mentor staff, direct and document application design strategies.  Qualifications  Bachelor’s degree with 5+ years of banking & financial services industry experience.  At least 3+ years designing 3NF models and dimensional models for financial data warehouse products using industry standard tools such as Embarcadero (preferred) and Erwin.  Experience in modeling other data warehouse concepts such as Standard Input Files, Standard Output Files, Data Lake, Big Data, and Master Data Management is required.  Data Quality and Data Governance concepts and experience is required.  Exposure to Hadoop, Informatica and Wherescape ETL or Business Intelligence tools is preferred.  Experience in modeling Commercial Lending products such as loans and guarantees, market products such as Derivatives and Fixed Income Securities is highly desirable.  Excellent inter-personal and communication skills.  Excellent mentoring skills  Must work well in a team environment.  Must be able to work effectively with a distributed team  Model maintenance via portal/website a plus."}