{"jobID": "2778333793", "jobLocation": "Redwood_City_CA", "jobTitle": "Principal Data Scientist", "companyRating": "3.9", "companyInfo": {"Website": "www.ea.com", "Headquarters": "Redwood City, CA", "Size": "5001 to 10000 employees", "Founded": " 1982", "Type": " Company - Public (EA) ", "Industry": " Media", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Riot Games, Google, Activision Blizzard"}, "estimatedSalary": "162000", "jobDescription": " The Principal Data Scientist is a key position in our Data Science team within the Global Analytics and Insights group at Electronic Arts, charged with helping drive excellence and pushing innovation across EA. The successful candidate will use his or her expertise in applied machine learning and artificial intelligence to drive critical decisions in a fast paced, cross-functional environment. ResponsibilitiesResearch and design innovative approaches to obtuse problems, aiding in the implementation and scaling of these cutting edge systemsPush excellence in the rest of the data science organization within the global analytics org and around EAUse big data technologies to scale predictive models to millions of playersDevelop new tools and libraries that empower the businessCommunicate actionable results and findings derived from data throughout the organization in a clear, concise wayCollaborate with other areas of the business on long-term projectsLearn, implement and share new methodologiesBackgroundPh.D. in Computer Science, Machine Learning, Artificial Intelligence, Statistics, or related quantitative field10+ years of experience in applied machine learning/deep learningDemonstrated experience applying Data Science methodologies to real world problemsExperience in scaling up smaller projects and sharing work collaboratively across a wider teamExpert status in analyzing extremely large, complex, multi-dimensional data sets with a variety of toolsStrong programming experience in a system programming language such as C/C++ or Java.Familiarity with at least one scripting language: R, Python, or ScalaExperience querying large databasesAbility to communicate insights to technical and non-technical audiencesExperience with any of the following is a big plus:Big data technologies such as Hadoop, MapReduce, Hive, PigModel production in SparkApplication deployment using AWS, Virtual Machines, or DockerA humility and drive to be a \"learn-it-all\"AttributesEager to use data for insights and has a demonstrated passion for applying data science to make business critical decisions and recommendationsHypothesis driven uses data to test ideas rigorously and objectivelyAble to create compelling communication for executivesWillingness to mentor more junior data scientistsDesire to stay on the cutting edge, going out of their way to find and learn the \"latest and greatest\"Flexible and adaptable while maintaining positive attitudeSelf starter with passion, energy, enthusiasm to drive results and affect meaningful changeA team player who is able to work collaboratively within the group and across business units/functionsWhats in it for you? Glad you asked! We love to brag about our great perks like comprehensive health and benefit packages, tuition reimbursement, 401k company match and, of course, many other perks! And since we realize it takes world-class people to make world-class games, we offer competitive compensation packages and a culture that thrives off of creativity and individuality. At EA, we live the work hard/play hard credo every day.  More about our location: https://www.ea.com/careers/careers-overview/redwood-shores EA is an equal opportunity employer. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status or veteran status. We will also consider for employment qualified applicants with criminal records in accordance with applicable law.*LI-AC1"}