{"jobID": "2760472194", "jobLocation": "Plano_TX", "jobTitle": "Audit Supervisor- Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.bankofamerica.com", "Headquarters": "Charlotte, NC", "Size": "10000+ employees", "Founded": " 1904", "Type": " Company - Public (BAC) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "62000", "jobDescription": "Job Description: Audit Supervisor position responsible for developing and executing an audit program designed to independently validate the completeness and accuracy of data across the enterprise. Candidate will be responsible for testing the completeness and accuracy of data from point of origin, to systems of record, through business use (e.g. reporting) by independently querying systems data. Additionally, candidate will be responsible for reviewing the key processes, risks and controls within the business and control functions as it relates to data and as outlined in the Enterprise Data Management standard. Associate will assist in identifying business/processes requiring coverage, developing test plans and working with business audit teams to execute testing. Audit testing results across the enterprise will be pulled together to establish a point of view on Bank of America Data Control Effectiveness. Associate will be required to communicate and deliver results with top executives across the enterprise, drive issue identification and work with businesses and control functions to build solutions. Assist in the ownership of key regulatory matters related to data management. Strong problem solving, critical thinking, communication and project management skills are required.  Required Job Skills: Strong critical thinking, problem solving, analytical mindset requiredSQL / SAS Programming capability or other automation experienceStrong verbal and written communication skillsProject Management skills including multi taskingInformation Technology or data experience Desired Job Skills: Advanced degree or certifications (CPA, CIA, CISA etc)Knowledge of Bank of America business processes and front end application systemsShift:1st shift (United States of America)Hours Per Week:40"}