{"jobID": "2820592641", "jobLocation": "San_Jose_CA", "jobTitle": "Principal Scientist", "companyRating": "2.8", "companyInfo": {"Website": "www.guavus.com", "Headquarters": "San Jose, CA", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "207000", "jobDescription": " Apply nowGuavus, Inc. is seeking a Principal Scientist to join our analytics team. The successful candidate will lead the creation of new, complex machine learning and artificial intelligence algorithms and prove them with our customers. This is an exciting, highly technical role that is focused on enabling customers to create business value through advanced, real-time analytics on their streaming big data, both structured and unstructured. This full-time position is based in our San Jose CA, USA office.  A Principal Scientist at Guavus is responsible for (a) transforming a vision for analytics into precise technical problems/hypotheses, (b) leading the design and execution of machine learning/artificial intelligence solutions, (c) the technical execution of POCs with customers and (d) supporting our engineering, product and field organizations in the commercialization of our analytics. In addition, the principal scientist supervises the work of other scientists and engineers, and represents the company in analytics discussions with customers, partners, and at conferences.  The ideal candidate must have demonstrated an ability to independently create novel, mathematically sound algorithms, develop and test research code suitable for inline POCs demonstrating proof of value. This person will have also led the creation of machine learning and/or artificial intelligence algorithms with proven commercial value. Roles & Responsibilities:Own the analytics development lifecycle for at least one genre of use cases.Refine customers’ and internal ideas to solvable technical problems.Create mathematically based algorithms for use in the predictive and prescriptive streaming analytics of high volume and high-velocity data.Lead other team members on, and contribute to, implementations which deliver validated analytics results.Communicate results to colleagues, customers, and partners.Own the algorithms in machine learning/artificial intelligence modules in our product lines.Must be self-driven and capable of prioritizing, organizing, and managing a substantial workload as well as supervising the work of others.Mentor less senior team members.Work effectively in a globally distributed team.Required Background:PhD in an engineering or science fieldA minimum of 10 years, post PhD, of experience in solving significant problems involving the analysis of terabytes of structured and/or unstructured data, leading to the creation of commercial offers.Key analytics contributor to commercial offerings in at least one of these areas: operations analytics, marketing analytics, security analytics and NLP.Prior research demonstrating a solid mathematical background (statistics, linear algebra, PDEs, etc.) and/or heavy emphasis on data analysis including data mining/machine learning/artificial intelligence.Algorithmic understanding of classic machine learning methods (e.g., Random Forest, Stochastic Gradient Descent).In-depth experience using analytics enabling packages such as scikit-learn, spark scipy, numpy, pandas, spark.Expert knowledge of SQL and at least one of Java, Scala or Python.Self-driven with the ability to collaborate as a respected domain expert in a multidisciplinary technical team.Excellent oral and written communication skills, including the ability to present effectively to both business and technical audiences.Desired Background:Expertise with neural networks (e.g. LSTM), reinforcement learning, manifold learning, etc.Advanced mathematical background: topology, differential geometry, group theory, etc.Knowledge of Hadoop and Spark.At minimum, a basic understanding of communications networks and IT systems."}