{"jobID": "2693748591", "jobLocation": "San_Antonio_TX", "jobTitle": "Neuroscience Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.kbrwyle.jobs", "Headquarters": "El Segundo, CA", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Aerospace & Defense", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "57000", "jobDescription": "Neuroscience Data AnalystDescription Under the direction of the Government Principal Investigator (PI), Contractor Program Manager (PM), and contract project manager(s), the Neuroscience Data Analyst will be responsible for supporting the research necessary to execute research study titled: Quantification of MRI and Serological Effects of High Altitude Exposure on the Brain. The research project will primarily take place in/around San Antonio, TX supporting the USAF School of Aerospace Medicine's research department (Located at Wright-Patterson AFB, Dayton, OH). The Neuroscience Data Analyst will provide government leadership with an overarching view of the status of high altitude research activities and assist in the development of funding acquisition strategies, budget planning, and the effective utilization of resources to achieve research objectives. The Neuroscience Data Analyst will perform project management of individual research projects and integrate across projects to optimize overall program execution. Qualifications This position requires applicant to provide neurology data scientist support. Furthermore, it requires this task order me worked with the professional support of technically qualified personnel to assist in areas required to meet the stated government objectives and to accomplish the work required. Requirements for this position are as follows:1.Applicant must possess a masters degree in neuroscience with 10 years of experience with brain MRI, statistics, biostatistics, and large neuroscience database management; 10 years of experience is required; a PhD from an accredited university with 5-10 years of experience with brain MRI, statistics, biostatistics, and large neuroscience database management is preferred. The applicant shall have more than 5 years of experience in the research setting utilizing quantitative methods and principles of statistics. The qualified applicant shall demonstrate strong analytical skills and knowledge of novel and emerging analysis techniques is highly desired. Future/forward thinking in the area of big data analytics/informatics and applying them to contribute to the teams scientific process is a must.Compile, organize, and analyze data, identifying significant variables and underlying relationships, using mathematical and statistical methods and techniques. Write statistical analysis plans, carry out statistical analyses, and interpret and report findings.The applicant will review journals, abstracts, and scientific literature to keep abreast of new developments and to obtain information regarding previous studies that aid in the planning of new studies.The applicant will participate in data-related projects, including data normalization, data maintenance, data research, data standardization, data product design, and data quality assurance.Conduct analysis of multivariate datasets to reveal patterns and build models. Conduct exploratory data analysis, and communicate with team lead/team members; identify improvements for existing data management and recommend requirements for new systems.Import, clean, merge, manage, transform, validate, and/or analyze large multivariate datasets.Test data to identify data integrity issues, making recommendations and coordinating with the team lead to plan solutions; troubleshoot problems concerning database records and analysis, and communicate with team lead/team members; identify improvements for existing data management and recommend requirements for new systems.Design and document data management processes and create data dictionaries as necessary; establishment of available data to existing datasets, map data and coding for specific data elements, maintain statistical software codes; provide training on products created as needed; perform data archive procedures within established guidelines as provided by the team lead.Summarize and report data analyses in a clear, concise manner; present results to stakeholders and/or at scientific conferences; create written communication for internal and external purposes; write-up results in technical reports or publication-quality manuscripts.Ensure all documents and datasets are appropriately vetted prior to release outside the organization.Maintain data security in strict compliance with the Privacy Act of 1974, the Health Insurance Portability and Accountability Act, and related federal regulations.Comply with human subject(s) research regulations, as overseen by the Institutional Review Board (IRB)Work with Information Technology (IT) support personnel to ensure compliance with USAF and DoD IT requirements.Utilize statistical /database software packages such as SAS, SPSS, Access, and SQL Server; utilize standard software packages such as Microsoft Office, and Adobe Acrobat.Maintain professional relationships with team lead, team members, investigators, and collaborators.Some travel may be required. KBRwyle is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, disability, sex, sexual orientation, gender identity or expression, age, national origin, veteran status, genetic information, union status and/or beliefs, or any other characteristic protected by federal, state, or local law. Job: Engineering/Technical - Architectural Primary Location: US-US-TX-San Antonio Req ID: 1062212"}