{"jobID": "2774777708", "jobLocation": "Los_Angeles_CA", "jobTitle": "Sr. Data Engineer", "companyRating": "3.3", "companyInfo": {"Website": "www.fender.com", "Headquarters": "Scottsdale, AZ", "Size": "1001 to 5000 employees", "Founded": " 1946", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "128000", "jobDescription": " About the Role  We are looking for an engineer who is experienced with data architecture and operations and will support the needs of product teams across Fender Digital. You will design, develop, deliver and maintain data models that will help us better understand our customers and inform future product decisions.  A background in highly available and scalable systems is a must, as is experience leading and working with a team toward creating the same.  You are a Data Engineer who:  Works closely with the Platform, Product, Growth and Content squads to design data models for new and existing applications and services.  Is a natural leader and can direct other engineers who may not be as data-savvy.  Provides efficient code-review and workflow for shipping but can also take review and feedback.  Takes a clear, concise and non-dogmatic approach toward decision making.  Is open to new ideas, flexible and innovative.  Responsibilities:  Establish data blueprints, frameworks, standards and best practices, and communicate them to engineers and analysts.  Translate product specs into robust data models that are scalable and iterable.  Partner with the Growth & Revenue team to develop strategies for data acquisition, warehousing and reporting.  Help ensure that real time analytics are available to product teams and proactively identify when issues arise.  Work closely with DevOps to automate deployments, monitoring, alerting, ETL and reporting systems.  What We’re Looking For  BA/BS degree in Computer Science, Math or related field preferred with a strong academic record (MS/PhD or equivalent a plus). But if you have the chops and finished high school, by all means we’ll chat.  Excellent understanding and working knowledge of Java, Python, Go or similar. We assume you speak SQL.  Deep understanding of relational, NoSQL and data warehousing technologies and when to use each.  Experience with RedShift, PostgreSQL and ElasticSearch preferred.  Experience with AWS infrastructure highly preferred.  Plays guitar or another instrument...or at least listens to music.  Benefits  Excellent compensation package with incentives  Guitars! Music!  A brand new team: help set the culture of innovation at the world’s best music brand  Medical, dental, 401k, food, drinks  The computer of your choice (so long as its from Cupertino)"}