{"jobID": "2788549877", "jobLocation": "Austin_TX", "jobTitle": "Engineering Project Manager - Strategic Data Solutions", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "101000", "jobDescription": "Engineering Project Manager - Strategic Data Solutions Job Number: 113750717Austin, Texas, United StatesPosted: Jun. 25, 2018Weekly Hours: 40.00 Job SummaryStrategic Data Solutions leads the anti-fraud center of excellence for Apple across varied lines of business. We are looking for an experienced Engineering Project Manager (EPM), ready to take on a challenge and have a big impact on the company. The EPM leads internal and external anti-fraud projects within the anti-fraud group at Apple.  The EPM is the driver of technical projects that impact fraud exposure; they demonstrate a keen understanding of both business value, systems capabilities and fraud risk. The EPM must have a holistic vision of fraud that balances factors such as customer experience, cost, resources, systems and risk. In addressing fraud risk, the EPM must also balance potential technology advancements/limitations, with process improvements.  The EPM coordinates project management activities and communications between internal/external fraud partners, operations teams, IT, internal audit, finance, and corporate security as necessary to run projects. The EPM must communicate effectively value vs. risk tradeoffs in support of strategic decisions.Key Qualifications 5+ years of project managementExperience working with Machine LearningCS Degree and/or software development experience preferred.Technical Experience working in Software EngineeringKnowledge of technical project management best practicesKnowledge of industry best practices in fraud managementProven experience managing large cross functional technical projectsDetail orientedProven change driverStrong leadership skillsStrong presentation skillsExcellent interpersonal, written, and verbal communication skillsStrong team player with significant collaborative work experience DescriptionSkilled at meeting preparation, facilitation, documentation and follow up.  Work with internal and external teams to understand requirements, approach and solution.  Comfortable moving between waterfall and agile methodologies adapting style to the requirements of the project.  Develop, maintain, and execute project plans and integrated schedules for fraud analytic projects. Responsible to create, execute, and update the project plan and schedules/sprints.  Provide project leadership to manage the full development lifecycle from product inception to product release.  Distribute workload for project members on multiple projects to ensure resources are tasked appropriately.  Prioritize bugs, enhancements and tasks for the project team members; identifying and ensuring dependencies and deliverables are met.  Provide status reports and deliver presentations to leadership and project stakeholders.  Organize and drive escalations and issues to resolution. Daily activities include: planning project activities for the project team  prioritizing work in the pipeline to be completed for resources allocated.  leading and facilitating meetings  tracking tasks, enhancements and bugs for engineers.  leading UAT Sessions  writing use cases and test scripts  participating in quality assurance testing of features and functions  communicating project metrics, risks, and contingencies  delivering key business updates back to executive teams  The ideal candidate has over 5 years of experience in project management ideally in a technical cross-functional role. They have had personal experience performing in a software development roll. Having experience working with Data Scientists and on machine learning projects is a large plus.EducationBachelor's / Masters degree in Computer Science preferred"}