{"jobID": "2689734411", "jobLocation": "Rosemead_CA", "jobTitle": "Data Analytics Project Lead (Advisor)", "companyRating": null, "companyInfo": {"Website": "www.sce.com", "Headquarters": "Rosemead, CA", "Size": "10000+ employees", "Founded": " 1879", "Type": " Subsidiary or Business Segment", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Are you  looking to make a difference in your career? We’re working on smarter grids,  cleaner energy and tools to help people manage energy more efficiently.About ITThe role of IT goes beyond the traditional Information Technology  “service provider.” Many of the innovative ideas and projects that shape the  company’s future and move SCE forward are dependent on technology. IT employees  are at the heart of these projects, collaborating, designing and executing  technology solutions that are transforming our industry.Position overviewThe  Data Analytics Project Lead, leads big data  analytic projects that require in both subject matter expertise and specialized  technical skills in data analytics.  These projects will be strategic in nature and require understanding of  the major data types, repositories and internal and external sources in use  across SCE. Defines problems, collects  data, applies advanced economic and statistical concepts, establishes facts and  draws valid conclusions. Applies an  in-depth understanding of advanced mathematical concepts, establishes facts and  draws valid conclusions. Leads the  mining of the data for insights, development and implementation of new and  advanced forecasting models using advanced statistic and machine learning  methods, and educating other analysts and management in OUs about the  state-of-the-art in big data analytics.  The person in this position is expected to have excellent analytical, statistical,  and computing skills. Finally, project  management, consulting and communication skills are important for this position  as the person in this role interacts heavily with management and both technical  and non-technical staff across the company.  In this role, the Project lead will work  closely and collaboratively with Managers and SMEs in OUs across the company to  define, initiate and implement data analytics solutions to meet the needs of strategic use cases.Typical responsibilities will include:Acts  as a consultant/strategic advisor to other organizational units or departments  on the initiation, scoping, development and implementation of big data  analytics projects. Advice OU clients of what can and cannot be accomplished by  the use of data analytics. Frame the appropriate questions to be answered to  solve complex business problems and  communicate  the insights gained from data analytics.  Collaborates with analytic teams across the company on big data  analytics techniques and tools to improve analytics capabilities at SCE.Develops  advanced knowledge of sources of data and tools available to access  information. Accountable for the accuracy and integrity of findings and  recommendations. Specifically, works  with data scientists and data engineers to analyze large data repositories  (e.g. Edison Smart Connect Data Warehouse) using advanced analytical tools such  as R, Teradata Studio, Hadoop, SAP HANA; reviews data for quality and  consistency, and shares insights with other analysts and business users of the  data; coordinates closely with data stewards of data repositories to address  any data quality and access issues.Leads  the development of analytical solutions using quantitative forecasting,  modeling and analysis tools, to produce data to support business processes and  decision-making. Tracks the outcomes and  monitors the results of implemented use cases and performs after-the-fact  analysis. Specifically, monitors performance and supports such systems in  collaboration with OU personnel.Directs or performs analytical tasks associated with a  critical or analytical project or a number of small projects with many complex  features. Specifically, helps lead big data analytics projects including such  aspects as: acquire access to, validate, and analyze data collected across the  company. Identify how data collected for  one purpose can be used to solve business problems in other areasMinimum qualificationsBachelor’s  Degree in Engineering, Economics, Business, Computer Science, Mathematics, Statistics,  or related discipline.Must  have project management experienceSix  or more years of experience in field of data analysis/statisticsProven experience in providing well-reasoned and  substantiated recommendations to senior management on strategic mattersDesired qualificationsFamiliar with and understanding of  analytical techniques such as time-series, regression, neural network, and  machine learning models.Demonstrated experience gathering  data from different sources and formats (MS Excel, Access, Oracle, SQL, XML,  etc.) and compiling it for the ease of analysisExperience working with big data  tools and data storage such as SAP HANA, Hadoop, Teradata, etc.Experience using statistical tools  for analysis and forecasting.Specialized  understanding of one or more electric utility business areas such as Customer  Services, Transmission & Distribution, Power Supply, Generation, system  operations or planning.CommentsCandidates for this position must be  legally authorized to work directly as employee for any employer in the  United States without visa sponsorship.Relocation is available for this positionSouthern  California Edison, an Edison International (NYSE:EIX) company, serves a  population of nearly 14 million via 5 million customer accounts in a  50,000-square-mile service area within Central, Coastal and Southern  California. Join the utility leader that is safely delivering reliable,  affordable electricity to our customers for over 125 years.SCE is a proud Equal Opportunity  Employer and will not discriminate based on race, color, religion, sex, sexual  orientation, gender identity, national origin, age, disability, protected  veteran status or any other protected status.  If you  require special assistance or accommodation while seeking employment with  Southern California Edison, please call Human Resources at (800) 500-4723, and  choose option 3 for the Employee Information Center. Representatives are  available Monday through Friday, 8 a.m. to 4 p.m., Pacific time, except  Wednesdays when the center closes at 2:30 p.m., and holidays, or (800) 352-8580  (Telecommunications device for the hearing impaired - TTY).  *LI-SG1"}