{"jobID": "2831318947", "jobLocation": "Fountain_Valley_CA", "jobTitle": "RN, Registered Nurse, Emergency Services, Full Time Variable 12-hr Shift", "companyRating": "2.9", "companyInfo": {"Website": "www.memorialcare.org", "Headquarters": "Fountain Valley, CA", "Size": "10000+ employees", "Founded": " 2005", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " St. Joseph Health System, Cedars-Sinai Medical Center, Children's Hospital Los Angeles"}, "estimatedSalary": "41", "jobDescription": "Purpose Statement / Position Summary:This position requires the full understanding and active participation in fulfilling the mission of Orange Coast Memorial Medical Center. It is expected that the employee demonstrate behavior consistent with our core values: Accountability, Best Practice, Compassion and Synergy. The employee shall support Orange Coast Memorial Medical Center’s strategic plan and participate in and advocate performance improvement/patient safety activities.  Utilizing the nursing process and clinical nursing practice standards, the RN is responsible for directing and coordinating nursing care for the Department of Emergency Services patient in accordance with the policies and procedures of the Nursing Department. Responsibilities include directing unlicensed employee activity, synthesizing patient information, assessment of patients, planning of care /interventions, teaching patients/family, implementation of treatment plan/MD orders, and evaluation of care rendered. The RN must effectively communicate and document data relevant to the care of the patient. The RN utilizes knowledge of patient age, cultural diversity, and psychosocial and/or spiritual needs into the patient’s plan of care. The RN contributes to the promotion of quality nursing care through performance improvement processes that demonstrates positive outcome in patient care. In addition, the RN collaborates with other professional disciplines to ensure safe and effective patient care delivery and the achievement of desired patient outcome.Experience: One year Emergency Nursing experience preferred. In lieu of this experience, consideration will be made for an employee with strong education and associated experiential background.  Computer, internet, order entry and word processing experience preferred.Certifications:Current California RN license  Current AHA BLS for Healthcare Providers card  Current ACLS card  Current PALS card"}