{"jobID": "2582263901", "jobLocation": "Zeeland_MI", "jobTitle": "CNC Mill Operator", "companyRating": null, "companyInfo": {"Website": "www.plascore.com", "Headquarters": "Zeeland, MI", "Size": "201 to 500 employees", "Founded": " 1977", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Plascore, Inc. is a manufacturer of honeycomb cores and lightweight composite structures for industrial and aerospace applications.  We are looking for individuals that possess a strong work ethic and a good attendance history to join our team.  Most positions require basic math skills; the ability to use tape measures, calipers, and micrometers. DUTIESPerform operations such as drilling and routing on the CNC machining center.Be able to build fixtures required for the particular part and perform minor modifications to program when required.Set-up and operate CNC lathe and mills according to job and program specification while ensuring that quality, dimension and key characteristics and documented.Ensure proper communication with team members to attain all safety, quality and production requirementsBENEFITS:Health Insurance (Medical, Dental, Vision)Flex Spending Accounts or Health Savings AccountGenerous vacation policy - 2 weeks to start with yearly increases up to a maximum of 6 weeks.Competitive base salary + 15% shift premium for 2nd & 10% shift premium for 3rd shiftPaid HolidaysProfit Sharing / Quarterly Bonus401K with a company matchTuition ReimbursementClean work environmentSecurity of work for an established, growing company that serves a diverse customer baseQUALIFICATIONSMust be able to read blueprintsMust have proven ability to set up and machine parts on CNC mills/lathesMust have strong shop math skills and be capable of running multiple machinesPrevious experience in industrial manufacturing and ability to work with minimal supervision and a positive attitude with great communication skills is a real plusAdditional Requirements:Must be eligible to work on programs subject to ITAR Regulations. Therefore, candidates must be a U.S. Citizen or a U.S. Permanent Resident ('Green Card'). Plascore offers a competitive compensation and benefits package. For more information about our company, please visit our web site at www.plascore.com. We are an EEO employer dedicated to workforce diversity. EMAIL RESUMES TO: careers@plascore.comJob Posted by ApplicantPro"}