{"jobID": "2768426397", "jobLocation": "Santa_Clara_CA", "jobTitle": "Sr. Research Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.intel.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1968", "Type": " Company - Public (INTC) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "153000", "jobDescription": "Job DescriptionThe parallel computing lab is seeking a Senior Research Scientist to join us in the programming systems research group. Our research spans the development of novel AI applications, programming languages/compilers/runtimes, and data management systems. The ideal candidate will have experience that overlaps our different research areas for example, research in programming environments to support big data applications applied to novel machine learning applications. This is a senior level position so candidates should be self-starters who can define and then drive to completion their own research agenda. QualificationsRequirements: Ph.D. or M.S. in C.S. or related field, Must have an established research record. Inside this Business GroupIntel Labs is the company's world-class, industry leading research organization, responsible for driving Intel's technology pipeline and creating new opportunities. The mission of Intel Labs is to deliver breakthrough technologies to fuel Intel's growth. This includes identifying and exploring compelling new technologies and high risk opportunities ahead of business unit investment and demonstrating first-to-market technologies and innovative new usages for computing technology. Intel Labs engages the leading thinkers in academia and industry in addition to partnering closely with Intel business units. Other Locations US, Oregon, HillsboroPosting Statement. Intel prohibits discrimination based on race, color, religion, gender, national origin, age, disability, veteran status, marital status, pregnancy, gender expression or identity, sexual orientation or any other legally protected status."}