{"jobID": "2829988664", "jobLocation": "Washington_DC", "jobTitle": "Data Governance Analyst", "companyRating": null, "companyInfo": {"Website": "www.federalreserve.gov", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 1913", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable", "Competitors": " FDIC, Office of the Comptroller of the Currency, SEC"}, "estimatedSalary": null, "jobDescription": " The Data Governance Analyst participates in and helps facilitate data governance working groups established under the auspices of the Board Data Council. The analyst assists with and supports a number of data governance and data quality initiatives. The analyst helps support the development of the Board's data governance framework, and may participate in initiatives that establish enterprise data governance policies, processes, standards, and roles across a portfolio of data projects.  Knowledge of data governance models and strong communication and facilitation skills, acquired through completion of a bachelor's degree in business, economics, finance, information technology, or related field and a minimum of 2 years of experience or a master's degree in a related field and 1 year experience. Must possess clear, concise and effective verbal and written communication, including the ability to effectively communicate with technical personnel, business customers, and management. Excellent project planning skills and experience working across diverse groups using a collaborative and inclusive approach to working with other teams.FR 25 requires the completion of a bachelor's degree in business, economics, finance, information technology, or related field and a minimum of 3 years of experience or a master's degree in a related field and 2 year experience.FR 26 requires the completion of a bachelor's degree in business, economics, finance, information technology, or related field and a minimum of 4 years of experience or a master's degree in a related field and 3 year experience.The Data Governance Analyst will be a part of the Data Strategy and Policy team and support a broad range of Data Governance initiatives including facilitating data stewardship work groups and development of data policies and best practices. Skills highly desired are:1. Experience providing governance and communication support to implement transformational information management initiatives in large organizations Experience in providing communication support for creating, launching and sustaining new enterprise-wide information management products and services.Experience in creating effective communication and user outreach plans and materials to support the adoption of the data governance and data strategy as well as the rollout of new information management capabilities.Experience in conducting user analysis and targeted dissemination of information to audiences in different formats using a variety of communication channels."}