{"jobID": "2783185926", "jobLocation": "Sunnyvale_CA", "jobTitle": "CAFM Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.cushmanwakefield.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1917", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " Unknown / Non-Applicable", "Competitors": " CBRE, JLL"}, "estimatedSalary": "73000", "jobDescription": "Job TitleCAFM Data AnalystJob Description SummaryJob DescriptionCAFM Data Analyst The CAFM Data Analyst space technology software to provide support to Space Planning and Move Managers, and Client’s BI team. Holds responsibility to ensure all CAFM systems are maintained, relevant space reports are generated on a regular basis and serves as the central point of contact regarding the space technology solution within a client environment. Familiarity with construction and furniture terminology required. Expertise in CAFM and the methodologies and calculations used to generate and analyze allocation models is important to this role. Principle ResponsibilitiesDevelops metrics and benchmarking data to support Real Estate teamWorks with CAD team to ensure conversion of existing construction drawings to computer-aided design/drafting software is completed and accurate in Serraview CAFM systemCommunicates with Project Management, Space Planning and Move Management for CAD and Space data needsGenerates needed reports and analysis on Space and OccupancyManages and reports space allocation data, including business presence and archivingProduce pie charts or other data graphs as needed for space and occupancy informationProactively monitors space allocation data and changesProvides allocation data in accordance with client Space Allocation ProcessConsistently review data to identify discrepancies and reconcile as neededRequirementsHolds Bachelors or Master’s Degree in Architecture OR related field required and 3-5 years’ work experience in facilities management, space planning, or other commercial real estate fieldSkilled in Microsoft Office (Word, Excel, Access, and PowerPoint)Familiar with AutoCAD, intermediate experience in Excel, and experience with CAFM software (Manhattan, Center Stone, etc.) preferred Serraview but not required.Excellent organization and documentation experience requiredAnticipates, identifies, quantifies, and resolves problems in a timely and positive mannerConsistently meets deadlines and completes tasks as previously definedWorks with integrity, trust and commitment, setting an example for othersSolves practical problems and deals with a variety of concrete variables in situations where only limited standardization existsInterprets a variety of instructions furnished in written, oral, diagram, or schedule formHas the ability to learn new ​graphic software to compliment the presentation of new design Cushman & Wakefield provides equal employment opportunity. Discrimination of any type will not be tolerated. Cushman & Wakefield is an Equal Opportunity / Affirmative​ Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, protected veteran status or any other characteristic protected by state, federal, or local law."}