{"jobID": "2809040415", "jobLocation": "Santa_Monica_CA", "jobTitle": "Senior Data Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "POSITION: Sr. Data AnalystLOCATION: Santa Monica, CACONTACT: Victoria Wang, Recruitment Partner, e. vw@startuptap.com, m. 817.733.9158THE COMPANY: GOODRX (www.goodrx.com)We are a 100+ person team funded by top-tier firms, based in Santa Monica, CA with satellite offices in San Francisco. We are a low-key but tight-knit group of hard-working people working to fix America's broken healthcare system. Americans spend over $400 billion per year on prescriptions and too many people simply can't afford the medications they desperately need. Join GoodRx and help us solve meaningful problems that help us make peoples lives better every day.THE OPPORTUNITY: Sr. Data AnalystGoodRx is looking for a Sr. Data Analyst to join our Data team. This individual will have a strong quantitative bent, experience with the entire data process, and strong communication skills. This role partners with our internal product, growth and engineering teams to extract meaningful insights from our data and inform business decisions that have a real impact on the lives of our users. You will play an integral part in bringing analytical rigor to product decision-making, and help build out our analytics ecosystem from data warehousing to data exploration and visualization tools.MORE SPECIFICALLY... Collaborate across multiple teams to understand business needs, analyze complex data, and clearly communicate recommendationsDesign metrics, reports and dashboards that help the product team and management better understand the user journey, monitor business health, and access data insightsProvide timely, thorough reporting on new product features and strategic partnership initiativesDevelop requirements for data-related projects and work with the data team to see projects from start to finishUtilize quantitative techniques to test hypotheses and analyze the impact of product updatesCreate advanced SQL queries in RedshiftContribute to the design of internal procedures and partner with engineering to improve data consistency, cleanliness, and ease of useTHE REQUIRED EXPERIENCE/QUALIFICATIONS:EDUCATION: Bachelors degree (quantitative or related field); advanced degree a plusEXPERIENCE: 5+ years of work experience in data analysisStrong knowledge with databases such as RedShift, PostgreSQL, and/or MySQLAptitude for working with a diverse set of stakeholders and managing competing prioritiesExperience using statistical analysis and modeling techniques such as regressionExperience with statistical tools and languages such as R or PythonFamiliarity with BI tools such as Tableau or LookerKnowledge of Jupyter notebooks a plusBrings a structured, rigorous approach to solving business problemsExperience in product analytics or consulting a plusExperience measuring A/B tests a plusWHY JOIN GOODRX?Every day, GoodRx brings millions of Americans the lowest possible prices for prescription drugs. Our proprietary market-intelligence technology gathers current prices at more than 75,000 pharmacies to bring customers savings of up to 80% on their prescriptions. Since 2011, Americans have saved more than $3 billion using GoodRx. We are the #1 medical app on the iOS and Android app stores, and our products can help all Americans, insured or not.We also offer:· A competitive compensation plan· A beautiful office located overlooking the ocean in Santa Monica· A casual, fun, relaxed, and entertaining work environment· Professional development opportunities· Great Health, Dental, Vision, and Life insurance· 401K· Flexible schedule"}