{"jobID": "2787063432", "jobLocation": "Houston_TX", "jobTitle": "Research Scientist - GI Medical Oncology", "companyRating": "4.0", "companyInfo": {"Website": "www.mdanderson.org", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1941", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": " The University of Texas MD Anderson Cancer Center in Houston is one of the world's most respected centers focused on cancer patient care, research, education and prevention. It was named the nation's No. 1 hospital for cancer care in U.S. News & World Report's 2017 rankings. It is one of only 49 comprehensive cancer centers designated by the National Cancer Institute.  The primary purpose of the Research Scientist position is to plan, direct, organize, and participates in scientific research projects in cancer biology of gastro-esophageal cancers.  The salary range is: min-$53,200, mid-$66,500 and max-$79,800.  KEY FUNCTIONS  1.Plans, organizes, coordinates, directs and participates as a team member in research projects involving detection and elimination of gastro-esophageal cancers.  2.Assigns and reviews work of subordinates, determines specific goals or objectives to be attained, evaluates resulting research data and revises techniques or approaches to work problems.  3.Supervises the design, development or adapting of equipment used in experiments or research to obtain desired results.  4.Reviews, evaluates and correlates research data. Prepares drafts of protocols, research grants, manuscripts and grant reports .Writes and prepares publications and reviews analyses and interpretations of data.  5.Ensures that relevant data is collected at designed stages in the research process, is entered into database(s) and reported, as required, to the Institutional Research Board (IRB) and the appropriate national registries.  6.Reports status of team data collection for specific disease categories and multiple patients via regular progress reports directly to the supervising principal investigator and assigned senior personnel.  7.Collaborates on the research findings and participates in the presentation of research results via verbal presentations, abstracts, publications, and posters.  Core Competencies.EDUCATION  Required: PhD in one of the natural sciences or related field or Medical degree  EXPERIENCE  Required: With PhD, no experience required. With Medical degree, two years of experience in experimental or scientific work.  It is the policy of The University of Texas MD Anderson Cancer Center to provide equal employment opportunity without regard to race, color, religion, age, national origin, sex, gender, sexual orientation, gender identity/expression, disability, protected veteran status, genetic information, or any other basis protected by institutional policy or by federal, state or local laws unless such distinction is required by law. http://www.mdanderson.org/about-us/legal-and-policy/legal-statements/eeo-affirmative-action.html"}