{"jobID": "2836007963", "jobLocation": "Santa_Clara_CA", "jobTitle": "Deep Learning Data Scientist", "companyRating": "4.2", "companyInfo": {"Website": "www.infoobjects.com", "Headquarters": "San Jose, CA", "Size": "201 to 500 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "107000", "jobDescription": " Deep Learning Data Scientist  Location: San Jose, CA  Duration: 3-6 Months Contract To Hire  We are looking to fill a key role in our Advanced Analytics team, which is the analytic hub of clients CRC Corporate Research Center.  Be at the forefront to learn and apply groundbreaking data science techniques to the development of product solutions and business strategies.  If you are highly motivated, love gaming, and relish working on big-data scale problems to make a significant impact on business, we want you! What youll be doing: Mine data and perform large-scale data analysis to derive useful business insights into product, customer, and market behavior  Understand business problems, translate them into quantitative models, and choose the best applicable statistical and analytical tools to drive a solution  Develop descriptive, predictive, and prescriptive models using deep learning/machine learning algorithms.  Identify actionable insights, suggest recommendations, and influence the direction by effectively  communicating results to many crucial groups within the company What we need to see: PhD in a quantitative discipline such as Machine Learning/AI, Statistics, Applied Mathematics,  Operations Research, Computer Science, etc. (Would consider Masters for extraordinary applicants)  5+ years of experience in using statistical, analytical, and ML techniques to solve business  problems  Strong applied experience with Deep Learning frameworks like TensorFlow, Theano, Keras, Caffe  preferably on large consumer datasets.  Strong understanding of Deep Learning methodology and math. • Strong intuition for applying Deep  Learning to practical problems.  Vast knowledge and experience with machine learning algorithms and statistical tools like Python  scikit, R, MLLib, etc.  Knowledge of Hadoop and SQL are required, Spark is a plus  Experience with algorithmic work on NLP datasets would be great.  Strength in collaboration with an ability to take the initiative and lead when needed  A practical mindset If you have a passion for problem-solving, developing creative solutions, and  continuous learning, a willingness to work with whichever machine learning algorithm is the most  practical and effective for solving a specific business problem, and an understanding of the  importance of data preparation, you'll be a great fit for this important team.  Common sense is required in order to develop mathematical models that match the reality of the  business process and business data."}