{"jobID": "2698852361", "jobLocation": "Springfield_VA", "jobTitle": "Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.engilitycorp.com", "Headquarters": "Chantilly, VA", "Size": "10000+ employees", "Founded": " 2012", "Type": " Company - Public (EGL) ", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "102000", "jobDescription": "About Engility:Engility delivers innovative solutions to critical challenges facing the nation and the world. As a premier provider of integrated services for the U.S. government, we support the Department of Defense, intelligence community, space communities, federal civilian agencies and international customers. Engility is dedicated to making lives better, safer and more secure.Description:Engility is currently looking for a Data Scientist to join our team. The ideal candidate will provide data science services in support of the production of standard and non-standard intelligence products. Additional responsibilities will include but are not limited to:Lead projects with hands-on analysis and modeling, leveraging data analysis and analytical techniques and methods to solve complex business problems.Perform problem domain definition, including data identification and analysis.Extract, aggregate, manipulate, categorize, clean, and transform data associated within an identified problem space for use in predictive modeling.Perform exploratory data analysis and feature generation (i.e., identification, derivation, aggregation).Identify patterns and/or anomalies in large datasets.Perform automated text/data classification and categorization as well as entity recognition, resolution and extraction.Define, develop/programming algorithms; train, evaluate and deploy predictive analytics models using statistical and machine learning techniques and methods.Qualifications:Must have a current/active TS/SCI with the willingness to undergo and pass a CI polygraph.Requires 3 or more years' of experience (various position levels)Requires a Bachelor's degree in technical disciplineFamiliarity with basic product design principles.Proficiency in using Microsoft Office Suite.Strong writing, presentation, and interpersonal skills.Experience in using electronic publishing and structured authoring software, specifically Frame Maker SGML.Ability to conceive and prepare thorough, well-articulated tactical or strategic data science products.Ability to identify, retrieve, manipulate, relate and/or exploit multiple structured data sets from various sources.Ability to identify problems to which data science can be applied and initiate appropriate solutions.Ability to identify and appropriately evaluate a wide range of existing methods, models and algorithms in familiar domains for a variety of mission driven problems while recognizing the capabilities and limitations of each method.Demonstrated strong writing and oral communication skills.Ability to identify, retrieve, manipulate, relate and/or exploit multiple structured and unstructured data sets from various sources, including building or generating new data sets as appropriate.Ability to interpret and evaluate the results of data science community's methods models and/or algorithms, understanding the meaning, limitations and scope of the results, and translate them into insightful output for data science and/or mission and identifying other applications for use.Ability to initiate the efficient implementation of methods, tools, and algorithms using a comprehensive range of technologies.Ability to lead work unit proactively addressing and responding to the most difficult data science-related challenges in a timely manner while effectively balancing competing prioritiesDemonstrated strong writing and briefing skills to educate managers, senior internal officers and the IC.EEO Statement:Engility Corporation is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action employer, making decisions without regard to race, color, religion, creed, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. U.S. citizenship is required for most positions. For our complete EEO/AA and Pay Transparency statements, please click here ."}