{"jobID": "2790417757", "jobLocation": "Austin_TX", "jobTitle": "Data Analyst IV (Data Analyst Special Populations)", "companyRating": "2.5", "companyInfo": {"Website": "www.tea.state.tx.us", "Headquarters": "Austin, TX", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Government", "Industry": " Government", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": " General Job Description Applicants who are strongly being considered for employment must submit to a national criminal history background check. The selected candidate for this position will be an integral member of TEA's Special Education Review and Support Division in the Department of Special Populations. The successful candidate will performs complex data analysis and data research that will directly impact how LEAs are supported in their implementation of their state and federal requirements related to special education. Work involves conducting detailed analysis of and extensive research on special education data, providing results both orally and in writing, and monitoring and implementing data quality. May train others. Works under general supervision with moderate latitude for the use of initiative and independent judgment.Additional Military Crosswalk (occupational specialty code) information can be accessed at: http://www.hr.sao.state.tx.us/Compensation/JobDescriptions.aspx.Essential Job Functions:Work involves but is not limited to:Designing database structures, data collection systems, data analytics, and other strategies that optimize efficiency and quality. Compiles and queries data. Presents results of these analyses in writing and orally. Perform quality assurance and serves as a subject matter expert on data integrity, extraction, and compilation. Works in a cross-functional team comprising of managers, programmers, network staff and others in ensuring delivery of software solutions. Assists in defining, developing, and implementing data standards. Minimum Qualifications Education: Graduation from an accredited four-year college or university with major coursework in data science, business analytics, computer science, computer information systems, management information systems, or a related field.Experience: A minimum of three (3) years experience in data analysis, database design, development of complex SQL, and project management. Four (4) years of experience is preferred. Experience with Oracle / SQL server relational database systems; Texas public school education data and familiarity with the Texas public school accountability systems is preferred. Substitution: An advanced degree may substitute for two years of required experience. Knowledge, Skills and Abilities (KSAs):Knowledge of: Relational database design, data modeling, physical database design and current database technologies; security procedures for handling, protecting and distribution of confidential data.Skill in: Development of complex SQL, working with relational database management systems, problem analysis, devising effective solutions, conducting data searches, evaluating and translating large amounts of data, and critical thinking.Ability to: Work effectively in a team, as well as working independently; manage and coordinate multiple activities in different projects; design database structures; maintain accuracy and attention to detail; communicate well orally and in writing with management and other team members. Supplemental Information This job description is not an employment agreement or contract. Management has the exclusive right to alter this job description at any time without notice.Salary is dependent on qualifications.Positions exempt from the Fair Labor Standards Act (FLSA) will earn compensatory time off rather than overtime for hours in excess of 40 per week. May be required to work hours other than 8 to 5. May be required to work weekends and holidays.In accordance with applicable federal and state equal opportunity laws, it is TEA's policy that no person shall be excluded from consideration for recruitment, selection, appointment, training, promotion, retention or any other personnel action, or be denied any benefits or participation in any educational programs or activities which it operates on the grounds of race, religion, color, national origin, sex, disability, age or veteran status (except where age, sex, or disability constitutes a bona fide occupational qualification necessary to proper and efficient administration).The Immigration Reform and Control Act requires all new employees to present proof of identity and eligibility to work in the United States. TEA does not sponsor H1-B work visas. Males, 18 to 25 years of age, are required to present proof of selective service registration (or exemption) prior to being employed by any state agency.There is a 60-day waiting period for health insurance coverage.This position requires the applicant to meet Agency standards and criteria which may include passing a pre-employment criminal background check, prior to being offered employment by the Agency.Please note, TEA does not accept resumes.An internal applicant who is selected for a position in their current salary group that has the same state title is not eligible for a salary increase. An internal applicant who is selected for a position in their current salary group with a new state title may receive an increase up to 3.4%.The Texas Education Agency uses E-Verify to confirm the employment eligibility ofall newly hired employees. To learn more about E-Verify, including your rightsand responsibilities, please visit www.dhs.gov/E-Verify."}