{"jobID": "2827681089", "jobLocation": "New_Brunswick_NJ", "jobTitle": "Senior Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.rutgers.edu", "Headquarters": "Piscataway, NJ", "Size": "5001 to 10000 employees", "Founded": " 1766", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "57000", "jobDescription": " Rutgers, The State University of New Jersey, is seeking a Senior Data Analyst for Office of Clinical Affairs- RBHS. The Senior Data Analyst is responsible for healthcare data collection, analytics, visualization, reporting, and dissemination for all practice divisions in Rutgers Health Group (RHG). Data includes operational, financial, quality, patient satisfaction, claims, and other payor, provider and patient-provided information points for a large, complex and growing multi-disciplinary faculty practice plan. Responds to internal and external requests for data.Maintains the RHG Practice Operations Dashboard (financial and operational data for all RHG practice divisions) and other databases; coordinates and communicates with practice division point people to continually refine, improve, and advance RHG data presentations, so they can be easily understood by diverse audiences.Collaborates with various departments, practice groups and organizations in order to perform data mining and querying functions on large healthcare-related data sets (operational, financial, quality, patient satisfaction, claims, and other payer, provider, and patient-provided information points).Undertakes essential data integrity, analytic and report generation tasks and conducts data consistency and quality checks.Functions as a seasoned professional with strong skills in planning, organizing, and completing data requests and reporting projects.Works under minimal supervision and uses independent judgment to provide creative solutions to complex problems.Assists with the coordination of Rutgers Health Groups submission of data to state, federal, media, independent agencies, and other external stakeholders.Detects and analyzes data trends, correlations and relationships, including use of statistical techniques.Designs and develops application programs and files for data management and warehousing.Designs and produces data dashboards and info graphics for a diverse audience of users.Recommends how to best use large data sets to assess and enhance clinical and financial performance, and implements process improvements.Presents data analysis and trends to RBHS senior management and Practice Divisions within Rutgers Health Group.Integrates data collection projects and surveys, into workflow of data management.Provides administrative, strategic and analytical support in the development of programs. Performs research, gathers information and creates program materials and documents."}