{"jobID": "2834885259", "jobLocation": "Chicago_IL", "jobTitle": "Digital Marketing Analytics Manager", "companyRating": "2.9", "companyInfo": {"Website": "www.stericycle.com", "Headquarters": "Lake Forest, IL", "Size": "10000+ employees", "Founded": " 1989", "Type": " Company - Public (SRCL) ", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "70000", "jobDescription": "Position Description:*This position can be based out of Stericycle’s Chicago or Northbrook office. If based in Chicago, weekly travel (1-2 days/week) is required to Stericycle’s Northbrook office** This position plays an integral part in enabling insightful Marketing Analytics used in decision-making at Stericycle Compliance Solutions. The Manager, Digital Measurements is a proactive, analytical and technically-skilled leader who will advise the SCS Marketing teams on analytical measurements necessary to successfully monitor campaign performance and uncover insights to drive future performance. Key Position Activities: 1) Establish and sustain the marketing and digital channels data and analytics discipline.  2) Lead the marketing team in using data to inform the creation, execution, and measure performance of growth strategies across campaigns and channels, including sales funnel analysis.  3) Lead the development and execution of fact-based reporting, analysis and analytical models used to enhance decision-making across the marketing function.  4) Coordinate Analytics efforts between various stakeholders within the Marketing department including the Go-to-Market, Digital, Content, and Creative Services teams in addition to other departments such as Sales, Customer Experience, and Finance. Interpret and communicate results of campaign performance and channel health. Present findings, as necessary.  5) Develop and maintain marketing data governance standards across various platforms. Lead the development of on-going reporting for standards adherence monitoring and governance process improvement.  6) Implement analytical approaches and methodologies and assist in the interpretation of results.  7) Perform other related duties or participate in special projects, as assigned or requested."}