{"jobID": "2529043935", "jobLocation": "San_Jose_CA", "jobTitle": "Market Data Analyst - Global Securities Master (GSM)", "companyRating": "3.5", "companyInfo": {"Website": "www.sraoss.com", "Headquarters": "Santa Clara, CA", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": "Location: San Jose, California Position Description We are seeking 5 market data analysts to join our team  to provide validation, cleansing, and management of global reference and market data to financial institutions including security, pricing, and corporate action data. We provide first level of support for our client’s referential and historical data which is used by traders, developers, and other end-users.  GSM addresses the challenges facing financial institutions in the reference data management arena. GSM delivers data management, verification and research services for all reference data asset classes and data types that are used and processed by financial institutions. We manage data for all traded asset classes, including fixed income, global equities, derivatives, money markets, and OTC instruments. We cover all data types such as client/counterparty, legal entity hierarchy, descriptive data, pricing, and corporate actions. GSM manages data from original acquisition through validation, cleansing, enrichment, enhancement, and maintenance - to ensure the highest quality data. Key Responsibilities Market Data Research Daily interaction with Market Data vendors;Research and correction of global securities, price, and corporate action data;Develop pro-active checks to ensure the problems are handled before they reach the users community; andMaintain the integrity of multiple data sources and data setsClient SupportPerform special requested projects;Provide ad-hoc research/support on all client and management inquires;Apply ad-hoc adjustments to client data sets to reflect corporate actions; andInterface with traders, end-users, and developers to resolve data and system problems.RequirementsExperience in similar role for a financial institution a plusCollege degree or equivalent work experience with emphasis in financial servicesKnowledge about securities including equities and fixed incomeDetail orientedTime management skillsAbility to multi-taskDedicated and responsibleSome familiarity with program scripting a plusStrong organizational and people skillsAbility to work independently and in a team environment Apply in confidence by emailing resume with a cover letter to careers@sraoss.com.  Apply"}