{"jobID": "2746918659", "jobLocation": "Ne_Jersey", "jobTitle": "Quantitative Data Science Engineer", "companyRating": null, "companyInfo": {"Website": "www.njfsearch.com", "Headquarters": "London, United Kingdom", "Size": "51 to 200 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Our client, a leading quantitative asset manager is seeking a Quantitative Data Engineer to design and implement proprietary quantitative investment systems. You will be a key player in the Technology team and will research, design, code, test and deploy projects while working in a fast-paced environment. The Quantitative Data Engineer will work closely with quantitative research and portfolio management professionals to implement new ideas Responsibilities:Implementing, enhancing, and managing quantitative modelsDesigning and improving proprietary data repository and financial data platformsAutomating and supporting the Extract, Transform, and Load (ETL) processes from various market data vendorsDeveloping and managing reporting and performance analytics platformsRequirements:Strong knowledge of financial equity data, a plus with experience in Bloomberg, Thomson Reuters, Compustat, and CapIQ dataBroad knowledge of database concepts with proficiency in SQL and stored procedures, preferably with Microsoft SQL Server2+ years of solid coding experience in Python, C++, C#Experience in processing large and complex datasetsAn advanced knowledge of math and statisticEducation:MS/PhD in Computer Science, Engineering, Statistics, or related discipline with excellent academic credentials If you would like to be considered for the position of Quantitative Data Scientist Engineer, or wish to discuss the role further then please leave your details below. Your resume will be held in confidence until you connect with a member of our team"}