{"jobID": "2729177822", "jobLocation": "Springfield_VA", "jobTitle": "Data Management Developer", "companyRating": null, "companyInfo": {"Website": "www.quadrint.com", "Headquarters": "Bethesda, MD", "Size": "1 to 50 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Data Management Developer Quadrint is seeking developers to build and manage both structured, relational data warehouses and unstructured databases and services. Responsibilities include analyzing data sources, and creating and maintaining data warehouse schemas and ETL processes. The Developer will need experience and be highly skilled in at least one ETL framework (i.e., SSIS, Oracle Data Integrator, etc.), and have a deep understanding of data warehouse modeling and a willingness to learn and adopt new technologies as they evolve. The selected candidate will be expected to:Work closely with IT Architects, Analysts, Data Scientists, UI/UX designers, functional practitioners, and clients/stakeholders to gather data requirements.Be comfortable building high performing data transfer processes.Required Skills:Must have an active TS/SCI clearanceDue to the nature of the government contract requirements and/or clearance requirements, US citizenship is requiredBachelor's degree or equivalent combination of education and experience.1-3 years of development experience1-3 years of data warehouse modelingFamiliarity with the challenges of big data analytics solutions and the leading and emerging open source and commercial solution components including Amazon Redshift, Apache Nifi, and ElasticSearch.Familiarity with development environments and languages including Java, Python and RExperience documenting and maintaining Data DictionariesStrong written and verbal communication skillsStrong organizational skills and the ability to multitask; can set priorities and follow a timelineDesired Skills:Experience developing in AWS environmentExperience working with Big Data technologies (Kafka, Spark, Nifi)Experience with the Agile development approachExperience with ElasticSearchExperience with OLAP technologies such as SSASExperience with reporting and visualization tools such as SSRS and TableauExperience with visualization frameworks such as D3JS, HighchartsJS, and Plot.ly Ability to work independently in a fast paced, constantly changing environment  Ability to interact and work in a teaming environment Quadrint, Inc. is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, age, marital status, protected veteran status, status as an individual with a disability, or any other, or any other protected status."}