{"jobID": "2828985822", "jobLocation": "Bloomfield_NJ", "jobTitle": "Environmental Scientist/Geologist/Engineer", "companyRating": "4.1", "companyInfo": {"Website": "www.geiconsultants.com", "Headquarters": "Woburn, MA", "Size": "501 to 1000 employees", "Founded": " 1970", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "52000", "jobDescription": "GEI Consultants, Inc. is a leading consulting engineering and environmental firm ranked #92 in the ENR top 500 (2018). We serve hundreds of government, energy, industry and institutional clients, and have completed 50,000 project engagements throughout the United States, Canada, and more than 20 other countries.  GEI, a privately held employee owned company, was founded nearly 50 years ago by five engineering pioneers. GEI now consists of over 800 employees in multiple offices throughout the U.S. and Canada. Our technical experts are involved in dozens of specialty services emanating from our core solutions in water, energy, buildings, infrastructure and industrial. Our technical experts are some of the most innovative and leading subject matter experts in their respective fields. We continue to grow and expand in our solutions, expertise and geography to ensure we can continue providing valuable solutions to our clients.  Our culture is one where we encourage employees to respectfully and thoughtfully challenge current practices for continual improvement. We believe this constructive engagement helps us evolve in an ever-changing business environment and will strengthen our organization in the future. Our practices reflect our commitment to a collaborative teaming approach, encouraging diverse perspectives which lead to innovation and value added solutions that fuel our success. Our committed employees work hard for our clients and in support of one another. In return we invest in a culture with engaging learning and career development opportunities, a competitive total rewards package, recognition, and the opportunity for some fun along the way. Job Description GEI s Bloomfield, New Jersey office is seeking an Environmental Scientist, Geologist, or Engineer with at least four years of relevant experience beyond a college degree. Under supervision of senior staff, this individual will provide support to ongoing office and field work.  Office tasks may include: review and interpretation of data and preparation of reports and work plans; task and project planning and management; assistance with business development and preparation of proposals; client, subcontractor and regulatory agency interaction; development and implementation of remedial strategies; and remedial design.  Field activities may include: observe and document performance of test borings and installation of groundwater monitoring and observation wells; collection of groundwater, surface water, sediment, soil, rock, soil vapor, and air samples; operation of air monitoring equipment; testing to evaluate groundwater aquifer characteristics; and remedial construction management. This is an excellent opportunity to learn from our senior staff and gain a wide range of experience. Primary responsibilities:Under supervision of the senior staff, candidates will work on a variety of environmental projects throughout the region, but primarily in Northern New Jersey.Support environmental site assessments, remedial and pre-design investigations, test borings, well installations, environmental sampling of various media, aquifer testing, pilot tests, implementation of air monitoring programs, and technical oversight of subcontractors.Assist Licensed Site Remediation Professionals in preparing reports and documentation according to the New Jersey regulations and guidance documents.Conduct data management and analysis, prepare and review work plans and technical reports, and assist in preparation of presentations and proposals to clients and regulators.Develop investigation and remedial strategies for various types of sites and contaminants, and collaborate in the design and installation of remediation systems.Interact with subcontractors, clients and regulatory agency representatives.Assist with proposals and business development activities.Qualifications:Bachelor s degree in Environmental Science, Geology or Engineering; M.S. is a plus.A minimum of four years of relevant professional experience preferably in environmental consulting.Excellent communication skills and technical report writing.Willingness to travel on temporary assignments as needed.Experience with software such as in AutoCAD, ArcGIS, EQuIS, Leapfrog Hydro, EVS, etc., is a plus.40-hour HAZWOPER training - preferred.Physical ability to perform field work in summer and winter conditions.Valid U.S. driver s license. Benefits:Market-Competitive CompensationComprehensive Benefits Program, including Medical, Dental, Vision and MoreContinuing Education Assistance and Tuition ReimbursementProfessional Development and Opportunities for AdvancementPaid Holidays and Paid Time OffRewards and RecognitionGEI-Funded Profit Sharing and 401(k)And More…Physical Job RequirementsSedentary  Light  X  Medium  OtherActivity Level Throughout WorkdayPhysical Activity Requirements Occasional (0-35% of day) Frequent (33-66% of day) Continuous (67-100% of day) Not ApplicableSitting  1-2 hrsStanding  6-8 hrsWalking  3-5 hrsClimbing  0-1 hrsLifting (floor to waist level) (in pounds) 0-30 lbsLifting (waist level and above) (in pounds) 0-10 lbsCarrying objects  6-8 hrsPush/pull  0-1 hrsTwisting  1-2 hrsBending  3-5 hrsReaching forward  1-3 hrsReaching overhead  0-1 hrsSquat/kneel/crawl  1-2 hrsWrist position deviation  1-2 hrsPinching/fine motor skills  2-3 hrsKeyboard use/repetitive motion  1-2 hrsTaste or smell (taste=never)  0-1 hrsTalk or hear  6-8 hrs Accurate 20/40 Very Accurate 20/20Not ApplicableNear Vision  XFar Vision  XYesNoNot ApplicableColor Vision (ability to identify and distinguish colors)  XSensory RequirementsMinimalModerateAccurateNot ApplicableDepth perception  XHearing  XEnvironmental RequirementsOccupational Exposure Risk PotentialReasonably AnticipatedNot AnticipatedBlood borne pathogens  XChemical  XAirborne communicable diseases  XExtreme temperatures  XRadiation  XUneven surfaces or elevations  XExtreme noise levels  XDust/particular matter  XOther (exposure risks):Usual workday hours:  X  8  X  10  12  Other work hoursGEI is an EEO/AA/M/F/Vet/Disability employer"}