{"jobID": "2750113103", "jobLocation": "Los_Gatos_CA", "jobTitle": "Senior Data Scientist - Recommendation Algorithms, Experimentation and Analytics", "companyRating": "3.8", "companyInfo": {"Website": "www.netflix.com", "Headquarters": "Los Gatos, CA", "Size": "1001 to 5000 employees", "Founded": " 1997", "Type": " Company - Public (NFLX) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "230000", "jobDescription": "Senior Data Scientist - Recommendation Algorithms, Experimentation and Analytics Los Gatos, CaliforniaScience and AnalyticsPersonalization algorithms at Netflix deliver recommendations to over 125 million subscribers worldwide. To continually improve and innovate on our product, we maintain a relentless focus on empirical analysis and experimentation. As a Data Scientist in Algorithms Science & Analytics, you will be partnering with product and engineering teams to optimize personalization algorithms used to suggest movies and TV shows to Netflix members. This is a high-impact role in which you will have direct influence on how product decisions related to recommendations are made.  For a flavor of the work that is done on the team, check out our blog post:  Innovating Faster on Personalization Algorithms at Netflix Using InterleavingResponsibilities Lead the design, analysis, and interpretation of experiments that shape decision-making around personalization algorithms at Netflix.Proactively perform data exploration to understand user behavior and identify opportunities for improving our recommendation algorithms.Drive innovation by developing new experimentation methodologies, statistical techniques, and causal-inference approaches that could sharpen our product decision-making process.Research new measurements and frameworks to enable understanding of emergent phenomena, e.g. the impact of off-product behavior on Netflix viewing.Present your research and insights to all levels of the company.Qualifications:Advanced degree in Statistics, Econometrics, Mathematics, Physics, or a related quantitative field5+ years relevant experience with a proven track record of leveraging massive amounts of data to drive product innovationDeep statistical skills utilized in A/B testing, analyzing observational data, and modelingExperience with distributed analytic processing technologies (Hive, Pig, Presto, Spark)Strong programming skills (ideally in Python or R)Exceptional interpersonal and communication skillsDeep product senseSelf-starterA fan of Netflix is a strong plus"}