{"jobID": "2831409157", "jobLocation": "McLean_VA", "jobTitle": "Data Scientist with Polygraph", "companyRating": null, "companyInfo": {"Website": "www.cmp.jobs", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Description:Description: The Data Scientist/Architect will be expected to build statistical models, test hypotheses, interpret, summarize, visualize, and succinctly report on data holdings. The Data Scientist will analyze and model structured data using advanced statistical methods and implement algorithms and software needed to perform analyses. The Data Scientist may build risk scoring models, recommendation engines, spam classifiers, sentiment analyzers and classifiers for unstructured and semi-structured data and perform machine learning, natural language, and statistical analysis methods, such as classification, collaborative filtering, association rules, sentiment analysis, topic modeling, time-series analysis, regression, statistical inference, and validation methods. The position may require the Data Scientist to cluster large amounts of user generated content and process data in large-scale environments. The Data Scientist may evaluate and implement massive, scalable data stores, and optimize support for ad-hoc analysis across various data sources. Requirements: Current TS/SCI with Polygraph is required  Experience using machine learning algorithms  Prior experience with model and algorithm development and optimization  Experience working with software engineers to implement and produce models and algorithms  Understanding of cybersecurity operations and best practices  Technical expertise/capabilities to perform database management (including evaluation, system analysis, and the design of complex applications)  Strong knowledge of software engineering best practices and computer science fundamentals  Experience analyzing customer needs, including participating in strategic planning, and ensuring solutions adopted are appropriate to meet objectives  \"External Referral Eligible\"Qualifications:EDUCATION AND EXPERIENCE: Bachelor's degree in related discipline and 8+ years experience, or masters degree in fields such as mathematics, engineering, social sciences and 5+ years experience.Employer Overview: Employer is a global science and technology solutions leader working to solve the worlds toughest challenges in the defense, intelligence, homeland security, civil, and health markets. The companys 33,000 employees support vital missions for government and commercial customers. Headquartered in Reston, Virginia, Employer reported pro forma annual revenues of approximately $10 billion for the fiscal year ended January 1, 2016 after giving effect to the recently completed combination of Employer with Lockheed Martin's Information Systems & Global Solutions business (IS&GS;). For more information, visit www.Employer.com. The companys diverse employees support vital missions for government and commercial customers. Qualified women, minorities, individuals with disabilities and protected veterans are encouraged to apply. Employer will consider qualified applicants with criminal histories for employment in accordance with relevant Laws. Employer is an Equal Opportunity Employer."}