{"jobID": "2521421730", "jobLocation": "Arlington_VA", "jobTitle": "Junior Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.bma.net", "Headquarters": "Villa Ridge, MO", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Contract", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Company Overview BMA, a service-disabled veteran-owned small business (SDVOSB) with a corporate location in Huntsville, AL, has been in business since 2010 providing professional services to the United States government. BMA supports the Department of Defense (DoD) and the Joint community. BMAs professional services include administrative support, capabilities development, simulation and software, information technology (IT) and knowledge management (KM), test and experimentation, strategic communications, and manpower and personnel integration. A Career with our team at BMA offers excellent opportunities for growth with one of Americas finest young SDVOSB organizations. Junior Data AnalystJob Summary: responsible for planning and providing analytical support for facilitation, training, methodology development and evaluation, business management techniques, and organizational development. Key responsibility includes: Providing recommendations, contributing and preparing briefings for business, management, technology, operational initiatives, and policy formulation, professional or strategic goals Responsibilities and Duties The Contractor shall generate and update reports as required to include weekly and monthly reports of number of cases entered into the FOIA log. The Contractor shall enter a minimum of 425 requests into the FOIA log per week.The Contractor shall enter requests/referrals in the Government provided electronic FOIA tracking system(s).The Contractor shall perform reconciliation between the records of the systems as needed.The Contractor shall scan FOIA/Privacy Act requests into FOIAXpress or the Shared drive/SharePoint for processing by the FOIA analysts. The Contractor shall scan a minimum of 425 FOIA/PA requests into FOIAXpress per week.The Contractor will enter the FOIA requests and referrals into FOIAXpress and/or OBIMs FOIA Case Management system that records all FOIA cases. The Contractor shall search relevant DHS/OBIM systems and identify associated records that apply to the request. All requests and associated records shall be scanned into FOIAXpress or OBIMs shared drive/SharePoint as directed by the OBIM FOIA lead. While FOIAXpress is the system that OBIM is transitioning to, there may be a period of time, that both systems may be in use and reports may need to be generated from either FOIAXpress or the OBIM Case management system. The Contractor may need to make sure that records are copied over from one system to another if required for the reports.The Contractor shall assist in generating standard reports to include weekly and monthly reports to reflect the number of cases entered in FOIAXpress.The Contractor shall provide data entry and assist in correspondence preparation services in support of OBIM responses to FOIA and Privacy Act requests/referrals, which result in closure, if applicable. The Contractor shall close a minimum of 425 cases per week. The contractor shall assist in correspondence preparation, to include the generation of the standard correspondence letters that are an output of the current FOIA Case management systemThe Contractor shall process and assist in preparing correspondence for delivery (via mail and/or email). Any other correspondence will be completed as directed by the government Point of Contact (POC), and then returned to the POC for actual delivery.Serious applicants must possess:High school or equivalentFOIA program implementation and administrative duties: 3 yearsBenefits and Perks BMA, attracts the most highly motivated and qualified professionals in the Professional Services and Technology industry. We appreciate the importance of high caliber professionals and offer an attractive total compensation plan that includes: Competitive salaryMedical, dental, vision, life, and disability insurancesMatched 401(k) retirement savings planPaid time off (PTO) and federal holidaysTuition reimbursement"}