{"jobID": "2731965143", "jobLocation": "Ann_Arbor_MI", "jobTitle": "Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.koddi.com", "Headquarters": "Fort Worth, TX", "Size": "1 to 50 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "If you are you passionate about big data, want to be part of a great team, and love building new technology, we want to speak with you. As a Data Engineer you will work with our technology team to build and maintain our suite of data pipelines, stores, and databases that power sophisticated marketing products used by many of the worlds largest advertisers. We are looking for smart and hardworking individuals who have the DNA needed to build world class software. The right candidates will be creative thinkers who can design and deploy professional applications using the newest technologies to solve real business problems.Who you are... You have bachelors degree in computer science or similar.Youre a whiz in SQL.You have experience with querying and loading data (ETL), database design, and query optimization.You have basic command line knowledge and Git.You have dealt with large databases that contain millions of rows and know how to architect databases for performance.You can write engines that generate wicked-fast SQL statements.You can write SQL statements and stored procedures in your sleep.You have a natural commitment to quality and thoroughness.You thrive in ever-changing environments.Youre organized, you manage your time well, and you stand behind your work.You communicate well with coworkers of all levels.Youre confident, forward-thinking whos well versed in web and object-oriented development processes and concepts.You have a passion for learning new technologies.Your drive to innovate is inspiring. What you'll do... Youll work full-time, for a great salary, in a collaborative and growing privately held company.Youll work within robust data systems and develop custom solutions while consulting with external customers.You will recommend and implement improvements to data processes/warehouses that improve supportability, usability, and scalability.Youll optimize and refactor existing code.Youll Improve efficiency, scalability, and reliability of applications.You will use your top notch collaboration skills with other team members across all departments.Youll participate in lively technology discussions where your opinion is truly valued.Who we areWere connecting travelers with experiences through best in class technology and innovation.Koddi is an advanced reporting, bid management and campaign intelligence software platform for metasearch publishers like Google Hotel Ads, TripAdvisor, Kayak, Trivago, and other travel products that enables hotel supplier, OTA, and agency clients to reach more customers at higher returns. Koddi was built with the digital marketer in mind and provides a fast, intuitive interface, custom, on-the-fly reporting, bulk and granular bidding tools, and alerting functionality."}