{"jobID": "2825976651", "jobLocation": "Jersey_City_NJ", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.apexsystems.com", "Headquarters": "Glen Allen, VA", "Size": "1001 to 5000 employees", "Founded": " 1995", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " TEKsystems, Insight Global"}, "estimatedSalary": null, "jobDescription": "Marketing Research Analyst1 Year Contract-To-HireJersey City, NJ The Marketing Research Analyst is a new position that will play a critical role in helping the Marketing Research team meet the growing demand for customer research and insights.  The Marketing Research team functions as an internal supplier for the entire organization, and you will be responsible for providing operational support across a wide range of research projects, such as advertising development and testing, brand tracking, and new product / service development. You will also help organize and maintain the body of knowledge from both primary and secondary/syndicated research.  This is a unique opportunity to develop both client-side and supplier-side skills, with the benefit of seeing how your efforts impact business decisions. Responsibilities:Programming SurveysFielding Surveys taking sample file and splitting into smaller filesData Analysis using SQLProducing charts and verbatim analysisQuota ManagementTechnologies & Tools:Must Have:SQL is a must know how to interact with database, tables, joins, queryingProgrammed a survey on a platform (Qualtricks - what they are using or Survey Monkey, IntelliSurvey, etc.)Strong Plus:SPSSSASAdvanced ExcelStatistical knowledge EEO Employer  Apex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at [Click Here to Email Your Resumé] or 844-463-6178."}