{"jobID": "2834807750", "jobLocation": "Alexandria_VA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Society for Human Resource Management (SHRM) The Society for Human Resource Management is an equal opportunity employer (Minority/Female/Disabled/Veteran).  ACCESSIBILITY NOTICE: If you need a reasonable accommodation for any part of the employment process due to a physical or mental disability, please send an email to: accessibility@shrm.org or TDD (703) 548-6990.  US-VA-Alexandria 2018-1024Category Research & Insights OverviewSHRM WANTS TALENT WITH A BOLD PURPOSE. TALENT THAT BELIEVES IN EXCELLENCE AND ACCOUNTABILITY. TALENT THAT IS FLEXIBLE TO TRY NEW THINGS AND AGILE ENOUGH TO PIVOT WHEN THEY DON'T WORK OUT. WE NEED PEOPLE WHO ARE SMART AND CURIOUS, AND BELIEVE IN OPEN COLLABORATION TO GET TO THE BEST RESULT. The Data Scientist, Knowledge Development works closely with other departments and organizations as part of a larger strategy and design thinking team which encompasses competencies in social science research, product strategy, data visualization, advanced analytics, and data science. This position will be responsible for applying statistical and data mining tools to develop insight from human capital data and then transforming the insight into compelling stories and info graphics and other data visualization techniques. This position will require the incumbent to think creatively and propose innovative ways to look at data to identify trends and patterns that impact the HR, the workplace and public policy. Responsibilities YOUR TYPICAL DAY WILL INCLUDE:Creating narrative, editorially-guided products including, but not limited to reports, whitepapers, blog posts, web pages, and interactive products that engage diverse audiences with human capital research.Designing, managing, coaching and/or conducting research using multiple methods and analytical techniques (statistics, machine learning, natural language processing, etc.) as necessary to answer human capital questions.Managing the analytic project lifecycle from initial concept through iteration and final delivery.Creating analytic plans, translating business problems/opportunities into analytic approaches. Engaging with internal and external stakeholders to understand each business question. Probes for hidden questions and goals. Brings structure to each research question and translates requirements into an analytic approach.Transforming analytic results into graphic visualizations and that can form a story in a glance. The visualizations will range from static graphs depicting traditional statistical analyses to web-enabled interactive graphics.Providing insight to other team members on the best analytic and visualization techniques for different types of data, and the limitations of certain techniques.Presenting data to internal and external customers and enable audiences to see threads in a way that allows them to ask better questions, leading to improved strategies.QualificationsTHESE ARE THE SKILLS YOU WILL NEED IN YOUR TOOLBOX:Excellent organizational skills; ability to work well under pressure, manage multiple tasks and projects concurrently and meet publishing deadlinesHigh attention to detail and ability adhere to strict deadlines and quality requirementsExceptional oral and written communication skillsComprehensive Microsoft office skills including advanced formulas and macrosAbility to use creative problem solving and analytical skills to develop effective solutions for problemsAdapts to change and seeks technologies and methods to improve tools, processes and productsSmart and curiousAbility to communicating ideas that inspire, inform, and captivate individualsStrong communicator of complex concepts and analysis, able to handle a variety of audience knowledge levels.Understanding of and ability to apply design thinking and principles of user experience design to analytic storytelling.Strong communicator of complex concepts and analysis, able to handle a variety of audience knowledge levels.Understanding of and ability to apply design thinking and principles of user experience design to analytic storytelling.Ability to work independently on multiple projects, while also working well with and within teamsAdvanced proficiency in R and/or Python programming, including machine learning and data visualization tools (Scikit-learn, R packages for machine learning & statistical learning, Matplotlib, RShiny, ggplot, knitr, plotly, d3.js).Ability to work independently on multiple projects, while also working well with and within teamsAdvanced proficiency in R and/or Python programming, including machine learning and data visualization tools (Scikit-learn, R packages for machine learning & statistical learning, Matplotlib, RShiny, ggplot, knitr, plotly, d3.js).LET US KNOW IF YOU ALSO HAVE:Proficiency in Tableau, Qlikview, or Power BI supplements but does not replace proficiency with open source tools (Python or R).Proficiency with databases (one or more of: SQL, Access, MongoDB, graph databases)THIS IS WHAT YOU MUST BRING TO THE TABLE:Bachelors degree in Data Science, Business Analytics, Statistics, Quantitative Social Science, or similar quantitative program which includes machine learning and data storytelling/data visualization3 years of experience as a data scientist in applied research settings.SHRM CP or SCP within one year of employmentWE ARE ALSO LOOKING FOR THE FOLLOWING (PREFERRED, NOT REQUIRED):Master's degree or Ph.D. in Data Science, Business Analytics, Statistics, Quantitative Social Science, or similar quantitative program which includes machine learning and data storytelling/data visualizationDemonstrated experience gathering and understanding data, processing it, extracting value from it, visualizing it and communicating it.Experience consulting to understand business problems/opportunities and translating needs into analytic projects.Experience managing the analytic project lifecycle.Experience developing different types of visualizations, including narrative editorially-guided visualizations, visualizations for interactive data exploration, dashboards, and visualizations supporting time series analysis methods.Experience using data science methods related to data architecture, data munging, data and feature engineering, and predictive analytics.PHYSICAL DEMANDS The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  Regularly required to sit; talk and hear, use hands to type, file, handle or feel. The employee is frequently required to reach with hands and arms. Occasionally required to stand; walk and stoop, kneel, crouch, or crawl. Visual acuity to use a keyboard, prepare and analyze data and figures; transcribing, viewing a computer terminal; extensive reading. WORK ENVIRONMENT The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  Work is regularly performed in a professional office environment and routinely uses standard office equipment. This job requires limited travel 0-10%.  The Society for Human Resource Management is an equal opportunity employer (Minority/Female/Disabled/Veteran).  ACCESSIBILITY NOTICE: If you need a reasonable accommodation for any part of the employment process due to a physical or mental disability, please send an email to: accessibility@shrm.org or TDD (703) 548-6990.PI103203239"}