{"jobID": "2829555542", "jobLocation": "Milpitas_CA", "jobTitle": "72161BR - Staff Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.kohlscorporation.com", "Headquarters": "Menomonee Falls, WI", "Size": "10000+ employees", "Founded": " 1962", "Type": " Company - Public (KSS) ", "Industry": " Retail", "Revenue": " $10+ billion (USD) per year", "Competitors": " J. C. Penney, Target, Macy's"}, "estimatedSalary": "158000", "jobDescription": " Data scientists interpret and apply data in analyses, and explain findings to business audiences typically, to improve products and processes. Projects support business decision making for multiple business functions. Designs, creates, implements and manages predictive analytics that leverage large and varied data sets, using a wide range of analytical tools, methods and platforms.  PRIMARY RESPONSIBILITIES Design, develop and program methods and processes to consolidate and analyze sources to generate insights and solutions.Specifically, apply data analytics to translate recommendations into business insights.Develop and execute statistical and mathematical solutions to business problems within business unit.Frame problem then determine intended approach and quantitative methods to develop solution.Use analytical and statistical methods to analyze large amounts of data, using advanced statistical techniques such as predictive statistical models, customer profiling, segmentation analysis, survey design and analysis and data mining.Design experiments to answer targeted questions.Develop materials to explain project findings to Management.Develop new algorithms and mathematical approaches to understand the company's audiences.Solves complex business problems such as optimizing product performance, revenue and adoption.Research new ways for modeling and predicting end-user behavior.Create and deliver presentations.Occasional telecommuting permitted. QUALIFICATIONS requiredPh.D. or foreign equivalent in Data Science, MIS, Computer Science, Computer Applications, Computer Engineering, Industrial Engineering, or related fieldAlternate Requirements: Bachelors degree or foreign equivalent in Data Science, MIS, Computer Science, Computer Applications, Computer Engineering, Industrial Engineering, or related field and Five (5) years of progressive experience in the position or related occupation such as Web/Business Analyst.Must have coursework, advance level coursework, project background, or experience in the following:Data Science or Data analytics;  Data Manipulation and insights; and,  Data Visualization. LI-DNP"}