{"jobID": "2786551159", "jobLocation": "Woodland_Hills_CA", "jobTitle": "Senior Health Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.blueshieldca.com", "Headquarters": "San Francisco, CA", "Size": "5001 to 10000 employees", "Founded": " 1939", "Type": " Nonprofit Organization", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "81000", "jobDescription": "Our team (Network Performance Analysis and Contracts) is part of the HCQA Division and focuses on provider network performance analysis, reporting, and consulting. The NPAC team is responsible for developing analytics and supporting materials to assist and guide strategic development and maintenance of Blue Shield's network of physicians, hospitals, ambulatory surgery centers, HMO IPA's, and medical groups.  Our team focuses on network design, maintenance and regulatory support. Some of our key responsibilities are (1) provide analysis and consultative services on new network design in support of corporate strategic roadmap; (2) manages and oversees development and production of regulatory network filing artifacts as required by regulators for all Blue Shield commercial and Medicare networks; (3) provides network analytics, reporting and oversight on existing networks to ensure meeting regulatory access, availability standards as defined by regulators; and (4) provides consultative and analytical support as needed to during contract negotiations, pricing activities and product/network strategy roadmap planning.  This position can be located in our San Francisco, Rancho Cordova or Woodland Hills offices. Responsibilities:PPO narrow network maintenance inclusive of refreshing of network, support of regulatory filings and establishing self as SPOC for all inquiries related to network maintenance.Provide recommendations on future network modifications and processes to ensure adequacy and aligning to network intent.Collects, analyzes and synthesizes data; develops artifacts and summaries in response to regulatory filings and comment letters for these networks.Produce geo-access reports and analysis/summaries for regulatory filings.Collaborate with internal stakeholders and customers to identify enhancement opportunities to improve network composition, processing and expansion.Manage PPO narrow network maintenance projects that may involve coordinating a team and working with different stakeholders.Independently summarize findings and presents data in formats such as excel pivots, power point, reports, grids and tables.Develop and maintain code in key systems such as SAS, SQL and Access that are used for maintenance of networks.Support development of presentations/reports for internal and external customersAd hoc assignments as requested.Bachelors degree and at least 4 years relevant experience or equivalent combination of education and experienceHealthcare analytics experience preferredExcellent interpersonal skillsExcellent communication and presentation skills, previous experience in presenting to leadersGood business acumen, ability to work in a team environmentGood math, analytical and problem-solving skillsIntermediate to Advanced knowledge of MS Excel (able to model, use formula) and Access (link tables, run queries)Geo-coding and SAS experience preferredAbility to work in a team environment.Ability to work independently, proactively and with little direction."}