{"jobID": "2691093237", "jobLocation": "Santa_Monica_CA", "jobTitle": "Scientist, In Vivo Pharmacology", "companyRating": null, "companyInfo": {"Website": "www.kitepharma.com", "Headquarters": "Santa Monica, CA", "Size": "501 to 1000 employees", "Founded": " 2008", "Type": " Company - Public", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " For Current Kite Pharma Employees and Contractors:Please log onto your Internal Career Site to apply for this jobJob DescriptionWe are seeking a highly motivated individual with immunology and/or oncology experience to work on innovative T cell therapies for cancer treatment. The successful candidate will play an integral role as a key team member of the Pharmacology group, focused on the development and in vivo characterization of Kite’s autologous T cell products. Under minimal supervision, you will be expected to perform experiments, organize and analyze results, and communicate and present findings in team meetings. You will also be asked to perform other duties as required. Responsibilities include, but are not limited to:Independently interact with Contract Research Organizations (CROs) to support in vivo studies related to the development of cancer immunotherapy productsWork with a cross-functional research team to advance the development of autologous T cell therapy products and provide input into project directionIndependently plan experiments and interpret data as required for projectSuccessfully execute and document laboratory procedures and experiments with great attention to detailOther duties as assignedRequirements:Ph.D. degree in immunology or a closely-related field with 3 years of relevant post-doctoral laboratory experience in cellular and/or tumor immunology (industry experience preferred)Knowledge of T-cell trafficking to the tumor microenvironment in vivo is preferredPrior experience of managing/mentoring research associate level staffPrior experience of culturing primary human T cells and cell linesExperience with retroviral and/or lentiviral transduction of primary cellsProficiency in the in vitro analysis of immune cells, including multi-parameter flow cytometry, Luminex® assays and qPCRKnowledge of relevant emerging technologies, for example, Droplet DigitalTM PCRSelf-motivated and willing to accept temporary responsibilities outside of initial job descriptionAbility to work in a highly collaborative environmentAbility to think critically, and demonstrated troubleshooting and problem solving skillsStrong organizational and record-keeping skillsExcellent interpersonal, verbal and written communication skillsComfortable in a fast-paced small company environment with minimal direction and able to adjust workload based upon changing priorities Kite is a biopharmaceutical company engaged in the development of innovative cancer immunotherapies with a goal of providing rapid, long-term durable response and eliminating the burden of chronic care. The company is focused on chimeric antigen receptor (CAR) and T cell receptor (TCR) engineered cell therapies designed to empower the immune system's ability to recognize and kill tumors. Kite is based in Santa Monica, CA. For more information on Kite, please visit www.kitepharma.com. Sign up to follow @KitePharma on Twitter at www.twitter.com/kitepharma.For jobs in the United States:As an equal opportunity employer, Gilead Sciences Inc. is committed to a diverse workforce. Employment decisions regarding recruitment and selection will be made without discrimination based on race, color, religion, national origin, gender, age, sexual orientation, physical or mental disability, genetic information or characteristic, gender identity and expression, veteran status, or other non-job related characteristics or other prohibited grounds specified in applicable federal, state and local laws. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Era Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants who require accommodation in the job application process may contact careers@gilead.com for assistance.  For more information about equal employment opportunity protections, please view the ‘EEO is the Law’ poster.  NOTICE: EMPLOYEE POLYGRAPH PROTECTION ACT YOUR RIGHTS UNDER THE FAMILY AND MEDICAL LEAVE ACT PAY TRANSPARENCY NONDISCRIMINATION PROVISION  Our environment respects individual differences and recognizes each employee as an integral member of our company. Our workforce reflects these values and celebrates the individuals who make up our growing team.  Gilead provides a work environment free of harassment and prohibited conduct. We promote and support individual differences and diversity of thoughts and opinion.For jobs in France:Conformément à la Loi « Informatique et Libertés » (06/01/78), nous vous informons du fait que les données personnelles renseignées pourront faire l'objet d'un traitement informatique par Gilead et pourront être transmises aux Organismes Sociaux. Par ailleurs, vous disposez d'un droit d'accès, de rectification et de suppression des données vous concernant. Vous pouvez exercer ce droit en contactant: FranceDataPrivacy@gilead.comFor Current Kite Pharma Employees and Contractors:Please log onto your Internal Career Site to apply for this job."}