{"jobID": "2837754979", "jobLocation": "Washington_DC", "jobTitle": "Human Capital Analytics Consultant", "companyRating": null, "companyInfo": {"Website": "www.experthiring.com", "Headquarters": "Piscataway, NJ", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Top reasons to work for my client, Fannie Mae:Do you want to work for a company that is the leading source of funding for housing in America?Do you want to work for a company that's helping to build a sustainable housing finance system that is changing peoples lives across the country?Do you want to work for a company that provides paid leave for giving back to the community?Do you want to work along side a diverse and high performaing team to help make a difference in enabling access to housing?Do you want to work for a company that offers a comprehensive range of benefits that help you manage your finances and personal life to provide a healthy work/life balance?If that's you, check out this opportunity!Job Type : Full TimeLocation : Washington, District of ColumbiaPay : Good pay and benefits!Job Description The Human Capital Analytics Consultant contributes to the organization's success by collecting and analyzing human capital and HR data and metrics to identify important workforce trends and demonstrate the implications of these trends on the business. This is a high-impact, key contributor position responsible for consulting with the business and/or HR COEs to analyze workforce data and insights, particularly as it relates to workforce planning, succession planning, recruiting, diversity/EEO, and talent management. This role is responsible for ensuring the data is accurate and for translating it in a clear, concise, and business-relevant manner to key business stakeholders. KEY JOB FUNCTIONSLeverage multiple data sources and tools to produce actionable metrics that drive strategic decision making.Work proactively and independently with business and/or HR COE customers to perform analysis of relevant workforce metrics, uncover and interpret trends in data, and produce substantiated recommendation presentations.Conduct in person and Webex training to support analytics products and produce relevant training documentation.Investigate new methods of improving analytics service delivery while ensuring compliance with governance standards.Conduct benchmarking analysis by tracking of progress of business and/or HR COE customers’ metrics against benchmarks.Conduct research, design, and execute studies to analyze special workforce issues for internal business clients and HR COE Leadership.Provide ad-hoc data analysis as required.EDUCATIONBachelor's Degree or equivalentMINIMUM EXPERIENCE4+ years of related experienceSPECIALIZED KNOWLEDGE AND SKILLSPrior experience working in a human capital analytics/insights role required.2+ years of experience using Tableau is required.Ability to successfully partner across multiple groups.Understanding of descriptive and inferential statistics techniques.Highly consultative and able to work closely with internal business customers effectively in a fast paced, changing environment.Ability to problem solve and present findings to multiple levels of the organization.Knowledge of R and/or Python is a plus.Knowledge of Oracle HCM Cloud is a plus. Our client asked me to submit 3 great people within the next few days. We work directly with the hiring manager and can arrange interviews within a few days Jessica Rubin - provided by Dice  Human capital analytics experience,Tableau experience,Knowledge of R or Python,Knowledge of Oracle HCM Cloud"}