{"jobID": "2833183786", "jobLocation": "Princeton_NJ", "jobTitle": "Research Scientist", "companyRating": null, "companyInfo": {"Website": "www.edgestreamlp.com", "Headquarters": "Princeton, NJ", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Research Scientist  We seek highly skilled scientists interested in applying advanced mathematical modeling techniques to trading in world financial markets. The research group at Edgestream consists of a small team of Ph.D.s who perform statistical, information theoretic, and algorithmic research as well as engineer the computational infrastructure of a quantitative hedge fund.  We are a fully research-driven company and every member of the research staff has an opportunity to contribute directly to the company's bottom line.  No knowledge of finance is required. The ideal candidate:Has a Ph.D. in Mathematics, Computer Science, or the Physical SciencesIs comfortable with programming and complex dataHas a demonstrated ability to successfully conduct top-level researchCan clearly communicate results and collaborate with others The research group uses Python and Cython on Linux to develop mathematical models for global systematic trading. We use open-source tools as much as possible, with numpy, git, and of course Python all being crucial to our business. We are looking to hire someone who wishes to stay with us for the long haul and to help us grow our business.  Our firm is not your typical Wall Street concern, but instead is a small group of former scientists and engineers with a unique approach to global markets.  Some of the benefits of working at Edgestream: Awesome colleaguesCompetitive salaryPerformance-based discretionary bonus401(k)Excellent health and dental insurance with 100% of premiums paid by Edgestream - for employees and their immediate familyCatered lunches, four days a weekFree on-site gym Please send your resume and cover letter to: careers@edgestreamlp.com  No telecommuting.  Legal disclaimer: In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.SDL2017"}