{"jobID": "2789494301", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist III", "companyRating": "3.4", "companyInfo": {"Website": "jobs.groupon.com", "Headquarters": "Chicago, IL", "Size": "5001 to 10000 employees", "Founded": " 2008", "Type": " Company - Public (GRPN) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Amazon, Google, Facebook"}, "estimatedSalary": "204000", "jobDescription": "At Groupon, data drives our decisions. We are looking for a Data Scientist who will join an influential team to guide the Groupon Goods product roadmap by deriving meaningful insights from the wealth of data we have from our customers, logistics networks and suppliers. You will be building machine learning models which empowers pricing intelligence and supply intelligence initiatives. We need an analytics and modeling expert the team can count and you will get to see your work rapidly feed back into the evolution of our products.The ideal candidate will:Synthesize raw data into recommendations on how products should evolveBuild machine learning algorithms to enable decision making in order to optimize customer experience/reduce cost/maximize profits or customer valueWork with product management and engineering and operations teams to develop KPIs for new features and instrumentation to quantify the adoption of new product initiativesQuantify the value of existing product improvements or the potential value of new product hypotheses.Design and support large-scale multivariate tests to prove out new ideasCreate product scorecards for teams and managers to track product performance, business impact and discover opportunitiesDeep-dive analyses to identify root causes of product or operational issuesDesign both the business logic and the technical specifications to extract key data elements from a data warehouseQualifications:BS or graduate degree in Computer Science, Statistics, Mathematics, Economics or similar quantitative field, with an emphasis on predictive analytics, data mining, statistics, machine learning, algorithms, etc.3-6 years of data science experience working closely with product and engineeringAbility to translate business objectives and problems into analytical problems, and use quantitative/qualitative skills to deliver simple, logical and actionable solutions.Experience with data visualization (such as Tableau) and presentationAdvanced proficiency in R, Python, and ExcelProficiency with SQL, Hadoop, or other Map/Reduce (or other scripting language)Proven ability to own data science initiatives end-to-endAbility to build predictive modeling such as time series, k-nearest neighbors, random forests, ensemble methodsUnderstanding of applied math topics, such as probability and statistics, linear algebra, basic optimization techniques, etc.Ability to understand and use software engineering techniques - parsing through data logs, leading instrumentation specifications and implementation, using and rewriting APIs, integrating APIs with data tools, knowledge and integration through machine learning platformsGroupon’s purpose is to build strong communities through thriving small businesses. To learn more about the world’s largest local ecommerce marketplace, click here for the latest Groupon news. Plus, be sure to check out the values that shape our culture, guide our strategy and make our company a great place to work. And just don’t take our word for it. Hear from real Groupon team members and learn more about our employee resource groups. If all of this sounds like something that’s a great fit for you, then click apply and let’s see where this takes us."}