{"jobID": "2671676994", "jobLocation": "Plano_TX", "jobTitle": "+ Data Scientist", "companyRating": "4.7", "companyInfo": {"Website": "www.infoquestgroup.com", "Headquarters": "Edison, NJ", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": "Duration & Type: 12 months Contract Location: Plano, Texas No. of Positions: Multiple Please Note: This is a W-2 only position, Corp-to-Corp candidates will not be considered for this role.Description: This position is for a Data Scientist who can think strategically and intuitively about uses of data and interaction of data usage with data design; and has the curiosity and skepticism while analyzing data. Responsibilities:Work closely with the IT, Sales and Marketing organizations functional leads to formulate and deliver insights to productionPerform data studies and data discovery around new data sources or new uses for existing data sourcesDesign and build large and complex data sets from spurious sourcesDesign and implement statistical data quality procedures around data sourcesUse statistical packages to perform statistical analyses with data setsImplement software solution required for accessing, handling and updating data appropriatelyVisualize and report data findings to provide insights for the organizationServe as a functional lead and mentor to other team members within the organizationProvide domain expertise to external vendors, partners, and members of other organizationsRequired:Experience creating models utilizing Machine Learning and/or StatisticsExposure to the Hadoop Ecosystem tools (e.g Spark, MapReduce/Tez) or other big data technologiesExperience manipulating big and noisy datasets (e.q. SQL, Pig, Hive)Bachelors or Masters (preferred) degree in Computer Science, Math or Scientific Computing; Data Analytics, Machine Learning or equivalent experience.Minumum 2 to 8 years of experienceNice to have – Knowledge of scalable data visualization techniquesAbility to create prototypes quickly For consideration, please send resume to career@infoquestgroup.com"}