{"jobID": "2694774542", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Analyst, Data Scientist - Brighterion", "companyRating": "3.9", "companyInfo": {"Website": "www.mastercard.com", "Headquarters": "Purchase, NY", "Size": "10000+ employees", "Founded": " 1966", "Type": " Company - Public (MA) ", "Industry": " Finance", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " PayPal, American Express, Visa Inc."}, "estimatedSalary": "175000", "jobDescription": "Who is Mastercard? We are the global technology company behind the world’s fastest payments processing network. We are a vehicle for commerce, a connection to financial systems for the previously excluded, a technology innovation lab, and the home of Priceless®. We ensure every employee has the opportunity to be a part of something bigger and to change lives. We believe as our company grows, so should you. We believe in connecting everyone to endless, priceless possibilities. Job TitleSenior Analyst, Data Scientist - BrighterionOverview:  Brighterion is an award winning Artificial Intelligence and Machine Learning Company recently acquired by Mastercard. Our innovative cross channel AI solutions are applied in industries such as fintech, investment banking, biotech, and insurance. The team at Brighterion pushes the boundaries of innovation for in pure Artificial Intelligence technologies with a culture focused on delivering the results our clients expect and deserve. The Brighterion Research and Development team is dedicated to keeping Brighterion at the leading edge of Artificial Intelligence (AI) and Machine learning (ML). We are pursuing highly motivated individual who displays strong achievement orientation, resilience, diligence, and the ability to research and innovate to provide the Brighterion model development team with the newest and most efficient technologies. It encompasses the following activities:Familiar with the latest AI and ML technologiesImplement prototype ideas using Python or Java and evaluate benefits of new technologies against existing alternative approachesResearch best way to leverage new technologies in current modeling pipelinesDesigns and models improvement of existing AI models with an understanding of business and technical issues Role Read research papers, white papers, article related to AI and ML technologies both from a theoretical standpoint and practical application in the industry.Design and implement prototypes using Python and Java programming language.Research alternative techniques and technologies. If not available in the existing framework, design and implement an approach in Java or Python.Evaluate the prototype against alternative approaches and document the strength and weaknesses. Provide recommendation on how to move forward.Research best configuration parameters of the new AI and ML technologies to provide the optimal outcome for a given vertical. All About You Strong Mathematics backgroundStrong experience in Artificial Intelligence and Machine LearningPrograming language: Java, PythonExperience with SQL languageProblem solverCreative and ingeniousBS in computer science or a related fieldGood communication skillsMastercard is an inclusive Equal Employment Opportunity employer that considers applicants without regard to gender, gender identity, sexual orientation, race, ethnicity, disabled or veteran status, or any other characteristic protected by law.​"}