{"jobID": "2259775314", "jobLocation": "Oakbrook_Terrace_IL", "jobTitle": "Data Analyst/Admin Assistant", "companyRating": null, "companyInfo": {"Website": "www.globalnest.com", "Headquarters": "Morganville, NJ", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job title: Data Analyst/Admin AssistantDuration : 12 MonthsLocation : Oakbrook Terrace IL  Job Description The team will be growing largely in the near future and this resource will help to coordinate with vendors, analyze data to help them understand what opportunities there may be as they do the work of growing the program rapidly.  At least 5 years of contract administrative experience and some  marketing (data analytics) experience would be great  Skill sets: familiar with processing of invoices, reconciling of accruals, someone with a strong MS office skillset (particularly Excel), need strong written communication skills  Nice to have: Energy Efficiency experience; familiarity with a CRM (Salesforce would be even better); strong project management skills and the ability to juggle multiple projects/contracts with up to 20 different vendors; Marketing background would be beneficial; experience working with multiple program managers; looking for someone who is a self-starter  Day in the life: Will have multiple program managers that they are doing work for and will need to keep it all organized and in synch in order to managed it through execution. Needs to be comfortable and have experience in an environment that changes every day and can shift gears very quickly. The priorities can change on a daily or even hourly basis. Would be working with a task list (maybe in something like MS Project), meeting with program managers to ensure that the tasks/projects are progressing, pull together any research that might be necessary, communication with external vendors to pull back information in order to accomplish particular parts of a project, facilitating meetings and scheduling conference calls, will attend meetings in order to take notes and be in the loop in order to have line of sight to the bigger picture relative to the tasks they are asked to do  Excel: Advanced user  Technology experience: Excel Advanced user along with strength in the rest of the Microsoft Office Suite (required), SalesForce (preferred) or other CRM (nice-to have), AssetSuite (nice-to-have) or other accounting platforms, Tableau (nice to have)  Education: Bachelor's degreeThanks & Regards,  Wajid | Technical Recruiter  Global Nest  An E-Verify Company.  Voice:(732) 333-4382 I Fax: (732) 479 -1321  E-mail: wajid@globalnest.com  Web: www.globalnest.com"}