{"jobID": "2731800004", "jobLocation": "Washington_DC", "jobTitle": "Application Engineer - Physics-based Computational Simulations", "companyRating": "3.5", "companyInfo": {"Website": "www.keywcorp.com", "Headquarters": "Hanover, MD", "Size": "1001 to 5000 employees", "Founded": " 2008", "Type": " Company - Public (KEYW) ", "Industry": " Aerospace & Defense", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " CACI International, SAIC"}, "estimatedSalary": "107000", "jobDescription": "Position Description:As part of the DoD HPCMP CREATE Meshing and Geometry Team, your mission will be develop and apply novel computational workflows utilizing geometry-based finite element modeling for a range of engineering analyses and design scenarios.Must be able to demonstrate the ablility to understand physics-based modeling requirements and work closely with the development team in order to offer computational solutions to the user community.Must be able to identify gaps and needed improvements in geometric modeling and mesh generation capabilities to realize needed workflows.Required Qualifications: MS/PhD in Engineering, Physics or Applied MathematicsSolid background in mechanics and experience in one of more of the following domains: computational fluid dynamics, structural mechanics, fluid-structure interaction, structural acoustics, electromagnetics with application to radio-frequency antenna problemsExcellent written and oral communication skillsDesired Qualifications: Experience in developing and applying mesh generation algorithms to model large-scale, multi-disciplinary engineering simulationsUnderstanding modern object oriented programming principles using C++ and/or PythonExperience developing applications and tests using software development kits (SDK) and application programming interfaces (API)Ability to work in cross-platform environments (Linux, Windows and Mac)Clearance Requirement: This position requires a Secret security clearance, based on current background investigation. KeyW is an EEO employer. We are committed to providing fair and equal employment consideration, regardless of race, color, religion, national origin, gender, sexual orientation, age, marital status or disability. How to Apply? Please click apply on the right. Recruiting Point of Contact: maria.chorabik@keywcorp.com  KeyW is a pure-play national security solutions provider for the Intelligence, Cyber and Counterterrorism Communities' toughest challenges. We support the collection, processing, analysis and dissemination of information across the full spectrum of their missions. We employ and challenge more than 2,000 of the most talented professionals in the industry with solving such complex problems as preventing cyber threats, transforming data into intelligence and combating global terrorism.  KeyW, together with its direct and indirect subsidiaries, encourages and actively supports a policy of Equal Employment Opportunity and commits to provide equal opportunity to each individual, regardless of race, color, religion, gender, sexual orientation, age, national origin or ancestry, marital status, veteran status, disability or any other classifications protected by Federal, State or local law. In fact, we foster an environment that promotes diversity, balance and fun—because we believe in the importance of having a workplace as unique as the challenges we solve.Apply!"}