{"jobID": "2729336293", "jobLocation": "Santa_Monica_CA", "jobTitle": "Principal, Data Management Platform", "companyRating": "3.8", "companyInfo": {"Website": "www.activisionblizzard.com", "Headquarters": "Santa Monica, CA", "Size": "10000+ employees", "Founded": " 1979", "Type": " Company - Public (ATVI) ", "Industry": " Media", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "94000", "jobDescription": "It’s the people What we’re looking forActivision is actively investing in its audience capabilities in a way that will evolve the application of our data for use in product development, marketing, and monetization. We are looking for an experience marketing tech professional to lead this evolution.As the Principal, Data Management Platform, you will build and maintain our current suite of audience segmentation products. Working with leading partners and massive datasets, you’ll be the bridge between idea and execution for successful data partnerships. In addition, you’ll work to ensure stakeholders understand and use our data through intuitive interfaces.What you’ll doOversee Adobe Audience Manager, including data source ingestion across all marketing channelsCreate detailed requirement definitions intended for the development teamsWork closely with a team of engineers and data scientists to build best in class audience and identity productsLead end-to-end audience integrations to improve our marketing efficiency and grow revenue while protecting our data assetsBuild products to help analyze our audience suite and provide media, digital and CRM with pre- and post-campaign insightBuild out tools to enable agile and innovative testing and personalized marketingWork with members of the marketing team to develop and deliver innovative and effective multi-channel marketing campaigns that leverage the full multi-channel capabilitiesWhat you’ll bringComprehensive experience of Audience Manager, targeting and data aggregationKnowledge of the Adobe integration into the marketing mix, with experience across digitalAdvanced technical understanding of data engineering required to onboard data management platformsPrior operational oversight of data management platformsExperience with managing and building audience and data products for media and CRMExperience of using the wider Adobe Marketing Cloud products, particularly AnalyticsUnderstanding of paid media campaign deployment, appreciation of data and technical processes to support marketing activityWhat you haveB.S., M.S. or Ph.D. in Computer Science or equivalent7+ years of experience managing or working for an ad-tech or audience management companyExperience with SQL-like interfaces, Tableau, and data processing/data warehousingYou are a highly motivated and flexible individual with the ability to lead cross-functional teams and drive projects to successful and timely deliveryAbility to adapt fast to changing environments and proactively identify future product enhancementsAsk anyone Who works at Activision, or with Activision, their favorite thing about it, and they’ll tell you it’s the people. We have a rigorous hiring process and a rigorous talent planning process. Our success doesn’t come from assembly lines producing widgets. Our success comes from people producing greatness. So, if you’re interested in our biggest priority, it’s the people. As a company, we have world class brands, infrastructure and resources. But we are nothing without the brilliance of our talented employees.Activision is an Equal Opportunity Employer. All qualified applicant will receive consideration for employment without regard to race, color, religion, sex, national origin or protected veteran status and will not be discriminated against on the basis of disability.What we doHeadquartered in Santa Monica, CA, Activision Blizzard is a global interactive entertainment software leader and the world's largest independent video game publisher.The company's product portfolio includes Activision Publishing's Call of Duty®, Skylanders™ and Destiny franchises, as well as Blizzard Entertainment's World of Warcraft^®, Warcraft^®, StarCraft^®, and Diablo^® franchises.Activision Blizzard is the parent company of Activision Publishing, Inc. and Blizzard Entertainment, Inc. and provides corporate shared services such as Legal, HR, Finance, IT, Accounting, Facilities and Sales, for both companies.Great Games Start with Great People"}