{"jobID": "2827549815", "jobLocation": "Orange_TX", "jobTitle": "Analytical Scientist", "companyRating": null, "companyInfo": {"Website": "www.invista.com", "Headquarters": "Wichita, KS", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Subsidiary or Business Segment", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Who are we? Watch to find out!''Innovation is facilitated by having the right people in the right roles with the right skills and values.''- Charles Koch, Koch Industries Chairman and CEO INVISTA, owner of the STAINMASTER®, LYCRA®, COOLMAX® and CORDURA® brands, is a subsidiary of Koch Industries, Inc., which is one of the largest private companies in America with estimated annual revenues as high as $115 billion, according to Forbes. With a presence in about 60 countries, Koch companies employ more than 120,000 people worldwide, with about 70,000 of those in the United States.INVISTA is seeking an Analytical Scientist in our Intermediates Research and Development Group to provide analytical support across INVISTA Intermediates R&D.; The Scientist is responsible to assist in developing and refining analytical methods and to provide accurate and reliable sample test data. This work is in support of internal and external customers utilizing specialized instrumentation and associated techniques (e.g., ICP, ICP-MS, HPLC, GC). Responsibilities also include performing statistical analysis and preparing written reports and presentations; instrument calibration and maintenance; instrument troubleshooting and repair; and general knowledge of laboratory operations and sample preparation techniques. Knowledge of ICP analysis is a plus.  The Orange Research Laboratory is a 25,000sq ft. facility equipped with the latest analytical instrumentation, laboratory facilities, and process control equipment. The R&D; Analytical Scientist will work with a team of professional research scientists and other support personnel in achieving research program goals. Typical schedule is on an 8 hr. M-F day schedule, but is expected to work extended hours, if necessary. Physical Requirements:"}