{"jobID": "1984103470", "jobLocation": "Pleasanton_CA", "jobTitle": "Diversified is hiring an AV Design Engineer", "companyRating": null, "companyInfo": {"Website": "www.compview.com", "Headquarters": "Kenilworth, NJ", "Size": "1001 to 5000 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " AVI-SPL, Whitlock, AVI Systems"}, "estimatedSalary": null, "jobDescription": "CompView is now part of Diversified! View the Diversified profile for up-to-date reviews, information and jobs. Visit our careers page to apply http://diversifiedus.com/about/careers/Are you looking for a career with growth opportunities? Are you looking for a place to thrive? If so, we are looking for strong AV professionals!At Diversified (formerly CompView), we support the pursuit of professional growth and development through a culture that encourages great employees, great attitudes and great teamwork. In return, Diversified prospers and new opportunities are created for even greater personal achievement.Diversified is an industry leader in the design and installation of custom engineered and integrated audiovisual media solutions. We specialize in the design and integration of audiovisual technology for complex and scalable broadcast, corporate communications and digital signage networks. Over the past 24 years, Diversified has earned a strong reputation as one of the premiere systems integrators in the United States--Commercial Integrator named Diversified as a 2017 Mega-Integrator.Diversified offers a competitive benefits package including:+ Competitive pay+ 401(k) plan with company match+ Company paid health, dental and vision insurance+ Disability and life insurance+ Paid time off and paid holidaysCheck out this current opportunity: AV Design EngineerOur top designers are: • Passionate about the A/V industry• Excited to work in a collaborative environment• Endlessly striving to exceed customer expectationsWhat do Design Engineers spend their time doing?• Providing sales engineering for projects from sales to installation• Performing detailed site surveys to communicate to the team the worksite conditions• Troubleshooting & commissioning A/V systems• Designing control system and programming functionality • Working in partnership with the local and central teams to develop documentation for clients and supporting onsite installation work of technicians• Designing schematics, electrical, architectural, conduit riser, elevations and sectional drawingsWhat background do you need to rock this job?• Knowledge of A/V Systems Integration processes and equipment• Working knowledge of design and AutoCAD software• Thorough understanding of construction and MEP documentation• Clear understanding of the construction process• Ability to communicate with architects, contractors and other related trades• Clear understanding of a wide variety of DSP products and their programming• Excellent writing, keyboarding and verbal communication skills• Solid understanding of video and audio fundamentals• Ability to think and work independently and meet demanding timelines• Incredible attention to detail• Top level problem solving and technical troubleshooting skills• Ability to think creativelyTo learn more about Diversified, visit us at www.diversifiedus.comInclude job reference code SFO-DE on all correspondence.Keyword search: AV A/V audio video visual audiovisual services installer installation integrator integration technology technological conferencing VTC CTS Crestron AMX BiAMP Extron Infocomm Smartboard Smart Polycom Cisco Elmo Sharp Panasonic EPSON projector projection flat screen board panel display monitor LCD TV CCTV CATV CAT5 access control stage sound lighting communication speakers DSP fire alarm security huddle station reselling reseller customer relationships long term career collaborate collaborative partnership client equipment software development surveys designs designing control system programming functionality schematics electrical architectural processes AutoCAD MEP documentation construction written keyboarding verbal email communication DSP fundamentals timelines attention detail"}