{"jobID": "2814382158", "jobLocation": "Reston_VA", "jobTitle": "Data Insights Analyst", "companyRating": null, "companyInfo": {"Website": "www.comscore.com", "Headquarters": "Reston, VA", "Size": "1001 to 5000 employees", "Founded": " 1999", "Type": " Company - Public (SCOR) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Nielsen, Hitwise, Coremetrics"}, "estimatedSalary": null, "jobDescription": "Job DescriptioncomScore is a leading big data technology company that measures what matters to make advertising across media more valuable. We are seeking a seeking an experienced Data Insights Analyst in our Reston VA office, to mine our large-scale data sets (2 Trillion + records/month) and provide useful insights to help inform our clients strategy for launching and analyzing marketing campaigns around the world. This Data Insights Analyst will be responsible for data analysis, design, and development of Cross Platform audience measurement products. Their work will have a direct impact on driving business strategies for prominent industry leaders. Self-motivation and strong communication skills are both must haves. Duties and responsibilities: Exercise your experience in data analytics, design, development, testing and deployment of this system.Drive analytical projects that span across multiple teams and functions including statistics, data science and client insights.Develop and test new methodology, features and concepts and integrate into production process.Participate in ongoing research and evaluation of new technologies and analytical solutions.Collaborate with teams in Data Science, Software Engineering, Operations, and Product Management to deliver timely and quality data.Able to think on their own to solve problems, give ideas that are new and help improve process. Qualifications:Bachelors degree (or completed Masters Degree) in a quantitative subject such as Statistics, Engineering, Economics, Computer Science or Information Systems.2-4 years relevant post graduate work experience in consumeranalyticsReal life experience in data analysis and problem solving with big data setsExperience with SQL, Hive, Spark, R or Python and deep knowledge of relational databases and methods for efficiently retrieving dataAbility to autonomously manage simultaneous projects in a fast paced business environmentExcellent verbal, written and computer communication skills with strong analytical and troubleshooting skillsAbility to consistently meet data expectations; holds team and self-accountable.Ability to manage change, course correct, and respond decisively.About comScore comScore (NASDAQ:SCOR) is a leading cross-platform measurement company that measures audiences, brands and consumer behavior everywhere. Built on precision and innovation, comScore’s data footprint combines proprietary digital, TV and movie intelligence with vast demographic details to quantify consumers’ multiscreen behavior at massive scale. This approach helps media companies monetize their complete audiences and allows marketers to reach these audiences more effectively. With more than 3,200 clients and a global footprint in 70 countries, comScore is delivering the future of measurement. For more information on comScore, please visit comscore.com. EEO Statement: We are an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, disability status, sexual orientation, gender identity, age, protected veteran status or any other characteristic protected by law  *LI-EB1  *MSEB"}