{"jobID": "2837194034", "jobLocation": "McLean_VA", "jobTitle": "Lead Software Developer & Mobile App Reverse Engineer", "companyRating": "3.4", "companyInfo": {"Website": "www.mitre.org", "Headquarters": "Bedford, MA", "Size": "5001 to 10000 employees", "Founded": " 1958", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Battelle, General Atomics, SAIC"}, "estimatedSalary": "132000", "jobDescription": "Why choose between doing meaningful work and having a fulfilling life? At MITRE, you can have both. That's because MITRE people are committed to tackling our nation's toughest challenges—and we're committed to the long-term well-being of our employees. MITRE is different from most technology companies. We are a not-for-profit corporation chartered to work for the public interest, with no commercial conflicts to influence what we do. The R&D; centers we operate for the government create lasting impact in fields as diverse as cybersecurity, healthcare, aviation, defense, and enterprise transformation. We're making a difference every day—working for a safer, healthier, and more secure nation and world. Our workplace reflects our values. We offer competitive benefits, exceptional professional development opportunities, and a culture of innovation that embraces diversity, inclusion, flexibility, collaboration, and career growth. If this sounds like the choice you want to make, then choose MITRE—and make a difference with us.  MITRE seeks technical candidates with a strong computer science or software engineering background to join a research and development team focused on investigating new technologies and building prototypes. The right candidate will enjoy a fast-paced team environment, working on cutting edge technology, and be a self-starter.  This position is located on-site in Lorton VA. Key Functions:Reverse engineer mobile and embedded devicesDevelop prototypes based on researchMinimum Qualifications: Bachelor's Degree in Computer Science or Computer Engineering or similar field and 8 years of experience. Candidate demonstrates an ability to apply advanced principles, theories and concepts comparable to those obtained with a Master's degree in a relevant field of study. Candidate understands the missions, domains and challenges of MITRE customers and is fully responsible for deliverables-including definition, completion, and technical quality, as well as assuring consistency across the responsibility span. In addition, candidate is able to define projects or programs greater than themselves. Required Qualifications: Secret level clearanceFamiliarity with Android and/or iOS forensicsFamiliarity with network forensics, pcap analysisFamiliarity with Linux; comfortable on the command lineFamiliarity with reverse engineering obfuscated or binary filesFamiliarity with database systems (e.g., MySQL, Postgres, SQLite)Proficient in prototyping using PythonBasic knowledge of software vulnerabilities and exploitationApplicable BS degree (preference: computer science/software engineering)Strong written and verbal communication skillsPreferred Qualifications: Familiarity with GitFamiliarity with function hooking frameworks (e.g., Frida, Xposed)Familiarity with mobile app programming languages (e.g., Java, Objective-C, Swift)Familiarity with man-in-the-middle implementationsExperience with system automationAbility to work independently to learn new technologies, languages, platforms, etc."}