{"jobID": "2814719318", "jobLocation": "Downers_Grove_IL", "jobTitle": "Materials Scientist", "companyRating": "2.9", "companyInfo": {"Website": "www.silgancontainers.com", "Headquarters": "Woodland Hills, CA", "Size": "1001 to 5000 employees", "Founded": " 1987", "Type": " Company - Public (SLGN) ", "Industry": " Manufacturing", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "89000", "jobDescription": " Job Title Materials Scientist Job Type Full-time Education Bachelor's Degree Location DOWNERS GROVE, IL 60515 US (Primary) Career Level Experienced (Non-Manager) Category Research & Development Date Needed By 6/13/2018 Shift Type Travel Job DescriptionDevelop and specify materials for metal, plastic and aluminum closures. Manage material projects from conception technical support.to production. Activities include: Development and specification of closure materials.Manage closure materials projects.Run pilot lab and manufacturing trials and provide customer/manufacturingFormulate, source and specify materials for plastic and metal food closures.Work with vendors to develop and specify new materials.Organize and run materials projects from conception to production.Design experiments and run both pilot time trials and manufacturing trials.Analyze chemical data including FTIR, GC, DSC, TMA, and rheology in order to develop relationships between material properties and closure performance.Provide support for regulatory compliance.Assist in customer and manufacturing problem analysis.Write comprehensive reports.Participate as a member of the Safety Committee. Job RequirementsBachelor’s degree in chemistry or related field. Minimum five (5) years related experience.Computer literate – specifically with Microsoft Word, Excel and PowerPoint.Knowledge of plastics and polymers/formulations/processing.Project management experience.Knowledge of Design of Experiments (DOE).Master’s degree in related field.Knowledge of regulatory compliance for food packing materials.Knowledge of rheological and thermal analysis.Knowledge of formulation and performance of metal coatings.Works under the general direction of the Manager, Material Development.LIMITATIONS AND DISCLAIMERThe above job description is meant to describe the general nature and level of work being performed; it is not intended to be construed as an exhaustive list of all responsibilities, duties and skills required for the position.  All job requirements are subject to possible modification to reasonably accommodate individuals with disabilities. Some requirements may exclude individuals who pose a direct threat or significant risk to the health and safety of themselves or other employees.  This job description in no way states or implies that these are the only duties to be performed by the employee occupying this position. Employees will be required to follow any other job-related instructions and to perform other job-related duties requested by their supervisor in compliance with Federal and State Laws.  Requirements are representative of minimum levels of knowledge, skills and/or abilities. To perform this job successfully, the employee must possess the abilities or aptitudes to perform each duty proficiently. Continued employment remains on an “at-will” basis.  Silgan is an Equal Opportunity Employer. We consider applicants for all positions without regard to race, color, religion, sex, national origin, age, marital status, or the presence of a disability, which would not prevent the performance of essential job duties with, or without reasonable accommodation of any other protective status.  Silgan is a drug-free workplace.  EEO/M/W/Vet/Disability"}