{"jobID": "2802624137", "jobLocation": "Santa_Clara_CA", "jobTitle": "Maps Data Engineer", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "157000", "jobDescription": "Maps Data Engineer Job Number: 113680284Santa Clara Valley, California, United StatesPosted: Jun. 4, 2018Weekly Hours: 40.00 Job SummaryApple Maps is looking for a software engineer with an emphasis in data engineering to join a team of data scientists and machine learning researchers to design, build and deploy Maps infrastructure. You will analyze and construct data models to support our mission, bringing to bear applied mathematics (computational geometry, classical computer vision, graph theory, etc.), data science, and machine learning to help optimize, automate, and scale maps evaluation for correctness and completeness. You will use range of data sources including satellite imagery, user data, and behavioral statistics as inputs to evaluate Maps data and services. You'll also work closely with partners to integrate our team's products within existing infrastructure, developing new infrastructure as needed. We're looking for a talented and passionate person to join this amazing team, if you feel this is you, we'd love to hear from youKey Qualifications Minimum 5 years professional experience.Extensive background in large data platforms.Experience with ETL techniques and relevant libraries.Demonstrated skill with Scala, Spark, Hadoop and Python to process large data sets.Significant experience implementing data analysis algorithms and pipelines. DescriptionThe Data Engineer will focus on crafting applications supporting the creation, measurement, and reporting of metrics and analytics for Apple Maps data. You will wrestle with big data challenges, various signal sources, and A/B test data to craft and present compelling stories that drive improvements visible to Apple’s customers.EducationA masters degree in Computer Science, Math, Physics, Engineering, or related field.Additional RequirementsSuperior written and verbal communications skills."}