{"jobID": "2634058559", "jobLocation": "Mountain_View_CA", "jobTitle": "Enterprise Data Analyst", "companyRating": "4.3", "companyInfo": {"Website": "www.addepar.com", "Headquarters": "Mountain View, CA", "Size": "201 to 500 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "91000", "jobDescription": "The Enterprise Data Solutions team is responsible for integrating clients portfolios into Addepar, consulting clients on their trickiest portfolio data challenges, and ensuring data quality. To fill this role we are looking for individuals who have exceptional analytical skills, portfolio accounting or securities knowledge, excellent verbal, written, and client presentation skills, and bring an engineering approach to all problems they encounter. The enterprise data team solves the most difficult client problems. Our main goal is to systemize and scale. Key Role Responsibilities Work with clients to clean and summarize historical data in preparation for analysis and loading into Addepar.Use Python to automate as many daily workflows as possible.Use Python scripts to interact, pull and combine data from multiple systems.Onboard new clients by identifying unique portfolio or reporting needs and enabling them in the Addepar system.Participate in broad company initiatives to stand up new product functionality or services.Collaborate with our Client Solutions team and Data Engineers to resolve data issues that impact our clients and create repeatable solutions.Leverage your own deep financial industry knowledge, insights gleaned from the team, and the Addepar platform to design flexible and scalable solutions. Relevant Skills Knowledge/experience of the financial industry, securities modeling, post-trade processing or back-office systems a plus.Must have great intuition, be practical, and demonstrate high degree of grit to solving large and nuanced data challenges.Consulting experience with focus on structured problem solving, synthesis, and presentation.Facility with Excel, and SQL.Experience with Python development and APIs.Addepar is the financial operating system that brings common sense and data-driven investing to our financial world. Addepar gives asset owners and advisors a clearer financial picture at every level, all in one place. It handles all types of assets denominated in any currency. With customizable reporting, financial advisors can visualize and communicate relevant information to anyone who needs it. Secure, scalable, and fast, Addepar is purpose-built to power the global financial system. Hundreds of single and multi-family offices, wealth advisors, large financial institutions, endowments, and foundations manage over $1 trillion of assets on the Addepar platform. Addepar has offices in Mountain View, New York City, Salt Lake City, and Chicago.At Addepar, we rely on a range of backgrounds, experiences, and ideas. We value diversity, and were proud to be an inclusive, equal opportunity workplace."}