{"jobID": "2837672078", "jobLocation": "Chicago_IL", "jobTitle": "Senior Data Research Analyst- Level II", "companyRating": "3.4", "companyInfo": {"Website": "www.morningstar.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1984", "Type": " Company - Public (MORN) ", "Industry": " Finance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Thomson Reuters, FactSet, Bloomberg L.P."}, "estimatedSalary": "99000", "jobDescription": " The Group: The Data Division is responsible for collecting and  maintaining data on approximately 385,000 investment offerings,  including stocks, mutual funds, and similar vehicles. The Role: As a Level II Data Analyst in the Data Division, you will support  complex data and data product cases that get escalated to be reviewed  from the Level I support teams. You will work closely with Client  Service Support, Data Product Management and Data Operations to ensure  resolution of these issues. Our analysts are required to research  identified issues, ensure timely resolution, and communicate outcomes  to all appropriate team members. Timely resolution requires  coordinating resources across various data teams. The position is  based in our Chicago office. Responsibilities: Work with the Level II Manager to define the Level II workflow for  the Data Division. Contribute to ongoing efforts to streamline and  improve this and related workflows.  Utilize meta data to identify trends within large volumes of data  cases. Propose solutions to mitigate those trends. Champion cross-team  projects to implement approved solutions.  Track, evaluate, and determine the resolution approach for complex  data issues that escalate from the Level I teams (Product Support,  Client Service Consultant and Relationship Management).  Demonstrate a high sense of ownership of the issues in the data  ticket queue to be responsive and provide timely updates, follow-up,  expedition, and resolution.  Prioritize issues properly by severity and impact.  Partner with Client Service, Product, and Sales to ensure issue  management processes are followed.  Understand roles, responsibilities, and expertise of internal  stakeholders to successfully expedite issue resolution.  This will also be a client facing role that needs to meet with  client either call or in-person from time to time. Requirements: A minimum of 2-5 year of experience working with Morningstar s  internal database tools and data collection processes, including but  not limited to RDB, Data Manager, XOI, and TSDB.  A minimum of 2-5 year of experience working with Morningstar data  methodology.  Excellent writing, communication, problem solving, organizational,  and analytical skills.  Ability to work independently and manage competing priorities and  deadlines.  Excellent computer skills.  Morningstar Data Product knowledge is a plus.  A bachelor s degree is required."}