{"jobID": "2826011666", "jobLocation": "Washington_DC", "jobTitle": "Biologist/Scientist", "companyRating": null, "companyInfo": {"Website": "www.aquilent.com", "Headquarters": "Laurel, MD", "Size": "201 to 500 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Employee Type: Full-Time Location: Washington, DC Job Type: Science Experience: Not Specified Date Posted: 6/21/2018 About Us At Booz Allen, we harness our collective ingenuity to solve our clients' toughest management and technology problems. We work with governments, Fortune 500 corporations, and not-for-profits around the globe, in industries ranging from defense to health, energy to international development. We believe there is no product, code, or strategy that can create progress-only people can. That's why for more than 100 years we've empowered our team: over 24,000 dreamers, drivers, and doers who work together to change the world. Job Description Job Number: R******* Biologist/Scientist Key Role: Serve as a scientist in biological sciences. Perform bench science and work in a laboratory environment. Assist with technical program management and analyze procedures. Engage in activities, including research, data gathering, and analysis, focusing on expanding knowledge and developing consulting expertise. Operate in an environment with direct supervision and interact with clients under the guidance of others. Basic Qualifications: -2+ years of experience with working in a biology laboratory -Experience with using ECL and PCR analytical equipment -Experience with enzyme-linked immunosorbent assay (ELISA) analysis -Experience with analyzing laboratory procedures -Ability to work from 5:00am - 2:00pm -Ability to obtain a security clearance -BS degree in Biology Additional Qualifications: -Experience with laboratory information management systems (LIMS) -BS degree in Chemistry Clearance: Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information. We're an EOE that empowers our people - no matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran status - to fearlessly drive change. E & S1"}