{"jobID": "2837155686", "jobLocation": "Walnut_Creek_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.medpricer.com", "Headquarters": "Guilford, CT", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Company DescriptionFor more than a decade, Medpricer has helped move savings strategies forward with scalable purchased services solutions that improve sourcing efficiency and financial health.  Their industry-leading software, mSource®, is the only all-in-one contract management, negotiation, and analytics platform that enables organizations to tailor contract terms to fit their unique needs not those of a group.  Engage with your purchasing data, learn from market intelligence, unite your stakeholders, and move contracts through the pipeline faster. No catches, no hidden admin fees.  Discover substantial savings and deliver outcomes that continuously improve the quality of patient care.Job Description Assess, categorize, and spot check customer spend dataAssess and analyze transactional data/contracts to create price and service level benchmarksCompare complex pricing methodologies to provide accurate pricing estimatesCreate custom strategic sourcing plans based on a variety of customer driven parametersAggregate and cleanse data to help train machine learning alorgithimsResearch purchased services trends and identify industry leading suppliersQualifications0-2 years experience working in a high energy team environmentExcellent critical thinker, strong problem solverOutstanding organizational skills, ability to oversee multiple projectsFast learner, adept at understanding and implementing new technologies on the flyExcel guru, able to slice and dice data to perfectionExpedient perfectionist, striving to finish initiatives as fast as possible while maintaining the highest qualityExperience with SQL a plusHealthcare experience a plusAdaptability to a high growth, evolving company4-Year College Degree Additional InformationExciting Perks and Benefits Excellent health and dental insurance  401k with employer match  Generous paid time off  Stock Options"}