{"jobID": "2797075369", "jobLocation": "Ann_Arbor_MI", "jobTitle": "Staff Physician (Psychiatrist)", "companyRating": "3.4", "companyInfo": {"Website": "www.vacareers.va.gov", "Headquarters": "Washington, DC", "Size": "10000+ employees", "Founded": " 1930", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "215000", "jobDescription": "Ideal candidates will have expertise in psychiatric assessment and management of patients of high complexity and across a broad diagnostic range in both Primary Care and Mental Health settings as well as via Tele-Psychiatry; ability to work in interdisciplinary teams; active participation in supervision and education of medical students, psychiatry residents and allied health trainees; track record of program improvement, academic activities and medical leadership. Specific duties will be position-dependent and include providing comprehensive psychiatric care for veterans in Ann Arbor/Flint/Jackson/Toledo in both Primary Care and Mental Health settings, as well as training and participation in Clinical Video Conferencing (Tele-psychiatry). Responsibilities also include providing on-site coverage as needed in the VA Ann Arbor Healthcare System sites including hospital-based programs. Duties also include supervision of psychiatric trainees as well as contributing to the academic mission of the service. Medical leadership opportunities will be considered for candidates with a strong interest and a track record. The VA Ann Arbor MH Service is a Partner Affiliate of the Department of Psychiatry at the University of Michigan Medical School. You will be joining a vibrant mental health service with academically active fellow psychiatry and psychology faculty and over 180 other interdisciplinary professional and support staff. Salaries are competitive with several additional benefits. Faculty have full and free access to University of Michigan library system, weekly U of M and VA grand rounds, and a yearly professional development fund for conferences and self-education. We pride ourselves on clinical excellence, collegiality, teamwork, academic enrichment, and support of academic development by leveraging our strong program evaluation and research strengths for interested clinical faculty. Candidates should be board-eligible/certified in Psychiatry, have strong broad clinical (outpatient and hospital based settings) and leadership skills and ability to adapt and work flexibly with several multidisciplinary teams. Specialty board eligibility/certification is preferred but not required (e.g. Geriatric, Addiction, Psychosomatic). Experience with Tele-psychiatry is preferred but not required. Tour: A regular VA tour is 8:00 a.m. to 4:30 p.m. Desire and willingness to work alternate tours (specifically one or both days of the weekend) is highly preferred.Basic Requirements: United States Citizenship: Non-citizens may only be appointed when it is not possible to recruit qualified citizens in accordance with VA Policy.Degree of doctor of medicine or an equivalent degree resulting from a course of education in medicine or osteopathic medicine. The degree must have been obtained from one of the schools approved by the Department of Veterans Affairs for the year in which the course of study was completed.Current, full and unrestricted license to practice medicine or surgery in a State, Territory, or Commonwealth of the United States, or in the District of Columbia.Completion of residency training, or its equivalent, approved by the Secretary of Veterans Affairs in an accredited core specialty training program leading to eligibility for board certification.Proficiency in spoken and written English.Physical requirements outlined below.Preferred Experience: Experience with Tele-psychiatry is preferred but not required. Specialty board eligibility/certification is preferred but not required (e.g. Geriatric, Addiction, Psychosomatic). Reference: VA Regulations, specifically VA Handbook 5005, Part II, Appendix G-2 Physician Qualification Standard. This can be found in the local Human Resources Office. Physical Requirements: Applicants must meet physical standards for the position. A physical examination prior to placement is required. This is a designated drug testing position. After appointment, you will be subject to random testing for illegal drug use. Requires lifting 15-44 pounds; reaching above shoulder; use of fingers and both hands; walking and standing from 3-5 hours and kneeling. Must have depth perception and ability to distinguish basic colors and shades of colors. Hearing aid is permitted.None  To apply for this position, you must provide a complete Application Package which includes (upload C.V. as resume document type): Resume VA Form 10-2850 - Application for Physicians, Dentists, Podiatrists, Optometrists & Chiropractors can be found at: http://www.va.gov/vaforms/search_action.asp?FormNo=2850&tkey;=&Action;=Search.  The following documents are accepted, and may be required if applicable to your eligibility and/or qualifications for this position. Please use this checklist to ensure you have included all documents required for your application, such as a copy of your transcript (if using education to qualify), SF-50's, etc. Cover LetterDD-21410-2850ResumeSF-15SF-50Transcript"}