{"jobID": "2750306895", "jobLocation": "El_Paso_TX", "jobTitle": "SIS Integration and Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.ideapublicschools.org", "Headquarters": "Weslaco, TX", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " School / School District", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "47000", "jobDescription": "SIS Integration and Data Analyst Location: Upper Valley Role Mission: The SIS Integration and Data Analyst enhances, administers and supports the student information system and infrastructure for the district. This includes analyzing student data pipeline processes and aligning system capabilities to improve these processes. The SIS Integration and Data Analyst consults with stakeholders and collaborates on systems’ projects to eliminate ineffective data management and improve data accuracy and partners with internal and external stakeholders to ensure student data synchronization across other systems. Lastly, the SIS Integration and Data Analyst updates the SIS team on new technology by participating in professional development; reading professional publications, and maintaining professional networks.  The mission for the SIS Integration and Data Analyst is to achieve 97.5% average daily attendance, 100% enrollment, maintain 100% data accuracy,100% compliance with IDEA’s attendance procedures, softwares connected to student information system are syncing properly, and student information system is available for the entire district during school operation to which it is being utilized for its capabilities. The SIS Integration and Data Analyst safeguards the security and integrity of student information and data reporting. Accountabilities:1. Meets (or exceeds) an Average Daily Attendance (ADA) of 97.5% Across the Network and 100% Compliance with IDEA’s attendance procedures. * Partners with internal and external stakeholders to develop and implement innovative technology to maximize efficiency in the ADA process.  * Streamline data automation for the ADA Dashboard.  * Develop and maintain ADA Data Quality Framework by use of data validation controls and data audit reports that identify “dirty” data 2. 100% Data Accuracy measured by PEIMS State Submissions * Collaborates with SIS team members and utilize data automation to reduce manual entry of data  * Collaborates with SIS team and campus teams to provide efficient and effective strategies to support staff in the data collection process. 3. 100% Cross Functional (Peripheral) Software Integration * Partners with Program Innovation Team to ensure Blending learning systems are integrated with SIS  * Partners with Academic Services to ensure systems are integrated with SIS  * Collaborates with School Operations to ensure systems are integrated with SIS  * Develops setup process for software connected to student information system.  * Ensure software connect to student information are synchronizing appropriately by start of school.  * Evaluate integration requirements annually with partners.  * Controls solution by establishing specifications; coordinating production with programmers.  * Validates results by testing software connections 4. 85% Retention of SIS Coordinators and Registrars * Customizes tools and support for SIS and Registrars to use in the field.  * Develops tracking mechanisms manage around Campus Operations and SIS goals.  * Customizes the onboarding practices to ensure each new team member is set up for success based on the unique responsibilities of their role.  * Develops and executes differentiated professional development focused first and foremost on student compliance, attendance tracking to build technical capacity.  * Develops ease of use of student information system.  * Minimizes work for IDEA stakeholders towards student information system. 5. Executes on 100 % BOY Readiness Plans for Campus Operations * Collaborates with Marketing and Communication, Regional Directors of Operation to streamline registration and re-registration processes.  * Collaborates with Regional Director of Operations to ensure all schools are set up in the student information system by the first day of school  * Collaborates with Human Resources and Payroll to ensure integration between HRIS and SIS.  * Partner with HR and Payroll to automate the data migration process between HRIS and SIS.  * Ensure student information being carried over from registration system to student information system.  * System readiness for incoming students.  * Provides efficient and effective strategies around plans to support IDEA employees, while ensuring a high level of customer satisfaction  * Supports IDEA’s Beginning of the year management strategy, by developing cross-functional frameworks for ensuring student data accuracy and integrity, implementing cross-functional system integration, and creating timely and relevant access to data.  * Creates student information system to ensure it ready for the start of school.  * Manages student information system connections to other software in organization are ready for start of school. 6. 100% Business Continuity of the Student Information Systems * Ensure student information system uptime during school operation.  * Maintain, administer and support PowerSchool database.  * Manage access, privileges and information migration.  * Systems Analyst is Responsible for installing and configuring PowerSchool software, translating PowerSchool database design and diagnosing performance issues.  * Installing software upgrades, managing hardware upgrades and maintaining computer servers.  * Develop backup and recovery strategies, and monitor servers to ensure capacity is not exceeded.  * At times, help devise network strategies, test systems and develop system standards.  * Manage student information infrastructure to ensure it is functioning appropriately.  * Evaluate & partner with stakeholders to ensure student information system is being used to maximum potential in most efficient way.  * Evaluate new tools and technologies, analyze user needs and present findings to management.  * Approve the purchase of new database products and improvements, as well as schedule, plan and supervise their installation and testing.  * Ensures operation by training staff; providing support. 7. Live values of IDEA * Believes and is committed to our mission: that all students are capable of getting to and through college  * Is driven by outcomes and results, and wants to be held accountable for them  * Has a propensity for action, willing to make mistakes by doing in order to learn and improve quickly.  * Thrives in an entrepreneurial, high-growth environment; is comfortable with ambiguity and change  * Seeks and responds well to feedback, which is shared often and freely across all levels of the organization  * Works through silos and forges strong cross-departmental relationships in order to achieve outcomes Supervisory Responsibilities: none Knowledge and Skills: Query languages including SQL, relational databases, demonstrated ability to successfully coordinate, guide and support projects in a collaborative manner; experience working with teams of diverse backgrounds and technical abilities. Qualifications:Education: Bachelor’s degree requiredExperience: 2+ years of query building experienceLicenses or Certifications: noneSelection Process: After submitting your online application, IDEA will review your materials. Candidates with a track record of success who pass the initial application screening will be invited to a phone or video interview. Candidates who are successful with this second interview will move into final consideration by the hiring manager. Application Instructions: Please select \"Apply Now\" in the upper-left hand corner of this page. You will then be taking to the application portal entrance. After you create a new profile, you will be able to apply directly for this role. If you have already created a profile, you may simply login to begin your application. IDEA Public Schools does not discriminate on the basis of race, color, national origin, age, sex or disability, in admission or access to, or treatment of employment in its programs and activities. Any person having inquiries concerning the organization's compliance with the regulations implementing Title VI of Civil Rights Act of 1964 (Title VI), Section 504 of the Rehabilitation Act of 1973 (Section 504), or Title II of the Americans with Disabilities Act of 1990 (ADA), may contact IDEA Human Resources at (956) 377-8000."}