{"jobID": "2782595050", "jobLocation": "El_Segundo_CA", "jobTitle": "SAP Analytics Consultant", "companyRating": "3.8", "companyInfo": {"Website": "www.accenture.com", "Headquarters": "Dublin, Ireland", "Size": "10000+ employees", "Founded": " 1989", "Type": " Company - Public (ACN) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Cognizant Technology Solutions, EY, McKinsey & Company"}, "estimatedSalary": "118000", "jobDescription": "Basic QualificationsBachelor's degree AND/OR relevant experience Minimum 6 months of experience with SAP Predictive Analytics AND/OR Leonardo Machine Learning Foundation Minimum 3 years of implementation experience with SAP HANA, including SAP HANA SQL/PAL Minimum 3 years of BI and Analytics experience Minimum 2 years of data warehousing implementation experiencePreferred SkillsExperience with development of complex conceptual and logical data models Understanding of SAP source system (ECC, APO, CRM, etc.) tables and relationships Experience with R or Python, independent or integrated with SAP HANA Exposure to tools such as SAP Analytics Cloud, SAP BW/4HANA and S/4HANA SAP HANA S/4 (CDS Views) Smart Data Integration (SDI), Smart Data Quality (SDQ) SAP HANA Vora and SAP Smart Data Access Prior consulting experience Deep experience in specific industry and/or functional area Experience with database development using Big Data technology (Hadoop)Preferred Qualifications:Experience with non SAP analytics solutions and other modules a plus Proven success in contributing to a team-oriented environment Proven ability to work creatively and analytically in a problem-solving environment Desire to work in an information systems environment Excellent communication (written and oral) and interpersonal skills Applicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States and with Accenture (i.e., H1-B visa, F-1 visa (OPT), TN visa or any other non-immigrant status).  Candidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.  Accenture is a federal contractor and an EEO and Affirmative Action Employer of Females/Minorities/Veterans/Individuals with Disabilities.  Equal Employment Opportunity  All employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law.  Accenture is committed to providing veteran employment opportunities to our service men and women."}