{"jobID": "2824796399", "jobLocation": "Manhattan_Beach_CA", "jobTitle": "Business Intelligence Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.truereligion.com", "Headquarters": "Manhattan Beach, CA", "Size": "1001 to 5000 employees", "Founded": " 2002", "Type": " Company - Public", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "71000", "jobDescription": " JOB TITLE: Business Intelligence Analyst  IMMEDIATE MANAGER: Sr. Manager of Data Management&Analytics; DIRECT REPORTS: N/ADIRECT REPORTS TITLES: N/A JOB CLASSIFICATION: Exempt BUDGET RESPONSIBILITY: N/A LOCATION: Manhattan Beach, Ca THE PURPOSE: Under the direction of the Sr. Manager of Data Management&Analytics;, the position is reponsible for providing analytic support across the organization to enable better data-driven decision making and planning by senior management. Assist with establishing and enforcing enterprise-wide approach to data management that improves accessibility of information sharing across the organization.  THE ROLE (what you are accountable for) Partner with business, vendors and other stakeholders to understand data and reporting needs and deliver solutions to meet business objectives and timelinesDrive design and creation of visual analytics to help aid with identification of patterns, trends and anomaliesPerform ongoing monitoring, automation and refinement of reports and data solutionsPerform analysis to identify and understand issues or events. Reconcile and validate data from multiple sources and drive resolutionAssist with data integration projects by creating requirement documentation, data mapping, version control and release planningDevelop and mange reports / dashboards using MicroStrategy, SSRS, Tableau, AlteryxEnforce established documentation guidelines and best practicesAll other duties assignedYOU ARE:Someone who has knowledge of Microsoft development technologies such as .NET/VB.NET/C# and SQL Server/MSMSQL/MS AccessSomeone who has knowledge of data modeling and implemenation of ETL processesSomeone who has experience using reporting tools such as Tablaeu and MicroStrategyExcellent communication skills (written and verbal) and ability to communicate across all levels (user, management, vendor - business&technical;)Ability to investigate and analyze information and to draw conclusionsExcellent customer service skillsSDLC knowledge and other software development methodologiesREQUIRED MINIMUM EXPERIENCEBachelor's Degree in Information Systems (or equivalent) requiredRequires 3 years of relevant Information Technology experienceThorough understanding of relational databases and SQLGood business understanding and ability to convert complex business needs into efficient and accurate queriesPREFERRED EXPERIENCEPrior experience with supporting retail, wholesale, accounting or ecommerce systems for a fashion companyAgile software methodology experience, especially scrum master role understanding and expertiseKnowledge of the Atlassian toolset, especially JIRA"}