{"jobID": "2395427718", "jobLocation": "Azusa_CA", "jobTitle": "Senior Business Intelligence Analyst - IMT Business Intelligence", "companyRating": "3.9", "companyInfo": {"Website": "www.apu.edu", "Headquarters": "Azusa, CA", "Size": "1001 to 5000 employees", "Founded": " 1899", "Type": " College / University", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": " APU is seeking employees who desire to engage in our thriving culture by cultivating community through professional interactions, demonstrating a posture of lifelong learning, and modeling Christ-like character. Working together, employees at APU commit to establishing a university atmosphere that is pleasing to God and edifying to one another.  The Senior Business Intelligence Analyst (SBIA) is a core team member of the Business Intelligence team. This position will focus on developing reports and dashboards, providing technical support for the Enterprise Data Warehouse, and will contribute to the design of Dimensional Data Models and ETL (Extract Transform Load) in support of the Business Intelligence program. The SBIA is a highly interactive role requiring a combination of technical skill, communication, and innovation in order to successfully deliver Business Intelligence solutions to the University  The SBIA is responsible for maintaining an awareness of the organizations needs for Business Intelligence and works closely with the functional areas to gather requirements and translate the requirements into effective and actionable BI solutions. These solutions may include new or modified reports, dashboards, or the creation of additional data models within the Enterprise Data Warehouse as well as maintenance and creation of ETL jobs.  The SBIA role will require highly developed problem solving skills, programing knowledge and the ability to quickly adapt to changing requirements. The individual in the position needs to be comfortable dealing with ambiguity, complexity, and technical problems. Required EducationBachelor’s degree or equivalent experience is required. Preferred majors include Business Administration, Business Systems, Computer Information Systems, Management Information Systems or similar.Required Experience3 - 5 years of relevant experience with BI tools, report development and dashboard design and development, preferably in a higher education setting.Understanding and working experience with the star schema data model design methodology.Ability to analyze requirements and transform them from a business question/requirement form to actionable solutions.Ability to develop working specifications from vague and often changing requirements.Experience working with enterprise reporting tools.Advanced SQL experience in an Oracle Server environment preferred.Familiar with programming languages Java, Python, VBscript etc.Knowledge of IT systems in general and experience troubleshooting basic client and network issues.Ability to interpret a complex variety of technical instructions and deal with several abstract and concrete variables.Strong verbal and written communication skills, with an ability to clearly articulate and explain business processes and concepts.Ability to define problems, collect data, establish facts, and draw valid conclusions.Self-starter, ability to work independently, and ability to work with a diverse set of stakeholders.Demonstrated time management and priority setting skills.Primary Duties/Essential FunctionsParticipate in the design of star schemas and dimensional data models to build up available data within the Enterprise Data Warehouse.Conduct data profiling and mapping exercises to support the design and development of efficient ETL.Design & develop reports and dashboards that meet customer and institutional requirements.Document and maintain report and term definitions.Develop and maintain training materials, how-to guides, and other related information to help inform and educate the University on what BI can provide and how to take advantage of the capability.Serve as an internal consultant to functional users in matters related to system capabilities, proficiency training, and extraction and manipulation of decision-making information.Perform data analysis, business process capture, and database design activities in collaboration with Data Analysts, functional users and other IMT resources.Develop and recommend policies and procedures designed to increase end user accuracy, efficiency, and effectiveness of systems to functional users and managers.Keep immediate supervisor and designated others fully and accurately informed concerning work progress, including present and potential work problems and suggestions for new or improved ways for dealing with such problems.Work closely with analysts and other IMT staff in diagnosing systems-related problems and in documenting support for business intelligence applications.Respond to customer requests for ad-hoc reporting, including developing custom reports and queries as needed and assisting Data Analysts with their reporting efforts.Adhere to IMT methodologies for documentation, change management, work management and project management.Appropriately tailor communication content to peer, supervisory, and customer audiences.Perform other duties as assigned by supervisor.Regular, punctual attendance as required by the supervisor based on department needs.SkillsExperience with Business Intelligence and Enterprise Data Warehouse tools, Oracle Data Integrator a plus.Experience with creating and maintaining best ETL implementations from business requirementsBasic understanding Relational Database Management System (RDBMS).Proficient with the use of MS Office products: Word, Excel, Visio and PPT.Proficient with report and dashboard development tools such as SQL Developer, Tableau, PSQuery, XML Publisher, or other similar tools.Basic Understanding of Java, Python, Groovy or similar coding languagesAbility to understand technical documentation and systems architecture.Familiar with ITIL, incident, change and project management processes.Proficient in the development of documentation for systems and functional processes.Ability to learn quickly and develop expertise with applications, tools and systems in use at APU.Excellent written and verbal communication skills.Excellent analysis and problem solving skills.Ability to work quickly and efficiently.Ability to work successfully in a team environment and possess the flexibility and adaptability to changing requirements is required.Ability to maintain harmonious work relationships with staff, students, faculty and University officials and the general public.Mental DemandsIn agreement with the purpose and goals of Azusa Pacific University in providing a Christian-based higher education for its students.Physical DemandsIntermittent sitting, standing and walking.Ability to sit for extended periods of time.Hearing and speaking in person and on the telephone.Ability to lift, pull, grasp, reach, and stoop.Repetitive wrist/finger motions with use of a computer.Computer usage for extended periods of time.Ability to conduct business at other offices on campus.Ability to lift up to 20lbs occasionally.Visual DemandsReading, writing notes, and computer monitor.EnvironmentPleasant office, comfortable temperature.Technologies The following technologies are typical of the context within which the SBIA will work, though this is not intended to be an exhaustive list. As such, the SBIA must have experience with, or be able to adapt quickly to these types of technologies. BI Analytics tools such as Oracle Business Intelligence and TableauETL Tools such as Oracle Data IntegratorOracle/PeopleSoft for Higher Education (Campus Solutions, HCM, Finance)PeopleTools 8.4 and higher.Oracle DatabaseLinuxIntegration technologies, XML and Web ServicesReporting tools such as SQL, PS Query, etc.Productivity tools such as Microsoft Office and/or Google DocsEmail tools such as Microsoft Outlook and/or GMail Compensation  Grade 16: $40.96 - $53.25/hour  Azusa Pacific University is a Christ-centered, multicultural community that values and seeks faculty and staff who are committed to diversity, work effectively with diverse populations, and engage others in ways that honor our rich cultural mosaic and biblical foundation.  Click below to discover some of the many benefits APU employees enjoy including competitive health care options, an 8% retirement match, and a generous tuition discount.  http://www.apu.edu/humanresources/benefits/  You can learn more about APU by watching the stories of faculty, staff, and alumni as they carry out our mission here: http://www.apu.edu/stories/  Azusa Pacific University will conduct a background check on all final candidates.  Review of applications will begin immediately, and the position will remain open until filled unless otherwise stated. Azusa Pacific University does not discriminate on the basis of race, color, national origin, sex, age, disability, or status as a veteran in any of its policies, practices, or procedures. Women and minorities are encouraged to apply.Required Skills Required Experience Job Location  Azusa, US-CA "}