{"jobID": "2731263109", "jobLocation": "Orange_CA", "jobTitle": "Data Engineer, Azure", "companyRating": "3.8", "companyInfo": {"Website": "www.alignmenthealthcare.com", "Headquarters": "Orange, CA", "Size": "501 to 1000 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "124000", "jobDescription": " Title: Data Engineer  Location: Orange,CA or Portland, OR  Alignment Healthcare is a data and technology driven healthcare company focused partnering with health systems, health plans and provider groups to provide care delivery that is preventive, convenient, coordinated, and that results in improved clinical outcomes for seniors.  We are experiencing rapid growth (backed by top private equity firms), our Data Services and BI team is looking for the best and brightest leaders. Data drives the way we make decisions. We love our customers and understanding them better makes it possible to provide the best clinical outcome and care experience.  This position will play a key role in building and operating a cloud-based data platform and its pipelines using big data technologies.  As a Data Engineer, you will develop a new data engineering platform that leverage a new cloud architecture, and will extend or migrate our existing data pipelines to this architecture as needed. You will also be assisting with integrating the SQL data warehouse platform as our primary processing platform to create the curated enterprise data model for the company to leverage. You will be part of a team building the next generation data platform and to drive the adoption of new technologies and new practices in existing implementations. You will be responsible for designing and implementing the complex ETL pipelines in cloud data platform and other solutions to support the rapidly growing and dynamic business demand for data, and use it to deliver the data as service which will have an immediate influence on day-to-day decision making. Interfacing with business customers, gathering requirements and developing new datasets in data platformBuilding and migrating the complex ETL pipelines from on premise system to cloud and Hadoop/Spark to make the system grow elasticallyIdentifying the data quality issues to address them immediately to provide great user experienceExtracting and combining data from various heterogeneous data sourcesDesigning, implementing and supporting a platform that can provide ad-hoc access to large datasetsModelling data and metadata to support machine learning and AI Basic Qualifications: Bachelors or Masters in Computer Science, Engineering, Mathematics, Statistics, or related field2+ years relevant experience in cloud based big data engineering.Demonstrated ability in data modeling, ETL development, and data warehousing.Data Warehousing Experience with SQL Server, Oracle, Redshift, Teradata, etc.Experience with Big Data Technologies (NoSQL databases, Hadoop, Hive, Hbase, Pig, Spark, Elasticsearch etc.)Experience in using Python, Java and/or other data engineering languagesKnowledge and experience of SQL and SSIS.Excellent communication, analytical and collaborative problem-solving skills Preferred Qualifications:  Healthcare domain and data experienceIndustry experience as a Data Engineer or related specialty (e.g., Software Engineer, Business Intelligence Engineer, Data Scientist) with a track record of manipulating, processing, and extracting value from large datasets.Experience building/operating highly available, distributed systems of data extraction, ingestion, and processing of large data setsExperience building data products incrementally and integrating and managing datasets from multiple sourcesExperience leading large-scale data warehousing and analytics projects, including using Azure or AWS technologies – SQL Server, Redshift, S3, EC2, Data-pipeline, Data Lake, Data Factory and other big data technologiesExperience providing technical leadership and mentor other engineers for the best practices on the data engineering spaceLinux/UNIX including to process large data sets.Experience with Azure, AWS or GCP is a plusMicrosoft Azure Certification is a plusDemonstrable track record dealing well with ambiguity, prioritizing needs, and delivering results in an agile, dynamic startup environment Alignment Healthcare, LLC is proud to practice Equal Employment Opportunity and Affirmative Action. We are looking for diversity in qualified candidates for employment: Minority/Female/Disable/Protected Veteran.  If you require any reasonable accommodation under the Americans with Disabilities Act (ADA) in completing the online application, interviewing, completing any pre-employment testing or otherwise participating in the employee selection process, please contact careers@ahcusa.com.Apply Now"}