{"jobID": "2651232957", "jobLocation": "Washington_DC", "jobTitle": "Assistant Manager", "companyRating": "2.8", "companyInfo": {"Website": "www.tileshop.com", "Headquarters": "Plymouth, MN", "Size": "1001 to 5000 employees", "Founded": " 1985", "Type": " Company - Public (TTS) ", "Industry": " Retail", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "29000", "jobDescription": "Are you ready to take control of your career, earn great money, and lead a team to success? If so, then The Tile Shop is looking for you. The Tile Shop is currently seeking an Assistant Manager with a sales driven spirit. We want outstanding, knowledgeable, skilled, and motivated sales leaders whose top priority is to provide the highest level of customer service. As an Assistant Manager, you will lead by example to build, develop, and inspire your team towards successfully achieving sales goals and creating the ultimate customer experience. ResponsibilitiesBuild and develop a well-rounded team of Sales Associates.Train and coach employees on policies, procedures and job duties.Proactively greet customers and develop lasting relationships.Sell tile and related products to exceed customer expectations.Learn and use knowledge of all store and warehouse operations.Lead by example to achieve sales goalsLearn the installation process and products to educate customers.Track established store sales goals.Provide customers with updates on product delivery status.Maintain professional standards to protect The Tile Shop brand.Develop schedules for Associates and Warehouse Personnel.Maintain inventory accuracy.Use good business practices at all times.Other duties as assigned.Qualifications2+ years of experience in retail managementPrevious sales experienceProven ability to build, develop, and motivate a sales team.Strong work ethic with a drive to exceed expectationsWork well with others in a fast paced, commission sales environmentOpen to learning and growing independently and from feedbackLead with a positive attitude and contagious enthusiasmDetail oriented and highly organizedSense of Design: put together various styles, colors, and texturesBachelor’s Degree or higher, preferredBasic mathematical and computer skillsAbility to read, write, and speak in EnglishPrevious experience in a related field preferredBenefits: At The Tile Shop, we are committed to developing the WHOLE you, not just the WORK you. Our benefits program is our investment in you as an important contributor to our success, and we are proud of our highly competitive package. Competitive Pay with Unlimited Earning PotentialIndividual Career Growth Opportunities & Excellent TrainingCompetitive & Comprehensive Benefit PackageHSA Employer Contributions401(k) Plan with employer matchingTeam Focused Work Environment"}