{"jobID": "2798710117", "jobLocation": "San_Francisco_CA", "jobTitle": "Prep Warehouse Associate (Overnight)", "companyRating": null, "companyInfo": {"Website": "www.imperfectproduce.com", "Headquarters": "San Francisco, CA", "Size": "Unknown", "Founded": " 2015", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Hungry Harvest"}, "estimatedSalary": null, "jobDescription": "About ImperfectImperfect is a produce delivery startup on a mission to reduce food waste and to make fresh produce more affordable, accessible, and convenient. We source produce directly from farms, which would otherwise go to waste, and deliver it to customers' doors for 30-50% less than grocery store prices. Since our start in 2015, our customers have saved millions of pounds of produce from going to waste.Imperfect is more than just a produce box! In everything we do, we bring an appetite, lead with heart, embrace imperfection, and work to grow the movement. By working at Imperfect, youre helping build a more sustainable and effective food system. Youre helping fight food waste. Youre ensuring farmers are rewarded for their full harvest. Youre improving access to healthy food in food deserts. With each curvy cucumber and misshapen potato, youre helping shape our world for the better.We're headquartered in San Francisco with operations in each of our cities: the San Francisco Bay Area, Los Angeles, Portland, Seattle, Chicago, and Indianapolis. Imperfect plans to bring ugly produce to Sacramento, San Diego, Milwaukee, and Minneapolis in 2018.We're looking for folks who are positive, motivated, and ready to change the world. If that sounds like you, drop us a line!The Prep Associate position is responsible for prepping our produce to be ready for the pack associate to build the boxes. Prep Associates must be able to use and read a scale, and basic math skills are required. They must understand basic produce quality requirements specific to Imperfect Produce. This position requires the ability to reliably show up to an a-typical work schedule. Prep Associates must be able to stand, bend and lift for an extended period of time, and they must be able to work independently and also as part of a team. Other responsibilities include cleaning and sanitizing the warehouse & prep areas, and they may also fulfill other duties as assigned.Requirements, skills, and qualifications Basic produce knowledgeProduce handling experienceAbility to stay focused and work efficiently both independently and as part of a teamFamiliarity with warehouse environmentAbility to lift 40 lbs and work standing for 8+ hoursExcellent attention to detailComfortable working in a cold environment (38 degrees)Previous processing experience preferredPacking or assembly line experience preferredCreative problem-solving skills Details of position Position is based out of our warehouse in San Francisco's Bayview neighborhood$16.50/hour for 4 days of work per weekUpon promotion: Health Insurance (including Dental and Vision)Upon promotion: PTO accrualUpon promotion: 1 Box of free produce delivered to your home every week Physical Requirements Frequent standingAble to work at cold temperatures in a refrigerated environmentAbility to walk, bend, squat, climb, reach, and kneelAbility to lift/push/pull up to 75 poundsIndividuals seeking employment at Imperfect Produce are considered without regard to race, color, religion, national origin, age, gender, marital status, ancestry, physical or mental disability, veteran status, or sexual orientation."}