{"jobID": "2816090663", "jobLocation": "Washington_DC", "jobTitle": "Data Analyst", "companyRating": "4.5", "companyInfo": {"Website": "www.hwcinc.com", "Headquarters": "Washington, DC", "Size": "Unknown", "Founded": " 2005", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": "HWC is looking for a data analyst who wants to apply their existing knowledge, while continuing to develop more complex skills and methods for solving problems. Successful applicants walk the line between business and technology, are avid learners, and excel in ambiguous and changing environments. This position is part of HWC’s Data & Design Capability. What You Will be Doing: Through client conversations, the elicitation of requirements, and your knowledge of analytics, you will ideate with fellow team members and help develop solutions for clients. Part of these solutions will include data analysis and the creation of analytical products such as reports, dashboards, and infographics. Other projects will require you to conduct data manipulation to clean up, enrich, and transpose data; because you like best practices, you’ll being doing this with reproducible techniques so future efforts are automated. When you aren’t talking data, you may occasionally have to jump in and write documentation, help create briefing decks or other presentations, and provide general consulting services Most relevant skills to this position are:Data Analysis (using Excel, R, Python, or any technology really)Design and Data Visualization (could be Adobe Creative Suite, Tableau, PowerBI, ggplots in R or some other random thing)Ability to learn and apply new skillsPreferred skills:Familiarity with the federal work environmentCertifications or degrees in related skills, tools, programming languages, etc2 years of experience in a similar roleRequired Qualifications:2-3 years of relevant fulltime experienceA portfolio or ability to demonstrate capabilitiesUS CitizenshipAbility to obtain SECRET ClearanceBA/BSAbout HWCAt HWC, we believe good government can change the world. Every single day, we tackle pressing issues in homeland security & defense, emergency management, and public health to keep our country prepared and safe. With expertise in Preparedness, Organizational Development, Data & Design, and Science & Engineering, we design flexible, innovative solutions that help our clients thrive in complex environments. Recognized by the Washingtonian in 2017 as a Great Place to Work, we are proud of our culture, which places our employees at the heart of the company. We are passionate about being a place where people can be involved in interesting, meaningful work; grow personally and professionally; and enjoy being a part of an active, caring team. We are a welcoming community that is stronger because of the diverse backgrounds, ideas, and talents of our employees. Visit https://www.hwcinc.com/life-at-hwc/ to learn more about what it’s like to be part of our team.Equal Opportunity Employer-Vet/Disability"}