{"jobID": "2750973395", "jobLocation": "Austin_TX", "jobTitle": "Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.appliedsystems.com", "Headquarters": "University Park, IL", "Size": "1001 to 5000 employees", "Founded": " 1983", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Vertafore"}, "estimatedSalary": "45000", "jobDescription": " Job DescriptionMake a Difference Every Day with Team AppliedThe people of Applied are making a difference every day through innovation and a commitment to help safeguard and protect what matters most. With first-to-market software, mobile and data analytics solutions, Applied is revolutionizing companies to strengthen their position as trusted advisors to clients across the world. Our core values challenge employees to make a difference every day with excellence for customers and support for the communities around us. We believe that success comes from a dynamic working environment that offers professionals an opportunity to grow and succeed alongside extraordinary people.  Learn how you can make a difference on Team Applied. Job Summary Applied Systems, Inc., a worldwide leader in insurance technology, is currently searching for a Data Analyst to join our IVANS Insurance Solutions Division. In this role, you will be part of a small, fast-paced team comprised of individuals from world class technology and insurance industry firms tasked with the creation of highly innovative products to lead the industry in the digital world. Working closely with our Data Architect and Data Scientist, you will be responsible for utilizing Power BI to curate and analyze data. You will review data sets for trends, with the goal of finding creative ways to solve our clients’ problems.  Additional responsibilities include: Manipulating data and creating reportsUse analytical expertise to spot key business insights, trends, and opportunities in our vast databaseHelp interpret and communicate your findings in a way that is easily understood by those less familiar with dataEstablish and maintain relationships with distributed cross-functional teams to leverage domain and industry expertiseRequirements:Bachelor’s degree in a quantitative field such as Statistics, Computer Science, Economics, or Mathematics; or equivalent work experience5+ years of relevant, successful data analysis experienceExperience in Power BI, Tableau, or similar BI reporting toolsSQL experience required, with SQL Server exposure preferred; experience with R a plusSelf-driven passion for finding and collaboratively solving problemsCorporate Profile Applied Systems is a leading provider of software that powers the business of insurance. Recognized as a pioneer in agency management systems, insurance organizations rely on the company’s software to manage their clients and policies in a consistent manner to minimize risk, reduce operating expenses, and drive sustainable growth and profitability. Leading the industry in technology innovation, Applied Systems has been at the forefront of data exchange between agencies, brokers, carriers and their clients. Today, the company has more than 1,500 employees with customers throughout the United States, Canada, the United Kingdom, and Ireland. By automating the insurance lifecycle, Applied Systems remains committed to help safeguard what matters most to millions of people around the world. To learn more, please visit www.AppliedSystems.com.  Employees feel appreciated at Applied Systems. In addition to a competitive benefits package that starts on the first day of employment, we offer paid time off, a flexible ”Dress for your Day” casual dress code, and an open communication policy. The resulting atmosphere is professional and conducive to productivity, yet comfortable and fun. Applied Systems welcomes and encourages applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process. #CB"}