{"jobID": "2794381241", "jobLocation": "Hopewell_NJ", "jobTitle": "Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.bms.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1858", "Type": " Company - Public (BMY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "93000", "jobDescription": " This position is in the Molecular and Analytical Development (MAD) group of the Biologics Development organization. As a member of the Mass Spectrometry Center of Excellence within MAD, this individual will be responsible for the design, development and hands-on execution of analytical studies to support structural characterization, comparability, process development, and other developments activities of biotherapeutics drug candidates at all stages of clinical development as well as commercial. The position will focus primarily on the use of mass spectroscopic (MS) techniques and associated analytical methods used in support of MS and LC-MS. The candidate should have a demonstrated ability to apply current MS technologies to the detailed characterization of proteins and protein related impurities. Familiarity with related analytical techniques associated with protein characterization, including HPLC, capillary IEF, CE-SDS, FTIR, and microscopy that may be applied for comprehensive understanding of protein degradation mechanisms is desirable. This individual will be required to present scientific data, write technical reports and represent the department in matrix team meetings when needed.  Qualifications  PhD with a minimum of 0-4 years, or MS or equivalent with a minimum of 5 years, or BS or equivalent with a minimum 8 years, of relevant experience in biopharmaceutical/biotechnology.  Knowledge of biologics  Hands-on experience in application of MS and LC-MS and MS/MS techniques to the detailed characterization of biotherapeutic proteins.  Knowledge in protein separation and enrichment sciences, protein aggregation, and protein structure and folding  Excellent communication and interpersonal skills, both written and verbal are required.  Works independently and collaborates with other groups in ADT and deliver results in line with project and team objectives  Designs, follows and reviews protocols, scientific methods, and departmental procedures; Organizes and interprets scientific data  Trains others on procedures, operations and new technology, or methods  Proactive at keeping current with and leveraging literature and latest technologies."}