{"jobID": "2761796020", "jobLocation": "Chicago_IL", "jobTitle": "Analytics Consultant - Data Science", "companyRating": "3.2", "companyInfo": {"Website": "www.cna.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1897", "Type": " Company - Public (CNA) ", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Chubb, Zurich Insurance Group, The Hartford"}, "estimatedSalary": "90000", "jobDescription": "Job SummaryThe successful candidate will use statistics and machine learning to build and refine state-of-the-art predictive models for the pricing, underwriting, administration, and marketing of an exciting mix of commercial insurance products, ranging from Surety to Professional Liability to more traditional lines like Workers Compensation. These models support key personnel such as underwriters and claims adjusters in tactical decision-making and also are used by senior management in formulating strategy. Essential Duties & Responsibilities1. Builds and validates predictive models in collaboration with business partners in functional areas such as Underwriting, Pricing, Distribution, Claims, Risk Control, and IT. 2. Designs, writes, and tests computer programs to extract and analyze data, to build models, and to support implementation.3. Interprets the results of models in business terms and communicates the contents of the models to business decision-makers. 4. Participates in crafting products and innovative solutions that will provide revolutionary change.5. Participates in special projects requiring quantitative expertise.Reporting RelationshipAVP or aboveSkills, Knowledge & AbilitiesRequired:Demonstrated technical excellence in statistics and data scienceProficiency with SQL and with standard statistical software (e.g., R)Proficiency with classical statistical models such as logistic regression and other GLMs.Strong analytical and problem solving skills Attention to detail and accuracy of workStrong interpersonal and communication skillsStrong writing skills, including writing coherent documentation and reportsAbility to work collaboratively in a team environmentStrong time management skills and a sense of urgencyDrive to continuously improveDrive to focus on meaningful deliverables that impact the bottom lineAbility to work effectively with colleagues with diverse perspectives and backgroundsPreferred:Practical experience with distributed computing (e.g., Spark)Practical experience with PythonExperience utilizing machine learning techniques (e.g., random forests) and deep learningKnowledge of the core functions of an insurance companyProduct specific commercial and/or specialty insurance knowledgeKnowledge of Microsoft Office Suite and other business related softwareEducation & Experience1. Bachelor's Degree in a relevant discipline.2. Typically a minimum of four years of related work experience or PhD in relevant discipline. *LI-PB1"}