{"jobID": "2830583589", "jobLocation": "Arlington_VA", "jobTitle": "Retail Store Lead", "companyRating": null, "companyInfo": {"Website": "www.b8ta.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "ABOUT US b8ta is a new company created to fix an old problembrick-and-mortar retail. Our mission is to make retail accessible for all. We believe when makers have easy, direct access to physical retail, customers will in turn have unbiased access to what the world is creating.  As a technology company building a better retail store for the worlds most innovative products, our team is full of extraordinary thinkers, creators, builders, early adopters, and rule-breakers. We're based in San Francisco with multiple flagship stores and shop-in-shop locations across the countryand were just getting started. Think you can help change retail? We'd love to meet you! ABOUT YOU Were seeking a store lead to launch our small-format concept in Tysons, VA. You are passionate about technology and emerging consumer hardware trends and would consider yourself an early adopter. You have an entrepreneurial spirit and have created world-class retail experiences. POSITION OVERVIEW Were focused on user experienceboth for our visitors and our product makers. Thus we are looking for a store lead who has an unrelenting desire to make sure every visitor has a seamless and satisfying experience with products, our displays, and staff. RESPONSIBILITIESDeliver a world-class customer experience designed to build customer loyaltyMotivate and coach team members and managers to achieve store goalsMaintain positive relationships with third-party vendors and maker partnersMaintain excellence in day-to-day operationsEstablish and maintain strong relationships with leaders and corporate partnersEnsure the highest level of customer serviceManage store P&L; within budget and maximize profitabilityEnsure store policies and procedures are in place and being followedOther duties as assignedEXPERIENCE2+ years experience leading teams in a retail environmentPrevious experience delivering measurable sales and retention resultsPrevious experience in product merchandising and events marketing a plusPrevious experience in a retail technology, hardware, or IoT environment a plusAbility to effectively communicate with customers and team membersAbility to work independently in a remote marketREQUIREMENTSAbility to effectively communicate with customers and team membersAbility to maneuver around the sales floor and stockroomAbility to stand for long periods of timeAbility to work a flexible schedule to meet the needs of the business"}