{"jobID": "2827033530", "jobLocation": "Parsippany_NJ", "jobTitle": "Environmental Engineers, Scientists, or Geologists - Entry Level", "companyRating": "4.2", "companyInfo": {"Website": "www.langan.com", "Headquarters": "Parsippany, NJ", "Size": "501 to 1000 employees", "Founded": " 1970", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "55000", "jobDescription": "Work for an Industry Leader Challenging Projects & Dynamic Work Environment  Extensive Training Program  Community Service Opportunities  Langan is an award-winning ENR Top 500 Design Firm that offers integrated engineering and environmental services for both public and private sector clients at sites located throughout the United States and abroad. Langan receives numerous recognitions for its technical expertise as well as its work environment, including Zweig Group’s Best Firms to Work For, Glassdoor’s Employees’ Choice Award – Best Places to Work, NJ Biz Best Places to Work and Business of the Year – 50 Fastest Growing Companies, Hartford Business Journal’s Best Places to Work in CT, and Pittsburgh Business Times - Best Places to Work in Western PA. Visit our website for more information about our awards and recognitions.  Langan offers its employees opportunities that provide challenge and responsibility within an environment where they can grow and flourish!  Join our team of industry leaders and make a difference on some of the most exciting and interesting projects in the field!Langan has openings for entry-level Engineers, Scientists, or Geologists in our Parsippany, NJ office. As the successful candidate, you will have an enthusiastic, can-do attitude with strong interest in performing: contaminated site investigation and remediation work; soil and groundwater sampling; vapor intrusion investigation; remedial investigation, design, implementation and monitoring; pilot tests; data management, processing and evaluation; and report preparation. A strong technical education, professional demeanor, and desire to learn are essential. Job Requirements:Bachelor’s degree in Environmental Engineering, Geology, or Geoscience (Master’s a plus); minimum 3.0 GPA required;40-Hour OSHA HAZWOPER Certification a plus;FE/EIT certification for engineers is a plus;Strong attention to detail with excellent analytical, judgment and problem-solving capabilities;Ability to work alone and in a team environment;Excellent written and verbal communication and organization skills;Working knowledge of MS Word, MS Excel, and AutoCAD design software, GIS a plus;Ability to spend at least 50% of working hours in the field;Possess a valid driver’s license and reliable transportation for remote job site locations; and,Position requires work Monday through Friday with occasional evenings and weekends. Langan offers its employees opportunities that provide challenge and responsibility within an environment where they can grow and flourish!  We offer competitive compensation packages; full-time employment company paid medical, dental, and vision coverage; life insurance, short- and long-term disability insurance; 401(k)/Roth with company match; extensive training; buddy and mentoring programs; employee referral and professional license bonuses; educational reimbursement; and much more! Equal Opportunity Employer"}