{"jobID": "2828562878", "jobLocation": "Chicago_IL", "jobTitle": "Analytics Manager", "companyRating": "3.2", "companyInfo": {"Website": "www.enova.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 2004", "Type": " Company - Public", "Industry": " Finance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "108000", "jobDescription": "Portfolio Analytics Overview: As an Analytics Manager you will be one of Enovas most valuable resources. You will use creativity and innovative techniques to enhance and improve current statistical processes and methods. You will embody a standard to coordinate, manage and review statistical modeling solutions and analysis to determine validity, impact potential and business fit. You will be expected to communicate to senior management through discussion, presentations, and write-ups of results, recommendations and insights gained through data analysis to be used to develop strategic and operational plans.  It is imperative to have the ability to adjust on the fly as new information surfaces and priorities shift. You will demonstrate the ability to maintain a thorough understanding of Enovas products and businesses from a strategic standpoint, in addition to deep knowledge of underwriting/business analytics principles and strategies. You will facilitate close collaboration between team members and Technology & Operations groups on cross-functional projects to improve our verification processes. Most importantly you will manage a small team of statistical analysts/modelers. Qualifications:A Bachelor's, Masters, PhD or equivalent experience, requiredAt least 6 years of experience in an Analytics or related fieldAdvanced programming skills and the ability to write customized programs for meaningful data analysisAt least 2 years of experience directly managing 3 or more employeesProficiency in spreadsheet applications and advanced use of statistical applicationsAdvanced knowledge of statistical/econometric modelingMust have strong business acumen and previous experience with process improvement as it relates to model building, automation, or other statistical methods.Experience in project managementWillingness to take a very hands-on approach to model buildingOur Analytics team: Enova's Analytics team consists of over 60 quantitative professionals dedicated to using the latest cutting-edge techniques to drive business value. We are a shared service for the entire company and operate in four core Analytics workgroups:  Portfolio Analytics the portfolio team focuses on building cutting edge risk, pricing, and underwriting models to optimize our lending decisions by using advanced modeling and simulation techniques to optimize the performance of our loan products and operations. Fraud Analytics analysts on the fraud team use advanced data mining techniques to identify and fight online fraud. Marketing Analytics the marketing analytics team is focused on applying statistical analysis and predictive modeling to help our marketing teams acquire and retain more valuable customers. Research and Platforms- the RAP team builds and maintains all of our technical tools and platforms. They help investigate new analytics methodologies, use cases, and data sources, to institute new and best practices within the department. At Enova we have a company-wide culture that emphasizes data-driven analysis. That means you spend less time presenting and more time with the fun part, crunching data! We are language agnostic, but primarily use Python, R, SAS, SQL and Mathematica. That means YOU get to pick the tool that works best for you and the analysis at hand. Enova Overview: Enova is a leading provider of online financial services that leverages its advanced technology and analytics to provide access to credit for non-prime consumers and small businesses. Our roots are in Chicago, but we have served nearly 5 million customers through our six businesses in the U.S. and abroad. We pride ourselves on hiring smart and driven people who bring new and innovative ideas to the table. Our philosophy is, \"Lifes short. Work some place awesome.\"  Many of us consider our people to be Enovas best perk. But to sweeten the deal, we also have a pretty awesome list of conventional (and less conventional) perks and benefits including competitive salaries, health care benefits, a 401K matching plan, a revamped parental leave program (and brand new nursing rooms for our returning mothers!) summer hours, tuition reimbursement and a sabbatical program. And of course we also have the things youd expect at a leading tech company in Chicago, such as the snacks, game room, onsite massages/barbers/nail technicians, monthly social events, and sporting sponsorships.  Our goal at Enova is to recruit, hire, develop and maintain a diverse workforce. It is our policy to provide equal employment opportunity for all persons and not discriminate in employment decisions by placing the most qualified person in each job, without regard to any other classification protected by federal, state, or local law."}