{"jobID": "2837661376", "jobLocation": "Washington_DC", "jobTitle": "Post-Doctoral Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.business.gwu.edu", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 1821", "Type": " College / University", "Industry": " Education", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "48000", "jobDescription": " GW's Department of Environmental and Occupational Health (EOH) looks at how environmental and occupational exposures impact human health. It explores the underlying science and policy for issues such as sustainable cities and food systems, climate change and air pollution mitigation, workplace safety and risk management. Additional information on EOH can be found at the following link: http://publichealth.gwu.edu/departments/environmental-and-occupational-health.  EOH is searching for a full-time Post-Doctoral Scientist for the research group of Associate Professor Dr. Susan Anenberg. Dr. Anenbergs main interests are quantifying health impacts of climate change and air pollution from local to global scales, including developing scientific methods and evaluating policy scenarios for mitigation. This research is interdisciplinary and draws from a variety of fields, including atmospheric science, epidemiology, and economics.  This position will aid Dr. Anenberg in designing and implementing novel studies related to modeling the health implications of present and future climate change and air pollution. The individual will be involved in all aspects of research including directing and performing computer-based modeling work, analyzing and interpreting data, and preparing manuscripts and presentations. In conjunction with Dr. Anenberg, other department investigators, and outside collaborators, the individual will identify research opportunities and prepare proposals for new extramural funding. The individual will also receive mentoring and direct guidance from the Principal Investigator in order to advance their career in academic research, public health practice, and/or public policy. Incumbent is expected to work well as part of multi-disciplinary teams and have enthusiasm for conducting research at the nexus of environmental science and policy.  This position is for a 1 year duration beginning Summer 2018. The position may be renewed for a 2nd year depending on satisfactory performance and funding availability. Responsibilities include:Perform chemical transport model simulations and analyze model output for policy-relevant applicationsDevelop and run computer models linking emissions, atmospheric pollution levels, and health impactsPlan and conduct independent research; write and publish peer-reviewed manuscriptsPrepare and submit grant proposalsProvide support with data management and computer modeling tasks and guidance to junior staffPerforms other related duties as assigned. The omission of specific duties does not preclude the supervisor from assigning duties that are logically related to the position."}