{"jobID": "2826572252", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Science Life Science Senior Manager", "companyRating": null, "companyInfo": {"Website": "www.deloitte.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1850", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $10+ billion (USD) per year", "Competitors": " EY, PwC, McKinsey & Company"}, "estimatedSalary": null, "jobDescription": " We help clients achieve competitive advantage through data and cognitive powered transformations that promote enterprise intelligence, autonomous processes, and precision stakeholder engagement.  As part of Deloitte’s Strategy and Analytics talent group, Analytics & Cognitive is the premier data-powered and platform-enabled cognitive consultancy. Our vision is to be the Cognitive Consultancy of choice, leading clients to the future of how humans and machines work together through insights enablement, application modernization, advanced value creation, platform transformation, personalized customer engagement and workforce evolution.  Work you’ll do  As a Deloitte Consulting Life Science Senior Manager in in the Deloitte Strategy & Analytics Group, you will provide industry insight and technical and analytical support in a consulting environment. Our life science industry sectors include life sciences and health care. The job functions include the following:  • Develop and maintain contact with top decision makers at key clients  • Organize and lead pursuit teams  • Participate and lead aspects of the proposal development process  • Contribute to the development of proposal pricing strategies  • Provide overall project management and client relationship support  • Actively participate in defining project scope and objectives  • Provide technical design assistance for predictive model development  • Present and communicate project deliverables/results to clients  • Function as integrator between business operation needs and advanced analytical solutions  The team  Analytics & Cognitive  In this age of disruption, organizations need to navigate the future with confidence, embracing decision making with clear, data-driven choices that deliver enterprise value in a dynamic business environment. The Analytics & Cognitive team leverages the power of data, analytics, robotics, science and cognitive technologies to uncover hidden relationships from vast troves of data, generate insights, and inform decision-making. Together with the Strategy practice, our Strategy & Analytics portfolio helps clients transform their business by architecting organizational intelligence programs and differentiated strategies to win in their chosen markets.  Analytics & Cognitive will work with our clients to:  • Implement large-scale data ecosystems including data management, governance and the integration of structured and unstructured data to generate insights leveraging cloud-based platforms  • Leverage automation, cognitive and science-based techniques to manage data, predict scenarios and prescribe actions  • Drive operational efficiency by maintaining their data ecosystems, sourcing analytics expertise and providing As-a-Service offerings for continuous insights and improvements  Qualifications  Required:  • Minimum eight (8) years of experience with SAS, R, or Python with at least two (2) years of relevant experience in an external consulting role  • Minimum six (6) years of experience in data analytics, data modeling and data sciences  • Minimum six (6) years of experience leading multiple project teams simultaneously on relevant engagements  • Proven experience in business development and/or proposal development in support of related specialty areas  • Bachelors’ degree  • Ability to travel 50-70% of the time  Preferred:  • Master’s Degree or equivalent in statistics, actuarial science or related field of study  • Advanced analytical experience in retail operations analytics, retail workforce analytics, marketing mix modeling, customer analytics, and/or procurement, supply chain and inventory analytics in a retail environment  • Strong competency for statistical software packages (SAS, SPSS, MATLAB)  • Solid understanding of advanced analytics (statistics, simulation, optimization, etc.)  • Modeling expertise using statistical techniques such as logistic and linear regression, decision trees, neural network or clustering techniques  • Actuarial designation or actuarial background  • Strong project management and delivery experience, including budget oversight and staffing of project teams including time management  • Strong oral and written communication skills, including presentation skills (MS Visio, MS PowerPoint, MS Word, MS Excel)  • Ability to maintain a flexible work schedule including overtime  • Previous experience mentoring, training and developing junior members of the team; experience in employee performance reviews"}