{"jobID": "2816115539", "jobLocation": "Chicago_IL", "jobTitle": "Data Analytics, Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.transunion.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1968", "Type": " Company - Public (TRU) ", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "90000", "jobDescription": "“TransUnion is committed to finding innovative ways information can be used to help businesses and consumers make smarter decisions.” -Chris Cartwright, President US Info Services, CEO What we’ll bring: •A welcoming and energetic environment that encourages collaboration and innovation. We consistently explore new technologies and tools to be agile  •Flexible time off, workplace flexibility, an environment that welcomes continued professional growth through support of tuition reimbursement, conferences and seminars  •Our culture encourages our people to hone current skills and build new capabilities, while discovering their genius  •Deep technical expertise and an established reputation as an analytic solutions provider in the Financial Services industry  •Modern computing environment based on best-in-class “big data” technologies and the freedom to explore new data sources and statistical and machine learning methodologies What you’ll bring: •A Master’s or Ph.D. in Statistics, Applied Mathematics, Operations Research, Economics or an equivalent discipline. Equivalent analytical experience will be considered in lieu of an  advanced degree  •Advanced proficiency with one or more statistical programming languages such as R or SAS; additional experience writing intermediate SQL queries for data extraction preferred  •Experience with big data platforms (e.g. IBM Netezza, Apache Hadoop, Apache Spark) preferred  •Strong time management skills with the ability to prioritize and contribute to multiple assignments simultaneously  •Advanced experience with the MS Office suite, particularly Word, Excel and PowerPoint  •A high degree of technical aptitude We’d love to see: •Excellent verbal and written communication skills. You must be able to clearly articulate ideas to both technical and non-technical audiences  •Highly analytical mindset with the curiosity to dig deeper into data, trends and consumer behavior  •Capability to eloquently describe analytic ideas, requirements, processes and findings in non-technical terms.  •A strong interest in the areas of banking, consumer lending and finance is paramount  •Curiosity as to why consumers act the way they do with their credit.  •Strong work ethic with the passion for team success Impact you’ll make: •Contribute to projects involving descriptive, predictive, and prescriptive analysis leveraging a variety of techniques (such as segmentation, logistic regression, survival analysis,  principal component analysis, Monte Carlo simulation, scenario and sensitivity analysis, and machine learning)  •Dig in by extracting data and performing segmentation and statistical analyses on large population datasets (using languages such as R, SAS, SQL, and Python on Linux and PC computing  platforms)  •Deliver analytic insights and recommendations in succinct and compelling presentations for internal and external customers at various levels including an executive audience  •Help to cultivate an environment that promotes excellence, innovation, and a collegial spirit  We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law."}