{"jobID": "2837846500", "jobLocation": "Palo_Alto_CA", "jobTitle": "Clinical Nurse-E2 ICU Med/Surg/Neuro/Trauma ICU 0.90 Night Shift", "companyRating": "3.4", "companyInfo": {"Website": "www.stanfordhealthcarecareers.com", "Headquarters": "Stanford, CA", "Size": "5001 to 10000 employees", "Founded": " 1957", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Sutter Health, UCSF Medical Center and UCSF Benioff Children’s Hospitals, Kaiser Permanente"}, "estimatedSalary": "85", "jobDescription": "90 FTE (72 hours per pay period), 12 hour night shifts, every other weekend. 33 bed Intensive Care Unit. Major services include trauma, neurocritical care, neurosurgery, liver transplant, as well as other medical, surgical and occasionally obstetric patients. Must be able to work independently in this high-acuity, multiple service ICU Equal Opportunity Employer Stanford Health Care (SHC) strongly values diversity and is committed to equal opportunity and non-discrimination in all of its policies and practices, including the area of employment. Accordingly, SHC does not discriminate against any person on the basis of race, color, sex, sexual orientation or gender identity and/or expression, religion, age, national or ethnic origin, political beliefs, marital status, medical condition, genetic information, veteran status, or disability, or the perception of any of the above. People of all genders, members of all racial and ethnic groups, people with disabilities, and veterans are encouraged to apply. Qualified applicants with criminal convictions will be considered after an individualized assessment of the conviction and the job requirements. Minimum Qualifications Any combination of education and experience that would likely provide the required knowledge, skills and abilities as well as possession of any required licenses or certifications is qualifying.  Education: Bachelor\"s degree in Nursing  Experience: Minimum 2 years recent acute care Intensive Care Unit experience required, preferably in a level one trauma center. Med/Surg with strong neuro/neurosurgical ICU experience. Licensure/Certification: Current California license.  Current AHA Healthcare Provider ACLS and BLS required.  CCRN, CNRN, TNCC, ENLS, TCRN, SCRN and NIHSS certifications preferred "}