{"jobID": "2831071207", "jobLocation": "San_Francisco_CA", "jobTitle": "Elevator Consultant (Elevator Program Director)", "companyRating": "4.5", "companyInfo": {"Website": "www.equityapartments.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1993", "Type": " Company - Public (EQR) ", "Industry": " Real Estate", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " UDR, AvalonBay Communities"}, "estimatedSalary": "71000", "jobDescription": "Working for  Equity Residential (EQR), a leading multi-family real estate investment trust  (REIT), means being part of a community and striving to provide the best in  apartment living, speaking boldly about new ideas for innovation, and inspiring  creativity in the ways we work together. Our portfolio of high-quality  properties in urban growth markets New York City, Boston, Washington DC,  Seattle, San Francisco and Los Angeles provides homes where people most want  to live, work and play. We've got the best people in the business, and our  experience shows in our dedication to our residents and in how much we value  each other as colleagues. Thats why our employees say they are proud to work  at Equity, a company that gives our residents a place where they can Live Remarkably, and offers a culture  where our employees have the opportunity to make their mark.We are seeking an  organized, collaborative, adaptable leader to manage our extensive elevator  program 950 elevators spread across 234 properties in NY, DC, Boston,  Seattle, San Francisco, and Southern California. As the Elevator Program  Director, you will be responsible for the contract bidding and negotiation  process, invoice oversight, and ensuring ongoing quality of service provided by  elevator vendors. You will conduct elevator audits on a routine basis,  recommending upgrades and maintenance as necessary. You will utilize your  mechanical and analytical expertise to create and maintain all elevator  budgets, to collaborate with Facilities, Property Management, and  Capital/Investments teams on any elevator needs, and to act as a liaison  between property management and elevator vendors in order to resolve any  challenging or recurring elevator issues.  As our Elevator  Program Director, your days will be full, fast-paced, and challenging. Under  the direction of the First Vice President of Facilities, you will be  accountable for the ongoing performance, compliance, and improvement of our portfolio of 950  elevators. The lifeblood of our buildings, our elevators greatly impact our  residents lives, as well as our satisfaction scores, ability to renew, and  online reputation. With this in mind, you will approach each day thinking like  an owner: strategically, creatively, and collaboratively, with a constant eye on the bottom line. You  will help us to maximize our service providers, anticipate expenses, and  modernize obsolete systems proactively rather than reactively. You will travel  frequently as needs arise but lucky for you, this travel will be to some of  the nations most exciting cities. In your travel throughout the portfolio,  youll have the opportunity to interact and collaborate with our entire network  of talented, diverse, and dynamic team members, who are all pursuing the same  goal of helping our residents and each other to live remarkably. Please note: this posting is for one opening, and the location is open based on the candidate identified. Possible locations are NY, Boston, DC, LA, Seattle, or San Francisco.WHO YOU AREA Leader. You are confident in your expertise and effective  at leading and teaching others, providing clear direction to help teams through  difficult issues and stressful situations.A Strong Communicator. Your writing and speaking skills are clear and  effective, helping you connected well with others.Organized and Accountable. You have exceptional time management abilities and are  able to juggle the needs of changing priorities at your communities.Creative. You are an idea person and like coming up with  smart solutions and new challenges.Levelheaded. You keep your cool during stressful situations  and quickly find solutions.Flexible and Adaptable. You understand that the world does not exist  through black and white lenses and embrace opportunity to live in the gray.Confident and Decisive. You take initiative, trust your gut, and are not  afraid to make decisions or deliver a difficult message.Motivated. You invest extra energy to reach your goals and  help your teams reach theirs.A Solution-Oriented Team Player. You are united with teammates and follow through  on commitments.Energetic and Positive. You are an outgoing, gregarious brand ambassador  who motivates and excites others to elevate their performance.An Elevator Expert. You have a strong background in elevator  construction, service and modernization, as well as familiarity with codes and  standards and local building codes, laws, and regulations.WHAT YOULL DOPerform regular visual inspections on elevator equipment at all mid-level and  high-rise apartment buildings within the Equity portfolio.Perform equipment evaluations as needed for other projects.Manage all elevator contracts, invoices and approvals.Create all annual elevator budgets and manages bidding, proposals, and  invoicing process.Ensure appropriate elevator inspection programs are in place in each market.Conduct elevator audits as required in all Equity markets (travel  required) to verify contract compliance with the maintenance provisions of the  contract, confirming compliance with maintenance provisions, and determining  the long term viability of the equipment as required by the Original Equipment  Manufacturer's (OEM) maintenance requirements.Perform audits of elevator shutdowns in order to diagnose,  track, and prevent future issues.Routinely audit elevator service and maintenance records with  each vendor by reviewing maintenance visits and history of issues; identifies  trends and works with elevator vendor to improve reliability.Utilize data to monitor trends and to provide analysis and input on remaining  useful life of elevator equipment.Participate in capital needs assessments and upgrades.  Maintains a strong relationship with Construction Services team and Investments  team members.Own the relationship with all major elevator vendors, and acts as  liaison between property management and elevator vendor to resolve any  challenging or recurring elevator issues.Conduct ongoing analysis of resident surveys and property  service requests in order to identify and proactively address customer  perceptions.Respond to emergency repairs as needed, or dispatches service accordingly.Offer input to the development team to identify elevator  system options in order to create the most efficient transportation solution  for new buildings.REQUIREMENTSA high school  diploma or equivalent is required. Exceptional written and verbal communication  skills. Excellent organizational and problem-solving skills. Computer  proficiency required.Prior experience  as an elevator mechanic required. Must have specific experience in elevator  construction and modernization, as well as familiarity with model codes and  standards, and local building codes, laws, and regulations.Frequent travel  required.Valid drivers  license and/or reliable transportation required for frequent travel within the  assigned portfolio(s).Elevator  mechanics license is required.REWARDSWe recognize  everyone has different needs outside of work. Thats why, in addition to a  competitive benefits package (medical, dental, vision and paid time off), we  offer many unique options to employees, like adoption benefits and paid time  off for community service projects. To learn more, view our Total Wellbeing  page here. Please note: this posting is for one opening, and the location is open based on the candidate identified. Possible locations are NY, Boston, DC, LA, Seattle, or San Francisco."}