{"jobID": "2825106610", "jobLocation": "Springfield_VA", "jobTitle": "Data Scientist-Senior", "companyRating": "3.3", "companyInfo": {"Website": "www.leidos.com", "Headquarters": "Reston, VA", "Size": "10000+ employees", "Founded": " 1969", "Type": " Company - Public (LDOS) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "116000", "jobDescription": "Description:Leidos is seeking a Data Scientist-Senior candidate to support a customer program in Springfield, VA. Active TS/SCI is required.Position Summary:The Data Scientist will analyze actual and predictable interacting operational activities of give target sets and client requests to obtain a quantitative, rational basis for decision making through the application of logic and scientific or economic disciplines and techniques. Devises modeling and measuring techniques; utilizes mathematics, statistical methods, engineering methods, operational mathematics techniques (linear programming, game theory, probability theory, symbolic language, etc.), and other principles and laws of scientific and economic disciplines. Identify and evaluate standardized methods, models and algorithms to address intelligence problems of limited scale as directed. Provide documentation for methods and algorithms use in data science solutions to the client and address outstanding items. Must have demonstrated good oral and written communication skills.Qualifications:MINIMUM REQUIRED SKILLS:Bachelors degree in a field related to the support services may count for up to four years of this experience. A masters degree in a field related to the support services may count for up to two additional years of this experience. 10-20 years of relevant experience is required for this position Active TS/SCI Clearance is requiredStrong knowledge of programming languages (e.g., Python JavaScript, SQL, Pig, or R), Elasticsearch, spatial analysis tools and concepts, data mining methods, database structures, and analytic information extraction and visualization. Ability to identify, retrieve, manipulate, relate and/or exploit multiple structured and unstructured data sets from various sources, including building or generating new data sets as appropriate Ability to interpret and evaluate the results of data science communitys methods models and/or algorithms, understanding the meaning, limitations and scope of the results, and translate them into insightful output for data science and/or mission and identifying other applications for use Ability to initiate the efficient implementation of methods, tools, and algorithms using a comprehensive range of technologies Ability to lead work unit proactively addressing and responding to the most difficult data science-related challenges in a timely manner while effectively balancing competing priorities Demonstrated strong writing and briefing skills to educate managers, senior internal officers and the IC\"External Referral Eligible\" MACSSLeidos Overview:Leidos is a global science and technology solutions leader working to solve the worlds toughest challenges in the defense, intelligence, homeland security, civil, and health markets. The companys 33,000 employees support vital missions for government and commercial customers. Headquartered in Reston, Virginia, Leidos reported pro forma annual revenues of approximately $10 billion for the fiscal year ended January 1, 2016 after giving effect to the recently completed combination of Leidos with Lockheed Martin's Information Systems & Global Solutions business (IS&GS;). For more information, visit www.Leidos.com. The companys diverse employees support vital missions for government and commercial customers. Qualified women, minorities, individuals with disabilities and protected veterans are encouraged to apply. Leidos will consider qualified applicants with criminal histories for employment in accordance with relevant Laws. Leidos is an Equal Opportunity Employer."}