{"jobID": "2802525861", "jobLocation": "Skokie_IL", "jobTitle": "Synthetic Biology Scientist", "companyRating": "2.6", "companyInfo": {"Website": "www.lanzatech.co.nz", "Headquarters": "Skokie, IL", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "59000", "jobDescription": "About LanzaTech:  LanzaTech is turning our global carbon crisis into a feedstock opportunity, with the potential to displace 30% of crude oil use today and reduce global CO2 emissions by 10%. LanzaTechs carbon recycling technology is like retrofitting a brewery onto a steel mills emission source, and instead of using sugars and yeast to brew beer, bacteria ferments pollution into products! Imagine a day when you can power a plane by recycled carbon emissions and when your yoga pants or sneakers started life as pollution from a steel mill. This future is possible using LanzaTech technology, with the first 2 commercial units converting steel mill waste gases to fuels being built in China with Shougang and in Belgium with the worlds largest steel maker, ArcelorMittal. LanzaTech has an additional 3 commercial projects in the pipeline, in India, South Africa and California. LanzaTech has already produced synthetic jet fuel from recycled carbon emissions and has a partnership with Virgin Atlantic.  In March 2018, LanzaTech was recognized as the #1 Hottest company in the Advanced Bioeconomy for the third time by Biofuels Digest, the worlds most widely-read bioeconomy daily. The company was also inaugurated into the Cleantech100 Hall of Fame, having been listed in the top 100 cleantech companies over the last 7 years. In 2016, the company won the Young Global Leader Award for Circular Economy at the World Economic Forum, LanzaTech was also the top biofuels company in the 2016 CNBC Disruptor 50 Companies list. In 2015, LanzaTech was awarded the U.S. EPA Presidential Green Chemistry Award for Greener Synthetic Pathways. The companys accomplishments were recognized through a number of prestigious awards in 2014, including the Guardian Sustainable Business Innovation Award for Carbon and Energy Management, Breakthrough Innovation Award at the Platts Global Metals Awards, and the Technical Development Award from the World Petroleum Council. In 2013, the company was named a World Economic Forum Technology Pioneer. About the Role:  We are seeking a Synthetic Biology Scientist to support the automated engineering of LanzaTechs proprietary gas fermenting microbes to further improve the performance and expand the product spectrum of the LanzaTech process. The Scientist will be joining the team responsible for pathway prototyping and automated strain engineering and screening. Types of activities include design and construction of pathways, metabolic engineering, genome editing and improvement of high-throughput workflows while working within a cross-functional team . Duties & Responsibilities:Analysis and design of metabolic pathways for the production of a wide variety of molecules and using computational tools to translate metabolic pathway designs into DNA constructs;High-throughput DNA assembly and QC including programming and operation of liquid handling robots;High-throughput cultivation, transformation, screening and selection of LanzaTech proprietary microbes;High-throughput pathway prototyping and development of high throughput screens and assays;Genome editing and metabolic engineering of LanzaTech proprietary microbes;Managing and coordinating experimental schedules within a cross-disciplinary team;Fill out batch production records and maintain records and QC data in LIMS system as required;Attend seminars and participate in group and project meetings or lab activities as required;Requirements:Ph.D. degree in molecular biology, chemical engineering, biotechnology, biochemistry or related field with up to 3 years post-graduate experience, preferentially in industry;High attention to detail and careful record keeping are essential;Hands-on experience with different cloning methods, high-throughput workflows and working with liquid handling robots; Adept at utilizing automation (Hamilton, Agilent, Tecan, Beckman, and others) to assist with complicated or lengthy workflowsFamiliarity DNA design tools; Competent in using statistics to strengthen experimental design and enable robust data analysisBasic working knowledge of microbial metabolism, enzyme kinetics, statistics, analytical methods and fermentation processesIndependent and highly self-motivated;Good communication skills;Awareness of safety issues in the work environment;Preferred:Experience in biotech industry is highly preferred;Experience programming liquid handling robots and entry and scripting is preferred;Experience working and analyzing bid datasets is preferred;Experience with non-model organisms is preferred;Familiarity with applications of nextgen sequencing is preferred.This position is open to candidates authorized to work in the United States on a full-time basis for any employer. LanzaTech is an Equal Employment Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status."}