{"jobID": "2818889666", "jobLocation": "Duarte_CA", "jobTitle": "Project Development Scientist", "companyRating": null, "companyInfo": {"Website": "www.cityofhope.org", "Headquarters": "Duarte, CA", "Size": "5001 to 10000 employees", "Founded": " 1913", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " MD Anderson Cancer Center, Memorial Sloan Kettering, UCLA Health"}, "estimatedSalary": null, "jobDescription": "About City of Hope City of Hope, an innovative biomedical research, treatment and educational institution with over 5,000 employees, is dedicated to the prevention and cure of cancer and other life-threatening diseases and guided by a compassionate, patient-centered philosophy.  Founded in 1913 and headquartered in Duarte, California, City of Hope is a remarkable non-profit institution, where compassion and advanced care go hand-in-hand with excellence in clinical and scientific research. City of Hope is a National Cancer Institute designated Comprehensive Cancer Center and a founding member of the National Comprehensive Cancer Network, an alliance of the nation's 20 leading cancer centers that develops and institutes standards of care for cancer treatment.  Requisition ID: 13911Job Title: Project Development Scientist | Hematologic Malignancies and Stem Cell Transplantation InstituteGrant Writing, Scientific Writing, Project Management, Clinical Trial DevelopmentPosition Summary and Key Responsibilities: This Project Development Scientist position will be part of theClinical and Translational Project Development Core of the Hematological MalignanciesInstitute. This Core will support project management, scientific writing and clinical trial design for the Hem Institute. Each Project Development Scientist will be affiliated with a specific disease-focused Center(s) and will work closely with the Center Director, Disease Team leaders, laboratory and clinical researchers, and biostatisticians to shepherd projects from conception to grant submission, to clinical protocol, to manuscript. This team approach to clinical research offers continuity of intellectual and practical input, and is both efficient and rewarding. Essential FunctionsDevelop in-depth knowledge of Center research goals and areas of emphasisFacilitate team interactions throughout the life of a projectAssist with identification of funding opportunities, grant writing and submissionCoordinate clinical trial design, writing and submission of clinical protocolsAssist with Investigational New Drug Applications (IND)Organize manuscript writing, data presentation and journal submissionWork with investigators to assure the clarity and accuracy of data presentations, as well as the interpretation of resultMinimum Education and Skills Required for Consideration:Minimum Education: Requires a PhD in biology, biochemistry, or other life science; or, a master's degree with at least five years of scientific writing, clinical study design, or clinical trial regulatory experience in a healthcare/research/academic environment.Preferred Experience: NIH or DOD research grant writing (R01 level, not post-doctoral fellowships), involvement with human observational or therapeutic studies, protocol design/writing for human sample, observational/retrospective or therapeutic studies. Familiarity with data analysis techniques, graphing methods, and interpretation of laboratory and clinical data.Skills: Excellent scientific writing, organizational and interpersonal skills are key.Aptitude: Ability to work independently and as part of a team, meet deadlines, perform and prioritize multiple simultaneous tasks. Requires judgment that could affect the image of City of Hope and the Institute.Software: Proficiency in use of Microsoft Word, EndNote, Excel and Powerpoint. Prefer familiarity with Adobe Acrobat and Illustrator.Communication: Strong written and verbal English is required. City of Hope is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, sexual orientation, gender identity, age, status as a protected veteran, or status as a qualified individual with disability."}