{"jobID": "2826736049", "jobLocation": "Southfield_MI", "jobTitle": "Director, Enterprise Shared Services", "companyRating": "4.0", "companyInfo": {"Website": "www.creditacceptance.com", "Headquarters": "Southfield, MI", "Size": "1001 to 5000 employees", "Founded": " 1972", "Type": " Company - Public (CACC) ", "Industry": " Finance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": "Director, Enterprise Shared ServicesWhy Work For Credit Acceptance? Credit Acceptance is rapidly-expanding our IT department with a variety of dynamic opportunities. Our culture has landed us on Computerworld's list of the Best Places to Work in IT. In each of the last 5 years, we have held a spot in the top 5 for midsized companies nationwide. In addition, we are also proud to say over the last 5 years we have been named one of Fortune Magazine's 100 Best Companies to Work For. Our team members and culture create a positive workplace that drives us to succeed, making Credit Acceptance one of the largest used car finance companies nationally.  We offer a great work environment, awesome team members, competitive benefits, progressive career opportunities, a casual dress code and we work hard to ensure every team member is empowered to work to their fullest potential. Credit Acceptance offers team members:The opportunity to work with progressive tools, and technology including the latest database, development, storage, and computer technologies availableExtensive growth opportunities as demonstrated by our track record of promoting internallyAn atmosphere that is collaborative, challenging, and filled with forward thinking team membersOngoing business training and career development opportunitiesStrong work-life balance with generous PTO beginning on day 1Competitive market-based salary with quarterly profit sharing and annual merit bonusesExcellent benefits package that includes 401(K) match, adoption assistance, tuition reimbursement, comprehensive medical/dental/vision along with additional benefits that make us a great place to workWe are hiring a Director within our Enterprise Shared Services IT team.Provide strategic and technical leadership and vision to grow and lead the following teams: Oracle Financial Services Lending and Leasing (OFSLL) implementation and migrationModularization and refactoring of multiple internal shared services including Message-Based Architecture SupportAncillary ProductsPayment VendorsCredit ReportingCustomer Master Data ManagementApplication PII IsolationAct as a Consultant, Coach, Mentor in the design of new technology solutionsProvide Corporate Technology Leadership by example and through evangelism across teamsBuild Consensus toward the Best Ideas; offer great insight; accept great insight easily from othersCollect, filter and prioritize work from the various stakeholdersDeliver projects and enhancements on schedule and to specificationsCreate transparency between IT and the lines of businessMinimize production support incidentsImprove the current solutions to help make other departments as productive as possibleResponsibilities in your area will include:Right People, Right Number, and Right Org Design: Build an Application Development department with the right people and the right number of people under a strong organization design.Clear Expectations: Give each team member a clear expectation of what he or she needs to do to succeed.Training: Train team members to use tools and processes efficiently. Encourage formal training where appropriate. Develop an effective training plan for team members.Performance Management: Provide direction, support, tools and training to help Team Members improve performance. Address substandard performance appropriately.Right Measures: Establish a set of department metrics that represent key performance indicators and use those metrics to help drive improvements.Right Environment: Foster a work atmosphere that encourages open discussion-where employees are engaged, motivated and have trust in their leader's vision, ability, integrityRight Tools: Improve our applications and team processes to provide excellent customer service.All other duties as assignedAttendance as required by departmentPosition Requirements:Bachelor's degree (Computer Science or other IT related field preferred)10+ years Information Systems experience to include Application Development experience5+ years of supervisory experienceDemonstrated ability to architect efficient solutions and model dataUnderstanding of SOA concepts and Master Data ManagementDemonstrated ability to manage teamsStrong organizational skillsExperience communicating with leaders Preferred: Experience in Financial Services industry or with financial applicationsKnowledge of Java, specific SOA toolsets, Telecom, Oracle PL/SQLExperience with Agile a plusKnowledge and Skills:Respond promptly and effectively to problems, projects and tasks.Organize , with ability to multi-task and prioritize multiple requests.Convey complex information in a timely and easily understood way to all levels of the organization.Demonstrate insight ; make recommendations as opportunities arise.Maintain customer focus ; keep the customer's and the company's best interest in mind.Innovate. Use creativity and Insight to solve complex problemsCompany Values: To be successful in this role, Team Members need to demonstrate the characteristics of PRIDE in their work: Positive : Maintain a positive attitude by focusing on solutions and promoting a collaborative and enjoyable environment.Respectful : Value teamwork, share successes, appreciates others and communicates in a way that promotes trust.Insightful : Make timely well-considered decisions, create innovative solutions and continuously learn.Direct : Communicate clearly and objectively; don't be afraid of difficult conversations. Raise concerns through the proper channels.Earnest : Be honest, sincere and consistent. Work hard and pursue our goals together relentlessly. Required degrees must have been earned at institutions of Higher Education which are accredited by the Council for Higher Education Accreditation or equivalent.  Credit Acceptance is an equal opportunity employer."}