{"jobID": "2795736637", "jobLocation": "San_Diego_CA", "jobTitle": "Sr. Data Scientist", "companyRating": "3.9", "companyInfo": {"Website": "www.elevate.com", "Headquarters": "Fort Worth, TX", "Size": "501 to 1000 employees", "Founded": " 2014", "Type": " Company - Public (ELVT) ", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "151000", "jobDescription": " Our innovative online credit solutions provide immediate relief to customers today and help them build a brighter financial future. We are committed to rewarding borrowers’ good financial behavior with features like lower interest rates, free financial training, and free credit monitoring. Our suite of groundbreaking credit products includes RISE, Sunny, and Elastic. General Summary: Elevate is a globally distributed technology firm which develops next-generation financial products focused on managing life’s everyday expenses. The Data Science team conceptualizes, develops, deploys, and maintains predictive models using advanced statistical and machine learning methods. These models are used in Elevate’s Underwriting, Account Management, and Operations applications. The Sr. Data Scientist plays a critical role by applying cutting-edge modeling techniques to drive growth, control risk, and ensure operations excellence. Primary Responsibilities:Design and Develop predictive models for use in Underwriting, Customer Management, Marketing, and Operations;Assess, clean, merge, and analyze large datasets.Develop penalized linear and nonlinear machine learning predictive models for underwriting and account management.Efficiently apply data mining methodologies to minimize credit/fraud losses, maximize response and approval rates, and develop methods to enhance profitability of Elevate products.Assist with the implementation of scoring models.Maintain clear, detailed model documentation.Interact with business partners to support the needs and goals of all Elevate portfolios.Experience and Education: M.S./M.A./Ph.D. in a highly quantitative field (Statistics, Economics, Mathematics, Engineering, or other quantitatively-oriented degree) required.4-5 years of experience in modeling of and analytics for consumer lending.Experience with third-party consumer credit data and non-FCRA compliant consumer data.Demonstrated proficiency with advanced statistical modeling and substantial experience with machine learning techniques (e.g., Random Forest, Gradient Boosting, LASSO, Elastic Net). Knowledge of penalized regression and classification methods a plus.Strong data skills, with ability to conduct substantial data munging/engineering.Demonstrable capability with Linux and R, Python, or Java; experience with versioning software (e.g., Git), big data solutions and data processing frameworks (e.g., Spark, Hadoop).Knowledge of contemporary supervised and unsupervised data mining techniques a plus.Required Skills and Abilities:Ability to work in fast-paced environment with ever-changing demands.Ability to manage multiple projects at one time.Good communication skills for communication with Risk Management peers, Marketing, Operations, Collections, and Finance.Comfort with terabytes of information, coming from a large number of diverse sources, possibly in various formats.Comfort working in a highly skilled analytics team.Intellectual curiosity and passion to innovate. Problems to you are not unsolvable, they just need to be looked and explored differently.Effectiveness in the face of stress, ambiguity, difficult situations, and rapidly shifting priorities"}