{"jobID": "2825443242", "jobLocation": "Houston_TX", "jobTitle": "Institute Research Scientist - Translational Biology", "companyRating": "4.0", "companyInfo": {"Website": "www.mdanderson.org", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1941", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": " MD Anderson is known for providing cancer patients with exceptional care, which includes early access to innovative new treatments through clinical trials. The Institute for Applied Cancer Science (IACS) is a new hybrid model that uniquely combines the drug discovery capabilities of the biopharmaceutical industry and the extensive knowledge of biology found in academia with the expertise of MD Anderson's top clinicians. IACS has the singular goal of rapidly developing novel, effective and safe therapeutics that improve patient health. IACS executes programs with the highest probability of clinical success in a rigorous, goal-oriented, data-driven manner.  The Institute Research Scientist participates in cross-functional research to identify and validate novel oncology targets, and applies deep biological insights to then translate these findings into novel oncology therapeutic agents to benefit patients.  Salary Range: Min $98,000 - Mid $122,500 - Max $147,000 ESSENTIAL FUNCTIONSApply and develop basic science tools and methodologies to develop complex strategies and enable advancement of Center projects through leadership and experimental activities.Apply cutting edge functional genomics approaches to enable systematic investigation into mechanisms of tumorigenesis and drug resistance.Independently design, execute and interpret in vitro, ex-vivo and in vivo experiments to validate and explore therapeutic potential of drug targets.Work with research and bioinformatics teams to utilize internal biological and oncogenomic data sets to generate and test biological hypotheses.Work with medicinal chemistry and pharmacology teams as part of drug discovery efforts to validate targets and optimize novel small molecule therapeutics.Lead drug discovery biology efforts to selection of lead candidate molecules and transition into clinical development.Develop and implement biomarker strategies to guide early clinical development of drugs.Design and develop cell and molecular assays to define mechanism of action for compounds, identify pharmacodynamic assays to be used in pre-clinical and clinical setting and test patient selection strategies.Develop extensive knowledge and experience in key areas of tumor biology including, but not limited to oncogenic signaling, tumor microenvironment, tumor immunology, metabolism, epigenetic deregulation or apoptosis.Adapt to new technologies and find solutions to related program studies.Interpret, present and report research findings at internal meetings and external scientific conferences.Education Required: Bachelor's degree in Biology, Biochemistry, molecular biology, cell biology, enzymology, pharmacology, chemistry or related field.  Preferred: PhD in Biological Science or Medical degree strongly preferred  Experience  Required: Ten years of relevant research laboratory experience. With Master's degree, eight years of required experience and with PhD, two years of required experience.  Preferred: At least two years of relevant experience in oncology research in biotech or pharmaceutical environment. Experience with genetic (ie RNAi and cDNAs) and pharmacological (i.e. small molecule inhibitors or antibodies) approaches to study target biology utilizing state of the art molecular biology and biochemistry methods and assays essential to drive projects.Experience working with chemists, in vitro and in vivo pharmacologists to develop and utilize assays in support of the development of small molecules for target validation and as part of compound lead optimization for the development of novel therapeutics is highly desirable.A demonstrated track record in the development and implementation of functional genomics strategies to enable systematic investigation into mechanisms of tumorigenesis and drug resistance.Broad knowledge of cell culture techniques is required and knowledge of how to utilize in vivo oncology models is desirable. Hands-on experience utilizing genetically engineered mouse models and orthotopic or subcutaneous primary or established tumor cell line xenograft models is desirable.Extensive knowledge and experience in key areas of tumor biology including, but not limited to oncogenic signaling, tumor microenvironment, tumor immunology, metabolism, epigenetic deregulation or anti-apoptosis as evidenced by publication in peer-reviewed journals.Strong data analysis skills, ability to interpret results and contribute to the design of follow-up experiments, troubleshoot issues with assay performance, and effectively present results and conclusions to co-workers, collaborators and senior leadership. It is the policy of The University of Texas MD Anderson Cancer Center to provide equal employment opportunity without regard to race, color, religion, age, national origin, sex, gender, sexual orientation, gender identity/expression, disability, protected veteran status, genetic information, or any other basis protected by institutional policy or by federal, state or local laws unless such distinction is required by law. http://www.mdanderson.org/about-us/legal-and-policy/legal-statements/eeo-affirmative-action.htmlSDL2017"}