{"jobID": "2827483368", "jobLocation": "Austin_TX", "jobTitle": "Engineering Scientist Associate - R and D Software Developer", "companyRating": "4.3", "companyInfo": {"Website": "www.utexas.edu", "Headquarters": "Austin, TX", "Size": "10000+ employees", "Founded": " 1883", "Type": " College / University", "Industry": " Education", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "50000", "jobDescription": " Engineering Scientist Associate - R and D Software Developer Hiring department Applied Research LabMonthly salary $5,666 - $6,500+ depending on qualificationsHours per week 40.00 Standard from 800AM to 500PMPosting number 18-06-25-01-4205Job Status OpenFLSA status ExemptEarliest Start Date ImmediatelyPosition Duration Funding expected to continuePosition open to all applicantsLocation Austin - J. J. Pickle Research Campus (North Austin)Number of vacancies 1 General NotesAn agency designated by the federal government handles the investigation as to the requirement for eligibility for access to classified information. Factors considered during this investigation include but are not limited to allegiance to the U.S., foreign influence, foreign preference, criminal conduct, security violations, drug involvement, the likelihood of continuation of such conduct, etc. Required Application Materials  A Resume is required in order to apply A Letter of Interest is required in order to apply. A List of 3 References is required in order to apply. Note: The following additional materials are also required for consideration:  Transcripts. References must be former employers. Instructions for submission of these materials will be provided at the time the online application has been completed. Additional Information  PurposeResearch and development of signal processing algorithms for sonar and underwater acoustics including algorithm implementation, verification, and performance analysis. Essential FunctionsResearch and development of signal and detection processing algorithms. Analysis of high frequency sonar data. Algorithm implementation and verification in real and non-real configurations. Documentation and presentation of work performed. Marginal/Incidental functionsOther related functions as assigned. Required qualificationsBachelor's degree in electrical or computer engineering or computer science. Strong analytical and problem solving capability. Demonstrated ability to work well under pressure. Ability to work independently, and effectively as a member of a diverse team. Demonstrated ability to use signal and statistical processing software. Familiarity with computer hardware and software. US Citizen: Subject to a government security investigation and must meet eligibility requirements for access to classified information at the level appropriate to the project requirements of the position. Preferred QualificationsBachelor's or Master's degree in electrical or computer engineering/science with one or more years of related experience. Experience with developing, implementing and testing signal processing algorithms. Experience with statistical data analysis. Strong Matlab programming skills and knowledge of general acoustics. Experience working in Linux and/or UNIX environments. Some experience in C and/or C++ programming. Cumulative GPA 3.0 or above. Working conditionsMay work around standard office conditions Repetitive use of a keyboard at a workstation Use of manual dexterity Some weekend, evening and holiday work. Frequent use of manuals and books. May work in shared, windowless office space. Some intrastate/interstate travel.A criminal history background check will be required for finalist(s) under consideration for this position.  The retirement plan for this position is Teacher Retirement System of Texas ( TRS ), subject to the position being at least 20 hours per week and at least 135 days in length.  The University of Texas at Austin, as an equal opportunity/affirmative action employer, complies with all applicable federal and state laws regarding nondiscrimination and affirmative action. The University is committed to a policy of equal opportunity for all persons and does not discriminate on the basis of race, color, national origin, age, marital status, sex, sexual orientation, gender identity, gender expression, disability, religion, or veteran status in employment, educational programs and activities, and admissions.  If hired, you will be required to complete the federal Employment Eligibility Verification form, I-9. You will be required to present acceptable, original documents to prove your identity and authorization to work in the United States. Information from the documents will be submitted to the federal E-Verify system for verification. Documents must be presented no later than the third day of employment. Failure to do so will result in dismissal.  UT Austin is a Tobacco-free Campus"}