{"jobID": "2826026932", "jobLocation": "Austin_TX", "jobTitle": "Senior Director, Data Science", "companyRating": null, "companyInfo": {"Website": "www.centene.com", "Headquarters": "Saint Louis, MO", "Size": "10000+ employees", "Founded": " 1984", "Type": " Company - Public (CNC) ", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Senior Director, Data Science at Centene Corporation  Skip Navigation  Contact Returning Applicants  Menu Who We AreWhy We're DifferentProducts & ServicesCareersWhy Centene?BenefitsStudentsContinued LearningApplicant ResourcesInvestorsNewsContactReturning Applicants Search Our Jobs  Keyword  Location  RadiusRadius5 miles15 miles25 miles35 miles50 milesSearch  Senior Director, Data Science  Austin, Texas Job ID ******* Category Accounting & Finance Organization Centene Corporation Schedule Full-time Description:Position Purpose: Provide vision, strategy and operational leadership for the company's health economics functions relating to business development, financial outcomes and contracting analysis. Serve as primary corporate analytical contact for the company to support Centene's and the Health Plans' information needs to support strategic and operational goals and objectives. Support to all lines of business (Medicare/Medicaid/Exchanges/ASO/Hybrid), corporate departments, specialty companies, and state agencies in reviewing all costsManage inpatient estimation process for all health plans to price out all stays for use in month-end close processManage revenue reconciliation process including verifying correct payments from the state, correct eligibility setup in the system, and correct claims paymentsProvide internal consulting for financial, IT, RFPs, rate setting and operational processesMonitor and correct data quality and data processes throughout the organizationProvide utilization and cost analyses to support health plan and corporate health benefits ratio, utilizing enterprise analytic and predictive models and data analysis tools.Create an analytical environment that enhances medical cost decisions to maximize utilization of these tools. Support the business process and systems to ensure integrity of the health economics/data warehouse data.Direct the consolidation of health information to support medical expenditure and utilization analyses and evaluate new tools/models to support businessIdentify risks and opportunities associated with future profitability and member retentionSupport merger and acquisition opportunities with financial and statistical analysisConduct medical cost data economic analysis, research and development projects for the Health Plan's and Finance to identify strategic and operational opportunities, using enterprise toolsOverview: The Senior Director of Data Science will lead the Data Science area within Data Science & Analytics. This team is dedicated to building data driven solutions that have a measurable impact across all parts of the organization by aiding strategic product and content. The role will require a deep understanding of machine learning, deep learning and AI techniques and their application in creating operational analytic solutions in member and provider analytics. The position requires someone who is comfortable striking a balance between cutting-edge and pragmatic solutions. Partnering with business stakeholders, product engineers, IT professionals and other groups within Enterprise Analytics they will ensure that analytic solutions can be leveraged throughout the organization to drive Centene business strategies. Primary responsibilities:Lead a team of talented data scientists in the design and development of foundational and operational analytic solutions that empower Centene to make key strategic decisions across the organizationBe a thought leader in the application of cutting edge techniques to real-world business problemsFoster a shared purpose among team members that enhances the capabilities of the team by building a collaborative learning environmentQualifications:Education/Experience:Minimum Qualifications:Bachelor's degree in Finance, Economics, Statistics, Health Administration or related field.8+ years of healthcare reporting and analytics. Leadership experience and skills required. Knowledge of data systems, IT processes, and reporting tools including SQL, Teradata, Microstrategy required.Experience with accounting practices, state reporting requirements, and rate setting activities preferred.Preferred Qualifications/Skills:MS or PhD in quantitative field of study (mathematics, physical or biological sciences, data science etc.) from an accredited institutionInquisitive, conceptual thinker comfortable working on complex problems at the cutting edge with limited definition of scope or guarantee of expected outcomeDeep experience in application of machine learning, deep learning and analytic techniques in a media or entertainment company within a big-data environment.Strong background in analytic programming (R, SparkR, Python, SAS) and data manipulation (SQL) in a big-data environmentProven technical abilities, but must be capable of communicating complex analyses effectively to varying internal and external stakeholders, of varying seniorityCapability to lead multiple data science work streams simultaneously in a fast-paced environment in partnership with multiple business stakeholdersDemonstrated success executing and managing complex data science initiativesDemonstrable experience leading a data science team in a healthcare, or big-data driven consumer-product companyDrive value in the broader business. Develops and communicates goals, strategies, tactics, project plans, timelines, and key performance metrics to align with multiple internal stakeholder departments and ultimately grow Centene's analytics capabilities. Applies a broad business approach to find and create value for the company.Advanced level proficiency with statistical, machine learning modeling techniques such as regression, decision trees, neural networks, support vector machines, supervised/unsupervised clustering techniques, experimental test design, etc.Expert theoretical knowledge of machine learning modeling techniques and advanced applied skills in developing predictive targeting models within distributed computing platforms such as Hadoop, AWS, Azure, GCP using tools like Spark, Scala, SAS, R, Python, Bayesia, H2O, Storm, Yarn, Kafka,Superior analytical skills. Ability to perform insightful and actionable quantitative and qualitative analysis of the business.Strong interpersonal skills-an outstanding ability build relationships, influence and navigate within a complex organization.Prepare and distribute medical cost lags and month-end close reporting to finance, utilizing enterprise toolsLicenses/Certifications: MBA, CPA preferred this job TwitterFacebookLinkedInEmailMoreGoogle+Tumblr Check out this location  See what's near our Austin location. View Map  Our Hiring Process  Learn more about our hiring process and discover other helpful information for applicants.Learn More  Sign up for Job Alerts  Join our Talent Network and get Centene news and job alerts delivered to your inbox. Sign Up Close  First Name  Last Name  Email AddressAreas of InterestSearch for a category, location, or category/location pair, select from the suggestions and click Add.  Category  LocationAdd + Accounting & Finance, Austin, Texas, United StatesRemoveRemove Confirm Email  Match Your Skills  Let us search jobs for you based on the skills and experience listed in your LinkedIn Profile.Start Matching  Transforming the health of the community, one person at a time.  Healthcare is best delivered locally  Our local approach allows us to help members access high-quality, culturally sensitive healthcare services.Local community involvement is key  We invest in local communities and the lives of our members in as many ways as we can. Who We AreWhy We're DifferentProducts & ServicesCareersInvestorsNewsContactEqual Opportunity EmployerSitemap Connect With Us TwitterFacebookLinkedInYouTube Copyright 2018 Centene Corporation"}