{"jobID": "2824658899", "jobLocation": "Richardson_TX", "jobTitle": "Senior Data Analyst, Human Resources", "companyRating": "3.6", "companyInfo": {"Website": "www.fossilgroup.com", "Headquarters": "Richardson, TX", "Size": "10000+ employees", "Founded": " 1984", "Type": " Company - Public (FOSL) ", "Industry": " Retail", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "79000", "jobDescription": "Job Title Senior Data Analyst, Human Resources  21-Jun-2018 Your RoleFossil Group is looking for a Senior Analyst to join our HR Systems and Reporting team within the HRIS department. The Senior Reporting Analyst is charged with developing and deploying best practice Talent Management reporting supporting the global organization. The Analyst uses data from various applications to document the current state of HR transactions and processes in order to provide a factual basis for recommending improvements. This position serves a variety of internal and external clients, including the Global HR, Finance, and Strategy teams. As a leader within the department, this person will also have ownership of the Applicant Tracking/Onboard System (IBM Kenexa BrassRing) and will oversee all other required and miscellaneous reporting for the Global organization. Other responsibilities include, but are not limited to: Collaborates closely with HRIS, Payroll, and other HR team members to gather business requirements, document, design and configure RPA system for process automation.Owns design, configuration, and maintenance of the Applicant Tracking System to ensure it meets the needs of the Recruiting Team and also remains compliant with Affirmative Action Plan. (Configuration training provided)Provides all analysis required by Affirmative Action Plan. Partners with counsel and HR Operations to establish placement goals.Completes all required annual reports, such as AAP snapshot data, Impact Ratio Analysis reports, EEO-1, Vets-100, etc.Completes miscellaneous reporting or data gathering for projects assigned to the department within system integrations, acquisitions, process creations, etc.Executes ad hoc report requests from HR team and various partners throughout the organization.Partners with other divisions within the organization on various assignments requiring HR documentation and/or data manipulation.Manages HR Reporting Coordinator and oversees other various HR Reporting areas of responsibility.Get To Know Us Fossil Group, Inc. is a global design, marketing and distribution company specializing in consumer lifestyle and fashion accessories. In a word, we’re innovators (and proud of it). In 1984, we were a small watch business with five employees. Today, under a diverse portfolio of proprietary and licensed brands, we offer watches, jewelry, handbags, small leather goods and, most recently, wearables. With our newest owned brand, Misfit, we are uniquely positioned to lead the convergence of style and technology in the high-growth connected space. Our strategic channels of distribution include department stores, specialty stores, eCommerce websites and more than 600 company-owned and operated retail stores. Find even more information, including press releases and SEC filings, at www.fossilgroup.com. Division Corporate Job Status Full Time Brand Name Fossil Your Skills5+ years’ experience in a similar role with and a sound understanding of HR Information SystemsBachelor’s degree in HR, Information Systems or relevant degree is preferredProven experience with scrubbing, and interpreting data across multiple HR functionsAbility to understand and communicate the meaning of analysis with individuals in a wide range of strategic and executional roles, in both written and oral form, with intuitive understanding of what the analysis implies and how it would be affected by changes in assumptionsAutomation Anywhere experience is preferred, but training is provided.Leadership and management experience is highly preferredProven success with working, liaising and influencing effectively with business usersExperience working within an HR department and with a good knowledge of HR practicesFlexible approach with skills in problem solving, judgment, critical thinking and attention to detail.Excellent communicator; good written and oral communications skills with the ability to interact and communicate at all levelsExperience supporting Applicant Tracking System preferred, but training is provided.Advanced expertise in MS Excel (specifically complex calculations, ‘vlookups’, pivot tables, etc.)SAP experience is a plusLocation TX - Corporate Accommodations Statement Fossil is an Affirmative Action and Equal Employment Opportunity Employer. We consider applicants without regard to race, sex, religion, national origin, disability or protected veteran status. Anyone requiring special accommodations to our normal application process please email applicationaccommodation@fossil.com and we will assist you. Brand Highlights Fossil is an American watch and lifestyle brand inspired by all things curious. Since 1984, we’ve been a creative collaborative focused on authentic design, craftsmanship, and storytelling. Fossil has grown to offer watches, bags, jewelry, eyewear, and most recently wearables. With more than 400 retail stores, 4,000 wholesale locations and 13,000 employees worldwide, passion drives our curiosity and inspires us to always ask, “what’s next?” "}