{"jobID": "2360002346", "jobLocation": "Detroit_MI", "jobTitle": "Sales Development Program", "companyRating": null, "companyInfo": {"Website": "www.quickenloans.com", "Headquarters": "Detroit, MI", "Size": "10000+ employees", "Founded": " 1985", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Citi, Bank of America, Wells Fargo"}, "estimatedSalary": null, "jobDescription": " Who We AreAs a team member of the Quicken Loans Family of Companies, you become part of a family of over 33,000 team members in over 160 companies across 15 different industries from Finance, to Technology, Real Estate, Gaming and more.  Quicken Loans started as a “summer experiment” in 1985 and has grown into the largest residential mortgage lender in the nation with offices in Detroit, MI, Cleveland, OH, Phoenix, AZ and more. We’ve revolutionized the mortgage industry by putting our clients first and creating innovative technology like Rocket Mortgage that makes the complex mortgage process radically simple.  We are Quicken Loans and we are Powered by Purpose.What You'll Do/NeedThe Sales Development Program is designed to put you on the path to becoming a fully licensed Mortgage Banker. Many of our Mortgage Bankers started with no experience in the field, so don’t worry if you’ve never worked with mortgages before or don’t have a finance-related degree. We’ll teach you everything you need to know about Mortgage Banking sales before you start working with your own clients.  What else can you expect? Earning Potential: Control how much you earn at the end of each month with our uncapped commission structure.No Cold Calling: Connect with high-quality leads that are interested in speaking with you about purchase or refinance loans.Paid Training: Get paid while you prepare for your federal licensing exam with a mix of classroom-style training and hands-on experience with clients.Professional Growth: Create your own career path into leadership or senior-level roles based on your goals.Mentorship: Receive real-time feedback from leaders and support from your team members who were once in your shoes.ResponsibilitiesComplete all assigned Mortgage Banker training and pass licensing activities – 15 weeks of Mortgage Banker training and licensing completely paid by Quicken LoansInterview clients to gather information about their unique financial situations, needs and objectivesEvaluate various loan programs and affordable financing plans from a broad range of Quicken Loans mortgage optionsEducate and advise clients on the home buying process and how to best manage their mortgage(s)Ensure exceptional client experiences with ongoing communication throughout the entire loan processRequirementsA self-starter mindset and the drive to meet and surpass goalsComfort working in a fast-paced, production-driven environmentStrong communication skills and the ability to build relationships with clients over the phone What You'll Get 15 weeks of fantastic Mortgage Banker trainingOn-the-job coaching and real-time feedbackExcellent compensation and benefitsSweet bonuses, trips, tickets and cash moneyCutting-edge, lightning-fast technology (We call it Rocket Mortgage for a reason!)Disclaimer Quicken Loans is a proud equal opportunity employer. Candidates must meet National Mortgage Licensing System (NMLS) and Secure & Fair Enforcement for Mortgage Licensing Act (SAFE Act) requirements. Quicken Loans received the highest numerical score in the proprietary J.D. Power 2010 – 2016 Primary Mortgage Origination studies and the 2014 – 2016 Primary Mortgage Servicer studies. 2016 Origination (or Sales) based on 5,182 total responses and measures experiences and perceptions of consumers who originated a new mortgage, surveyed in July – August 2016. 2016 Servicing based on 7,542 total responses and measures experiences and perceptions of consumers with their current mortgage servicer, surveyed in March – April 2016. Your experiences may vary. Visit JDPower.com.​Apply"}