{"jobID": "2825195609", "jobLocation": "Irving_TX", "jobTitle": "Digital Marketing Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.monkedia.com", "Headquarters": "Flower Mound, TX", "Size": "1 to 50 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Would you describe yourself as socially savvy with current trends and consumer behaviors? Do you love analyzing data to highlight marketing trends? If youre looking for an exciting career opportunity in digital advertising and marketing, working with a fast-growing company that runs on-going digital and social campaigns for some of todays top brands (with clientele ranging from ESPN and Disney to Simplehuman and Celebrity Charity Campaigns) then Monkedia is the place for you. The Digital Marketing Data Analyst will be responsible for managing multiple clients digital advertising accounts on a daily basis, looking at various statistics in regards to performance of campaigns, targeting, and ad creative to help Monkedia optimize our clients advertising efforts and produce the greatest ROI from each campaign.Responsibilities: Dive into account analytics, using Facebook and proprietary systems, to understand trends across advanced metrics for campaign, ad set, and ad performance See through the data and analyze it precisely to find appropriate conclusions. Must be vigilant and like challenging problems Apply statistical methods creatively to measure effects of budget adjustments, audience resonance, and content performance Identify trends and patterns in the advertising data, and strategically implement optimization methods to maximize ROI Work closely with creative team to deliver daily reporting on account performanceMinimum Qualifications 1-4 years of experience in a marketing or digital marketing role Experience with Facebook advertising or Google AdWords Strong analytical skills with the ability to collect, organize, analyze and disseminate significant amounts of information with vigilance, accuracy and attention to detail The ability to perform daily account management and optimization of various advertising accounts Experience analyzing and generating reporting for major metrics, goal tracking, revenue tracking, and more Strong math and analysis skills, as well as strong written and oral communication skills. A logical but creative mindset, being able to take a companys objectives and identify campaign strategy through research and analysis (i.e.: recommending appropriate keywords, targeting, interests, and more) Bachelors degree Must be legally authorized to work in the United StatesPreferred Qualifications Strong understanding of statistical methods and analysis such as probability distributions, regression analysis, correlation, causation, variance, etc A degree in mathematics, information systems, statistics, economics, computer science, and/or behavioral economics is a plusWhy Monkedia? At Monkedia we believe people are the greatest part of our business, thats why were invested in finding driven, passionate, and charismatic individuals to become a part of our team.Perks: Our Las Colinas Office is easily accessible from several major highways Many restaurants and retail within 5 mins of office Stay home when you need it - Unlimited sick days Voted 2018 Best and Brightest to work for! Friday Happy Hours Fully-stocked vending machine with prices at low vendor cost Monthly company and team events/outings like on-site laser tag tournaments, christmas light shows, company casino night, and more! Free parking 1 hour lunch breaks Smart casual dress code - jeans and flannels welcomeBenefits: Competitive salary Medical, Dental, Vision, Life, & Disability insurance plans Paid vacation days 9 paid holidays This position is based in our Las Colinas office. This is your chance to build your career with our collaborative and engaging team as part of a fast-growing, creative company leading initiatives in social media advertising. We need brains, ambition, and passion to continue helping connect all kinds of products and services with customers all over the globe. At Monkedia, we care less about your badges of honor and more about who you are and what youve accomplished. We are a positive opportunity employer and give opportunities less on the school you graduated from and more on what youve done as a well-rounded human-being. When applying be sure to send us YOU, not just your accolades. And, if youre paying attention, be sure to include your favorite company or celebrity you follow on social media in your cover letter!"}