{"jobID": "2827119497", "jobLocation": "Chicago_IL", "jobTitle": "Retail Branch Analytics Manager", "companyRating": "2.9", "companyInfo": {"Website": "www.bmoharris.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1882", "Type": " Subsidiary or Business Segment", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " J.P. Morgan, Bank of America, U.S. Bank"}, "estimatedSalary": "99000", "jobDescription": " The Retail Branch Analytics Manager works with management and business partners to support the development and implementation of retail and business banking sales goals, staffing plans and branch performance analysis while employing advanced analytical solutions. We are looking for a strategic thinker with the ability to dissect business problems, conduct research, and utilize advanced statistical analysis to identify trends, variations, patterns, and insights relating to banker/ branch performance and customer activities, and build end-to-end analytical solutions.  This is an exciting opportunity that is on the forefront of a critical enterprise capability, providing thought leadership to U.S. Personal and Business Banking on the value of data and analytics. The incumbent will get to work with and support multiple lines of business around the enterprise to help them achieve their objectives WHAT WILL YOU DO?Support Senior Management on U.S. Retail and Business Banking goal setting and FTE planning, modeling, and evaluation, as well as other analytical projects of varying sizes and complexities, including: Identify the best analytical techniques that can be effectively applied to achieve business objectives and interpret next best action through data driven insights Building end-to-end automated analytic solutions that are intuitive, simple to maintain, and drive real business outcomes Work closely with other lines of business, such as; finance, product managers, human resources and field management in order to optimize sales in branches, forecast sales performance results and model branch staffing strategiesResponsible for the design, development, and implementation of innovative analytical solutions, including but not limited to:Data gathering and cleansing, statistical transformation, feature engineering & selection Apply analytical techniques such as linear/non-linear models, clustering, and optimization Visualize and build reports and visualizations to effectively communicate data driven insights to users for a variety of audiences Develop accurate financial models and make recommendations regarding financial impact of initiatives and projectsWHAT DO YOU NEED TO SUCCEED?KnowledgePossesses a university degree in mathematics, statistics, physics, engineering, or finance (Masters preferred) 3 to 6 years of experience in advanced analytics, financial services and/or consulting is strongly preferred Advanced skills in Python, R, or SAS, including relevant packages and statistical testing methodologiesSkillsDemonstrates strong communication skills (both written and verbal) and relationship management skills at a senior management level Shows strong knowledge of mathematical and statistical models in a highly technical context, with proven record of building solutions to complex problems Exhibits advanced critical thinking skills, integrative skills and creativity to drive innovation Demonstrates ability to build a good fact base, apply sound reasoning, and generate relevant recommendations that get implemented and lead to business success Able to work highly independently and manage multiple priorities in an agile fast paced environment Possesses solid leadership skills and is able to work successfully with a team that has diverse skills, knowledge, and educational backgrounds Demonstrates strong attention to detail and a high level of due diligenceWHY BMO? At BMO we have a shared purpose; we put the customer at the centre of everything we do helping people is in our DNA. For 200 years we have thought about the futurethe future of our customers, our communities and our people. We help our customers and our communities by working together, innovating and pushing boundaries to bring them our very best every day. Together were changing the way people think about a bank.  As a member of the BMO team you are valued, respected and heard, and you have more ways to grow and make an impact. We strive to help you make an impact from day one for yourself and our customers. Well support you with the tools and resources you need to reach new milestones, as you help our customers reach theirs. From in-depth training and coaching, to manager support and network-building opportunities, well help you gain valuable experience, and broaden your skillset.  BMO is committed to an inclusive, equitable and accessible workplace. By learning from each others differences, we gain strength through our people and our perspectives. Accommodations are available on request for candidates taking part in all aspects of the selection process.  Were here to help  At BMO Harris Bank we have a shared purpose; we put the customer at the center of everything we do helping people is in our DNA. For 200 years we have thought about the futurethe future of our customers, our communities and our people. We help our customers and our communities by working together, innovating and pushing boundaries to bring them our very best every day. Together were changing the way people think about a bank.  As a member of the BMO Harris Bank team you are valued, respected and heard, and you have more ways to grow and make an impact. We strive to help you make an impact from day one for yourself and our customers. Well support you with the tools and resources you need to reach new milestones, as you help our customers reach theirs. From in-depth training and coaching, to manager support and network-building opportunities, well help you gain valuable experience, and broaden your skillset.  To find out more visit us at https://bmoharriscareers.com.  BMO Harris Bank is committed to an inclusive, equitable and accessible workplace. By learning from each others differences, we gain strength through our people and our perspectives. BMO Harris Bank is an Equal Opportunity Employer for all, inclusive of Minorities, Women, Veterans, and Persons with Disabilities. "}