{"jobID": "2828562890", "jobLocation": "Chicago_IL", "jobTitle": "Senior Engineer, Data", "companyRating": null, "companyInfo": {"Website": "www.spothero.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " ParkWhiz"}, "estimatedSalary": null, "jobDescription": " SpotHero is seeking an Senior Engineer be part of the team building our new data platform. The team will own the solution to help us scale out to build a future where the SpotHero platform surfaces real time parking inventory across the United States for millions of customers. Who we are: SpotHero is one of transportation's hottest tech companies! Were rapidly growing with the mission of bringing the parking industry into the future through technology. Drivers across the nation use the SpotHero mobile app or website to reserve convenient, affordable parking on-the-go or in advance, and parking companies rely on us to help them reach new customers while optimizing their business. We connect the dots with cutting-edge technology, delivering value to both sides of this exciting, evolving marketplace. What will you do:Work with our analytics and data science teams to understand our data processing needs.Be a key hands-on contributor to the design and implementation of our new data platform from the infrastructure layer up to the API.Model and architect our data in a way that will scale with the increasingly complex ways were analyzing it.Build robust pipelines that make sure data is where it needs to be, when it needs to be there.Build frameworks and tools to help our software engineers, data analysts, and data scientists design and build their own data pipelines in a self-service manner.Performance testing and engineering to ensure that our systems always scale to meet our needs.Be a key member of the team focused on pure hands-on contribution to the implementation and operation of our data platform.Your experience: We value humility, a strong work ethic, flexibility, collaboration, technical curiosity, and constant learning.At least one project that demonstrate prowess in designing, implementing, and operating large scale, high throughput, low latency distributed systems.You can go up and down the stack from deep in the infrastructure layer all the way up to the client libraries.Experience with small teams that move fast -- all members are expected to be able to achieve maximum results with minimal direction.You have at least 7 years of hands on experience as an Engineer across multiple environments on complex distributed polyglot systems using Java, Scala, Clojure, Go and/or C++.Nice to Have:Kubernetes and/or Mesos experienceKafka, Spark and/or Flink experienceCassandra, Elastic, Redis and/or Couchbase experiencePostgres, MySql and/or Oracle experienceAWS, GCP and/or Azure experienceOpen source contributions to a few major projectsWhat we are offering:Career game changer A truly unique experience to work for a fast-growing startup in a role with unlimited potential for growth.Excellent benefits We cover 90% of Medical Premiums, 50% of Dental & Vision Premiums, and offer company sponsored Life Insurance.Flexible PTO policy, generous parental leave, and great work/life balance We value and support each individual team member.Fun perks like snacks, catered lunches, happy hours, wellness programs, and SpotHero swag.Annual parking stipend (duh we help people park!).  The opportunity to collaborate with fun, innovative, and passionate people in a casual, yet highly productive atmosphere.A workplace recognized as the Best Consumer Web Company by Built in Chicago, Top Company Culture by Entrepreneur, a Top Workplace by Chicago Tribune, and one of Chicagos Best Places to Work for Women Under 35 by Crains Chicago Business.Steps to apply: Please include any GitHub account, LinkedIn profile, and any project that youre particularly proud of. We love seeing work that others loved working on. NOTE: You must be legally authorized to work in the US. Unfortunately, the company is unable to support sponsorships at this time.We are considering applications for this position from candidates not located in Chicago. However, you must be able and willing to travel to Chicago on a quarterly basis."}