{"jobID": "2729577663", "jobLocation": "Washington_DC", "jobTitle": "Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.eab.com", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "89000", "jobDescription": "About EAB EAB is an education best practices firm that uses a combination of research, technology, and services to improve the performance of 1,200+ educational institutions. Headquartered in Washington, D.C., EAB forges and finds the best new ideas and proven practices from its network of thousands of leaders, then customizes and hardwires them into every level of member organizations, creating enduring value.  At EAB, we serve not only our members but each other—that's why we are always working to make sure our employees love their jobs and are invested in their community. See how we've been recognized for this dedication to our employees by checking out our recent awards.  For more information, visit our Careers page. The Role in BriefData Scientist The EAB Data Science Team is looking for a broadly-talented Data Scientist with quantitative research skills. You will work with data scientists and industry experts to uncover data-driven insights on a wide spectrum of topics within Higher Education. Your role on the Data Science team will be primarily focused on performing research on large historical datasets, and design of scalable statistical and machine learning systems based on this analysis. You will also develop and improve the tools and platforms that expand the horizons of data-driven research at EAB.  This role is based in Washington, D.C. Primary Responsibilities:Building predictive models, performing model selection, parameter tuning and feature selectionCollaborate with data scientists and software engineers to integrate statistical models into production software systemsWrite R and Python code using current best practices, including reproducible researchPerform original quantitative research, including acquisition of domain knowledge, determination of important research questions, data collection and manipulation, statistical analysis, and technical writing and presentationCommunicate and coordinate effectively with product managers, software engineers, and customer-facing teamsBasic Qualifications:Education: Bachelor's Degree in a quantitative social science or a STEM field3+ years of professional experience in a technical roleExperience with quantitative modeling and machine learning techniques and approachesExperience with programming and software development, including Python, R, or other high-level language used in statistical computingSubstantial experience with statistics and the scientific method, and the ability to perform self-directed hypothesis-driven researchAbility to present to, communicate with, and collaborate well with non-technical peopleBe forever learning, team dedicated, self-driven, quality minded, and customer obsesseIdeal Qualifications:Masters or PhD in a quantitative fieldFamiliarity with Rmarkdown, Shiny and Jupyter NotebooksExperience in EdTech or Higher EducationActive in your professional communityBenefits Consistent with our belief that our employees are our most valuable resource, EAB offers a competitive benefits package: Medical, dental, and vision insurance, dependents eligible401(k) retirement plan with company matchGenerous PTODaytime leave policy for community service or fitness activities (up to 10 hours a month each)Wellness programs including gym discounts and incentives to promote healthy livingDynamic growth opportunities with merit-based promotion philosophyBenefits kick in day one, see the full details here."}