{"jobID": "2757636467", "jobLocation": "Elk_Grove_CA", "jobTitle": "Senior Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "144000", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The Information Systems & Technology (IS&T;) team manages key business and technical infrastructure at Apple -- how we take an order online, the experience with technology in our retail stores, how much network capacity we need around the world, the processing of every credit card an iTunes customer uses and closing the books. IS&T; does it all. The IS&T; HelpLine and Network Operations Center (NOC) provide technical support services to Apples employees, contractors, and vendors throughout the world, 24 hours a day, 365 days a year. We support Apples products and services from hardware to software. We also support Apples world-class information technology infrastructure from our data centers through our data and voice networks to each users Mac or IOS deviceand everything in between. We are currently looking for a highly motivated, technically savvy, Senior Data Scientist who has excellent analytic and data visualization skills to join our HelpLine team. This is an extremely fast-paced and highly demanding environment. If you have what it takes, we would like to talk to you.Key Qualifications: •Desire and ability to thrive in a fast-paced, highly demanding, dynamic business and information technology environment •Ability to maintain composure and focus in stressful situations •Customer service orientation •High standard for attention to details and 100% accuracy •Excellent verbal and written communication skills •Superb time management and multi-tasking skills •Ability to meet and exceed goals and objectives with minimal direct supervision and only high-level direction •Excellent risk management and information security knowledge, skills, and abilities •Basic Linux and macOS system administration •Fluency in SAS, R, Spark, UNIX shells (bash and ksh) or Python, with experience writing scripts that are part of a production-type analytic solution •Solid technical database knowledge (Oracle, Hadoop, Teradata, data modeling) and experience optimizing SQL queries on large data •1-2 years of experience working with Tableau •Knowledge and experience working with a variety of data structures and formats •In-depth knowledge and skills to use and apply descriptive and inferential statistics including probability, hypothesis testing, estimation, associations, correlation, regression analysis, and forecasting •Analytic and business intelligence skills to identify meaningful patterns, analyze them, and then integrate and communicate them via data visualization and reporting techniques •Knowledge and experience with data modeling using R or other similar software •Strong data visualization, reporting, and communications skills and abilities •Knowledge and experience with map reduce using Hadoop •Familiarity with enterprise information technology •Effective communication; up, down and laterally •Preferred Experience and Skills •Knowledge and experience producing reports with Business Objects •Knowledge and experience with Splunk •Knowledge and experience with map reduce using Hadoop or similar softwareDescription: The Senior Data Scientist operates independently and is responsible for coordinating the storage, retrieval, presentation, and analysis of data for the IS&T; HelpLine and Network Operations Center. The data scientist will present data to peers, managers, directors, and VPs; and highlight data patterns that could be useful for making business decisions. * Effectively plans and leads projects and tasks to determine data needs, data sources, and data users * Coordinates with other data producing and data consumer groups * Coordinates data access with other data stewards and data users * Develops data requirements document and collaborates with developers and data miners to obtain the required data * Validates data quality by: * Filtering data * Analyzing and removing errors * Analyzing and removing inconsistencies * Ensures that the data is accurate and meets the stipulated requirements * Analyzes data using various methods including: * Data visualization * Basic descriptive statistical measures * Statistical dependency (association) and correlation * Trend analysis * Predictive analytics * Modeling * Develops data visualizations and reports on the data, trends, probabilities, forecasts, and other business intelligence based on data * Skillfully communicates the data, reports, and findings using a number of media including: * Oral presentations * Written reports, charts, and graphs * Web-based, interactive reports and data visualizations * Takes the initiative to develop and automate regular and ad-hoc reports * Researches, and if applicable, implements new technologies and methods in the areas of * Data analysis * Data visualization and presentation * Data glossaries and librariesEducation: PhD is required in Business (with quantitative emphasis), Statistics, Data Mining, Machine Learning, Analytics, Econometrics, Mathematics, Operations Research, Industrial Engineering, or related field Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}