{"jobID": "2675203816", "jobLocation": "Chicago_IL", "jobTitle": "Lead Data Engineer", "companyRating": "3.9", "companyInfo": {"Website": "www.thoughtworks.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Accenture"}, "estimatedSalary": "104000", "jobDescription": "ThoughtWorks is a global software consultancy, made up of around 4,500 passionate technologists across 15 countries. We specialize in strategy, portfolio management and product design, combined with digital engineering excellence.As a Lead Data Engineer, here's what we'll be looking for you to bring:Hands-on Engineering LeadershipProven track record of Innovation and expertise in Data EngineeringTenure in coding, architecting and delivering complex projectsDeep understanding and application of modern data processing technology stacks. For example Spark, Hadoop ecosystem technologies, and othersDeep understanding of streaming data architectures and technologies for real-time and low-latency data processingDeep understanding of NoSQL technologies including column family, graph, document, and key-value data storage technologiesUnderstanding of how to architect solutions for data science and analytics such as productionizing machine learning models and collaborating with data scientistsUnderstanding of agile development methods including: core values, guiding principles, and key agile practicesUnderstanding of the theory and application of Continuous Integration/DeliveryPassion for software craftsmanshipA rich breadth of industry experience and background working across different organizations, ranging in size, from start-ups to large corporations..Strong stakeholder management and interaction experience at different levelsThere's no typical day or engagement for our Senior Data Engineers. Heres what youll do:Be the SME. Develop modern data architectural approaches to meet key business objectives and provide end to end data solutionsYou might spend a few weeks with a new client on a deep technical review or a complete organizational review, helping them to understand the potential that data brings to solve their most pressing problems.On other projects, you might be acting as the architect, leading the design of technical solutions, or perhaps overseeing a program inception to build a new product.It could be much more about getting stuck into a delivery project where you're equally happy coding and tech leading the team to implement the solution.Whatever your role, the team always look to draw on your experience when things get tough and you often handle the difficult client conversations allowing the team to continue delivering without undue pressure.You have great relationships with our new business team and work collaboratively to support pre-sales, meet prospective clients and ultimately influence and shape our portfolio of work.You recognize that building your network with a client is absolutely key to enable you to perform in your role. You'll be drawing on all of your passion for technology, hands-on experience and knowledge of latest Big Data and Engineering best practices to help you gain the respect and credibility of those around you.A few important things to know:Travel is required. Projects are almost exclusively on customer site, so ThoughtWorkers need to be flexible and up for extensive travel. Most of our consultants travel every week and fly home for weekends. We do our best to take peoples personal situations into account, but we know its not for everyone.Residing near one of our North America offices in Chicago, Dallas, New York, Atlanta or San Francisco is preferable although not necessary.Not quite ready to apply? Or maybe this isnt the right role for you?Thats OK, you can stay in touch with AccessThoughtWorks, our learning community (tick 'contact me about recruitment opportunities' to hear about jobs in the future).#LI-NA"}