{"jobID": "2787723583", "jobLocation": "Cedar_Park_TX", "jobTitle": "Controls and Automation Scientist", "companyRating": null, "companyInfo": {"Website": "www.nov.com", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1841", "Type": " Company - Public (NOV) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $10+ billion (USD) per year", "Competitors": " Schlumberger, Halliburton, Cameron"}, "estimatedSalary": null, "jobDescription": "The M/D Totco Surface Instrumentation Engineering(SIE) team focuses on modeling, predicting, and measuring the dynamic response of the drilling physical system and seek to provide automation and improved efficiencies of drilling operations and downstream well productivity. The team concentrates efforts in three principal areas: advanced instrumentation, real-time data analytics, and surface based optimization. We are currently looking for an engineer or scientist with skills related to statistical data analysis, pattern recognition, learning algorithms, and optimization technics based on mathematical theories.Primary Responsibilities:Facilitate new functionality to real-time computing platforms in the areas of pattern recognition and learning algorithms with a focus on Neural Networks and Bayesian Changepoint Detection.Analytically consume large amounts of data for post process modelling, analytics development, and model validation. Improve current approaches of defining the drilling physical system and integrate new definitions into the ordinary differential equations that drive a real-time drilling model.Translate mathematical derivation to deployable functions that integrate with our real time operating system.Enable optimization that includes automation of environment exploration to produce minimum cost functions. Support hardware and software testing related to drilling and optimization models.The SIE team consists of members that are passionate about the pursuit of knowledge, advanced technologies, and the application of advanced engineering and scientific principles into commercial solutions. We explore the limits of deployable technology and challenge industry norms. The keys to success in this position are: adaptability, problem solving, teaming, leadership, energy, and commitment to technical advancement. We aggressively meet our commitments with well-engineered and fit for purpose solutions that truly make an impact on the people in our industry. Masters or PhD of Science in Physics, Mathematics, or Mechanical/Electrical Engineering from accredited university with related courses on Data Science, Statistics, and Machine LearningExperience deploying Neural Network Algorithms for classification from multivariable time series data.Skilled in statistical data analytics and participated in analyzing large amounts of time series data.Successfully modeled physical systems through first order principles of varying complexities.Proficiency in Matlab/Simulink is not required but is desirable."}