{"jobID": "2835261570", "jobLocation": "The_Woodlands_TX", "jobTitle": "Data Analyst II", "companyRating": null, "companyInfo": {"Website": "www.experis.com", "Headquarters": "Milwaukee, WI", "Size": "5001 to 10000 employees", "Founded": " 1953", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Robert Half, Adecco, Robert Walters"}, "estimatedSalary": null, "jobDescription": " One of our direct clients located in Spring Texas has a 3-6-month contract position for a Data Analyst II Business Support Group (BSG) Assistance: Enter data in multiple SAP systems and generate monthly reports (e.g. time reporting, billing, etc)  Update SharePoint site with updated data and graphics  Identify gaps and ensure compliance with Business Controls requirements  Process and handle sensitive information which requires confidentiality  Create/Remove and verify data in business specific computer programs  Create external personnel numbers for loans and contractors (99#s)  Manage Purchase Order requisition process and process invoices approvals by facilitating payment through SAP  Move charges between company codes/cost centers via Journal Vouchers (intra-EMRE and inter-company)  Update cost stewardship report with Data Warehouse GENERAL Duties  Manage and respond to inquiries/requests through shared mailbox(s)  Interact with employees at all levels of the organization, including Section Heads and Division Managers  Transition Desk Procedures Manual for both BSG and TTG from multiple systems to one OneNote for each group  Other duties as required/requested SKILLS AND QUALIFICATIONS Strong analytical, verbal and written communication skills.  Report generation and data analysis.  Proficient in MS Office.  This position, requires detailed knowledge across a wide variety of skills including the following:  SAP (multiple environments), purchasing payroll, Data Warehouse, Excel, SharePoint, OneNote and several other applications.  Our group is the resource group for EMRE Engineering and FPO and we need someone that has the knowledge and background and can step in and start answering questions and working immediately.  Cory Goldstein  Senior Key Account Recruiter  Office (908) 363-0985  cory.goldstein@experis.com  Experis, A Manpower Group Company  Experis is an Equal Opportunity Employer (EOE/AA) - provided by Dice  Data Analyst, SAP, purchasing payroll, Data Warehouse, Excel, SharePoint, OneNote"}