{"jobID": "2830522535", "jobLocation": "San_Diego_CA", "jobTitle": "Analytical Scientist", "companyRating": null, "companyInfo": {"Website": "www.axelon.com", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Analytical Scientist  San Diego, CA  9 Month Contract  Daytime Shift: 8-5 or 9-6 Priority will be placed on candidates with backgrounds in proteomic mass spectrometry and fermentation metabolic analysis.  This is a contract position for the Analytical Chemistry group to provide analytical support for the enzyme development projects and enzyme production. This position will focus on the characterization of enzymes, their reaction products, and fermentation metabolomics. We are looking for a scientist with a hands-on approach to analytical method development with expertise in separations and spectroscopy. Priority will be placed on candidates with backgrounds in proteomic mass spectrometry and fermentation metabolic analysis.  Educational requirements are a MS in analytical chemistry or related discipline with at least 5 years of biotech experience, or a PhD and 0 to 3 years of experience.  Strong knowledge and background in developing separations of small and large molecules is required. Applicable analytical methodologies include, but are not limited to HPLC, LC-MS (QqQ and QTOF), and GC-FID. Experience with NMR is a plus.  Successful candidates will be skilled at developing high throughput analytical methods, optimizing existing analytical methods, operating and maintaining analytical instrumentation, and providing timely reports of data. Critical thinking and complex data analysis is required for this position.  Additionally, a good understanding of databases, custom reporting, macros, and other techniques to aid in data analysis and reporting is desired.  The candidate needs excellent communication skills, and will be working in a multidisciplinary and fast-paced environment. The successful candidate must also be able to manage and deliver on several project deadlines concurrently and with minimal supervision. Being a self-motivated team player with a positive attitude is an absolute requirement."}