{"jobID": "2794318860", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Science Manager", "companyRating": null, "companyInfo": {"Website": "www.buzzfeed.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Media", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " BuzzFeed is looking for an experienced manager to lead and grow a team of data scientists through BuzzFeed’s next phase of growth. The right candidate for this role has a proven track record of solving problems, making data-driven decisions, and leading teams to do their best and most impactful work.  The person we are looking for is an experienced and proficient manager who embodies the way we want to work and collaborate. He or she is able to balance deep technical expertise with the knowledge that sometimes finding the right question to ask is the hardest part of a problem. We are looking for a person with tremendous curiosity and the follow through to drive themselves and their team to get to the bottom of important questions.  BuzzFeed’s data science team is diverse, coming from varying backgrounds, experiences, and skill sets. The team uses data-driven methods to power decisions, inform strategy, build robust data products, and identify opportunities for innovation across the company. We are true hybrids - software engineers, statisticians, mathematicians, domain experts and analysts - who specialize in translating questions into methodical approaches, experiments, and products. We think deeply about the limitations of data, and communicate our output coherently. Responsibilities:Provide accountability, goal-setting, and strong guidance for the data scientists on your team.Strengthen our relationship with other disciplines and departments through effective collaboration.Practice radical candor, giving direct and actionable feedback to the people you manage, as well as to the people you don’t.Take part in recruiting, including reviewing, shaping, and evolving our process, training team members to interview effectively, and proactively engaging candidates.Develop KPIs and measures of success in a cross-platform world.Lead development of data tools, including AB testing, prediction and classification based services.Scope appropriately pragmatic solutions to complex, unclear problems, with a focus on tractable approaches and actionable results.Communicate complex ideas in a clear, precise, yet accessible way to product, engineering, and editorial teams.Requirements:5+ years’ of industry experience building data products and deriving insights from large datasets.2+ years’ experience managing and mentoring data scientists of varied experience levelsExperience with media or consumer facing tech a plus.Expertise using both relational and nonrelational databases.Proficiency with analysis tools like R or Pandas and at least one scripting language (preferably Python).About BuzzFeed: BuzzFeed is the leading independent digital media and tech company delivering news and entertainment content to a global audience. We have offices in 19 cities around the world and more than 1600 employees including reporters, video producers, data scientists, engineers, brand strategists, and more. We fuse hard work and fun, through a culture of experimentation, teamwork, equality, and humble confidence. As an employee, you’ll enjoy perks like office events, snacks, career development courses, and no work on your birthday! We also offer traditional benefits that include medical, dental & vision insurance, 401K with a company match and parental leave. But most importantly, you’ll work with inspiring colleagues to build tools and create content that helps connect people all over the world."}