{"jobID": "2801840510", "jobLocation": "Madison_Heights_MI", "jobTitle": "Data Analyst - Schematics", "companyRating": null, "companyInfo": {"Website": "www.msxi.com", "Headquarters": "Detroit, MI", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Accenture, EY, SGS"}, "estimatedSalary": null, "jobDescription": " SUMMARY  MSX International is currently seeking a Data Analyst for our Schematics team, with data entry experience in a business setting where accuracy and speed are a must. This position requires great attention to detail, and proficient skills in the Microsoft office suite with a focus on Microsoft Excel. REQUIREMENTS ¿ Must have a High School diploma or equivalent.  ¿ Must have Excel and Access data management and application based Visual basic programming (working knowledge).  ¿ Must have problem solving skills, fast reading and self-motivated.  ¿ Ensure the delivery of timely and quality documentation, self-manage and prioritize tasks to ensure deliverables are achieved on time and to expected quality.  ¿ Accurately interpret engineering drawings and relevant technical data.  ¿ Manage technical documentation through the correct use of file templates, formats and structures.  ¿ Accurately interpret Client and Industry requirements to ensure accuracy of documentation. Conduct any necessary research to gather all relevant information.  ¿ Must be current on technology and new developments and report as necessary. OTHER QUALIFICATIONS Preferred candidates will also have some or all the following skill sets:  ¿ Ability to learn computer programs, and familiarity with website navigation.  ¿ Good oral and written communications skills.  ¿ Ability to work independently as well as in a team environment. PHYSICAL DEMANDS ¿ Must be able to work at a PC for 8 to 10 hrs. per day. WORK ENVIRONMENT ¿ Normal office working conditions.  ¿ The workstations are designed to be operational only from a seated position.  ¿ The noise level in the work environment is quiet to moderate."}