{"jobID": "2834146336", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst", "companyRating": "3.0", "companyInfo": {"Website": "www.gohealth.com", "Headquarters": "Chicago, IL", "Size": "Unknown", "Founded": " 2001", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": "Company DescriptionAt GoHealth, we provide innovative technology solutions for the future of health care. So far, we’ve helped millions of people access affordable health care. And now we’re looking toward the future: We want to revolutionize the health care industry. There's no doubt that health reform will continue to change our business. As millions more consumers enter the market looking for health care, we'll be here to help them find it.  Included in the Deloitte Technology Fast500, Crain’s Fast 50, Top 100 Digital Companies, and 101 Best Places to Work, GoHealth continues to attract the best in the business. With award-winning technology specialists, savvy project managers, customer-focused sales people, creative marketing professionals, and countless other vital team members, our business keeps growing because we’re all passionate about what we do.  At GoHealth, it's our employees who drive our success, which is why we understand the importance of corporate culture. We encourage a casual dress code to help everyone feel comfortable, and our corporate benefits are unparalleled. When you join #TeamGoHealth, you’ll receive unlimited vacation days, flex Fridays, subsidized gym memberships, and most importantly, unlimited career growth opportunities.Job DescriptionWe are seeking a high-energy, insightful data analyst to help us make better sales and marketing decisions to ensure that customers who need health insurance get covered. Up for the challenge? Read on.  You will be responsible for gathering, manipulating and reporting sales and enrollment statistics, as well as other data which will help you develop fulfillment recommendations based on what you find. You will be able to demonstrate a deep understanding of data gathering processes using disparate sources, analysis, trend identification and report development. You will have the opportunity to work with our databases, data collection systems, and reporting tools, as you help the company better understand both our existing customer base and the broader individual insurance market. Extract and transform raw data from various databases into meaningful and useful information to enable more effective strategic, tactical, and operational insightsWork with the Sales team to interpret data and develop recommendations based on findingsTroubleshoot problems with daily data-feeds within programs and reportsCreate accurate reports/queries by established deadlines and on an ad-hoc basisOther duties and responsibilities may be assigned to support the Sales teamQualificationsBachelors’ degree required, preferably in Engineering or Computer ScienceAt least 2 plus years experience in data analytics requiredAdvanced Microsoft Excel skills requiredSQL experience required / Non negotiableThe ability to write complex and efficient SQL queriesPython skills requiredDisplays strong conceptual and analytical skillsAbility to solve problems, develop work-around's, and craft intuitive reportsDisplays effective communication skills to all levels of management in both verbal and written formsAbility to think and work independently Additional InformationGoHealth offers a full benefits package, an open vacation policy, a very casual dress code and a fun, interactive working environment."}