{"jobID": "2803956384", "jobLocation": "Warren_MI", "jobTitle": "Leasing Consultant", "companyRating": null, "companyInfo": {"Website": "www.rocorealestate.com", "Headquarters": "Bloomfield Hills, MI", "Size": "501 to 1000 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Company: ROCO Real EstatePosition: Leasing ConsultantFLSA Status: Hourly, Non-exemptAbout ROCO:Founded in 2012, ROCO Real Estate is a privately owned and operated full service real estate investment and management company headquartered in Bloomfield Hills, MI. ROCO currently owns approximately 20,000 apartment units across 13 states and has over 500 employees. ROCO has a long-term hold strategy for our assets, which means that when we invest in real estate we are making a meaningful commitment. We have experienced record growth due to hiring the best professionals in the industry. ROCO makes significant investments in our employees and properties. We treat our residents and Investor partners the way we would want to be treated, if our positions were reversed.We are defined by our unique culture centered around young entrepreneurs making waves in an old industry. ROCOs greatest asset, and the key to our success, is our people. We focus on customer-service and reward impact.www.rocorealestate.comAbout This Position:Reporting to the Property Manager, the Leasing Consultant is responsible for effectively leasing and marketing efforts of the property. A leasing Consultant should see through the entirety of the leasing process from greeting guests in person and over the phone, promoting and selling the available units to prospects, meeting in person with prospects, and finally closing the sale by having the prospect sign a lease at our community. The leasing staff should have very high energy and passion to make a difference in the lives of our future and current residents. ROCO employees strive to provide the best customer service experience to all clients and customers.The link below is to complete the necessary pre-employment screening. Your results of this test will not hinder your eligibility to be hired, but will be used in conjunction with a resume and interview.Job Responsibilities:Provide outstanding customer service while addressing prospective residents, current residents, vendors and colleagues. Demonstrate a strong sense of pride and accountability for the community.Effectively show the community and model units to prospective residents. Apply product knowledge to clients needs by communicating the features and benefits; close the sale.Demonstrate a sense of urgency and strong customer service while guiding the prospective resident through the leasing and move-in processes, while adhering to the company procedures and ensuring compliance with Fair Housing requirements.Assist in lease renewal process; Distribute and follow-up on renewal notices to current residents in an organized and consistent manner.Maintain an accurate and updated inventory of apartments available to rent, list of prospective residents to conduct follow ups and list of current resident information concerning renewals.Assist other team members with maintenance service request and inform maintenance team in a timely manner. Ensure all maintenance repairs are handled satisfactorily by contacting residents with completed Service Requests on a weekly basis.Ensure clear and consistent communication between the Leasing Office team and the Maintenance team.Maintain marketing and advertising sources routinely; drive online and local presence. Monitor advertising effectiveness. Propose marketing strategies and social events for current and prospective residents.Comply with federal, state and company policies, procedures and regulations.Contribute to cleanliness and curb appeal of the community on continuing basis.Distribute company or community-issued notices to residents.Represent the company in a professional manner at all the times.Required Skills & Experience:1+ years experience in sales and/or customer service. Multi-family residential property management preferred.Knowledge and expertise of the Fair Housing laws and guidelines. Experience applying local state laws relative to Fair Housing.Strong organizational, written & verbal communication and time-management capabilitiesExperience using MS Excel and OutlookExperience using Yardi Voyager and/or Rent Café CRM preferredExperience with managing distressed properties preferredROCO is proud to provide its team members with:Comprehensive benefits package including affordable Medical, Dental & Vision plan options and 401(k) with employer-matched contributions.ROCO University delivers virtual, live and instructor-led training on topics relevant to the Property Management industry.Generous paid time off, including vacation, sick and personal time off, as well as paid holidays.Lucrative commission and bonus plans, dependent on position.Paid parental leave, Tuition reimbursement, Charitable donation program, Referral bonuses, Employee recognition programs and MUCH more!*The link below is to complete the necessary pre-employment screening. Your results of this test will not hinder your eligibility to be hired, but will be used in conjunction with a resume and interview: The link below is to complete the necessary pre-employment screening. Your results of this test will not hinder your eligibility to be hired, but will be used in conjunction with a resume and interview: http://www.ondemandassessment.com/verify/apply/mDSqADD/DwCDhnah"}