{"jobID": "2797463900", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.centerfield.com", "Headquarters": "Playa Vista, CA", "Size": "1001 to 5000 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "102000", "jobDescription": " The Analytics & Data Science team at Centerfield Media is looking for a highly-motivated, independent Data Scientist to join our growing organization.  Centerfield is an AI-powered marketing services company serving Fortune 500 companies in telecommunications, residential services, media and business services. Our technology platform, Dugout, powers our end-to-end solution by connecting online ad impressions all the way through an offline sale at a call center or through an online purchase. Job Description The Analytics & Data Science Team at Centerfield is responsible for descriptive analytics, predictive analytics, automated reporting and AI-powered solutions that maximize marketing performance and profitability for our clients. Some of the problems we work on include media buying, lead scoring, workforce management, speech analytics and agent performance. Responsibilities The Data Scientist will be responsible for developing statistical and machine learning solutions to business problems such as media buying, workforce optimization, agent performance, speech analytics and incentive programs. This position requires excellent business acumen and communication skills and the ability to manage your own process, from identifying and executing high-impact projects, to triaging external requests to collaborating with colleagues and business leaders. The top candidate will have excellent time management skills to bring projects to conclusion in time for results to be useful and be able to communicate proposals and results in a data-driven manner. Skills/Attributes RequiredBachelor Degree in Data Science, Analytics, Computer Science Engg., Systems Engg., Statistics, Mathematics or related degreeExperience of statistical analysis and tools such as SAS, R, or equivalent.2+ years of experience with relevant technologies, enterprise reporting systems, data analytics.2+ years of experience in working as an analytics or data engineering member working with cross functional teams.Experience working with data visualization tools and creating data visualization concepts. (Excel, Tableau, or similar)Skills/Attributes DesiredMaster Degree in Data Science, Analytics, Computer Science Engg., Systems Engg., Statistics with 3+ years of relevant experienceFamiliarity with AWS RedShift and other distributed computing technologiesWhy Centerfield?Competitive salary, and profit sharing bonus401k matchAward winning culture & unprecedented team spiritTake a break when you need it – unlimited PTOFully stocked break rooms with drinks, snacksPaid volunteer daysMonthly team games/competitions/catered lunchesTeam outings (Ball games, BBQ’s, Parties, etc.)Toro the Bull Dog Mascot and Everyone’s Friend"}