{"jobID": "2827654709", "jobLocation": "Garden_Grove_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.kushbottles.com", "Headquarters": "Santa Ana, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Manufacturing", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Data Analyst Company Overview: Kush Bottles, Inc. is a dynamic sales platform that provides unique products and services for both businesses and consumers in the cannabis industry. We are a dynamic and fast paced team working in an industry that is moving exceptionally quick. You will thrive in this environment if you seek a role where you want to have direct influence over the growth of our company, have an eagerness to learn, be a team player and willingness to be proactive. If so, we want to hear from you!  Founded in 2010 as a packaging and supplies company for dispensaries and growers, Kush Bottles regularly services more than 5,000 legally operated medical and adult-use dispensaries, growers, and producers across North America, South America, and Europe. The company has facilities in the largest U.S. cannabis markets and a local sales presence in every major U.S. cannabis market.  The company offers a unique, exciting and high energy environment for its employees to develop professionally while being a part of one of the fastest growing sectors globally. Kush Bottles was recently ranked #774 on the Inc. 5000 list of Fastest Growing Companies in America and has been featured in media nationwide, including CNBC, Los Angeles Times, TheStreet.com, Entrepreneur, and Inc. Magazine.  Job Summary  An individual who can think, eat, and breathe data. This person is responsible for understanding, cleansing, interpreting, and analyzing data to support our business. Kush Bottles is looking for a Data Analyst focused on creating and managing reports and reporting tools such as dashboards for the company's executives and management team. This position will have exposure throughout the organization and provide support to team leaders looking to use data to solve complex problems and optimize the business. Receives Direction From: Director of Marketing&Technology; Provides Direction to: No supervisory responsibilities Examples of Essential Functions: Responsibilities include, but are not limited to, the following: Build reports relating to sales performance, product movement and inventory management, operational efficiency, etc.Manage reports to ensure they remain relevant to the audiences as the company growsHandle all NetSuite reporting dashboard setup and dashboard related questions by leaders and employeesUpdate our monthly sales goal tracking dashboard, which will consist of 5 custom reports that need to be created each monthBe our in-house expert on NetSuite reports and saved searches and respond to all inquiriesBuild presentations with sales and marketing data for our monthly Sales&Operations; Planning meetingsWork with product marketing to pull data to help make decisions on which products to source and how to distribute the productsWork with digital marketing to pull custom lists for special targeted campaigns, and to measure the effectiveness of these campaignsWork with operations to report on effectiveness against certain metrics like on time delivery, QC time, labor usage, etc.Work with supply chain to report on vendor related metrics such as on time delivery as well as demand forecasting Qualifications Guidelines Experience working with business data related to sales or financeExperience with data mining and explorationAbility to manage and prioritize multiple projects with minimal supervisionAbility to work through problems and develop creative solutionsAbility to work through data quality issuesAbility to review data, find insights and anomalies, and explain them to stakeholdersGood communication skillsExperience with an enterprise level ERP or CRM systemAbility to navigate and understand our NetSuite ERP systemEducation/training/experience:2+ years' experienceBS degree in Data Science or a related fieldStrong analytical skills and data-driven thinkingUp-to-date with the latest trends and best practices in data management and visualizationKnowledge of:HTML, CSS, and SQLMicrosoft Office tools including Word, PowerPoint, and ExcelExperience with NetSuite or a similar enterprise ERP systemExperience with Tableau a plusPositive attitude, detail and customer oriented with good multitasking and organizational abilityPhysical Standards:This position requires frequently sitting, standing, reaching, walking, and handling/grasping of materials.Constantly sitting, standing, walking, and operating a computer workstation.This position may rarely require kneeling, bending, squatting.Must have finger dexterity, ability to use keyboard/ten key.Reach, stoop and lift office files, records or reports, typically weighing 20 pounds or less.Reasonable accommodations will be considered which would allow the employee to perform the essential functions of this job. Kush Bottles offers a competitive compensation package with medical, dental and vision benefits in addition to various paid time off and equity opportunity! We believe in our workforce having a personal interest as stakeholders in order to encourage ownership in the overall success of the company.  Kush Bottles is an equal opportunity employer striving to create a diverse workforce and will make reasonable accommodations as necessary for qualified applicants. Additional Info: Company Website: http://www.kushbottles.com  Instagram: http://www.instagram.com/kushbottles  Facebook: http://www.facebook.com/kushbottles  Twitter: http://www.twitter.com/kushbottles  LinkedIn: https://www.linkedin.com/company/kush-bottles"}