{"jobID": "2769054332", "jobLocation": "Glenview_IL", "jobTitle": "Associate Scientist, R&D; - Packaging", "companyRating": null, "companyInfo": {"Website": "www.kraftheinzcompany.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 2015", "Type": " Company - Public (KHC) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Our CompanyThe Kraft Heinz Company is revolutionizing the food industry – we will be the most profitable food company powered by the most talented people with unwavering commitment to our communities, leading brands and highest product quality in every category in which we compete. As a global powerhouse, Kraft Heinz represents over $26.5 billion in revenue and is the 5th largest food and beverage company in the world. At Kraft Heinz, to be the BEST food company, growing a BETTER world is more than a dream – it is our GLOBAL VISION. To be the best, we want the best – best brands, best practices and, most importantly, the best people.It's a Question of TasteDo more, be more. Whatever your aspirations, experience something exceptional at Kraft Heinz. We'll give you the freedom to determine your own direction and deliver in your own style. Outperform our expectations and you'll move forward faster than you ever thought possible. Come ready to dream. Come eager to grow.  Get a taste of what your career could be at kraftheinzcompany.com/careers.Job DescriptionRole / Title This is a Research and Development (R&D;) Packaging technical role leading and executing projects across our North American Refrigerated business. The candidate will be leading/executing packaging technical projects to meet business initiatives focused on growth/innovation, brand maintenance and quality improvement. This includes leading plant and lab based tests, detailed documentation of data, analyzing the data and building a viable path forward, communicating results to cross functional teams to gain alignment, and commercializing products. Communication and teamwork skills are essential in this role, which operates in a dynamic and cross-functional environment. The candidate must also be driven by a curiosity to build on a technical background and apply learnings / scientific principles to new situations. This position requires an individual to manage multiple projects concurrently with moderate levels of supervisor guidance. Exhibiting a collaborative mindset and applying innovative solutions are a must. Key Components of the roleWork with cross functional teams to execute projects across Refrigerated BU (Meat and Cheese)Translate research findings into meaningful business opportunities and communicate to cross-functional teamsExecute packaging testing, qualification and commercialization while working closely with cross-functional team members in laboratory and production environmentsAdapt / apply scientific principles to new situations and productsManage multiple assignments/R&D; projects concurrentlySpecification creation and updating, with attention to detailQualifications:BS/MS in Packaging, Chemical Engineering, Mechanical Engineering or related field0-2 years of experience in Packaging Development and commercialization (which can include internships)Basic understanding of key subject matter in areas such as packaging materials, pkg equipment/materials interaction, and new industry advancementsBasic understanding of the interrelationship of packaging, product, and processBasic understanding of packaging laboratory test methodsExcellent communication, influencing, and problem solving skillsManage multiple assignments/tasks concurrentlyBasic understanding of statisticsWillingness to travel 30% EEO Statement  Kraft Heinz is an EO employer - Minorities/Women/Vets/Disabled and other protected categories.Location(s)Glenview R&D; Center"}