{"jobID": "2823569706", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst *** Direct Hire *** $60", "companyRating": null, "companyInfo": {"Website": "www.allstaff.ca", "Headquarters": "London, Canada", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Data AnalystDo you have a forte for research data collection, statistical analysis and sensory data collection software projects? Discover a fulfilling DIRECT HIRE role with a software solutions provider in Chicago. Data Analyst will earn $60,000 and receive full benefits including Medical, Dental, Disability, Life Insurance, 20 paid days off and growth opportunities.Data Analyst Responsibilities:Utilize ARCS Research Panel Management software to program research screeners and direct the recruitment of consumersUse Compusense, RedJade, EyeQuestion and other sensory software to program research questionnaires and research dataUtilize SenPAQ, XLSTAT and other statistical software to conduct quantitative data statistical analysisServe as point of contact for technology/ software projects and inquiriesPrepare and summit raw data, research results and data summary tablesCoordinate qualitative data entry and analysis (open-end coding)Manage a small teamData Analyst Requirements:Associates Degree in Technology or Mathematics2+ years of experience in Technology or MathematicsExperience with Compusense, RedJade, EyeQuestion and other Sensory Software ProgramsThorough knowledge of SenPAQ, XLSTAT and/ or other Statistics Software ProgramsExperience with statistical analysis of consumer and sensory data a plusConsumer Packaged Goods industry experience is a plusExcellent written and verbal communication skillsProficiency with Word, Excel and PowerPointUnderstanding of applied statisticsHighly attentive to detailsWell-organizedTeam orientedAll candidates must be legally eligible to work in the United States without sponsorship and reside locally. Sorry, no Visa Sponsorships or Transfers are available. Consulting companies, staffing agencies and 3rd party recruiters need not apply.AllStaff IT & Engineering is an Equal Opportunity Employer."}