{"jobID": "2779779547", "jobLocation": "San_Francisco_CA", "jobTitle": "Online Marketing Manager", "companyRating": "3.6", "companyInfo": {"Website": "www.gooddata.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "101000", "jobDescription": " Rated 32nd Most Successful SaaS Company in the world by Montclare, GoodData is on a mission to fundamentally change how analytics are used and adopted throughout the organization. With more than 50 percent of the Fortune 500 using GoodData, millions of end users and a massively scalable and secure Enterprise Insights Platform, GoodData works with customers to drive a business outcome focus allowing data to finally drive meaningful change for the business..  Today, some of the most well-known brands are using the GoodData Enterprise Insights Platform to disrupt their industries, improve productivity and make business critical decisions, to create revenue generating Smart Business Applications. According to Forrester, insights-driven businesses will steal $1.2 Trillion/year from traditional market players by 2020. This is the transformation GoodData is enabling globally.  GoodData is headquartered in San Francisco and backed by top-tier investors like Andreessen Horowitz, General Catalyst Partners, Intel Capital, TOTVS and others. For more information visit our website and follow GoodData on Twitter and LinkedIn.  GoodData is growing and were seeking a Digital Marketing Manager in San Francisco. The ideal candidate has a deep understanding and proven track record in SEO, SEM, website management, marketing technologies, analytics, and multi-channel demand generation campaigns. Past B2B experience is required.  This role will be key to establishing customer and audience engagement through our website, SEO & paid media integrated campaigns and partnering with our sales team to support key account strategies through account-targeted programs. Key responsibilitiesOversee global paid search and display advertising marketing channels across Adwords, Bing and other pay-per-click platforms including paid Social. Optimize account performance through analytics, testing, and experimentation.Optimize website experience to improve conversion rates. Work closely with designers and back-end web developers to execute website optimization projects, including A/B and multivariate tests. Gather live user feedback through third-party web tools.Build and execute high-impact optimization strategies based on web, search and CRM analytics data.Work closely with SDR team to update on current and future campaigns and to gather input for on-going improvements.Drive strategy, execution, and optimization of multi-channel digital marketing programs to expand our marketing reach.Required skills4+ years of experience in Digital marketing for B2B SaaS companies.Proven track record of building and managing effective SEO/SEM programs.Experience working with SEO/SEM tools, website optimization tools, and Google marketing and analytics tools.Experience in managing SEM/SEO agencies.Experience with ABM (Engagio) a plus.Knowledge with testing establishing strategies, plans, and creative which drive increased engagement and conversion We are committed to creating a diverse work environment and proud to be an Equal Opportunity Employer. All your information will be kept confidential according to EEO guidelines.  No relocation assistance is offered for this opportunity at this time, and local candidates will be given priority consideration.  Agency Recruiters Take Note:  Please do not spam us with unsolicited candidate resumes. Unless you have a fully executed agreement with us, we will consider them a gift. Do not send resumes to any of the executives."}