{"jobID": "2830313442", "jobLocation": "Springfield_VA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Data Scientist Key Role: Perform as a data scientist with a focus on computer science and apply knowledge of distributed scalable Big Data store, including Accumulo, Cloudbase, HBase, Bigtable, and the MapReduce programming model. Leverage knowledge of and use statistical methods on large data sets to characterize uncertainty. Leverage knowledge of large data set analysis and perform research and ensure study results are properly interpreted and documented. Basic Qualifications:10+ years of experience with GEOINT domains5+ years of experience with developing software in Java, C, C++, or equivalent high level languagesKnowledge of automated integration testing in support of continuous integration and continuous delivery pipelinesBA or BS degree and 12 years of experience with developing and deploying software solutionsPreferred Qualifications:MS degree in CS, Physics, Statistics, or Mathematics preferred; PhD degree in CS, Physics, Statistics, or Mathematics a plusKnowledge of NGA and the intelligence community Clearance: TS/SCI clearance is required.  Location: Springfield, VA  TKO has a clear mission, to combine the drive of talented individuals with the expertise of seasoned professionals in an atmosphere of Integrity, Honesty, Excellence, Teamwork, and Innovation to deliver solutions to support our nation's defense. To achieve this, we are always searching for talented individuals who specialize in coming up with innovative solutions and facing difficult problems. At TKO, we are committed to finding and retaining passionate individuals who are innovative and conduct themselves with the highest levels of integrity and honesty. If you're a seasoned professional seeking a new career, innovative freedom in your tasks, a platform for your ideas, or a returning veteran looking to make an impact, see our open positions and apply today! In addition to receiving a competitive salary and having an equal opportunity for professional development and advancement, employees have access to benefits specifically designed to attract and retain talent. TKO supports a healthy work-life balance and offers a rich benefits package."}