{"jobID": "2729868823", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.windfalldata.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Unknown", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " At Windfall, our mission is to make the most accurate and comprehensive model of net worth. We currently work with 250+ organizations including nonprofits, financial institutions, universities, and Fortune 500 companies.  The data scientist role will perform analyses to understand and build confidence in our datasets and collaborate with engineering to scale our models to millions of households. As a member of the data science team, you will work with massive structured, unstructured, transactional and real-time data sets from a variety of sources and execute on plans to improve the accuracy of our data and models. Responsibilities Investigate new data sources, perform statistical analyses, and document findings Develop and improve predictive algorithms that are the core of the product Work with engineering and data vendors to improve the accuracy of our data sources Perform segmentation of households and build custom models for clientsRequirements Advanced degree in a quantitative discipline 2+ years of data science / analytics experience working in an environment with large, diverse data sets Expert knowledge of SQL and demonstrated experience with R or python Hands-on experience working with large data sets outside of a SQL database Collaborative team-focused attitude with a strong desire to advance the product and learn new things Self-starter with experience turning ideas into actionable designsBonus Experience auditing data with internal and external sources A track record of deploying code in a production environment Comfortable working in a dynamic, research oriented group Knowledge of consumer data space"}