{"jobID": "2552764887", "jobLocation": "Petaluma_CA", "jobTitle": "Senior Principal Scientist (Team Leader)", "companyRating": null, "companyInfo": {"Website": "www.valeant.com", "Headquarters": "Laval, Canada", "Size": "10000+ employees", "Founded": " 1960", "Type": " Company - Public (VRX) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Dow Pharmaceutical Sciences, Inc. is focused on development of topical drug products. A division of Valeant Pharmaceuticals North America, LLC, we are located in Petaluma, California, approximately one hour north of San Francisco. Job Overview: Serves as a primary technical advisor in Analytical Sciences for analysis of pharmaceutical active ingredients, excipients, and topical drug products. Enhances the company’s capability in analytical method development/validation and trains others. Has broad and in-depth understanding of analytical techniques to support testing of a range of small molecules and macromolecules. Has method development/validation experience to accurately assay active ingredients in complex formulation matrices and corresponding expertise to predict and quantitate degradation products Understanding of biomolecules and bioanalytical techniques is desirable. Develops and designs complex analytical experiments, investigative analytical lab plans, and performs insightful reviews of obtained data. Experience in applying ICH guidelines to ANDA and NDA submissions for dermal drug products is a plus. Has good communication skills, is well organized, efficient and adept in identifying key analytical project requirements and deliverables. Monitors the scientific progress, prepares protocols and technical reports. Ensures that laboratory work under the job candidate’s direction is scientifically sound and meets project objectives.  . Primary Responsibilities: • Serves as primary technical consultant / advisor for other chemists, scientists and management Directs (and performs, as needed) laboratory work and ensures deliverablesPrepares technical proposals and project budgetsProvides project leadership including technical progress and financial reviewServes as consultant / advisor to other scientists and managementPrepares technical reportsTrains individuals and develops training programsSupervises laboratory staffConducts laboratory investigations for anomalous results in a compliant and thorough manner Primary Functions: • Serves as a technical expert for pharmaceutical analysisDirects physical, wet chemical and instrumental analysis, including HPLC and GCDevelops technical proposals and estimates project costsKeeps current in new analytical capabilities and advises management on industry trends and business opportunitiesProvides expert interpretation of laboratory results and designs experimentsPrepares analytical reports and documentation for regulatory filingsEffectively communicates with managers on project status and solutions for problems encounteredProvides training, supervision and scheduling assistance for Technicians and ChemistsDevelops training programsMay lead laboratory safety programsContributes to patents and the scientific literature Job Requirements: • Pharmaceutical analysis expert with advanced trainingGood working knowledge of the pharmaceutical industry and regulatory requirementsAbility to exercise independent judgment based on the individual’s specialized skills in pharmaceutical analysisDemonstrated program management skillsGood laboratory technique and able to train othersAdvanced troubleshooting and method development skillsTechnical project leadership abilitiesSafety minded in performance of dutiesQuality minded with ability to perform work with accuracy and in accordance with established proceduresEffectively communicates with Manager, team members, and Senior ManagementOrganized and able to perform duties in a timely mannerAnalyticalInnovative Required Education/Experience/Training: Minimum: Bachelor’s or Master’s degree in chemistry or related scientific field with approximately fifteen years of experience in pharmaceutical analysis  Preferred: PhD degree in chemistry or related scientific field with at least ten years of experience in pharmaceutical analysis  **Senior title will be based on level of experience, candidate can be brought in at the scientist level*Recent PhD Graduates with biomolecules/bioanalytical/analytical expertise welcome to apply  Job Applicants should be aware of job offer scams perpetrated through the use of the Internet and social media platforms.  To learn more please read Valeant’s Job Offer Fraud Statement.  Valeant Pharmaceuticals International, Inc. is committed to leveraging the talent of a diverse workforce to create great opportunities for our business and our people. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status."}