{"jobID": "2827708279", "jobLocation": "Lawrenceville_NJ", "jobTitle": "Research Scientist", "companyRating": null, "companyInfo": {"Website": "www.eclaroit.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Contract", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Research ScientistLocation: Lawrenceville, NJDuration: 6 months (Potential extension or right to hire)Work Authorization: W2Pay Rate:$35/hrJob Number: 23878-1Be part of a company that delivers life-changing healthcare solutions. Eclaro is looking for a Research Scientist for our client in Lawrenceville, NJ.  Eclaro’s client is a leader in the Biopharmaceutical Industry, providing quality, innovative, and affordable medicines that make a difference in the lives of patients all over the world. If you’re up to the challenge, then take a chance at this rewarding opportunity! Qualifications:B.S. with clearly demonstrated skill set in oncology, immuno-oncology, or immunology is required.Attention to detail with excellent organizational and record keeping skills is a requirement.Excellent interpersonal skills with the ability to interact effectively with people, internally and externally is required.Expertise in isolation, characterization and functional assay development using primary immune cells of rodent and/or human origin is desired.An expert knowledge in the design, validation and execution of in vitro and ex vivo flow cytometry- and/or mass cytometry-based phenotypic and functional characterization of immune cell populations is desired.Tissue culture expertise is a must.Experience with ex vivo pharmacology, including common procedures including tissue processing is desired.Experience with a wide range of in-vitro cellular and biochemical assays, including cell culture, isolation of leukocyte subpopulations and experience with T cell and NK cell functional assays, western blotting, immunoprecipitation, ELISAs (MSD), reporter assays, siRNA/shRNA knockdown, and the ability to incorporate state-of-the-art techniques to enhance productivity would be highly desired especially as these skills apply to pharmacology-derived samples.Proficiency in utilizing scientific software such as Prism, GraphPad, Excel, etc. for data analysis and figure generation is required.Basic knowledge of the drug discovery process and independence in experimental/assay design, data analysis and problem solving.Working knowledge and experience with a wide range of technical skills relevant to the specific biology field.Experience meeting project goals and timelines.Good analytical and communication skills are essential to document and interpret experimental data and write reports.Experience working in a collaborative team environment is also desirableIf hired, you will enjoy the following Eclaro Benefits:401k Retirement Savings Plan administered by Merrill LynchCommuter Check Pretax Commuter BenefitsEligibility to purchase Medical, Dental & Vision Insurance through Eclaro If interested, please send your updated resume to Junethel.Binuya@eclaro.com or call (212)804-7476. Equal Opportunity Employer: Eclaro values diversity and does not discriminate based on Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status."}