{"jobID": "2790843031", "jobLocation": "Oakland_CA", "jobTitle": "Health Data Research Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.westcoastcc.org", "Headquarters": "Oakland, CA", "Size": "Unknown", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Non-Profit", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": "APPLY NOW!The Health Data Research Analyst serves as an organizational data expert for the Research Department, supporting projects that require analysis of client outcome data. The position collaborates internally with stakeholders including clinical Program Directors, IT staff and Executive Management to identify, analyze and interpret trends or patterns in client data sets. This role requires the ability to meet deadlines, multi-task and problem-solve using appropriate technology to analyze multiple data sets from different sources. The position also requires strong interpersonal, written and verbal communication skills to convey complex analysis results clearly and with conviction to all levels of stakeholders.As the Health Data Research Analyst, you will:Data Management and AnalysisExtract and clean data, conduct data exploration, and present visualizations of the data using multiple platforms.Analyze client data to identify ways of measuring outcomes that support agency performance improvement efforts. Runs descriptive statistics and other statistical procedures as required; generates graphs and tables.Manages and edits data collection instrumentsDocumentation and Research DevelopmentExplains findings and presents to clinical experts, policy experts and non-technical audiences.Documents technical specifications of data for all research work.Edits a variety of technical manuscripts, correspondence, memos, reports, charts, and grants; makes copies; collates, assembles and distributes reports, documents and/or funding grants.Research ActivitiesPerforms literature searches via MEDLINE, PubMed, PsychInfo (online).Identifies articles pertinent to WCC research and evaluation activities and distributes and files as appropriate.Maintains bibliography of current psychological or behavioral health research articles and journals.Obtains informed consent and collects data from participants for research studies.Performs project management for research projects with multiple stakeholdersOtherMaintains procedure manuals and protocols for all research and evaluation projects.Demonstrates behaviors in concert with the Clinic’s mission, values, policies and procedures.Supports performance improvement activities.Maintains competence and professional development.Performs other duties as requested.The ideal candidate has:Bachelor’s degree in public health, psychology, social work, sociology or related social science field required.Experience with clinical research preferred.Familiarity working in a public health setting with children, adolescents and their families preferred.Knowledge of computers and experience with Mac and PC-based platforms.Statistical analysis experience with the ability to see through complex data and find conclusions.Proficiency with Excel and software such as Stata, SPSS, FileMaker Pro, Microsoft Office for statistical analyses, charts, graphs, spreadsheets, presentation, email, and database management.Experience with database development, entry, and quality control procedures.Prior experience working with electronic health record (EHR) system such as Welligent, and Stata statistical software highly desirable.Experience with statistical modeling techniques, such as factor analysis, survival analysis, and multi-level modeling highly desirable.Ability to organize and effectively process and maintain records and files.Ability to plan and organize detailed projects with multiple tasks and deadlines.Experience working in multidisciplinary teams.Consistent and reliable with strong interpersonal skills.Position Details and Compensation:This is a full-time position reporting to the Director of Research and Evaluation. Salary DOE, and includes competitive benefits package, 403(b) plan, and performance-based compensation.Benefits:Performance-based compensation and retirement plan contributionEmployer paid medical, dental, vision, life, and long-term disability coverage403b optionFlex-spending options20 days paid time off per yearContinuous professional development and supportVarious in-house training on modalitiesCasual work environment that is professional and supportiveAPPLY NOW!WestCoast Children’s Clinic is an equal opportunity employer. We are committed to diminishing the influence of privilege and discrimination in our field and our workplace, whether due to differences concerning age, citizenship, color, disability, marital or parental status, race, religion, gender or sexual orientation. www.westcoastcc.org #mc_embed_signup{background:#fff; clear:left; font:14px Helvetica,Arial,sans-serif; }  /* Add your own MailChimp form style overrides in your site stylesheet or in this style block.  We recommend moving this block and the preceding CSS link to the HEAD of your HTML file. */"}