{"jobID": "2537250524", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.shift.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "187000", "jobDescription": "About ShiftWe believe car buying should be fun, fair, and accessible to everyone. Weve set out to transform an industry, using technology to bring transparency and convenience to the car buying process.And we arent stopping there. We aim to bring that same transparency and convenience to car ownership too, with payments, maintenance, and insurance in one easy app. At Shift, were building the tools that empower people to buy, own, and sell the cars that make life go.Shift is bringing transparency and trust to the used car industry. Data is core to this transformation, from building best-in-class pricing, to loan decisioning, to logistics optimization, to in-product recommendations. If youre passionate about using data to fix an enormous, antiquated industry, youll fit right in.The DataMillions of cars are bought and sold in the US every year, but knowing exactly how much your car is worth is a challenge. We believe that fixing the used car industry requires providing customers with fair, detailed pricing reports in beautiful, easy-to-understand interfaces. By combining as much data as we can get our hands on, from the millions of listings available online, to car auction sales, to every vehicles specific repair history, were building the most accurate, transparent pricing tool in the industry.The ImpactAs a two-sided marketplace, serving both car buyers and sellers, our vehicle data and pricing models are core to the business. As one of the first data scientists at Shift, youll have a direct, immediate impact on the success of the company. Initial projects will include exploring data, building models, informing product decisions, overseeing experiments, and collaborating closely with engineers on our pricing team. Over time, youll play a crucial role in growing and mentoring a team of data scientists that will be involved in nearly every initiative at Shift, including lending, fraud, lead scoring, user acquisition, optimal resource allocation, vehicle routing, and more!The TeamWe are a friendly, helpful community of engineers with a diverse background of experience. We espouse autonomy, trust, and learning from each other. The engineering team is excited to have grown to the capacity to support our growing data science team. We believe that embedding data science into our engineering team provides a unique opportunity for significant autonomy and influence fully supported by the engineering resources you need.We're looking for someone who will: Build and own our data science models in collaboration with the engineering and business teamsGuide our data acquisition strategy and prioritiesSuggest, run, and analyze experiments across the companyHelp develop and mentor a team of data scientistsHelp develop our data architecture, and work with our engineering team to guide our build out of data pipelines and machine learning infrastructureThe ideal candidate will have:Knowledge of machine learning techniques, especially intuition for their benefits and drawbacks in real-world applicationsExperience wrangling data to explore new model features, build visualizations, and clean data3+ years of experience working as a data scientist and experience working with multiple data architectures in productionProficiency in a statistical computing language (such as R or Python) and SQL.Strong knowledge of statistics and experimental designCuriosity, desire to learn, passion for providing a great product to customersExperience mentoring other data scientists, as well as excitement at being an individual contributor to startBonuses (but please still apply even if you dont have them!):Production engineering experience. If you have engineering experience, thats great, and basic coding skills are a must, but youll also be strongly supported by engineering for the heavy lifting, code-wise.Experience with automotive data. Love cars? Great! Never bought or owned a car? Also great! Weve got car experts you can learn from.If youre not sure you fit all these descriptions, please still apply! We hire people, not lists of requirements, and wed love to talk to you!On diversityOur company depends on balance and equality between buyers and sellers, among employees, and in our relationships with customers.Our mission to evolve car ownership and transform an industry is a challenging one. It can only be achieved by a team of diverse problem-solvers engineers, designers, business people from the same broad demographics as our customers.Why join now?Weve built a small but highly talented team backed by $120 million in funding from investors like DFJ, Goldman Sachs, and BMW iVentures. Weve got product-market fit, but theres still a ton of room to innovate and make your mark on the product and on the company.Shift is the Bay Areas #1 seller of used cars with $100 million in cars sold per year. Were serving most of California and are gearing up to scale to new markets. With a solid business model and no clear winner in our space yet, this is a hugely exciting time to join the team."}