{"jobID": "2808498264", "jobLocation": "San_Mateo_CA", "jobTitle": "Data Scientist", "companyRating": "4.4", "companyInfo": {"Website": "www.coupa.com", "Headquarters": "San Mateo, CA", "Size": "501 to 1000 employees", "Founded": " 2006", "Type": " Company - Public (COUP) ", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " SAP Ariba, SAP Concur, Oracle"}, "estimatedSalary": "160000", "jobDescription": "Coupa Software (NASDAQ: COUP), a leader in business spend management (BSM), has been certified as a Great Place to Work by the Great Place to Work organization. We deliver Value as a Service by helping our customers maximize their spend under management, achieve significant cost savings and drive profitability. Coupa provides a unified, cloud-based spend management platform that connects hundreds of organizations representing the Americas, EMEA, and APAC with millions of suppliers globally. The Coupa platform provides greater visibility into and control over how companies spend money. Customers small, medium and large have used the Coupa platform to bring billions of dollars in cumulative spend under management. Learn more at www.coupa.com. Read more on the Coupa Blog or follow @Coupa on Twitter.Do you want to work for Coupa Software, the world's leading provider of cloud-based spend management solutions? Were a company that had a successful IPO in October 2016 (NASDAQ: COUP) to fuel our innovation and growth. At Coupa, were building a great company that is laser-focused on three core values:Ensure Customer Success Obsessive and unwavering commitment to making customers successful.Focus On Results Relentless focus on delivering results through innovation and a bias for action.Strive For Excellence Commitment to a collaborative environment infused with professionalism, integrity, passion, and accountability.At Coupa, data is a strategic part of the product vision. With Coupa being the only player in this industry, that has access to rich community data, this is a ground level opportunity to build impactful data products. Apart from the data advantage, you will be part of a highly collaborative and fun environment, with product and application teams eager to lend their support in data science experiments.Responsibilities:Work with product managers, other engineers to devise right metrics & measurements supporting product features or functionalityIdentify & gather data, cleanse and transform as neededDesign experiments, build machine learning models & visualizations to iterate and arrive at the desired resultsDevise and automate processes to monitor quality of the models and results Requirements:Strong problem-solving skills with an emphasis on product development.Experience using python to manipulate data and draw insights from large data sets.Experience working with and creating data architectures.Knowledge of a variety of machine learning techniques (clustering, decision tree learning, neural networks, etc.) and their real-world advantages/drawbacks.Knowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests, and proper usage, etc.) and experience with applications.Excellent written and verbal communication skills for coordinating across teams.A drive to learn and master new technologies and techniques.5-7 years of experience manipulating data sets and building statistical models, has a Masters or Ph.D. in Statistics, Mathematics, Computer Science, or equivalent experienceCoding knowledge and experience with several languages: Python, JavaScript, Java etc.Knowledge and experience in statistical and data mining techniquesExperience with python machine learning stack (Scikit-learn, Pandas etc)Experience with distributed data/computing tools like Spark, Hadoop.Experience visualizing/presenting data for stakeholders using Matplotlib, D3 or other visualization toolsAt Coupa, we have a strong and innovative team dedicated to improving the spend management processes of todays dynamic businesses. Its our people who make it happen, and we strive to attract and retain the best in every discipline.We take care of our employees every way we can, with competitive compensation packages, as well as restricted stock units, an Employee Stock Purchase Program (ESPP), comprehensive health benefits for employees and their families, a 401(k) match, a flexible work environment, no limit vacations for exempt employees, non-exempt employees are on an accrual basis for PTO, catered lunchesAnd much more!As part of our dedication to the diversity of our workforce, Coupa is committed to Equal Employment Opportunity without regard for race, ethnicity, gender, protected veteran status, disability, sexual orientation, gender identity or religion.Please be advised, inquiries or resumes from recruiters will not be accepted."}