{"jobID": "2837902742", "jobLocation": "Austin_TX", "jobTitle": "Executive Assistant - Executive Assistant, Biomedical Data Sciences Hub, Dept of Population Health", "companyRating": "4.3", "companyInfo": {"Website": "www.utexas.edu", "Headquarters": "Austin, TX", "Size": "10000+ employees", "Founded": " 1883", "Type": " College / University", "Industry": " Education", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "53000", "jobDescription": " Executive Assistant - Executive Assistant, Biomedical Data Sciences Hub, Dept of Population Health Hiring department Medical SchoolMonthly salary $5,000+ depending on qualificationsHours per week 40.00 Standard from 800AM to 500PMPosting number 18-07-03-01-9010Job Status OpenFLSA status ExemptEarliest Start Date ImmediatelyPosition Duration Funding expected to continuePosition open to all applicantsLocation Austin (main campus)Number of vacancies 1 General NotesNone provided Required Application Materials  A Resume is required in order to apply A Letter of Interest is required in order to apply. A List of 3 References is required in order to apply. Additional Information  PurposeTo provide programmatic, analytical and superior executive support to Director of the Biomedical Data Sciences Hub at the UT Austin Dell Medical School. Essential FunctionsManage a complex schedule for the Director with fluid reprioritizations that will often require independent decision-making. Schedule appointments and meetings, coordinate resources and assemble appropriate reference and back-up material for all meetings. Arrange room reservations, catering, and all other necessary logistical details. Coordinate travel arrangements for the Director, faculty/staff and invited visitors. Develop itineraries, book flights, handle arrangements for ground travel, reserve meeting facilities, hotel and other necessary arrangements. Manage and process reimbursements. Assist with faculty and staff recruitment including scheduling interviews, collecting and processing applications and required forms, and collecting interviewer feedback on candidates. Develop itineraries for candidates, book flights, arrange ground travel, hotel and other related items. Manage and process reimbursements. Process and track prospective faculty appointment requests, dossiers and paperwork in centralized systems Perform high-level administrative duties such as managing office projects using tasks lists, including creating, designing and implementing processes and procedures utilizing current technology. Maintain accurate and professional correspondence logs, files, information databases, and other tracking systems as necessary. Coordinate purchase of supplies and equipment. Prepare routine, well-written correspondence for distribution and prepare correspondence on behalf of the Director. Ensure that fast-paced office is organized and that all critical areas are covered; plan for contingencies and anticipate potential problems. Maintain confidentiality as appropriate when dealing with sensitive information Assist with special projects and other tasks as related business needs arise. Maintain broad organizational perspective to effectively carry out internal and external relationships of the Department. Marginal/Incidental functionsOther related functions as assigned. Required qualificationsBachelor's degree and at least five years of experience with advanced administrative functions, particularly calendar management and other support directly for senior executives. Effective communicator with excellent oral, written, and interpersonal communication skills. Demonstrated problem-solving and critical thinking skills. A self-starter - ability to work efficiently and flexibly in a fast-paced environment with minimal guidance. Outstanding organizational and time-management skills. Highly detail-oriented. Professional demeanor with tact and respect at all times. Ability to address individuals and information with a high degree of sensitivity and confidentiality in various delicate, formal or urgent situations. High level of proficiency with Microsoft Office programs: Excel, PowerPoint, Word, Outlook, Visio, etc. Equivalent combination of relevant education and experience may be substituted as appropriate. Preferred QualificationsExperience at UT Austin. Start-up experience in any sector. Experience in health care delivery or biomedical research or related settings. The Dell Medical School is especially interested in qualified candidates who can contribute to diversity and excellence within the learning health system. At the Dell Medical School we strive to create a vital, inclusive health ecosystem. To ensure alignment, we follow these fundamental values: https://dellmed.utexas.edu/culture. Working conditionsMay work around standard office conditions Repetitive use of a keyboard at a workstation Use of manual dexterityA criminal history background check will be required for finalist(s) under consideration for this position.  The retirement plan for this position is Teacher Retirement System of Texas ( TRS ), subject to the position being at least 20 hours per week and at least 135 days in length.  The University of Texas at Austin, as an equal opportunity/affirmative action employer, complies with all applicable federal and state laws regarding nondiscrimination and affirmative action. The University is committed to a policy of equal opportunity for all persons and does not discriminate on the basis of race, color, national origin, age, marital status, sex, sexual orientation, gender identity, gender expression, disability, religion, or veteran status in employment, educational programs and activities, and admissions.  If hired, you will be required to complete the federal Employment Eligibility Verification form, I-9. You will be required to present acceptable, original documents to prove your identity and authorization to work in the United States. Information from the documents will be submitted to the federal E-Verify system for verification. Documents must be presented no later than the third day of employment. Failure to do so will result in dismissal.  UT Austin is a Tobacco-free Campus"}