{"jobID": "2837982621", "jobLocation": "Saginaw_MI", "jobTitle": "Data Systems Analyst (SQL)", "companyRating": "2.4", "companyInfo": {"Website": "www.morleynet.com", "Headquarters": "Saginaw, MI", "Size": "1001 to 5000 employees", "Founded": " 1863", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "50000", "jobDescription": " Data Systems Analyst (SQL)  Apply for this Position  We're now hiring a Data Systems Specialist with SQL experience to work in our Saginaw, Michigan, office.  Do you want to advance your career with a growing company? Do you want to join a close-knit team dedicated to success? Then start your application to become aat Morley.  At Morley, we are dedicated to staying on the forefront of information technology and will give you the tools to succeed in your role. We are one of the fastest-growing private companies in Michigan and are looking for a Data Analyst skilled in systems configuration to join our talented IT team. Data Systems Analyst Responsibilities:Configuring, maintaining, troubleshooting and providing general technical support for the various enterprise systems used in our Human Resources, Payroll&Benefits;, and Accounting groupsCreating data systems integration processes using available toolsDesigning, developing, testing, deploying and maintaining enterprise systems reporting solutions using SQL Server Management Studio toolsPublishing and deploying production reports to internal and external customers via SSRSCreating, using and maintaining stored procedures in SQLCreating advanced Excel formulas for data reporting purposesData Systems Analyst Requirements:Bachelor's degree preferred (industry expertise/knowledge and job-related experience in lieu of educational requirements)Microsoft Office proficiencySQL knowledgeApplication configuration experienceProcess and detail orientedA positive self-starter with a solid work ethic, ability to meet deadlines, strong organizational skills and excellent interpersonal skillsData Systems Analyst Benefits:Full-time permanent position with room to advanceExcellent medical, life, dental and vision insurance for you and your family401(k) with percentage matched by MorleyPaid time offFun work environment annual car show, event/sport/concert tickets, spirit days, luncheonsFree workout classes and gyms get paid to work out with Morley!About Us: Morley has been serving customers for over 150 years, thriving in fast-paced work environments and continually expanding business operations. We employ over 2,500 associates worldwide and have multiple locations across the United States. Morley is a leader in Meetings&Incentives;, Business Process Outsourcing, and Exhibits&Displays.; Our teams serve Fortune 500 brands in industries such as automotive, chemical, finance, insurance, health care, technology and communications."}