{"jobID": "2808015510", "jobLocation": "Princeton_NJ", "jobTitle": "Drug Metabolism Principal Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Position Description and Responsibilities: The major responsibility will be investigation and characterization of ADME properties of drug candidates in early and late development. The candidate will have extensive experience in in vitro comparative metabolism, definitive reaction phenotyping and enzyme kinetic studies; in vivo metabolite profiling (including human ADME); application of MIST guidelines and determination of major routes of excretion. Expertise in LC-MS/MS radio-profiling and structure identification is highly desirable. Familiarity with investigational whole body autoradiography to examine parent/metabolite distribution and hypothesis-driven enzyme-transporter interplay studies is preferred. The candidate will work closely with Drug Safety Evaluation, Clinical Pharmacology and Bioanalytical Sciences with a focus on problem solving to formulate strategies and influence decision making in advancing drug candidates toward registration. Responsibilities will also include incorporating all nonclinical data into safety and clinical plans; prospective DDI prediction, study planning, data interpretation and refinement of overall DDI package; special populations study recommendations, planning and interpretation; and contribution to nonclinical PK sections of IND/IB/NDA documents. The candidate will be expected to be involved in research activities and supervise and mentor junior Ph.D. and associate scientists. They will keep abreast of the literature and will actively pursue opportunities for publication and presentation.  Position Requirements:  Ph.D. in Pharmaceutical Sciences such as Medicinal Chemistry, Drug Metabolism or Pharmacokinetics with 8 to 10 years of relevant industrial experience. Demonstrated problem solving experience and training in drug metabolism and disposition concepts and assays, impact of enzymes and transporters on ADME characteristics; and metabolite structure elucidation is required. Excellent interpersonal and communication skills (written and oral) are mandatory to be successful in a matrix team environment."}