{"jobID": "2819064536", "jobLocation": "Arlington_VA", "jobTitle": "Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.aptima.com", "Headquarters": "Woburn, MA", "Size": "51 to 200 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "99000", "jobDescription": " Aptima is a fast-paced, employee-focused small business that excels in finding solutions to complex problems surrounding human performance. Aptima currently has an opening in its Learning and Training Systems (LTS) Division for an experienced, creative data scientist to help develop big-data applications, especially in relation to training and education. In this position you will help to develop and augment tools and solutions that personalize learning experiences for individuals and teams by engaging in the following activities: Design, develop, and apply data science, machine learning, and artificial intelligence techniques to solve real-world training challengesCollaborate with software engineers and social scientists to implement, test, and apply mathematical algorithms from researchEngage in business development activities, proposal writing, project management, and customer interactionMinimum Requirements and Experience:US CitizenMinimum of a Masters in Computer Science, Data Science, Statistics or Applied MathematicsMinimum of 3 years of experience collaborating with software engineers, mathematicians, social scientists, and military personnelMinimum of 3 years of experience working with Department of Defense and other government agenciesProblem analysis, mathematical formulation, algorithm development, and model implementation and validationMachine learning techniques (e.g., Probabilistic Graphical Models, Reinforcement Learning, Deep Learning) and experience using machine learning or optimization to build computational models from large data setsSoftware/data design methods, data structures, and modeling standardsEducational Data Mining (EDM) or Artificial Intelligence planning techniques for the optimization of trainingSoftware engineering experience implementing and coding complex algorithms and models in a programming language (C++, C#, Python, Java or Scala)Excellent written and oral communication skills All applicants selected will be subject to a background investigation and must meet eligibility requirements for access to classified information.  Aptima, Inc. participates in the US Government E-Verify Program. For more information, click on http://www.uscis.gov/e-verify.  EOE MINORITIES/FEMALES/PROTECTED VETERANS/DISABLEDSDL2017"}