{"jobID": "2783125793", "jobLocation": "Alexandria_VA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.bayst.com", "Headquarters": "Bowie, MD", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Bay State Computers, Inc. is a professional services firm and a leading provider of Information Technology (IT) services and products to the U.S. Federal Government and Industry. Bay State brings together experienced IT professionals and the latest state-of-the-art technology tools, practices, and products to support projects and task order requirements for our customers. For more information about Bay State visit our website, connect with us on LinkedIn, or follow us on Twitter.  We have an exciting opportunity for a Data Analyst to join our team. Key Responsibilities:Work under minimal direction; may lead small teams.Elicit, document, manage, and validate data requirements/specifications; using high-maturity methods, processes and tools.Conduct research on solutions to data problems; advise on methods to improve data related business processes.Produce Entity-relationship diagram (ERD) and Data Flow Diagram (DFD), user experience and configuration elements of solution design.Participate in proposals, feasibility studies, and new business development.Produce data dictionary for complex database and projects.Write complex database query, simple DB procedures, functions or packages to pull relevant data for analysis.Produce reports with medium complexity.Produce simple dimensional modelsRequired Experience/Skills:6 or more years’ experienceAbility to: Produce data dictionary, physical and logical data model.Utilize DB tools and IDE to write complex database query, produce reports with medium complexity and prepare the date model.Abstract detailed information; apply creativity for solving complex problems.Display superior verbal / written communication.Build internal and external relationships and work collaboratively to manage scope, schedule, budgets and expectations.Experienced with the normalization process for data modelsExperienced with RDBMS.Familiarity with structured analysis techniques (decomposition).Candidate must be a US citizenBenefits: Full-time employees (permanent or contract employees who are employed for a term greater than 6 months) are eligible for benefits including time-off benefits, such as vacations and holidays, and insurance and other plan benefits. Location: Alexandria, VA Bay State Computers, Inc. is an Equal Opportunity/Affirmative Action Employer. All qualified candidates will receive consideration for this positionregardless of race, color, creed, religion, national origin, age, sex, citizenship, ethnicity, veteran status, marital status, disability, or any other characteristic protected by applicable law."}