{"jobID": "2831222950", "jobLocation": "Chicago_IL", "jobTitle": "Director Analytics Consulting - Federal Employee Program", "companyRating": "3.2", "companyInfo": {"Website": "www.hcsc.com/careers/index.html", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1936", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable", "Competitors": " UnitedHealth Group, Aetna, Humana"}, "estimatedSalary": "118000", "jobDescription": "Job ID: BDP-1025764 Description: At HCSC, building a talent engine for the future is a key priority because we recognize that as our business evolves to reflect the changing world, we must adapt our workforce to meet this challenge. Additionally, with \"excellence\" one of our core values, we are focused on improving our success measures and delivering the best possible customer experience. Job Purpose: This position is responsible for planning, managing and controlling the activities of the department that provides business intelligence support for business segments; leading initiatives to analyze complex business problems and issues using data from internal and external sources; bringing expertise or identifying subject matter experts in support of multi-functional efforts to identify, interpret and produce recommendations and plans based on company and external data analysis; advising business by providing data based strategic direction to identify and address business issues and opportunities; ensuring that policies and procedures align with corporate vision; selecting, developing and evaluating personnel ensuring efficient operation of the function. Responsible for leveraging analytics to solve the business emerging challenges; and aiding tactical decision making by using predictive and prescriptive modeling. JOB REQUIREMENTS:Bachelor Degree in Business, Economics or Math and 7 years experience in a position which requires a combination of management expertise, healthcare consulting background, data analysis and information reporting relating to healthcare data OR 2 or more advanced degrees and 6 years of work experience in a position which requires a combination of management expertise, healthcare consulting background, data analysis and information reporting relating to healthcare data OR 11 years experience in a position which requires a combination of management expertise, healthcare consulting background, data analysis and information reporting relating to healthcare data.Management experience.Interpersonal, public relations, facilitation, management, decision making, collaboration, and organizational skills.Experience in building and managing a highly efficient team of Health insurance analysts.Knowledge about the healthcare payer industry.Analytical and quantitative problem solving skills.Experience connecting business requirements to data mining objectives and measure business benefit.Knowledge of statistical modeling/predictive modeling/machine learning/data mining/optimization and big data concepts.Clear and concise verbal and written communication skills.Preferred Job Qualifications:Experience with Federal Employee Benefit Program Administration with Finance Management focus HCSC is committed to diversity in the workplace and to providing equal opportunity and affirmative action to employees and applicants. We are an Equal Opportunity Employment / Affirmative Action employer dedicated to workforce diversity and a drug-free and smoke-free workplace. Drug screening and background investigation are required, as allowed by law. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status.  Requirements: Expertise Analytics & Reporting Job Type Full-Time Regular Location IL - Chicago, TX - Richardson, MT - Helena, OK - Tulsa, NM - AlbuquerqueSDL2017"}