{"jobID": "2837747077", "jobLocation": "Dallas_TX", "jobTitle": "Clinical Research Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.texashealth.org", "Headquarters": "Arlington, TX", "Size": "10000+ employees", "Founded": " 1997", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Baylor Scott & White Health, UT Southwestern Medical Center, Methodist Health System"}, "estimatedSalary": "73000", "jobDescription": "Qualifications/Duties: Texas Health Physicians Group is seeking a Research Data Analyst to perform clinical data collection and management (CDM) activities and operations for new and ongoing clinical research development studies. Location and Hours: Texas Center for Joint Replacement - Plano  Monday-Friday 8:30am-5:00pm Education: Bachelor's Degree required  Master's Degree preferred Experience: Four years of clinical research experience with a strong understanding of specified functional area Licenses and Certifications: CCRC - Certified Clinical Research Coordinator required upon hire Skills and Abilities: Solid understanding of the implications of applicable laws and regulations governing Clinical Research.  Extensive Clinical Data Management knowledge required.  Excellent verbal and written communication skills and interpersonal skills.  Ability to work in team environment.  Maintains a positive, caring attitude towards patients.  Possesses a strong work ethic and a high level of professionalism. Essential Functions: Participates in or leads the review of clinical documents (e.g., protocols, reports, data management and statistical analysis plans) by interacting with various groups. Plans and designs source documents for study protocols as required.  Leads data collection and management activities, drafting Data Management Plans and Data Review Plans as required. Ensures adverse events (AE) are identified and reported per protocol compliance and the archiving of study databases and related documents by following established guidelines.  Leads the development of data management reports of clinical data. Leads the preparation and presentation of data management activities by evaluating and testing new systems.  Leads Clinical Data Management activities by using Clinical knowledge, data listings and manual review of eCRFs to issue queries and clean data as required. Contributes to the monitoring of data quality during study conduct. Provides information on issues along with proposed solutions.  Responsible for implementing and maintaining the effectiveness of the quality system.  Ensures data snapshots are ready for analysis by following established guidelines.  Participates in the design, administration and monitoring of clinical trials.  Updates and reviews regulatory documents.  Performs other duties as assigned. Entity Information: Texas Health Physicians Group (THPG) includes more than 800 physicians, nurse practitioners and physician assistants dedicated to providing quality, patient-safe care at more than 240 offices located throughout the DFW Metroplex. THPG members are active in group governance and serve on multiple committees and councils. Ongoing Texas Health initiatives, like the Diversity Action Council and Living the Promise, have helped to create an inclusive, supportive, people-first, excellence-driven culture and workplace, making THPG a great place to work"}