{"jobID": "2836366271", "jobLocation": "San_Diego_CA", "jobTitle": "Associate Scientist II", "companyRating": "4.3", "companyInfo": {"Website": "www.illumina.com", "Headquarters": "San Diego, CA", "Size": "5001 to 10000 employees", "Founded": " 1998", "Type": " Company - Public (ILMN) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Thermo Fisher Scientific, Roche"}, "estimatedSalary": "84000", "jobDescription": " As an Associate Scientist within Illuminas Clinical Genomics Product Development organization, you will work as part of a multi-disciplinary team to ensure clinical products meet their stated claims, continuously meet global regulatory standards, meet customers expectations, and remain competitive in the markets they serve.The foundation for this role is a solid grasp of molecular biology. Experience in clinical diagnostics assays and assay/systems integration is desirable.Tasks and ResponsibilitiesAs part of the Clinical Genomics Product Support team, contribute to ongoing investigations, including elevated complaint investigations and CAPAs, and design changes for product improvements.Own a body of experiments to address technical questions that move a project or investigation forward. Examples include: understanding and characterizing stability, robustness, and performance of an assay. Plan, design, and execute the experiments with limited oversight.Perform experiments, keep detailed lab notebook, perform data analysis, draw conclusions and define next steps, write reports and present results and updates to manager and teams as neededCollaborate with quality engineers, product marketing, assay development scientists, manufacturing, hardware engineers, and software engineers as needed in supporting scientific studies aimed at sustaining on-market productsCommunicate results and conclusions to aid in team decision making in a fast paced environmentManage goals and duties within defined target timeframesRequired Skills & ExperienceBachelors in biochemistry, molecular biology, genetics, genomics, bioengineering or related field with minimum 6 years of product development experience or Masters in the same fields with minimum 3 years of product development experience.Demonstrated laboratory experience with clinical samples, sample preparation and PCR workflows and solid understanding of standard molecular biology protocols including DNA and RNAAbility to think and work independently as well as in a multidisciplinary team environmentAnalytical, detail oriented, organized, efficient, problem solver with excellent verbal and written communication skillsMust have a desire to be part of a fast-paced and dynamic development environmentMust be fluent in use of Microsoft Word, PowerPoint, and Excel Preferred Skills & Experience Hands-on experience with next generation sequencing technologies (NGS). Experience with HiSeq, NextSeq or MiSeq operation is desirableExperience with Illuminas sample prep methods strongly preferredExperience developing workflows for liquid handling robots (e.g. Tecan, Hamilton, Eppendorf) is desirableKnowledge of NGS secondary analysis techniques desirableClinical experience such as: IVD product development, Laboratory Developed Tests (LDT), and/or Companion Diagnostics (CDx) desirableExperience with design controls, risk management, change management, CAPA and failure investigation desirable. Illumina believes that everyone has the ability to make an impact, and we are proud to be an equal opportunity employer committed to providing employment opportunity regardless of sex, race, creed, color, gender, religion, marital status, domestic partner status, age, national origin or ancestry, physical or mental disability, medical condition, sexual orientation, pregnancy, military or veteran status, citizenship status, and genetic information. If you have a disability or special need that requires accommodation, please contact us at 858-255-5081. To learn more, visit: https://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf"}