{"jobID": "2827509779", "jobLocation": "Los_Angeles_CA", "jobTitle": "Creative Director", "companyRating": null, "companyInfo": {"Website": "www.ecosenselighting.com", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Creative Director joins us at a critical period in our development. The rate of change in terms of EcoSense on a “tech curve” is dramatically increasing. As we rapidly build out our IP, we are looking for a “creative visionary” to innovatively translate technical ideas into human stories and intelligently simple expressions – so that both novice investors and technical lighting designers are equally informed and inspired.  One way to look at it, the Creative Director will invent our own “Rosetta Stone” language, turning raw IP concepts and meaningful words/phrases into intuitive narratives. We believe that the rare ability to push through complexity (to find simple, elegant solutions) requires both high-level strategic thinking and an equal appreciation and passion for the craft of making things. We are on the hunt for a creative powerhouse who would thrive on the challenge. The role will be to build a strong internal creative culture, as you lead the development of creative work that has the potential to create conversations and drive the business.Creative vision will help shape the EcoSense voice, and you will identify unique creative ways for us to build and engage our audience and invite them to participate.Be a versatile, well-rounded and highly-disciplined creative leader who has a strong pulse on the latest in creative storytelling and how it is applied across a multitude of leading-edge platforms.Demonstrate creative vision – inventing, shaping, and spearheading our visual narrative. And You like to be a part of everything – you don’t like to limit yourself to just one thing.A working practitioner – not only articulating vision but actualizing it through stellar execution across platforms.Have a proven ability to collaborate across disciplines such as Marketing, Creative, Product and Management.Thrive in fast-paced environments, and you easily toggle between the big picture and the nitty gritty and back.The Creative Director will spearhead the development of our visual identity, including:Visualization of our IPNew color palette, fonts, look/feel, UINew websiteOffice space design palette/creative directionTrade show design (inspirational, groundbreaking, consistent with our visual identity)Branded assets, brought to life in an original way (e.g., T-shirts, mugs, etc.)Templates/tools (e.g., Identity guidelines, marketing materials, PPT slide library, Word templates business cards, email signatures, contract formats, etc.) It is desired that the candidate has the following qualifications for the position: Bachelor's degree and 7+ years of marketing experience, preferably at a multi-disciplinary branding agency or design firm with experience in technology categoryBackground/education in disciplines such as visual communication design and interaction designInherent understanding of digital and think way beyond traditional formats. And you excel at applying your creative thinking across multiple disciplines (from strategy to design), and across different media applications (such as video, UX, UI, visual design, environment or experience)Demonstrated ability to contribute across the whole process - Creating concepts, research, ideation, strategy, innovation and designNot afraid of leveraging data to help identify unique opportunities for the brand.A strong portfolio of work of which you’re proud, as well as a few concepts that you know could have been amazing, if only they’d been madePersonal work in your portfolio, because if you’re passionate enough to do interesting things in your own time, then there’s a good chance you’ll bring some of that enthusiasm and creativity to your work at EcoSenseShows a strong attention to detail, excellent organization skills, and ability to manage multiple projects and responsibilities on-time (and without the need for outside prompting)Possess the ability and willingness to roll up sleeves and execute to get the job done A detailed and compelling compensation package will be outlined for the selected candidate. All qualified applicants will receive equal consideration for employment without regard to race, color, national origin, religion, sex, pregnancy, marital status, sexual orientation, gender identity, age, physical or mental disability, or covered veteran status. This position is not eligible for sponsorship."}