{"jobID": "2830167532", "jobLocation": "Houston_TX", "jobTitle": "Business Intelligence Analyst II", "companyRating": "2.8", "companyInfo": {"Website": "www.nblenergy.com", "Headquarters": "Houston, TX", "Size": "1001 to 5000 employees", "Founded": " 1932", "Type": " Company - Public (NBL) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Marathon Oil, Cabot Oil & Gas, Murphy Oil"}, "estimatedSalary": "114000", "jobDescription": " Description Job Title Business Intelligence Analyst II Location Houston, TX, US Organization Name 2019 Enabling Technology Brief DescriptionGathers and drives stakeholder requirements and product vision through the planning analysis, development, and testing phases. Responsible for working closely within IT and the end user community and assists to define, plan and monitor business and technical projects impacting Noble’s information strategy. Must be able to work at a detailed level while maintaining a broader view of overall business goals and objectives. Responsible for the timely delivery and quality of information systems projects that meet the business goals and objectives established within area of responsibility. Detailed DescriptionTranslates stakeholder requirements into various documentation deliverables such as functional specifications, use cases, workflow/process diagrams, and data flow/data model diagrams.Assists in the design of Business Intelligence dashboards, scorecards, charts/graphs, drill-downs, and dynamic reports to meet the new information needs.Assists in the development of logical and physical data models to create and maintain database schemas in support of BI/DW requirements.Assists the BI Solution Reporting lead for the installation, configuration and administration of Business Intelligence applicationsAssists in establishing, maintaining and ensuring compliance with standards and procedures for design, development, testing, and documentation, contributing to high quality, reliable and serviceable systems that meet or exceed business needs. Job RequirementsBachelor’s degree in Business, Computer Science or EngineeringTypically requires 3 years of experience in relevant application design and development methods, business requirements analysis, software integration, operational readiness, service level agreements and system support of a continuous operating environment.Two years of experience in assisting in designing, building, deploying and sustaining enterprise Business Intelligence / Data Warehouse reporting solutions.Two years of experience working within an established project management framework.Design and development experience with Business Intelligence and/or reporting systems.Experience designing and building dashboards and analytics solutions using tools like Oracle OBIEE, Tibco Spotfire, and/or PowerBI.Experience developing ETL processes using tools like Informatica or Oracle Data Integrator. Additional DetailsNormal office environmentMust be legally authorized to work in the United States without visa sponsorship. Apply Now!"}