{"jobID": "2722476642", "jobLocation": "Stevensville_MI", "jobTitle": "RN/LPN - Long Term Care", "companyRating": null, "companyInfo": {"Website": "www.lakelandhealth.org", "Headquarters": "Saint Joseph, MI", "Size": "1001 to 5000 employees", "Founded": " 1977", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Note:This position can be filled by either a Registered Nurse or a Licensed Practical Nurse for this Long Term Care position. The job descriptions for each follow:Registered NurseResponsibilities:A Registered Nurse - Long Term Care provides direction and supervision to other health care professionals and ancillary staff. Evaluates care for specific patient populations, using the nursing process of assessment, planning, implementation, and evaluation. Assigns nursing personnel and collaborates with health care professionals according to diagnosis and patient care needs. Ability to organize, prioritize, and manage time. Requirements:Must be a graduate of an accredited School of Nursing. Must possess a current license to practice as a Registered Nurse in the State of Michigan. Must be in good physical and mental health. Previous experience as a Registered Nurse preferred. Requires activities such as pushing, stooping, kneeling, crouching, crawling, reaching, handling, feeling, hearing, talking, and seeing. Must have ability to cope with physical and mental stress. Licensed Practical NurseResponsibilities: A Licensed Practical Nurse works under the direction and supervision of the RN or physician and provides a broad variety of care for a group of patients. This may include delegated components of the assessment and discharge procedures, basic patient education, unit specific treatments and diagnostic modalities, activities of daily living, and dietary assistance. They maintain knowledge and performance of clinical competency which may include activities such as restraint maintenance, trach care suctioning, IV therapy, documentation, medication administration, data collection for physical assessment, discharge teaching, noting orders, and tube feedings. Additional responsibilities may also include transcription of physician orders, nonclinical duties consistent with meeting the needs of the patient and care team, and assisting in the orientation of new employees.Requirements:Must possess a Practical Nurse license to practice nursing in the State of Michigan. Requires activities such as pushing, stooping, kneeling, crouching, crawling, reaching, handling, feeling, hearing, talking, and seeing. Must have ability to cope with physical and mental stress. "}