{"jobID": "2483557027", "jobLocation": "Biggs_Field_TX", "jobTitle": "Senior Scientist Analytical Development", "companyRating": null, "companyInfo": {"Website": "www.evonik.com", "Headquarters": "Essen, Germany", "Size": "10000+ employees", "Founded": " 2007", "Type": " Company - Public", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Bayer, LANXESS Global"}, "estimatedSalary": null, "jobDescription": "Discover a world of opportunities. #HumanChemistry See what chemistry can do for your career: careers.evonik.comExploring opportunities. Growing together.VACANCY REFERENCE NUMBER 98517Senior Scientist Analytical DevelopmentLocation: United States : Birmingham, AL Function: Innovation Management (R&D;) Career Level: Senior professionals (> 5 years) Legal Entity: Evonik Corporation Business Line: Health CareWhat we offer You will work on exciting and challenging topics together with a team in an ultra-modern, innovative and creative environment. Intensive on-the-job training with expert colleagues guarantees you will quickly become familiar with your duties and perform them independently. Performance related pay and the opportunity for personal and professional development are of course part of the package. Since 2009 Evonik Industries AG has been certified as a family-friendly company by the German Hertie Foundation. Click here to learn more about Evonik from our employees This position is responsible for conducting analytical and performance testing of formulations, contributing to pharmaceutical method development, and/or analytical support of GxP manufacturing activities. The methods developed are used to characterize and compare especially products in the area of complex paraenteral drug delivery systems including polymeric microparticles, nanoparticles, nano-suspensions, liposomes and lipid based nanoparticles.  The position may include aspects of method development, specification development and justification, method transfers, stability assessment, GLP characterization, and method qualifications as well as new ways of measuring parameters in the process of formulation development as well as appropriate documentation in the highly regulated pharmaceutical industry (drug product development).  This position requires a general understanding of pharmaceutical analytical techniques and environments.RESPONSIBILITIESPlans and performs multi-part experiments and conducts activities in support of pharmaceutical formulation research and development, test method development and transfer and/or manufacturing operationsGenerates, analyzes, and tabulates data and resultsWorks within the team structure to identify and solve complex formulation, analytical and process problems.Maintains thorough and accurate research and laboratory documentation including experimental methods, observations, data, and results in support of SOP, cGMP, and GLP regulated activitiesAuthors technical sections to written project or research reports and summaries.Proactively searches literature and regulatory guidance (ICH, FDA) to maintain awareness of current technology and regulations.May train technical staff; may oversee laboratory and/or technical activities, as appropriate.Identifies GAPs and actively supports continuous inter- or intra departmental continuous improvement programApplies appropriate regulatory guidance by considering development stages as well as internal and client requirements to ensure the successful progress of pharmaceutically acceptable productsContributes to internal research and intellectual property projects and initiativesPerforms other duties as may be required by supervisorREQUIREMENTSMinimum of BS/BA in a relevant scientific discipline (analytical chemistry, pharmaceutical science, bio-analytical chemistry, chemistry, biochemistry, pharmaceuticals) plus about 3 or more year’s relevant laboratory experience; or, a MS degree in a relevant scientific discipline plus 1-3 or more year’s relevant laboratory experience; or, a PhD in a relevant scientific disciplineStrong problem-solving and critical thinking skills with demonstrated ability to conduct technical programs and to achieve program goalsPassion and drive ideally in the area of analytical development, analytical methods and/or pharmaceutical sciences, formulation development or drug delivery; polymer (biodegradable), API, drug delivery exposure is a plusTechnical capabilities including but not limited to HPLC, dissolution techniques, light scattering techniques for particle sizing and general analytical test method development and validation are a plusExperience in analytical chemistry and analytical development (test method development and validation) in a GMP environment is a plusYour Application To ensure the fastest process of your application and to protect the environment, please apply online via our careers portal at https://careers.evonik.com. VACANCY REFERENCE NUMBER 98517Evonik Corporation is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, gender, sexual orientation, national origin, disability status, protected veteran status or any other legally protected status.Please note that Evonik will not accept any unsolicited application documents sent by staffing firms. Evonik works in conjunction with preferred service providers and will not pay any fee to staffing firms in the absence of an appropriate framework agreement. Should Evonik receive a candidate profile from a staffing firm with which it has no framework agreement, and should this candidate subsequently be considered in the recruitment process or offered employment, no claims from the staffing firm will be entertained in this regard."}