{"jobID": "2787969083", "jobLocation": "Washington_DC", "jobTitle": "Executive Administrative Assistant", "companyRating": null, "companyInfo": {"Website": "www.redgategrp.com", "Headquarters": "Chantilly, VA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Contract", "Industry": " Unknown", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "POSITION: Executive Administrative Assistant LOCATION: 810 Vermont Ave NW, Washington DC 20420 DEPARTMENT: Veterans Administration (VA) - Human Resources and Administration (HR&A;) CLEARANCE: N/A BACKGROUND The mission of The Assistant Secretary for Human Resources and Administration (HR&A;) is to lead human capital management strategies, policies, and practices, which cultivate an engaged, proficient, and diverse workforce to transform and continually improve services to Veterans and their families.  Currently, there are a number of separate initiatives to improve HR training, develop HR leadership, and to develop or improve the tools that HR&A; uses to accomplish its mission. The contractor shall be responsible for providing strategic and/or operational support to the HR&A; Office of Management Planning and Analysis (MP&A;)) and the HR&A; program offices or business offices, as required. The contractor shall provide support to the Program Offices that manage all HR&A; initiatives and shall be accomplished through portfolio management approaches, project management process governance and oversight, and support of contract actions and interagency agreements using a distributed asset concept. The majority of monitoring and oversight is maintained specifically within MP&A.; Program Management Office (PMO) assets, consisting of Business Analysts/Program Oversight Managers (POMs) are also located within various HR&A; offices or business lines to assist in development and management of transformational initiatives.  The contractor shall provide an enhanced support services model and technically competent personnel to fulfill all Government requirements for program management within HR&A; and HR&A; Deputy Assistant Secretary (DAS) Offices including integrated enterprise planning and architecture, disciplined capital planning and investment management, resource management, and transition and change management. To best achieve the organization's strategic goals, HR&A; must create core competencies in the planning, execution, and sequencing of HR&A; projects. The contractor will assist HR&A; in establishing a set of values, techniques, and technologies that enable visibility, standardization, performance measurement, and continuous process improvement throughout HR&A.; Specifically, the PMO support must include facilitation of effective governance, acquisition, program management, executive communications cross-project integration, performance monitoring, financial management and cost control, and project management. This enhanced PMO support services model will enable HR&A; to manage the continuous flow of projects from concept to completion. All POM contractor personnel shall be experienced, knowledgeable, and certified in project management and capable of operating all equipment including IT and associated software programs within their functional area(s). The Government will not be responsible for training. KEY ROLE The Executive Administrative Assistant provides administrative and support services in the areas listed below. The Contractor assigned must possess thorough knowledge of VA HR&A; operations and policies and procedures. Contractor personnel shall be responsible for providing administrative and project support to senior executives. Such experience shall include, but not limited to: Providing recommendations to better facilitate and/or improve administrative processes.Assisting in preparation of presentations.Composing business correspondence.Monitoring external/internal communications.Addressing communications in an expeditious manner.Bringing critical issues to the immediate attention of executives.Coordinating meetings, establishes agendas, and schedules calendars.Communicating and handling incoming and outgoing electronic communications (including telephone, e-mail, and fax communications).Responsible for developing, drafting, writing and editing reports, briefs, proposals, and other documents in support of a client's requirements.Conserving executive's time by reading, researching, and routing correspondence; drafting letters and documents; collecting and analyzing information; initiating telecommunications.Maintaining executive's appointment schedule by planning and scheduling meetings, conferences, teleconferences, and travel.Welcoming guests and customers by greeting them, in person or on the telephone; answering or directing inquiries.Maintaining office supplies inventory by checking stock to determine inventory level; anticipating needed supplies; evaluating new office products; placing and expediting orders for supplies; verifying receipt of supplies.Ensuring operation of equipment by completing preventive maintenance requirements; following manufacturer's instructions; troubleshooting malfunctions; calling for repairs.MINIMUM QUALIFICATIONSMinimum of five (5) years demonstration of the above abilities and experience in a related fieldExcellent communications and interpersonal skillsProficiency with word processing and Microsoft Office applicationsAbility to prioritize multiple projects simultaneouslyAbility to schedule and coordinate meetings and schedules for executives and facilitiesAbility to assist in preparation of presentationsAbility to coordinate communications for front officeHigh school diploma. NOTE: Your resume must reflect each item under \"KEY ROLE\" in order to be considered."}