{"jobID": "2568047528", "jobLocation": "Chicago_IL", "jobTitle": "Business Intelligence Analyst Intern", "companyRating": "3.0", "companyInfo": {"Website": "www.sourceoneinc.com", "Headquarters": "Willow Grove, PA", "Size": "1 to 50 employees", "Founded": " 1992", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "44000", "jobDescription": " As a Business Intelligence Intern at Source One Management Services, you will get to help develop internal and external (client-facing) dashboards which communicate critical business information to stakeholders. You will work closely with our in-house Data Science Team as well as members of our cross-functional leadership teams to understand the business requirements, translate them into insightful analytical processes, and build dashboards that facilitate self-discovery. An ideal candidate for this position has data engineering and analytics experience with a desire to transfer the technical experience to develop business acumen. Additional qualities an ideal candidate may possess are proficiency in mathematics, predictive analysis, data acquisition, data manipulation, data transformation, and data management. What will I do?Work with a cross-functional team of stakeholders to scope, implement, and refine dashboards as they relate to Source Ones Center of Excellence.Assist in identification, construction, and integration of new data sources that may be integrated by our data engineers.Identify and implement key metrics, algorithms, and graphics into dashboards that facilitate data consumption for both integrity analysis and business execution.Iteratively improve end user experience by means of ongoing dialogue with our data QA team.Document processes and develop training materials in support of BI applications.Who should apply?Required Qualifications:Currently pursuing an undergraduate or master degree in mathematics, statistics, predictive analytics, information systems, or an equivalent major.Intermediate Excel analytical skills.Ability to perform ETL (Extract, Transform, and Load) processes by means of SQL.Experience performing analysis in an analytics based language (R, Python, SAS, SPSS, etc.)Demonstrated ability to build dashboards with a BI tool (Tableau, Qlik Sense, Microsoft Power BI, etc.)Strong analytical, problem solving, and diagnostic skill.Ability to work independently and in a team environment, meet individual/team deadlines, and deal with pressures associated with those deadlines.Preferred Qualifications:Proficient ability to automate Microsoft Office based tasks in VBA.Knowledge of software testing processes with an ability to apply software testing methods and techniques in a business intelligence environment.Experience with the Software Development Life Cycle (SDLC).Knowledge about relational databases.Company Insights Since 1992, Source One has been and is a premier procurement services provider and strategic sourcing consulting firm. Our team of spend management and category experts support best-in-class organizations by ensuring their procurement and sourcing capabilities are optimized and that they are getting the most value at the best possible price from their suppliers. Simply put, we help our customers save money by renegotiating existing contracts, streamlining and optimizing processes, and acting as decision support for their procurement and sourcing needs operating under three main verticals: IT & Telecom, Marketing, and Supply Chain.  As a group of out-of-the-box thinkers and motivated individuals, we are always eager to have new members to the team to gain fresh ideas and insights for continuous process improvement and growth.  We take pride in recruiting, developing and retaining highly talented individuals. In addition to the competitive salaries offered to our full-time employees, we provide an attractive vacation policy and benefits which include access to a 401K plan and disability, life, and medical insurance. Please visit us on the web at www.sourceoneinc.com. Interested in a career at Source One? Heres how to apply: Please apply on our web portal: http://jobs.sourceoneinc.com/  We ask that you make sure to include your salary requirements. Please do not contact anyone at the company directly. "}