{"jobID": "2664936020", "jobLocation": "San_Jose_CA", "jobTitle": "Data Scientist, Marketing", "companyRating": "3.7", "companyInfo": {"Website": "www.ebayinc.com", "Headquarters": "San Jose, CA", "Size": "10000+ employees", "Founded": " 1995", "Type": " Company - Public (EBAY) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Apple"}, "estimatedSalary": "148000", "jobDescription": " Looking for a company that inspires passion, courage and imagination, where you can be part of the team shaping the future of global commerce? Want to shape how millions of people buy, sell, connect, and share around the world? If you’re interested in joining a purpose driven community that is dedicated to creating an ambitious and inclusive workplace, join eBay – a company you can be proud to be a part of.  Do you want to have an huge impact on the largest eCommerce website? Are you interested in solving cutting edge research problems while impacting all eBay advertising channels? Does working with Big Data, cloud computing, large-scale optimization, probabilistic inference, and machine learning excite you? If you answered yes, the Marketing Science team at eBay is the right place for you. We are looking for rockstar Data Scientists to join our team.  You will be directly responsible for improving eBay's algorithms that drive customer traffic via Marketing channels. You will work on cutting-edge ML/optimization algorithms against one of the biggest datasets in the world. You’ll work with world-class data scientists and engineers. You’ll solve problems that have a direct impact on a multi-billion dollar business. Bring your ideas, energy, and dedication to reach and engage the next 100M eBay users.  We are developing state-of-the-art personalization technologies and optimization strategies that have a direct impact on eBay's users as well as the company's bottom line. You will be expected to research state-of-the-art machine learning, optimization, natural language processing, text mining, and other techniques, and apply them to eBay's marketing platforms. You will roll your solutions to production, analyze results offline and online, and measure site impact. Responsibilities Aggregate huge amount of data and information from large numbers of sources to discover patterns and features necessary to build machine learning models that match eBay’s inventory with customers’ demand via Marketing channels. Design and implement end-to-end solutions using Machine Learning, Optimization, and other advanced computer science technologies, and own live deployments to drive customer traffic to eBay. QualificationsPhD or MS in computer science, engineering or related field4-8 years of experience as machine learning engineer/data scientist.Excellent understanding of computer science fundamentals, data structures, and algorithms. Strong programming skills (one or more of Java, C/C++, Python).Expertise in specialized areas such as Optimization, NLP, Reinforcement Learning, Probabilistic Inference, Machine Learning, Information Retrieval, Recommendation Systems.Proven experience with large data sets and related technologies, e.g., Hadoop, Pig, Spark. Knowledge of SQL and NoSQL is required.Expert level experience in at least one of the ML learning software (R/Python/Scala/Tensor flow) is required.Good communication skills, ability to work with large cross-functional teams of technical and non-technical members and mentor others. eBayis a Subsidiary of eBay.  This website uses cookies to enhance your experience. By continuing to browse the site, you agree to our use of cookies  View our privacy policy  View our accessibility info eBay Inc. is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at talent@ebay.com. We will make every effort to respond to your request for disability assistance as soon as possible.  For more information see:  EEO is the Law Poster  EEO is the Law Poster Supplement"}