{"jobID": "2688993739", "jobLocation": "Mountain_View_CA", "jobTitle": "Senior Data Scientist (Artificial Intelligence)", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Are you a Senior Data Scientist that's ready to work on important and challenging AI & ML projects?  We're using machine learning and computational linguistics to make large volumes of information easily and effectively understood. Our technology analyzes high-quality content to extract concepts and discern patterns and relationships to transform information into knowledge in the areas of education, publishing, finance, and biomedical.  Our company is a VC funded startup with an accomplished team of alums from top universities and industry leaders, and our managers have track records of billion-dollar exits.  The company has successfully launched a portfolio of products and services, including an intelligent framework based on a stack of Artificial Intelligence algorithms that digest a multitude of data sources, both structured and unstructured, and extract financial, economic, political and social indicators, alongside the semantic explanatory rationale describing any given event. Core ResponsibilitiesCollecting and preprocessing data, prototyping concepts, designing cutting-edge machine learning algorithms and testing them on production dataKey QualificationsPhD or a Master's degree in Computer Science or related fields (preferably with major in Machine Learning / AI)5+ years relevant Data Science experienceStrong knowledge of state-of-the-art algorithms in Machine Learning (ie. Bayesian learning, latent / topic models, approximate inference, deep networks, stochastic processes)Graph Analysis (ie. community detection, random walk)Statistical Modeling (ie. hypothesis testing, dimensionality reductionProficiency in standard data analytics toolkits in Python, Scala or RSoftware Development experienceHands-on experience of Hadoop 2.0 (Spark, MapReduce) and AWS ecosystems is highly beneficial So if you're a Senior Data Scientist that's ready to work on challenging AI & ML projects, APPLY NOW!"}