{"jobID": "2791795629", "jobLocation": "Chicago_IL", "jobTitle": "Market Analyst - Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.gensler.com", "Headquarters": "San Francisco, CA", "Size": "5001 to 10000 employees", "Founded": " 1965", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Skidmore, Owings & Merrill LLP, HOK, NBBJ"}, "estimatedSalary": "58000", "jobDescription": " Market Analyst - Data Analyst Gensler Region  North Central Job Location  Chicago, IL, USID12085Apply NowMarket Analyst / Data Analyst Gensler is a global architecture and design firm grounded in the belief that design strategy optimizes business performance and human potential. Our 5,000+ practitioners networked across 45+ offices use global perspective and local presence to innovate at every scale. Whether we are refreshing a retailer’s brand, planning a new urban district, or designing a super tall building, we strive to make the everyday places people occupy more inspiring, more resilient, and more impactful. Your Role As a Market Analyst/Data Analyst with Gensler's Chicago office you will work with our strategy and operations group to advance Gensler’s organizational strategies. What You Will DoFind and collect data, process it, use it for forecasting and projections, draw relevant conclusions, and communicate these in meaningful waysMarket research and analysis with related documentation – presentations and reports, market analysis, demand assessment, due diligence, feasibility studies, and other advisory work in collaboration with our strategy and operations groupMarket, economic, and financial modelingProject recommendations and strategies based on available data and informationGIS data development from Gensler tools as applicableAd hoc project tasks as required by the groupYour QualificationsBachelor’s degree in business, economics, data science, or related fields required, Master’s desiredExperience in market, economic, and financial analysisExcellent research and analytical skills (including numerical/data analysis)Strong knowledge of Microsoft Office (Word, Excel, PowerPoint) is requiredExperience structuring and analyzing large datasets with R, SQL, or Python a plusStrong leadership, and communication skillsPrevious experience in consulting/ advisory a plusPrevious work with econometric modeling a plusExperience with statistical modeling a plusExperience with algorithms a plusLife at Gensler At Gensler, we are as committed to enjoying life as we are to delivering best-in-class design. From curated art exhibits to internal design competitions to “Well-being Week,” our offices reflect our people’s diverse interests.  We encourage every person at Gensler to lead a healthy and balanced life. Our comprehensive benefits include medical, dental, vision, disability, wellness programs, flex spending, paid holidays, and paid time off. We also offer a 401k, profit sharing, employee stock ownership, and twice annual bonus opportunities.  As part of the firm’s commitment to licensure and professional development, Gensler offers reimbursement for certain professional licenses and associated renewals and exam fees. In addition, we reimburse tuition for certain eligible programs or classes. We view our professional development programs as strategic investments in our future. Gensler is an Equal Opportunity Employer and participant in the U.S. Federal E-Verify program. Women, minorities, individuals with disabilities and protected veterans are encouraged to apply. #LI-AE1"}