{"jobID": "2808271685", "jobLocation": "Springfield_VA", "jobTitle": "Spectral Scientist", "companyRating": "2.9", "companyInfo": {"Website": "www.mteq.com", "Headquarters": "Lorton, VA", "Size": "201 to 500 employees", "Founded": " 1992", "Type": " Company - Private", "Industry": " Aerospace & Defense", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " EOIR Technologies, Harris, Fibertek"}, "estimatedSalary": "86000", "jobDescription": " Founded in 1992, MTEQ is a woman-owned business that has provided superior Technical Services and Rapid Prototyping support to Government and Commercial Customers. We have accrued over 18 years of specialized experience in customized initial concept design, electronic fabrication/prototyping, and sensor systems integration for a variety of defense and commercial applications. MTEQ maintains a high performance culture that emphasizes superior quality, productivity, process improvement, goal attainment, recruitment and ongoing development of a superior workforce.  MTEQ is seeking a Spectral Scientist to join our team of well qualified, diverse individuals at our Springfield, VA Office. ESSENTIAL JOB FUNCTIONS AND ESSENTIAL JOB DUTIES: MTEQ, Inc. has an immediate opening for a Spectral Scientist to support remote sensing programs in Springfield, VA. Candidate will conduct imaging sensor data analysis, including algorithm development, develop signatures of target materials and produce spectral data libraries. Other responsibilities will include supporting data collection with spectrometers, performing field work, and delivering technical presentations or reports. REQUIREMENTS:10+ years of experience in remote sensingAirborne and ground collection experienceExperience with spectral signatures and signature analysisExperience with spectrometer operationExperience with ENVI+IDL, python or MatLabMinimum of a BS or MS in Physics, Electro-Optics, Electrical Engineering or other related science disciplineSECURITY CLEARANCE:Active TS/SCI Security ClearanceFor our Service Members and Veterans: MTEQ values the service Veterans and their family members have given to our country and we support the hiring of returning Service Members and military spouses. If you are a Veteran or wounded warrior and would like assistance with the employment process at MTEQ, please contact Human Resources at (540) 658-2720 Opt 2. For Persons with Disabilities: If you are a person with a disability or a disabled Veteran and are applying for a job with MTEQ, we would like to ensure your application process goes as smoothly as possible. If because of a medical condition or disability, you need a reasonable accommodation for any part of the employment process please call (540) 658-2720 Opt 2 and let us know the nature of your request and your contact information.  MTEQ is an Equal Opportunity/Affirmative Action Employer  Minorities/Women/Veterans/Disabled"}