{"jobID": "2681714636", "jobLocation": "Santa_Monica_CA", "jobTitle": "Principal Scientist, T-Cell Development and Gene Editing", "companyRating": null, "companyInfo": {"Website": "www.kitepharma.com", "Headquarters": "Santa Monica, CA", "Size": "501 to 1000 employees", "Founded": " 2008", "Type": " Company - Public", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " For Current Kite Pharma Employees and Contractors:Please log onto your Internal Career Site to apply for this jobJob DescriptionKite is seeking a highly motivated individual with T cell development and gene editing experience to work on innovative T cell therapy for cancer treatment. The Principal scientist in this position will be responsible for the development of gene-edited CAR/TCR T cells for oncology indications. This position will utilize your strong scientific background, track record of exceptional experimental technique, and the ability to design and implement creative solutions to complex cell therapy and gene editing questions. The Principal Scientist will work with the Product Sciences teams to design and execute gene edited based cell therapy processes and participate in laboratory activities to support process development and process characterization of Kite’s T cell products portfolio.  Responsibilities (include but limited to): Develop and optimize protocols for T cell gene editing, including; gene editing platform delivery methods, culture conditions to support platform build and therapeutic program developmentDesign and initiate development of assays to characterize genetically engineered and edited primary T cells to support early product characterizationPlanning and hands-on execution of ex vivo and in vitro cellular assays, including significant flow cytometry analysis and downstream molecular biologyDevelop and communicate experimental plans to demonstrate the efficacy of therapeutic product candidatesPerform data analysis and report results to scientific team and executive managementWork together with project leaders, research department, and other groups across Kite to drive project successExercise independent judgment in development of new methods, techniques and evaluation criteriaLead, train and mentor junior staffOther duties as assigned Requirements: PhD in Immunology, Cell Biology, Bioengineering, or a related discipline. Post-doctoral experience welcome but not required. Industry experience preferred but not required.Solid understanding of immunology, including familiarity with T cell development and function, immune receptor signaling and the biology of chimeric antigen receptorsApplied experience in gene-edited T cell therapiesExpertise in Process development and GMP clinical manufacturing of cell therapy products is a plusExpertise with in vitro models of cancer and cellular immunotherapy, including immunological assays to assess T cell function (in vitro cell proliferation assays, T cell activation/cytotoxic killing assays, cytokine profiling and/or immune cell isolation)Familiarity with gene editing technique and applications, including ZFNs, CRISPR and/or use of AAV- and lentiviral vectors is preferredStrong technical background with standard laboratory methods, including: polychromatic flow cytometry; molecular biology and cloning; virus handling; PCR; ELISA; intracellular staining;Ability to work effectively in a collaborative team environment where results are achieved through influence, cooperation, and the incorporation of multiple points of viewIndependently motivated, detail oriented and good problem solving abilityExcellent organizational skills, with an ability to embrace change and multi-task in an extremely fast-paced environmentMotivated and curious, experienced working with highly technical projects and personnelHighly adaptable and responsive to technical and business opportunities, comfortable delivering against challenging commitments #LI-EL1  Kite is a biopharmaceutical company engaged in the development of innovative cancer immunotherapies with a goal of providing rapid, long-term durable response and eliminating the burden of chronic care. The company is focused on chimeric antigen receptor (CAR) and T cell receptor (TCR) engineered cell therapies designed to empower the immune system's ability to recognize and kill tumors. Kite is based in Santa Monica, CA. For more information on Kite, please visit www.kitepharma.com. Sign up to follow @KitePharma on Twitter at www.twitter.com/kitepharma.For jobs in the United States:As an equal opportunity employer, Gilead Sciences Inc. is committed to a diverse workforce. Employment decisions regarding recruitment and selection will be made without discrimination based on race, color, religion, national origin, gender, age, sexual orientation, physical or mental disability, genetic information or characteristic, gender identity and expression, veteran status, or other non-job related characteristics or other prohibited grounds specified in applicable federal, state and local laws. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Era Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants who require accommodation in the job application process may contact careers@gilead.com for assistance.  For more information about equal employment opportunity protections, please view the ‘EEO is the Law’ poster.  NOTICE: EMPLOYEE POLYGRAPH PROTECTION ACT YOUR RIGHTS UNDER THE FAMILY AND MEDICAL LEAVE ACT PAY TRANSPARENCY NONDISCRIMINATION PROVISION  Our environment respects individual differences and recognizes each employee as an integral member of our company. Our workforce reflects these values and celebrates the individuals who make up our growing team.  Gilead provides a work environment free of harassment and prohibited conduct. We promote and support individual differences and diversity of thoughts and opinion.For jobs in France:Conformément à la Loi « Informatique et Libertés » (06/01/78), nous vous informons du fait que les données personnelles renseignées pourront faire l'objet d'un traitement informatique par Gilead et pourront être transmises aux Organismes Sociaux. Par ailleurs, vous disposez d'un droit d'accès, de rectification et de suppression des données vous concernant. Vous pouvez exercer ce droit en contactant: FranceDataPrivacy@gilead.comFor Current Kite Pharma Employees and Contractors:Please log onto your Internal Career Site to apply for this job."}