{"jobID": "2814907220", "jobLocation": "New_Brunswick_NJ", "jobTitle": "Senior Data Analyst, GPS Analytics", "companyRating": null, "companyInfo": {"Website": "www.eclaroit.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Contract", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Senior Data Analyst (GPS Analytics)Location: New Brunswick, NJ  Duration: 6 months (Potential extension or right to hire)  Work Authorization: W2  Pay Rate:$80/hr  Job Number: 23796-1Be part of a company that delivers life-changing healthcare solutions. Eclaro is looking  for a Senior Data Analyst (GPS Analytics) for our client in New Brunswick, NJ.  Eclaro’s client is a leader in the Biopharmaceutical Industry, providing quality, innovative, and affordable medicines that make a difference in the lives of patients all over the world. If you’re up to the challenge, then take a chance at this rewarding opportunity! Responsibilities:Support the Associate Director of GPS Analytics (AD) in executing the team’s Book of Work (BoW). More specifically, perform hands-on work to: Support Business Decisions - Work closely with business stakeholders to address priority business questions within an assigned area. This includes all steps from problem identification and key question development through hypothesis testing, driving analysis and presenting key findings to stakeholders.Drive Analytics and Capabilities – Answer key business questions using innovative analytic techniques, assist with establishing core analytical capabilities, standards, processes and methodologies for the team.Drive Team Productivity and Operational Excellence – Play a critical role in maintaining and enhancing team productivity, timeliness and quality of deliverables. Ensure consistent adoption of standards, processes and methodologies by contracted or other team staff. Continuously seek opportunities and approaches for enhancing the team’s overall productivity.Qualifications:Degree/Certification/Licensure • BA/BS required (quantitative area of study)  MSci, MEng or other Masters in quantitative area of studyPreferred Experience – Responsibility and minimum number of years • 5+ years hands-on working in the area of agile data analytics, data integration, reporting, simulation and statistical modelingSignificant experience working in the manufacturing and product development spaceExperience interpreting analytical results and ascertaining implications to the businessProven experience operating successfully in a complex organizational environmentExperience interacting with senior management and business stakeholders understanding, anticipating, and fulfilling their insight/analytical information requirementsCompetencies – knowledge, skills, abilities, other • Strong creative problem solving skills to answer key business questionsRapidly draws inferences from disparate pieces of data, identify key findings and link to implications and provide recommendationsStrong interpersonal skills with the ability to work with diverse teams across organizational lines and structuresStrong project management skills with demonstrated ability to handle multiple projects and prioritiesStrong analytical skills with substantial knowledge of data analysis, applied statistics, risk based analysisStrong written and verbal communication skillsAbility to quickly gain and apply manufacturing specific knowledgeAbility to learn new tools quicklySoftware that must be used independently and without assistance (e.g., Microsoft Suite) • 5+ years of hands-on experience with data analytics, modeling platforms, data manipulation software and visualization tools (e.g. Advanced SQL, Oracle PL/SQL, R, Python, SAP HANA, Spotfire, Tableau, Microsoft Suite, Hadoop, Redshift, Business Intelligence / OLAP)If hired, you will enjoy the following Eclaro Benefits:401k Retirement Savings Plan administered by Merrill LynchCommuter Check Pretax Commuter BenefitsEligibility to purchase Medical, Dental & Vision Insurance through Eclaro If interested, please send your updated resume to Junethel.Binuya@eclaro.com or call (212)804-7476. Equal Opportunity Employer: Eclaro values diversity and does not discriminate based on Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status. "}