{"jobID": "2729321395", "jobLocation": "Washington_DC", "jobTitle": "Infrastructure Engineer", "companyRating": "2.7", "companyInfo": {"Website": "www.cas.org", "Headquarters": "Columbus, OH", "Size": "1001 to 5000 employees", "Founded": " 1907", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Elsevier, Thomson Reuters, Google"}, "estimatedSalary": "85000", "jobDescription": " The American Chemical Society is looking to hire an Infrastructure Engineer to join the Client Platform Service Team within the Information Technology division.  Client Platform Services Overview  The Client Platform Services (CPS) team provides high quality technical guidance and support for the American Chemical Society. The team focuses on excellent customer service while delivering server systems support, administration, and maintenance. Through these means CPS aims to advance the mission and vision of the American Chemical Society.  Position Summary  The incumbent in this position is responsible, as a member of the Windows Platform Services (WPS) team, is responsible for Windows server administration that supports daily operations of the ACS data centers. The incumbent reports to the WPS Team Manager and works under his/her managerial direction. The incumbent performs advanced server administration and maintenance tasks and provides some application related server support. Incumbent is a recognized technical resource for the Systems Administration Team for Windows Server and Active Directory administration and is expected to contribute to the daily resolution of Windows Server related ticket requests. This position may lead medium to large sized projects and is expected to have excellent communication and support skills to facilitate partnerships with peers and customers.  Position Accountabilities Provide advanced Windows Server administration and maintenance to ensure optimal performance of server hardware and operating system.Administer Active Directory domain structureAdminister IIS web servers and coordinate with business users to schedule maintenanceAdminister Exchange and Blackberry server environment.Responsible for troubleshooting server errors and identifying root cause and performing server patch maintenanceLeads projects as assigned by Team Lead and/or Manager.Assists team members in the completion of major project tasks.Participate in project planning meetings and takes a lead role in reviewing technical requirements and leading testing activities.Participates in the mentorship of junior staff members.Exhibits strong verbal and written communication skills, proactively communicating with customers and framing technical issues so that they can be readily understood.Responsible for server troubleshooting. This includes the installation, configuration and troubleshooting of systems.Independently utilizes resources (knowledgebases, online resources, etc) to research solutions for difficult problems.Works with outside vendors to maintain and repair systems & equipment in a timely manner.Follows Standard Operating Procedures and utilizes established support tools.Maintain current awareness of standard Washington operations systems and actively researches new technology.On-call duties and extended hours working are required. Required SkillsCollege degree or equivalent experience; usually has an advanced degree (relevant field) or equivalent experience. 7+ years of related experience. MCSA or MCSE certifications are preferred. Exchange 2010/2013/2016, Server 2008R2/2012 R2/2016, Blade Technology, Dell Hardware Platforms, Blackberry Enterprise Server, SQL Clustering and VMware. Server High Availability experience is a plus. 3-5 years of related senior level experience in server administration and technical problem solving. Experience in server preparation, installation, operation, integration, and monitoring. A state-of-the-art awareness in the areas of server operating systems, email communications, web technologies, software, hardware, system performance measurement, configuration analysis and computer security. Excellent written, oral communication and organizational skills.  EEO/Minority/Female/Disabled/VeteranJob Location  Washington, District of Columbia, United States  Position Type  Full-Time/Regular"}