{"jobID": "2793164071", "jobLocation": "Rockville_MD", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.xscion.com", "Headquarters": "Mc Lean, VA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Overview: The Lead Data Scientist for Market Regulation Technology will work to establish and institutionalize data science and machine learning best practices as our client moves to ML based pattern development. The development product for this move will be the creation of the Dynamic Surveillance Platform. The lead data scientist will have primary responsibility of the development of the Machine Learning (ML) Framework portion of the Platform. To Be Successful, You Need:Masters or PhD degree (preferred) in Statistics, Mathematics, Psychology, Sociology, Econometrics, or related field.5+ years relevant experience with a proven track record of leveraging analytics and large amounts of data to drive significant business impactSolid statistical knowledge and intuition, ideally utilized in experimentation and modelingStrong algorithmic thinking and independent research abilityBonus Points if you have:Passion for learning and innovating new methodologies at the intersection of statistics, applied math, and computer scienceExceptional interpersonal and communication skills coupled with strong business acumen. Must be able to translate business objectives into actionable analyses, and analytic results into actionable business and product recommendationsImpactful presentation skills, including the use of meaningful charts, graphs, or other data visualizations to convey information and results clearly and conciselyStrong background in machine learningStrong knowledge of advanced statistical methods and predictive modelingWe Hire Great People. Period. If this description sounds like you and if you’re a Data Scientist rockstar - then we want to hear from you. Why Work at xScion?We have an amazing culture – We were named a ‘Best Place to Work in VA’ for the last 3 years (2016, 2017 & 2018).We are poised for rapid growth – We are on the cutting edge of digital transformation in healthcare and finance and continuously welcoming new clients to the xScion family.We believe in your continuous development – We invest in our teams’ development, paying for certifications and trainings to improve their skills because we are committed to being the best at what we do.You’ll work with the best – We only hire great people.And because we truly care about you and our clients. - We are run by real people for real people, creating flexibility, balance, respect and fun in the workplace.We Offer Great Benefits: We not only offer standard benefits like great medical, dental, 401(k) match, flex spending and more, but we also offer unique perks such 11 holidays (including your birthday!), 3 weeks of paid time off, company events, games, and many other things that inspire balance and flexibility. We’re Transforming Businesses… xScion is a woman-owned NextGen Technology Consulting Firm that helps companies modernize their IT and business operations. We support leading Healthcare and Financial Services companies through innovative solutions including AppDev, DevOps, Data Services and Agile Transformation. Want to Learn More about xScion? Check us at out on www.xscion.com or socially at LinkedIn, Twitter and Glassdoor.  At xScion, we celebrate diversity in all forms. xScion is an Equal Opportunity Employer- Females/Minorities/Protected Veterans/Individuals with Disabilities.- provided by Dice  Econometrics, PhD"}