{"jobID": "2831912989", "jobLocation": "Arlington_VA", "jobTitle": "Senior Principal Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.gdit.com", "Headquarters": "Fairfax, VA", "Size": "10000+ employees", "Founded": " 1996", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " SAIC"}, "estimatedSalary": "115000", "jobDescription": " Requisition ID 2018-40320  # of Openings 1  Job Function Information Technology  Security Clearance Level Secret  Full/Part Time Part Time Job Description General Dynamics Information Technology is in search of a Senior Data Analyst with knowledge of a variety of advanced data mining techniques such as clustering, regression analysis, decision trees etc. Additionally, this work involves designing and administering data collection tools, analyzing data patterns and performing predictive analysis. Experience utilizing data visualization tools such as Tableau is essential. Work products should highlight areas where processes can be streamlined.  The ideal candidate is a hybrid of an inquisitive data hacker, analyst, communicator and a trusted advisor, with a strong business acumen, coupled with the ability to question existing assumptions and processes, conduct 'what-if' analysis and to communicate findings to both business and IT leaders in a way that can influence how an organization will not just address mission problems, but they will pick the right problems that have the most value to the organization. Responsibilities:Collaborate with a team of IT and SMEs to manage statistical data and create different models based on program needs. Read More...Provide advanced data management support, including creation of complex macros, graphs, and output.Perform complex data mining using predictive analytical modeling techniques and provide systems-related recommendation for streamlining the programPerform and interpret data studies and product experiments concerning new data sources or new uses for existing data sources.Develop prototypes, proof of concepts, algorithms, predictive models, and custom analysis.Design and build new data set processes for modeling, data mining, and production purposes.Design and validate data collection instrumentsDetermine new ways to improve data and search quality, and predictive capabilitiesDevelop presentations and reports of analytical findsDevelop data visualizations and dashboards to display resultsCollect and study data to analyze methods to improve operations and business processes within the programInterpret statistical analyses and help client shift from an ad hoc analysis to an ongoing informed conclusions and recommendationsEducationAdvanced analytical skills and the ability to process research information for easier consumption and transform it into actionable plans.The applicant must possess exceptional oral and written communication and the ability to counsel clients about the analytic process and how to use data to answer policy and program questions.An advanced degree (such as a PhD) in computer science is usually required for this kind of position, in addition to previous years of work experience in a related field.Willingness and ability to participate in, author, and review project technical documentation.Detail oriented with strong analytical and organizational skills.QualificationsExperience working with Tableau Microsoft SQL Server DatabaseBusiness Intelligence and Data Analytics toolsWork location is onsite at Arlington, VASecret Clearance required. As a trusted systems integrator for more than 50 years, General Dynamics Information Technology provides information technology (IT), systems engineering, professional services and simulation and training to customers in the defense, federal civilian government, health, homeland security, intelligence, state and local government and commercial sectors. With approximately 32,000 professionals worldwide, the company delivers IT enterprise solutions, manages large-scale, mission-critical IT programs and provides mission support services. GDIT is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status, or any other protected class.  Options"}