{"jobID": "2705637912", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Scientist, Computational Biology", "companyRating": "4.9", "companyInfo": {"Website": "www.23andme.com", "Headquarters": "Mountain View, CA", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "140000", "jobDescription": "Who we are Since 2006, 23andMes mission has been to help people access, understand, and benefit from the human genome. We are a group of passionate individuals pushing the boundaries of whats possible to help turn genetic insight into better health and personal understanding.  Our Therapeutics team is committed to discovering and developing new therapies that can offer significant benefits for patients. This dedicated research and development group identifies novel targets using 23andMe's genetic database, generates lead compounds for these targets and performs preclinical research to advance programs for clinical development. The team currently has research programs across several therapeutic areas, including oncology, skin, respiratory and cardiovascular disease.  23andMe is seeking an outstanding Computational Biologist to add to our collaborative, cross-functional research team focused on discovery of novel therapeutic targets and their development in our laboratories. Successful candidates will have demonstrated experience conducting creative and independent research analyzing a broad range of genomic data sets with an emphasis on understanding the underlying biology. What you'll doExtend existing target discovery efforts to incorporate additional data types and novel analysis methodsWork toward identifying clinically relevant disease subtypes and associated therapeutic targetsContribute to ongoing therapeutic development programsWhat you'll bringPhD in computational biology, biostatistics, statistics, or related quantitative fieldExpertise in several of the following:Analysis of RNA-Seq and microarray dataAnalysis of other large omics data setsGeneticsFine mapping of genetic association signalsLinear and nonlinear modeling of statistical dataMachine learning"}