{"jobID": "2834890260", "jobLocation": "Chicago_IL", "jobTitle": "Data Quality Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.nielsen.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1923", "Type": " Company - Public (NLSN) ", "Industry": " Unknown", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": "Data Quality Analyst - 22173 Operations - USA Chicago, Illinois  Nielsen Catalina Solutions is a joint venture between The Nielsen Company and Catalina Marketing, integrating information from Nielsen's industry-leading TV, Internet, Mobile and household purchase panels, with purchase data from more than 60 million shoppers from a cross-section of retailers.  NCS enables Consumer Packaged Goods (CPG) marketers and media companies to understand how well media campaigns are driving actual consumer buying behavior, by directly and anonymously linking consumers' television, online, mobile, and print usage with in-store purchase behavior. This unprecedented level of insight will help marketers shape their marketing and media campaigns for a greater return on investment. The JV builds on the success of Nielsen's leading Internet ad effectiveness business, creating the industry's first TV ROI measurement service using data from Nielsen's National People Meter panel.  The Operations team serves as a trusted advisor on our data to help collect NCS retailer and campaign data, check the data for compliance and accuracy, and distribute that data to our analytics team. As a member of Operations, you will collaborate with the internal client consulting team, external client data teams, and our analytics team to help NCS maintain the highest data standards in quality and security.  As a Data Quality Analyst, you will be hands-on, and will be expected to use analytical and problem solving skills to analyze and transform big data. The ideal candidate will work closely with Client Consulting, Operations, Tagging Management, Agencies, and other departments to ensure delivery of digital campaigns to clients. The primary function is to confirm a client campaign is properly launched on time and maintain the health of digital exposure collection during the campaign, in addition to analyzing data sets of our retailers and partners and identify potential inconsistencies. This function serves a pivotal role in the completion of product delivery to clients. When done properly, this function enables efficiencies, analyzes our raw data, contributes to revenue and strengthens relationships with clients. Responsibilities:Review of campaign initiation and exposure request compliance on an ongoing basisContinuous review and monitoring of exposure collection and discrepanciesCommunicate with different departments to investigate discrepancies foundMaintain tracking reports to be a resource for questions around live and completed campaignsLead kick-off calls for new campaignsRelationship building with client tagging teams to ensure NCS receives quality work and have a better understanding of escalation proceduresAnalyze retailer and partner data on a recurring basis to determine quality and accuracy of received dataTransformation of data into different layouts based on what the end data will be used forReview received raw data for quality, maintenance, and trends to understand changes or errors that may be occurring in the dataQualifications:Required:Bachelor’s degree in Business, Info Systems, or a related field2+ years of relevant experienceAnalytical and problem solving skills with a sense of proportion/importance for data anomalies within big dataCritical thinking skills and ability to apply good judgment in identifying and resolving moderate to complex problemsAbility to balance multiple projects, tasks and priorities and to remain flexible when priorities or work direction change.Excellent written and verbal communication skills with demonstrated ability to communicate and collaborate with other teams to achieve desired results.Desired (a plus if you have):Intermediate experience with composing and modifying SQL for ad-hoc data queriesExperience in understanding tagging and discrepancy reportsAbility to interpret media plans and tagging structuresExperience in Unix, SQL, Spotfire, and SalesforceAbout Nielsen: Nielsen N.V. (NYSE: NLSN) is a global performance management company that provides a comprehensive understanding of what consumers Watch and Buy. Nielsen’s Watch segment provides media and advertising clients with Total Audience measurement services across all devices where content — video, audio, and text — is consumed. The Buy segment offers consumer packaged goods manufacturers and retailers the industry’s only global view of retail performance measurement.  By integrating information from its Watch and Buy segments and other data sources, Nielsen provides its clients with both world-class measurement as well as analytics that help improve performance. Nielsen, an S&P; 500 company, has operations in over 100 countries that cover more than 90 percent of the world’s population. For more information, visit www.nielsen.com Nielsen is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class.Job Type: Regular Primary Location: Chicago,Illinois Secondary Locations: OH - Cincinnati, , , Travel: Yes, 5% of the Time"}