{"jobID": "2675336621", "jobLocation": "San_Jose_CA", "jobTitle": "Business Intelligence Analyst", "companyRating": "4.6", "companyInfo": {"Website": "www.nextgentechinc.com", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "64000", "jobDescription": " Nextgen Technologies Inc. has openings for Business Intelligence Analyst (NG - 2018-1) in San Jose, CA.Job TitleBusiness Intelligence Analyst  Skill Set:Tableau Desktop 9.x/10.x, Tableau Server 9.x/10.x, JavaScript API, SQL queries, ETL, Datawarehousing, Hadoop, Big Data, HBase, HIVEQL (Query Language), Google Analytics, SAP Business Objects DataServices 4.1, BO 4.x, Rapid Marts, Web Intelligence (WEBI Reports), WEBI Rich client, Dash Board Designer, Information Design tool, SQL SERVER 2008/10/12/16.Educational RequirementsBachelor’s degree or its foreign equivalent in Computer Science, CIS, MIS, Engineering (any) or related field.Certifications:Tableau Desktop 10 Qualified AssociateProject Overview:The project is a Google Visual Analytics solution for Text and Google Analytics on Social Media. Internet-based social media have changed the idea of people’s communication, interaction and made the word more open and connected. This project involves extracting data from both structured and unstructured data writing Complex SQL codes and by using proprietary Google’s internal ETL tools.  This project aims in analyzing metrics on Invoice amounts of the Google products and helping organizations whose business, marketing or advertising goals are based on social media as well as organizations that want to know user reviews on their products from social media by turning structured data from different source systems and unstructured big-data into a meaningful, actionable and user-friendly web based interactive dashboards using Tableau dashboard design tool.Technologies required for the project are:Tableau Desktop 9.x/10.x, Tableau Server 9.x/10.x, JavaScript API, SQL queries, HIVEQL (Query Language), ETL, Datawarehousing, Hadoop, Big Data, HBase, HDFS files, Google Analytics, JAVA, SQL Server 2016.  The project will be developed in 8 different phases. Requirement Gathering (Duration: 2-3 months)Software Design (Duration: 3-4 months)Platform Setup (Duration: 2-3 months)Implementation and Integration (Duration: 12-15 months)Testing (Duration: 6-8 months)Deployment (Duration: 3-4 months)Performance and Optimization (Duration: 4-5 months)Future ScopeSpecific job responsibilities:• Analysis on the business requirements. Designing the ETL modules and creating data models to develop ETL jobs to extract data from different source systems (databases, Google sheets data, HDFS files & other file systems).Analyzing different KPI's (Key Performance Metrics) and data as per the business requirements.Creating Technical Specification Documents (TSD’s) to map source and target attributes applying business rules and mapping logics to provide best-fit solutions. Percentage of time (on weekly basis) - 20% Develop ETL (extract, Transform & Load) jobs to extract structured and unstructured data from different source systems and sites, cleanse the data, transform it and load it to the Datawarehouse using Google’s internal tools.Writing complex SQL queries to pull data from databases as per the business needs and provide business intelligence solutions. Percentage of time (on weekly basis) - 25% Creating new instances (virtual machines) and installing, configuring, migrating Tableau suite 10.x. maintaining and troubleshooting any technical issues.Develop reports & operational dashboards using Tableau Dashboard desing as per the business requirements once data is loaded into the target datawarehouse.Developing, publishing & scheduling interactive reports and organization's dashboards using Tableau Desktop/Server.Creating Forecasting & Financial modeling dashboards on time-series data using exponential smoothing models of Tableau Desktop. Percentage of time (on weekly basis) - 30% Perform testing of all the modules – Functional, ETL (Extract, Transform & Load) code developed and Integration of back-end components with the front-end (Tableau reports & Dashboards) to meet the functionalities/deliverable's in the project documentation and specifications.Managing end to end Projects from requirements gathering to production go live. Percentage of time (on weekly basis) - 15% Performance tuning of the ETL jobs, Tableau reports & dashboards developed, tuning the database tables, creating explain plans, creating indexes and tuning the reports developed.Performing administration tasks such as creating and managing users, sites, setting permissions, managing ownership's, providing access to the users using user filters and adding them to the specific group. Percentage of time (on weekly basis) - 10%Location:1667 Plymouth Street, Mountain View, CA - 94043.  To apply please send resumes to HR Manager, Nextgen Technologies Inc.,1735 North 1st Street #308, San Jose, CA 95112.,or email to resumes@nextgentechinc.com."}