{"jobID": "2761631544", "jobLocation": "San_Diego_CA", "jobTitle": "Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.viasat.com", "Headquarters": "Carlsbad, CA", "Size": "1001 to 5000 employees", "Founded": " 1986", "Type": " Company - Public (VSAT) ", "Industry": " Telecommunications", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Harris, Gogo, Inmarsat"}, "estimatedSalary": "111000", "jobDescription": "Job ResponsibilitiesViaSat designs, builds, and operates high-capacity satellite networks - bringing broadband Internet access to the world.  Our Team  We employ the latest technologies (Spark, Kafka, Impala, Hadoop) to analyze the Petabytes of data our operational systems produce. We employ developers, data scientists, and engineers to gain insight; solving both business and technical problems. Our innovative solutions are a result of the diversity of our team.  Your Opportunity  As a team member, you'll build a breadth of knowledge including distributed systems, predictive analytics, and machine learning. You will design, develop, and deploy analytic pipelines to answer questions across multiple business areas and disciplines.  Our Ideal Candidate  We encourage learning through immersion, collaboration and action. We value adaptability and curiosity. Our ideal candidate is someone focused on solving tough problems using data and loves doing so.  As a Data Scientist, you will contribute with:Exploratory Analysis: Architect, design, and build data analysis pipelines working with large and complex data sets.Visualizations: Create visualizations to effectively convey the information discovered through analysis.Product Operations: Design experiments, build dashboards, and evaluate & define metrics to improve business performance.Requisition16022BRRequirementsAt a minimum, we are looking for people with the following skills:Excellent understanding of several statistical and machine learning modelsExtensive experience with data analysis tools such as R, Python, MatlabFamiliarity with Big Data technologies such as Spark, Impala, HadoopPreferencesYou'll be especially competitive if you have any of: Experience with Scala or JavaMS/PhD in a data related field such as mathematics, computer science, physics, or similarHow to Apply: Follow the link below.  Alternatively, send an email Sean Berger for an initial, confidential discussion. ** ViaSat is an EEO/AA/Disability/Protected Veteran Employer. U.S. Citizenship or Lawful Permanent Residence status may be required for certain positions. For positions requiring U.S. Citizenship or Lawful Permanent Resident status, verification of such status will be required upon accepting employment. "}