{"jobID": "2830439238", "jobLocation": "El_Segundo_CA", "jobTitle": "Sr Analyst-Global Process&System; Data", "companyRating": null, "companyInfo": {"Website": "www.loreal.com", "Headquarters": "Clichy, France", "Size": "10000+ employees", "Founded": " 1909", "Type": " Company - Public (LRLCY) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Procter & Gamble, Unilever, Estée Lauder Companies"}, "estimatedSalary": null, "jobDescription": "Purpose of role: We are looking for a Senior Analyst, Global Process&System; Data Lead to join our NYX Professional Make-up team in the Consumer Products Division of L'Oréal USA. Reporting to the Global Operations Performance Director, this role will support the Global Operations. Role Responsibilities:Lead the roll-out and monitoring of the monthly Planning cycle as per S&OP; calendar&process; definedEnsure the reliability of datas integration and end-to-end propagation : affiliates transmission quality, stock, demand, parametersCoordinate new flows/network set-up configuration ( vendors/customers)Facilitate the implementation of best practices, and ensure consistency in processes and procedures across Operations departmentMonitor activity performance with Global Operations Community through KPI's and action plansInfluences decision making in performance improvement and resolves obstaclesEscalates to direct manager timely for the resolution of issues and/or determine next stepsIs able to present project status and other relevant content comfortably to Senior Management as neededParticipate in cross functional project teams to develop/sustain Best in Class Supply Chain methodologiesCoordinate change requests, testing of new functionalities and non-regressionCoordinate Troubleshooting with IT and users, IT Incidents ManagementEnsure process users training as local Business Owner in coordination with Zone Core and CorporateParticipate to strategic Systems&Datas; transformation projects to support the Global businessKey Requirements:BA/BS degreeAnalytical and data orientedExperience in Supply Chain managementInternational experience in FMCG industryExperience in systems and process managementCompetencies required:IT proficiency required e.g. advanced Pack Office, SAP.Excellent cross functional influencing skillsGood ability to manage complexityGood ability to be creative and agile to make it happenAnalytical, excellent attention to detail and ability to step back to support the visionExcellent written and verbal communications skillsCultural awareness and sensitivity We are an Equal Opportunity Employer and take pride in a diverse environment. We do not discriminate in recruitment, hiring, training, promotion or other employment practices for reasons of race, color, religion, gender, sexual orientation, national origin, age, marital or veteran status, medical condition or disability, or any other legally protected status.  We are an Equal Opportunity Employer and take pride in a diverse environment. We do not discriminate in recruitment, hiring, training, promotion or other employment practices for reasons of race, color, religion, gender, sexual orientation, national origin, age, marital or veteran status, medical condition or disability, or any other legally protected status.  If you require a reasonable accommodation to complete an application for a recognized disability under applicable law, please email USApplicationAccommodation@support.lorealusa.com. Please note this email will only respond to specific requests for assistance completing the application as a request for accommodation for a disability. All others will not be considered.  Share Facebook LinkedIn Twitter Google Plus Viadeo Send to a friend  ? Back to job list"}