{"jobID": "2753202450", "jobLocation": "Bridgewater_NJ", "jobTitle": "Associate / Scientist Toxicology/Nonclinical Safety", "companyRating": null, "companyInfo": {"Website": "www.insmed.com", "Headquarters": "Bridgewater, NJ", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Public (INSM) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Company DescriptionInsmed is a biopharmaceutical company dedicated to improving the lives of patients battling serious lung diseases. We are focused on the development and commercialization of novel, targeted inhaled therapies for patients with high unmet needs battling orphan lung diseases. Insmed is a sustainable, patient-centered biopharmaceutical company at the intersection of Pulmonary, Orphan and Infectious Diseases.  Insmed understands that its most valuable resource is its employees. We place great value on the unique skills, talents and qualities that each of our employees brings to our company. We are building a world-class team with a focus on innovation, teamwork and the desire and ability to change the way our patients live.  Insmed is a fast-paced, high-energy organization that seeks talented individuals who are leaders in their respective functional areas of expertise, who are creative problem solvers and who have the desire to make a difference.Job DescriptionSUMMARY: Insmed is recruiting an Associate / Scientist Toxicology/Nonclinical Safety who will report to our Senior Director of Toxicology. This Scientist will lead nonclinical safety strategies for discovery and development programs, and work in close collaboration with colleagues in Research and Development. This motivated individual will oversee the conduct of contracted toxicology studies supporting discovery and development projects. This position is located at our headquarters facility in Bridgewater, New Jersey. RESPONSIBILITIES:Designs and monitors nonclinical studies in support of nonclinical safety development programs (toxicology/safety pharmacology);Analyze, interpret, and summarize nonclinical safety data and present data to internal project teams and leadership;Develop and implement target de-risking and screening strategies in discovery teams to support safety lead optimization efforts;Functions as a project toxicologist in project teams;Supports nonclinical sections of regulatory documents (safety pharmacology, pharmacokinetics and toxicology) of briefing books, investigational new drug applications (INDs), and investigator brochures. QualificationsMinimum Master's of Science degree or equivalent in Toxicology, Biology, Pharmacology or related scientific discipline.Minimum 7 years of biotech/pharmaceutical drug discovery/development experience.Advanced knowledge of Toxicology & Drug Metabolism and Pharmacokinetics (DMPK) also required.Expert knowledge of Good Laboratory Practices (GLPs). GLP Study Director experience is a plus.Demonstrated and applied knowledge of US and international regulatory requirements for the conduct and design of nonclinical safety studies.Experience with drug development of small molecules and biologics.Strong scientific background and scientific aptitude essential.Excellent critical thinking and scientific skills necessary.Ability to work effectively and collaboratively on cross-functional projects teams, and demonstrated can-do attitude.Exceptional communication skills (written and oral) also required.Diplomate of the American Board of Toxicology (DABT) preferred.Business travel requirement of approximately 5%. Additional InformationInsmed is an Equal Opportunity Employer and will judge all applicants based on their qualifications for the job, without regard to race, color, sex, religion, national origin, age, disability or any other characteristics protected by applicable federal, state or local law.  Unsolicited resumes from agencies should not be forwarded to Insmed. Insmed will not be responsible for any fees arising from the use of resumes through this source. Insmed will only pay a fee to agencies if a formal agreement between Insmed and the agency has been established. The Human Resources department is responsible for all recruitment activities; please contact us directly to be considered for a formal agreement.  Please note that we review every submission and we will keep all submissions on file for six months. Insmed is an Equal Opportunity Employer.Job LocationI'm interested"}