{"jobID": "2810885487", "jobLocation": "Burbank_CA", "jobTitle": "Payments Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.logixbanking.com", "Headquarters": "Burbank, CA", "Size": "501 to 1000 employees", "Founded": " 1937", "Type": " Nonprofit Organization", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Bank of America, Chase, Wells Fargo"}, "estimatedSalary": "71000", "jobDescription": " 0, 'is-rotating-backward': direction() Payments Data Analyst is responsible for developing and maintaining a Payments dashboard and ensuring the integrity of data gathering and reporting between partner vendors and Logix systems. Works with internal and external databases to assist in evaluating our card portfolios and identifying trends. Develops monthly and quarterly reporting of transnational data. Assists with key projects initiated by Payments Division. ESSENTIAL DUTIES AND RESPONSIBILITIES include the following. Other duties may be assigned. Develops knowledge and skills in current tools and practices in the Payments industry.Monitors, tracks, and creates reports for Senior Management, Loss Mitigation, Consumer Lending, and Sales on payments volume and performance of Payment products.Works closely with Programming and Digital Channels to extract data and assists Marketing in identifying targets for Payment related campaigns.Assists in developing recommendations to increase penetration, activation, and utilization of payments channel products and services.Creates reporting on Credit and Debit Card Rewards program and provides monthly analysis.Works with Payments Management to develop and produce a quarterly Payments update with data on Logix Payments products and trends in marketplace.Continuously reviews industry resources for Payments trends and innovations.Collaborates with Card Services, Programming, Digital Channels, Fraud Risk Management, and Finance on projects and analyses.Assists VP Payments on Payments related projects and analyses.Downloads monthly credit and debit card transnational data from card processor and provides to Accounting.Assists Manager Card Services with weekly card fraud reissues 0, 'is-rotating-backward': direction() Education and/or ExperienceBachelors degree in Business Management, Math, Statistics, or related disciplines.Must have experience developing and analyzing member transaction trends using statistical analysis and mathematical modeling.Minimum 3 years of experience performing financial analysis on products or programs.Must have a thorough knowledge of the Microsoft Office products particularly Excel and Access. Familiarity with Tableau is desirable.Working knowledge of financial institution operations preferred.Demonstrated ability to multi-task accurately and timely in a deadline driven environment; ability to work both independently and in a team.Demonstrated ability to effectively communicate to all levels of employees including senior management.Must have superior oral, written and presentation communication skills.Demonstrated ability to work with confidential data and ensure integrity of data.Must also demonstrate conduct consistent with our Corporate Values:Practice open Communication with all levels;Be Accountable by taking ownership of customer issues and responsibility for ones actions;Foster Teamwork by cooperating and collaborating with other employees;Seek ways to make the workplace Fun for oneself & others;Conduct oneself with Integrity by being honest, trustworthy and ethical in all work activities and interactions;Work with a Service Orientation by having a genuine concern for the needs of ones customers and by being friendly, professional and following through on commitments; andDemonstrate Humility in all interactions and remember to leave ones ego at the door when one arrives to work.Logix Federal Credit Union is an equal opportunity employer that does not discriminate in employment opportunities or practices on the basis of race, religion, color, sex, sexual orientation, gender identity, national origin, protected veteran or disability status, or any other status protected by law.#CB"}