{"jobID": "2795736639", "jobLocation": "San_Diego_CA", "jobTitle": "Data Assets Analyst I", "companyRating": null, "companyInfo": {"Website": "www.elevate.com", "Headquarters": "Fort Worth, TX", "Size": "501 to 1000 employees", "Founded": " 2014", "Type": " Company - Public (ELVT) ", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Our innovative online credit solutions provide immediate relief to customers today and help them build a brighter financial future. We are committed to rewarding borrowers’ good financial behavior with features like lower interest rates, free financial training, and free credit monitoring. Our suite of groundbreaking credit products includes RISE, Sunny, and Elastic. General Summary: The Data Assets Analyst is an important function in Elevate’s data management program. The Analyst works with the leader of the Data Assets team and other Risk personnel to maintain correct and consistent data flows, transparency of data assets available to the Risk organization, and quality assurance of the data invoicing process. Principal Duties and Responsibilities:Assist in the monthly and periodic accrual and invoicing processes for third party data flows.Work with Vendor Management and Security teams to collect and communicate information necessary for vendor reviews.Act as a point of contact for data providers and the Elevate Business and Legal teams.Assist in onboarding of third party data providers and coordinate cross-team communication and data availability.Assist with contract reviews and facilitate communication between internal portfolio, Risk, and Legal teams and data providers.Assist in the curation of data and data provider lists and hierarchies.Experience and Education:Minimum 4 year degree (BS/BA) required.Demonstrated experience using the Microsoft Office Suite (most importantly—Outlook, Excel, Word, Visio, and PowerPoint).Experience with statistical programming languages (SQL, SAS, R).Familiarity with credit bureau, third party, and/or financial data is a plus.Experience with third party data providers, invoicing, and interactions is a plus.Required Skills and Abilities:Thinking and Administrative Skills - Solid analytical and problem solving skills.Achieve Successful Results– Takes the initiative and responsibility.Demonstrates Adaptability– Works effectively in the faces of stress, ambiguity, difficult situations and shifting priorities.Communication Skills - Refined written and verbal communication skills. Ability to foster open communications, listen effectively and build strong partnership networks."}