{"jobID": "2821532508", "jobLocation": "Chicago_IL", "jobTitle": "Vice President, Applied Data Science", "companyRating": null, "companyInfo": {"Website": "www.civisanalytics.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We’re looking to hire a Vice President for our Applied Data Science team. ‘Applied Data Science’ is our data science consulting/custom solution-building/frontier problem-solving division of over 50 data scientists located in Chicago. This group includes applied data scientists in our commercial clients across consumer services, packaged goods, retailers, restaurants and hospitality and healthcare. Our team is on the leading edge of how to apply data science to critical business problems.  This person would be responsible for managing Civis’ current team, overseeing client delivery, and scaling our ADS business across categories. It’s a hard working and innovative position.  Here are some of the specific criteria that we’re looking for:  We’re looking for a doer, not a ‘strategist’ or subject matter expert. We expect this person, like all of our senior staff, to get into the weeds on our content, technology, and growing our team.  We are growing fast, and we’re looking for someone that has managed (and ideally built and scaled) a team of at least 100 people with quantitative and consulting skills. 7 years minimum experience is desired.  We’re looking for someone with deep client management experience at the senior level. Trust based on success is critical in this business, so we want to see how you build and maintain that trust for a constantly evolving business category.  As a company, were focused on building tools that our Applied Data Scientists will leverage to create interactive deliverables for our clients (and that our clients will use themselves), and we need someone to help guide that development with an eye towards what our ADS team needs.  We need someone who is willing to travel a good amount - mostly within North America.  We’re looking for someone with deep technical qualifications. This can mean a lot of things - deep academic experience in stats/machine learning, excellent on-the-job training in data science - so let us know in your cover letter and resume if you apply. We expect extensive knowledge in fundamentals, not just how to apply algorithms generically. Most of our code is written in SQL, R, and Python.  This is an exciting position for a growing team of true innovators, and we’re looking for the best.  Minimum  Qualifications  Demonstrated experience leading a team of 50+ consultants in a technology or data science organization.  Proven track record of year on year (YoY) growth in existing accounts  Proven track record of delivering consulting and implementation engagements at or above profit targets  Extensive experience presenting completed work or pitching new work to executive audiences  10+ years of experience in a consulting leadership and management roles  Experience writing proposals, building cost and pricing estimates of proposed work, and selling the work to new or existing clients  Bachelor’s degree in an analytical subject (statistics, math, economics, physics, etc) or Business  A strong foundation in statistics and data analytics expertise in survey research and/or statistical modeling. This will be demonstrated by having at least 5 years of experience working with large data sets to solve real-world business challenges for clients  Excellent interpersonal and communication skills  Demonstrated history of delivering high-quality analytic advisory work to decision makers  Preferred Qualifications  Advanced degree in an analytical subject (statistics, math, economics, physics, business, etc.) or Masters in Business Administration  Expertise in SQL and/or statistical packages (R, Python, STATA, etc)  Experience working for a consulting, services, or advisory firm  Familiarity with machine learning, and causal inference a plus."}