{"jobID": "2789362655", "jobLocation": "Arlington_VA", "jobTitle": "Technical Data Analyst, Senior", "companyRating": "3.6", "companyInfo": {"Website": "www.boozallen.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1914", "Type": " Company - Public (BAH) ", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Accenture, Deloitte, PwC"}, "estimatedSalary": "85000", "jobDescription": "Job Number: R0029349Technical Data Analyst, SeniorKey Role:Provide expertise in Joint technical data analysis to support F-35 foreign military sales (FMS) clients. Assist with the transformation of FMS custom legacy paper-based technical data products to digital data, including technical manuals, engineering drawings, maintenance, supply, and readiness data. Promote the commonality of technical data with the overall F-35 program technical data precepts and assist with the goal of ensuring FMS F-35 clients have access to technical data on a near real-time basis. Help FMS clients plan and customize their technical data needs and provide support for legacy technical data. Support technical data libraries for integration into the F-35 Autonomic Logistics Information System (ALIS). Build relationships with the client, client technical staff, and end users, analyze client and customer business needs, and research and propose products, systems, and solutions, as appropriate. Provide product development and implementation support, lead deployment teams in roll-outs at client and customer work sites, as needed, and perform or assist with customer and client training.Basic Qualifications:-Experience with contracts management, DoD acquisitions, and requirements management-Knowledge of FMS-Ability to work well in teams and interface with foreign nationals-Secret clearanceAdditional Qualifications:-Experience with aviation logistics, including technical data management-Knowledge of the F-35 program a plus-BA or BS degreeClearance:Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; Secret clearance is required.Were an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change."}