{"jobID": "2828730608", "jobLocation": "Grand_Rapids_MI", "jobTitle": "Principal Scientist - Formulations R&D;", "companyRating": null, "companyInfo": {"Website": "www.perrigo.com", "Headquarters": "Dublin, Ireland", "Size": "10000+ employees", "Founded": " 1887", "Type": " Company - Public (PRGO) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Watson Pharmaceuticals, Dr. Reddy's"}, "estimatedSalary": null, "jobDescription": " Perrigo  Research and Development/Analytical and Formulary • Allegan, Michigan  Perrigo Company plc, a leading global healthcare company, delivers value to its customers and consumers by providing Quality Affordable Healthcare Products®. Founded in 1887 as a packager of home remedies, Perrigo has built a unique business model that is best described as the convergence of a fast-moving consumer goods company, a high-quality pharmaceutical manufacturing organization and a world-class supply chain network.  Perrigo is the world's largest manufacturer of over-the-counter (\"OTC\") healthcare products and supplier of infant formulas for the store brand market. The Company also is a leading provider of branded OTC products throughout Europe and the U.S., as well as a leading producer of \"extended topical\" prescription drugs. Perrigo, headquartered in Ireland, sells its products primarily in North America and Europe, as well as in other markets, including Australia, Israel and China. Job Purpose: To facilitate development and commercialization activities to US Consumer Healthcare - Americas R&D; for new or reformulated Generic over-the-counter (OTC) ANDA pharmaceutical, NDA 505(b) (2) and OTC Monograph products meeting the company's First-to-File and First-to-Market strategy at a global level (U.S., Mexico & India).  Properly assimilate principles of Perrigo's Positive Workplace Policies and Code of Conduct by demonstrating and reinforcing appropriate behaviors that foster a workplace of trust, commitment, and accountability while striving towards results. Knowledge, Experience and Education:Bachelor's Degree in Pharmaceutical Sciences, Chemical Engineering or closely allied life sciences discipline with 9 or more years of relevant experience, -- orMaster's Degree in Pharmaceutical Sciences, Chemical Engineering or closely allied life sciences discipline with 7 or more years of relevant experience, --orPhD in Pharmaceutical Sciences, Chemical Engineering or closely allied life sciences discipline with 4 or more years of relevant experience.Technical Knowledge, Skills and AbilitiesComprehensive knowledge of pharmaceutical science and formulation development methodology used in the pharmaceutical industry is required.Demonstrated capability in design, execution and documentation of robust formulations and scalable manufacturing processes.Excellent communication skills and the ability to represent the department to both internal and external constituencies are required. Familiarity with project management methodology, demonstrated ability to lead project teams and mentor other scientists are required.Supervisory/Leadership Knowledge, Skills and AbilitiesPosition does not supervise.Ability to align with clear goals, direction, motivation, clarity, and support needed for self and others to excel in a continuous improvement culture.Ability to organize appropriately in an environment requiring strict adherence to timelines.Use the appropriate amount of analysis, experience and judgement to make clear/concise decisions.Excellent communication skills including strong verbal and interpersonal skills to lead and influence.Major Duties:Major Duties / Responsibilities% of TimeAlignmentStrategy deployment (Collaborative development of business and behavioral result targets that align with segment and corporate objectives.Communication (Develop systems to assure effective cascade of business information)Leader Visual Management (Develop system to assure effective visibility of metrics that enable next levels to develop daily management systems that support overall strategy)20EnablementIndividual Development (Connecting to overall strategy, maintain development system for employees including E.I., scientific skill advancement, and career development)Coaching/Mentoring (Monitor, maintain, improve system for developing employees in problem solving to drive both business results and desired behaviors)Recognition (Monitor, maintain, improve system for simple recognition of observed desired behaviors and attainment of desired business results)20ImprovementUse team, department and organizational metrics to drive improvement in quality and throughput of products and knowledge.Lead product/process development, analytical methods development and validation, and commercialization activities as a technical leader for new immediate-release and modified-release solid oral dosage and liquid oral dosage forms to meet corporate goals.Lead the manufacture of Pivotal/Registration lots for new products in the Product/Process Development Pilot Plant and Manufacturing facilities.Design and supervise or perform quality scientific experimentation to develop robust processes in support of Product Development activities.Contribute to the development of new experimental approaches.Design and conduct stability studies.Analyze and defend scientific results from experiments.Generate accurate, reliable data by following established procedures and practices to support product and analytical development. Provide technical and review of technical documents, including but not limited to: o Master Batch Records for Experimental, Pilot/Pivotal, scale-up and process validation batches, Development Report and regulatory documentation Interact with regulatory agencies.Perform effective problems solving, resolution, and implementation of process improvements in designated day-to-day operations and participate in large scope product/process development and improvement projects.Ensure compliance of all formulation activities to applicable cGMPs, cGLPs, any specific regulatory guideline, and company SOPs on a consistent basis. Conduct routine laboratory audits and involvement in activities associated with third party laboratory audits, as required.60Organization Structure and Functions: Does not superviseTotal Direct Reports: n/aTotal Indirect Reports: n/aAdditional Information: List any information not included in the previous answers that is important to know about the position. (Do not exceed 3-4 key points.)Project duration ranges from 6 months to 5 yearsPrinciple Challenges:Typical Problems:Providing scientific and technical leadership that ensure innovation while also meeting compliance standards is a challenge.Interpreting complex experimental data to develop formulation recommendations or develop analytical testing recommendations.Managing changes in the life cycle of each project.Ensuring the accuracy of records of research outcomes and maintaining compliance with regulatory requirements and the company's operating standards.Most Complex Problems:Significant changes in project priorities to meet business opportunities, while supporting on-going activities represents an additional complex challenge.Managing multiple, complex technologies/projects; and maintaining focus while involved in multiple, concurrent projects present complex challenges.Decision Making Authority: Identify the types of decisions that this job has the authority to make on its own as well as those that must be referred to others. In both cases, include authority for decisions regarding issues of policy and procedure, administrative matters, and personnel (hiring, firing, salary increases, etc.).Typical decisions (total authority):Develops critical judgment as decisions require solutions to complex problems, which could cause significant delays in project timelines and result in considerable allocation of resources.Uses high-level scientific judgment to adapt and create techniques using prior work experience; proactively consults colleagues and management to ensure alignment of judgment.The incumbent evaluates the quality of research data and provides feedback and direction to subordinate teams to ensure scientific processes are robust and defensible.Other decisions (referred for approval):Changes in project priorities are reviewed with Scientific Affairs leadership. Significant changes which impact budgets or project deadlines are reviewed with the Senior Director or VP.Financial Dimensions: Provide financial dimensions about the position that will best describe or measure its size, influence, or effect on the business. Think in terms of items/areas that the job must manage, control, influence, or impact in a measurable way. Enter \"not applicable\" if the financial impact of the job cannot be determined.Financial DimensionAmountType of Control § Capital $0.4M Contribute/Share  § Project Budget $4M $1M Contribute/Share  § Revenue Impact $5M Contribute/Share Screening, Milling or MicronizingRoller CompactionLow or High Shear Wet GranulationFluid Bed Granulation or CoatingFluid Bed or Conventional DryingHot Melt Capsule FillingTablet or Capsule Pan CoatingLow or High Shear BlendingCapsule Banding An Equal Opportunity Employer - M/F/D/V  Due to the highly regulated pharmaceutical industry and legal requirements, you may be subject to post employment background checks.  Equal Employment Opportunity/M/F/disability/protected veteran status.PI103123271"}