{"jobID": "2825113132", "jobLocation": "Mattawan_MI", "jobTitle": "Associate Director - Senior Scientist - Cellular and Molecular Biology", "companyRating": null, "companyInfo": {"Website": "www.criver.com", "Headquarters": "Wilmington, MA", "Size": "5001 to 10000 employees", "Founded": " 1947", "Type": " Company - Public (CRL) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Associate Director - Senior Scientist - Cellular and Molecular Biology  Req ID #: 37785 Location: Mattawan, MI, US, 49071  For 70 years, Charles River employees have worked together to assist in the discovery, development and safe manufacture of new drug therapies. When you join our family, you will have a significant impact on the health and well-being of people across the globe. Whether your background is in life sciences, finance, IT, sales or another area, your skills will play an important role in the work e perform. In return, we'll help you build a career that you can feel passionate about.  Job Summary  We are seeking an experienced Associate Director - Senior Scientist for our Cellular and Molecular Biology Team located in Mattawan, MI.  An Associate Director - Senior Scientist - Cellular and Molecular Biology (AD Sr Scientist CMB) is responsible for: management and mentoring of CMB personnel; providing scientific leadership and general oversight of research personnel in the CMB group; performing cellular and molecular biological procedures for Sponsors and in-house needs, including assay development, study-specific procedures, and in-vitro (cell-based), molecular, biochemical, and/or electrophysiological assays, including the evaluation of new methodologies. The individual in this role: handles capital appropriations requests (CAR) and budgeting oversight; contributes expertise to strategy development, quality and performance metrics, and project risk assessments; and may function in the role of a Contributing Scientist, Principal Investigator, or Study Director.  The following are minimum requirements related to the Associate Director - Senior Scientist position. PhD in relevant field and 4-7 years in specialty preferred; orMaster's degree in relevant field and 10-14 years in specialty preferred; orBachelor's degree in relevant field and 14-18 years in specialty preferred.5 years of management experience preferred.Significant training and expertise in in vitro, molecular biology, biochemical, and/or electrophysiological techniques and assays.An equivalent combination of education and experience may be accepted as a satisfactory substitute for the specific education and experience listed above.Outstanding track record in method development.Proven proficiency in data analysis, research design, troubleshooting, and the evaluation of new technologies and procedures for a cellular and molecular biology lab.Demonstrated ability to interpret and summarize scientific results in a clear, concise, and accurate manner.Demonstrated ability to work independently and in a team environment to solve research-related problems and implement new technologies.Possesses good oral and written communication abilities and strong organizational skills.Basic familiarity with Microsoft Office Suite.Computer skills, commensurate with Essential Functions, including the ability to learn a validated system.Ability to work extended hours beyond normal work schedule to include, but not limited to evenings, weekends, extended shifts, and/or extra shifts; sometimes on short notice.Ability to work under specific time constraints. About MPI Research, a Charles River Company  MPI Research is a premier non-clinical contract research organization (CRO) providing comprehensive testing services to biopharmaceutical and medical device companies worldwide.  About Safety Assessment  Charles River is committed to helping our partners expedite their preclinical drug development with exceptional safety assessment services, state-of-the-art facilities and expert regulatory guidance. From individual specialty toxicology and IND enabling studies to tailored packages and total laboratory support, our deeply experienced team can design and execute programs that anticipate challenges and avoid roadblocks for a smooth, efficient journey to market. Each year approximately 120 investigational new drug (IND) programs are conducted in our Safety Assessment facilities.  About Charles River  Charles River is an early-stage contract research organization (CRO). We have built upon our foundation of laboratory animal medicine and science to develop a diverse portfolio of discovery and safety assessment services, both Good Laboratory Practice (GLP) and non-GLP, to support clients from target identification through preclinical development. Charles River also provides a suite of products and services to support our clients' clinical laboratory testing needs and manufacturing activities. Utilizing this broad portfolio of products and services enables our clients to create a more flexible drug development model, which reduces their costs, enhances their productivity and effectiveness to increase speed to market.  With over 11,000 employees within 70 facilities in 18 countries around the globe, we are strategically positioned to coordinate worldwide resources and apply multidisciplinary perspectives in resolving our client's unique challenges. Our client base includes global pharmaceutical companies, biotechnology companies, government agencies and hospitals and academic institutions around the world. And in 2016, revenue increased by 23.3% to $1.68 billion from $1.36 billion in 2015.  At Charles River, we are passionate about our role in improving the quality of people's lives. Our mission, our excellent science and our strong sense of purpose guide us in all that we do, and we approach each day with the knowledge that our work helps to improve the health and well-being of many across the globe. We have proudly supported the development of ~70% of the drugs approved by the FDA in 2016.  For more information, please visit **************.  Charles River Laboratories, Inc. is an Equal Opportunity Employer M/F/Disabled/Vet  Nearest Major Market: Kalamazoo  Job Segment: Molecular Biology, Biochemistry, Scientific, Toxicology, Scientist, Science, Engineering"}