{"jobID": "2817628510", "jobLocation": "Charlevoix_MI", "jobTitle": "Business Data Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "The Opportunity Interested in trailblazing through the complex and rewarding world of data analysis? Here you will have the opportunity to take on multiple, diverse duties across the entire Manthei family of businesses. You will never be bored and you’ll have lots of front line exposure to team members and projects across the organization. Innovation and creativity are built into the DNA of the company and are encouraged at all levels of employment. Every day we solve complex technical and business problems with ingenuity and simplicity. We’re making history and the good news is we’ve only just begun. And did we mention that there is a microbrew operation on one of the grounds? The Position The role of the Business Data Analyst is critical to the proper functioning of business information systems. As an owner of the data these systems contain, the Business Data Analyst must continuously verify the integrity of the data and reporting generated from them, in order to ensure that management is making decisions based on correct information. Proper data maintenance takes place in many forms, from validating and troubleshooting automated scripts and reports, to sanitizing data inputs from business users. Additionally, providing access to the existing data is managed and guided by the Business Data Analyst to ensure flexibility and accuracy of business user reports and tools.  The ideal candidate is someone who enjoys solving problems. Striving for accurate solutions is a driving force in how they think and work. They must demonstrate a strong ability to distill complex concepts and data into clear, simple visualizations and reports. They must excel at conversational requirements gathering and drilling into the “question behind the question,” providing better clarity for the problem at hand. The ResponsibilitiesCreate and maintain queries and searches in T-SQL and PL/SQL using industry best practicesCollect, manipulate, and analyze data from a variety of sources such as Excel, CSV, MS SQL Server, and Cloud service APIsCreate and maintain custom ERP scripts using Javascript and the SuiteScript API, following industry best practicesPrepare reports, which may be in the form of visualizations such as graphs, charts, or dashboardsAssist in the curation of the organization’s data, ensuring that the data repositories produce consistent, reusable dataAssist in the maintenance and customization of the organization’s ERP software user interfaceAssist other IT staff as needed to maintain business systems and networks required for daily operationsProvide assistance and training to users of the organization’s ERP and other financial software, such as ExcelThe Requirements5+ years of business analysis experienceBachelors in Computer Science, Data Analytics/Data Science, or similarHigh level of proficiency using SQL queries and databasesIntermediate proficiency with Javascript and API programmingAccounting or finance experience highly preferredComfortable working in and around a manufacturing environment Thank you for your interest in this opportunity! If you're a go-getter and know your stuff, please don't hesitate to apply today!"}