{"jobID": "2836562142", "jobLocation": "Chicago_IL", "jobTitle": "Audit Manager II - Data Analytics Manager", "companyRating": "3.8", "companyInfo": {"Website": "www.northerntrust.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1889", "Type": " Company - Public (NTRS) ", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "111000", "jobDescription": " The Data Analytics (DA) Audit Team is a newly created team within the Audit Services Department. This highly visible position will be responsible for developing the plan to implement the Audit Services' data analytics strategy. The DA Audit Team will be a centralized unit within Audit Services with a physical presence in Chicago and India and supports the global Audit Services Department. The DA Audit Team Manager will oversee the development of the function with a focus on hiring highly talented individuals; collaborating with Audit Services Leadership to increase utilization and conduct impactful analytics supporting testing, risk assessments, and other reporting; and engaging with the corporate Northern Trust Data Analytics Team to leverage their experience, tools, and knowledge. The DA Audit Team Manager will also ensure the acquisition, development, and retention of diverse talent, leveraging innovative strategies to attract and retain top talent and build a high-performing team. The DA Audit Team Manager will also conduct the performance management process, identify training and development needs, and establish performance standards for the function.  Key Responsibilities Enhances and implements the analytics strategy for the Audit Services DepartmentEstablishes protocols to work with the business and Audit Services Team to obtain accurate, meaningful information to support the completion of the audit workFrames output from the analytics performed to bring new insightful opportunities to support the audit process, using various analytical tools and visualization techniquesFosters a culture of deep learning of the business to build credibility and improved analyticsDisplays a balanced, cross-functional perspective, liaising with the audit teams to improve efficiency, effectiveness, and productivity of testing/assessmentMakes recommendations to evolve the Audit Services' methodology to embed DA specific steps, expectations, and protocols around DAPromotes the utilization of DA in all aspects of the audit process; and supports the Audit Services' Department initiatives to strengthen DA capabilities across all staffLeads in the development of meaningful analytics to measure the utilization and impact of the DA Team across Audit ServicesCollaborates with the corporate Northern Trust Data Analytics Team to stay apprised of their initiatives, tools, and challengesEngages with industry practitioners regularly to learn about best practices, and gain insightful competitive and regulatory intelligence to help build excellence in our analytics initiativesCompletes various and complex initiatives involving multiple disciplines and/or ambiguous issues to develop testing and/or tools to assess riskRequirementsStrong analytical, leadership, and organizational skillsA college or university degree, and strong analytics background (statistics, math) requiredAdvanced education in a quantitative field is preferredExperience with extract, transfer load (ETL) processes, SQL, data models, data visualizationExperience using statistical software or knowledge of various data mining and analytical tools (e.g., SSRS, SAS)Familiarity with other analytics tools (e.g., Microsoft Business Intelligence Suite, QlikView) Skills and Experience Financial services internal audit subject matter expertiseExperience establishing strategy and gaining stakeholder alignmentAbility to communicate and train a non-technical audience technical conceptsTeam player, able to manage/lead work across functionsExcellent oral and written communication skillsHigh degree of learning agilityPrior management experienceAbility to work in a fast pace, dynamic, global environment with limited directionStrong execution skills For more than a century, Northern Trust has worked hard building our legacy of outstanding service, expertise and integrity. From a Chicago-based bank founded in 1889, we now have more than 20 international locations and 16,500 employees globally. We serve the world's most-sophisticated clients from sovereign wealth funds and the wealthiest individuals and families, to the most-successful hedge funds and corporate brands.  We burnished our reputationas a global leader delivering innovative investment management, asset and fund administration, fiduciary and banking solutions enabled by sophisticated, leading technology. And through it all, we continually laid a solid, forward-looking foundation on which future generations can continue growing and achieving greater.  As of March 31, 2018, Northern Trust Corporation had:  $10.8 trillion in assets under custody/administration  $8.1 trillion in assets under custody  $1.2 trillion in assets under management  $130 billion in banking assets"}