{"jobID": "2658420329", "jobLocation": "Santa_Cruz_CA", "jobTitle": "Engagement Manager, Professional Services", "companyRating": null, "companyInfo": {"Website": "www.looker.com", "Headquarters": "Santa Cruz, CA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Tableau Software, Chartio, Periscope Data"}, "estimatedSalary": null, "jobDescription": "WHO WE ARELooker is on a mission to bring better insights and data-driven decisions to every business. Everything we do is aimed at making sure our customers love every aspect of Looker, from our products and technologies to our ease of doing business and our support. We are looking for curiously brilliant individuals to join our team as we reinvent data analytics. Get data-driven and see yourself at Looker.WHO WE ARELooker is on a mission to bring better insights and data-driven decisions to every business. Everything we do is aimed at making sure our customers love every aspect of Looker, from our products and technologies to our ease of doing business and our support. We are looking for curiously brilliant individuals to join our team as we reinvent data analytics. Get data-driven and see yourself at Looker.WHAT WE'VE GOT GOING ONLooker is seeking a technically savvy Engagement Manager (Project Manager) to ensure timely, successful implementations of Looker’s Business Intelligence software. In this role, you will collaborate with the pre-sales and services teams to help customers derive value out of their Looker implementation. You will manage multiple (40+) customer projects simultaneously, with multiple Looker teammates. This includes managing flow of customer projects, documenting requirements and timelines, providing customers with timely support, managing open issues related to each project, ensuring communication across Looker teams, and ensuring successful completion of each engagement. You will grow to provide a compelling perspective of the Looker customer implementation process, helping drive Services revenue at Looker. The right candidate for this role is customer oriented with strong analytical and communication skills, project management expertise, and interest and passion for BI. You must be able to articulate value, inspire and lead Looker customers through each project.WHAT WE NEED YOU TO DO Serve as project lead and primary interface and point of contact for customerSelect and assigning Professional Services consultants to each projectOwn all of the functional aspects of customer projects including project management, documentation of requirements and timeline, resolution of open issues, communication of status and moreScope and prepare Statements of Work (SOW) for fee-based custom engagementsCoordinate and work closely with the other members of the Looker Customer Success teamManage all customer communication, including email, phone and face-to-face meetingsServe as a customer advocate within Looker escalating issues and driving feature requestsPossess a comprehensive understanding of the Looker products and servicesAssist in the continued development of the Looker Professional Services team by mentoring, contributing to our training content, and improving the Looker Services methodologiesWHAT YOU BRING TO LOOKER Stellar listening, speaking, presentation and writing skillsStrong ability to multi-task, managing multiple concurrent work threadsSelf-directed with the ability to manage simultaneous, complex engagements with minimal supervisionAbility to set and manage customer expectations and to negotiate appropriate resolutions to issuesExceptional project management skillsPMP certification a plus but does not replace relevant work experienceExpertise is SaaS platformsExperience working with business intelligence software is preferred5+ years relevant work experienceBusiness acumen and strong consulting skills and experienceBA/BS degree required, ideally in a quantitatively oriented degree (e.g. Computer Science, Math, Statistics, Economics) from a top-tier schoolAbility to travel c. 10% of the timePreferred: Proficiency in SQL/RDBMS technologies; knowledge of database structure, design, and modeling concepts; and/or experience in currently available suite of BI toolsA LITTLE MORE ABOUT LOOKERLooker is a complete data platform that offers data analytics and business insights to every department and easily integrates into applications to get data directly into the decision-making process. The company is powering data-driven cultures at more than 800 industry-leading and innovative companies such as Sony, Amazon, The Economist, Kohler, Etsy, Lyft and Kickstarter. The company is headquartered in Santa Cruz, California, with offices in San Francisco, New York, London and Dublin, Ireland. Investors include CapitalG, Geodesic Capital, Goldman Sachs, Kleiner Perkins Caufield & Byers, Meritech Capital Partners, Redpoint Ventures, First Round Capital, Sapphire Ventures, and PivotNorth. For more information, connect with us on LinkedIn, on Twitter, Facebook, G+ and YouTube.A LITTLE MORE ABOUT LOOKERLooker is a complete data platform that offers data analytics and business insights to every department, and easily integrates into applications to deliver data directly into the decision-making process. The company is powering data-driven cultures at more than 1200 industry-leading and innovative companies such as Sony, Amazon, The Economist, Spotify, Etsy, Lyft and Kickstarter. The company is headquartered in Santa Cruz, California, with offices in San Francisco, New York, Chicago, Boulder, London and Dublin, Ireland. Investors include CapitalG, Kleiner Perkins Caufield & Byers, Meritech Capital Partners, Redpoint Ventures, First Round Capital, Sapphire Ventures and Goldman Sachs. For more information, connect with us on LinkedIn, on Twitter, Facebook, G+ and YouTube.Looker aspires to be a workplace that is not only free of discrimination, but one that fosters inclusion and belonging. We strongly believe that diversity of experience, perspective, and background lead to a better environment for our employees and a better product for our users. We encourage like-minded individuals to join us in changing the way businesses use data."}