{"jobID": "2803586093", "jobLocation": "Marina_del_Rey_CA", "jobTitle": "Vice President, Data Science", "companyRating": null, "companyInfo": {"Website": "www.dollarshaveclub.com", "Headquarters": "Marina del Rey, CA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "ABOUT DSC: Were on a mission to build a better bathroom. We started with razors way back in 2011, and now millions and millions of Members later, weve expanded into shave & shower products, oral care, and hair styling, with more to come. Were always growing and reinventing, and we rely on killer talent to help us achieve our goal of owning the bathroom. If youre a collaborative innovator, that prefers to work with a team, youll fit right in. A sense of humor helps, too. About Engineering at DSC Behind DSCs strong consumer-facing brand and high volume digital products is a lean and mean award-winning team of sixty engineers who architect and build our high-volume consumer-facing site, award-winning Native Mobile Apps, RESTful-ish APIs, Highly Scalable Subscription Billing & Fulfillment Systems, Internal Tools & Capabilities, Data Pipelines and Data Science capabilities and the cloud-native Infrastructure that hosts all the magic. Youll find more details about our stack in this Highscalability.com article and our interviewing philosophy in this Forbes article.  Were a team that prides itself in technical excellence, speed of delivery and craftsmanship. We like to explore cutting-edge technologies and regularly challenge ourselves to improve our technology and processes. Were currently transitioning to a Continuous Delivery software development model. Were a highly-motivated and self-driven bunch that takes ownership and pride in the products we build for our customers, both within the company and consumers. We value mentorship and take pride in building engineers into well-rounded technologists and leaders, who can in turn build more technologists and leaders.  Were a small team doing big disruptive things. Youll often wear multiple hats and get a holistic, multi-faceted career-building experience working for us. Come join us. About this Role Were looking for a seasoned entrepreneurial technology leader to lead our Data Science and Data Engineering team. As Vice President, Data Science youll be part of the Engineering Leadership team and will be responsible for managing data engineers and data scientists, making key data technology platform decisions, setting the strategy for our Data Science practice, setting the technical direction and be a change agent as we transition to Continuous Delivery. Youll be a technology consultant, advocate and partner for the Digital Product Management, Customer Strategy, Data Systems and Project Management teams. Detailed Responsibilities Project Delivery: Working collaboratively with our business partners to ideate, scope, plan, estimate, coordinate, derisk and deliver impactful Data Science solutions and data pipelines.Identifying process bottlenecks and opportunities for continuous improvement of our software delivery processes and our data science model delivery process.Identifying and flagging risks early, working proactively to remove blockers for the team.Allocating team bandwidth based on business needs.Playing the role of a Product Owner for our Data Science initiatives, ideating, collecting and documenting requirements. Business Alignment: Partnering with Data Systems, Backend Engineering, Infrastructure, Digital Product Management and Customer Strategy teams to come up with creative technology solutions to business problems.Improving visibility into projects and outcomes for business partners.Evangelizing our Data Science strategy & practice to our internal stakeholders.Communicating technical topics effectively to business partners.Deeply understanding business needs, identifying opportunities for Data Science and aligning the team with business priorities. Evolving the Data Technology Platform: Regularly evaluating and stress testing our Data Technology tech stack and identifying opportunities and risks.Keeping up with the latest trends in Data technologies, and evaluating their fit for DSC.Collaborating with external data technology vendors to leverage their capabilities, while balancing it with in-house capabilities.Architecting our data technology platform with privacy and security and ensuring compliance with global data privacy regulations.Nurturing the architecture of our Data Technology platforms as we regularly add features to it.Collaboratively building a Data Technology platform roadmap and driving the delivery and execution of it.Driving continuous testing/integration/delivery best practices for our Data Technology platforms.Fostering healthy discussion on technology topics within the team and drive them towards making data-informed decisions.Ensuring that our production data applications and build pipelines are performant, reliable, responsiveness, maintainable and of high quality with minimal tech debt.Define standards for data modelling, toolsets, technology architecture and frameworks. Team Building & Management: Attracting, hiring & retaining highly skilled data engineers and data scientists.Assessing skills & building career development plans for their team members.Performance management and upholding deadlines/goals for team members.Mentoring the team on both Technical and Leadership aspects.Setting actionable goals for their team, aligned with our company goals.Fostering good working relationships both within their team and with other teams. Individual Contribution: While this position is not expected to be an individual contributor on a consistent basis, a person filling this role is expected to be hands-on enough to be able to jump in and help their team with technical issues or handle production spelunking as needed. To this end, picking a small project or two every now and then to keep in touch with our stack is expected.What were looking for10+ years of experience in data applications development, statistical modelling & machine learning with increasing responsibilities, with at least 5 of those managing teams of 15+ data engineers, data engineers and engineering managers.Prior experience in the E-Commerce & Marketing Analytics Domain.Experience leading cross-functional teams and delivering projects using Agile development practices.Experience with Continuous Delivery for data applications is a big plus.Experience with Supervised & Unsupervised Machine Learning Algorithms.Experience with Data Mining.Experience with Statistical Modelling.Experience with Data Technologies: Spark, Hive, Redshift, AWS EMR, S3 and other AWS Data Tech.Experience with Python, Scala, R, SQL, Ruby.Experience with numpy, scipy, pandas, scikit-learn, MLib or equivalent.Experience with streaming technologies: Kafka, Kinesis, Spark Streaming.Experience with Serverless & microservices architecture.Experience with Data Visualization.Experience with Deep Learning frameworks such as Tensorflow, Keras, Theano, etc is a big plus.Strong presentation skills and written & spoken communication skills.A passion for mentoring and building strong technical leaders.----------- Dollar Shave Club is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, disability, or protected veteran status.  Reasonable Accommodation: Dollar Shave Club provides reasonable accommodation so that qualified applicants with a disability may participate in the selection process. Please advise us of any accommodations you request in order to express interest in a position by e-mailing: accommodations@dollarshaveclub.com  Please state your request for assistance in your message. Only reasonable accommodation requests related to applying for a specific position within Dollar Shave Club will be reviewed at the e-mail address supplied.  Dollar Shave Club will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.  Thank you for considering a career with Dollar Shave Club #LI-CB1"}