{"jobID": "2749245114", "jobLocation": "Fresno_CA", "jobTitle": "Registered Nurse (RN), Labor & Delivery, Full Time, 12 Hours", "companyRating": null, "companyInfo": {"Website": "www.communitymedical.org", "Headquarters": "Fresno, CA", "Size": "5001 to 10000 employees", "Founded": " 1897", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OverviewCommunity Regional Medical Center (CRMC) is the flagship hospital of Community Medical Centers – a not-for-profit healthcare system based in Fresno, California, and the largest healthcare provider and private employer in central California. We measure up with top hospitals nationally and are the 3rd largest in California. CRMC encompasses several additional campuses totaling 909 beds to offer the most comprehensive care to our region which includes; the Fresno Heart and Surgical Hospital, a behavioral health center, a subacute and transitional care center, a cancer center, and home health services.  CRMC is home to the only Level 1 Trauma Center and has the only comprehensive burn care in the Valley serving 2.5 million people within 9 counties. The 56,000 square-foot emergency department is one of the largest and busiest in the state. We have an 84 bed Level 3 NICU and a brand new pediatric specialty care unit. Future plans include building a women and children’s facility on campus and expanding with 65 additional beds.  We are affiliated with one of the top medical schools in the nation - University of California San Francisco Medical School that offers our employees to work with some of the brightest physicians and medical specialists in the nation. We provide excellent health benefits along with a 403(b) package to plan for your future. Additionally, you will accrue paid time off (PTO) from your first day of employment. Other Benefits include; Long-term Disability Insurance, Basic Life Insurance, Accidental Death and Dismemberment Coverage, Educational Reimbursement, Employee Assistance Program, Credit Union Membership, Retirement Planning classes, onsite Fitness Center with free Personal Trainers, 24 hour Subway and concierge services.  Our ability to provide the highest level of care begins with our incredible staff. This is why we provide unparalleled resources, benefits and a variety of incentives – including referral bonuses, special compensation packages and generous relocation bonuses for eligible positions.  ResponsibilitiesThe role of the clinical nurse is to deliver patient care through assessment, planning, implementation, and evaluation of patient needs with the highest professional standard while promoting nursing excellence through continued education and research, based on the Title 22 and Title 16, the ANA Scope & Standards of Practice, the Code of Ethics.QualificationsMinimum requirements include:Graduation from an accredited registered nursing program. Current RN license for the state of California and BLS certification.Adult Cardiac Life Support (ACLS) certification within 6 months of hire or transfer into job. Fetal Monitoring certification must be obtained within 6 months of hire or transfer into job. Neonatal Resuscitation Program (NRP) certification must be obtained within 6 months of hire or transfer into job.Benefits We Offer We provide robust benefit plans with competitive premiums for medical and dental/vision along with retirement plans. Additionally, you will accrue paid time off from your first day of employment. Other Benefits include: Long-term Disability Insurance, Basic Life Insurance, Accidental Death and Dismemberment Coverage, educational and professional certification reimbursement, Employee Assistance Program, Credit Union Membership, Fitness Center, 24 hour Subway, onsite concierge service, and Retirement Planning classes."}