{"jobID": "2817445694", "jobLocation": "San_Antonio_TX", "jobTitle": "Clinical Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.sahealth.com", "Headquarters": "San Antonio, TX", "Size": "5001 to 10000 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "66000", "jobDescription": "Methodist Healthcare is recognized as the most respected and preferred healthcare provider in the South Texas community because of our outstanding team of nurses, medical professionals and physicians . We are the market leader. More people turn to our San Antonio doctors than any other hospital or system when they need healthcare.  Methodist Healthcare is more than doctors and nurses, technicians and therapists. We rely on people with non-clinical hospital jobs to keep things running smoothly. At Methodist Healthcare, you're very important. We recognize the professional commitment it takes to support excellent healthcare. We recognize - and appreciate - the people who work in service and healthcare administration jobs. We are 'Serving Humanity to Honor God' by providing exceptional and cost-effective health care accessible to all, and we invite you to be part of the best - JoinMEthodist.  General Statementof Duties : The Clinical Data Analyst translates business needs into the development of analytical work products using a number of market leading software packages including those used for building reports, dashboards/scorecards and other guided analysis applications and extract-transform-load (ETL) programs.  The position will perform a key role to help Methodist Healthcare achieve its strategic goal of pushing timely and actionable information to leaders and stakeholders. The candidate will work collaboratively with MHS and HCA IT&S; to optimize work effort, develop common solutions, and share best practices.  Proficiency is expected for relational databases. Competence with facets of emerging technology is also expected, such as Big Data, Interactive Visualization, Predictive Analytics, and Search-Based Data Discovery. The role requires working closely with others, frequently in a matrixed environment, and with little to moderate levels of supervision. The successful candidate must be an out-of-the box thinker who can learn, implement and execute repeatable and effective processes and deploy solutions in the most time efficient manner with the highest level of quality at the lowest cost. The culture of our organization places an emphasis on teamwork, so social and interpersonal skills are as equally important as technical capability. Qualifications:Education :Bachelor's degree in Information Technology, Business, or Healthcare from accredited college or university. Experience:3 years information systems development experience with a proven track record of execution and results 3 years of healthcare IT or healthcare decision support experience3 years experience with advanced Microsoft Excel and Access reporting3 years experience with SQL and Relational Databases (MS SQL Server, Oracle, or Teradata)3 years experience creating dashboard and scorecards, and dashboard software such as MS PowerBI, Tableau, Qlikview, or other analytics software Preferred: Experience training and developing others in the use and application of reporting systems data and information for clinical and operational improvement Company Description:At its founding in 1968, Nashville-based HCA was one of the nation's first hospital companies. Today, we are the nation's leading provider of healthcare services, a company comprised of locally managed facilities that includes about 165 hospitals and 115 freestanding surgery centers in 20 states and England and employing approximately 204,000 people. Approximately four to five percent of all inpatient care delivered in the country today is provided by HCA facilities. Milton Johnson serves as Chairman and Chief Executive Officer of HCA."}