{"jobID": "2837863697", "jobLocation": "Richardson_TX", "jobTitle": "Sr Manager, IT Data Analytics", "companyRating": "2.8", "companyInfo": {"Website": "jobs.cvshealth.com", "Headquarters": "Woonsocket, RI", "Size": "10000+ employees", "Founded": " 1963", "Type": " Company - Public (CVS) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Walmart, Walgreens, Express Scripts"}, "estimatedSalary": "109000", "jobDescription": " Job DescriptionThe Senior Manager - IT Data Analytics - Client Integration will manage directly and through influence, a team of Platform Architects and automation/data engineers who partner with PM's to implement a robust and scalable reporting and analytics platform. You will establish the vision and ensure the team has the tools, resources and skills they need to deliver on critical Data & Analytics commitments while tracking ongoing execution and delivery of pilots and projects. We're seeking a dynamic leader passionate about driving change and influence across the enterprise across a broad spectrum of analytics from descriptive-diagnostics- predictive -prescriptive. You should have flexibility, adaptability, and easily pivot in a fast-paced environment. An entrepreneurial inclination to discover novel opportunities for applying analytical techniques to business/scientific problems across the company is also key.You will lead cross-disciplinary teams on solving business problems using analytics, typically involving large data sets. These cross-disciplinary teams typically include data scientists, engineers, functional leaders from various areas in PBM business and IT functions that come together to work on applying data and analytics to drive operational excellence in services. Potential application areas include driving excellence in modern data architecture to enable and accelerate AI/ML/DL adoption in the company; as well as enabling customer-oriented analytics offerings.Your responsibilities will include but are not limited to:- As a visionary, you will use data and analytics to drive critical business decisions, business strategy and able to serve as coach / mentor for data analysts on the team- You will manage cross-functional teams, and provide business / functional perspective to data science projects, and support problem scoping and structuring- You will lead all data related activities (data discovery and organization on SQL/Big data stack, cleansing and data prep) to support development of new data science approaches and methodologies (e.g. neural nets, CART, Bayesian methods, etc.) to improve operations and business outcomes- You will manage programs, including operationalization of analytic methods and products in functional settings, and drive agile development of new methods and capabilities- You will ensure customer adoption & drive consumption of analytics, and maximize usage and use of analytics with customers- You will maintain effective working relationship with business leaders, users and partners to integrate programs into overall strategic objectives- You will conduct project reviews, feasibility, prioritization, initiation, execution, user acceptance, operationalization for all project work related to the data science program(s)- You will partner with shared technical and business resources to effectively deliver and support solutions- You will effectively communicate (i.e. status, issues) to leadership and other various levels of the organization#DCERequired Qualifications- Minimum of 10 years of IT experience with 7 years working with Data Management, Business Intelligence, Architecture, or Data Analytics including the following:* Working knowledge of Big Data programming environments and Competency in major analytics software packages and programming environments (e.g. Hadoop /Map-Reduce, Mahout; Python, R, Java etc. in Big data paradigms)* Hands on experience working with database technologies, including Oracle, SAP,SQL / NoSQL platforms, visualization applications such as Microstrategy or Tableau* Familiarity with writing SQL queries and working with databases- 5+ years leading in a highly matrix environment- 5+ years strong program / project management experiencePreferred Qualifications- Masters of Science or Master Business Administration- Green Belt / Black Belt certification- Superb communication deep analytical results in forms that resonate with the business collaborators, highlighting actionable insights- Ability to acquire any specialized domain knowledge required to be more effective in all required activities- Willingness to learn and develop critical data science skills (e.g. statistical analyses, advanced data visualization, data mining, and data cleansing/transformation)EducationBachelor's Degree in Computer Science or equivalentBusiness OverviewCVS Health, through our unmatched breadth of service offerings, is transforming the delivery of health care services in the U.S. We are an innovative, fast-growing company guided by values that focus on teamwork, integrity and respect for our colleagues and customers. What are we looking for in our colleagues? We seek fresh ideas, new perspectives, a diversity of experiences, and a dedication to service that will help us better meet the needs of the many people and businesses that rely on us each day. As the nations largest pharmacy health care provider, we offer a wide range of exciting and fulfilling career opportunities across our three business units MinuteClinic, pharmacy benefit management (PBM) and retail pharmacy. Our energetic and service-oriented colleagues work hard every day to make a positive difference in the lives of our customers.CVS Health is an equal opportunity employer. We do not discriminate in hiring or employment against any individual on the basis of race, ethnicity, ancestry, color, religion, sex/gender (including pregnancy), national origin, sexual orientation, gender identity or expression, physical or mental disability, medical condition, age, veteran status, military status, marital status, genetic information, citizenship status, unemployment status, political affiliation, or on any other basis or characteristic prohibited by applicable federal, state or local law. CVS Health will consider qualified job candidates with criminal histories in a manner consistent with federal, state and local laws. CVS Health will not discharge or in any other manner discriminate against any Colleague or applicant for employment because such Colleague or applicant has inquired about, discussed, or disclosed the compensation of the Colleague or applicant or another Colleague or applicant. Furthermore, we comply with the laws and regulations set forth in the following EEO is the Law Poster: EEO IS THE LAW and EEO IS THE LAW SUPPLEMENTFederal law requires employers to provide reasonable accommodation to qualified individuals with disabilities. If you require assistance to apply for this job, please contact us by clicking EEO AA CVS HealthCVS Health does not require nor expect that applicants disclose their compensation history during the application, interview, and hiring process.For inquiries related to the application process or technical issues please contact the Kenexa Helpdesk at 1-855-338-5609. For technical issues with the Virtual Job Tryout assessment, contact the Shaker Help Desk at 1-877-987-5352. Please note that we only accept resumes via our corporate website: https://jobs.cvshealth.com/"}