{"jobID": "2831646263", "jobLocation": "San_Marcos_TX", "jobTitle": "Catalog Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.mccoys.com", "Headquarters": "San Marcos, TX", "Size": "1001 to 5000 employees", "Founded": " 1927", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Foxworth-Galbraith Lumber"}, "estimatedSalary": "55000", "jobDescription": "SUMMARY Provide support for internet catalog data management of the company and supplier's products. Oversee new data set integrations for both internal/external that allow the look-up and sale of company products. Collaborates with technology development and project teams to refine, adapt, and apply data. Work with merchants to ensure that all products are properly presented on company website. Monitors and maintains all internet catalog data aspects of company SKU program  ESSENTIAL DUTIES AND RESPONSIBILITIES include the following. Other duties may be assigned. Responsible for maintaining the company's internet product catalog and files including managing data from external vendor sourcesAnalyze and override data provided by suppliers to ensure accuracy and is provided and updated at a minimum of every thirty (30) daysUpdates and maintains catalog databases with new product additions, archiving old products and ensuring that the company's web product presentation is accurate and completeMaintains documentation of catalog reporting and responds to merchandising team and senior management as requestedResponsible for managing in-stock on-line catalog and special order catalogResearch and provide information in support of Content Management System (CatMan) including data integrity, vendor interfaces(s), images and enhanced product information. Works jointly with Marketing and IS to maintain function and provide data as neededManages database information for the SignMaker program to include enhanced product information, signcard sizes and design, display signs, order forms, and other signage for all stores. Works closely with IS to provide feedback and testing of design and function of programResponsible for the comprehensive review and proofreading of individual work, and the work of other employees, to ensure accuracy and completenessSupports Merchandising management and other team members with projects as assigned, including meeting deadlines as requiredFollows Standard Operating Procedures when carrying out position responsibilitiesAttends and participates in team meetings, training sessions, and company-sponsored programs as requiredRequirementsQUALIFICATIONSAssociate's degree (A. A.) or equivalent from two-year college or technical school; or three to six months related experience and/or training; or equivalent combination of education and experienceAbility to read and interpret documents such as safety rules, operating and maintenance instructions, and procedure manuals. Ability to write routine reports and correspondenceAbility to speak effectively before groups and customers or employees of the organizationAbility to solve practical problems and deal with a variety of concrete variables in situations where only limited standardization existsAbility to interpret a variety of instructions furnished in written, oral, diagram, or schedule formAbility to resolve data integrity issues by analyzing, diagnosing, and understanding root causes using independent and sound judgment based on the collection of factual informationAbility to utilize strong communication skills with the ability to relate with all levels of experience and backgrounds of company employeesAbility to utilize strong multi-tasking, organizational, prioritization, and follow-up skills necessary for managing multiple merchandising issues and projects at one time in a professional manner, both under minimal supervision as well as in a team environmentAbility to utilize Microsoft Word&Excel;, Mac21 and other 3rd party computer software applications at an intermediate levelPREFERRED QUALIFICATIONSPrior experience working with catalog product management, preferably in the retail or building supply industryPrior or applicable experience in data exploration, manipulation and visualization in product managementWORK AVAILABILITYMust maintain regular and acceptable attendance at such level as is determined by managementMust be regularly available and willing to work at least 8 hours per day, 40 hours per week or such other hours per day or hours per week as the employer determines are necessary or desirable to meet business needsMust be available and willing to work such overtime per day or per week as the employer determines is necessary or desirable to meet business needsMust be available and willing to work such weekends and holidays as the employer determines are necessary or desirable to meet its business needsTRAVEL REQUIREMENTSThis position requires occasional travel with overnight staysMust meet driver's license requirements as required by the CompanyMust be able to legally obtain a rental vehicle in all states in which the company does businessMust have current auto liability insurance PHYSICAL DEMANDS The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is regularly required to sit and use hands to handle or feel. The employee frequently is required to reach with hands and arms and talk or hear. The employee is occasionally required to stand and walk. The employee must occasionally lift and/or move up to 10 pounds. Specific vision abilities required by this job include close vision, color vision, and ability to adjust focus WORK ENVIRONMENT The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. The n"}