{"jobID": "2829528557", "jobLocation": "KenTownshipood_MI", "jobTitle": "Quality Supervisor 2nd Shift", "companyRating": "3.6", "companyInfo": {"Website": "www.rothburyfarms.com", "Headquarters": "Grand Rapids, MI", "Size": "1001 to 5000 employees", "Founded": " 1923", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "39000", "jobDescription": "Quality Supervisor - 2nd ShiftCompany OverviewRoskam Baking Company is a family owned and operated business based in Grand Rapids, Michigan. We have been producing high quality food products since 1923. Our strategic partners include some of the largest food companies and retailers in North America. We also have our own product lines under the Rothbury Farms and Grandpas Oven brands. Our product lines include croutons, snacks, caramel corn, popcorn, seasoning blends, fresh bakery products, candy, dry mixes, glazes, frostings, and frozen foods. Our six facilities supply a complete service of production, packaging, and warehousing. Like the food industry, we are rapidly growing and are always looking for more good people to join our team.Position Description and PurposeRoskam Baking Company produces and packages food products with the goal of consistently meeting and exceeding customer expectations for quality, safety and wholesomeness. The role of the Quality Supervisor is to ensure these goals are met through an operational focus, an attention to detail, defect detection and corrective/preventative action, and strong internal partnerships with the production department.Key ResponsibilitiesThe Quality Supervisor is responsible for monitoring and maintaining key indicators of product quality and safety through inspection, testing and communication. The position ensures the operations and procedures on the plant floor meet and align with corporate quality policy. This includes assessment and maintenance of food safety programs, HACCP, allergen control, ingredient control, GMPs, training, document control, traceability, internal audit, product quality reviews, and corrective/preventative action. The Quality Supervisor will lead a quality team and will be responsible for partnering with cross functional peers across the plant.The Quality Supervisors hands-on approach and strong interpersonal skills will allow them to become familiar with the plant processes and work with others to ensure alignment and drive continuous improvement within the daily operations in the plant. Leading and driving corrective/preventative action will deliver results and improvements to Roskam Baking Company.Ensure alignment of plant procedures with food safety and quality policies and SQF elementsEnsure all sampling, testing and inspections are aligned with plant quality proceduresEnsure effective data reporting and documentation practices are in placeVerify data for accuracy and completeness of on a daily basisEnsure calibration and accuracy of testing equipment and methodsEnsure the effectiveness of training programsBuild strong relationship with production supervisors to focus on continuous improvement opportunitiesDevelop a strong knowledge of plant floor activitiesIdentify and proactively plan for processes/systems improvementSupport the maintenance of SQF certificationSupport investigations and corrective/preventative actionsManage, plan and coordinate quality staff schedules and functionsSupport cleaning and sanitation verificationMaintain inventory of lab supplies and chemicalsManage hold inventories, placing product on hold, assisting in rework, and sortingRequired and Preferred QualificationsRequired:Working knowledge of quality systems to ensure food safety and qualityStrong interpersonal skills to include team building and oral communicationStrong documentation skillsPreferred:2+ years of supervisory experience2 year or BS degree in food or biological sciencesRoskam Baking Company offers a competitive compensation package including medical, dental, and vision benefits, life and disability insurance and a 401k plan."}