{"jobID": "2833794116", "jobLocation": "Thousand_Oaks_CA", "jobTitle": "Data Sciences Sr. Associate", "companyRating": null, "companyInfo": {"Website": "www.amgen.com", "Headquarters": "Thousand Oaks, CA", "Size": "10000+ employees", "Founded": " 1980", "Type": " Company - Public (AMGN) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Genentech, AbbVie, Janssen Biotech"}, "estimatedSalary": null, "jobDescription": " As part of a new group within Commercial information Management the Data Scientist Sr. Associate will collaborate with business partners, service owners and IS peers to define and manage a capability and technology roadmap for delivering optimized user experience for data consumers across the US Commercial Organization. This role will innovate and create significant business impact through the strategic use of technology and information. This position will help create competitive advantages for Amgen with the ultimate aim to provide clean, usable data to whomever may require it.  This position will be primarily responsible for: Ensuring rapid access to new and existing data assetsResearching opportunities for data acquisition and new uses for existing dataOverseeing end to end data integration and curation including building quality into the processCreating prototypes and demonstrations to better access and utilize data assetsEmploying a variety of languages and tools (e.g. scripting languages, big data tools) to marry systems togetherCollaborating cross-functionally with stakeholders to ensure a superb user experience throughout the data integration processManaging back-end data configurationCreating data models and solutions architecture in collaboration with IS and external partnersDefining processes for managing access to data setsTriaging issues and working with external partners as neededDeveloping tools and training on data sets and accessCollaborating to design, construct, install, test and maintain highly scalable data management systemsEnsuring systems meet business requirements and industry best practicesCollaborating on definition and implementation of disaster recovery proceduresRecommending and implementing ways to improve data reliability, efficiency and qualityCollaborating with data architects, modelers and IT team members on project goalsVerbally presenting analysis ideas, progress and results to IS peers and business partners.Providing high quality ongoing support; answering questions, resolving problems and building solutions.Assuring compliance with regulatory, security, and privacy requirements as it relates to data assetsServing as an internal consultant on commercial data and data quality managementIdentifying, recommending and driving continuous improvement in database reporting and analysis processes Basic Qualifications:  Masters degree OR Bachelors degree & 2 years of Data Modeling/ Mining and Information Systems experience OR Associates degree & 6 years of Data Modeling/ Mining and Information Systems experience OR High school diploma/GED & 8 years of Data Modeling/ Mining and Information Systems experience  Preferred Qualifications: Masters Degree in Science, Engineering, Mathematics, Applied Physics, Statistics, or Operations Research3+ years of relevant work experienceExperience with databases including relational, NoSQL, Graph and frameworks to access the data (ORM, dataframes)Programming experience with Ruby, Python, SAS, R or statistical software (SPSS and Matlab)Detail-oriented technical aptitude with strong logical, problem solving, and decision-making skills.Excellent organization/planning skills and talent for managing many large and complex datasets.Ability to prototype data driven solutions to problemsAbility to collaborate with business partners and other IS resources to drive analytic projects end-to-end.Ability to communicate analysis in a clear, precise, and actionable manner.Experience working with large data sets, experience working with distributed computing tools (Spark, HBase, Hive, Redshift, Databricks, etc.) Amgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status."}