{"jobID": "2775348639", "jobLocation": "Chicago_IL", "jobTitle": "Data Management Analyst", "companyRating": "2.9", "companyInfo": {"Website": "www.bmoharris.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1882", "Type": " Subsidiary or Business Segment", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " J.P. Morgan, Bank of America, U.S. Bank"}, "estimatedSalary": "65000", "jobDescription": " Enterprise Customer Analytics Mandate  Build and maintain a \"World Class\" Center of Excellence in Customer Analytics by: Building data and analytics capabilitiesDriving actionable insightsLeveraging data to deliver actionable insights that will drive increased revenues and improve the overall BMO customer experience Within the broader mandate for US P&C; Customer Analytics, the Data Management team's main objectives are: Manage Customer data quality issues found within the MDM suspected duplicate reportProvide the broader team with data management processes and data architecture solutions that are stable, flexible, and extensiblePromote and implement best practices for capturing and maintaining high quality customer dataLiaise with enterprise technology and data governance partners on various topics for US P&C; Customer Analytics Note: This role has responsibilities for Master Data Management (MDM) and Business As Usual (BAU) data management responsibilities to support the broader U.S. team.  Master Data Management Accountabilities (60%)  The Data Management Analyst works closely with Technology & Operations (T&O;) partners and the U.S. and Canadian Personal & Commercial Lines of Business in the delivery and maintenance of the Enterprise Customer Information File, Customer Identity & Access Management and Data Governance Program(s)  This role is primarily accountable for facilitating customer data clean-up and customer matching across US P&C;, Wealth and Commercial Lines of Business via the existing Master Data Management suspected duplicate reporting and business process with data owners Meet minimum weekly quota of 75 cases investigatedMeet minimum weekly quotas of 75 cases verifiedIdentify new and enhance existing business matching rules for MDMCreate and report metrics for senior leadership on bi-weekly basis of the suspected duplicate remediation efforts Business as Usual Support Accountabilities (40%)  The Data Management Analyst will also work closely with the broader U.S. P&C; Customer Analytics team and some of their business partners to support them in their business as usual data processes: Manage business as usual data management requests from initial intake through completionLead and or actively participate in requirements meetings with business partners to determine requirementsDesign, develop, and implement data structures to support campaign management, execution and measurementDesign, develop, and implement data structures to support analytical modeling as well as other reporting and analysisPerform other ad-hoc data analysis and data-related tasks, as requiredCoordinate directly with enterprise technology partners to operationalize data management processesSupport existing data enrichment processes requiring secure exchange with third party vendors and loading to U.S. Customer Analytics data martBuild data subject matter expertise subject matter expertise and provide counsel to the broader team Knowledge Possesses a university degree/college diplomaPossesses at least 5 years of experience in data management disciplinePossesses knowledge of architecting data solutions for end user consumptionPossesses knowledge of techniques associated with designing and implementing big data processingPossesses solid business knowledge of the Finance/Banking industryPossesses broad and deep knowledge of physical data modelingSkillsExperienced in translating end user requirements to data and technical requirementsExperienced in providing data management support for business intelligence reporting and analytical modelingExperienced in designing and developing ETL/ELT processesExperienced working between multiple database platformsPossesses advanced SQL skillsExperienced navigating UNIX/Linux file systemFamiliarity with SAS programming tool and syntaxPossesses strong problem solving and analytical skillsPossesses strong technical troubleshooting and research skillsPossesses strong written and verbal communication skillsProficient with MS Office Suite (e.g., Outlook, Excel, PowerPoint, Visio) Preferred Skills Experienced/familiar with Marketing business and data conceptsExperienced/familiar with Datameer data preparation toolExperienced/familiar with working within a Hadoop platform (HIVE, PIG, Spark, etc.) We're here to help  At BMO Harris Bank we have a shared purpose; we put the customer at the center of everything we do helping people is in our DNA. For 200 years we have thought about the futurethe future of our customers, our communities and our people. We help our customers and our communities by working together, innovating and pushing boundaries to bring them our very best every day. Together we're changing the way people think about a bank.  As a member of the BMO Harris Bank team you are valued, respected and heard, and you have more ways to grow and make an impact. We strive to help you make an impact from day one for yourself and our customers. We'll support you with the tools and resources you need to reach new milestones, as you help our customers reach theirs. From in-depth training and coaching, to manager support and network-building opportunities, we'll help you gain valuable experience, and broaden your skillset.  To find out more visit us at https://bmoharriscareers.com/  BMO Harris Bank is committed to an inclusive, equitable and accessible workplace. By learning from each other's differences, we gain strength through our people and our perspectives. BMO Harris Bank is an Equal Opportunity Employer for all, inclusive of Minorities, Women, Veterans, and Persons with Disabilities.SDL2017"}