{"jobID": "2830572571", "jobLocation": "Irvine_CA", "jobTitle": "Data Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.kareo.com", "Headquarters": "Irvine, CA", "Size": "201 to 500 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " athenahealth, AdvancedMD"}, "estimatedSalary": "66000", "jobDescription": "What We Need A highly experienced Data Analyst who lives and loves data! Your Areas of FocusHelping us improve our data quality, data awareness, and data analyticsMining and processing data for a 30,000 customer SaaS platformParticipating in the end-to-end delivery life-cycle of data projects from business requirements gathering to solution design, development, testing and roll-out.Helping to build advanced data models, analytics widgets, dashboards, and reports for enterprise and customer useYour QualificationsHands-on experience: 2+ years on Qlik Development, HadoopHive development, Python and SQLBe smart, be opinionated, make good decisions. We're hiring smart people to do great things, not be told what to do.A love of Data and everything about it.A healthy dose of awesome. Be confident in your awesomeness so you can ask for help, admit mistakes, and learn from others. We are a great team because we work together without attitude. No divas. No hermits.Project/Agile team experience working closely with development, product, marketing, and support teams .Flexibility to support occasional after-hours and/or weekend activities for key deployments.Your Personal CharacteristicsEntrepreneurial with unrelenting drive to succeed and win, sense of urgency, and passion for the workEnjoys finding solutions to complex challenges and partnering to deliver to intended outcomesMust be innately customer oriented and connect with our purpose of helping independent practicesAll-around good teammate and leader who is cooperative, approachable, and dedicated to helping others succeedProven ability to think creatively and drive innovation in the market and within our companyCommitted to becoming an enthusiastic ambassador of our unique and positive corporate culture"}