{"jobID": "2739122366", "jobLocation": "Troy_MI", "jobTitle": "Data Entry Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.credibly.com", "Headquarters": "Troy, MI", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "11", "jobDescription": "Who We Are: Credibly’s mission is to build a Data Science driven FinTech Lending Platform which improves the speed, cost, experience, and choice of capital to small and medium sized businesses. At Credibly, we make it easy and intuitive for small businesses to access capital. We have a laser focus on the customer experience and are committed to serving business owners as a trusted partner. The Company: Founded in Michigan in 2010, Credibly has provided over half a billion dollars to small business customers, and was named in 2014, 2015, and 2016 to the Inc. 500 list of fastest growing private companies in America, and as one of Crain’s New York Fast 50 Companies for 2015 and 2016.  Following a 2014 strategic equity investment from the $2.8Bn private equity fund Flexpoint Ford, Credibly rapidly accelerated their growth – opening NYC and Arizona offices, building out their Data Science, Marketing, and Technology teams, launching new loan products, and securing a $100MM credit facility. The Opportunity: The opportunity for the right candidate is to join our Intake team. This individual will have a primary focus on data entry for our inbound applications. The role objective is to apply our risk guidelines to each application, enter key data points accurately into our system of record, and generally organize supporting documentation to further enable our underwriting process. Pay structure for this position is currently $13 - $15 an hour, based on experience.RequirementsQualifications (Required)Able to type a minimum of 50 WPMBanking and Finance related experience is a MUSTExcellent organizational abilities; multi-tasking; prioritization; time managementTakes initiative; requires minimal supervisionStrong attention to detail and accuracyExperience working in a fast-paced, high volume environmentExcellent computer skills including Word, Excel, email and internet based applicationsQuick learnerBachelors degree preferredThe ideal candidate should have a career interest in banking, finanance or underwriting.BenefitsBenefits:Health/dental/visionCompany paid life insurance7 paid holidaysFlex timeVacation timeEnergetic fast-paced environmentBusiness casual dress attireExcellent opportunity for growth and developmentDisability insurance401K"}