{"jobID": "2726188477", "jobLocation": "Troy_MI", "jobTitle": "Security Officers", "companyRating": "4.0", "companyInfo": {"Website": "www.unitedshore.com", "Headquarters": "Troy, MI", "Size": "1001 to 5000 employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "11", "jobDescription": " The Security Officer is responsible for the protection, safeguarding, safety, and security of assets, property, team members, clients and all visitors at all United Shore locations. This Security Officer will be dressed in plain clothes, unarmed and use various telecommunications devices to call for assistance from fire fighters, police forces, and emergency medical services.  The Security Officer will also interview witnesses or victims to prepare case reports and testify in court if necessary and perform all appropriate related and unrelated duties, as directed by the Corporate Security Leader.WHAT YOU WILL BE DOING Meeting the physical requirements of the job and the ability to work in the environmental conditions listed below to perform common security functions and duties;Perform security patrols by foot and/or by company vehicle;Protect property from theft, sabotage, trespassing, fire and accidents;The protection of individuals and their property;The control of access to premises;Neutralize situations calmly with tact and common sense;Watch for safety and fire hazards and other security related situations;Provide any needed assistance to customers, team members and visitors;Investigate and take the appropriate lawfully action as authorized by the Corporate Security Leader on accidents, incidents, trespassing, suspicious activities, safety and fire;Perform other related duties as assigned by the Corporate Security Leader; andMonday through Friday hours, however, may be required to work nights, days, holidays and weekends.The available shifts are as follows - 6:30 AM to 3:00 PM (½ hour lunch), 10:00 AM to 6:30 PM (½ hour lunch), 1:30 PM to 10:00 PM (½ hour lunch) WHAT WE NEED FROM YOUREQUIRED QUALIFICATIONS: High School diplomaMeet all legal requirements to be able to work in the United States;Must demonstrate good moral fitness and ethical standards;Meet minimum requirements set by insurer to drive a company vehicle;No moving traffic violations in the past 3 yearsNo at fault accidents in the past 3 yearsHave not had driver's license denied, suspended or revoked in the last 3yearsNo driving under the influence of intoxicants (DUII) convictions in the past 3 years.Ability to communicate effectively both orally and in writing with team members, vendors and the public, to understand and follow standard operating procedures, to perform duties in a professional manner and appearance and to write and investigate required reports.Make independent and good judgment decisions within proper policy and procedures;Must be detailed oriented and have satisfactory literacy and writing, documentation, communications and interpersonal abilities;Have no disqualifying criminal history or convictions;Be able to work alone responsibly and without supervision; andHave satisfactorily completed the training requirements for an unarmed security officer in Michigan, or have law enforcement experience.Must have working knowledge of Excel, Word and Outlook Shifts - 6:30 AM to 3:00 PM (½ hour lunch), 10:00 AM to 6:30 PM (½ hour lunch), 1:30 PM to 10:00 PM (½ hour lunch)May be standing for long periods of time PREFERRED QUALIFICATIONS: CPR Certified.Prior Security experience THE PLACE & THE PERKSUnited Shore is a diverse group of over 2,400 mortgage experts, sales superstars, tech gurus, marketing whizzes, and more – all working toward the same goals. We’re a $30 billion and growing, family-owned-and-operated company that still feels like family. We have an award-winning workplace that just happens to be home to the #1 wholesale mortgage lender in the country, United Wholesale Mortgage. We’re committed to a 40-hour workweek. And we believe in setting our team members up for success by creating a unique, energetic culture where you can be yourself and still reach your goals. Here are just a few of the reasons you’ll love working here:Be well here - Salta Direct is our in-house doctor’s office, available to all team members!Work-life balance. Give us 40-hours and the rest is yours.Generous benefits package including health and wellness, community involvement, personal and professional development, and rewards and recognitionFree fruit, soft drinks, and coffeeGourmet cafeteria featuring homemade breakfast, lunch, sushi Mondays, and Mediterranean food.State-of-the-art fitness center open 5 a.m.–11 p.m. daily24/7 convenience storeOur very own StarbucksCool company events that always include a surprise or twoLawn vouchers to concerts at DTE Energy Music Theater DISCLAIMERAll the above duties and responsibilities are essential job functions subject to reasonable accommodation. All job requirements listed indicate the minimum level of knowledge, skills and/or ability deemed necessary to perform the job proficiently. Employees may be required to perform any other job related instructions as requested by their supervisor, subject to reasonable accommodations. This document does not create an employment contract, implied or otherwise, other than an \"at will\" employment relationship. United Shore Financial Services is an Equal Opportunity/Affirmative Action Employer."}