{"jobID": "2768757180", "jobLocation": "Stafford_TX", "jobTitle": "Data Analyst III", "companyRating": "3.3", "companyInfo": {"Website": "www.f-e-t.com", "Headquarters": "Houston, TX", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "71000", "jobDescription": "Detail oriented with exceptional background utilizing data from diverse financial and information systems to build tools and models that remarkably improve organizational decision-making capabilities. This position requires a strong working relationship with both the commercial and operational teams. This position will act as a liaison between business units and customer base as well as the transaction service center to recognize and resolve order discrepancies. Must work in conjunction with the business unit in order to identify and resolve problems in the order process. Deliver financial and procedural information to help facilitate growth and development while providing support for problem resolution at all levels. Skills/KnowledgeMust have demonstrated analytical and problem solving skillsExperience with logistical compliance and supportStrong knowledge in ISO procedural documentation and complianceExcellent verbal and written communication skillsStrong computer skills including Microsoft Office applications such as Excel, Word & Power Point.Investigates and researches various AR related issues from both external and internal customers.Investigations include the gathering of data from various sources & systems and interpreting the data.Seeks out opportunities to challenge current processes and works to develop and implement new methods for managing AR.Creates and presents recommendations for policy or procedure changes to management, and works with internal partners to implement approved changes.Experience working under SOX compliance controlsPrevious experience working in a high volume, fast paced environmentRapid ability to adapt to new technologiesKnowledge of principles, concepts, theories and practices of area of responsibility.   Job Requirements5+ years of accounting/clerical or business operations experienceHigh School Diploma or equivalent2+ years of college associated degree; college degree preferred  Job Type Full-time Category OTHER MANUFACTURING Education Some College Coursework Completed Career Level Experienced (Non-Manager) Travel 10 - 20%"}