{"jobID": "2836952109", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist - Insurance", "companyRating": "3.2", "companyInfo": {"Website": "www.esurance.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 1999", "Type": " Subsidiary or Business Segment", "Industry": " Insurance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " GEICO, Progressive Insurance, Nationwide"}, "estimatedSalary": "92000", "jobDescription": " Esurance is looking for a Data Scientist - Insurance to join a dynamic and award-winning team of individuals who are committed to making insurance smarter, easier, and dare we say- cooler. As part of a growing company that is focused on providing an outstanding customer experience, you’ll have the opportunity to expand your skills and discover your potential.  If you’re looking for a career at a socially conscious company that offers great benefits — including matching 401k and tuition reimbursement — then you may have just found your new home.  Esurance combines the spunk of a startup company with the backing of Allstate (the largest publicly held personal lines insurer in the U.S.) to create a unique, energized, and exciting place to work.  Esurance has created a centralized data science group that is responsible for helping business units make objective decisions using science. The Group supports overall business operations by delivering critical analytical insights and in-depth consultative analyses. This group also develops applications/ platforms that are used to deploy analytics in real time. Data scientists in the group develop tangible and actionable recommendations that are then implemented in real-time to improve business operations. Key responsibilities include:Working with business stakeholders to deeply understand business problems and pain pointsDeveloping algorithms and predictive models using large amounts of structured and unstructured dataCollaborating with internal technology team to deploy solutions for real-time decisionsDesigning experiments to determine efficacy of solutions.Providing on-going performance monitoring of decision systems and statistical modelsExcellent knowledge of a high-level language for statistical and scientific computing (R, Python or similar)Extensive experience in data management and data scrubbingStrong aptitude towards math and programmingAbility to communicate complex information in a way that is clear and easily understoodExperience / Education:Bachelor Degree in Statistics, Computer Science, a related field or equivalent education/experience required; PhD or Master degree preferred.2+ years? relevant quantitative and qualitative research and analytics experience.Experience deploying machine-learning techniques for dimensionality reduction, regression, clustering, and classification to solve real-world problems.Benefits At Esurance, being committed to our employees is not just something we say, it’s something we do. Our benefits package is designed to help our associates stay healthy, meet their long-term financial goals, and balance the demands of work and personal life. Esurance rewards hard work, dedication, and creativity with competitive salaries and a generous bonus system. We are committed to our employees and we are dedicated to creating a diverse, positive, innovative and team-oriented work environment.  Health & wellness Medical, vision, and dental insuranceLife insurance (company-paid and supplemental)Accidental death and dismemberment coverageWellness coaching and incentivesGroup critical illness coverageAccident indemnity and hospital indemnity plansGroup legal Savings 401(k) plan with annual matching contributionReferral bonusesPerformance-rewarding bonus systemTuition assistance program (up to $5,250 per year)Health savings and flexible spending accountsCommuter benefits Family & Community Adoption assistanceMaternity leaveBuckle Up Baby programPet insurance discountCharitable gift matchingGive Time, Get Time volunteer programEmployee Assistance Program Time off Short-term disabilityLong-term disability (employee-paid option)Paid time off (holidays, vacation, personal choice days)"}