{"jobID": "2836820785", "jobLocation": "Milpitas_CA", "jobTitle": "Analyst 3, HR Data Analytics", "companyRating": null, "companyInfo": {"Website": "jobs.wdc.com", "Headquarters": "San Jose, CA", "Size": "10000+ employees", "Founded": " 1970", "Type": " Company - Public (WDC) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Seagate Technology, Toshiba"}, "estimatedSalary": null, "jobDescription": " Analyst 3, HR Data AnalyticsLocation: Milpitas, CA, United StatesReq ID: JR-0000041262Apply for this JobDescriptionWe deliver the possibilities of data. YOU define what’s possible.We are looking for a Data Analyst to join our HR Operations team here at Western Digital. Are you up for the challenge? ESSENTIAL DUTIES AND RESPONSIBILITIES:Deliver data insights and recommendations that inform workforce strategy and measure ROI on proposed and implemented HR programs and workforce strategies. Plan, develop and analyze workforce analytics surveysConsult with HR team and business to identify specific requirements and outcomesResearch, develop and analyze employee surveys including employee sentiment for unstructured text using NLP methodsDetermine and specify details of survey projects, including sources of information, procedures to be used, and the design of survey instruments and materials.Analyze and interpret the meaning of survey data, determine survey objectives, or suggest or test question wording. Design questionnaires, de-bias existing surveys, improve response ratesAnalyze quantitative and qualitative employee dataPrepare and present data visualizations to key stakeholders - summaries and analyses of survey data, including dashboards, tables, graphs, and fact sheets that describe survey techniques and insightsAnalyze data from surveys, old records, or case studies, using statistical softwareCreate, maintain, and ensure data quality of key human resources data sets, reports, and metrics. Cleanse existing data setsSupport process improvement and root cause analysis efforts to diagnose and predict workforce contributionsNetwork with other company and external business analytics functions to ensure best practices are shared and synergies gainedQUALIFICATIONS:3+year experienceProficient with R, PythonWorking knowledge of NLP and related softwareProficient in statistical modeling, data science, data structure and storage, data cleansing skillsExcellent data visualization skillsBehavioral science or I/O psych background a plusWeb application development a plusExperience communicating with executives, leadership and key stakeholdersExperience on cross-functional teamsEnergetic - enjoys work, finds satisfaction in bringing value everydayPrincipled - high level of integrity and able to maintain confidentialityCustomer focused - orientation toward providing excellent business partner service, design solutions with business needs in mindIntellectually curious - looks for information and insights beyond the obvious, brings forward insights business partners have not thought to ask for yetEmploys good business judgement - identifies the right business problems, applies business judgment to dataSolution oriented - pro-actively deliver results that make a difference for the organization, seeks opportunities to develop and implement programs and projects successfullyTechnology savvy - strong desire and level of comfort working with technology, proficient with Workday, Tableau, OBIEE, Excel, PowerPoint, and statistical analysis tools, understands vendor and cloud technology, and navigates possibilities and limitationsAnalytical - strong quantitative and qualitative skills, able to analyze, correlate and synthesize complex data to seek business solutionsNetworked - able to build relationships and partnerships internal and external to the organization, able to work with all levels of the organizationFlexible - ready to work under tight deadlines, willing meet the business partners' changing needs and able to manage multiple priorities, requests, deadlines, and projectsDetail oriented - able to pay attention to detail and produce thorough, accurate workEducated - masters preferred, experience in data analysis, modeling and presentation design, possesses business, HR and operations acumenABOUT WESTERN DIGITALWestern Digital Corporation is the world’s largest data storage company with a leading portfolio of HGST, SanDisk, G-Technology and WD brands covering flash and disk-based solutions. Deployed by the largest and most prominent organizations worldwide, Western Digital solutions are everywhere, touching lives and enabling great value from the data they possess.  Western Digital is an equal opportunity employer. We are committed to providing equal employment opportunity for all applicants and employees. Western Digital does not unlawfully discriminate and complies with the laws and regulations set forth in the following EEO Is The Law poster: Equal Employment Opportunity Is The Law.  Western Digital participates in the E-Verify program in the US. For more information click here. Este empleador participa in E-Verify."}