{"jobID": "2741228482", "jobLocation": "Sunnyvale_CA", "jobTitle": "Sr. Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "jobs.thermofisher.com", "Headquarters": "Waltham, MA", "Size": "10000+ employees", "Founded": " 1902", "Type": " Company - Public (TMO) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Illumina, Agilent Technologies, Roche"}, "estimatedSalary": "116000", "jobDescription": "Job Description When you join us at Thermo Fisher Scientific, youll be part of a smart, driven team that shares your passion for exploration and discovery. With revenues of $20 billion and the largest investment in R&D; in the industry, we give our people the resources and opportunities to make significant contributions to the world. Summary The Data Analyst will interpret business data residing in IT systems (primarily SAP), set up predictive analysis models, and turn the information into insight to assist the business in making decisions. Responsibilities include conducting full lifecycle analysis from requirements gathering, business analysis, and design to implementation of ideas and reports. Key aspects of the role:Interpreting data and analyzing results using data mining and statistical techniques. The analysis will primarily be performed on ERP data residing in the SAP system, though data sets from CRM systems like salesforce.com may also be included.Leveraging business data in IT systems, primarily SAP, to set up predictive analysis models and reports.Developing and implementing data collection and organization procedures and predictive analysis models and reports.Identifying and implementing data analysis frameworks and procedures.Acquiring data from primary or secondary data sources and building data repositories.Identify, analyze, and interpret trends or patterns in complex and large data sets.Work with management to prioritize business and information needs.Identify and define new process improvement opportunities.Build predictive models and algorithms. Undertake preprocessing of structured and unstructured data.Presenting information using data visualization techniques.Requirements:BS in Computer Science, Engineering, Information Systems, Mathematics, or related field.The ideal candidate will have at least 8 years of overall IT experience, primarily in the areas of SAP and data analysis/data mining.Good understanding of SAP data structures and entity relationships, and functional understanding of common business processes.Experience with data analysis tools. Exposure to reporting software (e.g. Business Objects, Tableau), database queries (SQL), programming/scripting (e.g. Python, VBA, XML, Javascript)Experience with formulating algorithms for predictive analysis and data mining.Working knowledge of using statistics for analyzing datasets.Strong planning and analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy.Analytical mind and business acumen, and strong problem-solving aptitudeAbility to communicate effectively with team members, business users, and management and to communicate ideas and plans verbally and in writing. Ability to work in a team. Must be a confident self-starter individual who can completely own the delivery of high value work products.Excellent visualization and presentation skills.Experience with DOMO and Big Data/Artificial Intelligence related tools is a plus.Certification in data analysis preferred. At Thermo Fisher Scientific, each one of our 65,000 extraordinary minds has a unique story to tell. Join us and contribute to our singular missionenabling our customers to make the world healthier, cleaner and safer.  Apply today! http://jobs.thermofisher.com Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status. Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status."}