{"jobID": "2813358329", "jobLocation": "Chicago_IL", "jobTitle": "Data Engineer", "companyRating": "4.1", "companyInfo": {"Website": "www.bamfunds.com", "Headquarters": "Chicago, IL", "Size": "501 to 1000 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "122000", "jobDescription": " The Job Details are as follows: ROLE OVERVIEW The Data Engineer will be a key member of a small, focused team working to create new platforms that BAM’s data analysts, data scientists, quantitative investors, and researchers can rely on for sourcing data sets. The ideal candidate is obsessed with creating high quality software, loves working with data in all its myriad forms, enjoys thinking and debating about the best solutions to complex problems, and has the ability to push forward and get things done. If you’re the kind of person who gets excited by the prospect of wrapping your mind around a different problem each day, we’d love to chat with you.  Among other things, the Data Engineer will: Devise and develop data solutions leveraging various cloud-based data, database, and distributed computing technologies.Gain a deep understanding of data requirements and utilization for quantitative investment, in order to help drive prioritization and design decisions.Help in partnering with end users in order to understand and flesh out requirements and provide first level support as needed.Apply creativity and lateral thinking in order to craft high performance solutions to loading and serving large amounts of investment data.Create software that is well commented, well understood, well tested, and well documented – quality above all!QUALIFICATIONS & REQUIREMENTS:A passion for data and experience in applying that passion to high quality data products.Strong knowledge of Python development, object oriented concepts, and software engineering best practices.Intermediate or better knowledge of SQL and experience writing production queries against one or more SQL DBMS.Experience with basic DevOps techniques, including CI/CD and infrastructure-as-code.Experience working in at least one cloud environment. Familiarity with AWS a big plus.Around 8-10 years of professional software development experience. Financial industry exposure a plus but not at all required.Humble, team-player who wants to win."}