{"jobID": "2824169959", "jobLocation": "Santa_Ana_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "DHS Consulting, Inc. is a rapidly growing, California-based consulting firm; alongside our talented professionals, we are dedicated to providing Program, Project and Construction Management services to our clients with offices in throughout California.  Our mission is clear. We help clients solve challenges by providing top talent to develop the right solutions at the right time. With forward thinking and utilization of the most advanced technology on the market, were leaders in project management strategy and execution; providing the visibility our clients want to see. Our relationships are built on our credibility to deliver on our commitments, with unbeatable service levels to our clients, at DHS; we let our work product lead the way.  We are looking for a highly motivated and passionate Data Analyst to join our team in our growing Energy division and; to consult for our Utility Client in the Southern California area. Responsibilities:The Data Analyst is responsible for using statistical methods to analyze data and generate useful business reports utilizing a variety of tools and software including Access Databases, Excel Trackers, and SaaS.He/ She will bring technical expertise to ensure the quality and accuracy of that data, then process, design and present it in ways to help people, businesses, and organizations make better decisions.Collect, process, validate and perform statistical analyses of dataWork with the project team to create and or maintain reporting dashboardsProactively work towards improving business processes and data gathering methodsQualifications and Skills:Bachelors degree in Business Administration, Computer Science, Mathematics, or related field (Preferred)All qualified candidates who are eligible to work in the United States are encouraged to apply. However, please note - we are not able to sponsor visas.2-5 years of analytical experience within a corporate position2 years of experience in a supporting analytical role for company projectsProficient use of Microsoft Word and PowerPointIntermediate or Expert usage of Microsoft Excel (skills for data gathering and reporting)Detailed and highly organizedExperience with Microsoft Access DatabaseExperience utilizing SaaS We offer a competitive total compensation package including comprehensive health coverage, 401k and more! We are an equal opportunity employer. Applicants are considered for positions without regard to veteran status, uniformed service member status, race, color, religion, sex, national origin, age, physical or mental disability, genetic information or any other category protected by applicable federal, state, or local laws.DHS will consider for employment qualified applicants with criminal history in a manner consistent with the requirements of the LA Fair Chance Initiative for Hiring."}