{"jobID": "2820990313", "jobLocation": "Kingsford_MI", "jobTitle": "Sr. Utility Vegetation Management Specialist", "companyRating": null, "companyInfo": {"Website": "www.atcllc.com", "Headquarters": "Waukesha, WI", "Size": "501 to 1000 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Summary of Responsibilities:Do the outdoors call to you? Would you rather be in the field, more than in the office? We’re looking for a Transmission Vegetation Program Manager to the plan, communicate, design and implement our transmission vegetation management program.Essential Responsibilities: You’ll use your bachelor’s degree in forestry or related environmental discipline or a minimum of 5 years utility vegetation management experience to assist in the development, management and implementation of the annual vegetation management work plan for the safe and reliable operation of ATC’s transmission system. In addition, you’ll collaborate with ATC team members to provide contractor oversight, develop and monitor tracking systems to determine overall program performance and participate in continuous improvement activities to ensure ATC’s compliance with industry regulations.  You’ll use your International Society of Arboriculture Certification to conduct forestry helicopter inspections and foot patrols as needed to ensure safe and reliable operation of transmission system. These helicopter inspections will include QA inspections, mid-cycle patrols, prioritization needs and storm related issues. We prefer if you already have your ISA Utility Specialist Certification and Pesticide Applicator Certification for Right-of-Way, but we will help you obtain those within six months of hire.  If you want to be part of the team that ensures safe and reliable electric transmission for our customers, join a team that’s been nationally-recognized as a Top Workplace for four straight years! Number of Openings Available:1Posting Date:2018-06-19-07:00Time Type:Full timeEqual Opportunity Employer:AMERICAN TRANSMISSION CO. IS AN EQUAL OPPORTUNITY EMPLOYER FUNCTIONING UNDER AN AFFIRMATIVE ACTION PLAN. WE ENCOURAGE WOMEN, MINORITIES, VETERANS AND INDIVIDUALS WITH A DISABILITY TO APPLY."}