{"jobID": "2827342447", "jobLocation": "Palo_Alto_CA", "jobTitle": "Network Scientist", "companyRating": null, "companyInfo": {"Website": "www.humanyze.com", "Headquarters": "Boston, MA", "Size": "1 to 50 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Humanyze helps companies make more informed people decisions. Born out of the MIT Media Lab, Humanyze uncovers the hidden patterns of digital and face-to-face communication to quantify the people factor in the workplace. Humanyze is committed to helping teams work better together and has the data and science to prove it.  Humanyze’s world-leading People Analytics Platform delivers advanced insights and is used by top Fortune 500 companies to answer specific business questions around diversity and inclusion, collaboration and delivery, space planning, workload, teamwork and engagement, and regulatory and compliance risk. Role Description: We’re looking for a Network Scientist to join our Analytics R&D; Team to work along with data scientists, statistical analysts, computational social scientists, and organizational behavior scientists. This position will be responsible for designing algorithms and methods to ensure the quality and robustness of our network-based metrics that reveal how work gets done in organizations. The network scientist will help uncover organizational behaviors from multi-dimensional communication and collaboration network data collected from real-world organizations.  This is a full-time role based in Palo Alto, CA. Responsibilities:Design algorithms that integrates multi-dimensional temporal and spatial networksMathematically model and identify network characteristicsCompare and experiment with various algorithms to optimize for computational cost and accuracyGenerate benchmark data and generalization models for network metricsTest the robustness of metrics for teams and organizations of different sizes and formsInform analytics and product teams by delivering key findings and reportsJob Requirements:MS or PhD degree in Network Science, Computer Science, Computational Social Science, or a related fieldScientific publications in network science, social network analysis, or related fields3+ years of experience in analyzing, displaying, and reporting on large-scale network dataAbility to conduct statistical analysis (e.g. t-tests, ANOVA, regression)Organized and detail orientedStrong team-player: You work well in a multi-disciplinary teamStrong communicator, written and verbal; can effectively synthesize, visualize, and communicate insightsAbility to thrive in a fast-paced startup environmentDesired Skills:Have worked with various kinds of network datasets in past research projectsHaving worked with people networks is a big plusFamiliar with advanced quantitative and computational methods such structural equation modeling and agent-based modelingExperience with big data platforms and data analysis softwareWe Offer:Competitive salary and bonusFlexible work environmentFully paid medical, dental and long-term disability insuranceSIMPLE IRA matching3 Weeks of vacation, a holiday week, and 11 other company holidays"}