{"jobID": "2800747521", "jobLocation": "Bedminster_NJ", "jobTitle": "Inventive Scientist", "companyRating": null, "companyInfo": {"Website": "www.att.jobs", "Headquarters": "Dallas, TX", "Size": "10000+ employees", "Founded": " 1983", "Type": " Company - Public (T) ", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " Verizon, T-Mobile, Sprint"}, "estimatedSalary": null, "jobDescription": " Our Inventive Scientists are typically hired as recent PhD graduates or early career researchers. They are on a path to be technical leaders in their field. An AT&T; Labs Research career allows them to establish external recognition while creating innovative, business-impacting solutions. Researchers with 5+ years of relevant experience may be considered for a more senior position. We encourage applications from candidates with experience and strong interest in any of these areas:  Spatial and spatio-temporal data analysis - The AT&T; network generates billions of records per day from handheld devices, each one providing a data point in time and space. Understanding the dynamics of this mobility data through time series and spatial statistics helps AT&T; better serve its customers, improve its network, and develop new products and services.  Statistical computation - AT&T; is developing high-performance statistical models and algorithms to leverage modern streaming and storage technologies. One example is the AT&T; collaborative coding project RCloud http://rcloud.social/.  Text mining - AT&T; mines free-form text from millions of customer surveys, representative notes, and live chats as one way to manage our business in real time and include the customer perspective in everything we do. New methods are needed to keep up with the volume and complexity of this data.  Data visualization - AT&T; creates algorithms, systems, and techniques for visualizing new data sets at increasingly large scale. AT&T; is especially interested in interactive visualization of very large geospatial and temporal data. One example is our open source project Nanocubes http://nanocubes.net .  Predictive Modeling – We build models to predict customer behavior and sentiment, service disruptions, and event impacts. Models serve to both target, and to gain insight into variable relationships, allowing analysts to positively affect business outcomes. Testing incremental gains from newer machine learning algorithms with minimal sacrifice in interpretability is an active and growing research area with publishing opportunities.  Database management and data quality - AT&T; is building high-performance and low latency systems to manage high velocity data streams. These systems are critical for accurate processing and analysis of data from the AT&T; mobile network. Analyzing the data to identify glitches, and cleaning the data to minimize distortion while preserving maximal underlying variation, are essential to ensure meaningful big data analytics.  Please visit http://www.research.att.com to learn more about AT&T; Research. Qualifications Qualifications - Required  Experience and passion for finding solutions to real world, applied problems from complex datasets.  PhD or equivalent in a data science field, including these most commonly: Statistics, Computer Science, Machine Learning, Operations Research, Engineering, and Mathematics.  Established aptitude for applied research as demonstrated through publications, new research techniques, open source contributions, internship experience, or patents.  Demonstrated ability to generate new ideas, and develop them from your concept to a solution.  Demonstrated ability to use software to manipulate data, prototype new tools, and extract actionable insights from that data.  Capable of presenting outcomes of analytic solutions in a format easily understood by a non-technical audience.  Qualifications - Preferred  Expertise working with large industrial scale data sets.  Accomplished programmer with experience in any of R, Python, C/C++, and Java.  Experience with modern data management and analytic tools (e.g. Hadoop, NoSQL, Tensorflow, Keras, Spark).  Work location can be Bedminster, NJ or New York, NY. Qualified candidates will be asked to submit a Research Statement and 3-5 references."}