{"jobID": "2729634435", "jobLocation": "Warren_NJ", "jobTitle": "Data Science & Business Intell", "companyRating": null, "companyInfo": {"Website": "www.infopeoplecorp.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Description: You'll be helping us bring the best possible experiences to our customers by helping us to identify what they like, and create personalized recommendations for them based on what we've learned. Using your analytics expertise, you'll help us figure out how to get the most accurate information and insights from all kinds of data. •Supporting day-to-day and tactical analytics needs of the supply chain planning teams such determining the safety stock at a Store-SKU level by utilizing statistics and modeling to ensure we meet the Service Level metrics with a reduction in working capital. •Driving strategic efforts across the supply chain organization, leveraging advanced analytics to optimize processes and procedures that lead to improved device life cycle management, working capital optimization and cost reduction. •Owns the development and use quantitative models to recommend inventory targets for different stock points in the supply chain (DCs, stores, etc.) at product level •Owns the analytics support and business recommendations for daily disruptions in supply and demand like promotions using data •Cross training to support other OEM's as needed •Translate a supply chain challenge into an analytical problem, relaying results in common business language with managerial implications. Partner with Supply Chain operational teams (e.g., supply & replenishment planning, distribution & logistics) and other Client organizations (e.g., device marketing, merchandising) to identify supply chain inefficiencies and potential root causes. •Design and implement creative approaches to predictive modeling problems •Perform model assessments, validation, and enhancement activities •Track and report success metrics for projects and their impact on key supply chain KPIs •Partner with IT to effectively migrate analytical models from prototype to production •Drive adoption and application of analytical model results with business partners, ensuring benefits realized •Present and communicate analytical modeling results to business partners and other internal and external stakeholders in a simplified structure with clear business heuristics which can be implemented in our supply chain •Maintain a working knowledge of modeling, data mining and visualization best practices •Stay current with day-to-day operational business needs and join daily discussion and meetingExperience Required: You are good with numbers and you love to dig into data to find the story. Designing reports and spreadsheets is a fun afternoon for you. You are detail-oriented and know how to focus on what really matters. You understand the importance of accuracy in data analytics and reporting. You are a self-starter and a multitasker who can work independently under tight timelines. You want to make an impact by providing the data that will help improve the experience of our customers.Required: •Bachelor's degree or four or more years of work experience •Four or more years of relevant experience •1+ years of experience in developing and implementing analytical models in business •Skills and hands-on experience with SQL •Knowledge and hands-on experience in statistical software packages (e.g., R, SAS or SPSS) •Coding skills in a general-purpose programming language (e.g., C/C++, Java or Python)Preferred: •Master's degree in Supply Chain, Operations Research, Industrial Engineering, Statistics, Economics or a related STEM field •4+ years of experience in developing and implementing analytical models in business •Familiarity and hands-on experience in simulation software packages (e.g. ExtendSim) •Familiarity and experience with creating analytical data sets •Familiarity and experience with data visualization software like Qlikview, Tableau or Excel •Experience and competency in supply chain management"}