{"jobID": "2593609143", "jobLocation": "Menlo_Park_CA", "jobTitle": "Data Scientist - Online Safety, Security", "companyRating": "4.5", "companyInfo": {"Website": "www.facebook.com", "Headquarters": "Menlo Park, CA", "Size": "10000+ employees", "Founded": " 2004", "Type": " Company - Public (FB) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Google, Snap, Uber"}, "estimatedSalary": "155000", "jobDescription": " Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities we're just getting started.Online Safety is a team that works to protect Facebook's most vulnerable groups. We want to make sure that people are not placing themselves in danger as a result of their activity on Facebook, and on the flip side, people are not using Facebook as a means of threatening or carrying out threats against others. We're looking for a Data Scientist to help us get a deep understanding of how these groups of people use Facebook, analyze current safety trends and develop solutions to detect and mitigate risk. You will enjoy working with one of the strongest data sets in the world, cutting edge technology, and the ability to see your insights being used to protect people. The perfect candidate will have a background in a quantitative or technical field and experience in data-driven decision making. Beyond technical skills, you need to pay attention to detail and the ability to effectively present results. You need to be focused on impact, a self-starter, and have demonstrated success in using analytics to drive the understanding, growth, and success of a product. This is a full-time position located at our headquarters in Menlo Park, CA. Responsibilities:"}