{"jobID": "2633855189", "jobLocation": "Washington_DC", "jobTitle": "Contingent Data Management Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.imagine-one.com", "Headquarters": "Colonial Beach, VA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "45000", "jobDescription": "Job DescriptionJob Title: Contingent Data Management Analyst  Job Code: 10319700Job Location: Washington Navy Yard  Washington, DC Imagine One is currently seeking a contingent Data Management (DM) Analyst within the U.S. Navy’s Program Executive Office, Littoral Combat Ship (PEO LCS). We are looking for a DM Analyst to provide support for daily contract management/administration to include management of deliverables tracking through the Program Office Integrated Data Environment (IDE). Work will be performed on or near the Washington Navy Yard. This work is contingent on the approvals of the prime contractor and the government client. Contribute to the Preparation of Performance Work Statements (PWS) or Statement of Work (SOW) with concurrent Contract Data Requirements List (CDRL).Support in monitoring contractor compliance in accordance with the terms and conditions of the contract.Review contractor deliverables for accuracy.Draft CDRL Approval/Rejection letters in accordance with the Navy Correspondence Manual.Participate in meetings, keeping minutes and maintaining action items as directed.Provides direct support to the PMS 501 Data Manager by proofing all CDRL response letters before final signature.Prepares conformed copies of DD 1423s after Parts Control Board (PCB) approval of administrative CDRL changes.Processes CDRL extensions on behalf of the PMS 501 Data Manager.Audits shipper notifications and makes corrections as needed.Provides ad hoc metrics to the PMS 501 Data Manager pertaining to the timeliness and quality of CDRL submittals.Experience Requirements:Proficient with Microsoft Office products.Attention to detail and ability to communicate effectively.Experience with database management (Oracle environment preferred).Writing and Proofreading skills.Desired: Working knowledge of Data Item Descriptions (DIDs), CDRLs, PWS, and SOW.Desired: Working knowledge of Federal Acquisition Regulation (FAR) and Defense FAR (DFAR) Supplements.Desired: Experience with Navy Data Management Procedures.Keys to success in the DM Analyst position are: attention to detail; ability to multi-task, track projects; and letter writing/editing skills.Educational Requirements:Bachelor’s degree in Business or a related discipline.Security Requirements:U.S. Citizenship requiredSecret Clearance Imagine One offers a full package of benefits and competitive salary. Excellent group medical, vision and dental programs. 401K savings plan; $4K annual tuition reimbursement ($5K if pursuing Master’s degree); employee training, development and education programs; profit sharing; advancement opportunities; and much more! *Imagine One “Contingent” offers for employment may stipulate that one or more requirements be satisfied before final commitment between candidate and Imagine One is established; namely, award of contract to the Imagine One Team. Contingent requirements vary and mayalso include, but not be limited to additional factors (i.e., the position still being available after negotiations with the Government; final approval of your qualifications by the Government; or ability to successfully acquire and/or transfer a DoD security clearance)."}