{"jobID": "2739144068", "jobLocation": "Springfield_VA", "jobTitle": "Statistician/Data Scientist (Clearance Required)", "companyRating": null, "companyInfo": {"Website": "www.suntiva.com", "Headquarters": "Falls Church, VA", "Size": "51 to 200 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Government", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Booz Allen Hamilton, Deloitte, PwC"}, "estimatedSalary": null, "jobDescription": "Are you a Data Scientist with a security clearance that is looking for a change?Are you looking for a career opportunity that balances independence with leadership support who will help you grow and develop?At Suntiva we are driven by our passion for helping clients improve the performance of their organizations in significant, measurable, and sustainable ways. Would you like to be a part of an organization with the expertise of a large firm AND the agility and personal attention of a small firm?What You Will Be Doing Conduct logical analyses of management problems and perform multivariate analysis, linear modeling, and data mining. Collaborate with business process owners, technical staff and project managers to leverage the use of data and data strategies across a full spectrum of business/operational needs. Use computer technology, computer modeling, spreadsheet applications, software tools, and programming languages.Analyze data, conduct advanced statistical analyses, and apply mathematical calculations. Present findings and recommendations to appropriate groups.Translate complex, technical findings into an easily understood narrative (i.e., tell a story with the data) in graphical, verbal, or written form.What You Will Need For This PositionActive TS/SCI with polygraph (security clearance) Bachelors degree Familiarity with MS Office, data mining, ability to develop and manipulate, and maintain databases. Demonstrated experience using COTS statistical software (SPSS, SAS, MatLab etc.), COTS desktop software (MS Office and Access), and the Windows operating environment. What Is In It For YouWe are not your typical Intel contractor. We focus on building teams of the best and brightest who are looking for careers with Suntiva. We view you as a valuable asset, supporting our growth beyond the current contract. At Suntiva, there is no prescribed career path. Our leaders get to know you as an individual. They help you grow in a variety of directions, whether in our Intel, Defense or Civilian practices.Our Intel practice is growing, which means many opportunities for you.We understand your need for flexibility and work within contract parameters to provide as much flexibility as possible.Suntiva’s hiring standards are high, so other smart and talented professionals will surround you.Our benefits are some of the best in the industry, including 4 weeks of paid personal leave and up to 40 hours per year to pursue training that advances your career.At Suntiva, our employees are our most valuable asset. Our employees bring their great minds and hearts to help our clients achieve their desired results. As such, we want to make sure that we are doing the right thing, all the time by supporting our employees to achieve their desired results in life. We provide a comprehensive and highly competitive total compensation and benefits package that brings you real value and security to enjoy life today and plan for tomorrow.Health Coverage: Two options for both medical and dental administered by Blue Cross and BlueShield, as well as company, paid Vision plan will ensure you have the flexibility your family needs.Retirement: To ensure your tomorrows are taken care of, we provide both traditional, and Roth IRA retirement plan options and our employee contribution match is 100% of the first 1% plus 50% of the next 5% of deferrals.PTO: With four weeks of personal leave and 10 holidays per year, each employee has time to pursue travel or make sure that life is more than just work.Financial Security: It is vital that Suntiva can support our employees in the good times and the bad. In case life takes a terrible turn our Life, Accidental Death, and Dismemberment (AD&D;), short-term and long-term disability insurance is available at no cost to employees. Tuition & Training: There is no limit to how great our minds can be. Suntiva’ s employees receive reimbursement for certifications, training, conferences, and continuing education AND up to 40 hours per year of paid time to continue expanding their expertise.Learn & Grow: Some of the best ways to grow our minds is from learning from the expertise within Suntiva. There are ample opportunities through brown bags, practice area groups, robust performance management and internal mentoring.Wellness Benefits: Our Wellness Program promotes workforce health and includes $300 annually and a Fitbit for each employee.Referral & Business Development Bonus: Help us grow the company and earn cash rewards.Voluntary Benefits: Life comes with expenses. To help offset some the expenses, Suntiva offers flexible spending accounts, pet insurance and more.*These benefits are provided to all full-time employees and are pro-rated for part-time employees.Who We AreSuntiva is a business transformation and technology company located in Falls Church, VA, serving Federal Government agencies. We enable our clients to improve performance through people, process, and technology in significant, measurable, and sustainable ways. We provide mission critical information technology, digital transformation, organizational performance, human capital, and acquisition lifecycle solutions—with great minds and great hearts.Equal Employment Opportunity/M/F/disability/protected veteran status Job: Primary Location(s): United States- Virginia Nearest Major Market: Washington DC Job Segments: Professional Services, Management Consulting, Data Scientist#JT"}