{"jobID": "2831972457", "jobLocation": "San_Antonio_TX", "jobTitle": "Data Architect", "companyRating": "4.5", "companyInfo": {"Website": "www.method360.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Optimal Solutions Integration, Capgemini"}, "estimatedSalary": "77000", "jobDescription": "Title:Data ArchitectStart Date:ImmediateRate:NegotiableDuration:PermanentLocation:San Antonio, TXThis is a Permanent (FTE) role is not eligible for visa sponsorship per client policy. Candidates must be authorized to work for any employer in the US as a precondition of employment. Vendor submittals that require sponsorship will not be considered.Position Description:Participate in the design of optimal and efficient data architecture to deliver business data visualization for the organization. Plans and designs the processes for data migration to ensure data integrity and completeness. Assists in the development of database testing and recommends acceptance upon completion.Responsibilities:Interact with key decision makers to understand business needs, design analytics use cases, and determine a path to deliveryDesign conceptual and logical data models and flowchartsActs as data expert by suggesting technologies, technology approaches, and processesLeads full life-cycle projects from requirements gathering through development, implementation and roll-outProvide insight into the changing database storage and utilization requirements for the company and offer suggestions for solutionsAnalyze database implementation methods to make sure they are in line with company policies and any external regulations that may applyCreate data monitoring models for each product and work with our marketing team to create models ahead of new releasesDevelop database design and architecture documentation for the management and executive teamsDeveloping database solutions to store and retrieve company informationInstalling and configuring information systems to ensure functionalityAnalyzing structural requirements for new software and applicationsDevelop database solutions to store and retrieve company informationMigrate data from legacy systems to new solutionsImprove system performance by conducting tests, troubleshooting and integrating new elementsOptimize new and current database systemsProvide operational support for Management Information Systems (MIS)Qualifications:Bachelor’s degree or equivalent combination of experience and education required in a Computer Science, Technology or Engineering programEight (8) years of work experience in data environmentsFour (4) to six (6) years of overall technical project delivery experienceStrong data management related technical knowledge and delivery experience in the following areas: Database design and modeling (SQL Server, PostgreSQL, Oracle), can include NoSQL technologiesETL design and delivery (SQL Server Integration Services, Informatica)Reporting tool configuration, administration, and report development (SQL Server Reporting Services, Power BI, Tableau)Experience using cloud platforms such as AWS, Azure, etc. Experience using PaaS BI services is a plus.Knowledge of standard methodologies, concepts, best practices, and procedures for a BI environment.Knowledge of data governance and master data management processes and procedures. Experience developing master data solutions.Experience supporting data scientists through the data engineering process and operationalizing data science models is a plus.Strong software engineering experience. Design and development of Micro service architecture, RESTful service, etc. is a plus.Ability to lead and mentor other team members or developers while leading projectsAbility to read and interpret documents clearly and informativelyAbility to write routine reports and correspondenceAbility to communicate effectively dealing with internal and external customers and suppliersAdd, subtract, multiply, divide, compute rates, rations and percentagesExhibit sound and accurate judgment and demonstrate accuracy and thoroughnessAbility to identify and resolve problems in a timely mannerAbility to apply common sense understanding to carry out written, oral or diagram form instructionsAbility to think logically in following procedures and instructionsThe ability to work under stress with interruptions and deadlinesWork independently as well as within a collaborative teamStrong organizational skills and ability to execute manual detailed tasksContribute to building a positive team spiritAbility to work onsite and participate in interactive onsite meetings on a regular and predictable basisAbility to initiate immediate interaction, coordination and collaboration with team members, clients, customers etc.Please apply through our on-line portal with yourresume and contact information. Applications will be reviewed and assessed against position requirements. Qualified candidates will be contacted by the lead recruiter within 48 hours of submittal. No phone calls please.You may also apply for this position by mail. Send your cover letter and resume to:Corporate StaffingMethod360 Inc.1 Post Street, Suite 550San Francisco, CA 94104Method360 is proud to be an Equal Opportunity Employer"}