{"jobID": "2668774558", "jobLocation": "Petaluma_CA", "jobTitle": "Temporary Facilities Assistant", "companyRating": null, "companyInfo": {"Website": "www.phealthcenter.org", "Headquarters": "Petaluma, CA", "Size": "201 to 500 employees", "Founded": " 1992", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " St. Joseph Health System, Kaiser Permanente, Sutter Health"}, "estimatedSalary": null, "jobDescription": "Job Description:The Petaluma Health Center’s mission is to provide high quality health care, with access for all, in Southern Sonoma County. The Center accomplishes this mission through collaborative, innovative programs, services and referral resources that meet the economic needs of the entire community.The Petaluma Health Center is an eight-time award winner in the North Bay Business Journal’s Best Places to Work for 2017, 2016, 2015, 2014, 2013, 2012, 2011 and 2009 and we were named as one of &apos;2015 Healthiest Companies in the North Bay&apos; by the North Bay Business Journal.We are a Federally Qualified Health Center (FQHC) that provides primary medical care and mental health services to residents of Petaluma, Rohnert Park, Cotati, Penngrove and surrounding areas. We are organized as a private, non-profit corporation and governed by a consumer and community led Board of Directors.For more information about us, please visit us at www.phealthcenter.org.Position Title: Temporary Facilities Assistant - Community Health Clinic3-Month Assignment with the possibility to become a regular full time positionMonday through Friday - Standard office hoursAs a Temporary Facilities Assistant you will handle general maintenance tasks at Petaluma Health Center’s buildings, properties and departments. You will be involved in building maintenance and lite repair, environmental and safety regulatory compliance, handle lite grounds maintenance and custodial support. You’ll be the go to person for special event and room setup, staff office moves and shipping / receiving materials. You should enjoy working in a fast paced team environment and be devoted to customer service.Areas of Responsibility:May open facility daily and ensure facility is ready for business.May conduct daily building inspection rounds to check for variances in housekeeping.Check meeting room schedules daily and facilitate meeting room set up.Perform set up, tear down and cleanup of group meeting rooms with assistance from other facilities staff as needed.Complete all preparation for contract night cleaners.Assemble furniture for staff use.Complete miscellaneous paint jobs, minor repairs and tasks as needed for optimal building performance.Perform preventive maintenance tasks.Check and replaces light tubes.Assist in Materials \"receiving and stocking\" when needed.Periodically inspect and assess condition of building and grounds; report or correct conditions as appropriate.Perform periodic major building maintenance including but not limited to window washing and building power washing.Performs other duties and tasks as assigned. Required Experience:QualificationsTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Knowledge of or ability to quickly learn maintenance and preventative methods and procedures used in keeping buildings in clean and orderly operating condition.Knowledge of or ability to quickly learn safety precautions, processes and procedures critical to facilities management.Ability to perform physical labor necessary to successful completion of tasks.Sensitivity to the needs and situations of a multi-cultural staff and patient population from all socio-economic levels.Education/ExperienceHigh school or GED; trade school a plus.Minimum two years of facilities operations, maintenance and/or janitorial experience.Work experience in a health care and or health clinic environment a plusLicenses and CertificationsCurrent, valid California Driver’s LicenseComputer SkillsFamiliarity with Outlook and other basic computer operationsPhysical Demands:The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Duties require: Frequent movement, standing, walking, carrying and lifting up to 50 pounds, occasionally to bench heightClose and distant visual acuityDriving between PHC facilities and other nearby businessesEnvironmental Conditions:General office environment and outpatient clinic environment with noise levels routine to these settings.The job may occasionally be performed under some temperature extremesSome exposure to moving mechanical parts, fumes, chemicals, airborne particles, risk of electrical shock. Petaluma Health Center is an equal opportunity employer.Please apply directly through our career page at www.phealthcenter.org.  Keyword: Temporary Facilities Assistant  From: Petaluma Health Center Inc"}