{"jobID": "2606649382", "jobLocation": "Washington_DC", "jobTitle": "Manager of Software Development", "companyRating": "3.6", "companyInfo": {"Website": "www.appian.com", "Headquarters": "Reston, VA", "Size": "501 to 1000 employees", "Founded": " 1999", "Type": " Company - Public (APPN) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Salesforce, Pegasystems, ServiceNow"}, "estimatedSalary": "141000", "jobDescription": " You are a catalyst of change. You have the ability to learn continuously and adapt easily. You create situations where engineers can give their best while providing technical leadership and taking responsibility for the professional growth of individuals on your team.  Managers of Software Development provide technical leadership and are responsible for the professional growth and development of engineers. As a Manager, you will provide direct 1-on-1 mentoring, coaching and career development to a group of software engineers to improve their skills while also handling general HR management responsibilities. Managers are servant/leaders who should enjoy helping groups succeed. For this particular management role you should feel comfortable coding up to 75% of the time. Responsibilities:Broad technical understanding across multiple technology layers, providing effective code reviews and technical feedback (must be comfortable hands on coding).Effectively manage up to 6 direct reports through mentoring and coaching.Develop and guide the career paths of direct reports.Provide input to create staffing plans with departmental leadership.Be an agent for change, at both the team and departmental level.Foster a culture of learning and growth.Performance of HR Management tasks related to each direct report; such as timesheet approval, communication of raises and bonuses, performance reviews, etc.Preferred Experience Level: 7+ years in software development, with 5+ years as a mentor or manager Education: B.S. in Computer Science or related field, advanced degree preferred #LI-AD1"}