{"jobID": "2824584674", "jobLocation": "Austin_TX", "jobTitle": "Forensic Scientist - Chemistry", "companyRating": "4.0", "companyInfo": {"Website": "www.austintexas.gov", "Headquarters": "Austin, TX", "Size": "10000+ employees", "Founded": " 1839", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "52000", "jobDescription": " Position Information Posting Title Forensic Scientist - Chemistry Job Requisition Number COA078424 Position Number 113499 Job Type Full-Time Division Name Police Headquarters Minimum Qualifications Graduation with a Bachelor’s degree from an accredited college or university with major coursework in Chemistry, Natural Science, or in a field related to the job including twenty-eight (28) semester hours of Physical Chemistry Licenses or Certifications:Valid Texas Class C Driver’s LicenseNotes to Applicants This position analyzes drug specimens and creates analysis reports and documents. Assists in maintenance of laboratory instruments and equipment. Assists with clandestine lab investigations. Testifies as expert witness in court of law.  A detailed and complete City of Austin employment application is required and will help us better evaluate your qualifications, and will be used to determine salary if you are selected for this position. A resume must be submitted but will not substitute for a complete employment application. Please verify the employment history dates on your resume exactly match the online application. A copy of your transcript/s must also be submitted with your application. Please attach them as “Other Document” in the attachment section of your application. The top candidate must pass a comprehensive pre-employment background investigation that will be comprised of:• Nelson Denney Testing • Financial Background Investigation • Drug Screen • Polygraph Examination • Criminal Background Check • Background History Check (comprehensive reference check)Pay Range $23.44 – $29.80 Hourly RateHours Monday – Friday, 8am – 5pmSome holidays, weekends and after hours callbacks will be required.Job Close Date  07/05/2018 Type of Posting External Department Police Regular/Temporary Regular Grant Funded or Pooled Position Not Applicable Category Professional Location 812 Springdale Rd., Austin, Texas 78702 Preferred Qualifications College-level Statistics course(s)Certified in drug analysis as a “Fellow” by the American Board of CriminalisticsParticipation in an ASCLD/LAB approved proficiency testing programCourt qualified as an expert witness in the areas of drug chemistry, and/or clandestine lab analysisAbility to obtain a Texas Forensic Science Commission (TFSC) license as a Forensic Analyst in Seized DrugsDuties, Functions and Responsibilities Essential duties and functions, pursuant to the Americans with Disabilities Act, may include the following. Other related duties may be assigned.1. Interprets the basics of analytical and instrumental test results 2. Creates and maintains analysis reports, records and documents 3. Assists in the maintenance, evaluation and performance of laboratory instruments,4. Provides technical oversight of breath alcohol operators5. Assists in the training of police officers in evidence collection and preservation, proper labeling, and use of the laboratory information system. 6. Reviews and approves case work for other chemists.7. Testifies as a witness in court 8. Analyzes drug and alcohol evidence 9. Assists with clandestine lab investigations Responsibilities- Supervision and/or Leadership Exercised:noneKnowledge, Skills and Abilities Must possess required knowledge, skills, abilities and experience and be able to explain and demonstrate, with or without reasonable accommodations, that the essential functions of the job can be performed.• Knowledge of the basic theory and application of organic chemistry, inorganic chemistry, analytical techniques, qualitative and quantitative analysis, and physical chemistry.• Knowledge of instrumental analysis including gas chromatography, mass spectrometry, infrared analysis, and ultraviolet analysis.• Knowledge of applicable processes, techniques, and methods.• Knowledge of Federal, State, Local laws, and ordinances.• Knowledge of city practice, policy, and procedure• Skill in handling hazardous evidence.• Skill in oral and written communications.• Skill in handling multiple tasks and prioritizing.• Skill in using computers and related software applications.• Skill in data analysis and problem solving.• Ability to make rational judgment calls.• Ability to work with frequent interruptions and changes in priorities.• Ability to establish and maintain effective communication and working relationships with city employees and the public.Does this job require a criminal background investigation? This position requires a criminal background investigation EEO/ADA City of Austin is committed to compliance with the American Disabilities Act. If you require reasonable accommodation during the application process or have a question regarding an essential job function, please call (512) 974-3210 or TTY (512) 974-2445.Information For City Employees: If you are an employee within the division, are in good standing and meet both the minimum and preferred qualifications, then you will receive an initial interview. "}