{"jobID": "2644308368", "jobLocation": "Hackettstown_NJ", "jobTitle": "Associate Scientist", "companyRating": null, "companyInfo": {"Website": "www.apninc.com", "Headquarters": "Newark, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Associate Scientist Duration:10-11 months Location: Hackettstown NJ.** Pay Rate is $25 an hour *** Desired start date is 3/1/18 Job Purpose/Overview  The External Manufacturing Associate Scientist role supports external manufacturing quality initiatives in the region to ensure the ongoing production of high quality and safe food products within the external manufacturing network. This role supports the implementation and verification of all applicable Mars Global Quality and Food Safety Standards throughout the External Manufacturing network. In addition, may also support qualification, product start up, performance management, and process improvement initiatives at Mars Wrigley Confectionery external manufacturing locations.  Key Responsibilities  Please list the most important and relevant responsibilities Supports the deployment and compliance of the Mars Global EMQM standard and other applicable standards within the External Manufacturing networkCoordinates and conducts Product Verification program, including managing schedule for required shipments, verifying items meet internal specifications (weight, packaging, code date, etc), notifying site QA lead of non-conformances, supporting follow up activities and managing records.Supports the quality team in monthly metrics data collection and reporting.Manage customer inquiries and provide response on quality programs and certifications. • Context and Scope  Complete how the job gets done and the way it operates (impact and interaction) This position will be based at the MWC National Office in Hackettstown, NJWill be required to interact with internal cross-functional team as well as External Manufacturing partners. Minimum qualifications Background in Chemistry, Food Science, Engineering or related technical field required Preferred AS or BS degree in Chemistry, Food Science, Engineering or relatedKnowledge/ExperienceExperience in a technical area such as Quality & Food Safety, R&D; product development, laboratory management, or food process engineeringExcellent interpersonal skills and the ability to work independently and as a member of a teamStrong Microsoft Excel skills Preferred Understanding of Good Manufacturing Practices (GMPs), Good Laboratory Practices (GLPs), HACCP, Sensory, Microbiology, Regulatory and Food Law guidelinesExperience or understanding of GFSI systems such as SQF, BRC and FSSC 22000"}