{"jobID": "2722074178", "jobLocation": "Los_Angeles_CA", "jobTitle": "Independent Sales Representative – School Division", "companyRating": null, "companyInfo": {"Website": "www.collectivegoods.com", "Headquarters": "Louisville, CO", "Size": "51 to 200 employees", "Founded": " 1991", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Great American Opportunities, Barnes & Noble"}, "estimatedSalary": null, "jobDescription": " About Us:Collective Goods has mastered the art of giving back for the past 25 years. Our core values of convenience and caring shine bright by bringing our customers high-value, low-cost, innovative products while giving back to worthwhile causes. We are seeking Independent Sales Representatives who are passionate, driven, and self-motivated people to join our team!Job Description:Responsibilities:  • Coordinate sales events at schools in your community  • Prospect and contact potential new customers  • Maintain relationships with current accounts  • Receive cool and relevant product on consignment (you don’t pay for it until you sell it!)  • Strive to reach sales goals for your territory  Qualifications:  • Self-starters who can manage their time  • Previous business owners or entrepreneurial-minded individuals preferred  • Previous experience in sales, education, route sales, delivery, etc. are preferred  • Ability to build rapport with clients  • Strong account management skills  • Passionate about contributing to your community  Independence:  • Work from your home office, flexible schedule, and decide how you'll grow the business  • This is a 1099 independent contractor full commission position  • Get paid based on your hard work and sales  • Coaching, mentoring, and support from our national company and Senior Sales Leaders  What makes us better:  • No micromanagement  • Own your own results and get paid well for your hard work  • Our model is an exciting approach that has proven results in the industry for 25+ years  • Over half a billion dollars in product donated to schools and businesses since 1990Our Values:Be a Good Human  Always wow our customers  Deliver awesome products at great value  Care for our communities and each other  Inquire, innovate and inspire daily  Be courageous to do what's right  Have open, honest and respectful communication  Create fun and smile"}