{"jobID": "2829231109", "jobLocation": "N_o_n_e", "jobTitle": "Disaster Recovery Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.icf.com", "Headquarters": "Fairfax, VA", "Size": "5001 to 10000 employees", "Founded": " 1999", "Type": " Company - Public (ICFI) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Booz Allen Hamilton, Abt Associates, Oliver Wyman"}, "estimatedSalary": null, "jobDescription": "Working at ICF Working at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. If you’re seeking to make a difference in the world, visit www.icf.com/careers to find your next career. ICF—together for tomorrow.  ICF seeks a Data Analyst responsible for collection and analysis of data from multiple sources to support comprehensive decision-making in the disaster recovery program. Key Responsibilities: - Collect data on disaster impacts on individuals, businesses, and communities - Conduct quantitative analysis of data and present data in formats to support executive decision-making - Writing background summaries for program management  Basic Qualifications: - Bachelor's degree - 5+ years of data analytics and data visualization experience - Expertise in Microsoft Excel and Microsoft Access. - Experience using GIS and other data sets to support understanding and identification of effected individuals in specific geographic spaces - Experience using analysis to reviewing and evaluate program performance measures in grant distribution and financial performance Preferred Skills/Experience: - Data retrieval from Data bases and Data warehouses - GIS plotting - Integrating data from external sources to FEMA disaster software programs - SharePoint development and expansion Professional Skills: - Excellent verbal, interpersonal and written communication skills - Team player with the ability to work in a fast-paced environment - Ability to be flexible to handle multiple priorities and to work extended hours as necessary - Strong planning and organizational skills - Self-starter and able to work independently - Demonstrated level of professionalism in providing administrative support, including ability to exercise good judgment, discretion, tact, diplomacy and commitment. - Excellent problem solving skills with ability to analyze situations, identify existing or potential problems and recommend solutions Working at ICF: Working at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. If you’re seeking to make a difference in the world, visit www.icf.com/careers to find your next career. ICF—together for tomorrow. ICF offers an excellent benefits package, an award winning talent development program, and fosters a highly skilled, energized and empowered workforce. ICF is an equal opportunity employer that values diversity at all levels. (EOE – Minorities/Females/Protected Veterans Status/Disability Status/Sexual Orientation/Gender Identity) Pay Transparency Statement: For more information, please click here: https://www.dol.gov/ofccp/pdf/pay-transp_formattedESQA508c.pdf  Texas Client Office (TX88)"}