{"jobID": "2818453205", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Analyst", "companyRating": "2.5", "companyInfo": {"Website": "www.hanmi.com", "Headquarters": "Los Angeles, CA", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Public (HAFC) ", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "43000", "jobDescription": " The Data Analyst is responsible for maintaining data integrity and building data reports to provide visibility to Bank activities and customer profiles. This position provides data-driven insights in the form of ad hoc analyses, presentations, and automated reports, and encompass marketing, product, and finance analytics.  Demonstrates knowledge of, adherence to, monitoring and responsibility for compliance with state and federal regulations and laws as they pertain to this position including but not limited to the following: GLBA(Gramm-Leach-Bliley Act), Regulation Z (Truth in Lending Act), Regulation DD (Truth in Savings Act) Regulation B (Equal Credit Opportunity Act), Dodd–Frank Wall Street Reform and Consumer Protection Act (Dodd Frank Act), Elder Abuse Laws, Bank Secrecy Act in conjunction with the USA PATRIOT Act, Anti-Money Laundering and Customer Information Program, Right to Financial Privacy Act (state and federal) and Community Reinvestment Act. Manages master data, including creation, updates, and deletion.Provides quality assurance of imported data.Processes confidential data and information according to guidelines.Manages and designs the reporting environment, including data sources, security, and metadata.Supports the data warehouse in identifying and revising reporting requirements.Supports initiatives for data integrity and normalization.Assesses tests and implements new or upgraded software and assists with supporting strategic decisions on new systems.Generates reports from single or multiple systems.Troubleshoots the reporting database environment and reports.Trains end users on new reports and dashboards.Provides technical expertise on data storage structures, data mining, and data cleansing.Treats people with respect; keeps commitments; inspires the trust of others; works ethically and with integrity; upholds organizational values; accepts responsibility for own actions. These specifications are general guidelines based on the minimum experience normally considered essential to the satisfactory performance of this position. The requirements listed below are representative of the knowledge, skill and/or ability required to perform the position in a satisfactory manner. Individual abilities may result in some deviation from these guidelines.  • Bachelor’s degree from a college or university; and/or at least three (3) years of experience and/or training in project management preferably within the financial services industry; or the equivalent combination of education and experience. Educational experience, through in-house training sessions, formal school or data management or related curriculum. Speaking, reading and writing in Korean is a plus.Ability to deliver bilingual customer service in Korean, Gujarati, Urdu, Hindi, Chinese, Vietnamese, or Spanish is a plus.Ability to analyze existing tools and databases and provide software solution recommendations.  We will consider for employment all qualified Applicants, including those with Criminal Histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance. We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law."}