{"jobID": "2833221150", "jobLocation": "Oak_Brook_IL", "jobTitle": "Associate Food Scientist", "companyRating": "2.8", "companyInfo": {"Website": "www.treehousefoods.com", "Headquarters": "Oak Brook, IL", "Size": "10000+ employees", "Founded": " 2005", "Type": " Company - Public (THS) ", "Industry": " Manufacturing", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "62000", "jobDescription": "Employee Type: Full time Location: IL Oak Brook Job Type: Research and Development Job Posting Title: Associate Food Scientist Job Description: Major Responsibilities Under direct supervision, researches, executes experiments, gather data, develops preliminary findings and prepares written reportsDevelops products (i.e. new, line extensions, optimized, CCR's) beginning at conception through successful commercialization and verificationProvides technical support to product, production, suppliers, and QualitySeeks inputs and recommends appropriate methods, tests and procedures for testingMaintain accurate, complete and confidential recordsComplete project objectives/timelinesCoordinate and execute pilot and plant trials and new product start-upsDevelop and issue Fit for Use, Consumer Based Specifications, processing and raw ingredients specificationsPrepare technical reports with clear and accurate summaries/abstractsSupport identification and development of ideas for technology improvements/cost savingsEssential Experiences Gained from this Role:Understand the organization & beginning integration with cross functional organizationNavigate with support to drive projects to completion through the Product Development Life CycleNavigate and generate specifications within the Product Vision systemDevelop technical foundation in field assignedDemonstrated ability to effectively communicate (verbal and written)Ability to execute at least two projects simultaneously with quality and efficiencySupport leadership in approaching technical solutionsDevelop technical timeline skillsDevelop problem solving skillsRequired Qualifications:BS in Food Science or related fieldRecommended Food/Lab/Science related experiences (i.e. course work, internship, job, etc.)Creative and the need for a challengeSelf-Starter TreeHouse Operating Principles Drive for Results & AccountabilityCollaboration/TeamworkInternal and External Customer FocusSelf and People DevelopmentInnovation & Continuous ImprovementIntegrity and Courage Disability Assistance  TreeHouse Foods is an Equal Employment Opportunity Employer and offers opportunities to all job seekers, including those with disabilities. If you need a reasonable accommodation to assist with your job search or application for employment, please contact us by sending an email to disability-accommodations@treehousefoods.com. In your email please include a description of the specific accommodation you are requesting and a description of the position for which you are applying.  EEO Considerations  All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, citizenship, disability or protected veteran status.SDL2017"}