{"jobID": "1931136434", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Software Engineer - Data", "companyRating": "3.9", "companyInfo": {"Website": "www.housecanary.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "152000", "jobDescription": " At HouseCanary, were using data and analytics to predict the future of US residential real estate. Our goal is to help people make better decisions by offering innovative and unparalleled insights. HouseCanarys platform accurately forecasts values 36 months into the future for four million residential blocks and more than 100 million properties.  Were seeking a passionate Senior Software Engineer to help build out the backend data platform powering the most accurate real estate analytics tools in the world. What you'll do:Develop performant and reliable distributed services to address core data platform needs across the companyDesign solutions that handle and expose large datasets with case-appropriate tradeoffsCreate the APIs that power our productsPartner with data analysts to implement industry-leading data standardization methodologiesArchitect resilient ETL pipelines to cleanse, standardize, and process data from numerous sourcesCollaborate with talented data scientists to optimize and operationalize their reference implementation predictive models for production.What you have:5+ years of software engineering experienceA focus on high-performance architecture and codeExpertise in Python developmentExperience and interest in working with dataDeep understanding of several databases that have different strengthsSolid SQL knowledgeComfortable with Linux command lineExperience with AWSA strongly proactive approach to improving systemsExcellent communication skills and collaborative personalityBonus points for knowledge of:Real estate marketsGeospatial developmentRedisNumPy, PandasGoC HouseCanary is the authoritative source for accurate, uniform information, analyzed and visualized real-time to make better, faster decisions.  HouseCanary - see into the future of real estate."}