{"jobID": "2474047955", "jobLocation": "San_Francisco_CA", "jobTitle": "GL Account Manager", "companyRating": null, "companyInfo": {"Website": "www.bayclubs.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 1977", "Type": " Company - Private", "Industry": " Arts, Entertainment & Recreation", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Who We Are: We believe life is made up of moments: playing bocce with friends, going for a dip on a hot summer day, and saluting the sun just because its up. Somewhere along the way, someone told us that those moments are for Saturdays, not Mondays. That we should work fifty weeks each year just to save up for two weeks of happiness. At the Bay Club, we believe these moments are for every daybecause we believe in living life happy. And that means focusing on what really matters like family, good health and finding the time to have fun. What We Do: Founded in 1977, the Bay Club enjoyed many industry firsts, eventually moving beyond strictly fitness to forge a unique niche in the hospitality realm by incorporating resort-level programs and services into our clubsand by grouping complementary properties into amenity-rich campuses. Bolstered by a pioneering spirit, a forward-thinking company culture, and a belief in helping members to live life happy, the Bay Club has created a modernized country club experience through innovations such as the 77 Social Club and Connect Workplace Suites, along with thoughtful amenities, including an in-club Starbucks café and outdoor lounges with shuffleboard courts and fire pits.  The Bay Club Company is headquartered in San Francisco, with clubs from Marin to San Diego and a team of more than 3,000 associates who are guided by integrity, innovation, growth and community. Sparked by imagination and a progressive culture, the Company has entered a growth plan that has taken it from 12 clubs to more than 20 properties in an 18-month period, with continued accelerated growth anticipated over the next five years. And were looking for talented and motivated individualswho also believe in living life happyto join our quickly growing team! What We Can Offer You:Competitive compensationMedical, dental, and vision plansAdvancement opportunitiesComplimentary full use of Bay Club facilitiesDiscounts on services, lessons, amenities, and F&B; products.PRIMARY JOB FUNCTIONSAssist Controller with effective and efficient execution of month end close procedures, including process improvements, monitoring close deadlines, and verification of journal entries / account reconciliations for entire Company.Prepare and review month end journal entries and account reconciliations.Drive development of policies and procedures and related documentation to ensure all general ledger activity is maintained in accordance with GAAP.Support Controller with key treasury administration, including but not limited to, credit card administration, managing controls and authorization limits, and review of daily cash procedures.Identify and implement process improvements and efficiency projects for the accounting function.Prepare financial reporting including verification of amounts reported, preparing variance analysis, and reporting tie-outs.Perform technical accounting research and development of policies and whitepapers as needed.Assist with management of the annual independent audit process, tracking progress and deliverables, preparing and reviewing audit schedules, and assisting in the audit reporting function.Coordinate financial reporting controls documentation, and monitor the companys business control efforts.Provide enhanced support for daily operations of other finance areas (tax, treasury, revenue accounting, payroll, financial planning and analysis).MINIMUM QUALIFICATIONSCPA with Bachelors degree in Accounting, Finance or related degreeFive to seven years total experience with at least two years in a management rolePublic accounting/ audit experience, Big 4 preferredUnderstanding, knowledge and experience in US GAAP, monthly closing process, and audit facilitation.Ability to research accounting guidance, propose opinions on treatment of accounting topics and document positions in whitepaper format, including supporting calculations.High standard of professionalism in both communication and work product.Selfstarter with strong attention to detail, problem solving, and ability to manage competing priorities/ tasks in a fast paced constantly changing environment.Provide leadership, mentoring and coaching to staff that ensures development of a highly skilled and motivated team.Team-oriented, flexible, collaborative and able to adapt to changing priorities and timelines.Excellent in Excel spreadsheet skills, including the ability to create formulas & schedules using pivot tables, vlookup, etc.Strong reconciliation experience / skills to identify and drive efficiency projects.Must be very hands on but also have the experience to be involved with Senior Management on a daily basis and work in a fast paced environment.EDUCATION Bachelors degree in Accounting, Finance or related degree WORKING CONDITIONS/ PHYSICAL REQUIREMENTS The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. This position deals with managers and clients on a regular basis with contact in various forms such as in person, phone and email.It is necessary to adapt to a frequently changing environment.Detail-oriented and willing to learn.Ability to work independently and as a team member.JOB DESCRIPTION REVISION This is not necessarily an exhaustive list of all responsibilities, skills, duties, requirements, efforts or working conditions associated with this job. While this job description is intended to be an accurate reflection of the current job, management reserves the right to revise the job or to require that other or different tasks be performed when circumstances change. This job description replaces all previous descriptions for this position.  The Bay Club Company (TBCC) provides equal employment opportunities without regard to age, ancestry, color, creed, mental or physical disability, marital status, medical condition, national origin, race, religion, sex, sexual orientation, veteran status, or any other consideration made unlawful by federal, state, or local laws."}