{"jobID": "2631506196", "jobLocation": "Austin_TX", "jobTitle": "Data Science Manager", "companyRating": null, "companyInfo": {"Website": "www.indeed.com", "Headquarters": "Austin, TX", "Size": "5001 to 10000 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Simply Hired, CareerBuilder, Glassdoor"}, "estimatedSalary": null, "jobDescription": " Ref#: P1220 Our mission.  As the world’s number 1 job site, our mission is to help people get jobs. We need talented, passionate people working together to make this happen. We are looking to grow our teams with people who share our energy and enthusiasm for creating the best experience for job seekers. The team.  We are a rapidly growing and highly capable engineering team building the most popular job site on the planet. Every month, over 200 million people count on us to help them find jobs, publish their resumes, process their job applications, and connect them to qualified candidates for their job openings. With engineering hubs in Seattle, San Francisco, Austin, Tokyo and Hyderabad, we are improving people's lives all around the world, one job at a time. Your job.The role of Data Science at Indeed is to follow the data. We log, analyze, visualize, and model terabytes of job search data. Our Data Scientists build and implement machine learning models to make timely decisions. Each of us is a mixture of a statistician, scientist, machine learning expert, and engineer. We have a passion for building and improving Internet-scale products. We seek to understand human behavior via careful experimentation and analysis, to “help people get jobs”.  You're someone who wants to see the impact of your work making a difference every day. You understand how to use data to make decisions and how to train others to do so. You find passion in the craft and are constantly seeking improvement and better ways to solve tough problems. You produce the highest quality Data Science solutions and lead others to do the same.  You understand that the best managers serve their teams by removing roadblocks and giving individual contributors autonomy and ownership. You have high standards and will take pride in Indeed like we do as well as push us to be better. You have delivered challenging technical solutions at scale. You have led Data Science or engineering teams, and earned the respect of talented practitioners. You are equally happy talking about deep learning and statistical inference, as you are brainstorming about practical experimental design and technology career development. You love being in the mix technically while providing leadership to your teams. About you.  Requirements Ph.D. or M.S. in a quantitative field such as Computer Science, Statistics or MathematicsSignificant prior success as a Data Scientist Manager (3+ direct reports) working on challenging problems at scale (Industry experience)3+ years of industrial Data Science experience, with expertise in machine learning and statistical modelingThe ability to guide a team to achieve important goals togetherHave full stack experience in data collection, aggregation, analysis, visualization, productionization, and monitoring of Data Science productsStrong desire to solve tough problems with scientific rigor at scaleAn understanding of the value derived from getting results early and iteratingStrong ability to coach Data Scientists, helping them improve their skills and grow their careersCan do small data modeling work: Python, R, Julia, OctavePassion to answer Product/Engineering questions with data We get excited about candidates who Can do big data modeling work: Hadoop, Pig, Scala, SparkCan fish for data: SQL, Pandas, MongoDBCan deploy Data Science solutions: Java, Python, C++Can communicate concisely and persuasively with engineers and product managersIndeed provides a variety of benefits that help us focus on our mission of helping people get jobs.View our bounty of perks: http://indeedhi.re/IndeedBenefits"}