{"jobID": "2786978443", "jobLocation": "San_Francisco_CA", "jobTitle": "Strategic Account Executive", "companyRating": null, "companyInfo": {"Website": "www.pega.com", "Headquarters": "Cambridge, MA", "Size": "1001 to 5000 employees", "Founded": " 1983", "Type": " Company - Public (PEGA) ", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Oracle, Salesforce, SAP"}, "estimatedSalary": null, "jobDescription": "The Position:Selling at Pega provides access to market-leading technology, uncapped earning potential and the world’s most innovative organizations as reference-able clients. Join our team to engage in work that matters, build a career without boundaries, and drive business impact for the world’s largest organizations. As the recognized industry leader in strategic business applications, according to analysts such as Forrester and Gartner, we challenge companies to rethink the way they do business and empower them to become more efficient, smarter, and most importantly customer-centric.Join our disruptive evolution of the software industry as a Strategic Account Executive: https://www.pega.com/about/careers/pega-sales-careers.In this role, you will:Penetrate new organizations/accounts and radiate new business within existing customer base in assigned portfolio of Manufacturing companiesProvide insight to the customer as the basis of the commercial conversation, teaching customers something new/valuable about how to compete in their marketWork with Pega’s partners to generate Pega value propositions Pega Offers:The culture, meritocracy, and growth potential of a start-up with the resources, stability, and tenure of a well-established organizationThe world’s most innovative organizations as reference-able clientsAnalyst acclaimed technology leadership in a massive emerging marketA fast-paced, exciting, collaborative, and rewarding sales environment within innovative industriesCompetitive salary + uncapped commission targets, employee equity in the company, 3 weeks paid vacation plus 10 holidays, 2 community service days, medical/eye/dental coverage, and even pet insurance!The Person:You should be interested in making the world’s leading Manufacturing organizations more productive, efficient, and most importantly – customer-centric. We are seeking an engaging and motivated enterprise software sales professional driven to make a difference in the way companies connect with their customers. You must be able to push the customer’s thinking to quickly gain credibility and build a strong relationship based on adding value. Instead of resolving tension in the relationship, you should be able to create constructive tension, helping customers to understand the urgency and impact of a new behavior. Then, you will proactively coach them through the behavior change.Qualifications will include:BA/BS degree or equivalent business experience8+ years of direct sales experienceSuccess in a sales environment and domain expertise in Manufacturing industryAbility to actively listen, hear and understand what is said and not said, and comprehend the meaning and intentAbility to persuade and influence, using appropriate interpersonal styles and communication methods to gain acceptance of thoughts, plans, activities, services and productsWorking knowledge of BPM, CRM, Case Management Software or enterprise-wide specific solutions within the Insurance industry is preferred"}