{"jobID": "2591882128", "jobLocation": "Los_Angeles_CA", "jobTitle": "Microbiology Associate Scientist", "companyRating": null, "companyInfo": {"Website": "www.biophaseinc.com", "Headquarters": "San Diego, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "BioPhase Solutions specializes in recruiting top talented professionals for Southern California's Scientific community. We are currently looking for an Assistant/Associate Scientist to work for a leading Los Angeles County Area Nutraceutical company.Assistant /Associate ScientistResponsibilitiesPreparation of fermentation medium, buffer solutions, consumable materials, etc as needed to support experiment execution.Execution of lab or pilot-scale bioreactors using various scale fermentation platforms (250ml to 150 L)Evaluation of microbial starter culture system for probiotics fermentationStudy microbial metabolic and functional properties relevant to optimal starter culture performanceWork hands on with bioreactors and related lab instruments and utilize technical knowledge and skills to make detailed observations and analyze data to ensure within operating parameters.Utilizing technical knowledge to identify, troubleshoot, and assist with resolution of process problems and will have the understanding between metabolism and fermentation processesStays informed with current literature and new technologyDocumenting experiment execution using lab notebook, batch record, and or /protocolsOrganizing technical data and provide oral presentations or technical reports to communicate results as requiredPrioritizing and organizing work to meet project deadlines and support team goalsQualificationsExperience with operating and monitoring of bio-reactors/ fermentation equipment, centrifugation , lyophilizer and performing sterile plating techniques including some routine lab workExperience with probiotics e.g lactic acid bacteria/ starter culture technology preferredExcellent oral and written communication skills as well as strong basic computer skillsConsistent , dependable and accurate in carrying out responsibilities working with mutual cooperation and good relationship is importantBasic Minimum Qualification:Bachelor's degree in Microbiology, Biotechnological sciences or related discipline with an emphasis in fermentation and microbial physiology. Master's degree is a plus. Industrial experience for 1-5 years is preferred.If interested, please contact Drew Stephens at (562)495-3200 x2 or send him a copy of your most updated resume at drew@biophaseinc.com. Please visit www.biophaseinc.com for additional jobs as well."}