{"jobID": "2802521869", "jobLocation": "Detroit_MI", "jobTitle": "Auto Manufacturer Now Hiring Full Time Security Officers", "companyRating": "2.9", "companyInfo": {"Website": "www.aus.com", "Headquarters": "Santa Ana, CA", "Size": "10000+ employees", "Founded": " 2016", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "11", "jobDescription": " OverviewAllied Universal provides unparalleled service, systems and solutions to the people and business of our communities, and is North America’s leading security services provider. Allied Universal, North America’s leading security services provider, is experiencing tremendous growth. For all full-time positions, we offer medical, dental, vision, flex spending, 401K, an anniversary bonus, and an on-the-spot recognition program.  We promote from within our company! You can start with little, to no, security experience and become one of Allied Universal’s many success stories. Apply to join the LARGEST SECURITY COMPANY in the United States!Job DescriptionAllied Universal Services is currently searching for a Professional Security Officer.  The Professional Security Officer is the heart of Allied Universal Services. Our officers allow us to accomplish our company’s core purpose which is “to serve, secure and care for the people and businesses in our communities”. The Professional Security Officer is responsible for the safety and security of the facilities they protect. Our security officers act as a visible deterrent to crime and client rule infractions; they detect and report suspicious, unsafe or criminal acts at or near their assigned posts which may be a threat to the property, clients, guests or employees at the site. Although essential activities may differ based on the facility at which they work, below are some of the standards: Ensure the facility is provided with high quality security services to protect people and propertyReport safety concerns, security breaches and unusual circumstances both verbally and in writingBuild, improve and maintain effective relationships with both client employees and guestsAnswer questions and assist guests and employeesAnswer phones or greet guests / employees in a professional, welcoming mannerPhysical and Mental Functions:Stand or walk constantly (for up to an entire shift) on various surfaces (tile, concrete, carpet)Climb stairs, ramps, or ladders occasionally during shiftOccasionally bend/twist at waist/knees/neck to perform various dutiesOccasionally lift or carry up to 40 poundsRun as neededConstant use of both hands and arms in reaching/handling/grasping/fingering while using phone, notepad, writing reports, and other administrative tasksConstant use of eyes (correctable vision to normal level required) to observe, read, interact with public and co-workers, view security monitors; includes hand/eye coordinationWork in various environments including adverse outdoor conditions such as cold, rain or heat;Constant mental alertness and attention to detail required while setting priorities and following up on assignmentsQualifications/Requirements: Qualified applicants for the Professional Security Officer position will meet the minimum requirements, as described below: High school diploma or equivalent requiredAt least 18 years of ageValid Drivers License for 1 year.Must possess effective written and oral communication and interpersonal skills with ability to deal with all levels of personnel and the general public in a professional and effective manner; must be able to use initiative and independent judgment within established guidelinesMust be able to frequently prepare written reports and logs in neat, legible handwriting; may require computer skillsMust be able to read and understand all operating procedures and instructionsMust be able to obtain a valid Guard License as required in the state for which you are applyingAs a condition of employment, employee must successfully complete a background investigation and a post-offer/pre-employment drug/alcohol testAs a condition of continued employment, employee must maintain current active status of all required License at all times, and must carry the license at all times while on dutyMust display exceptional customer service and communication skillsRemain flexible to ever changing environments; adapt well to different situationsIntermediate computer skills to utilize innovative, wireless technology at client specific sitesAbility to maintain satisfactory attendance and punctuality standard;Neat and professional appearanceAbility to provide quality customer serviceAbility to handle both common and crisis situations at the client site, calmly and efficientlyRead, understand and clearly speak English; constantly use speech and hearing (correctable to normal level required) in communicating with public/co-workers, giving and receiving instructions, using phonesMust be able to handle pressure of working with high volume general public (constantly to occasionally depending on assignment) ClosingAllied Universal provides unparalleled service, systems and solutions to the people and business of our communities, and is North America’s leading security services provider. With over 150,000 employees, Allied Universal delivers high-quality, tailored solutions, which allows clients to focus on their core business. For more information: www.AUS.com or http://www.aus.com/offices to contact your local office.  We proudly support the Veteran Jobs Mission, a group of over 200 companies that have committed to collectively hiring a total of one million military veterans. EOE/Minorities/Females/Vet/Disability Allied Universal Services is an Equal Opportunity Employer committed to hiring a diverse workforce.  #ZRRequisition ID2018-209163"}