{"jobID": "2448053263", "jobLocation": "Mountain_View_CA", "jobTitle": "Senior NLP Research Scientist, Intelligence Team", "companyRating": "2.6", "companyInfo": {"Website": "www.sra.samsung.com", "Headquarters": "Mountain View, CA", "Size": "1001 to 5000 employees", "Founded": " 1988", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Sony, LG Electronics, Nokia"}, "estimatedSalary": "205000", "jobDescription": " Samsung Electronics is a global leader in mobile and technology. Through relentless innovation and discovery, Samsung is transforming the way consumers globally interact with the world around them, and our teams mission is to change how billions of users access, explore, and interact with knowledge and information.  The Senior Research Scientist will be a critical member of the Intelligence Team working to develop the features for the next-generation of the Bixby intelligent assistant. We are building a team of curious, fast-learning, and versatile research scientists to develop a new service handling knowledge at a massive scale. We are looking for multiple positions to create a team do achieve the following objectives:  Design and development for a massive global knowledge management service  Participate in leading-edge discovery utilizing the latest methods in deep learning, NLP, AI, machine learning, and knowledge acquisition  Key Qualifications  5+ years relevant professional experience in state-of-the-art Natural Language Processing and Deep Learning  Experience with one or more of the following subjects: text understanding, classification, information retrieval, question answering, intent classification, knowledge extraction / knowledge base management  Proficient at blending machine learning and neural network algorithms for training competitive, state-of-the-art models into parallel computing environments: GPU acceleration, distributed clusters, etc.  Proficient in programming languages: C#, Java or equivalent  Adept at adapting academic ideas and theoretical algorithms into a production system  Excellent problem-solving, troubleshooting, and communication skills  Preferred Qualifications  Experience developing and deploying features to a commercially-deployed, highly-available, big-data, distributed system  Experience improving performance and scalability on mission critical systems  Comfortable working in a face paced environment  Well-grounded in the best practices for developing software for and maintaining large-scale infrastructure  MS/PhD in NLP, ML, AI or equivalent  A can-do attitude with a bias for action  Samsung is an EEO/Veterans/Disabled/LGBT employer. We welcome and encourage diversity as we strive to create an inclusive workplace."}