{"jobID": "2794316714", "jobLocation": "San_Francisco_CA", "jobTitle": "Lead DevOps Engineer", "companyRating": null, "companyInfo": {"Website": "www.harrison-clarke.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2016", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Harrison Clarke International have just partnered with one of the most exciting late stage start-ups in the artificial intelligence space. Our client strives to make autonomous vehicles possible by creating the highly intellectual and astounding software. Our client is backed by some of the most successful Venture Capitalists in Silicon Valley.Our client is currently in the search for a Lead DevOps Engineer to build out the DevOps culture of collaboration within their business. You will be required to provide end-to-end solutions for our client’s infrastructure now and as they grow. This role reports directly to the VP of Engineering. Responsibilities:You will be required to oversee and architect the infrastructure that makes it possible for the company’s engineering team to work efficiently.You will also help the Data Science team manage tooling that processes billion of data points every month.As a Lead DevOps Engineer, you will improve the development and deployment processes to reduce the likelihood of downtime and optimize costs.Required Experience/Knowledge:As a Lead DevOps Engineer, you have at least 4 years DevOps experience in a cloud-based environment and experience managing and leading teams.You have a proven track record of building and optimizing systems that are resilient to failure, ready to growth, and as efficient as possible.You have experience of working in a proactive and fast paced environment, ideally you have experience working at a Start-Up of a similar kind.You have experience deploying and managing PostgreSQL, Redis, ElasticSearch, Python, and Go (or similar tech) on AWS.You have extensive experience with other AWS technologies, such as Redshift, OpsWorks, Kinesis and so on.Technology Stack:Python and Go on the backendPostgreSQL, Elasticsearch and Redis for data managementjs and Ruby on Rails for various tools and servicesAWS, Saltstack, Terraform, and Docker for our infrastructureIf you are interested in working for one of the hottest start-ups in the United States then apply today and a member of the Harrison Clarke team will get back to you! By applying and submitting your resume, contact details and any other personal information, we will process your personal data in accordance with our Privacy Policy. For more information on our Privacy Policy, please click here: https://www.harrison-clarke.com/privacy-policy/"}