{"jobID": "2789560758", "jobLocation": "Chicago_IL", "jobTitle": "Scientist, Analytical Chemist", "companyRating": null, "companyInfo": {"Website": "www.abbvie.com", "Headquarters": "North Chicago, IL", "Size": "10000+ employees", "Founded": " 2013", "Type": " Company - Public (ABBV) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amgen, Baxter, Bristol-Myers Squibb"}, "estimatedSalary": null, "jobDescription": "The Analytical Chemist will provide technical support for analytical methodologies in commercial and development phases of drug product manufacturing. This role will be based out of the North Chicago facility. This individual will support the development, validation and transfer of analytical test methods to commercial manufacturing sites, as well as contract and Affiliate laboratories while also providing some troubleshooting/continuous improvement support to these laboratories. The individual may also contribute to regulatory submissions and submission responses for new products or product changes.**This position is part of a hierarchical continuum and will be filled at a level consistent with the education and experience of the best candidate**Key Responsibilities Include:Independently generate precise, reliable and reproducible data in a timely manner as part of the development, validation, and transfer of drug product analytical methods, including excipients, in-process and drug product testingIndependently or with coaching, design and conduct critical experiments to further project goals. Analyze and critique generated results noting significant deviations and suggest and design further relevant experiments.Anticipate, recognize and resolve simple and complex technical issues through job knowledge, use of technical resources including technical literature and experts and well formulated, logical experimentation.May serve as analytical representative to cross functional project teams; actively participate in team efforts and contribute to technical evaluations and solutionsAuthor, review and verify validation and transfer protocols and reportsAuthor quality and regulatory test method documentsWrite/co-author memos and scientific reports in support of Regulatory Submissions, Regulatory Field Alerts and support quality control and manufacturing documentsManage aspects of analytical projects. Establish schedules, define dependencies and project plans and direct activities of other scientists and non-scientists as well as provide training and development for othersServe as a liaison between functional groups and external customers for analytical development, transfer, troubleshooting and improvement effortsProactively and cooperatively communicate with peers and management to ensure awareness of progress and issues; recommend solutions when issues ariseCapable of working with significant independenceMaintain and meet the highest standards in quality, customer service and regulatory complianceFollow, understand and comply with AbbVie SOP’s and policies on cGMP’s and safety. Maintain a clean, safe and organized lab area, and potentially assume responsibility to ensure that others maintain their lab areasBasic:BS degree in Science or related degree with 5-10 years of experience preferred. OR MS degree in Science or related degree with 2-8 years of experience preferred. OR Ph.D. / Pharm.D. in Science ore related field; with 1-2 years of experience preferred.Has proficiency in standard office software and analytical testing experience in wet chemistry, gas and liquid chromatography and/or spectrometric test methods. A working knowledge of Empower, Fusion, LIMS, Nugenesis, VMS and QDMS is highly desirable.Is knowledgeable of cGLP requirements and familiar with ICH guidelinesHas strong problem solving and organizational skillsExcellent communication (oral and written) and interpersonal skills; ability to work well with a wide range of functional groups including R&D;, QC, QA, Regulatory Affairs, and Commercial OperationsCan function both independently and as a team playerMust be adaptable and able to operate effectively in a highly dynamic environmentEqual Opportunity Employer Minorities/Women/Veterans/Disabled"}