{"jobID": "2819924933", "jobLocation": "Chicago_IL", "jobTitle": "Technical Lead, Big Data", "companyRating": null, "companyInfo": {"Website": "www.cccis.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1980", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Mitchell International, Solera Holdings"}, "estimatedSalary": null, "jobDescription": " Job Description SummaryCCC is seeking to add a Technical Lead, Big Data to join the enterprise analytics team at CCC. Your leadership will help grow team skills in big data and lead design, guide and optimize big data analytical solutions. These solutions encompass claim systems, IoT, and includes data from all CCC's customers including many of the top US insurance carriers, repair facilities and automotive manufacturers. Solutions provided by the big data analytics team range from auto insurance property and casualty claims; and telematics analytics.  The enterprise analytics team is currently transforming its data engineering technology to big data based technologies, such as Hadoop and Spark, in AWS. In your role, you will be responsible for leading the data engineering team to develop high value and cost-effective data process solutions for CCC's clients. This includes understanding the business value of the data, data quality issues and the processes to transform big data into valuable information for operational, analytical, and strategic decisions. These processes include building the best industry views of data for benchmarking and predictive models in the insurance industry.  The right candidate for the Technical Lead, Big Data role will promote and drive collaboration with CCC Consultants, Product Managers, Information Engineers, Data Scientist Directors, Data Quality leads, Dev and IT Ops, and client business and IT representatives. He or she will offer a strong technical aptitude, collaboration, problem-solving skills, and interest in leveraging new and existing technology to build industry solutions that are compelling to adopt by CCC's clients. You will be working closely with a Data Engineering Manager, Product Owners, Scrum Master, and Director of Analytics in execution of your responsibilities.  Job Duties  Provide technical leadership in enterprise and application solution big data architecture to enable scalable, cost effective and business relevant solutions. This includes leading decisions on architecture, design patterns, technologies used, and automated test-driven development implementations. On analytics application solution architecture, you will be leading approaches and technologies to leverage existing and create new metadata driven code implementations for code re-usability and build speed.  Provide technical mentoring and foster technical team growth. This includes activities from mentoring on design patterns, technologies and data engineering practices. Leading team code reviews and facilitating cross team development standards so big data engineers can easily move across teams is required.  Provide mentorship to make the team self-sufficient on scrum processes such as story estimating and tasking out stories with the most effective technical approach. This includes building various end-to-end data processes: locating needed source data, creating data extraction processes, data profiling, creating tables and files for storing data, defining and building data cleansing and imputation routines, mapping multiple sources to a common format, transforming data using programming and business rule frameworks, and testing of data.  Provide production support management: Coordinate production deployment tasks across the data engineering team and with other analytics teams including code promotion and documentation and assist the team with troubleshooting production processes when errors or failures occur. QualificationsA Bachelor's degree is requiredThe position requires experience as a Senior Engineer, Tech Lead, or another leadership role in a big data environment.Strong experience in big data technologies such as Hive and Spark, and other Hadoop technologies in Hadoop distributions from Hortonworks or other suppliers is preferredDemonstrated capability to learn a new business area in auto insurance such as property and medical claims dataHigh-level performance management, communication and coaching skillsCapability to leverage analytics, data warehousing concepts, and agile processes in implementationsExperience creating testing approaches and how to design a test plan to validate codes or applicationsHands-on skills to evaluate if the code and output from a data engineer's story should be accepted and meets coding and quality standardsExperience building complex data pipelines that integrates many data sources into a single view with common names, complex transformations, and robust data cleansing and quality enhancements processes.Experience building programs in a language such as Perl, Java, Python (preferred), Scala, etc. to automate functions and build custom functions.Preferred QualificationsProficient in scrum methodology with product owners with experience in technical story writing *Auto insurance and/or collision repair industry experience preferredExperience with relational database platforms (Oracle, etc.), ETL tools (Pentaho, Talend, Informatica, etc.), and cloud hosting (AWS) preferredExperience using or providing useful data to dashboard and reporting tools (MicroStrategy, Tableau, etc.) preferred Why Choose CCC  We promote a healthy work-life balance and offer generous benefit plans and resources designed with employee satisfaction in mind.  What we value is simple - customers, employee commitment, collaboration and clear communication.  We hire people who will embrace the company's goals and productively contribute in ways that help us serve the customer, innovate, and stay strong.  We make it a priority to keep employees healthy, happy and enriched. Healthy - Wellness programs and Perkspot/employee discount programHappy - Recognition programs, a confidential employee assistance program, and flexible work arrangements such as staggered start timesEnriched - Tuition reimbursement, training and learning programs, and leadership development opportunities Our corporate headquarters is located in downtown Chicago within the historic Merchandise Mart-a certified LEED (Leadership in Energy and Environmental Design) building.  CCC Information Services was ranked #17 in the Top 100 Digital Companies in Chicago in 2017 by Built In Chicago, an online community for digital technology entrepreneurs in Chicago. CCC is a great place to work. Join us!"}