{"jobID": "2709644103", "jobLocation": "Chantilly_VA", "jobTitle": "Senior Data Scientist", "companyRating": "4.2", "companyInfo": {"Website": "www.ogsystems.com", "Headquarters": "Chantilly, VA", "Size": "201 to 500 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " TASC, Vencore"}, "estimatedSalary": "115000", "jobDescription": " OGSystems - Company OverviewWhy be a government contractor when you can be a government innovator? Come work for an organization that has creativity, innovation, and drive rooted throughout its DNA. We are not like the others.  At OGSystems we don’t just create the best solutions we execute them in collaboration with our customers. Creating the best solutions starts with the best ideas and that requires the best people. We want people willing to out hustle the haters until they ask if we are hiring. Own The Outcome and join our culture of innovation and creativity.Bring It!Senior Data ScientistClearance: Top Secret/SCIYears of Experience: 10+ YearsLocation: Chantilly, VAEducation: MA or MS Degree in Mathematics, Statistics, Computer Science, Electrical Engineering or equivalent fields OGSystems seeks to hire a Data Scientist with strong technical and analytical expertise to explore and examine data from multiple disparate sources to discover patterns and insights. The Data Scientist will use expertise and experience for data wrangling of disparate data sources using ETL methodologies. Expertise in statistics, mathematics, computer science, and software development will be used to design analytical algorithms for data mining, pattern discovery, statistics, mathematics, modelling and machine learning for analytical infrastructure and tools. The Data Scientist will also develop and design analytical processes and workflows, to design and develop advanced analytical reporting systems such as dashboards which meet the objectives of the client. Basic Qualifications:MA or MS Degree in Mathematics, Statistics, Computer Science, Electrical Engineering or equivalent fields with 10+ years of data science or advance analytical experience OR BA or MS Degree in Mathematics, Statistics, Computer Science, Electrical Engineering or equivalent fields with 15+ years of data science or advance analytical experienceExperience conducting data discovery, data analysis, and reporting of large volumes of data sourcesExperience applying latest technologies in dimension reduction, classification, clustering and machine learning to understand underlying patterns in dataExperience with applied statistical modeling such as univariate and multivariate regression analysis, principle component analysis, discriminant analysis, and other parametric and non-parametric analytical techniquesExperienced working with tools such as Tableau, SAS, SPSS or RExperience working with clients to document and develop technical specifications of a desired analytical systemExperience writing technical specifications for data engineers or software developersStrong and proven verbal and writing skillsExperience prototyping languages such as Python or R and a familiarization with scripting languages such as JAVA ScriptTS/SCI Clearance Required with eligibility to obtain Polygraph Own It!Desired Qualifications:PhD in Mathematics, Statistics, Computer Science, Electrical Engineering or equivalent fields with 7+ years of experience in data science or advance analyticsFamiliar with scalable distributed data processing, management and visualization such as Hadoop, ELK, KAFKA, Accumula, Graph databases, etc.Subject matter expertise or experience working with at least one of the INTs within the IC or subject matter expertise or experience working with one or more of the DOD CoCOMs Dream It! Challenging work in support of US Intelligence Community - a Mission that Matters!Access to our State of the art custom facility.Crazy smart and collaborative coworkers.Regular engagement with company leadershipSupport for new ideas & encouragement to take risksMedicalDentalVisionLife InsuranceDisability (Short and Long Term)Accidental Death and Dismemberment (AD&D;)Employee Assistance Program (EAP)Flexible Spending Accounts401(k) with company matchPaid Time OffTuition ReimbursementStock Options *Based on Career Level"}