{"jobID": "2827881017", "jobLocation": "Houston_TX", "jobTitle": "Threat Hunter/Data Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.shell.com", "Headquarters": "The Hague, Netherlands", "Size": "10000+ employees", "Founded": " 1907", "Type": " Company - Public (RDSA) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $10+ billion (USD) per year", "Competitors": " ExxonMobil, BP, Chevron"}, "estimatedSalary": "88000", "jobDescription": " Auto req ID 82609BR Job Title Threat Hunter/Data Analyst - Houston, TX Country of Work Location United States City, State (if applicable) Houston, TX Work Location Houston - EP Center Americas Company Description Shell is a global group of energy and petrochemicals companies with over 90,000 employees in more than 70 countries and territories. In the US, we have operated for over a century and are a major oil and gas producer onshore and in the Gulf of Mexico, a recognized innovator in exploration and production technology, and a leading manufacturer and marketer of fuels, natural gas and petrochemicals. We deliver energy responsibly; operate safely with respect to our neighbours and work to minimize our environmental impact. We are in search of remarkable people who will thrive in a diverse and inclusive work environment to deliver exciting projects locally and globally. People who are passionate about exploring new frontiers. Innovators and pioneers. People with the drive to help shape our future. Because remarkable people achieve remarkable things. Job Description As businesses leverage digitalization opportunities, their cyber-attack surface structurally increases, which can lead to business disruptions, data breaches and brand damage. High profile industry incidents show that these risks are real, and this has turned cyber resilience into a topic for Boards. Purpose Cyber Defense: Cyber attacks can cause damage to reputations, destruction of assets and loss of information. Shell is taking action to detect and respond to the continuous flow of these types of attacks.  As part of the Information Risk Management function, the CyberDefence capability has specific focus on identifying cyber threats, discovery of IT vulnerabilities, monitoring for cyber intrusions and response to security incidents. Purpose Team: As part of the CyberDefence capability the Threat and Analytics team in CyberDefence has two main areas of focus: To ensure we understand the internal and external threat landscape, what threats to focus on and how these can be identified within Shell.To find unknown cyber security threats active within Shell and weaknesses in our security controls by applying data analysis techniques to large, diverse sets of internal and external data.Accountabilities: Threat Intelligence Analyze threat intelligence (e.g. actors, hack tools, exploits, malware, etc) using a wide variety of sources and determine impact to Shell, including detailed technical analysis and verification of the intelligence.Translate intelligence into threat scenario’s / security use cases that can be implemented within available surveillance capabilities. Recommend changes to Splunk policies, filters and rules to improve event detection.Review available surveillance data to further develop and improve the threat scenario’s and use cases. Use your clearance with intelligence agencies to attend classified (\"secret\") briefings and investigate applicability of obtained intelligence to Shell.Ensure completeness of threat information sources used and evaluate whether additional sources must be included for daily analysis.Setup and continuous improvement of threat intelligence processes, protocols, skills and tools. Collaboration Work across multiple organizations, cultures and service providers to pull together actionable information and management information.Coordinate and compile threat intelligence from multiple sources into management information and actionable data and report out to relevant parties.Establish a strong working relationship in/outside of IT and Shell. Generic Assist in discovery of cyber vulnerabilities and investigation of global cyber security incidents where required.Lead improvement projects in the Threat & Analytics team.Purpose Position: Understanding the internal and external threat landscape is paramount for Shell to understand what threats to focus on and how these can be identified within Shell. Our Threat Intelligence Analysts maintain close relationships with intelligence agencies, the O&G; industry and other relevant parties and internet sources to maintain an up-to-date view of the threat landscape. Threats will be analyzed and translated into intelligence that can be applied to our cyber detection capabilities for enhanced monitoring for adversaries relevant to Shell. Furthermore, you will be closely collaborating with other teams in IRM to ensure they have the latest relevant information required for risk decision making and prioritization of mitigating actions. Requirements Must have legal authorization to work in the US on a full-time basis for anyone other than current employer.Bachelor’s Degree.Minimum two (2) years IT security experience with knowledge and experience of advance analysis (e.g. malware analysis, forensic investigations, packet level analysis, indication of compromise, etc)Demonstrated technical understanding of and experience with IT networks, infrastructure and applications.Examples of deliverables include: reports, presentations and reasoned arguments.Develops and maintains knowledge of Cyber security and maintains an awareness of current developments.Proven understanding of attack activities - scans, man in the middle, sniffing, (D)DoS, phishing, and abnormal activities such as worms, Trojans, viruses, privilege escalations, etc.Experience working in a complex global environment with common security device functions and countering a variety of attack vectors.Ability to use various security technologies for topics such as packet analysis, intrusion detection (including signature development), exploitation of vulnerabilities, searches in event data using Splunk, etcProven experience with common operating systems and network device functions.Creative mind-set and proven ability to think as a hacker and to translate this into threat scenario’s and use cases (evidence based analytical ability and attention to detail).Broad experience in technical IT security topics and hold certifications like: Offensive Security Certified Professional (OSCP), GIAC Certified Forensic Analyst (GCFA), GIAC Certified Reverse Engineering Malware (GREM), GIAC Certified Forensic Examiner (GCFE), GIAC Certified Intrusion Analyst (GCIA), CISSP; Broad understanding of all stages of Information Risk Management. No. of Positions 1 Disclaimer Please note: We occasionally amend or withdraw Shell jobs and reserve the right to do so at any time, including prior to the advertised closing date.  Before applying, you are advised to read our data protection policy. This policy describes the processing that may be associated with your personal data and informs you that your personal data may be transferred to Royal Dutch/Shell Group companies around the world.  The Shell Group and its approved recruitment consultants will never ask you for a fee to process or consider your application for a career with Shell. Anyone who demands such a fee is not an authorised Shell representative and you are strongly advised to refuse any such demand.  Shell participates in E-Verify.  All qualified applicants will receive consideration for employment without regard to race, color, sex, national origin, age, religion, disability, sexual orientation, gender identity, protected veteran status, citizenship, genetic information or other protected status under federal, state or local laws.  Shell is an Equal Opportunity Employer - Minorities/Females/Veterans/Disability. Removal Date 26-Jul-2018"}