{"jobID": "2802935156", "jobLocation": "Chicago_IL", "jobTitle": "Manager of Data Science", "companyRating": null, "companyInfo": {"Website": "www.cmegroup.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 2007", "Type": " Company - Public (CME) ", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Intercontinental Exchange, Nasdaq"}, "estimatedSalary": null, "jobDescription": "DescriptionCME Group: Where Futures Are Made  CME Group (www.cmegroup.com) is the world's leading and most diverse derivatives marketplace. But who we are goes deeper than that. Here, you can impact markets worldwide. Transform industries. And build a career shaping tomorrow. We invest in your success and you own it, all while working alongside a team of leading experts who inspire you in ways big and small. Joining our company gives you the opportunity to make a difference in global financial markets every day, whether you work on our industry-leading technology and risk management services, our benchmark products or in a corporate services area that helps us serve our customers better. With 2,500 employees located around the world, we're small enough for you and your contributions to be known. But big enough for your ideas to make an impact. The pace is dynamic, the work is unlike any other firm in the business, and the possibilities are endless. Problem solvers, difference makers, trailblazers. Those are our people. And we're looking for more.The Team: The Strategic Intelligence & Analytics team’s mission is to provide analytical reports and analysis relating to the economic markets, clients, and products in which CME Group operates. As such, the team is responsible for data science, generating insight, developing tools, expertise in data and report automation, and economic thought leadership. The team creates competitive advantage through data analysis to drive better and faster decision making by the firm’s senior leaders. The team brings diverse skill sets together, combining intellect, market expertise, statistical and technical skills, and ingenuity. The team is one of the key thought leadership groups at the Exchange and serves the broader units to identify and promote significant market and client opportunities. Job Description: Contribute to SIA team’s analytical agenda. Work across product, client, and IT divisions to help drive that agenda with business units. Perform sophisticated, large scale analysis on markets, clients, and ecosystems and discuss client-facing analysis with clients. Brainstorm, design, gain approval, and implement internal and external tools and applications. Expand usage of Data Science tools with staff and clients. Responsibilities: Drive identification and analysis of opportunities, risks, and trends. Contribute to the thought leadership interactions with business units and clients as it relates to client & market analytics. Assist and contribute to the evolving enterprise-level data roadmap. Analytical Responsibilities: Manage and direct large, multi-faceted projects that deliver valuable analytical insight or new capabilities Combine analytical skills with team-defined scope to deliver desired analytical results. Work directly with Sales, Marketing, and Product teams to proliferate understanding, incorporate feedback, and refine analytical agenda. Perform highly quantitative analysis on clients and product market structures to identify and understand opportunities, risks, and trends. Perform Big Data analytics on large CME Group databases to better understand CME Group market ecosystems and Globex infrastructure Collaborate with Sales, Marketing, and Product teams to brainstorm new ideas from inception to fruition. Make presentations to Sales, Marketing, and Product teams on analysis performed. Collaborate with Chief Economist to continually enhance econometric models. Participate in client discussions and communicate analysis performed to inform clients and further their understanding of CME Group markets Utilize technical skills to deliver systematic, automated, or statistically significant information with little initial human monitoring or intervention. Develop sophisticated market analysis, client analysis, forecasts, and automated alerts for business leaders and divisions. Provide ideas for new alerts, determine the best methodology for delivery, and participate in discussions to implement. Broadly utilize database systems and technical skills to perform analytics faster and more efficiently Identify opportunities to access additional data, continuously scaling data repositories & capabilities Stay current with leading edge systems, methods, and best practices for data science analytics and data infrastructure Education & Experience:BS/BA in Business, Engineering, Mathematics, Computer Science or equivalent experience utilizing a different BS/BA degreeMS in Applied Statistics, Statistics, Computer Science, or advanced Math or Engineering strongly preferredCombination of business and technical/quantitative experience1+ year of experience interacting with data in Apache Hadoop or Cloud Services preferred (e.g. AWS, Google Cloud, or Microsoft Azure)7+ years of business, statistical, or technical experienceExperience analyzing unstructured data and text preferredFamiliarity to functional programming using Scala and PythonJob Qualifications:Strong skills and experience using statistics and machine learning.Strong programming skills in R, Python (Numpy, SciPy, Pandas, and scikit-learn) and any one of the major object-oriented programming language (Java, Scala, C++, C#)Expertise using the latest packages and implementation modelsStrong SQL scripting skillsExperience with Hadoop and associated big data technologies (Spark, Hive, etc)Experience with full lifecycle data science projectsExpertise with data analytics, modeling, and visualizationKnowledge of capital markets, derivative products, and trading technologiesStrong communication and organizational skillsAbility to translate and relate IT terminology to business needs and vice versaNot be afraid of hard work and doing things smarter. Take initiative and provide leadership"}