{"jobID": "2759519522", "jobLocation": "Austin_TX", "jobTitle": "Data Mining Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "127000", "jobDescription": "Data Mining Scientist Job Number: 113714729Austin, Texas, United StatesPosted: Jun. 21, 2018Weekly Hours: 40.00 Job SummaryThe Apple Analytic Insight team is looking for an extraordinary data scientist who is passionate about designing, developing, and fielding data mining solutions that have direct and measurable impact to Apple. You will work with various business leaders and executives to help identify viable data mining opportunities and then implement end to end analytical solutions. You should have both a broad knowledge of existing data mining algorithms and creativity to invent and customize when necessary.Key Qualifications Strong knowledge of data science algorithms including decision trees, probability networks, association rules, clustering, regression, and neural networks.Familiarity with database modeling and data warehousing principles with a working knowledge of SQL.Creativity to go beyond current tools to deliver the best solution to a problemStrong programming skills in Python, Java, C++, or similar languageExcellent presentation, communication and social skills, with solid attention to detail.Ability to work independently and make key decisions on projectsResearches, and if applicable, implements new technologies and methods in the areas of data analysis, data modeling, data glossaries and libraries. DescriptionApple has a tremendous amount of data, and we have just scratched the surface in pattern detection, anomaly detection, predictive modeling, and optimization. There are many exciting problems to be discovered and solved and many business owners eager to use data mining.  The Apple Analytic Insight team supports scientists to stay abreast of data science research by attending conferences and working with academic faculty and students. We cultivate a collaborative work environment, but allow solution autonomy on projects. RESPONSIBILITIES:Conceive and design end to end data science solutions to support Apple's business units and initiatives.Work with business owners to map business requirements into technical solutions.Develop and implement data science solutions to fit business problem, which may include applying algorithms from a standard tool or custom algorithm development.Work closely with data warehouse architects and software developers to generate precise business intelligence solutions for end users.Support production analytic solutions.Perform ad hoc statistical and data science analyses.Present results of analyses to business units.Takes the initiative to develop and automate regular and ad-hoc reportsEducation- Either:  Ph.D. in Data Science, Machine Learning, Statistics, Operations Research or related field  M.S. in related field with 5+ years experience applying data science techniques to real business problems.  Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}