{"jobID": "2830933268", "jobLocation": "San_Jose_CA", "jobTitle": "Staff Data Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.ebayinc.com", "Headquarters": "San Jose, CA", "Size": "10000+ employees", "Founded": " 1995", "Type": " Company - Public (EBAY) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Apple"}, "estimatedSalary": "182000", "jobDescription": " We are looking to hire an analytics & insights leader to partner with the Core Product Experience team. As a critical member of the Product Insights team, this leader will have the unique opportunity to influence decision making on the Core Product experience roadmap with their insights and thought leadership.  With a vision to identify opportunities to drive transformative change in the customer experience and result in significant business growth, we mine the largest datasets in the world of e-Commerce and use best in class analytic and big data techniques to extract impactful insights. We achieve this by partnering closely with the product and engineering teams, and identify opportunities that are accretive to the product roadmaps.  To be successful in this role: You would have to strike a balance between strategic thinking and actual hands-on analyses using tools & packages such as SQL, R, Python, Tableau etc.You possess super strong technical skills to turn big data in Teradata and Hadoop into actionable insights. At the same time, you also have the ability to think about the big picture and connect the dots to evaluate how the insights impact eBays ecosystem.In addition to delivering insights on existing Product & Tech initiatives, you will come up with innovative product growth opportunities based on insights, and create momentum through influence.Proactive collaboration and effective communication are critical Additionally, the following background and experience is preferred: Proven track record of turning insights into product growth opportunities in prior roles with increasing scope and responsibilitiesAbility to present complex analyses and insights effectively in simple termsGood experience with both descriptive and inferential statistics ability to build basic prototype modelsExperience in a leading tech company with 7 to 10 years of experienceBackground in ecommerce product experienceStrong quantitative background with Bachelors degree in Computer Science, Math, Economics, Physics, Engineering. Masters degreesExperience with site experimentation (A/B testing) is a plus This website uses cookies to enhance your experience. By continuing to browse the site, you agree to our use of cookies  View our privacy policy  View our accessibility info eBay Inc. is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at talent@ebay.com. We will make every effort to respond to your request for disability assistance as soon as possible.  For more information see:  EEO is the Law Poster  EEO is the Law Poster Supplement"}