{"jobID": "2834491989", "jobLocation": "Roanoke_TX", "jobTitle": "CIO - Network Systems Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.experis.com", "Headquarters": "Milwaukee, WI", "Size": "5001 to 10000 employees", "Founded": " 1953", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Robert Half, Adecco, Robert Walters"}, "estimatedSalary": null, "jobDescription": "Seeking: Network Systems Data ScientistDuration: 12 month contract up to 2.5 yearsLocation: Roanoke, TXDescription: Develop, install, maintain, and modify advanced scientific and/or engineering application programs, business application programs, or integrated programs. Identify and analyze user requirements and recommend appropriate applications or modifications. MUST HAVE SKILLS:Python, SQL, Machine Learning, RStudio/SAS, SPARK, HIVE, InformaticaJOB DUTIES: Build Network systems Data Models utilizing BIG data HADOOP Echo systems- all tools, Tableau and SPLUNK. Data Analytics Work and Data Preparation:Activity to be performed with Strict Security guidelines.Data preparation. Exploratory analysis.Features engineering and dimensionality reduction.Supervised and unsupervised modeling.Apply Data Science Statistical algorithmsPerformance Data Modeling and Data Analyzing: Following activity to be performed Analyzing large volume of dataOrganize Models by root cause category, app, sub-team,Predict the accuracy for root cause.3 Used Cases and Models for each of them.Productionize Model (3 Models as Defined by Used Cases): Following activity to be performed Activity such as scoring, exporting and monitoring model in production.Developing and implementing data collection systems and other strategies that optimize statistical efficiency and data qualityFiltering and cleaning data and review computer reports, printouts, and performance indicators to locate and correct code problemsDeveloping, prototype and test predictive algorithmsIdentifying, analyzing, and interpreting trends or patterns in complex data setsAcquiring, cleaning and structuring data from multiple sources and maintain databases/data systems. Experis is an Equal Opportunity Employer (EOE/AA)"}