{"jobID": "2732883123", "jobLocation": "Cranbury_NJ", "jobTitle": "Clinical Scientist, Clinical Research", "companyRating": "3.6", "companyInfo": {"Website": "www.amicusrx.com", "Headquarters": "Cranbury, NJ", "Size": "51 to 200 employees", "Founded": " 2005", "Type": " Company - Public (FOLD) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Shire, Actelion Group"}, "estimatedSalary": "91000", "jobDescription": " Clinical Scientist, Clinical Research  Position SummaryThe Clinical Scientist, Clinical Research will assist the Clinical Research physicians in the development of protocols, gathering of data, and interpretation of clinical trial results. The Clinical Scientist will assist in preparing responses to questions from external sources, including regulators and other stakeholders, in collaboration with various departments in the Development Organization, under the oversight of the Clinical Research physicians. This person will have the drive to learn about rare diseases and working a fast paced and collaborative organization.Roles and Responsibilities Build and maintain a good knowledge of the existing data for our products, competitor products, and the literature about the disease.Support Clinical Research physicians in the development of essential documents such as protocols and protocol amendments, conduct literature reviews, and assist in data evaluation and interpretation. Developing slides for team presentations.Using this knowledge, gather the elements necessary to elaborate a response to questions received from customers (regulatory authorities, payors, prescribing physicians). Discuss with management these elements for next steps in drafting responses. Provide further elements and integrate to provide a final draft to management for approval and to Medical Writing.This role maintains expertise and understanding of documentation needed for data collection and analysis, regulatory requirements, policies and process. This person may act as a liaison between company and other external vendors and may thus be required to develop credible relationships with key stakeholders.In collaboration with biostatistics, participate in the ongoing data reviews, e.g.- blinded reviews and later data outputs. Recommend additional analyses.Perform any other assigned task as requested by managementPartners in a manner consistent with Amicus’ beliefsMaintains highest level of medical science and clinical development expertise in Amicus’ fields of interestPerform all responsibilities in compliance with company SOPs. Requirements Life sciences Master level degree is required, PhD preferred.A combination of credentials and personal attributes including scientific training, reputation, and integrity are necessary for success in this role. Specifically, Amicus is seeking: Relevant industry experience: minimum of 2+ years Experience and Skills Experience on teams with in clinical development products .Excellent oral and written communication skills.Strong interpersonal skills, a collaborator/ team player, open minded to the diverse opinions of others.Hands-on performer, ensuring strong execution of clinical trials and other drug development activities.Flexibility and adaptability, able to thrive in small biotechnology company environment.A superior work ethic and a strong personal desire for success. He or she must also possess a strong sense of personal and professional ethics.A good balance of confidence and humility.Must be passionate about developing treatments for rare/orphan diseases Travel 10% of working time, domestic"}