{"jobID": "2821825027", "jobLocation": "Branchburg_NJ", "jobTitle": "Scientist III, Quality Control", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Description: The Scientist III - Quality Control is responsible to perform testing of raw materials, in-process and finished pharmaceutical dosage forms, products on stability, cleaning verification samples following written procedures and applicable SOPs, calculate and report results on applicable specification documents, participate in method transfer activities within departments or between facilities or organizations. This role will also provide feedback on systems and analytical procedures to promote continuous improvement and enhancement of compliance posture. Essential Functions:Perform physical and chemical analysis of raw materials, in-process, and finished pharmaceutical products, including products on stability, according to written methods, material specification, and company policies as identified in standard operating procedures (SOPs). Comply with cGMPs, SOPs, and STPs to avoid out-of-specification situation. Assure compliance with state and federal regulations.Actively participate in any project work as and when assigned. Perform process validation and cleaning validation/verification testing on various drugs. Assist other scientists with analytical, instrument and software related problems as required.Use sonic sifter, laser diffraction, Karl Fischer, UV-Vis spectrophotometer, Infra-red spectrophotometer, HPLC with UV detection as well as with conductivity detection, TLC, pH meter, and dissolution. Calibrate HPLC, Dissolution apparatus equipped with auto-sampler and /or in-line UV, pH meters, analytical balances, and Karl-Fischer titrator.Document steps followed during analysis execution, calculate and report results. Actively participate in investigation of laboratory results.Review laboratory analysis data for completeness, specification compliance, and compliance with companys written policies.Report any abnormal findings to the Supervisor. As assigned, perform in-depth review of analytical records/reports to assure that calculations and other data are technically correct and compliant to relevant specifications.Additional Responsibilities:Assist the laboratory supervisor with handling non-routine special projects requiring activities such as out-of-specification investigations and out-of-alert limit investigations in the laboratory.Ensure that expired chemicals and reference standards are removed from laboratory area.Perfrom calibration of HPLC, GC, and other equipment as assigned by the supervisor.Assist with hands-on training of newly hired Technicians or Scientists 1 and 2 levels."}