{"jobID": "2807705151", "jobLocation": "San_Jose_CA", "jobTitle": "HR Generalist/People Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.cadence.com", "Headquarters": "San Jose, CA", "Size": "5001 to 10000 employees", "Founded": " 1988", "Type": " Company - Public (CDNS) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Mentor Graphics, Synopsys"}, "estimatedSalary": "89000", "jobDescription": " At Cadence, we hire and develop leaders and innovators who want to make an impact on the world of technology.  The HR Generalist/People Data Analyst provides timely and high quality HR and data analytics support to R & D business units. You must be an Excel power-user, able to will use data, research, and analytical insights to build new -- and improve existing -- Career Development, Learning, and Talent Management Programs. You will work with internal clients to design and execute talent related experiments, launch and analyze surveys to help us improve People Operations processes and solve HR related challenges creatively. You will help employees, and managers learn how to fully utilize our HR systems, educate them on our HR processes, programs and policies, and connect them with the appropriate expertise, as needed. You will also reinforce the self-service functionality of our employee facing systems within the business groups. You will act as the liaison between the business groups and corporate HR to support HR programs and to provide feedback, and represent the customer perspective to help us continue to improve our systems, processes and programs to better serve our employees. Responsibilities:Play a pivotal role in designing, executing and measuring the effectiveness of global talent programs, which will include identifying issues, forming hypotheses and synthesizing conclusions into recommendations.Develop and analyze surveys and metrics.Conduct data analyses, such as regressions, factor analyses, t-tests etc.Communicate findings and recommendations on critical initiatives and influence leaders to take action on those findings.This role ensures HR processes and programs are executed and supported in their business group.Develop and maintain SharePoint site to support BU specific data consumption needs.Quarterly Dashboard and Presentation.Performance Management, Focal Merit/Equity Reporting and Presentation.Pro-actively execute on our global focal processes by providing the business with key stats, findings and making recommendations.Data Entry/Data Management for specific business group(s).Conduct data analyses prior to key compensation programs and report findings to their business partners to assist management with key decisions.Continually audit key data points for the business group and make corrections where necessary.Top Talent Data management.Partner with HRBPs, HRIM/IT as appropriate to enhance websites, tools, systems, processes based on feedback and assessment from business units.Educate managers and employees as necessary on systems, tools, websites, reporting, & processes.Create and conduct training for managers and employees as necessary on new or existing systems, tools, & processes.Requirements: It is critical that the HR Generalist is detail oriented, conscientious (always follows through on commitments), analytical and curious.  The HR Generalist should constantly look for creative ways to increase efficiencies and allow the Business Partners to be a true strategic partner to business leaders. Expert-level Excel reporting skills are an absolute must (pivot tables, V-look ups, formulas, etc.).Strong understanding of core HR conceptsBA/BS degree preferred with a strong academic record.Excellent problem-solving capabilities and superior analytical skills.Deep interest and aptitude in data, metrics, analysis and trends.Proven ability to multi-task and manage multiple projects.Excellent communication skills2-5 years of HR Generalist experience in a very fast-paced environmentStrong HR systems reporting experience; Workday preferred Were doing work that matters. Help us solve what others cant."}