{"jobID": "2837691473", "jobLocation": "New_Brunswick_NJ", "jobTitle": "Manager of Data Engineering, Data Sciences Analytics", "companyRating": null, "companyInfo": {"Website": "www.leejohnson.com", "Headquarters": "Kirkland, WA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " For Johnson & Johnson Manager of Data Engineering, Data Sciences & Analytics job - Info Technology - Multiple Skip to Main Content Our Stories - Latest News - Innovation - Caring & Giving - Personal Stories - Health & Wellness - Our Heritage Our Company - About J & J - Our Credo - Our Leadership Team - Corporate Governance - Diversity & Inclusion - Empowering Women - Innovation at J & J - Office of the Chief Medical Officer - J & J Health and Wellness Solutions - Policies & Statements - Code of Business Conduct - Corporate Reports - Products - Consumer Products - Medical Devices - Pharmaceutical Products - Procurement - Value Pillars - Supplier Diversity - Supplier Standards - Careers - What We Do - How We Hire - Job Spotlight - Employee Benefits - Students - Innovation - Career Stories - Media Center - Investors - Corporate Governance - Quarterly Results - SEC Filings - News Releases - Pharmaceutical Pipeline - 2017 Health for Humanity Report - Stock Information - Webcasts & Presentations - Actelion Public Tender Offer - Our Societal Impact - Global Community Impact - Global Public Health - Global Environmental Health - Citizenship & Sustainability Reporting Follow Us - Facebook - LinkedIn - Twitter - YouTube Explore Careers Explore Careers - Function - Careers for Physicians - Learn More - View Jobs - Communication - Learn More - View Jobs - Compliance and Privacy - Learn More - View Jobs - Design - Learn More - View Jobs - Engineering - Learn More - View Jobs - Facilities - Learn More - View Jobs - Finance - Learn More - View Jobs - General Administration - Learn More - View Jobs - General Management - Learn More - View Jobs - Global Services - Learn More - View Jobs - HEMAR - Learn More - View Jobs - Human Resources - Learn More - View Jobs - Information Technology - Learn More - View Jobs - Legal - Learn More - View Jobs - Marketing - Learn More - View Jobs - Operations - Learn More - View Jobs - Public Affairs - Learn More - View Jobs - Quality Assurance - Learn More - View Jobs - Regulatory Affairs - Learn More - View Jobs - Research & Development - Learn More - View Jobs - Sales - Learn More - View Jobs - Strategic Planning - Learn More - View Jobs - Business - Consumer - Learn More - View Jobs - Medical Devices - Learn More - View Jobs - Pharmaceuticals - Learn More - View Jobs - Location - Argentina - Learn More - View Jobs - Australia - Learn More - View Jobs - Austria - Learn More - View Jobs - Belgium - Learn More - View Jobs - Bosnia and Herzegovina - Learn More - View Jobs - Brazil - Learn More - View Jobs - Bulgaria - Learn More - View Jobs - Canada - Learn More - View Jobs - Central Eastern Europe - Learn More - View Jobs - Chile - Learn More - View Jobs - China - Learn More - View Jobs - Colombia - Learn More - View Jobs - Costa Rica - Learn More - View Jobs - Croatia - Learn More - View Jobs - Czech Republic - Learn More - View Jobs - Dominican Republic - Learn More - View Jobs - Ecuador - Learn More - View Jobs - Egypt - Learn More - View Jobs - Estonia - Learn More - View Jobs - France - Learn More - View Jobs - Germany - Learn More - View Jobs - Guatemala - Learn More - View Jobs - Hong Kong - Learn More - View Jobs - Hungary - Learn More - View Jobs - India - Learn More - View Jobs - Indonesia - Learn More - View Jobs - Ireland - Learn More - View Jobs - Italy - Learn More - View Jobs - Japan - Learn More - View Jobs - Korea - Learn More - View Jobs - Latvia - Learn More - View Jobs - Lebanon - Learn More - View Jobs - Lithuania - Learn More - View Jobs - Malaysia - Learn More - View Jobs - Mexico - Learn More - View Jobs - Middle Eastern Countries - Learn More - View Jobs - Netherlands - Learn More - View Jobs - New Zealand - Learn More - View Jobs - Panama - Learn More - View Jobs - Paraguay - Learn More - View Jobs - Peru - Learn More - View Jobs - Philippines - Learn More - View Jobs - Poland - Learn More - View Jobs - Portugal - Learn More - View Jobs - Romania - Learn More - View Jobs - Serbia - Learn More - View Jobs - Singapore - Learn More - View Jobs - Slovakia - Learn More - View Jobs - Slovenia - Learn More - View Jobs - Spain - Learn More - View Jobs - Switzerland - Learn More - View Jobs - Taiwan - Learn More - View Jobs - Thailand - Learn More - View Jobs - Turkey - Learn More - View Jobs - United Arab Emirates - Learn More - View Jobs - United Kingdom - Learn More - View Jobs - United States - Learn More - View Jobs - Uruguay - Learn More - View Jobs - Venezuela - Learn More - View Jobs - Vietnam - Learn More - View Jobs - Students - Bachelor's - Learn More - View Jobs - Master's/MBA/PhD - Learn More - View Jobs Language Language - English - - Nederlands - Franais - Italiano - Espaol - Portugus - Trke - - Deutsch Quick Links - Privacy Policy - Candidate Charter - Employment Policies - Cookie Policy - Legal Notice - E-Verify - Contact Us More From Johnson & Johnson - Janssen Pharmaceutical Companies of Johnson & Johnson - Johnson & Johnson Innovation Advancing New Healthcare Solutions Through Collaboration - Johnson & Johnson Medical Devices Companies Reimagining the Way Healthcare Is Delivered - Our Consumer Safety and Care Commitment Your Safety Is Our Priority - Johnson & Johnson Our Story Learn About the Company's Rich Heritage at Our Digital Museum Follow Us - - - - Johnson & Johnson is an Affirmative Action and Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, age, national origin, or protected veteran status and will not be discriminated against on the basis of disability. Equal Employment Opportunity Posters If you are an individual with a disability and would like to request a reasonable accommodation as part of the employment selection process, please complete the form below. If you'd like to view a copy of the company's affirmative action plan, please complete this form. This site is governed solely by applicable U.S. laws and governmental regulations. Please see our Privacy Policy. Use of this site constitutes your consent to application of such laws and regulations and to our Privacy Policy. Your use of the information on this site is subject to the terms of our Legal Notice. You should view the News section and the most recent SEC Filings in the Investor section in order to receive the most current information made available by Johnson & Johnson Services, Inc. Contact Us with any questions or search this site for more information. All contents Copyright Johnson & Johnson Services, Inc.1997-2018. All Rights Reserved. Explore more Johnson & Johnson sites: Austrailia Argentina Brazil Canada Chile China Colombia Costa Rica Ecuador Germany India Italy Japan Mexico New Zealand / Pacific Paraguay Peru Philippines Russia Switzerland German English French Italian Uruguay United States Venezuela Sign In Johnson & Johnson Careers Get future jobs matching this search Get Job Alerts Please enter a valid email. JOBS.ALERT.CAPTCHA_ERROR Unfortunately, our network is not responding. Please try again later. Your job alert was successfully created. Job Manager of Data Engineering, Data Sciences & Analytics Multiple Locations: New Brunswick, New Jersey Functions: Info Technology Start a new job search Get Referred Job Description Requisition ID: 00001D5T Johnson & Johnson is recruiting for a Manager of Data Engineering, Enterprise Data Data Sciences & Analytics to join our Johnson & Johnson Enterprise Data Science team and help us bring innovation to life and help advance the health and well-being of people around the world, through ideas, products and services. The primary location for this position is New Brunswick, NJ and may require up to 50% domestic and international travel. Consideration will be given to other areas in New Jersey, Pennsylvania, California, and Jacksonville, FL and may require domestic and international travel of up to 60%. Caring for the world, one person at a time has inspired and united the people of Johnson & Johnson for over 125 years. We embrace research and science -- bringing innovative ideas, products and services to advance the health and well-being of people. Employees of the Johnson & Johnson Family of Companies work with partners in health care to touch the lives of over a billion people every day, throughout the world. With $76.5 billion in 2017 sales, Johnson & Johnson is the world's most comprehensive and broadly based manufacturer of health care products, as well as a provider of related services, for the consumer, pharmaceutical, and medical devices and diagnostics markets. There are more than 265 Johnson & Johnson operating companies employing approximately 126,500 people and with products touching the lives of over a billion people every day, throughout the world. If you have the talent and desire to touch the world, Johnson & Johnson has the career opportunities to help make it happen. Thriving on a diverse company culture, celebrating the uniqueness of our employees and committed to inclusion, J & J is proud to be an equal opportunity employer. We are one of only two industrial companies to hold a AAA Credit Rating. With our forward-thinking business practices, commitment to diversity and inclusion, smart management and social responsibilityas noted by our tenure in Fortune World's Most Admired company list for the 16th year in a row, and appearing in the top 20we are well positioned to transform Technology & Analytics to help innovate faster and compete more effectively, making science and technology equal partners in building the future of Johnson & Johnson. The Manager of Data Engineering is an important, integral part of the transformation within J & J Enterprise Data Analytics team. This role will be responsible for expanding and optimizing our data collection, flow and pipeline in support of major data science initiatives. The ideal candidate is an experienced data wrangler who enjoys optimizing data systems and building them from the ground up. The Data Engineer will support Data Scientists on POCs and use case algorithm construction and optimization. The Data Engineer will also support industrialization of analytics solutions and the data strategies required to deliver them as a business process (vs. a one time use case). The candidate must be self-directed and comfortable supporting the data needs of multiple projects in different phases of development (POC vs. industrialization), and proactively optimize or even re-design our data science data architecture and infrastructure. The right candidate will be excited by the prospect of working as a Data Engineer, with the potential to take on increasing Data Science responsibilities and projects over time. Key Responsibilities - Create, optimize and maintain optimal data collection, flow and pipeline for data science POCs and industrialized solutions - Assemble, cleanse, integrate and transform large, complex data sets into model ready data - Identify, design, and implement internal process improvements, including automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability, etc. - Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sources using SQL and AWS 'big data' technologies. - Build data cleansing, management and visualization tools that provide actionable insights into data features that might be relevant for POCs and industrialized solutions - Create data tools for Data Science and other analytics team members that assist them in building and optimizing POCs and industrialized solutions - Work with stakeholders including Data Scientists, Data Architects, commercial and other stakeholders to assist with data-related technical issues and support their data infrastructure needs. - Keep data separated and secure across national boundaries through multiple data centers and cloud based instances. - Work with data and analytics experts to strive for greater functionality in our data systems. Johnson & Johnson is recruiting for a Manager of Data Engineering, Enterprise Data Data Sciences & Analytics to join our Johnson & Johnson Enterprise Data Science team and help us bring innovation to life and help advance the health and well-being of people around the world, through ideas, products and services. The primary location for this position is New Brunswick, NJ and may require up to 50% domestic and international travel. Consideration will be given to other areas in New Jersey, Pennsylvania, California, and Jacksonville, FL and may require domestic and international travel of up to 60%. Caring for the world, one person at a time has inspired and united the people of Johnson & Johnson for over 125 years. We embrace research and science -- bringing innovative ideas, products and services to advance the health and well-being of people. Employees of the Johnson & Johnson Family of Companies work with partners in health care to touch the lives of over a billion people every day, throughout the world. With $76.5 billion in 2017 sales, Johnson & Johnson is the world's most comprehensive and broadly based manufacturer of health care products, as well as a provider of related services, for the consumer, pharmaceutical, and medical devices and diagnostics markets. There are more than 265 Johnson & Johnson operating companies employing approximately 126,500 people and with products touching the lives of over a billion people every day, throughout the world. If you have the talent and desire to touch the world, Johnson & Johnson has the career opportunities to help make it happen. Thriving on a diverse company culture, celebrating the uniqueness of our employees and committed to inclusion, J & J is proud to be an equal opportunity employer. We are one of only two industrial companies to hold a AAA Credit Rating. With our forward-thinking business practices, commitment to diversity and inclusion, smart management and social responsibilityas noted by our tenure in Fortune World's Most Admired company list for the 16th year in a row, and appearing in the top 20we are well positioned to transform Technology & Analytics to help innovate faster and compete more effectively, making science and technology equal partners in building the future of Johnson & Johnson. The Manager of Data Engineering is an important, integral part of the transformation within J & J Enterprise Data Analytics team. This role will be responsible for expanding and optimizing our data collection, flow and pipeline in support of major data science initiatives. The ideal candidate is an experienced data wrangler who enjoys optimizing data systems and building them from the ground up. The Data Engineer will support Data Scientists on POCs and use case algorithm construction and optimization. The Data Engineer will also support industrialization of analytics solutions and the data strategies required to deliver them as a business process (vs. a one time use case). The candidate must be self-directed and comfortable supporting the data needs of multiple projects in different phases of development (POC vs. industrialization), and proactively optimize or even re-design our data science data architecture and infrastructure. The right candidate will be excited by the prospect of working as a Data Engineer, with the potential to take on increasing Data Science responsibilities and projects over time. Key Responsibilities - Create, optimize and maintain optimal data collection, flow and pipeline for data science POCs and industrialized solutions - Assemble, cleanse, integrate and transform large, complex data sets into model ready data - Identify, design, and implement internal process improvements, including automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability, etc. - Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sources using SQL and AWS 'big data' technologies. - Build data cleansing, management and visualization tools that provide actionable insights into data features t"}