{"jobID": "2827012061", "jobLocation": "Jersey_City_NJ", "jobTitle": "Clinical Scientist", "companyRating": null, "companyInfo": {"Website": "www.moleculartemplates.com", "Headquarters": "Austin, TX", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Company Description: Molecular Templates (MTEM) is a clinical stage biopharmaceutical company focused on the development of a next generation immunotoxin platform technology called Engineered Toxin Bodies (ETB) in oncology. MTEM's lead program, MT-3724, is in clinical development for non-Hodgkin's lymphoma and additional pipeline drug candidates are being advanced toward clinical development for a variety of cancers. For more information, please visit MTEM's website at www.mtem.com. Position Overview: Molecular Templates is seeking an experienced and highly-motivated professional to be an integral part of the Company's clinical development team. The Clinical Scientist will work with members of the cross-functional team to support the activities associated with one or more clinical studies during translational and early clinical development of anti-cancer agents. The position will contribute to design of study protocols, informed consents, study reports and other clinical and regulatory documents. Also, this position will provide scientific input to database development, design of data collection tools, data review and querying, study site assessment and initiation. Qualified candidates must possess comprehensive knowledge of clinical trial design and conduct in accordance with ICH/GCP and other related regulations or guidelines, particularly in the therapeutic area of oncology. This requires a good understanding of clinical and medical information related to oncology, as well as excellent organizational, project management data review and time management skills. Job Responsibilities:Contribute to protocols, clinical study reports, IBs, ICFs, training documents, and other clinical and regulatory documents.Collaborate with Clinical Operations to review CRO scope of work, study budget and plans or manuals related to study data, IVRS, central labs etc.Interact with internal and external stakeholders (Molecular Templates Development Team functions, study sites, vendors, committees, etc.) in support of clinical trial objectives.Together with Clinical Operations and Medical Monitor, collaborate on design, implementation and conduct of clinical studies in cancer patientsReview clinical data to analyze, identify and report trends, confirm the data integrity and prepare interim and final reports of clinical trial data for documents such as CSR, IB, DSUR.Contribute to the protocol feasibility assessments, site identification, and vendor evaluation.Present data/information to external investigators or study staff (e.g., SIV presentations)Review of literature to support scientific and medical data analysis and development planningQualifications:PhD in Life Sciences or PharmD, required.Minimum of 3-5 years of experience in clinical development, preferably in oncology.Comprehensive practical knowledge of the development of study protocols and conduct and reporting of clinical studies in accordance with ICH/GCP and other related regulations or guidelines.Possess awareness of global regulatory and pharmacovigilance environments.Experience of successful work in cross-functional project or study team matrix.Experience in coordinating collaboration with and training of investigative centers, clinical staff and CROs is required.Excellent data analysis skills.Excellent written and verbal communication skills in English are required.Excellent organizational, project management and time management skills.Proficiency with all office suite tools (MS Word, Excel, PPT, Project).Ability to apply attention to detail.Ability to function independently and exercise good judgement.Ability to work in a fast-paced, high-growth environment.Minimal travel required.Reporting Structure: This position has no supervisory responsibilities. This position will report to the Sr. Director, Clinical Development. Molecular Templates, Inc. is an Equal Opportunity Employer and offers competitive salaries and benefits.0"}