{"jobID": "2831153917", "jobLocation": "Ann_Arbor_MI", "jobTitle": "Advanced Analytics Data Engineer", "companyRating": "3.8", "companyInfo": {"Website": "www.xpo.com", "Headquarters": "Greenwich, CT", "Size": "10000+ employees", "Founded": " 2011", "Type": " Company - Public (XPO) ", "Industry": " Transportation & Logistics", "Revenue": " $10+ billion (USD) per year", "Competitors": " DHL Supply Chain, UPS, FedEx"}, "estimatedSalary": "81000", "jobDescription": "Logistics done differently. At XPO Logistics, we’re constantly looking for talented individuals at all levels, who can deliver the caliber of service our company requires. As the Advanced Analytics Data Engineer, you will work with the Advanced Analytics team to build/maintain proof of concept (POC) environments for mathematical and machine learning models to run complex solutions. This role is critical in positioning XPO for long-term success. Pay, benefits and more. We are eager to attract the best, so we offer competitive compensation and a generous benefits package, including full health insurance (medical, dental and vision), 401(k), life insurance, disability, and the opportunity to participate in a company bonus. What you’ll do on a typical day:Build, maintain, troubleshoot, and resolve performance issues with practical solutions that move projects forward in a timely mannerDesign and build back-end systemsBuild models that gather input data from network-connected user computers and databases on demandPerform testing and Quality Assurance validation (problem-solving); display results and solutions to the end usersExtract, integrate, and write SQL from databasesWork with users and team on defining and understanding requirementsCollaborate with team and propose solutionsWhat you need to succeed at XPO: At a minimum, you’ll need: Bachelor’s degree in Computer Science or technically-related field5 years of experienceProficiency in coding using Java and Python; strong understanding and use of Structured Query Language (SQL) and databases, including experience with installation and management of databases (MySQL, Postgress or similar)Expert in building, installing, and managing Linux environments; Version ControlUnderstand how to communicate visually through interfaces so that users have a clear understanding of what needs to be done It’d be great if you also have: More than 5 years of experienceDetail-oriented and comfortable with frequent, incremental code-testing and deploymentPrioritizes regular workload, special tasks and concurrent projects, allocating time and resources to ensure that work is completed accurately and efficiently within established time frameAbility to present organized and thorough information and data appropriate for intended audienceExcellent written and verbal communication skills; able to offer customer-friendly and thorough assistance to employees, visitors, and customersQuickly learns and achieves proficiency in new coding applications as neededBe part of something big. XPO provides cutting-edge supply chain solutions to the world&apos;s most successful companies, including Disney, Pepsi, L&apos;Oréal, Toyota and many others. We’re the fastest-growing transportation company on the Fortune 500 list and we’re just getting started.  We are proud to be an Equal Opportunity/Affirmative Action employer. Qualified applicants will receive consideration for employment without regard to race, sex, disability, veteran, or other protected status.  The above statements are intended to describe the general nature and level of work being performed by people assigned to this classification. They are not intended to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel so classified. All employees may be required to perform duties outside of their normal responsibilities from time to time, as needed."}