{"jobID": "2829292170", "jobLocation": "Downers_Grove_IL", "jobTitle": "Senior Food Scientist I - Hillshire Farm Brands", "companyRating": "3.4", "companyInfo": {"Website": "www.tysonfoods.com", "Headquarters": "Springdale, AR", "Size": "10000+ employees", "Founded": " 1935", "Type": " Company - Public (TSN) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": "*58207BR***Req ID:**58207BR*Job Description:** This position is responsible for developing and commercializing new and improved products and/or processes with the ability to identify opportunities and work projects autonomously. This covers all stages of product development and process development including writing new product specifications, and ensuring regulatory labeling and food safety requirements are met. Additional responsibilities include developing samples/prototypes of new products, modifying existing products, optimizing existing products, developing specifications for product production labeling, and compiling cost analysis information. Essential duties include working with and strongly influencing marketing, insights, sales, culinary, FSQA, operations and purchasing departments, coordinating with suppliers of ingredients, ensuring smooth start-up for new product production processes. The Scientist in this position will have a strong working knowledge of the Research &Development; process and is expected to leverage knowledge related to ingredients, product formulation and food processing to support best in class development of new innovative food products. The person in this position will also be responsible for working across multiple product lines and processes, conducting research with a focus on food safety, shelf life, sensory technologies, yield improvement and optimization efforts to meet our business objectives. This position will be responsible for analyzing, interpreting and presenting data for effective communication of product development and/or research findings to the business team and Sr. R&D; Leadership team. This position will have a general understanding of culinary techniques and their interaction with the science. This person will be working on teams within R&D; and across the organization in normal project work or special project assignments. This position will utilize problem solving techniques, presentation skills and relationship building to effectively work with marketing, sales, process, package, engineering, insights, culinary, regulatory, FSQA, operations, purchasing as well as major external customers. This person will identify, develop and complete special projects as needed. REQUIREMENTS:EDUCATION: BS, MS or PhD in Food Science, Meat Science, Food Engineering or related field. No degree with minimum of 10 years relevant experience. EXPERIENCE: PhD with minimum of 2 years of relevant experience, M.S. with minimum of 3 years of relevant experience, B.S. with minimum of 5 years of relevant experience. No degree with minimum of 10 years relevant experience. COMPUTER SKILLS: Requires excellent computer skills with ability to fully utilize MS Office products and Tyson systems (or like systems). COMMUNICATION SKILLS: Good verbal and written communication skills required. Presentation skills required. Must have the ability to effectively communicate with cross functional business partners SPECIAL SKILLS: Strong critical thinking, analytical and problem solving skills. Strong project management skills. Strong numerical skills. SUPERVISORY: May supervise a team of hourly technicians that support a team of scientists. May also manage one or two salaried scientists. TRAVEL: 25% - 12+ domestic trips per year. Travel will be required to accomplish our internal and external customer needs. Travel will include customer meetings, plant production facilities for testing and commercialization of new products, process trouble shooting and any other regular business needs. \\#LI-KG1*Facility Name (Location):** Downers Grove Office *Pay Type:** Exempt *Title:** Senior Food Scientist I - Hillshire Farm Brands *City:** Downers Grove *State:**IL*Shift:**1*Job Function:** Research and Development *Full Time / Part Time:** Full Time *Relocation Covered:**YES*Company Culture, Inclusion and Diversity Statement:** Tyson Foods proudly embraces diversity and is committed to maintaining an inclusive work environment. Our Culture is rooted in our Core Values and brought to life each day through our 5C Team behaviors (Caring, Candor, Creativity, Collaboration and Commitment). Team Members are the heart of our company and its success and culture is the connecting thread which drives our Talent Strategy to Attract, Grow, Reward and Retain the best talent.  Tyson is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will be considered without regard to race, national origin, color, religion, age, genetics, sex, sexual orientation, gender identity, disability or veteran status."}