{"jobID": "2836638487", "jobLocation": "San_Jose_CA", "jobTitle": "Workplace Support Specialist", "companyRating": "3.4", "companyInfo": {"Website": "www.cushmanwakefield.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1917", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " Unknown / Non-Applicable", "Competitors": " CBRE, JLL"}, "estimatedSalary": "50000", "jobDescription": "Job TitleWorkplace Support SpecialistJob Description SummaryBecome familiar with Cushman & Wakefield policies and procedures and to Adobe policies and procedures as they relate to your position and job description.Perform general office duties, as required, including sorting and delivering mail, perform outgoing shipping, and assist internal clients with logistics needs.Answer phone calls promptly and professionally, including calls to the main line, internal phone calls and internal help desk.Provide professional, timely, courteous and accurate service to employees and customersBe able to learn quickly and follow detailed instructionsAnswer questions and solve problems independently by utilizing a variety of resources to provide accurate information.Greet customers with a smile and maintain a tidy work area.Welcome visitors and follow all visitor and Security procedures.Support multiple service areas proficiently while maintaining expertise.Relieve team members for breaks and/or lunches as assigned.Understand and follow tasks for all assigned areas.Perform daily responsibilities with initiative (i.e. opening/closing tasks, stocking supplies, completing requests, meeting deadlines).Complete reports in an accurate and timely manner.Assist with special projects as requested.Assist and coordinate visitor registration for events, to include communication with event owners to ensure everything is ready in time for a given event.Job DescriptionSKILLS Ability to interact with client and client employees, senior management, staff and vendors as a service professional at all timesFollow directions and policiesProfessionalism and the ability to interact well with othersFlexible and energetic spiritExhibit motivation and initiativeStrong attention to detailStrong written and verbal communication skillsFamiliar with basic bookkeeping proceduresGood analytical skillsProvide consistently accurate serviceAbility to follow through and to help with tasks as a team playerAbility to prioritize and multi-task job dutiesDependability and maturity strongly requiredTwo to three years general office administration or closely related experienceFamiliarly with Word and Excel programs and a minimum typing speed of 35/wpmAbility to lift 40 pounds repetitively Position requires frequent reaching, bending, standing and sitting for prolonged periodsEDUCATIONHigh School diploma or general education degree (GED).College degree and/or related experience and training preferred.EXPERIENCEMinimum of two years of experience (or an equivalent combination of education and experience sufficient to successfully perform the essential duties of the job)Cushman & Wakefield provides equal employment opportunity. Discrimination of any type will not be tolerated. Cushman & Wakefield is an Equal Opportunity / Affirmative​ Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, protected veteran status or any other characteristic protected by state, federal, or local law."}