{"jobID": "2571304128", "jobLocation": "Rockville_MD", "jobTitle": "Sr. Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.midatlanticspine.com", "Headquarters": "Newark, DE", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Private Practice / Firm", "Industry": " Health Care", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "BASIC FUNCTIONS Provide analytical and consulting support to DCSM (DC& Suburban Maryland) MAPMG Leadership in making strategic decisions by analyzing, manipulating, tracking, internally managing and reporting data. This may entail working with our data systems to pull information using SQL, analyzing the information in Excel or other tools, and presenting the data to various leaders around our medical office buildings. Supports and prepares comprehensive analyses, operational and financial reports with written summaries to organizational leadership. RESPONSIBILITIESPerforms descriptive and/or in-depth analysis for problem solving and to help decision making, by extracting, cleaning, summarizing, tabulating and formatting data using tools such as SQL, SAS.Participate in and/or lead projects of moderate to complex scope as assigned and manages multiple internal andexternalPerform data analysis and provide consultative and advisory recommendations to service area leaders to support data requirements for strategic operational and financial decisions.Prepares departmental and/or state required reports related to health care quality improvement initiatives including HEDIS.Collaborate with front line staff to generate analysis and solution for effective patient outreach.Developing complex clinical reports, including but not limited to utilization, performance and efficiency relevant to Patient Care.Develop and automate reports usingSQL, SAS,Excel and visual analytics using Tableau.Conduct ongoing user education and provides management consultation on the use and interpretation of analyses, reports, methodologies and source data and systems.Partnership with controller in maintaining the budget system and managing annual department submissions to generate service area overall budget. Validates budget information against HR systems and KPHC.Participates in the planning and development of service area, departmental and/or functional budgets.Demonstrate leadership and willingness to teach others and learn.QUALIFICATIONSMaster's degree in economics, finance, health care administration, public health administration, statistics, mathematics, operations research, or related field required.Two (2) years of directly related experience required.Working knowledge of EPIC (Clarity) data systems preferred.Highly proficientwith SQL (Teradata/Oracle), PC SAS,Tableau and Excel.Experience with analytical manipulation and interpretation of multiple large databases or data warehouses required.Must havegood written and verbal communication.Strong experience in understanding business partner needs, documenting partner needs, documenting detailed report requirements.Must be able to understand the big picture as well as pays attention to detail.Must have strong analytical skills andproblem-solving ability.Must be able to overcome challenges to meet deadlines.Must be a team player.Knowledge ofhealthcare datastrongly desired."}