{"jobID": "2831931913", "jobLocation": "Santa_Clara_CA", "jobTitle": "Digital Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.agilent.com/go/careers", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1999", "Type": " Company - Public (A) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Thermo Fisher Scientific, Illumina, Danaher"}, "estimatedSalary": "138000", "jobDescription": " Agilent inspires and supports discoveries that advance the quality of life. We provide life science, diagnostic and applied market laboratories worldwide with instruments, services, consumables, applications and expertise. Agilent enables customers to gain the answers and insights they seek ---- so they can do what they do best: improve the world around us. Information about Agilent is available at ***************.  Digital Data Scientist Job Description: At Agilent, we're focused on making the world a safer and healthier place. Agilent is seeking a Data Insight Analyst to join our newly formed global analytics team as we build out our next generation digital experience. You will be responsible for providing actionable business recommendations based on rigorous data analytics and measurements. Whether you are working on defining relevance of web content or identifying business growth areas and drivers, you will take part in transforming business to a new level. This is an opportunity to gain valuable experience in all facets of web analysis and data science. From web page tag, online and offline data integration, extracting insights, and optimizing web experience and sales funnels, there will not be a shortage of puzzles for you to solve.  You will use strong analytics skills, business acumen, unbounded creativity, and clear communication to: Understand business questions, design applicable data analytics approach, extract insights from data, work with business to implement your recommendation.Provide data analysis to suggest improvements, and help optimize processes and user experience based on data and observed trendsIdentify key drivers of website visitor experience and revenue growth.Work across ecommerce store, digital marketing, content creation, operations, and more.Develop KPI of overall business performance via rigorous data analytics process and present them to management and key business groups through formal dashboards and ad hoc reports.Integrate online and offline data to plan and execute customer deep dive insight projects for sales, marketing, and BTB ecommerceServe as a subject matter expert on web analytics and data science and stay abreast of industry best practices and new opportunities }, { label: Schedule Full-time }, { label: Requirements Qualifications:PhD in related field required. Combined with strong programming and closely matched web analytics skills will be considered.Experience with Python, R, SQL, Google Analytics, Big query, and database structuresA passion for data analytics.Ability to interact professionally with a diverse group of managers, subject matter experts and other technical and non-technical cross-functional team members within a large global organization.Self- starter and have a can do attitude.Understanding of digital properties and the tagging required to provide meaningful insightsAbility to plan, organize and work on multiple tasks simultaneouslyCreative, innovative, and persistent. Agilent Technologies, Inc. is an Equal Employment Opportunity and Affirmative Action employer. We value diversity at all levels. All individuals, regardless of personal characteristics, are encouraged to apply. All qualified applicants will receive consideration for employment without regard to sex, pregnancy, race, religion or religious creed, color, gender, gender identity, gender expression, national origin, ancestry, physical or mental disability, medical condition, genetic information, marital status, registered domestic partner status, age, sexual orientation, military or veteran status, protected veteran status, or any other basis protected by federal, state, local law, ordinance, or regulation and will not be discriminated against on these bases.  For more information about equal employment opportunity protections, please view the 'EEO is the Law' poster available here: **************************************************************************************************************************************************************** Agilent Technologies, Inc., is committed to diversity in the workplace and strives to support candidates with disabilities. If you have a disability and need assistance with any part of the application or interview process or have questions about workplace accessibility, please contact +1-************ (US and Canada only) or email ***********************. EOE AA M/F/Vet/Disability.  }, { label: Travel Required Occasional }, { label: Secondary Locations }, { label: Duration Not applicable"}