{"jobID": "2795210225", "jobLocation": "Redondo_Beach_CA", "jobTitle": "Data Engineer 2", "companyRating": "3.7", "companyInfo": {"Website": "www.northropgrumman.com", "Headquarters": "Falls Church, VA", "Size": "10000+ employees", "Founded": " 1939", "Type": " Company - Public (NOC) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "104000", "jobDescription": " At Northrop Grumman, our employees have incredible opportunities to work on revolutionary systems in air and space that impact people's lives around the world today, and for generations to come. Our work preserves freedom and democracy, and advances human discovery and our understanding of the universe. We look for people who have bold new ideas, courage and a pioneering spirit to join forces to invent the future, and have a lot of fun along the way. Our culture thrives on intellectual curiosity, cognitive diversity and bringing your whole self to work - and we have an insatiable drive to do what others think is impossible. Our employees are not only part of history, they're making history.Northrop Grumman Aerospace Systems has an opening for a Data Engineer 2 to join our team of qualified, diverse individuals. This position will be located in Redondo Beach, CA.The selected candidate will stand up, manage, maintain and trouble shoot the organizations databases. As well as support data format needs for downstream visualizations Essential Functions:Design, develop, test, and deploy scalable data architecture and visualization solutionsResearch, evaluate, and determine best fit of tools and techniques for data mapping, data mining, data transformation, and data integrationDevelop complex queries or routines to extract data form disparate sourcesDevelop and troubleshoot SQL code, stored procedures, functions, tables, and viewsCollaborate with external functional organizations for data and system understandingConsult with customers and stakeholder to clearly define needs and objectivesCommunicate project status and results to various levels of leadershipBasic Qualifications: - Bachelor's degree in Science, Technology, Engineering or Mathematics (STEM) discipline from an accredited university and 2 years of data analytics or data engineeringexperience; OR a Master's degree  - Work experience in MS SQL Server, SQL queries, scripting, and automation  - Experience in Extraction Transfer Load (ETL) and data migration  - Working knowledge in programming languages such as Python, R, and Java Preferred Qualifications:Degree in Software Engineering, Computer Science  - Experience with visualization software such as Tableau and Java script framework  - Working knowledge of Hadoop and Spark  - Working knowledge statistical modeling and machine learningNorthrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit www.northropgrumman.com/EEO. U.S. Citizenship is required for most positions."}