{"jobID": "2811452221", "jobLocation": "Southfield_MI", "jobTitle": "Senior Developer, Data Warehouse", "companyRating": null, "companyInfo": {"Website": "www.creditacceptance.com", "Headquarters": "Southfield, MI", "Size": "1001 to 5000 employees", "Founded": " 1972", "Type": " Company - Public (CACC) ", "Industry": " Finance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Senior Developer, Data WarehouseWhy Work For Credit Acceptance? Credit Acceptance is rapidly-expanding our IT department with a variety of dynamic opportunities. Our culture has landed us on Computerworld's list of the Best Places to Work in IT. In each of the last 4 years, we have held a spot in the top 2 for midsized companies nationwide. In addition, we are also proud to say over the last 5 years we have been named one of Fortune Magazine's 100 Best Companies to Work For. Our team members and culture create a positive workplace that drives us to succeed, making Credit Acceptance one of the largest used car finance companies nationally.  We offer a great work environment, awesome team members, competitive benefits, progressive career opportunities, a casual dress code and we work hard to ensure every team member is empowered to work to their fullest potential. Credit Acceptance offers team members:The opportunity to work with progressive tools, and technology including the latest database, development, storage, and computer technologies availableExtensive growth opportunities as demonstrated by our track record of promoting internallyAn atmosphere that is collaborative, challenging, and filled with forward thinking team membersOngoing business training and career development opportunitiesStrong work-life balance with generous PTO beginning on day 1Competitive market-based salary with quarterly profit sharing and annual merit bonusesExcellent benefits package that includes 401(K) match, adoption assistance, tuition reimbursement, comprehensive medical/dental/vision along with additional benefits that make us a great place to workWe are hiring a Senior Developer within our IT Data Warehouse team.Design, develop, test and implement logic to extract, transform & load data from transactional applications into the DW using Oracle Data Integrator (ODI) and PL/SQLHelp End Users understand and query data to accomplish their business purposesPartner with Database and Middleware Administrators to achieve great application performanceDemonstrate advanced skills while coaching and mentoring less senior team membersResponsibilities in your area will include:Design, code, test and deliver insightful and architecturally sound business solutionsDocument code and projects so others can easily understandFulfill customer requirements as measured in customer survey scoresShow insight; know your application design & data; offer simple, working solutionsApply team coding, documenting and testing standards and recommend process improvementsRecognize upstream and downstream impacts; communicate effectively (verbally & in writing)Learn the Business Process Your Application Supports so your code will better support the businessImprove your application and team processesDecrease incidents and increase uptime of your applicationAll other duties as assignedAttendance as required by departmentPosition Requirements:Minimum of 5 years DW design and development experience;Minimum of 5 years Information Systems experienceKnowledge of ETL tools -Oracle Data Integrator Enterprise EditionProficiency in PL/SQL coding, troubleshooting, and performance tuningExperience with Oracle (preferably version 11)Knowledge of Unix Scripting and job schedulingParticipate in a (24X7) on-call rotation where you will be responsible to monitor production failure notifications and resolve issues.Remain compliant with our policies, processes and legal guidelinesWork onsite at the required Credit Acceptance work location Preferred: Experience in Data Quality and Cleansing, Data Governance, Metadata usage and management, and Master data management.Expertise in lifecycle database design, 3NF, and dimensional design conceptsKnowledge and Skills:Code expertly in your application while following team coding and testing standards.Respond promptly and effectively to large-scale problems, projects and tasks.Organize , with ability to multi-task and prioritize multiple requests.Convey complex information in a timely and easily understood way to all levels of the organization.Demonstrate insight ; make recommendations as opportunities arise.Be self-driven , motivated to help, and able to perform with minimal supervision.Maintain customer focus ; keep the customer's and companies best interest in mind.Work well with abstract concepts . Be analytical. Solve problems.Company Values: To be successful in this role, Team Members need to demonstrate the characteristics of PRIDE in their work: Positive : Maintain a positive attitude by focusing on solutions and promoting a collaborative and enjoyable environment.Respectful : Value teamwork, share successes, appreciates others and communicates in a way that promotes trust.Insightful : Make timely well-considered decisions, create innovative solutions and continuously learn.Direct : Communicate clearly and objectively; don't be afraid of difficult conversations. Raise concerns through the proper channels.Earnest : Be honest, sincere and consistent. Work hard and pursue our goals together relentlessly. Required degrees must have been earned at institutions of Higher Education which are accredited by the Council for Higher Education Accreditation or equivalent.  Credit Acceptance is an equal opportunity employer."}