{"jobID": "2587500908", "jobLocation": "Arlington_VA", "jobTitle": "Senior Data Scientist", "companyRating": "4.2", "companyInfo": {"Website": "www.i-360.com", "Headquarters": "Arlington, VA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "114000", "jobDescription": " i360, the leading data and technology provider for the pro-free market public policy and advocacy community, supports organizations that promote free enterprise and smaller government. i360 is a dynamic workplace sitting on the leading edge of public policy, technology, and business, and is seeking team members who are as excited about their cause as they are about building the next generation of political technology.  The Data Scientist will discover actionable insights using a large repository of individual-level data. The ideal candidate is someone who has significant analytical experience with very large datasets and is looking to leverage that knowledge to make a difference in economic freedom. i360 is a dynamic workplace sitting on the leading edge of politics, technology, and business, and they are seeking team members who are as excited about their cause as they are about building the next generation of political technology. Essential Responsibilities:Build and shape tools and products by applying advanced analytical techniques to large datasets.Develop and apply models that predict individuals’ propensity to engage in a behavior or hold a particular viewpoint.Design and implement new visualization techniques to help customers extract more meaning from their data.Work with technical staff to develop and refine data storage frameworks that are optimized for analytical use.Help design and build processes for evaluating and incorporating a variety of new incoming datasets.Present analytical results, both orally and in writing, to technical and non-technical audiences.Qualifications:Master's or PHD5+ years experience with SPSS, SAS, R, Stata, or equivalent platformMS or PhD in a technical field, preferably statistics, mathematics, computer science, or systems engineeringExperience in leading or managing a small team7+ years of experience using a big data storage framework such as large scale partitioned relational databases, Hadoop, Hive, MongoDB or similar large scale data frameworksExperience with terabyte-class datasets and “big data” storage frameworks is a huge plus, as is a background in visualization, computer science, or relational databasesExperience with datamart-style dimensional databasesPolitical/advocacy experience in activist or free market organizations and experience working with voter filesExperience in risk management or fraud detectionConsumer modeling and experience with commercial databasesAPPLY NOW"}