{"jobID": "2809041587", "jobLocation": "Detroit_MI", "jobTitle": "Entry Level Software Consultant", "companyRating": "4.1", "companyInfo": {"Website": "www.dynatrace.com", "Headquarters": "Waltham, MA", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "72000", "jobDescription": "Some companies claim leadership, Dynatrace proves it. Were redefining the rules of technology performance, with a focus on what it takes for companies to succeed in todays digital economy. Being a trailblazer is hard work and we need dedicated team players that will work to ensure Dynatrace remains #1 in the market. As a market and technology leader we have an exciting opportunity for a Guardian Delivery Consultant. Our consultants provide integration development and support for the company's customers and partners.How we prepare you: Our Professional Development Program (PDP) is an intensive 5 month developmental training program to ensure that you have both the soft and hard skills to hit the ground running at a client site as a Guardian Consultant. Our program provides you with a strong foundation of consulting methodologies, personal brand development, Dynatrace technology and client strategy on which to build a career with us.Now, the question for you is: What do you want? Do you aspire to go down a technical path or a leadership path? Whichever path you choose, we know how to get you there and make sure you get what you need to make your goals happen. Apply today! What we are looking for Strong passion and desire to learn new technology.Independent thinker yet team-oriented.Innovative and creative.Self-motivated with a strong work ethic. What you will be doing Monitor applications from the end user to the data center.Supporting operations staff by providing critical application performance, availability and capacity data.Review performance trends and service desk tickets to aid in proactive monitoring efforts.Helping our clients obtain the maximum value from existing investments, while allowing their IT staff to focus on core capabilities and activities just to name a few.Dynatrace has redefined how you monitor todays digital ecosystems. AI-powered, full stack and completely automated, its the only solution that provides answers, not just data, based on deep insight into every user, every transaction, across every application. The worlds leading brands, including, 72 of the Fortune 100, trust Dynatrace to optimize customer experiences, innovate faster and modernize IT operations with absolute confidence.We offer competitive compensation, company-sponsored premium benefits, medical, dental, vacation/holidays, company matching 401(k) Plan, etc. Dynatrace is an equal opportunity employer and VEVRAA Federal Contractor. We consider all qualified applicants of diverse background and hire without regard to race, color, gender identity, religion, national origin, ancestry, citizenship, physical abilities, age, sexual orientation, veteran status, or any other characteristic protected by law. If your disability makes it difficult for you to use this site, please contact recruiting@dynatrace.com. Dynatrace participates in E-Verify, participant information in English and Spanish. Right to work information in English and Spanish. EEO is the Law/EEO is the Law Supplement.Note to Recruiters and Placement Agencies: Dynatrace LLC (Dynatrace) does not accept unsolicited agency resumes. Please do not forward unsolicited agency resumes to our website or to any Dynatrace employee. Dynatrace will not pay fees to any third party agency or firm and will not be responsible for any agency fees associated with unsolicited resumes. Unsolicited resumes received will be considered property of Dynatrace."}