{"jobID": "2684860478", "jobLocation": "San_Francisco_CA", "jobTitle": "Lead Data Analyst", "companyRating": "4.4", "companyInfo": {"Website": "www.hoteltonight.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "118000", "jobDescription": "HotelTonight makes it remarkably easy to book great hotels at amazing last-minute rates on your mobile device, for tonight, tomorrow and beyond. Our mission is to make people feel more alive by delivering the unexpected and we’re looking for a Lead Data Analyst to help do just that.As a Lead Data Analyst on the Data & Strategy team, you’ll be part of a team that is focused on just that - using data to drive strategy. You’ll work closely with Marketing and CX, and own and lead projects around our millions of users and many more potential users. You’ll dive into complex datasets to analyze trends, identify opportunities and quantify the potential value of new initiatives.WITHIN 1 MONTH, YOU WILL Organize backlog and prioritize opportunities for analysisEstablish relationships with Marketing and CX to understand business objectives and opportunitiesDevelop knowledge of dataWITHIN 3 MONTHS, YOU WILL Establish a solid cadence and plan for priorities and communication to stakeholdersQuickly deliver actionable insights and recommendations around key business questionsBecome the go to person for attribution and PR needsWITHIN 12 MONTHS, YOU WILL Become the Marketing expert within HotelTonightLead new ideas on measurement and modeling of user value and ROI of various channelsWHAT YOU'LL NEED TO BE SUCCESSFUL IN THIS ROLE 4+ years of experience in an analytical role using SQLStrong applied analytics - you love data, gleaning insights from data, and making decisions based on dataQuantitative analysis - you have experience extracting, manipulating, and analyzing large data sets using SQL and understand basic statistics; experience with advanced visualization tools is a plus (e.g. Tableau)Marketing analytics experience a huge plus!Excellent communication and presentation skills - effectively presenting insights is as important as the insights themselvesAbility to collaborate and work effectively with cross functional teamsWHAT YOU'LL GET FROM US An official Best Place to Work (we're in the top 10!)A highly collaborative and supportive team environment that values asking the right questions, building solutions, and respecting everyone we work withWe’ll help you create goals that drive you, take on projects that excite you, and learn things that will surprise youA beautiful workspace at Market & 5th StExcellent health, dental, vision and 401k plans, and stock options tooFun stuff — quarterly travel stipend, flexible time off, catered meals, subsidized cell phone plans and fitness memberships, access to our very own hotel-inspired full bar, and the opportunity to spin the HT Roulette wheel to win a spontaneous weekend getaway!We are on a mission to radically transform hotel bookings. Doing this requires us to think differently and to question conventional approaches, therefore it’s essential to have a diverse team of the very best people with all types of backgrounds and experiences to bring the best ideas to life. We are committed to maintaining an environment where all of our team members have the opportunity to be heard, to make an impact and to do the best work of their lives."}