{"jobID": "2827614734", "jobLocation": "Los_Angeles_CA", "jobTitle": "Sr. Data Analyst Business Unit", "companyRating": "4.2", "companyInfo": {"Website": "www.cnb.com", "Headquarters": "Los Angeles, CA", "Size": "1001 to 5000 employees", "Founded": " 1954", "Type": " Subsidiary or Business Segment", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " East West Bank, Bank of the West, First Republic Bank"}, "estimatedSalary": "84000", "jobDescription": " The Business Unit Data Analyst is responsible for supporting the Finance Group and business users through the analysis of quantitative & qualitative data. This position will participate in the analysis required for the design and development of the enterprise and local data solutions and related reporting structures and interfaces. This role requires the ability to translate business problems into solutions/approaches driven by data analysis, business acumen, creativity, and clear, concise and effective communication.  Responsibilities Work with Business Users to define and document explicit business requirements for implementing subject areas in the Enterprise Data Warehouse and corresponding reports.Perform data analysis by writing complex PL/SQL queries on various source systems and data warehouse to find trends and anomalies in the data in support of the requirements for various strategic and/or tactical projects.Serve as Subject Matter Expert on a particular system and its data, and guide the development activities with assumptions and data dependencies.Identify data quality issues and concerns and support the data governance initiative by being involved in various data initiatives.Conduct on-going analysis of the business, operating practices, and data flows within and between various systems and applications.May be required to assist in maintaining the data model for both Operational Data Store (ODS) as well as the analytical Enterprise Data Warehouse (EDW).Keeps informed of existing and evolving best practice, industry standards and technologies.Fosters and maintains good relationships with colleagues to meet expected customer service levels.Maintain all appropriate training and continuing education requirements for both internal programs and external licenses and certifications.Develop and mmaintain positive, productive, and professional relationships with key business partners to meet expected customer service levels.Complies fully with all Bank Operational policies and procedures as well as all regulatory requirements (e.g. Bank Secrecy Act, Know Your Client, Community Reinvestment Act, Fair Lending Practices, Code of Conduct, etc.). Requirements *Minimum 7 years of experience working with Information technologies required.*Minimum 7 years of experience as a Data Analyst, preferably in a data-intensive financial company.*Minimum 5 years working in a client facing business support role. Job Skills and Knowledge Must have strong business acumen.Able to communicate clearly and professionally with all levels of an organization.Strong interpersonal, written and verbal communication skills with demonstrated ability to work in a team environment.Ability to express complex technical concepts in business terms.Good knowledge of project management technique.Excellent analytical skills.Bachelor's degree in Computer Science or related technologies strongly preferred.Prior hands-on experience in using BRIO or Business Objects report queries a plusExperience in advanced PL/SQL and Oracle queries and analysis is a plusPrior experience in Financial Services industry a plus. *Represents the basic qualifications for the position. To be considered for this position you must at least meet the basic qualifications.  City National Bank is an Equal Opportunity Employer -- Minorities/Females/Individuals with Disabilities/Veterans.  Note: The Preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.  Note: Candidates should be advised that City National Bank does not pay interviewee travel expenses or relocation expenses for candidates who are hired unless previously agreed.  *LI-SW1Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}