{"jobID": "2521226118", "jobLocation": "Los_Angeles_CA", "jobTitle": "Business Intelligence Data Analytics Manager", "companyRating": null, "companyInfo": {"Website": "www.atrilogy.com", "Headquarters": "Irvine, CA", "Size": "1 to 50 employees", "Founded": " 2000", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Atrilogy Solutions Groups direct client is searching for a Business Intelligence Data Analytics Manager to join their team in downtown, Los Angeles, CA on a direct hire, full-time basis. This person will be managing a team of 8+ data analyst working on multiple projects. These projects include analysis, database design and data architecture. Our client is searching for technical experience with Oracle, RDBMs, Informatica and ETL but this is not a hands-on position. Basic Qualifications:Minimum of 5 years of experience working with Information technologies in a manager role required.Minimum of 5 years of experience in data analysis requiredMinimum of 5 years of experience in advanced PL/SQL and Oracle queries and analysis required.Minimum of 5 years of experience in managing teams required.Skills and Knowledge:Bachelor's degree in Computer Science or related technologies strongly preferred.Must have proven experience as a Data Manager; 6-8 years of experience preferred.Prior hands-on experience in using ETL tools, PL/SQL, Business Objects or other related BI and Big data tools Fosters and maintains good relationships with colleagues to meet expected customer service levels.Ability to interface and effectively communicate with multiple levels of management.Organized, detail-oriented, and ability to multi-task.Strong organizational, planning and management skills.Strong strategic thinking, problem solving, critical thinking, leadership and conflict resolution skills. Ability to influence, motivate, persuade and build confidence, and trust.Capable of transitioning knowledge of management to others.Create an environment of teamwork.Excellent understanding of data administration and management functions (i.e. data collection, data analysis, data distribution, data consumption, etc.)Proven experience with various databases (operational, data warehouse, data lakes).Strong analytical mindset with problem solving skills Excellent communication and collaboration skills; ability to communicate clearly and professionally with all levels of organization4-6 years of prior experience in Banking or Financial Services industry a plus.Responsibilities:The Business Intelligence Data Analysis Manager will manage the Data Analyst team that performs functional and in-depth analysis across various lines of business and the design of databases and data analysis procedures.The Manager is responsible for executing BI vision, strategy, and implementation methodologies to address data analytics.The primary focus is to ensure best practices for database design are followed for various types of platforms, such as transactional, aggregation, structured and unstructured data sets.The day to day responsibilities are to ensure data information flows timely and accurately from the organization through the Operational Data Store, Enterprise Data Warehouse and internal downstream systems.Must possess in-depth analysis of data, transactional, business intelligence, enterprise data management and big data concepts.Responsible and accountable for appropriate quality controls related to the financial products we provide, the services we deliver, the processes we employ, and the incentives with which we reward our colleagues. For immediate consideration please submit your resume in Word format, along with daytime contact information. LOCAL CANDIDATES ONLY PLEASE unless you are willing to relocate yourself at your own expense. Client is unable to provide H-1B Visa sponsorship at this time. All submittals will be treated confidentially. Selected candidate may be asked to pass a comprehensive background, credit and/or drug screening. Principals only, no third parties please.  Established in 2000, Atrilogy Solutions Group, Inc. provides organizations of all sizes with high-quality, cost effective information technology (IT), business process and health care consulting and staffing services. Our industry-leading service model combines experienced project managers with seasoned technical and functional consultants to eliminate client uncertainty and deliver superior value and results.  Clients turn to Atrilogy for expertise in: IT staffing and placement (Project Managers, Business Analysts, DBAs, Developers, Quality Assurance and Testing, Software Configuration Management, etc.)All major Enterprise Resource Planning packages (including Oracle, PeopleSoft, JD Edwards, SAP, Microsoft, Lawson)Health care consulting resources and services (including ICD-10)Customer Relationship Management (CRM)Creative (Interactive Project Manager/Art Director, Information Architect, UI/UX Designer, Web/Graphic Design) Atrilogy has been recognized by CRN magazine as one of the nations fastest-growing IT solution providers and by Inc. magazine as one of the nations fastest-growing, privately-held companies. Based in Irvine, California, Atrilogy also has offices in Denver, Phoenix, and Atlanta "}