{"jobID": "2803841219", "jobLocation": "Chicago_IL", "jobTitle": "Wealth Management, Client Tax Data, Analyst", "companyRating": null, "companyInfo": {"Website": "www.jpmorgan.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1799", "Type": " Company - Public (JPM) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Firm Introduction: J.P. Morgan Asset & Wealth Management, with client assets of $2.4 trillion, is a global leader in investment and wealth management. Its clients include institutions, high-net-worth individuals and retail investors in every major market throughout the world. The division offers investment management across all major asset classes including equities, fixed income, alternatives, multi-asset and money market funds. For individual investors, the business also provides retirement products and services, brokerage and banking services including trusts and estates, loans, mortgages and deposits.Position Description:The Wealth Management Client Tax Data Team's primary objective is to ensure global conformity with the IRS Regulations as it relates to client tax information reporting and withholding. The team ensures compliance with IRS Forms W-9/W-8 tax certification requirements in order to limit (or prevent) penalties for non-compliance. As a team member, you will be expected to perform the daily activities required to meet tax withholding and reporting requirements including an understanding of US and Non-US client tax certification requirements. You will also assist the team with the year-end tax withholding and reporting process, understand controls, and participate in reviews to provide consistent and accurate tax reporting in accordance with regulatory requirements to our Wealth Management Clients.The role of the Client Tax Data Analyst candidate will be to ensure global conformity with IRS regulations for the Private Bank and is expected to assist the team with tax projects that impact our accounting system including system enhancements, transition of accounts from other platforms, new securities, and new services. The Client Tax Data Analyst is expected to perform the daily activities and be flexible in working the required hours, which may include some weekends and holidays. (Heavy volume periods first and fourth quarter)Core Responsibilities:Analyze client tax status for consistency and accuracy; liaise with appropriate team(s) and/or individual(s) to facilitate the required adjustmentsPerform required reconciliationsReview and analyze client tax information across various systems (withholding status, Chapter 3 and Chapter 4 status, various FATCA related data points)Perform analysis on tax and security researchReview and analyze the integrity of data (client, security, and transactional)Research historical activity as necessary to respond to internal business partners in adherence to our service level agreementsWork with senior members of the Tax Compliance team on inquiries on tax withholding and reporting rules (Chapter 3, FATCA etc) and develop and communicate required procedural changes resulting from the industry and legislative changes.Implementation and support of BAU processes and procedures for continuous information reporting and withholding complianceWork on tax projects to improve current process and procedures, and lead tax related initiatives as required.Perform data and tax package analysis as well as year-end controls and verificationCreate and distribute the 1099s, 1042S forms, and tax packagesAbility to identify areas of improvement and recommend efficiency enhancementsCross train with other team members, other operational teams, and CSGDocument and enhance procedures and training documentationDocument and enhance MIS relating to data analysis, inquiries, and maintain daily MISEnsure adherence to procedures, control policies, and service level agreementsCommunicate and participate in multiple operational, technological, and business projects (business requirements, testing, implementation, procedures, etc.)Serve as a subject matter expertSupport the teams structure and goalsQualifications:Knowledge of IRS requirements (i.e. Revenue code sections and Treasury regulations), with focus on information reporting and withholding (preferred).Undergraduate degree in accounting, finance, economics, or related field; advanced degree or progress toward graduate degree in law or taxation is preferredMinimum of 2-4 years of experience required; prior position at a large accounting firm or financial services company in tax information reporting is preferredHighly organized and detail oriented with strong analytical skills and the ability to work independentlyAbility to multi-task, plan, and prioritize in a fast-paced environment.Excellent written and verbal communication skills (including presentation) and influencing capabilitiesProficient computer skills with an emphasis in Microsoft Office tools: Excel, PowerPoint, and Word) (Advanced Excel user preferred (vlookup, pivot tables, macros)Strong reconciliation skillsFlexibility to work extended hours as needed"}