{"jobID": "2831523376", "jobLocation": "Skokie_IL", "jobTitle": "Research Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.kaufmanhall.com", "Headquarters": "Skokie, IL", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": "Position Summary: The Consultant leads the development of creative, analytically driven solutions to complex healthcare industry problems which will assist clients plan and manage more effectively. Has expertise in managing and analyzing large data sets including but not limited to patient and management data and consumer survey research. Skilled in building complex algorithms and models and serves as a resource to other analytical and consulting staff. From time to time, also interacts/consults with the client in relevant matters within the scope of a project. Key Responsibilities:Develops creative and analytically driven solutions by employing operations research, advanced statistical and mathematical science techniques such as mathematical modeling, statistical analysis, linear and non-linear regression analysis, stochastic modeling and mathematical optimization.  Able to determine optimal or near-optimal solutions to complex decision-making problems in the areas of healthcare operations, workforce optimization, pricing strategy, and strategic and financial planning.  Understands the benefits and limitations of various statistical and mathematical approaches and is able to communicate to colleagues and clients.  Utilizing advanced mathematical & statistical methodologies, develops and leads scenario modeling events in partnership with directors and consultants to assist clients in transforming their enterprise.Creates complex models and algorithms drawing from diverse, large and complex data. Can translate client and consultant requirements & constraints into mathematical models.Builds analytical/optimization models to improve the financial and patient care metrics.Participate in both client & internal discussions to explain model output.Enable implementation of the models through education, training and technology support.Build measurement system to track the impact of the changes and report the same.Participate in research to constantly try and bring in new analytical/operations research/process improvement methodologies and techniques to improve healthcare operations and KHA approaches to complex industrial problems.Advises software developers in the creation of commercial products.   Key Technical Skills Needed: Has knowledge and experience in utilizing advanced mathematics as applied to a business setting, for example, linear programming, optimization modeling, operations research, logistics science.Hands on experience with Microsoft Excel (basic excel functions, advanced excel functions including macro programming).Hands on experience with solvers like Excel based Lindo solver, Matlab programming (Knowledge of MS Access and Tableau is a plus).Excellent computer skills; proficiency in all current business applications and software, including but not limited to Word, Power Point.Data mining experience using statistical software like SAS. (SPSS is an additional benefit).Knowledge, experience and overlap with other disciplines, notably industrial engineering and management science, and draws on psychology and organization science.Knowledgeable in basic Toyota Lean/Six Sigma and/or TQM or related process evaluation and process improvement techniques.Basic understanding of root cause analysis.  Key Financial Skills Needed:Possesses basic financial management skills related to planning, budgeting, forecasting, and reporting. Understands the interdependencies of these systems.Ability to gather and analyze financial performance data.Basic understanding of accounts payable/receivable processes.Able to construct a basic financial pro forma including cost benefit analysis and clinical implications of decision/deployment strategy changes. Key Communication and Consultation Skills Needed:Very good communication skills – oral and writtenAbility to construct verbal and written messages for a variety of audiences, i.e. executives, managers, subordinates, consultants and clients.Ability to assess client needs, outline project goals, define project deliverables, and establish timelines. Other Skills Needed:Ability to grasp operational concepts and processes.Proactive behavior with a strong problem solving orientation.Solid interpersonal, influencing, and communicating skills across all levels and functions.Self-directed individual able to operate independently and work efficiently in a team environment.Ability to manage and prioritize multiple tasks in a fast paced environment.Unquestionable commitment to personal and corporate integrity in every situation.Self-directed; critical thinking skills; strong service standard.Aligns own work with organizational goals and ethical standards.Self-directed learner who keeps abreast of evolving analytical methodologies, tools, techniques and technologies. Education & Experience:Master Degree in Statistics (Bachelors in Computer Science is plus).3-5 years of progressive experience required. Healthcare finance/operations experience is a plus.Prior consulting experience preferred.  Kaufman, Hall, & Associates, LLC. is an equal opportunity/affirmative action employer. All qualified applicants will be considered without regard to age, race, color, religion, sex, national origin, marital status, ancestry, citizenship, veteran status, sexual orientation or preference, or physical or mental disability or other legally protected category."}