{"jobID": "2664604097", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst - Video Platform", "companyRating": "2.9", "companyInfo": {"Website": "www.twitch.tv", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2011", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "95000", "jobDescription": "Data is central to Twitch’s decision-making process, and analysts are a critical component to evangelize data-driven decision making in all of our operations. As an analyst at Twitch, you will be in on the ground floor with the Video team, shaping the way video quality of service is measured, defining what questions should be asked around expansion, and scaling analytics methods and tools to support our growing business. You will lead the way for high quality, high velocity decisions for your team.For this role, we’re looking for an experienced data analyst who will assist Video senior leadership and engineering with business and product analysis. You will define core KPIs, help plan service expansion, and ensure the impact from major service changes are well understood. Working directly with senior leadership, you will be responsible for guiding the team's thought process when it comes to using data to direct both business and high-leverage engineering efforts.Responsibilities Efficiently prioritize to supplement day-to-day operations with data and processes that scale -- provide teams with ad-hoc analysis, automated reports and dashboards, and self-service reporting tools that accurately reflect the health of their products and help them track their progress towards their goals.Partner with engineering to build the foundation and technical framework to maximize efficacy of video tools by solidifying tracking infrastructure and automation.Have an opinion and standardize delivery of evidence to support product decisions around goals, metrics and product performance.Maintain a culture of high quality output and exceptional customer service: effectively communicate at all levels, ensure that work gets done well and on time, respond effectively to unexpected obstacles and reallocate resources as necessary.Identify opportunities for developing new data sources, and provide technical leadership around making those data sources high quality and broadly available.Champion data-driven decision-making in your team and throughout the company.Requirements 2+ years of engineering, analysis, statistics, product operations or equivalent experience.Exceptional SQL skills. Your ability to tap into our data pipeline will be the key to your success.Good understanding of data structures and pipelines. Experience with data instrumentation, interpretation and visualization tools (Mode, Tableau).Fluency in data analysis, including experimentation, data visualization, defining KPIs, and communication around data to inform the success of the business and its features.Detail-oriented with superior organizational skills. Able to navigate between multiple projects, meet deadlines, and process ad hoc requests.Perks Full benefits, including medical, dental, vision and life401(k) savings plan with a company matchCatered daily lunch and dinners (and hearty breakfasts three times a week)Unlimited snacks and drinksMonthly in-office massagesCorporate gym membershipCommuter benefitsFlexible time off policyWeekly happy hours and opportunity to attend one gaming event or tournamentTop of the line technology to help you build your own workspaceTwitch is the world’s leading video platform and community for gamers, with more than 100 million visitors per month. We connect gamers from around the world by allowing them to broadcast, watch, and chat with each other. Twitch’s live and on-demand video platform forms the backbone of a distribution network for video game broadcasters including pro players, tournaments, leagues, developers and gaming media organizations. Twitch is leading a revolution in gaming culture, turning gameplay into an immersive video experience. Learn more at: http://twitch.tvWe are an equal opportunity employer and value diversity at Twitch. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.#LI-SM1"}