{"jobID": "2770232594", "jobLocation": "Peapack_NJ", "jobTitle": "Head, A.I. Data Sciences", "companyRating": null, "companyInfo": {"Website": "www.pfizer.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1849", "Type": " Company - Public (PFE) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Data in pharmaceutical research has constantly increased in both volume and complexity and its correct interpretation in a biomedical context has become more and more dependent on advanced analytical and data management skills.  As the Head of AI for Data Sciences, you will be responsible for helping to accelerate drug discovery by enhancing our decision-making process, working with a wide range of roles to extract actionable insights from complex data sets.  Role Responsibilities  Acts as the key scientific and technical Artificial Intelligence expert for Data Monitoring and Management; defines and drives the data monitoring and management strategy and standards in the AI space, utilizing techniques such as RPA, Natural Language Processing, Machine Learning, etc., across all areas of Data Monitoring and Management (DMM) (including data management, Risk-Based Monitoring, and standards). Operationally manages the application and utilization of AI technologies and practices within DMM organization. Represents DMM and supports AI and innovation related interactions with external vendors, BT, COE, senior leaders, and representatives across GBDM. Actively coordinates resources to ensure successful AI project implementation outcomes.Defines and effectively communicates to DMM colleagues and partner organizations AI project requirements and partners with BTQA to follow all appropriate standards for compliance.Partners with colleagues to ensure alignment of data quality across DMM, preferred partners, Development China and Development Japan.Proactively identifies issues, successfully leading initiatives which result in continuous improvement and quality deliverables across DMM. Defining and driving the AI strategy to create a roadmap detailing the short and long term implementation for DMM, including techniques from RPA (robotic process automation) ML (machine learning), NLP (natural language processing), etc.  Basic Qualifications Bachelor's degree in a field such as Statistics, Mathematics, Statistics, Economics, Physics, Engineering is required. A Masters Degree Preferred.10+ years of experience in the IT industry preferred3+ years of experience with Machine Learning and Artificial Intelligence techniques and tools5+ years of experience with data sources and platformsAt least 5 years in a leadership role.Flexibility, problem-solving and leadership skills, genuine intellectual curiosity, borderless ideation and eagerness to contribute are key elements of the position.Excellent communication skills to ensure alignment between computational and life scientists, Business Technologists, and physicians, as well as management.A confident leader and subject matter expert, to drive innovation.The individual should have demonstrable experience and passion for mathematics, statistics, signal processing, image analysis, machine learning, data mining, and data visualization.Deep knowledge of scripting and analytics software, including R, Python, Pipeline Pilot, KNIME or equivalent.Excellent theoretical understanding and real hands-on experience with deep learning and a range of more classical supervised and unsupervised machine learning methods, including but not limited to ensemble learning techniques (e.g. boosting, Random Forests) kernel methods (e.g. SVM), (non-linear) dimensionality reduction and feature selection methods are required. Practical knowledge of Bayesian methods and Natural Language Processing is a plus.Demonstrable expertise with various machine learning packages, including deep learning toolkits (e.g. TensorFlow, mxNet, Theano or others).Fluent in big data management tools, such as Hadoop, NoSQL data stores as well more traditional relational databaseDemonstrated ability in the application of Machine Learning/AI in real-world settings with large scale dataGood understanding of the Drug Development is preferred. Organizational Relationships Reports to Member of DMM LT, formulating strategies, standards and processes to be implemented across portfolio, ensuring compliance with global regulatory requirementsPartners closely with Clinical Data Scientist (CDS), Central Monitor (CM), Statistical Programming, Quality and other CD&O; groupsSupports Teams across the Research/Business Units (R/BU), PEHEEO & Employment Eligibility Pfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer. Sunshine Act Pfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider’s name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.  Pfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates."}