{"jobID": "2838009518", "jobLocation": "Fort_Worth_TX", "jobTitle": "Metric & Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.lockheedmartin.com", "Headquarters": "Bethesda, MD", "Size": "10000+ employees", "Founded": " 1995", "Type": " Company - Public (LMT) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Boeing, Northrop Grumman, Raytheon"}, "estimatedSalary": "78000", "jobDescription": " Become part of the Lockheed Martin team and bring your expertise as the Supply Chain Business Process Analyst. Your responsibilities will include assisting with the translating of program and supply chain requirements and directives into executable data trending and reporting methodologies, tools, and deliverables. Additionally, you will support the creation of specification requirements based upon customer needs as well as set up the programming necessary to provide the end customer the datasets and trending information needed to make business decisions and track progress to established targets. This may include creating and maintaining multiple databases for user input and collection of data and trends. You will be involved with synthesizing data and data relationships from Systems, Applications and Processes (SAP) and other data sources, and have proven experience with compiling data from those sources into a customer friendly format. You will be responsible to leverage project management skills to drive the creation and execution of improvement plans. You must be able to be flexible and balance priorities to support goals and targets while providing the customer answers and data in support of business decisions. Selected individual will support Sustainment Analytics Team as Supply Chain SME and responsible for analyzing Sustainment performance improvement opportunities to align SCM's ability to execute.Must be a US Citizen or legally authorized to work in US as a permanent resident. This position is located at a facility that requires special access.Basic Qualifications• Bachelor's from an accredited college or university • Experience with data analysis • Experience in Microsoft Office Suite (MS Access, Excel and PowerPoint) • Experience with mapping out process flows • Experience with identifying root cause problem areasDesired skills•Preferred degree in business, mathematics, or supply chain•Knowledge of OneAero Systems, Applications and Processes (SAP) data constructs, primarily as it applies to Supply Chain Management, secondarily as it applies to Production Operations, Global Sustainment, and Finance. •An understanding of Supply Chain Management processes, as well as their integration points to other departments including Procurement, Transportation, and Sustainment•Experience in F-35 Sustainment a plus•Strong analytical knowledge•Demonstrated ability to synthesize broad and complex information•Demonstrated project management skills •Strong problem-solving skills •Strong communication skills (verbal, written and presentation) •Self-Motivated Team Player •Experience with documenting functional specifications (translating customer requirements) •Preferred candidate will possess good business and process acumen and be able to communicate effectively with personnel at all levels •Candidate must be able to trouble shoot issues and proof check solutions and data to assure achievement of customer requirements •Experience with Information Technology applications, integration, and support; including data manipulation or database applicationsAs a leading technology innovation company, Lockheed Martin’s vast team works with partners around the world to bring proven performance to our customers’ toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.Join us at Lockheed Martin, where we’re engineering a better tomorrow.Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.Job Location(s): Fort Worth Texas"}