{"jobID": "2683293224", "jobLocation": "Sterling_Heights_MI", "jobTitle": "Senior Data Analyst", "companyRating": "3.0", "companyInfo": {"Website": "www.ascension.org", "Headquarters": "Saint Louis, MO", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "79000", "jobDescription": "Additional Job InformationTitle: Senior Data Analyst City, State: Sterling Heights, MI Location: US Health Holdings/ABS Department: Decision Support Additional Job Details: Full-Time,Day, 37.5 hours,Weekly About UsAscension is a faith-based healthcare organization dedicated to transformation through innovation across the continuum of care. As the largest non-profit health system in the U.S. and the world's largest Catholic health system, Ascension is committed to delivering compassionate, personalized care to all, with special attention to persons living in poverty and those most vulnerable. In FY2016, Ascension provided more than $1.8 billion in care of persons living in poverty and other community benefit programs. Ascension includes approximately 150,000 associates and 36,000 aligned providers. Ascension's Healthcare Division operates 2,500 sites of care – including 141 hospitals and more than 30 senior living facilities – in 24 states and the District of Columbia, while its Solutions Division provides a variety of services and solutions including physician practice management, venture capital investing, investment management, biomedical engineering, facilities management, clinical care management, information services, risk management, and contracting through Ascension's own group purchasing organization.Job DescriptionJob Summary: The Senior Data Analyst analyses, designs and implements data bases and coordinates data base development. Responsibilities:Identifies and resolves production and/or applications development problems related to the use of the database management system software or utilities.Studies current data handling systems to evaluate effectiveness and develops new systems to improve production or workflow as required.Creates detailed specifications of logical and/or mathematical operations to be performed by various equipment units and/or comprehensive computer programs. Creates detailed specifications of operations to be performed by personnel in system.Plans and prepares technical reports, memoranda and instructional manuals relative to the establishment and functioning of complete operational systems.Qualifications"}