{"jobID": "2824594147", "jobLocation": "Dallas_TX", "jobTitle": "Data Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.apexclearing.com", "Headquarters": "Dallas, TX", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Pershing, GSEC"}, "estimatedSalary": "136000", "jobDescription": " Apex Clearing was brought to life by the idea that the development of integrative technology can improve how business is done. The passion for that idea powers our firm still. As a Data Scientistat Apex you are free to explore unique solutions and try fresh ideas that may benefit our financial services business. Youll collaborate with Apex's sharpest minds to use data to drive business decision making. Working at Apex Clearing means that youll always be presented with a variety of new possibilities as you continue to enhance your skills. Were looking for someone who:Is passionate. You have a genuine passion for data, modeling and analysis to drive decision making across all levels of the business. You love using technology differently to maximize insight and business impact and you have a way of bringing out that same fire in the people you work withIs motivated. Youre driven to be the best whether thats decreasing onboarding time or making an innovative change to how its always been done. You challenge yourself by setting goals and exceeding themIs collaborative.Youre excited to work with fellow data junkies and big thinkers. You know how to collaborate across the organization and communicate with less technical team members to find a solution to pain pointsWants to make an impact. Youre looking to do amazing work. Youre all about using technology to improve efficiency and effect the company's bottom line.What youll do all day:Defining and analyzing data that will generate insights and help support our core businessBuilding state of the art modelsActing as a thought leader for the firm with your ideas and projects enabling data driven decision makingHelping to define best practices within our analytics team to increase efficiency and thus create even more business impact.Collaborating with Analytics team members and people across the business to get the best out of the collective teamA few reasons why you might love us:Were a leader in the space.Apex is recognized for disrupting the financial services industry, enabling fintech standouts like Stash, Robinhood and Betterment. Weve got an amazing track record of success and we foster ongoing innovation. So you get all the benefits of a proven, growing company, while enjoying a very entrepreneurial cultureWe see data analytics differently. Youll work with people who apply innovative approaches to analysis and modeling. We are passionate engineers dedicated to finding new and different ways to use technology and data to drive the business forward.Your work will have immediate impact. Youll be able to see your direct impact on our business. You wont be just another talented analyst chained to a desk or ticket queue.And a few reasons why you may not like working for us:You dont like change. This is not a job for someone who likes predictable. We embrace and drive the business toward needed change for our future success.Youre not the collaborative type. We work together to ensure the best possible solutions for the business. We think two brains are better than one so we do most of our work together and often with other departments. Team work makes the dream work on this team.Youre not a people person. We work with people across the organization to understand the data from a business perspective and ensure our results will be actionable by Apex.The skills youll need to succeed:0-3 years working as a Data Scientist, Quantitative Analyst or comparable experienceExperience with MS ExcelExperience with SQL and Python or RExperience with relational databasesExperience with statistical analysis techniquesFamiliarity with Sisense, Tableau or similar Data visualization tools"}