{"jobID": "2828110017", "jobLocation": "Dunfermline_Scotland", "jobTitle": "Data Engineer", "companyRating": "3.3", "companyInfo": {"Website": "www.tuigroup.com", "Headquarters": "Hannover, Germany", "Size": "10000+ employees", "Founded": " 2014", "Type": " Company - Public (TUIJ) ", "Industry": " Travel & Tourism", "Revenue": " Unknown / Non-Applicable", "Competitors": " Thomas Cook, Kuoni Group"}, "estimatedSalary": "95000", "jobDescription": " Joining the Retail Websites team in Thornaby-on-Tees, as a Data Engineer you will bring your experience of designing, building, testing and maintaining complex data management systems to a rapidly growing part of our travel business.  The TUI Retail websites include Holidayhypermarket.co.uk, Latedeals.co.uk, Cruisedeals.co.uk and a range of corporate websites – all offering fantastic ATOL protected holidays at guaranteed best online prices. Retail websites is an exciting and rapidly growing area of the business where team members work together to produce innovative solutions and explore new technologies in order to move the business forward.What You Will Be DoingYou will be responsible for ensuring that the key data systems within the Stockton-On-Tees side of the business are well maintained, optimized for high performance throughput and structured to enable easy analysis. These systems are hosted on Amazons AWS infrastructure and are required to support enterprise level scale, reliability and performance.  The successful candidate will play a central role within the ‘DevOps and Data Intelligence’ team and will be required to support the wider business with data analysis queries and enable self-service BI. The candidate will be expected to work across a number of different data / infrastructure technologies and be able to adapt and learn new technologies when required.  On a day to day basis you will be responsible for the importing and processing of 100’s of GB of data from a number of separate systems including flat files, Restful API’s and our internal platforms. You will play a key role in maintaining, securing an updating our key data systems (Sql Server, Splunk, Solr, MySql) and ensuring the disaster recovery, performance and capacity plans are regularly review and updated on existing systems. For new data related projects you will be responsible for requirements gathering, system architecture, implementation and on-going maintenance.  You will be heavily involved in the planning, implementation, maintenance and continual monitoring and patching of our data warehouse. You will investigate issues identified by role holder, or reported by stakeholders and use your initiative to create solutions. You will liaise with stakeholders to gather requirements for new functionality and use your initiative to build solutions that are fit for purpose. You will analyse system and business data to identify trends and report insight that will be used to inform business decisions.What We Are Looking ForEssential SkillsExperience of RDMS, such as MS SQL Server, Oracle, MySQLExperience of creating reports using Excel or equivalentProficient in server side programming language such as Java or C#Knowledge of Google AnalyticsKnowledge of RESTful API integrationStrong knowledge of Data WarehousingAble to design, build, test and maintain data management systemsStrong enthusiastic team player with well-developed interpersonal skillsPreferred Experience:Experience of SolrExperience of SplunkExperience building Data Warehouses using SQL Server and SSISExperience creating reports using PowerBIExperience of C# and MVCExperience with B2B and B2CExperience scripting in Bash and Powershell Working Within TUI GroupTUI UK and Ireland is the UK’s largest holiday company with key brands including TUI, First Choice, and Crystal Ski Holidays. Products include Sensatori, Sensimar, and Family Life, as well as First Choice Holiday Villages and SplashWorld Resorts. Our airline, TUI Airways is the UK’s third largest airline with 62 aircraft operating to over 88 destinations in 30 countries. We have a team of more than 10,000 employees serving over 5.5 million customers each year.  TUI UK and Ireland is a member of TUI Group, the world’s number one integrated tourism group. Covering the entire touristic value chain under one roof we employ 63,000 people in over 100 countries and offer 20 million customers comprehensive services in around 180 destinations worldwide.  Help make our customers smile and in return you will receive a competitive salary, pension scheme and further benefits such as generous holiday discounts, great rates with foreign exchange and discounts with retailers."}