{"jobID": "2811738556", "jobLocation": "Morris_Plains_NJ", "jobTitle": "Entry Level Quality Control/Environmental Monitoring Scientist", "companyRating": null, "companyInfo": {"Website": "www.eurofins.com", "Headquarters": "Hasselt, Belgium", "Size": "5001 to 10000 employees", "Founded": " 2000", "Type": " Company - Public (ERF) ", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Eurofins Lancaster Laboratories is searching for a Entry Level Quality Control/Environmental Monitoring Scientist to support our Professional Scientific Services group in Morris Plains, NJ.  Entry Level Quality Control/Environmental Monitoring Scientist responsibilities include, but are not limited to, the following : Execute method qualification/optimization of methods. Perform micro/EM testing such as environmental monitoring, gram stain, and sterility. Perform subculturing, growth promotion, serial dilutions, and cryopreservation. Perform all testing and activities compliantly following appropriate SOPs and procedures. Executes and follows SOPs and quality policies. Collects and generates data for trend reporting. Monthly review of laboratory logbooks and monthly laboratory cleaning. Maintain controls and reference standards to support testing. Maintain input to keep LIMS current. Verify the accuracy of data generated. Review/approve data generated by other team members. Contributes to assigned projects by following pre-defined tasks and executing as instructed. Contributes to investigations by partnering with Scientist and/or Senior Scientist. Participate in OOS/OOE investigation . Participate in deviation investigation/CAPA implementation in a timely manner Interface with regulatory agencies during audits. Knowledge of LabWare LIMS and/or other QC data systems. Knowledge of appropriate GMP/GLP quality systems (eSOPs, TEDI, etc). Plan and schedule activities. The ideal candidate would possess : 0 - 5 years of relevant experience in the pharmaceutical, biologics, microbiology, sterile manufacture, or medical device industry. Strong aseptic technique working within a BSC. Knowledge of cGMP and an understanding of the concepts of GLP, good clinical practices and FDA guidelines, applicable state and foreign regulations, and standards routinely used in the industry (i.e. ANSI, ISO, etc.). Thorough knowledge of microbiological test methods. Knowledge of LIMS systems. Ability to communicate clearly with a variety of individuals in various aspects of Novartis operations. Detail-oriented with expertise in problem solving and solid decision making abilities. Strong interpersonal skills which include a professional demeanor when interacting with Novartis personnel. Sound, practical and appropriate regulations with regards to Novartis Strong written and verbal communication skills are essential Strong computer, scientific, and organizational skills Excellent communication (oral and written) and attention to detail Ability to work independently and as part of a team, self-motivation, adaptability, and a positive attitude Ability to learn new techniques, perform multiple tasks simultaneously, keep accurate records, follow instructions, and comply with company policies Basic Minimum Qualifications : Bachelor's degree in biology, chemistry, biochemistry, microbiology, or other related degree concentration, or equivalent directly-related experience (two years of directly related industry experience is equivalent to one full-time year of college in related major) Authorization to work in the United States indefinitely without restriction or sponsorship Position is full-time, with the shift either Sunday-Thursday, Monday - Friday, or Tuesday-Saturday with hours being 8 a.m.-5 p.m. with overtime and occasional weekend work as needed. Candidates currently living within a commutable distance of Malvern, PA are encouraged to apply.  As a Eurofins Lancaster Labs employee, you will become part of a company that has received national recognition as a great place to work. We offer excellent full-time benefits including comprehensive medical coverage, life and disability insurance, 401(k) with company match, paid holidays and vacation, personal days, and dental and vision options.  To learn more about Eurofins Lancaster Laboratories, please explore our website www.eurofinsus.com  Eurofins is a M/F, Disabled, and Veteran Equal Employment Opportunity and Affirmative Action employer."}