{"jobID": "2667899617", "jobLocation": "Houston_TX", "jobTitle": "Data Analyst 3", "companyRating": "3.0", "companyInfo": {"Website": "www.applus.com", "Headquarters": "Barcelona, Spain", "Size": "10000+ employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "60000", "jobDescription": " Company BioApplus+ is a global leader in the Testing, Inspection and Certification sector delivering non-destructive testing, inspection, engineering, and manpower services to the aerospace, power, and, oil and gas industries. We are a trusted partner who enhances the quality and safety of our clients’ assets and infrastructures while safeguarding their operations. We deliver this through our technical capabilities, innovative approach, and our motivated team who are committed to operational excellence.  Applus+ has achieved a significant global presence and a leading position in its target markets and regions. As a result, our teams have expanded with 19,000 professionals across the world, attracting the very best talent in the industry.Together beyond standards.  Equal Employment Opportunity/M/F/disability/protected veteran status.Position Purpose The main function of the Data Analysis 3 is to perform analysis, review, reconciliation and/or entry of inspection or maintenance-related data into commercial or proprietary data management systems. Duties and Responsibilities Support technicians’ efforts to generate reports in a timely manner.Generate draft and final reports using proprietary software.Review reports/make edits to reports.Issue document revisions in a controlled manner.Track status of reports.Follow up with clients and technicians regarding reports and the status of reviews.Organize/archive electronic data/records/reports.Manage the reporting database (iDart, SQL, Visions, Ultrapipe, PS AIM, etc).Create report setup files. In scope.May require some travel to client field locations.Use various data management systems to maintain customer records.Code information for entry into data management systems.Compile, sort and verify the accuracy of data before it is entered.Compare data with source documents, or re-enter data in verification format to detect errors.Store completed documents in appropriate locations.Locate and correct data entry errors, or report them to supervisors.Maintain logs of activities and completed work.Maintain a strong customer service focusMaintain records of applications made.Update operational records using computer terminals.Inform customers by mail or telephone of additional steps they need to take to obtain data.Perform routine data entry and other office support activities, including creating, sorting, photocopying, distributing, and filing documents.Must maintain a strong focus on cross functional teamwork with both internal and external stakeholders.Enforce and abide the requirements of safe operation and personal safety using required PersonalProtective Equipment and Safe Practices per company policy.Perform other job related tasks as assigned by management. Supervisory Responsibilities Not Applicable Knowledge and Skills Must have analytical capabilities for customer needs assessment and solutions identification.A sense of urgency, good attention to detail, and follow-thru.Demonstrates a systematic approach in carrying out assignments. Is very orderly and excels at cutting through confusion and turning chaos into order.Knowledge of Industry Codes.Firmly adheres to the values and ethics of Applus+. Exhibits honesty, discretion, and sound judgment.Possess excellent communication skills to convey information to customers and colleagues effectively.Willing to work with others, collaborating and compromising where necessary; promptly share relevant information with others.Maintains a positive “can do” outlook, rebounds quickly from frustrations and unpleasantness, and maintains composure and friendly demeanor while dealing with stressful situations.Ability to organize, prioritize, and perform multiple tasks with minimal supervision.Strong computer skills, including Microsoft Office.Inspection database knowledge.Demonstrates a strong ability to identify, analyze and solve problems.Must be decisive in handling difficult problems and translate problems into practical solutions.Shows willingness and aptitude to use own discretion in taking appropriate steps in finding solutions to problems; presents options and ideas to enhance current processes or procedures. Takes on additional responsibility when both big and small tasks need to be completed. Education and Work Experience High School Diploma or Equivalent.5+ years’ experience analysis, review, reconciliation and/or entry of inspection or maintenance-related data into commercial or proprietary data management systems.Credo, Visions, Ultrapipe, PS AIM, Miridiam, I-Dart, SQL, etc. Certificates and Licenses Required Must meet minimum company requirements to operate a company vehicle and be eligible for coverage under Company insurance program. Physical Activities and Requirements The ability to listen to and understand information and ideas presented through spoken words and sentences.The ability to read and understand information and ideas presented in writing.The ability to communicate information and ideas in writing so others will understand.The ability to choose the right mathematical methods or formulas to solve a problem.The ability to see details at close range (within a few feet of the observer).The ability to communicate information and ideas in speaking so others will understand.The ability to tell when something is wrong or is likely to go wrong. It does not involve solving the problem, only recognizing there is a problem.The ability to add, subtract, multiply, or divide quickly and correctly.The ability to arrange things or actions in a certain order or pattern according to a specific rule or set of rules (e.g., patterns of numbers, letters, words, pictures, mathematical operations).The ability to identify and understand the speech of another person.In compliance with American with Disabilities Act (ADA), Applus+ will make reasonable accommodations that are appropriate and consistent within our legal obligations. Working Conditions The physical environment requires the employee to work both inside and outside in heat/cold, wet/humid, and dry/arid conditions in temperature extremes and inclement weather. Frequently required to use personal protective equipment to prevent exposure to hazardous materials and working environmentMay occasionally walk on slippery or uneven surfacesThe noise level in the work environment is frequently loud when working on project site.Overtime required during the week and weekend with work volumeAbility to travel when required, nationally, up to 10% of the time."}