{"jobID": "2822390634", "jobLocation": "Glenview_IL", "jobTitle": "Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.itw.com", "Headquarters": "Glenview, IL", "Size": "10000+ employees", "Founded": " 1912", "Type": " Company - Public (ITW) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "65000", "jobDescription": " Job Description Position at ITW CorporateThe Data Analyst willsupport the corporate HR department in the management and analysis of multiple data sources and programs interacting internally with Workday (HRIS), Payroll, Finance, Legal and externally with multiple vendors (e.g. Blue Cross/Blue Shield, CVS/Caremark, IBM Watson, Empyrean Benefit Solutions, etc.). Serve as key liaison with ITW Finance and external actuaries and accountants on data integrity, reconciliations and submissions. Additionally, support compliance efforts keeping abreast of federal tax and benefits laws related to critical and time-sensitive reporting and filing. Contribute to a wide range of complex projects involving the design, financing, delivery and management of health and welfare benefit programs including medical, wellness, dental, life, disability and leaves. Duties:Understand the system flows (data interface from the HR and payroll systems, transmission of information to outside parties)Understand and improve existing internal data flow and develop/implement new data flows where necessary for plan operationsCompile data from multiple sources and varied formats as required for FAS census, audits and health and welfare plan operations and analysisDevelop working relationships with vendors and key stakeholdersProcess confidential data and information per organizational guidelinesProvide timely and accurate routine and ad hoc reportsManage Health Plan Data Warehouse (IBM Watson/Truven Advantage Suite) including vendor data oversight, queries, reports and analysisDevelop plan financial/operational dashboards, implement and executeCoordinate plan information with Financial Accounting, actuaries, and government required reportingTroubleshoot data issues with vendors and internal stakeholdersManage transmission and receiving of encrypted data with external vendorsRequirements:Bachelor’s degree in Mathematics, Statistics, Finance or related discipline.2-5 years of experience with data managementExpertise in Microsoft Excel and Access, excellent computer skills in other Office applicationsDetail oriented with ability to manage and document data across multiple platformsAbility to map data and translate raw data output into usable reportsTeam player with proven track record of managing projectsAbility to research and troubleshoot issues associated with data and benefits administrationProblem solving and analytical thinkingAbility to manage multiple priorities and deadlinesStrong communication skillsAbility to effectively use technology to best meet the needs of HR staff and employeesExperience with a data warehouse (e.g. IBM Watson/Truven Health) a plusFamiliarity with employee benefits administration and HRIS systems (e.g. Workday, PeopleSoft) a plusEEO is the Law Applicants and employees of ITW are protected under Federal law from discrimination on several bases. Follow the link above to read more.If you are a qualified individual with a disability and are unable or limited in your ability to use or access the online application system process due to your disability, please click corp_accessibility@ itw.com to request assistance. No other requests will be acknowledged. ~ITW~LI-LM1"}