{"jobID": "2832004084", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Analyst", "companyRating": "3.0", "companyInfo": {"Website": "www.gimbal.com", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " GroundTruth, Placed, Verve"}, "estimatedSalary": "63000", "jobDescription": "About the Company Gimbal is a marketing and advertising automation platform powered by physical-world data. Using its own hardware and software, Gimbal enables brands, media agencies, and marketers to deliver relevant messages in order to improve marketing communications and measure the effectiveness of their campaigns. Powered by its always-on location SDK, micro-location BLE beacons, and a complete mobile advertising stack, Gimbals suite of tools generates hyper-accurate location data that allows brands to target consumers more effectively and attribute their spend via actions in the physical world. Gimbal is headquartered in downtown LA with offices in San Diego, New York City, San Francisco, Chicago, and Sao Paulo. · 7 Years in development · $90M Invested · Over 10,000 end customers Gimbal formed when two independent companies merged in November 2016. The Mobile Majority was founded in 2012 to build a cohesive mobile advertising platform and Gimbal, Inc. was spun out of Qualcomm in 2014 with an emphasis on its industry-leading beacon hardware and proximity management software. Together, the company is the most comprehensive location-based software and hardware provider in the country, and we are looking to add a few acts to our all star line up.Accolades include: · Inc. Magazine ranked Gimbal, Inc. number 66 on its 35th annual Inc. 5000, an exclusive ranking of the nations fastest-growing private companies of 2017. · Fastest Growing Technology Company in LA for 2016 · Best Creative Technology by the 4As. Gimbal is led by a team of experienced serial entrepreneurs and media industry veterans - all with a shared passion for eliminating what clients have identified as the biggest issues in mobile today. We believe this offering can lead us to a multi-billion liquidity event via acquisition or IPO.About the Job Our team is growing, and we are looking for an experienced Data Analyst to join our Data Operations team. As a Data Analyst at Gimbal, you will be a key member of a growing team focused on the execution, analytics, and measurement of innovative mobile advertising campaigns that drive results for our clients. Our data platform is built on Druid, Redshift, and other modern database technologies and uses Tableau, Pivot, and Periscope to visualize and analyze the data. ResponsibilitiesAs a Data Analyst, you will be: Building, analyzing, and discussing data learnings/trends from our robust data platform Building reporting visualization templates and dashboards utilizing business intelligence software including Tableau, Pivot, and more Working with and updating machine learning models Collaborating with internal departments including Sales, Account Management, Ad Operations, Engineering, Product and Business Development Understand high-level business goals of the company and its customers and translate them into actionable and impactful reporting and analyticsRequirements 3+ years experience in Data Analysis role or equivalent, preferably in technology Superior quantitative and analytical skills Experience building visualizations in Tableau or other data visualization platforms preferred Experience working with Druid, Redshift or other modern database models preferred Proficient in Microsoft Excel and/or Google Spreadsheets Digital Media/Advertising experience preferred Motivated individual, with a positive attitude, who can consistently strive to exceed expectations Excellent problem solving skills Project management experience Excellent communication skills, both written and verbal Attention to detail and highly organized Use data to effectively tell a clear story Intellectual curiosity Bachelor/Masters degree in Computer Science or Business/Finance with analytics background A passion for building automation into process and procedure A passion for getting shit doneBenefits 100% company paid medial/dental/vision coverage Life Insurance and a 401(k) savings plan Unlimited PTO Fully stocked kitchen including unlimited La Croix (while supplies last) Dog friendly office Bumper pool Beautiful views of Downtown Los AngelesPlease note, to be considered for the role you must complete all application questions."}