{"jobID": "2730912370", "jobLocation": "College_Station_TX", "jobTitle": "Associate Research Scientist", "companyRating": null, "companyInfo": {"Website": "www.tamuct.edu", "Headquarters": "Killeen, TX", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " College / University", "Industry": " Education", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Associate Research ScientistA&M; System Member : Texas A&M; EngineeringDepartment : Electrical EngineeringJob Category : Other or Not SpecifiedJob Type : StaffLocation : College Station/BryanProposed Minimum Salary : CommensurateJob Requisition Number : R-004553Security Sensitive? : YesJob TitleAssociate Research ScientistAgencyTexas A&M; EngineeringDepartmentElectrical EngineeringProposed Minimum SalaryCommensurateJob LocationCollege Station, TexasJob TypeStaffJob Description Operate and/or supervise the operation of the E-beam Lithography (EBL) system, Focused Ion Beam (FIB) system, and Helium Ion Microscope (HIM) nanopatterning system; including scheduling and billing for services and performing routine maintenance, including making sure that supplies are ordered. Instruct users in the operation and in the theory of nano-patterning using EBL/FIB/HIM, projection and parallel plate mask aligners in the lithography lab. Teaching at an annual workshop. Aid in the interpretation of the results when requested. Develop improved procedures for the patterning of samples, including establishing and maintaining a baseline recipe; Schedule services and perform routine maintenance, including making sure that supplies are ordered; Instruct users in the operation and in the theory of nano-patterning using EBL, FIB, and HIM.Conduct research using the nanopatterning tools usually in conjunction with faculty members at TAMU, but potentially with other institutions and industry, and co-author the results and aid in the interpretation of the results when requested;Instruct microscope researchers in the use of computer software on other platforms in order to facilitate and/or extend the interpretation of quantitative, qualitative, and digital imaging data sets produced and acquired on the EBL, FIB, and HIM.Work with tool vendors in developing tool operations and performance; remaining informed of new programs useful in EBL/FIB/HIM processing, and making users aware of these programs as pertinent to their researchOther duties as assignedRequired Education: An appropriate doctoral degree or an equivalent combination of relevant training and experience. Required Experience: 3 years of related experience. Preferred Education: Ph.D. in Materials Science and Engineering, Electrical Engineering, Chemistry, Physics or related science/engineering major. Preferred Experience: 3 years’ experience in the theory, use, and operation of other nanofabrication tools in cleanroom environment.  All positions are security-sensitive. Applicants are subject to a criminal history investigation, and employment is contingent upon the institution’s verification of credentials and/or other information required by the institution’s procedures, including the completion of the criminal history check.  Equal Opportunity/Affirmative Action/Veterans/Disability Employer committed to diversity."}