{"jobID": "2791030678", "jobLocation": "Mountain_View_CA", "jobTitle": "Signal Processing & Algorithms Engineer for a forward thinking group of Researchers, Designers, Scientists, and Engineers", "companyRating": null, "companyInfo": {"Website": "www.osiengineering.com", "Headquarters": "Campbell, CA", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "JOB DESCRIPTION: Seeking a Signal Processing & Algorithms Engineer for a forward thinking group of Researchers, Designers, Scientists, and Engineers in Mountain View, Ca.  Summary  You will join a team of electrical, computer engineering, signal processing, machine learning, computer vision, visual design, interaction design, industrial design, optics, physics experts.  You will create products that will impact the lives of millions, and we believe that the first step on the path is to show real prototypes. ResponsibilitiesSolve tough engineering problems, and work with other engineers to integrate cutting-edge functionality into novel prototypes.Design, develop, optimize, or tune algorithms to solve interesting problems in hardware, data science, or sensor design.Maintain constant awareness of technologies, scientific developments, design software and hardware capabilities, as well as software tools to make the prototype function.Work closely with various core tech teams and other organizations to define prototyping scope and applications towards various technology roadmaps and product. Must Have Skillset 3+ years of experience of developing signal processing algorithms in real-world or comparable settings.Strong track record of digital signal processing and algorithm development experience (Examples include Digital Filters, Frequency/Waveform Synthesis, and Adaptive Signal Processing, convex optimization, time-series analysis and others).Understanding of multi-target detection, tracking techniques, signal analysis and estimation techniques.Strong coding and programming skills (C/C++, MATLAB/Python).Experience in developing and optimization algorithms running on DSP and ARM processors. Desired Skillset Experience with system software on embedded devices is a plus.Experience with Android/Linux system software is a plus. Location: Mountain View, Ca  Type: Full Time CONTACT INFORMATION: Alan Bui  alan@OSIengineering.com  408-550-2800 Ext: 106 OSIJOBS"}