{"jobID": "2738320812", "jobLocation": "Chicago_IL", "jobTitle": "Senior Data Engineer", "companyRating": "4.6", "companyInfo": {"Website": "www.strikesocial.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "133000", "jobDescription": "What we do Strike Social harnesses the power of artificial intelligence to drive the best outcomes in YouTube and social media advertising. Through media-buying software and service, Strike Social manages 15,000+ campaigns each day for the worlds leading agencies and brands, including Beats, Xbox, Honda, Mattel, Lionsgate and Trunk Club. With a workforce presence in 16 major markets including headquarters in Chicago and offices in Kraków and Manila Strike Social was recently named the No. 17 fastest-growing private company in the U.S. by Inc. Magazine. Learn more at strikesocial.com. How do we do it We are a growing team of independent thinkers who bring their diverse talents and backgrounds to help build a programmatic media-buying platform. We work in an agile environment, and frequently pair program to improve collaboration and software quality. We are polyglots and youll see us use languages and frameworks like Python, Typescript, Angular2, Flask, and Pandas. Our infrastructure relies on Nomad, Terraform, Consul, Vault, Nginx, Redis, Postgres, Redshift, and Auth0. Job Description You are a passionate engineer who loves solving the worlds problems with state of the art technology. Youve got solid coding chops, and have demonstrated an ability to identify and learn new tools, languages and technologies. You welcome feedback and use it as a way to improve your own skills and methods. You are a mentor and understand the value in helping and developing others. You are pragmatic and know how to strike a balance between building long-term value in software, and meeting business goals in a timely fashion.  If you are passionate about building large scale data processing systems and are motivated to make an impact in crafting next-generation data architectures, we would love to talk to you. ResponsibilitiesBuild data pipelines to automate the ingestion, transformation, validation, and augmentation of structured and semi-structured dataAdvance the data architecture, ensuring commitment to architectural and industry best-practicesOwn and extend the data pipelines through the collection, storage, and processing of large datasetsPartner with Data Scientists, Software Engineers, and business groups to develop enhancements to the data platform, including data processes, data warehouses, and data pipelinesCollaborate with Data Scientists to implement machine learning algorithmsGuide engineering and business teams to understand and consume the data sets to drive improved decision-making and analytical capabilitiesContribute to the engineering culture, and mentor other software engineers within the teamSkills & Qualifications5 or more years of experience in the design and development of data pipelines, data marts, and data warehousesProficient in at least one programming language such as Python, Java, Go, or RubyStrong understanding of ETL processing with large data storesExperience working with ETL systems like Airflow, Spark, Talend, Alooma, or NifiStrong understanding of stream processing services such as Kafka, Kinesis, Apache Storm, or Spark StreamingExpertise in working with and modeling data in varied forms, including relational, columnar, flattened, and dimensional data storesExperience designing and implementing business-critical data pipelines by leveraging modern big data architectures to satisfy real-time and batch processing requirementsProficient in creating and tuning data queriesStrong communication skills and ability to collaborate across the engineering teamA proven record of personally taking large data projects from ideation to implementationWorking at Strike Social Strike Social is a close-knit, work-hard/play-hard environment. If you want a fun, challenging and rewarding experience, apply to join our team! Aside from standard (and generous) employee benefits, Strike offers unlimited PTO, an open office environment, casual dress code, a spectacular Loop location and frequent team outings.  We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status or disability status."}