{"jobID": "2831506666", "jobLocation": "San_Francisco_CA", "jobTitle": "Regional Vice President, Sales (West Coast)", "companyRating": null, "companyInfo": {"Website": "www.shyftanalytics.com", "Headquarters": "Waltham, MA", "Size": "51 to 200 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "SHYFT Analytics is looking for a talented, top performing Regional Vice President (RVP) of sales who will be in charge of overseeing the regional sales processes for the Western Region based out of our San Francisco offices. The RVP will be tasked with implementing regional sales strategies to increase productivity and ensure overachievement of sales goals. They will also actively lead new account prospecting and implementing prospecting rigor to generate sales and create a predictable sales forecast. The RVP will contact new and existing customers to demonstrate the value of their company's products or services and ensure there is an excellent customer experience to increase the possibility of repeat business. To that end, the RVP of the Western Region will lead Account Management resources as well as sales to ensure healthy upsell value while also minimizing churn. Finally, the RVP will be the face of enterprise selling within the region to ensure the cultivation and growth of senior executive relationships and multi-faced enterprise selling cycles.Ten plus years of experience with enterprise and mid-market selling as well as a bachelor's degree in marketing, business administration, or a related field is necessary for this position. In addition, previous experience in a regional sales capacity is preferred. The RVP of sales must be organized individual, pay close attention to detail especially as it relates to daily forecasting and have strong interpersonal skills to tackle sales obstacles with innovative solutions. They must be able to work in fast-paced environment and have excellent multitasking skills. The RVP must work well in a team setting to achieve all company sales objective in a timely manner, as well as perform effectively on their own with minimal supervision.What's In It For You?The RVP role is one of the most rewarding and influential roles within a revenue execution team. Some highlights for “What you get” with the SHYFT RVP of Sales role are:Attract, hire, motivate and grow a regional revenue “A-Team” with highly-consultative sales and account management leaders focused on enterprise and mid-market Pharma and Life Sciences accounts.Directly contribute to the long-term success of SHYFT by rapidly expanding an already impressive market presence with commercial pharma and life sciences solutions.Expand our market presence in the region for cutting-edge Real-World Evidence (RWE) solutions that are taking the market by storm.Innovate with and grow a “Who’s Who” list of Pharma and Life Sciences customers.Expand your sales and account management acumen with a leadership team that enables your growth and success.Competitive compensation and benefits that reward hard work and places no cap on your financial and career success.Key Responsibilities:"}