{"jobID": "2829232988", "jobLocation": "Rockville_MD", "jobTitle": "Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.icf.com", "Headquarters": "Fairfax, VA", "Size": "5001 to 10000 employees", "Founded": " 1999", "Type": " Company - Public (ICFI) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Booz Allen Hamilton, Abt Associates, Oliver Wyman"}, "estimatedSalary": "61000", "jobDescription": "Working at ICF Working at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. If you’re seeking to make a difference in the world, visit www.icf.com/careers to find your next career. ICF—together for tomorrow. Data AnalystHealth, Research, Informatics and TechnologyRockville, MD Are you passionate about improving quality of life through disease prevention, health promotion, and the care of chronic health conditions? Then consider ICF. We work at the forefront of today’s global health issues, helping clients understand the specific needs of diverse populations and address complex health challenges with behavior and disease surveillance and monitoring, research and surveys, training and technical assistance, and informatics and systems. Job Description: The Health, Research, Informatics and Technology Division (HRIT) is currently seeking a Data Analyst to support CDC's National Program of Cancer Registries - Cancer Surveillance System (NPCR-CSS) projects in Rockville, MD. Key Responsibilities:Performs routine data analysis/programming activities according to project specificationsWork on projects and/or project tasks with supervision by the senior staff or designeeContribute to the delivery of quality contract deliverables according to specified requirements and timelines.Keep an accurate accounting of all task assignment activitiesParticipates in the design, coding, testing, debugging, documentation, and maintenance of computer programsBasic Qualifications: Master's Degree in public health, statistics, social sciences, computer science, or related fieldsHands on experience in the use of SAS, R, Python, SQL, or equivalent software tools - Expose in data collection, data management and data analysisPreferred Skills/Experience:Experience in manipulating public health data setsExperience working for a private or a public entity supporting government contractsUnderstanding basic statisticsExperience in data visualization tools (Tableau, Qlik, etc.)Professional Skills:Strong analytical, communications, and technical writing skillsStrong verbal, interpersonal and written (writing and editing) communication skills, with technical writing proficiency - Organization and time management skillsAttention to detailTeam player with sound judgmentAbility to multi-task in a fast-paced environment ICF offers an excellent benefits package, an award winning talent development program, and fosters a highly skilled, energized and empowered workforce. ICF is an equal opportunity employer that values diversity at all levels. (EOE – Minorities/Females/ Protected Veterans Status/Disability Status/Sexual Orientation/Gender Identity) Pay Transparency Statement: For more information, please click here: https://www.dol.gov/ofccp/pdf/pay-transp_formattedESQA508c.pdf Working at ICF Working at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. ICF—together for tomorrow.  About ICF ICF (NASDAQ:ICFI) is a global consulting and technology services provider with more than 5,000 professionals focused on making big things possible for our clients. We are business analysts, policy specialists, technologists, researchers, digital strategists, social scientists and creatives. Since 1969, government and commercial clients have worked with ICF to overcome their toughest challenges on issues that matter profoundly to their success. Come engage with us at icf.com.  Rockville, MD (MD18)"}