{"jobID": "2786672827", "jobLocation": "Mill_Valley_CA", "jobTitle": "Senior DevOps Engineer (Big Data)", "companyRating": "4.1", "companyInfo": {"Website": "www.glassdoor.com", "Headquarters": "Mill Valley, CA", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Indeed, LinkedIn"}, "estimatedSalary": "134000", "jobDescription": " Looking for your next challenge? How about helping us disrupt a $90B+ talent acquisition market! Glassdoor is the world’s fastest growing career community with more than 40M members and thousands of business customers and our mission is helping people everywhere find jobs and companies they love.  We are looking for a talented engineer to join our growing data engineering team. The ideal candidate has significant experience in building scalable data platforms that enable business intelligence, analytics, data science and data products. You must have strong, hands-on technical expertise in a variety of technologies and the proven ability to fashion robust, scalable solutions. You should have a passion for continuous improvement and data quality.  We embrace a wide variety of technologies and work very closely with data engineers and scientists to deliver end to end solutions. If you are interested in a fast paced environment, the latest technologies, and fun data problems, come join us! Responsibilities:Automate application and infrastructure deploymentsInstrument monitoring and alertingManage security following the infosec group’s best practices and recommendationsGuide engineering teams on infrastructure choices, sizing and costProvide operational support to engineering teamsCreate and maintain infrastructure and process documentationContribute to the data platform roadmap along with engineering leadershipEvaluate open source technologies to continually enhance our stack and processesKey Qualifications:4+ years of hands on experience in devops role2+ years working in a “Data Platform Environment” (Hadoop, Presto, Kafka, etc.)Experience working with automation tools such as Ansible, Saltstack, and TerraformStrong knowledge of AWS platform and technologies (EC2 , S3, IAM, et)Experience working with JenkinsDeep understanding of version control systems (git), including branching and merging strategiesExperience with programming languages: Python, Java, Scala, Node, etc.Expert knowledge of the Unix shellWorking experience with directory and authentication protocols such as LDAP and SAMLCapable of delivering on multiple competing priorities with little supervisionExcellent verbal and written communication skillsBachelor's degree in computer science or equivalent experienceNice To Have:Experience working with Airflow and managing DAG deploymentsBe passionate about or have contributed to open sourced engineering projects in the pastWhy Glassdoor?Work with purpose – join us in creating transparency for job seekers everywhereGlassdoor gives back! Glassdoor is a Pledge 1% member; all employees receive 3 paid volunteer days per year100% company paid medical/dental/vision/life coverage; 80% dependent coverageLong Term Incentive PlanSunny & peaceful Mill Valley offices located right on the waterWalking, running and biking trails steps away from the officeOnsite gym and fitness classesFree catered lunch; new menu dailyPaid holidays and flexible paid time offYour choice between Mac or PCDog-friendly office (with dog-free zones if you are so inclined)Free parking Glassdoor is committed to equal treatment and opportunity in all aspects of recruitment, selection, and employment without regard to gender, race, religion, national origin, ethnicity, disability, gender identity/expression, sexual orientation, veteran or military status, or any other category protected under the law. Glassdoor is an equal opportunity employer; committed to a community of inclusion, and an environment free from discrimination, harassment, and retaliation."}