{"jobID": "2835006879", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Engineer - ETL / Data Pipeline", "companyRating": "3.9", "companyInfo": {"Website": "www.chartboost.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "108000", "jobDescription": " Do you want to work as part of the Data & Targeting team dealing with 5 billion+ events a day and terabytes of mobile game data? Are you interested in real time aggregations over rolling time windows, blazing fast computation speeds across crazy amounts of data, data analysis, data science, data exploration? If you're interested in sharpening your skills on the newest big data tools like Airflow, Spark, Hive, Scala and Python and love to think about problems like game to game affinity, retention cohorts, and funnel analysis, then Chartboost is the place for you. Being part of a startup, you would be part of a small team and drive significant impact across every corner of the company.  We are seeking data pipeline engineers to join our team, helping to build and maintain a data platform that supports data analysis, exploration, aggregation, and apis delivering significant impact to both our game developers and internal customers. In this role, you are expected to be comfortable working as a data engineer and dealing with huge amounts of data (hundreds of TBs).  Our technology stack includes Spark, Presto, Hive, Kafka, Cloudera, Redshift, Dynamo, Cassandra, Airflow, HDFS, HBase, Scala, Python, MySQL, MongoDB, AWS, Git, Spinnaker, and Puppet. You have the opportunity to evaluate new technologies and use them to design better and more reliable systems. Who we are: Chartboost is the largest mobile games-based ad monetization platform in the world. We reach an audience of over 900M unique users every month across more than 300,000 mobile games and work with 90% of the top grossing iOS and Android game developers, globally. The Chartboost SDK is the highest-integrated independent mobile ad SDK and through Chartboost Exchange, Ad Network, and other services, we empower developers to build businesses, while connecting advertisers to highly engaged audiences. What youll do:Develop reliable data pipelines that convert data into powerful signals and featuresDesign real time and batch data processing pipelines for different systems to consumeDevelop tools to monitor, debug, and analyze data pipelinesDesign and implement data schemas and models that can scale for hundreds of millions of usersCollaborate closely with product team to build new features and infrastructureWho you are:2+ years of experience in Data Warehousing, and SQL2+ years of experience in programming in any of Python / Java / ScalaExperience with data pipelines in Hive, HDFS processing larger than 10TB of data is a plusExperience working in cloud environments, ideally with AWSStrong experience in improving performance of queries and data jobs and scaling the system for exponential growth in dataExpert debugging skills and emphasis on automated tests to build high quality systemsExperience working with Spark is a plusBS in Computer Science or related technical disciplinePerks:The opportunity to help build a company with the founding teamStock Options - you will have a stake in the future success of ChartboostComprehensive medical, dental and vision insurance optionsCatered lunch and fully stocked kitchensCommuter Program and 401k savings planFlex Vacation personal time to refresh your mind/body/soul, spend time with loved ones and celebrate life events. There is no accrual or specific limit to the amount of time an employee may useMore about us: We are proud of the product we have built and appreciate the impact it has on other people's businesses and lives. We want to be surrounded by people who are always finding opportunities to try something new and grow. We love data and anything that helps drive intelligent decisions and always design with the user in mind. Sounds like a fit? Join us, and be part of the team that will change the future of mobile gaming!"}