{"jobID": "2805399562", "jobLocation": "San_Diego_CA", "jobTitle": "Scientist", "companyRating": null, "companyInfo": {"Website": "www.sorrentotherapeutics.com", "Headquarters": "San Diego, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Unknown", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Department G & A  Employment Type Full-Time  Minimum Experience Experienced  Compensation DOE + Benefits + Options ABOUT US Sorrento Therapeutics Inc. is a fast growing, clinical stage, antibody-centric, biopharmaceutical company developing new therapies to turn malignant cancers into manageable and possibly curable diseases. Sorrento's multimodal multipronged approach to fighting cancer is made possible by its' extensive immuno-oncology platforms, including key assets such as fully human antibodies ('G-MAB library'), clinical stage immuno-cellular therapies ('CAR-T'), intracellular targeting antibodies ('iTAbs'), antibody-drug conjugates ('ADC'), and clinical stage oncolytic virus ('Sephrevir').  We attract smart people who play well with others. We're small enough for your ideas to make a big impact, and large enough to offer you opportunities to grow professionally at any stage of your career.  If you're a quick learner, enjoy working in the biotech industry, and share our mission of providing ground-breaking impact to medicine, each other, and our patients, Sorrento Therapeutics is the place for you! WHAT WE ARE LOOKING FOR: The Senior Manager, Head of Internal Audit performs internal control risk assessments, internal audits and help promote and maintain a sound internal control environment, in conjunction with Sarbanes-Oxley (SOX) compliance, including functional areas such as payroll, billing, and cash receipts. WHAT YOU'LL DOThis position is responsible for working with different departments within the Company on design, implementation, execution, and compliance with internal controls.The Auditor collects, reviews, and analyzes data pertaining to information systems functions relative to Sarbanes-Oxley compliance.The Auditor assists in the development of Sarbanes-Oxley self-assessment programs for key controls, and reviews and executes various IT key control tests.The Auditor performs SOX self-assessment testing for all business processes including: IT functions and entity level controls.The Auditor reports SOX results to management so that remediation can be performed and then updates appropriate documentation.Experience in a SOX 404 environment either as a consultant or internal employee is REQUIRED.5 to 7 years financial experience, through public accounting/auditing (Big 4 a plus) and/or industry experience.Conduct risk assessment of assigned department or functional area in established/required timelineEstablish risk-based audit programsDetermine scope of review in conjunction with the CFOReview the suitability of internal control designConduct audit testing of specified area and identify reportable issues and dimension of riskDetermine compliance with policies and procedures.Verbally communicate findings to senior management and draft comprehensive and complete report of audit area.Strong analytical, written/verbal communication, interpersonal, and relationship building skills.Systems knowledge and familiarity.Ability to adapt to change quickly and multi-task.Bachelor's degree in Accounting or Finance preferred. CPA or CIA preferred.YOUR REWARD:Support scientists who are on the leading edge of immunotherapies for the treatment of cancer.Earn a competitive salary that allows you to focus your attention on your passion.A comprehensive benefits package including: medical, dental, vision, life and disability insurance, matching 401k, 10 paid holidays, and three-weeks' PTO, plus stock options. If this sounds like the right career to fit your personality and interests, please apply, we're looking forward to meeting you!  Principals only. Recruiters, please don't contact this job poster.  Sorrento Therapeutics, Inc. is an Equal Opportunity Employer  Apply for this JobApply for this Position *RequiredFirst NameLast NameEmailPhoneResumeNo file selected  Submit ApplicationThank YouYour application was submitted successfully."}