{"jobID": "2802718963", "jobLocation": "Chicago_IL", "jobTitle": "Data Engineer", "companyRating": "3.9", "companyInfo": {"Website": "www.capitalonecareers.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1994", "Type": " Company - Public (COF) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " J.P. Morgan, Wells Fargo, McKinsey & Company"}, "estimatedSalary": "93000", "jobDescription": " Atrium (35004), United States of America, Rolling Meadows, Illinois  At Capital One, were building a leading information-based technology company. Still founder-led by Chairman and Chief Executive Officer Richard Fairbank, Capital One is on a mission to help our customers succeed by bringing ingenuity, simplicity, and humanity to banking. We measure our efforts by the success our customers enjoy and the advocacy they exhibit. We are succeeding because they are succeeding.  Guided by our shared values, we thrive in an environment where collaboration and openness are valued. We believe that innovation is powered by perspective and that teamwork and respect for each other lead to superior results. We elevate each other and obsess about doing the right thing. Our associates serve with humility and a deep respect for their responsibility in helping our customers achieve their goals and realize their dreams. Together, we are on a quest to change banking for good.  Data Engineer  Data Engineer position with Capital One Services II LLC in Chicago Metro Area; Multiple positions available:  Perform technical design, development, modification, and implementation of software and/or data applications using existing and emerging technology platforms. Analyze internal user needs and desired results and develop data application solutions. Develop software/data applications using UNIX, Java, AWS, Spark, and Big Data. Write, design, code, test, implement, and debug programs adhering to corporate requirements and standards. Perform application testing and validation, programming, and documentation. Develop software components, adhering to existing process guidelines. Coordinate software installation and monitor implementation process. Monitor system performance trends and identify potential issues. Suggest opportunities for improvement.  This position requires a Bachelors degree or foreign equivalent in Computer Science, Engineering, Computer Information Systems, Science, or a related technical field and 3 years of experience in job offered or application development. Said or other experience must include at least six months of experience in: UNIX; Java; AWS; Spark; Big Data. All listed qualifications may or may not be acquired concurrently. Must pass companys assessment.  #LI-DNI"}