{"jobID": "2779627242", "jobLocation": "Glendale_CA", "jobTitle": "Data Engineer", "companyRating": "3.1", "companyInfo": {"Website": "www.ageoflearning.com", "Headquarters": "Glendale, CA", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Disney Interactive Studios, Top Hat, Flocabulary"}, "estimatedSalary": "94000", "jobDescription": "Summary Our learning analytics team is looking for a data engineer. We are a tight, collaborative team of data scientists and researchers building award winning educational products. We are looking for someone who can take a large flow of inbound data and make it easy to parse and access. Ideally you are passionate about education, passionate about data integrity and privacy, and enjoy building quality reliable software everyday. ResponsibilitiesBuild efficient and reliable ETL pipelines, and architect scalable and fast data models to expose data from our data lakeWork with data scientists to make data available for ad-hoc querying, real time dashboards, and production machine learning modelsIntegrate and build software for monitoring the ETL pipeline and ensuring it’s integrityWork with product owners, designers, engineers and educators to ensure that we are making the best possible use of our dataRequired Qualifications3+ years experience in a data-related field, including data engineering, data warehousing, business intelligence, data visualization, and/or data scienceStrong software engineering skills , particularly in pythonGood with relational databases and rapidly writing complex queriesFamiliarity and experience with big data technologies (eg: Spark; hadoop ) and streaming architectures ( e.g. AWS lambda; kafka )Preferred QualificationsFamiliarity with Amazon AWSFamiliarity with RMachine learning experienceInterest in education!Age of Learning does not sponsor work-related visas for this position. This includes, but is not limited to, H1B visas."}