{"jobID": "2738354751", "jobLocation": "Santa_Clara_CA", "jobTitle": "Data Scientist Team Lead", "companyRating": "3.9", "companyInfo": {"Website": "www.datastax.com", "Headquarters": "Santa Clara, CA", "Size": "201 to 500 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "229000", "jobDescription": " We are looking for a Data Scientist who will support our Product & Engineering teams with insights gained from analyzing support, engineering, and product related data. As a DataStax data scientist, you will have to combine the skills of a developer and a detective, drawing on a wide palette of mathematics, statistics, machine learning, and programming techniques to uncover rare insights hidden within the data.  The ideal candidate is adept at using large data sets to find opportunities for product, technical support, customer sentiment and process optimization and using models to test the effectiveness of different courses of action. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms and creating/running simulations. They must have a proven ability to drive business results with their data-based insights. They must be comfortable working with a wide range of stakeholders and functional teams.  This role is strategic to DataStax and requires an experienced leader comfortable in leading, formulating insights and making compelling recommendations to the executive leadership team for consideration and action. Essential Job Functions:Work with stakeholders throughout the organization to identify opportunities for leveraging company data to drive business solutionsMine and analyze data from company data sources to drive optimization and improvement of product development and business strategiesAssess the effectiveness and accuracy of new / alternative data sources and data gathering techniquesDevelop scalable custom data models and algorithms to apply to data setsDevelop statistical and machine learning models to fill in knowledge gapsUse predictive modeling to increase and optimize customer experiences, revenue generation, and other business outcomesResearch, recommend and implement new data science approaches, algorithms and technologies that can help enhance product capabilities, improve product quality, improve customer experience and deliver business insightsDevelop processes and tools to monitor and analyze model performance and data accuracyActively participate in contributing to internal knowledge base through Wikis, Forums and other collaboration mechanismsFormulate & present business-centric insights and recommendations to DataStax executive leadership teamProvide direction and guidance to junior team members on all aspects of analytics from business context and prioritization to technical coachingJob Requirements:Masters or PHD in Statistics, Mathematics, Computer Science or another quantitative field5-7 years of experience manipulating data sets and building statistical modelsExperience working with and creating data architecturesExperience using statistical computer languages (R, Python, SLQ, etc.) to manipulate data and draw insights from large data setsExperience creating and using advanced machine learning algorithms and statistics: regression, simulation, scenario analysis, modeling, clustering, decision trees, neural networks, etc.Knowledge and experience in statistical and data mining techniques: GLM/Regression, Random Forest, Boosting, Trees, text mining, social network analysis, etc.Coding knowledge and experience with several languages: C, C++, Java, JavaScript, etc.Experience analyzing data from 3rd party providers: Google Analytics, Site Catalyst, Coremetrics, Adwords, Crimson Hexagon, Facebook Insights, etc.Experience with distributed data/computing tools: Map/Reduce, Hadoop, Hive, Spark, Gurobi, MySQL, Cassandra, etc.Experience visualizing/presenting data for stakeholders using: Periscope, Business Objects, D3, ggplot, etc.Strong problem-solving and critical thinking skillsExcellent verbal/written communication & data presentation skills, including an ability to effectively communicate with both business and technical teamsIntellectual curiosity and persistence to find answers to questions & solutions hidden in large data setsWillingness and ability to learn new data science methods and tools with little guidance"}