{"jobID": "2657362510", "jobLocation": "Grand_Rapids_MI", "jobTitle": "Financial Planning & Reporting Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.bissell.com", "Headquarters": "Grand Rapids, MI", "Size": "501 to 1000 employees", "Founded": " 1876", "Type": " Company - Private", "Industry": " Consumer Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " SHARK, TTI, Dyson"}, "estimatedSalary": "52000", "jobDescription": "Job Title: Financial Planning & Reporting Analyst Job Number:1800017 Job Description:This role is for an Analyst position to oversee support of the BISSELL reporting, financial planning, and allocation tools (Hyperion and ALLY). The Financial Planning & Reporting Analyst position reports to the Associate Director Financial Analysis - Operations. This role is a critical position in the supporting the adoption and continued usefulness of tools identified above. This position has various activities associated with reporting, allocation of actual results, and smooth transition through the planning process. The duties and requirements of the position are identified below: POSITION PROFILE (Major duties, accountabilities, and responsibilities)Process and Applications -- This role will be responsible for the following:Provide necessary global oversight of allocations to customers/ products and managing the integration of actual and forecast data into Hyperion.Subject matter expert on Hyperion, Smartview and Ally as it relates to data managements, report creation, data hierarchy/structure, allocation rules and processes.Develop ad-hoc reports using Hyperion and/or Smartview to support reporting and analysis of subsets included in standard management reporting i.e. .com, outlet store etc.Coordinates and implements training of new and existing users as needed.Coordinates, communicates, and monitors progress on Reporting and Planning deadlinesAbility to follow accounting transactions through numerous Oracle Modules from start to finish.Utilize Advanced Excel Functions to analyze data.Actively seek transaction and accounting issues to resolve ahead of month end reporting.Background in the following areas:Strong background in accounting concepts and theories and how to apply them in new situations and circumstancesExperience with budgeting and planning across multiple business entitiesExperience with departmental budgets and workflowExperience with financial consolidation processProficiency with journal entries, account analysis, and account reconciliations is a mustExperience with management reporting systems (Hyperion) and Smartview is highly desiredExperience using Oracle E-Business Suite is desiredMust be able to meet hard deadlines and stay accountable for work assigned to and manage by othersCoordinate requirements on a global level with multiple stakeholdersLead and actively participate in cross-functional teams and meetings Job Requirements:REQUIRED EXPERIENCE/EDUCATION: (i.e. degree, years of experience, etc.)Degree minimum: BachelorsSpecific concentration: Accounting or FinanceExperience level: 3-5 years' experience working in financial planning / analysisPREFERRED EXPERIENCE/EDUCATION: (i.e. MBA, certifications, etc.)Previous experience implementing ERP or other enterprise software solutions preferredFunctional knowledge of EBS, Hyperion Planning, Essbase and SmartviewSPECIALIZED TRAINING OR SKILLS REQUIRED:Proven Business Mgt skills. Successful track record of working with people and processesStrong working knowledge of the interdependencies of business functionsAdvanced Microsoft Excel SkillsStrong conflict resolution and problem skills"}