{"jobID": "2707949916", "jobLocation": "Glenview_IL", "jobTitle": "Associate Scientist, R&D; - Product Development", "companyRating": "2.8", "companyInfo": {"Website": "www.kraftheinzcompany.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 2015", "Type": " Company - Public (KHC) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "67000", "jobDescription": "Our CompanyThe Kraft Heinz Company is revolutionizing the food industry – we will be the most profitable food company powered by the most talented people with unwavering commitment to our communities, leading brands and highest product quality in every category in which we compete. As a global powerhouse, Kraft Heinz represents over $26.5 billion in revenue and is the 5th largest food and beverage company in the world. At Kraft Heinz, to be the BEST food company, growing a BETTER world is more than a dream – it is our GLOBAL VISION. To be the best, we want the best – best brands, best practices and, most importantly, the best people.It's a Question of TasteDo more, be more. Whatever your aspirations, experience something exceptional at Kraft Heinz. We'll give you the freedom to determine your own direction and deliver in your own style. Outperform our expectations and you'll move forward faster than you ever thought possible. Come ready to dream. Come eager to grow.  Get a taste of what your career could be at kraftheinzcompany.com/careers.Job DescriptionRole / TitleThis is a Center Research-based technical leadership role providing direction for and execution of projects across one or more of our North American businesses (Grocery, Refrigerated, Bev & Snack Nuts, Foodservice/KFI and Canada Zone). The candidate will be scoping and/or executing technical projects to meet business initiatives focused on Cost Engineering. This includes designing and executing tests, analyzing data, drawing conclusions, documenting, communicating results, and commercializing products. Communication and teamwork skills are essential in this role, which operates in a dynamic and cross-functional environment. The candidate must also have a technical background and be able to apply prior learning or scientific principles to new situations. This position requires an individual to manage multiple assignments/ tasks concurrently with moderate levels of supervisor guidance. Exhibiting a collaborative mindset and applying innovative solutions are a must.Key Components of the roleWork with cross functional teams to develop Cost Engineering opportunitiesTranslate research findings into meaningful business opportunities and communicate to cross-functional teamsFormula/product commercialization working closely with cross-functional team members in production plantsAdapt and apply scientific principles to new situations/productsManage multiple assignments/research projects concurrently.Specification creation and updating, with attention to detailQualifications:BS in Food, Dairy, Meat, Animal Science, or Chemical EngineeringExperience in a Technical Function (which can include internships) a plusBasic understanding of food (can be specific to Meat, Dairy, Coffee, Nuts…) chemistry, analytical testing, formulations and processing used in food manufacturingBasic understanding of ingredient functionality and interrelationship of ingredients, process, and packagingExcellent communication, influencing, and problem solving skillsManage multiple assignments/tasks concurrentlyBasic understanding of statisticsWillingness to travel 30%EEO Statement Kraft Heinz is an EO employer - Minorities/Women/Vets/Disabled and other protected categories.Location(s)Glenview R&D; Center"}