{"jobID": "2795682397", "jobLocation": "Washington_DC", "jobTitle": "Data Business Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.caci.com", "Headquarters": "Arlington, VA", "Size": "10000+ employees", "Founded": " 1962", "Type": " Company - Public (CACI) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " CSC, ManTech, SAIC"}, "estimatedSalary": "75000", "jobDescription": " Data Business Analyst Req #: 208108Location: Washington, DC USJob Category: Business Development and MarketingSecurity Clearance: DOJ MBIClearance Status: Must be ObtainableJob Description What You’ll Get to Do:  We are currently seeking a candidate to perform analytical tasks for purpose of developing, analyzing, and creating informational and productivity reports to law enforcement services (LES) program management office. Data analysis includes but not limited to customer, system, operational data, understanding the LES business and technical workflows, financial, resources, and project management. The position requires a combination of strong IT and communication skills. The ideal candidate will be a self-starter who is able to recognize trends, opportunities, problems and solutions.  Use your IT knowledge to develop and document processes to support program management office of law enforcement projects. Communicate and coordinate activities, status, issues with the project management team.  More About the Role: Creates custom and standard reports for management and operational staffReviews forms and reports to determine weak areas and make improvementsTrains staff on proper use of new forms and reportsAnalyzes work flows and lead flows and makes recommendations for streamlining or improving the processHelps develop new requirements to provide better service to customers.Produces statistical models to help predict market trendsBuild and manages useful metrics, reports and dashboards.Assists project managers to work with accurate dataMay conduct market research and recommend market strategies for the purpose of enhancing business processes You’ll Bring These Qualifications: Experience with Salesforce.com CRM (building reports and dashboards, data extraction and analysis)Extensive Excel and Access Database experience (including pivot tables), requiredMust have strong interpersonal skillsMust have excellent analytical and research skillsMust have superior written and verbal communication skills as well as solid presentation skillsMust have strong organizational skills and the ability to effectively prioritize tasksMust have good problem solving and decision making skillsMust have good negotiation and persuasion skillsMust have excellent math skillsMust be detail orientedMust have solid conflict resolution skillsBachelor’s degree and 3-5 years of experience These Qualifications Would be Nice to Have: Experience in ITILExperience in SharePoint What We Can Offer You: We’ve been named a Best Place to Work by the Washington Post.Our employees value the flexibility at CACI that allows them to balance quality work and their personal lives.We offer competitive benefits and learning and development opportunities.We are mission-oriented and ever vigilant in aligning our solutions with the nation’s highest priorities.For over 55 years, the principles of CACI’s unique, character-based culture have been the driving force behind our success. Job Location US-Washington-DC-WASHINGTON DC  CACI employs a diverse range of talent to create an environment that fuels innovation and fosters continuous improvement and success. At CACI, you will have the opportunity to make an immediate impact by providing information solutions and services in support of national security missions and government transformation for Intelligence, Defense, and Federal Civilian customers. CACI is proud to provide dynamic careers for employees worldwide. CACI is an Equal Opportunity Employer - Females/Minorities/Protected Veterans/Individuals with Disabilities."}