{"jobID": "2830049365", "jobLocation": "Houston_TX", "jobTitle": "Sr. Reporting and Data Quality Analyst", "companyRating": null, "companyInfo": {"Website": "www.saahp.com", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Functional Area:IT - Information TechnologyEstimated Travel Percentage (%): Up to 25%Relocation Provided: NoAmerican International Group, Inc.Your future team Our technology teams collaborate with their worldwide colleagues and partners every day to take on the challenges of providing IT support to one of the world’s leading financial services firm. We’re people who believe that with the right values and hard work, anything is possible. We know that if we’re at our best, that enables our customers to be their best and realize their dreams and hoped for successes. The Information Technology group provides enterprise-wide IT solutions for all of AIG’s specialized disciplines. Technology provides strategic and procedural support in all of AIG’s specialized disciplines, such as policy issuance, premium collection, claims handling, and administration. It enables AIG to deliver business strategies through efficient world-class IT and operations services, while ensuring the necessary IT risk management and security measures are in place. Your contribution at AIG As a Leader, you are respected for your deep technical expertise and/or ability to oversee programs and processes. You balance the needs of multiple stakeholders, making sound decisions using data, analysis, experience, and judgment, along with a risk mindset. Ultimately, you take ownership for key outcomes.  As a Senior Reporting and Data Quality Analyst, this role is responsible for providing reporting for and ensuring data quality of the Life and Retirement group’s ITIL based processes.  In this role, the candidate will act as a subject matter expert, who will work with peers both within their team and teams from other lines of business to coordinate processes and provide governance to ensure consistency and quality of reporting across the groups. Job Requirements: The Ideal Candidate will have:  •5+ years’ experience developing and running reports and data quality processes  •Ability to develop reports using a variety of tools and data sources, including:  ◦ServiceNow  ◦SQL in Oracle and MS SQL  ◦QlickView  •Proven passion for delivering actionable information with a high level of quality  •Experience developing processes to establish and maintain data quality in ITIL support and configuration systems  •Good interpersonal skills with an ability to work with multidisciplinary teams  •Ability to work independently, building out project plans and meeting target dates  •A sense of ownership and willing to take risks in the best interest of the organization  Preferred Skills:  •Experience if Life Insurance business domain, including Policy Administration and Commissions systems.  •Project management experience  •Team and Independent work skills  •ITIL v3 Foundations certification  It has been and will continue to be the policy of American International Group, Inc., its subsidiaries and affiliates to be an Equal Opportunity Employer. We provide equal opportunity to all qualified individuals regardless of race, color, religion, age, gender, gender expression, national origin, veteran status, disability or any other legally protected categories.  At AIG, we believe that diversity and inclusion are critical to our future and our mission – creating a foundation for a creative workplace that leads to innovation, growth, and profitability. Through a wide variety of programs and initiatives, we invest in each employee, seeking to ensure that our people are not only respected as individuals, but also truly valued for their unique perspectives."}