{"jobID": "2783306672", "jobLocation": "San_Jose_CA", "jobTitle": "Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.automationanywhere.com", "Headquarters": "San Jose, CA", "Size": "501 to 1000 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "145000", "jobDescription": " DescriptionData Scientist Do you want to make an impact? Do you want to change the world? Come join us in our quest for automation! McKinsey Global Institute ranked automation of knowledge work as #2 in their top 12 disruptive technologies that will transform life, business, and the global economy. We are driving the adoption of robotic process automation technology in leading Fortune 1000 and other companies across more than 90 countries.  The Bot Insight team is made up of engineers intensely focused on the problem of analyzing large quantities of business and operational data. Our primary product, is the industry first analytics solution designed for bots and integrates with our Robotic Process Automation (RPA) solution to help customers in their effort to automate their business. The Challenge We are looking for a Data Scientist who will use the latest AI technology to build innovative models for extracting useful information from the existing data. About the Role As a key member of the group, you will have the opportunity to shape our ML strategy: Detection, recognition and clustering problems in dataApply expert software development skills to a wide range of ML-related projectsHelp us build a large corpus of statistical models predicting future behaviorHelp us build our production service, scaling to extremely large data setsDevelop algorithms to extract structure from existing dataUse statistical techniques to analyze the performance of various experiments and competing algorithmsThe Ideal CandidatePhD or MS in Computer Science or related technical field with 6-8 years of applied experienceStrong background in one or more of the following areas: deep learning, machine learningExperience creating and using advanced machine learning algorithms and statistics: regression, simulation, modeling, scenario analysisStrong experience deploying systems into production, at scaleExperience with Spark ML frameworkCoding knowledge and experience with at least one of the languages: Java, C++, C#Experience querying databases using SQLGood communication skills"}