{"jobID": "2746604819", "jobLocation": "Northbrook_IL", "jobTitle": "Senior Analytics Advisor -Machine Learning Data Scientist", "companyRating": "2.8", "companyInfo": {"Website": "jobs.cvshealth.com", "Headquarters": "Woonsocket, RI", "Size": "10000+ employees", "Founded": " 1963", "Type": " Company - Public (CVS) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Walmart, Walgreens, Express Scripts"}, "estimatedSalary": "120000", "jobDescription": " Job DescriptionAre you passionate about data AND helping patients improvetheir health? Consider the position of Data Scientist, where your experience inadvanced analytics and modeling will directly inform how CVS Health helpspatients on their path to better health. As a key member of the EnterpriseAnalytics Group, you will work with a variety of business partners from acrossthe enterprise to both support the development of innovative programs toimprove patient outcomes as well as reduce cost and improve efficiency acrossCVS Health The role of Data Scientist will primarily be responsible fordeveloping machine learning and other advanced models that drive businessoutcomes across CVS. The newly established Machine Learning and Data Science teamis an interdisciplinary team of Data Scientists that partners with businessgroups across CVS to ideate, develop, and deploy analytic models and solutionsthat leverage advanced machine learning and analytics methodologies. As amember of this group you will work with a highly collaborative team to applystate of the art analytic methods to solve real world problems. The successful Data Scientist will translate business needsinto analytic questions; design and conduct rigorous analyses of clinical,financial, customer, and operational data; and translate these analyticfindings into predictive models and evaluation results for our businesspartners. Key job functionsinclude, but are not limited to, the following: Consulting with key internal and external stakeholders todetermine how best to leverage machine learning and advanced analytic methodsto support business objectives across CVS Health. Able to select several potential appropriate modelingapproaches for a given analytic problem (machine learning methods such asensemble models, decision trees; operations research; statistical modeling suchas multivariate techniques). Efficiently implement the models in a variety of modelingtools, achieving highly accurate models. Understands the underlying statistical concepts andcomputational approaches that enable efficient execution of models and may beable to design and implement modifications and enhancements to thecomputations. Developing sound analytic plans based on available datasources, business partner needs, and required timelines. Able to apply innovative approaches to understand andpredict what will happen across the business. Managing deliverables across multiple projects in adeadline-driven environment and project related to a wide variety of businesssettings and clinical needs. Presenting analytic findings in a variety of formats(reports, PPT, graphs, figures and tables), formulating recommendations, andeffectively presenting the results to non-analytic audiences. Required Qualifications· To be considered for this exciting opportunityon the Advanced Analytics team, candidates will need to have the followingexperience: A minimum of 7 years of professional post-graduate experience inconstructing, validating, and executing machine learning solutions. · Advanced skills and training in machine learningin areas such as: Random Forest, Decision Trees, Neural Networks, EnsembleModels, Operations Research, Generalized Linear Models, Stochastic Modeling andMultivariate Analysis. · Experience in translating business problemsacross disciplines into advanced analytic projects with measurable businessvalue. · Experience with theoretical modeling approachesand matching analytic modeling approaches to a wide range of businessapplications · Analytics experience within the retail and/or financialservices, with experience deploying capabilities across a wide range ofbusiness disciplines. · Demonstrated effective project management andtime management skills. · A strong curiosity to explore and uncover hiddenrelationships in data, and a proactive desire to translate findings intoactionable business insights. · Fluent and recent hands-on experiences in R,Python, SAS, etc. Experience with computer development languages (Java, C++). Preferred Qualifications· Familiarity with navigating in both a relational(Teradata-based) and non-relational (Hadoop) environment. · Recent hands-on experience with financemodeling, pricing elasticity, optimization, and value at risk (VaR) is stronglypreferred. EducationPhD in Statistics, Computer Science, Mathematics, Economics,or directly related field. Will also consider candidates with a Masters degree inthese fields, plus 7+ years of relevant post graduate professional paid work experiencewith an outstanding track record of developing and deploying advancedquantitative analytics to support business objectives Business OverviewCVS Health, through our unmatched breadth of service offerings, is transforming the delivery of health care services in the U.S. We are an innovative, fast-growing company guided by values that focus on teamwork, integrity and respect for our colleagues and customers. What are we looking for in our colleagues? We seek fresh ideas, new perspectives, a diversity of experiences, and a dedication to service that will help us better meet the needs of the many people and businesses that rely on us each day. As the nations largest pharmacy health care provider, we offer a wide range of exciting and fulfilling career opportunities across our three business units MinuteClinic, pharmacy benefit management (PBM) and retail pharmacy. Our energetic and service-oriented colleagues work hard every day to make a positive difference in the lives of our customers.CVS Health is an equal opportunity employer. We do not discriminate in hiring or employment against any individual on the basis of race, ethnicity, ancestry, color, religion, sex/gender (including pregnancy), national origin, sexual orientation, gender identity or expression, physical or mental disability, medical condition, age, veteran status, military status, marital status, genetic information, citizenship status, unemployment status, political affiliation, or on any other basis or characteristic prohibited by applicable federal, state or local law. CVS Health will consider qualified job candidates with criminal histories in a manner consistent with federal, state and local laws. CVS Health will not discharge or in any other manner discriminate against any Colleague or applicant for employment because such Colleague or applicant has inquired about, discussed, or disclosed the compensation of the Colleague or applicant or another Colleague or applicant. Furthermore, we comply with the laws and regulations set forth in the following EEO is the Law Poster: EEO IS THE LAW and EEO IS THE LAW SUPPLEMENTFederal law requires employers to provide reasonable accommodation to qualified individuals with disabilities. If you require assistance to apply for this job, please contact us by clicking EEO AA CVS HealthCVS Health does not require nor expect that applicants disclose their compensation history during the application, interview, and hiring process.For inquiries related to the application process or technical issues please contact the Kenexa Helpdesk at 1-855-338-5609. For technical issues with the Virtual Job Tryout assessment, contact the Shaker Help Desk at 1-877-987-5352. Please note that we only accept resumes via our corporate website: https://jobs.cvshealth.com/"}