{"jobID": "2787665762", "jobLocation": "San_Francisco_CA", "jobTitle": "Project Assessor- PCA (3-5 years)", "companyRating": null, "companyInfo": {"Website": "www.partneresi.com", "Headquarters": "Torrance, CA", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "ABOUT US Partner offers full-service engineering, environmental and energy consulting and design services throughout the Americas, Europe, and around the globe. As a leading firm in the CRE industry, we have 700+ employees in more than 40 offices. We want to be the best home for talented professionals in our field! We know that if we hire the best and the brightest, the clients will come and we will continue to build our company. Our internally focused mission has led to Partner being recognized on ENR’s Top 500 Design Firms List, LABJ’s 100 Fastest Growing List, Inc. 5000’s Fastest-Growing Private Companies in America, and Zweig’s Best Firms to Work For. Our entrepreneurial environment is one where each person can have an impact. Join our team of talented people! SUMMARY Partner is seeking a full-time Project Assessor to complete and finalize specific project tasks according to deadlines and within budget, and complete Property Condition Assessments as assigned by the Project Manager. ESSENTIAL DUTIES& TASKSProject research (historical, regulatory, etc.)Communication with client and subject site representativesConducting appropriate site reconnaissanceData compilation and organizationReport authoringPreparation of quality supporting documents (site figures, appendices, etc.)Other tasks as assigned by the Project Manager associated with report deliverable schedule and planRESPONSIBILITIESConduct project research as applicable to scope of work (historical, regulatory, etc.).Data compilation and organization.Conducting site reconnaissance.Technical report authoring.Preparation of quality supporting report documents/files.Effectively communicate project progress and issues with the Project Manager.Maintain communication with team members throughout the course of the project.Plan, schedule and track project timelines and milestones to ensure project progress status is on schedule.Understands the assessment’s potential impact on the transaction process.Identify and resolve issues with projects.Deliver appropriate progress reports (verbally or e-mail) to the Client.Coordinate and respond to requests for changes in project scope.Communicate report delivery instructions to the Project Coordinator.KNOWLEDGE, SKILLS, AND ABILITIESExcellent communication skills (internal and external)Ability to work on projects concurrentlyProven ability to successfully deliver a quality product on timeExceptional writing skillsAbility to cultivate strong relationships within a teamUnderstand concepts of building component life cycles, system condition evaluation, replacement costsProficient in Microsoft Office, Corel and ExcelFamiliar with the basic principles of civil, structural, and geotechnical engineering, including construction and maintenance of structures and systems; the Americans with Disabilities Act; Fair Housing ActQUALIFICATIONSBachelor Degree from accredited university in construction management, architecture or engineering discipline.Projects involve a degree of travel. Candidate must have a valid driver’s license and provide own transportation to and from project sites.3+ years’ experience conducting property inspections and writing associated assessmentsPHYSICAL REQUIREMENTSMust be able to read, write, speak& comprehend EnglishMust be able to communicate clearly in person and over the telephoneVisual acuity adequate to perform job duties, including reading information from printed sources and computer screenRequires frequent bending, reaching, standing, walking, sitting, pushing and pulling exerted regularly throughout the work shift.Requires the ability to climb a ladder. We will consider qualified applicants who have criminal histories in a manner consistent with the law.  Learn more about Partner Engineering and Science, Inc. at www.partneresi.com."}