{"jobID": "2799677815", "jobLocation": "San_Francisco_CA", "jobTitle": "Mobile/Front End/Back End Technical Sourcing Recruiter", "companyRating": null, "companyInfo": {"Website": "www.searchwizards.com", "Headquarters": "Sarasota, FL", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Mobile/Front End/Back EndTechnicalSourcingRecruiter–San Francisco(Bay Area), CAAre you passionate about the Talent Acquisition Profession and the impact you can make on the organizations you support? Do you enjoy being challenged and solving problems? Are you an energetic, results-oriented Professional with a competitive nature? If so, we want to talk to you.Search Wizards is a global provider of Talent Solutions. We have excelled at matching our clients’ staffing needs to the BEST Talent Acquisition Professionals in the market since 2000.If you are in the Talent Acquisition Profession make us your first call. This is all that we do and it’s all about YOU.Excited yet? Us too!We currently have a very exciting opportunity available for a Mobile/Front End/Back EndTechnicalSourcingRecruiter inSan Francisco (Bay Area), CA. This position will start as a 6 monthcontract with the potential to extend.You will be recruiting exclusively for Senior to Principal level IC and Management roles and taking them through the complete recruiting process, from start to offer negotiation and closing.Responsibilities:Develops overall recruiting strategies and is responsible for all aspects of the candidate generation process including: sourcing Sr. to Principal level passive candidates, conducting phone interviews, and working with other Recruiters as a Consultant to establish strategies for their specific positionsInterviews applicants and refers qualified candidates to appropriate department supervisor for reviewWorks with Hiring Manager to prepare offers to candidates and negotiates various aspects of offer with candidatesMay perform follow-up as appropriate including reference checks, new hire paperwork, and orientation or rejection lettersMay coordinate a structured interview processMay be responsible for gathering appropriate data for EEO purposesMay be responsible for data entry and maintenance of applicant tracking systemBasic Qualifications:Minimum 5 years previous experience recruiting for full stack SWE’s, specifically candidates with Mobile (iOS, Android, Web), Front End and Back End experienceExperience interfacing with HMs for req qualificationAbility to articulate putting together a sourcing strategy as well as articulate how to alter that strategy depending on the specific targeted groupsBA/BS degreeDemonstrated ability to both work independently and on a team: communicate and collaborate on a teamPreferred Qualifications:Previous experience recruiting for consumer, product facing tech companies (e.g. Slack, WhatsApp, Snapchat) is a BONUSSearch Wizards is an equal opportunity employer.Search Wizards is known for its pioneering efforts and niche focus on Talent Solutions. We offer competitive rates, an excellent benefits package (healthcare and 401k), ongoing education, and more.Stay Connected:WebsiteFacebookTwitterGlassdoorJOB ID: SE67668661"}