{"jobID": "2817108799", "jobLocation": "Rockville_MD", "jobTitle": "Tableau Data Visualization Analyst", "companyRating": null, "companyInfo": {"Website": "www.nete.com", "Headquarters": "MC Lean, VA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "NET ESOLUTIONS CORPORATION (NETE) is a multi-award winning company founded in 1999. NETE is a full service Information Technology (IT) company dedicated to providing value focused services to the Federal Government and the Biomedical Research and Health IT Sector. NETE offers a collaborative working environment where growth is encouraged and nurtured. In addition, we offer competitive salaries that may include performance bonuses and a comprehensive benefits package. Job Description Data is important to us and to this project/customer. We process large volumes of data every day, and transform that data into information that powers decisions for thousands of researchers, scientists, and/or medical professionals, their applied research is to better understand, treat, and ultimately prevent infectious, immunologic, and allergic diseases. Our work has significant impact on the medical and scientific communities we serve. We need to get it right, and we need to extract increasing value from the data we collect. NETE is seeking a highly motivated, flexible, organized, and detail oriented (Tableau Data Visualization Analyst)to join our dynamic team. If you want to learn, grow, and help then this is the job for you. We support a project/customer that \"seeks to better understand, treat, and ultimately prevent infectious, immunologic, and allergic disease seeks fundamental knowledge about the nature and behavior of living systems and the application of that knowledge to enhance health, lengthen life, and reduce illness and disability. What you do matters and has significant impact on the medical and scientific communities we serve. Your work here really matters and has real impact.ResponsibilitiesPerform statistical analysis of large data sets to better understand trends, relationships between variables, and to formulate predictive insights.Reasons independently – complex data architectures.Employ new research tools to derive unique findings for publications.Design and build publication-ready data visualizations using diverse sets of structured and unstructured data.Ensure research reports are created using credible qualitative and quantitative methodologies based on key insights and findings from studies.Identify internal and external information sources.Build effective working relationships with client subject matter experts.Integrate client-provided elements, research findings, and publicly available information into analytical projects.Job RequirementsBachelor's degree in Management Information Systems, Design, Human Factors, Computer Science or related discipline (e.g., Economics, Mathematics, Computer Science, Information Technology, and Computer Engineering); Master s degree is preferred.2+ years of data visualization experience.At least 1 year of experience with SPSS, STATA, R, or SAS is a plus.At least 3 year of experience working with Tableau visualization software a MUST, experience with other visualization software s/tools like, QlikView, or D3 preferred.At least 1 year of Experience with analytics, database, or business .intelligence preferred.At least 1 year of Strong SQL querying experience.At least 1 year of experience with prototyping/mock-ups/storyboards.At least 2 years of Object Oriented Programming with languages such as Python, C, C++ or Java is a plus.Some experience with web development: HTML5; CSS; JavaScript.An understanding of UI/UX design concepts.Excellent problem solving skills.Excellent oral and written communication skills.Strong analytical aptitude and an understanding of statistical methods.Applicants selected will be subject to a Public Trust background security investigation and may need to meet eligibility requirements for access to sensitive information. US Citizens or Permanent Residents preferred.BenefitsPaid Time Off (PTO)9 Paid Federal holidaysVarious wellness programsFree parking at corporate officesEmployee Referral Bonus Program (ERBP)Vision coverage through UHC national networkDental coverage through UHC national network401(K) with significant company match & no vesting periodShort and Long-Term Disability coverage (paid by company)Competitive salaries with opportunity for performance bonusesDiscount plan for pet care, legal services, & identify theft protectionBasic Life and AD&D; coverage (paid by company; option to purchase additional coverage)Medical coverage through UHC national network (option to choose between 3 available plans)Flexible Spending Accounts:Healthcare (FSA)Parking Reimbursement Account (PRK)Dependent Care Assistant Program (DCAP)Transportation Reimbursement Account (TRN)NETE is a multi-award winning company as well as offers a collaborative working environment where growth is encouraged and nurtured. In addition, we offer competitive salaries that may include performance bonuses; and a comprehensive benefits package.NETEuses E-Verify to validate all new hires' ability to legally work in the United States.Disclaimer:The above description is intended to describe the general nature of work and level of effort being performed by individual s assigned to this position or job description. This is not to be construed as a complete or exhaustive list of all skills, responsibilities, duties, and/or assignments required. Individuals may be required to perform duties outside of their position, job description, or responsibilities as needed."}