{"jobID": "2643146608", "jobLocation": "San_Francisco_CA", "jobTitle": "Cloud Data Engineer", "companyRating": "3.7", "companyInfo": {"Website": "www.firstrepublic.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 1985", "Type": " Company - Public (FRC) ", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Silicon Valley Bank, City National Bank (Texas)"}, "estimatedSalary": "118000", "jobDescription": " OverviewFirst Republic is an ultra-high-touch bank that provides extraordinary client service. We believe that one-on-one interactions build lasting relationships. We move quickly to serve our clients’ needs so that their financial transactions are handled with ease and efficiency. Client trust and security are paramount in our line of business. Ultimately, our goal is unsurpassed client satisfaction which will lead to personal referrals – our number one source of new business. We recognize that our competitive advantage starts with our people and our culture. At First Republic, we work hard and move quickly as a very coordinated team. If you are looking for an opportunity to grow and contribute in a fun, fast-paced environment, First Republic is the place for you. We have exceptional people focused on providing extraordinary service.  The Cloud Data Engineer is responsible for the development and maintenance of the FRB Data Warehouse and all the processes supporting the acquisition of data. Will also contribute in the design of new data warehouse components and data marts. Each team member is responsible for the quality of all of the data integration processes as well as participation in production support on a regular rotation basis.Responsibilities Provide production support of the Data Warehouse. This includes being an active member of the Point rotation as well as providing support to other team members that are covering point.Adhere to ETL/Data Warehouse development Best Practices and Standards.Ability to identify and resolve any performance and/or data related issuesProvide documentation (Data Mapping, Technical Specifications, Production Support, Standards Documentation, Best practices etc.) for all projectsReview the technical work of other team membersPerform duties and responsibilities specific to department functions and activities as required or assigned by Manager.Responsibilities include the following: 1) adhering to and complying with all applicable, federal and state laws, regulations and guidance, including those related to Anti- Money Laundering (i.e. Bank Secrecy Act, USA PATRIOT Act, etc.), 2) adhering to Bank policies and procedures, 3) completing required training.QualificationsB.S. degree in computer science, mathematics, statistics or a similar quantitative field5+ years of work experience in relevant field (Data Engineer, BI Engineer, DW Engineer, Software Engineer, etc)Experience with a DW technology (ETL, SQL Server, Cloud Databases etc) and relevant data modeling best practice.Experience building ETL and familiarity with design principlesExcellent SQL skillsProficiency in a major programming language (e.g. Java/C) and/or a scripting language (scala/perl/python)Experience with map reduce SPARK/EMRStrong communication skills and ability to discuss data product with PMs and business ownersExperience with business requirements gathering for data sourcingTeam playerProvides extraordinary serviceFurthers the First Republic Bank culture and valuesExperience with cloud solutions / AWS preferredExperience building reports and/or data visualization preferredExperience with Hadoop/MapReduce/AWS/EMR preferredExperience with scalable service architecture and design preferred Mental/Physical Requirements:The ability to learn and comprehend basic instructions; understand the meanings of words and respond effectively; and perform basic arithmetic accurately and quickly.Vision must be sufficient to read data reports, manuals and computer screens.Hearing must be sufficient to understand a conversation at a normal volume, including telephone calls and in person.Speech must be coherent to clearly convey or exchange information, including the giving and receiving of assignments and/or directions.Position involves sitting most of the time, but may involve walking or standing for brief periods of time.Must be able to travel in a limited capacity."}