{"jobID": "2837185672", "jobLocation": "Summit_NJ", "jobTitle": "Sr. Clinical Research Scientist, Hematology/Oncology", "companyRating": null, "companyInfo": {"Website": "www.cmp.jobs", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Employer is a global biopharmaceutical company leading the way in medical innovation to help patients live longer, better lives. Our purpose as a company is to discover and develop therapies that will change the course of human health. We value our passion for patients, quest for innovation, spirit of independence and love of challenge. With a presence in more than 70 countries, and growing - we look for talented people to grow our business, advance our science and contribute to our unique culture. Summary/Scope: This position serves a key role within the assigned Therapeutic Area Team. The Sr. CRS works closely with the study team to support the activities associated with one or more clinical studies. The Sr. CRS leads or co-leads a study or study activities. This position collaborates with clinical team members as well as with functions outside of clinical to provide high quality and timely deliverables. The Sr. CRS is responsible for achievement of personal goals which support study team, project team, and franchise goals. Responsibilities will include, but are not limited to, the following:Lead or support assigned study level activities for 1 or more clinical studies with minimal supervision; may lead or co-lead a studyThorough understanding of assigned protocol and protocol requirementsUnderstands work to be done; plans aheadLead/Co-Lead or Support study start up/conduct/close-out activities as applicable Preparation, storage, maintenance of clinical documents (TMF)Protocol development process with minimal guidance; including writing, reviewing, adjudication/resolution of cross functional comments, and ensuring high quality final document)Review and validation of clinical study reports (CSRs); thorough understanding the connection between the data and the CSRAuthor/coordinate and review Regulatory Documents (e.g., IB, Briefing Books)Author/Review Informed Consent Forms (ICF); review/support finalization of regional and site ICFs as needed; ensure high quality, appropriate reading level text, and alignment with protocol)Planning of site and CRA training; including logistics, materials and presentationCountry/site selection activitiesCollaboration with Clinical Operations for budget preparation, CRO scope of work, etc. (i.e., review and provide feedback on activities/instructions/deliverables related to study data, IVRS, central labs, patient reported outcomes)Study committee (e.g., DMC) activities such as charters, meetings, presentation preparationInvestigator Meeting and SIV planning/facilitation/presentationActivities related to data generation and validation, including CRF creation, clinical data review, communication as needed to resolve data queries, draft/update/review data review plans, support Clinical Research Physician in data review (generation of reports, action plans, trend identification), etc)May support clinical development planning (assist CRP/Program Lead CRS with analysis of data and review of literature to support future planning)Collaborate with study team members (Clinical, Clinical Operations, Data Management, Statistics, Drug Safety, IMSC, Regulatory Affairs, Translational Medicine and Project Management) to ensure that key milestones are met on time and with high qualityRegularly attend and actively participate in study team and other clinical meetingsMay represent CRS function in cross functional activitiesProvide guidance and scientific expertise within team, across department, and across functionsLead the planning and preparations for external/stakeholder meetings (e.g., IMs, Governance)Present data/information to external investigators or study staff (e.g., SIV presentations)Identify and liaise with external partners in collaboration with the CRPIdentify, escalate current/active/future issues; propose and enact solutionsIndependently and consistently enact and share best practices within TAMay support or lead process improvement and departmental trainings activitiesMay serve as peer coach; provide guidance to junior members of the teamSet priorities and complete work independentlySupports program level activities as neededOversee tasks of CRSs when leading a studySkills/Knowledge Required:At least 6 years of experience in CR&D; roles/responsibilities or equivalentProficient knowledge of GCP/ICH, drug development process from discovery to registration, study design, statistics, clinical operationsExcellent verbal, written, communication and interpersonal skills. Must be able to effectively communicate and collaborate across functions and job levels.Ability to assimilate technical information quicklyDetail-orientedBasic leadership presenceStrong sense of teamwork; ability to lead team activitiesProficient knowledge and skills to support program specific data review, trend identification, data interpretationProficient in Medical Terminology and medical writing skillsProficient knowledge of the disease area(s), KOLs, indication(s), compound(s) under study (including MOA, PK/PD, biomarker & safety profile)Knowledge of the establishment and operation of data monitoring committees, dose review teams, and independent response adjudication committees.Proficient critical thinking, problem solving, decision making skillsUnderstanding of functional and cross-functional relationshipsCommitment to QualityAdaptable / Flexible (willing and able to adjust to multiple demands and shifting priorities; ability to meet day-to-day challenges with confidence and professionalism)Proficient planning/project management skills (ability to develop short to mid-range plans that are realistic and effective in meeting goals)Proficient in Microsoft Word, Excel, PowerPoint, Electronic Data Capture (e.g., RAVE), J-Review or similar data reporting tools *LI-POSTEmployer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Employer complies with all applicable national, state and local laws governing nondiscrimination in employment as well as employment eligibility verification requirements of the Immigration and Nationality Act. All applicants must have authorization to work for Employer in the U.S."}