{"jobID": "2576668877", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist", "companyRating": "4.8", "companyInfo": {"Website": "www.remind.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "140000", "jobDescription": "About Us Remind is a communication platform that helps educators reach students and parents where they are: their phones. With 27 million active users, we’re one of the fastest-growing companies in education technology, but we have our sights set on something bigger: giving every student the opportunity to succeed.  Our investors include First Round Capital, GSV, Kleiner Perkins Caufield Byers, and Social Capital, and we want you to join us. ResponsibilitiesWork with engineering to anticipate and build solutions proactivelyPerform deep-dive analytics that inform important decisions across Product, Engineering, Marketing and Finance teamsAnalyze data to identify trends and opportunities, surface actionable insights, and help teams set goals, forecasts and prioritization of initiativesDesign experiments, analyze results, and convey findingsDesign and build dashboards to monitor key performance metrics and understand key driversRequirements3+ years experience in a large-scale data environmentYou have worked with large data sets, are fluent in SQL and have additional experience with at least one scripting language (python, R, ruby, etc)You know how to navigate the landscape of analytics and statistics (A/B testing, regression, forecasting)You love to troubleshoot issues and solve problemsYou effectively synthesize and communicate ideas clearly to othersYou have superb attention to detail and maintain a high level of integrity in your workBenefits and PerksCompetitive salary and equity100% health coverage for you and your dependentsOpen vacation policyParental leaveCatered meals and fully stocked kitchenParking and commuter benefits Remind is an equal opportunity employer, and we're committed to diversity and inclusion in the workplace. We aim to represent the students, teachers, and parents we serve, and we welcome, support, and empower all the diverse individuals in our community."}