{"jobID": "2811725214", "jobLocation": "Santa_Clara_CA", "jobTitle": "Data Scientist and Visualization Manager", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "169000", "jobDescription": "Data Scientist and Visualization Manager Job Number: 113941175Santa Clara Valley, California, United StatesPosted: Jun. 11, 2018Weekly Hours: 40.00 Job SummaryCome join our nascent, inclusive, and dynamic Hardware Engineering Tools and Data Analytics (HWETDA) Team as a Data Scientist and Visualization Manager. Our Data Scientists and Machine Learning Engineers are part of our internal application development organization collaborating with a variety of partners within Apple to distill data into insightful and intuitive visualizations that drive informed decisions.  You will help define and track key performance indicators and especially generate insights regarding product development and delivery. The Manager will also provide mentorship on future tool feature sets to help better inform product development teams.  In addition to reporting, the will be able to implement digital analytics tagging, conduct exploratory analysis, work in collaboration with our UX team to carry out A/B and multivariate experiments, effectively utilize API’s, and collaborate closely with partners in the Product, Data Analytics, Data Science and Tool Engineering teams across Apple.  We support anyone who approaches problem solving with curiosity and imagination to apply. We encourage people to learn new skills and a mindset that challenging questions are opportunities for insight.  Our HWETDA team enables data-driven decision-making by developing and performing analysis, modeling, and visualization of structured and unstructured data for engineering and research design teams. Our unique position within the organization allows us to assist product development teams on a wide range of products designed at Apple. Our work directly impacts the development process of products used by millions of people worldwide.Key Qualifications THE MUST HAVESFluency using statistics and data visualization to answer questions about data setsEffective communication skills. Specifically, you can explain complex issues to various audiences, are able to think about the big picture when communicating, and can summarize technical details succinctlyStrong programming skills in Python, and/or R. You have experience using these tools to import, clean, analyze, and visualize data to enable data-driven decision makingExperience with dataviz libraries such as D3, Highcharts, Recharts, Bokeh, and PlotlyExcited and able to communicate important information in an easily understandable graphically rich mannerPrevious experience leading and managing a team of direct reports DescriptionAs a talented team of engineers, we work together to understand challenging problems that arise during all stages of product design and development at Apple. The job requires collaborative work, the ability to use statistics and visualizations to enable data-driven decisions and most importantly, a passion for creating informative visualizations and presentations to communicate results to all levels of the company.  As a Data Scientist and Visualization Manager, your responsibilities will include some of the following activities: Gathering large quantities of structured and unstructured data from many different sourcesConducting data exploration, QA/QC, visualization, statistical and data analysis, and modelingCollaborating with UX engineers in designing insightful data visualizations with intuitive user interfaces that enable data-driven decisionsCreating custom algorithms for large datasets to enable visualizations that help decision makers quickly understand the dataDefining data capture formats to enable useful and efficient analysis of user behaviorCollaborating with teams to automate processes, conduct systems analysis, and build visualization workflows by building and deploying software toolsCreating systems for real-time or near real-time data analysis to improve precision machine performance in factoriesSharing results and teaching concepts across the company through presentations and other communication channelsExploring multiple ways to visualize datasets depending on audience and needsOur team strongly inspires collaboration but also offers freedom and autonomy.Creative and outside-the-box thinking is urged, and original ideas are welcomed and supported by the team.EducationMasters degree preferred in an analytical field such as Human Computer Interaction, Climate or Environmental Science, Applied Math, Economics, Social Sciences, Engineering, Computer Science, Physics, Biological Sciences, Statistics, or Robotics along with 4+ years relevant work experience.Additional RequirementsANY COMBINATION OF THESE SKILLSStrong interest in peer collaboration and teamwork and a willingness to solicit input and accept feedback.Comfort working both independently and collaboratively on tight deadlines in an encouraging environment.An appreciation of functional design or interested in developing your design aesthetic.Familiarity with both relational and non-relational databases such as: MySQL, PostgreSQL, Cassandra, and FoundationDB.Familiarity with Github and software development workflows or eager to adopt these software collaboration practices.Ability to juggle multiple projects."}