{"jobID": "2789446912", "jobLocation": "Sacramento_CA", "jobTitle": "Watson Health - Senior Analytic Consultant", "companyRating": "3.6", "companyInfo": {"Website": "www.ibm.com", "Headquarters": "Armonk, NY", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Public (IBM) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Accenture, Microsoft"}, "estimatedSalary": "93000", "jobDescription": " Job DescriptionResponsible for design, application, and interpretation of comprehensive analysis. Serve as a team leader and an analytic member of project teams to deliver quality products and services to IBM Watson Health clients.  Essential Responsibilities Organize the project team, work with project team to define production steps, define testing plans, and prepare a work schedule; track and communicate status to manager.Provide on-site and/or telephone support (e.g., client inquiries, requests for ad hoc reporting assistance, miscellaneous research, advice on analytic methods) and training to client end users.Clarify scope and design issues, communicate status and results, develop appropriate deliverable documentation, ensure that training is provided.Define problems and recommend appropriate solutions considering the project budget, the sophistication of the user and the intended use of project results.Operate independently with clients.Design an analytic project with an accurate estimate of effort in a project plan.Examples of responsibilities:Perform risk analysis.Evaluate the effectiveness of a disease management program.Demonstrate ability to use analytic findings to make appropriate recommendations to clients.Prepare and present effective, polished presentations to clients. Required Technical and Professional Expertise Bachelor's Degree requiring strong quantitative skills such as Mathematics, Actuarial Studies, Physics, Economics, Engineering.3-5 years quantitative work experience, preferably in a healthcare related fieldDemonstrated ability to convey complex ideas in an easily understood manner to guide audience through written or verbal communications.Outstanding project management skills.Strong Microsoft Excel and Power Point SkillsExperience in applying health analysis methods and measures utilizing basic statistical methods.Demonstrated ability to understand industry issues and problems, relate them to clients' needs, and propose appropriate solutions.Excellent oral and written communication skills and outstanding presentation skills.Willingness to travel. Preferred Tech and Prof Experience R, Python, SPSS, and/or SAS, or other statistical software packagesTableauHealthcare Related Experience EO Statement  IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status. "}