{"jobID": "2830189031", "jobLocation": "Rocklin_CA", "jobTitle": "Data Analyst", "companyRating": "2.9", "companyInfo": {"Website": "www.onpurple.com", "Headquarters": "Alpine, UT", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "56000", "jobDescription": " Data Analyst  The Data Analyst is responsible for developing and maintaining complex data extracts, applications and ad-hoc TSQL queries to support the Applications development and Business Intelligence teams. Areas of Responsibility:Develop and Maintain TSQL Queries and Store ProceduresDevelop and maintain solutions using SSIS, specifically ETL operationsResearch, troubleshoot, and resolve data issues impacting extract delivery.Work closely with Business Information Analysts to understand requirements regarding solutions, ensure data quality and match-back to core systems transaction results.Collaborate on the definition, development, and maintenance of standards and processes.Drive continuous improvement and automation in BI solutions and processes.Other duties as assigned.Minimum Qualification Requirements:BS. or MS degree in Computer Science, business or related discipline, or equivalent experience.3 - 5 years of experience with T-SQL Stored Procedures, Views and T-SQL design and development using Visual Studio and SQL Management Studio (or equivalent tools)3 - 5 years of experience using SQL Server 2008, 2012, 2016 or equivalent tools.Must have strong understanding and ability to script in Advanced Transact SQLKnowledge of data integration and processing including extraction, transformation, and loading (ETL).Advanced problem solving and analytical skills.Excellent written and verbal communication skills, with the ability to clearly explain technical issues to a non-technical audienceAbility to prioritize and organize multiple tasksAbility to remain organized with multiple interruptionsExperience with Call Center data is strongly preferred.Experience with data access performance tuning and performance optimization.Exceptionally detail orientated and ability to cross-check work to user specificationsProficient working independentlywith little directionand as a supportive team memberAccustomed to fast-paced environments with simultaneous, high-priority tasksMust be capable of performing in a dynamic environment, handling multiple tasks simultaneously with the ability to work on multiple projects at any timePhysical Requirements: Employees may experience the following physical demands for extended periods of time Sitting, standing and walking (95-100%)Keyboarding (40-60%)Viewing computer monitor, videophone, and pager requiring close vision (40-60%)Work Environment: Work is performed in a business office environment. Travel to company, customer and vendor sites, including some that are out of state will be required. Disclaimer: The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees to this job. Employees are expected to follow their supervisor's instructions and to perform the tasks requested by their supervisors.  Purple Communications is an Equal Opportunity Employer."}