{"jobID": "2796588099", "jobLocation": "Washington_DC", "jobTitle": "Sr Program Management Support", "companyRating": "4.7", "companyInfo": {"Website": "www.mtsi-va.com", "Headquarters": "Alexandria, VA", "Size": "501 to 1000 employees", "Founded": " 1993", "Type": " Other Organization", "Industry": " Aerospace & Defense", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "183000", "jobDescription": " OverviewModern Technology Solutions, Inc. (MTSI) is searching for a Sr. Program Management Support professional to join our team of more than 800 employee owners. MTSI is dedicated to providing high caliber services to defense, aerospace and intelligence customers across the US. We are always looking for the best to join our TEAM of highly skilled professionals.  MTSI’s core capabilities are Systems Engineering and Integration, Modeling and Simulation, Test and Evaluation, Acquisition and Program Support, and Mission Assurance services. Our expertise includes ballistic missile defense, air defense, air vehicle survivability, unmanned aircraft, flight test operations, intelligence support, and cyber/space/homeland defense.  Join MTSI this year in celebrating our 25th consecutive year in business and consecutive growth. Our first core value is that employees come first. We challenge our co-workers to provide the highest level of support and service, and reward them with some of the best benefits in the industry. All new co-workers start with 20 days PTO, 6% 401k match with immediate vesting, semi-annual bonuses, and eligibility to participate in our Employee Stock Ownership Plan (ESOP). We offer other employee focused benefits, including up to $10k in tuition reimbursement and an optional zero dollar deductible BCBS health insurance plan.  For additional company information, please visit: www.mtsi-va.comResponsibilitiesAs a Sr. Program Management Support professional with MTSI you will provide the US Air Force Advanced Management Office (AMO) with Advisory and Assistance Services (A&AS;) to achieve cost-effective, long-term, critical capabilities to support the war-fighting mission of the combatant commanders. Some of your specific duties will include working on high-visibility or mission critical aspects of a given program and perform all functional duties independently. Candidates may oversee the efforts of less senior staff and/or be responsible for the efforts of all staff assigned to a specific job.QualificationsRequired: 10+ years of relevant DoD work experience with no less than four (4) years’ experience in a Special Access Programs and/or SCI environment within the last five (5) years.DoD 5000.02 program management experience in executing effective and responsive integrated program management utilizing directed policies and procedures and earned value management system on one or more ACAT I and/or ACAT II acquisition programs for research, development, test, evaluation, production, modernization and lifecycle acquisition and sustainment activities of a DoD program.Minimum Educational Requirements: Masters degree in Arts, Science, Engineering (MA/MS/ME).Clearance Requirements:  Top Secret, SCI Eligible; SAP experience within last 5 years or SCI in lieu of.  Please Note: U.S. Citizenship is required.  #LI-MH1"}