{"jobID": "2812102320", "jobLocation": "Palo_Alto_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.identitymindglobal.com", "Headquarters": "Palo Alto, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "IdentityMind is the Trusted Digital Identity (TDIs) company. We offer a SaaS Platform that builds, maintains and analyzes digital identities worldwide. Our Platform allows companies to perform identity proofing, risk-based authentication, regulatory identification, and ultimate detect and prevent synthetic identities, and stolen identities. We extend our Platform with transaction monitoring for e-commerce fraud prevention, anti-money laundering, and the counter financing of terrorism (CFT). We are expanding internationally and are also building Big Data analytics and reporting tools to cope with the financial crime prevention requirements of our clients.  As a Data Scientist, you would be working closely between our Product, Engineering, and Sales teams. Responsibilities will primarily be internally focused business intelligence, client-facing transaction and fraud analysis, and the productization of your analytic findings.  IdentityMind Global has a diverse workforce and strongly believes in a non-political, just get the job done work environment.  If you are interested in finding out more and explore a possible relationship, we would love to hear back from you to find out more about you and to tell you more about our platform. Key Qualifications2+ years industry work experienceStrong experience implementing real time analytics, dashboard and business intelligence reportingExperience in programming with R, PythonExperience in data visualization with tools such as Tableau and/or d3.jsA software engineering mindsetDocumentationSource control and release cyclesRepeatability and sharingExperience implementing ETL, and report generation from large volume of dataAbility to work within a small high achieving team, as well as independentlySelf-driven, highly motivated, innovativeStrong communication skills, both written and verbalDesirableCassandraGraph Databases such as Titan or Neo4J accessed via GremlinApache Spark, ScalaAWSLinuxMachine learning toolsAt this time, IdentityMind Global will not sponsor a new applicant for employment authorization for this position.  Position Based in Palo Alto, CA"}