{"jobID": "2809253013", "jobLocation": "Santa_Monica_CA", "jobTitle": "Data Engineer", "companyRating": "3.6", "companyInfo": {"Website": "www.vivendi.com", "Headquarters": "PARIS, France", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public (VIV) ", "Industry": " Telecommunications", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "136000", "jobDescription": " We are UMG, the Universal Music Group. We are the world's leading music company. In everything we do, we are committed to artistry, innovation and entrepreneurship. We own and operate a broad array of businesses engaged in recorded music, music publishing, merchandising, and audiovisual content in more than 60 countries. We identify and develop recording artists and songwriters, and we produce, distribute and promote the most critically acclaimed and commercially successful music to delight and entertain fans around the world.  We have opportunities for data engineers to join our growing tech team at Universal's offices and contribute to the development of our innovative approach to finding new and impactful insights to grow UMG's business.  We have moved all of our Data and Analytics to Google Cloud Platform (GCP). As a data engineer, you will be responsible for designing, implementing and support new and existing GCP-based data solutions new data processing, data sets and systems to support various advanced analytics needs. This involves working with the existing engineering team, data scientists, analysts and the business to understand requirements and data needs and definitions. You will create and support data flows to integrate with multiple external sources using APIs, database connections and flat files. You will liaise with members of the wider Universal Data&Analytics; teams to ensure alignment with existing systems and consistency with internal standards and best practice. Job Functions:Build understanding of data sources and downstream systemsLiaise with key stakeholders to understand requirements, business definitions and the potential value of different dataSupport, design, implement and document solutions for loading, piping and exposing data from multiple sourcesSupport and build well-engineered data systems to support analytical needs using Google Cloud Platform (Cloud DataFlow, BigQuery, BigTable)Assure accuracy of data processing and outputs through consistently high software development skills, adherence to best practice, thorough testing and peer reviewsHabitually approach problem solving with creativity and resourcefulness; carefully evaluate risks and determine correct courses of action when completing tasksJob Requirements:Skills/Abilities:Demonstrable professional experience designing, building, and maintaining data systems and processes using cloud-based platforms (Google BigQuery and Cloud DataFlow extremely desirable; AirFlow is a big plus or AWS Big Data Platform)Demonstrable, hands-on professional software development skills using Java. Python is a plus.Excellent verbal and written communications skills with the ability to clearly present ideas, concepts, and solutionsDemonstrated willingness and ability to effectively work with various team members when gathering requirements, delivering solutions, and eliciting suggestions and feedbackExtremely quick learner both in terms of new technical skills and acquiring domain knowledgeExperience:Experience working in Unix/Linux operating systems and tools.Expertise using cloud-based systems and services to acquire and deliver data via APIs and flat filesExtensive hand-on experience working with data using SQLEducation:Bachelor's Degree in Computer Science or closely related discipline Universal Music Group is an Equal Opportunity Employer.  Disclaimer  This job description only provides an overview of job responsibilities that are subject to change."}