{"jobID": "2729544853", "jobLocation": "Santa_Monica_CA", "jobTitle": "Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.headspace.com", "Headquarters": "Santa Monica, CA", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "85000", "jobDescription": "About the Data Analyst role at Headspace:At Headspace, we believe the power of health and happiness can deeply impact each one of us. We are seeking a Data Analyst to join our Growth team and make significant contributions to our mission of making the world a happier and healthier place.As a member of the Growth team, you are analytical, technical, and passionate about leveraging data to deliver actionable insights that impact business decisions. You enjoy finding opportunities to be data driven, scale our impact, and work cross-functionally in the business. How your skills and passion will come to life at Headspace: Design and develop metrics, dashboards and analyses to drive business decisionsManage the health of growth analytics reporting to support team operationsRecommend, build, and study user segmentations for growth tests and initiativesCollaborate with growth team to prioritize high impact experiments and projectsExperience with marketing mix portfoliosExperience building customer lifetime value/subscriber acquisition cost reportingWork closely with paid marketing platforms and vendors such as Facebook, Instagram, Google, TaboolaWork closely with engineering to define requirements for data models and pipelinesOwn a comprehensive link between third party data services and internal user dataBe a data ambassador; closely monitor, quantify and socialize key growth activitiesWhat youve accomplished:2+ years in a data-intensive roleUndergraduate degree in a quantitative field (or equivalent training & experience)Experience with SQL and data visualization tools (e.g. Looker, Tableau) requiredProficiency with Python or RExperience conceptualizing and executing A/B testsExperience with digital advertising analytics is a plusExperience with analytics across mobile and web platforms is a plusExperience with digital subscription businesses is a plusStrong team-player who can work well across multiple cross-functional teamsStrong communication skills and the ability to be self-directed when necessaryHow to get started:If youre excited by the idea of seeing yourself in this role at Headspace, please apply with your CV and a cover letter that best expresses your interest and unique qualifications."}