{"jobID": "2807190446", "jobLocation": "Monterey_Park_CA", "jobTitle": "UM Data Analyst", "companyRating": "3.0", "companyInfo": {"Website": "www.care1st.com", "Headquarters": "Monterey Park, CA", "Size": "201 to 500 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "53000", "jobDescription": " GENERAL SUMMARY:  Under the direction of the VP of Medical Services the UM Data Analyst is responsible for supporting the UM Department Management Team in the analysis of UM Department Activities. This position involves working and analyzing the functionality of Access databases and will act as a liaison between the MIS Department, Senior Data Analysts, and the UM Department.  The incumbent must be proficient in collecting, managing, assuring data quality, and reporting of all data relevant to Medical Management programs at Care1st.QUALIFICATIONS:Excellent analytical skillsMust have understanding of Excel, Access and database developmentMust have proficient skills with Microsoft Office SuiteAbility to create spreadsheets, correlate data into graphsAble to identify data discrepanciesExcellent verbal and written communication skillsMedical terminology highly desirableAbility to deliver reports timely and in accordance with formatting specifications ESSENTIAL DUTIES AND RESPONSIBILITIES: Prepares UM Data reports for MSC and BOD meetings.Prepares quarterly and annual ICE reports for L.A. Care Health Plan.Develops and coordinates utilization management reports.Provides in-house user and training assistance when required.Assist in issue resolution as it pertains to UM reports.Prepares UM correspondence for over-site entities as it relates to UM data reports.Attends UM meetings as appropriate for the planning and development of UM Data reports.Reviews and organizes data management of databases.Generates CCMS Reports and acts as a back-up administrator of CCMS.Coordinates reporting and validation of Part C Organization Determinations.Other related duties as assigned."}