{"jobID": "2706584606", "jobLocation": "Los_Angeles_CA", "jobTitle": "Principal Scientist 1", "companyRating": "2.8", "companyInfo": {"Website": "www.grifols.com", "Headquarters": "Barcelona, Spain", "Size": "10000+ employees", "Founded": " 1940", "Type": " Company - Public (GRFS) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "94000", "jobDescription": "Grifols is a global healthcare company whose mission is to improve the health and well-being of people. Our three divisions –Bioscience, Diagnostic and Hospital–develop, produce and market our innovative products and services to medical professionals in more than 100 countries.  We are committed to fostering an environment that creates continuous learning opportunities and encourages professional development and growth. As a company devoted to improving the health and well-being of people, we are looking for talented professionals worldwide. Make a difference and join us in this challenging and rewarding enterprise.POSITION SUMMARY Responsible for developing new plasma protein therapeutics. ESSENTIAL DUTIES AND RESPONSIBILITIES include the following. Other duties may be assigned. Identify and isolate new plasma protein therapeutics.Manage the development and implementation of processes that will improve manufacturing efficiency of plasma products and enhance product quality.Make recommendations for process changes based on thoughtful analysis of product and process data.Identify and implement new research and production technologies. Assist business development by supplying technical input for the preparation of proposals.Write development reports and process procedures. Assist in the validation of new processes transferred to the production area.Communicate technical activities (both verbally and in writing) to all levels within the company. When appropriate, write scientific papers for journal publication and make outside meeting presentations.Serve as leader for selected projects and/or team leader for interdepartmental teams assigned to critical issues.Use her/his specific training and experience to provide training and supervision to junior staff members in the department.Assist in the design of scientific studies needed to support new and existing regulatory submissions.Maintain current knowledge of regulatory and industry standards.Generate thorough written reports, when required, that summarize investigations performed for out-of-specification results or out-of-procedure events.Participate in regulatory and internal inspections/audits including providing written responses as applicable for area of responsibility.Strict adherence to procedures and practices according to FDA regulations.Strong emphasis on documentation according to FDA regulations.Adhere to departmental corporate safety policies.REQUIRED EXPERIENCE/SKILLS & EDUCATIONAL QUALIFICATIONS To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable qualified individuals with disabilities to perform the essential functions. M.S. or Ph.D. (preferred) in Biochemistry, Molecular Biology or a Life Sciences field.Minimum of five years of experience working in a laboratory (may include graduate and post-doctoral work).Requires an understanding of the fundamentals of protein biochemistry, immunochemistry, electrophoresis, spectroscopy, ELISA, molecular biology.Comprehensive knowledge and understanding of cGMPs, FDA regulations, and industry guidelines.Must have strong technical writing skills.Ability to work independently with minimum supervision.Strong organizational, analytical, and problem-solving skills with the ability to make structured decisions on a routine basis.Must be proactive, results oriented, and have strong attention to detail.Self-starter with strong work ethic and the ability to exercise good judgment.Ability to effectively prioritize and manage multiple tasks to meet targeted deadlines.Strong interpersonal skills with the ability to interact with personnel at all levels in a team environment.Excellent verbal and written communication skills in the English language.Computer literacy with proficiency in MS Office (Outlook, Word, Excel, PowerPoint).PHYSICAL REQUIREMENTSAbility to lift /move up to 25 pounds.Ability to sit/stand for extended periods - up to four (4) hours at a time.Manual dexterity to perform all job functions.Ability to gown and work in an aseptic/clean room environment.Exposure to toxic/caustic chemicals and biological hazards. *This job description is accurate at the date of publication and may change over time. It is not intended as an exhaustive description of the job. Other duties may be assigned and qualifications required may change.  EEO Minorities/Females/Disability/Veterans  Grifols is committed to Equal Employment Opportunity (EEO) and to compliance with all Federal, State and local laws that prohibit employment discrimination on the basis of race, color, age, national origin, ethnicity, religion, gender, gender identity, pregnancy, marital status, sexual orientation, citizenship, genetic disposition or characteristics, disability or veteran's status or any other classification protected by applicable State/Federal laws. We will consider for employment all qualified Applicants, including those with Criminal Histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance. Location: NORTH AMERICA : USA : CA-Los Angeles:USVALLEY - Valley Bl Mfg Plant - LA, CA Learn more about Grifols"}