{"jobID": "2817595662", "jobLocation": "Bloomfield_Hills_MI", "jobTitle": "Recruiter - Property Management", "companyRating": "2.9", "companyInfo": {"Website": "www.rocorealestate.com", "Headquarters": "Bloomfield Hills, MI", "Size": "501 to 1000 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "31000", "jobDescription": "Company: ROCO Real EstatePosition: Corporate RecruiterFLSA Status: Salary, exemptAbout ROCO:Founded in 2012, ROCO Real Estate is a privately owned and operated full service real estate investment and management company headquartered in Bloomfield Hills, MI. ROCO currently owns approximately 20,000 apartment units across 13 states and has over 500 employees. ROCO has a long-term hold strategy for our assets, which means that when we invest in real estate we are making a meaningful commitment. We have experienced record growth due to hiring the best professionals in the industry. ROCO makes significant investments in our employees and properties. We treat our residents and Investor partners the way we would want to be treated, if our positions were reversed.We are defined by our unique culture centered around young entrepreneurs making waves in an old industry. ROCOs greatest asset, and the key to our success, is our people. We focus on customer-service and reward impact.www.rocorealestate.comAbout this position:As a Corporate Recruiter, your primary responsibility will be to recruit and attract the highest quality talent to join ROCO Real Estate at our property sites and/or corporate office. You will work directly with the Area Vice Presidents, Regional Managers and Property Managers to facilitate the recruiting and onboarding process from start to finish. By establishing a clear strategy with the hiring manager(s), the Corporate Recruiter will tailor their approach to suit the specific needs of the role. The Corporate Recruiter will have a thorough understanding of the various positions and responsibilities within the Property Management industry.To achieve this, the Corporate Recruiter will work with our applicant tracking system, Newton, to deploy open positions, review applicants, conduct phone screens, coordinate the on-site interview process, and complete the offer letter and new hire procedures. The Corporate Recruiter will also maintain a pipeline of potential candidates for key positions that will reduce sourcing time for subsequent positions.This position requires a wide range of abilities including strong verbal and written communication and organizational skills, flexibility, high energy and attention to detail. A high standard of professionalism and an engaging personality is required, as the Corporate Recruiter is the first impression prospective team members will have for ROCO.Job Responsibilities:Ensure a pipeline of candidates and applicants for all open positions within the region(s) assigned. Lead the hiring process with a strong sense of urgency to minimize vacancy.Actively source new candidates to ROCO by networking, building relationships with industry leaders, attending networking and career advancement events and staying abreast innovative and creative recruiting techniques.Maintain frequent communication with stakeholders to understand open position status and an outlook of upcoming job openings. Utilize a candidate pipeline for key positions.Support the Property Acquisition process with regards to onboarding site staff.Stay abreast operational goals and directives to ensure consistency with recruiting goals.Seek opportunities to improve efficiency or streamline processes throughout the recruiting lifecycle.Represent ROCO with the highest level of courtesy, professionalism and enthusiasm.Required Skills & Experience:Bachelor's degreePrior experience in Recruiting, Property Management experience desiredExperience using Newton and/or Paycor preferredStrong communication skills - written and verbalAbility to self-direct, prioritize competing tasks and handle constant changeMust be willing to work occasional overtimeROCO is proud to provide its team members with:Comprehensive benefits package including affordable Medical, Dental & Vision plan options and 401(k) with employer-matched contributions.ROCO University delivers virtual, live and instructor-led training on topics relevant to the Property Management industry.Generous paid time off, including vacation, sick and personal time off, as well as paid holidays.Paid parental leave, Tuition reimbursement, Charitable donation program, Referral bonuses, Employee recognition programs and MUCH more!"}