{"jobID": "2669140683", "jobLocation": "Warren_NJ", "jobTitle": "Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.verizon.jobs", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Public (VZ) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Microsoft, Google"}, "estimatedSalary": "130000", "jobDescription": "What you’ll be doing... As a member of the Business Intelligence (BI) Group, the individual is responsible for supporting business analytics and project management of the Network Transformation Program and One Fiber Program. A strong foundation in working with R (or Python), structured and unstructured databases, SQL, and Tableau visualization is a prerequisite for this role, to help identify and fulfill customer requirements. The individual will produce professional analytics and visualization that are actionable, timely, and efficiently presented to stakeholders. End to end ownership of analytical reporting including; request evaluation, code development, data analysis, data presentation, key takeaways and delivery of product. Utilization of internal and external data, management of data processing resources, results generation and analysis to provide actionable recommendations. Develop customer reports and dashboards that provide valuable information to stakeholders across the business.Ensure accuracy in data elements, investigate anomalies and ensure corrective action is taken.Provide detailed analysis of metrics data to ensure the teams have the proper information to achieve objectives, and deliver them through expert visualization.Have a strong understanding of wireless, telecom, and customer behaviors. Identify improvement opportunities and work through implementation.What we’re looking for... You'll need to have: Bachelor’s degree in Computer Science, Statistics, Engineering, Operations Research, or related area, or four or more years of work experience.Three or more years of relevant work experience.Proficient in SQL (prefer PostgreSQL), R (or Python), relational databases, scripting language and web testing framwork.Proven experience in a QA/tester role.Able to analyze, formulate testing plan and write test scripts.Experience in project management and QA methodology.Strong attention to detail.Analytical mind and problem solving aptitude.Excellent communication skills. Even better if you have: MS or advanced degree.Experience in AWS.Experience in scorecard and dashboard designing using Tableau and OBIEE.Engineering, financial and advanced modeling skills or knowledge.When you join Verizon... You’ll be doing work that matters alongside other talented people, transforming the way people, businesses and things connect with each other. Beyond powering America’s fastest and most reliable network, we’re leading the way in broadband, cloud and security solutions, Internet of Things and innovating in areas such as, video entertainment. Of course, we will offer you great pay and benefits, but we’re about more than that. Verizon is a place where you can craft your own path to greatness. Whether you think in code, words, pictures or numbers, find your future at Verizon. Equal Employment Opportunity We're proud to be an equal opportunity employer- and celebrate our employees' differences, regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or Veteran status. Different makes us better."}