{"jobID": "2821266658", "jobLocation": "Falls_Church_VA", "jobTitle": "Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.nttdata.com/joinus", "Headquarters": "Tokyo, Japan", "Size": "10000+ employees", "Founded": " 1965", "Type": " Company - Public (9613) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Capgemini, Accenture, Deloitte"}, "estimatedSalary": "58000", "jobDescription": "Req ID: 24128 At NTT DATA Services, we know that with the right people on board, anything is possible. The quality, integrity, and commitment of our employees are key factors in our company’s growth, market presence and our ability to help our clients stay a step ahead of the competition. By hiring the best people and helping them grow both professionally and personally, we ensure a bright future for NTT DATA Services and for the people who work here.  NTT DATA Services currently seeks a Data Analyst to join our team in Charlotte, North Carolina (US-NC), United States (US).  Position Summary  The Data Analyst focuses on process of inspecting, cleaning, transforming, and modeling data with the goal of discovering useful information, suggesting conclusions, and supporting decision making. This person participates in the analysis and development of logical data base designs, data models and relational data base definitions across multiple computing environments.  Responsibilities  * Assist in data management deliverables such as business need analysis, data source identification and analysis and data modeling techniques. Participate in the analysis and resolution of issues related to information flow and content with data stakeholders.Gather data and develop reports for major statistical data calls received from various sources.Implement and maintain the reporting of data to various departments.Apply business knowledge to analyze data, develop reports and solve problems.Research and resolve any data or reporting issues that arise.Communicate all data issues or problems to management and makes recommendations for solutions.Establish and implement audit tools and procedures to monitor the team's performance.Perform ad hoc analyses of data depending on business needs.Assist ETL Architects in developing source to target mapping.  Requirements:  * Minimum of 3 years related experience.Bachelor's Degree in a technical or business discipline or equivalent technical expertise.General knowledge in IT concepts, strategies and methodologies, IT architectures, data standards and general knowledge of a business function(s) and of business operations.Proficiency in SQL, DBMS Languages, Data Profiling, Data Design and Data Architecture.Knowledge of Metadata Management tools.Knowledge of data design and analysis tools.Ability to evaluate business requirements and transform client requests into data deliverables.Basic understanding of project planning and execution.Ability to investigate and gain proficiency on new tools and techniques.Writing skills to support development of product specifications and technical documentation.Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy.Ability to interpret data, analyze results using statistical techniques and provide ongoing reports.Develop and implement data collection systems and other strategies that optimize statistical efficiency and data quality.Ability to acquire data from primary or secondary data sources and maintain databases/data systems.Ability to filter and “clean” data, and review computer reports, printouts, and performance indicators to locate and correct code problems.  Data Analysis & ReportingExperience in analysis with expertise in different technologies, business areas, application wide analysis, and proposal of solutions. Assemble, analyze, and represent business requirements. Perform data analysis on critical data defects and produce management & executive level reporting representative of defect status and trend. Perform feasibility analysis, scope projects, prioritize deliverables, recommend alternative solutions and project strategies, and engage in negotiations. These resources are also able to facilitate workshops such as JAD, RAD, and DRP sessions, etc. Senior Business Analysts should also be able to perform as team leaders when necessary.  Basic Qualifications:  -3+ years of Data Analysis Experience  -2+ years of SQL Experience  -1+ year of Financial Services Experience This position is only available to those interested in direct staff employment opportunities with NTT DATA, Inc. or its subsidiaries. Please note, 1099 or corp-2-corp contractors or the equivalent will NOT be considered. We offer a full comprehensive benefits package that starts from your first day of employment.About NTT DATA Services NTT DATA Services partners with clients to navigate and simplify the modern complexities of business and technology, delivering the insights, solutions and outcomes that matter most. We deliver tangible business results by combining deep industry expertise with applied innovations in digital, cloud and automation across a comprehensive portfolio of consulting, applications, infrastructure and business process services.  NTT DATA Services, headquartered in Plano, Texas, is a division of NTT DATA Corporation, a top 10 global business and IT services provider with 100,000+ professionals in more than 50 countries, and NTT Group, a partner to 85 percent of the Fortune 100. Visit nttdataservices.com to learn more.  NTT DATA, Inc. (the “Company”) is an equal opportunity employer and makes employment decisions on the basis of merit and business needs. The Company will consider all qualified applicants for employment without regard to race, color, religious creed, citizenship, national origin, ancestry, age, sex, sexual orientation, genetic information, physical or mental disability, veteran or marital status, or any other class protected by law. To comply with applicable laws ensuring equal employment opportunities to qualified individuals with a disability, the Company will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant or an employee unless undue hardship to the Company would result. Nearest Major Market: CharlotteJob Segment: Database, Consulting, Cloud, SQL, Technology"}