{"jobID": "2827243211", "jobLocation": "Menlo_Park_CA", "jobTitle": "Data Scientist, Marketing Science R&D;", "companyRating": "4.5", "companyInfo": {"Website": "www.facebook.com", "Headquarters": "Menlo Park, CA", "Size": "10000+ employees", "Founded": " 2004", "Type": " Company - Public (FB) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Google, Snap, Uber"}, "estimatedSalary": "155000", "jobDescription": " Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities we're just getting started.The Marketing Science R&D; team is responsible for designing and prototyping highly-scalable solutions, and to ensure successful prototypes are expanded such that all advertisers can improve the measurement and ads delivery of their marketing efforts. In service of this goal, the team identifies and executes novel solutions, develops methodologies, and partners with our product and engineering teams.  Facebook seeks an innovator to recognize new opportunities and help build highly-scalable, scientifically rigorous measurement and ads delivery systems. These efforts are instrumental for shifting the industry and marketers to evaluate their initiatives based on true business value, and to shape Facebooks ads product strategy with insights gained from these new platforms.  This position is full-time position based in either Menlo Park, California or Seattle, Washington. Responsibilities:"}