{"jobID": "2803960994", "jobLocation": "Detroit_MI", "jobTitle": "Service Manager", "companyRating": null, "companyInfo": {"Website": "www.otpnet.com", "Headquarters": "Columbus, OH", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Service ManagerAir TechnologiesJob Overview:As part of our mission and core values, we work to achieve our mission, honor our values and follow our guiding principles every day by following a process and mindset we call COMMIT. Through COMMIT, we build loyalty and create a shared vision of success with customers, suppliers and co-workers. Ohio Transmission Corporation is one of the largest industrial distributors and service providers in the United States with a team of experts that prides itself on offering technical expertise and solutions across our broad product portfolio for industrial automation, electrical, fluid power, mechanical power transmissions, air compression, pumping systems, industrial finishes and fluid handling. We have over 35 locations across 17 states.We began in 1963 as a small Columbus, Ohio-based industrial distributor of mechanical power transmission equipment and pumps. From the very beginning, our company leaders stressed the importance of hiring and developing great people, treating them right and coupling their talents with a wide range of products from top vendors to provide customers with the best quality products and technical application expertise and services at the lowest possible costs. We have always believed that professional management and state-of-the-art operating and logistics systems are important to the success of the people we work with. While our product lines have expanded significantly over the years, our commitment to integrity and fairness in all transactions with customers, suppliers and associates has remained constant and allowed us to grow rapidly.We are among the largest industrial distributors in the United States, and we are planning for continued growth. Our size and strength gives us the resources to drive continuous improvement and lower costs. Our greatest strength is in the local decision-making of our people who have the flexibility to respond quickly to your needs. In every business transaction, our goal is to save our customers and partners time, money and resources through our unique combination of individual talent, excellent products and corporate strength.You become a resource to deliver the value our customers care about. Air Technologies has grown to is the largest industrial compressor distributor in the world!As a Service Manager, a typical day might include the following:Calling on existing customers to follow up on recent service or installation.Review and approve service agreements to be presented to our customers.Collaborate with your team on a large jobs, including those involving the sales team.Resolve customer service issues involving the service department.Planning for the hiring, training and advancement of all service personnel within the region.Work with the inside support team to ensure efficient scheduling of the technicians.Ensure that the team effectively executes established processes and procedures. Provide guidance and support when needed.Ensures that all service related business is processed daily in accordance with set expectations.Air Technologies is an Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability status, protected veteran status, or any other characteristic protected by law.  Our benefits program includes medical, dental and vision care coverage and a 401(k) savings plan Additionally, we offer paid time off, short-and long-term disability coverage, life insurance, Employee Assistance Program, and Healthy Living Programs. About Air Technologies: We are always looking for highly talented sales engineers and service technicians who align with our mission and core values of integrity, achievement, investment and balance.  Since 1963, Air Technologies has established the kind of success that comes from hiring the best people, providing the best product and service solutions, and committing to the highest quality customer service. Today, Air Technologies is the largest industrial compressor distributor in the world! We are Atlas Copco's top performing distributor in the U.S., and Atlas Copco is the most purchased air compressor in the world!  We are committed to supporting strong and successful careers for our employees. We offer an outstanding benefits package including superior compensation, a 401K plan and wonderful opportunities for advancement. Join a winning team at Air Technologies!  www.aircompressors.com  EOE/M/F/Vet/Disabled"}