{"jobID": "2689158082", "jobLocation": "Houston_TX", "jobTitle": "Investigative and Deal Accounting Analytics Manager", "companyRating": "3.8", "companyInfo": {"Website": "www.pwc.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "93000", "jobDescription": " PwC/LOS Overview  PwC is a network of firms committed to delivering quality in assurance, tax and advisory services.  We help resolve complex issues for our clients and identify opportunities. Learn more about us at www.pwc.com/us.  At PwC, we develop leaders at all levels. The distinctive leadership framework we call the PwC Professional (http://pwc.to/pwcpro) provides our people with a road map to grow their skills and build their careers. Our approach to ongoing development shapes employees into leaders, no matter the role or job title.  Are you ready to build a career in a rapidly changing world? Developing as a PwC Professional means that you will be ready to create and capture opportunities to advance your career and fulfill your potential. To learn more, visit us at www.pwc.com/careers. PwC Advisory helps our clients with their most challenging imperatives from strategy through execution. We combine the breadth of knowledge of over 48,000 global professionals with deep industry knowledge to deliver custom solutions for our clients. We work with the world's largest and most complex companies and understand the unique business issues and opportunities our clients face. Job Description Businesses today are confronted daily by corruption, fraud and other unplanned events. Our growing Advisory Forensics Services practice delivers clarity and confidence to prevent, respond to and remediate our clientâs complex legal, regulatory and economic crime challenges whether in one country or worldwide. With a strong Forensics presence in more than 75 countries, we thrive on dealing with the most complex problems and that can mean investigating allegations of fraud or corruption, assisting to resolve disputes, addressing regulatory anxieties or responding to threats. Our Forensics Services practice possess a combination of both forensic technology and accounting professionals in offering clients a unilateral advantage in investigating issues that extend across borders or that afflict multinational organizations.  With advanced technology solutions and data preservation techniques, we analyze your information to provide you with answers to the who, what, and when of investigations and other complex, high-risk situations.  Our Digital Forensics and eDiscovery team helps clients protect opportunities in today's evolving business landscape operating over 14 global centers and 60 forensic labs. Our team employs a comprehensive investigative approach driven by its high tech crime investigators and advanced analytic capabilities to solve our clientâs most challenging issues in a defensible manner suitable for presentation in a court of law. We apply advanced, strategic approaches to assist our clients with complex information management and analysis challenges by combining data analytics techniques, sophisticated technology tools, and information management principles to help our clients make well-informed decisions.  The Forensic Technologyâs Investigative and Deal Accounting Analytics consultants deploy their technical and data analysis skills coupled with strong business acumen, accounting and financial reporting knowledge to leverage the power of financial and operational data in addressing a range of business challenges, including: Investigate accounting irregularities and respond to fraud allegationsEnable our clients to execute their divestitures, mergers, and acquisitions in an efficient and accelerated manner to maximize the deal valueHelp to address commercial disputes and tax-related controversies or take advantage of tax saving opportunities In delivering these services, our Investigative and Deal Accounting Analytics professionals deliver fact-based, data driven reliable insights to inform decision makers on a range of high impact topics critical to a particular exercise, from comprehensive divested business' financial statements, to transaction-level details supporting a given Tax position, to optimization of the entityâs product pricing and customer structure post transaction.  Our high performing team brings a unique perspective through the convergence of general business / deal acumen, finance and accounting, and deep technical capabilities.  Our go-to-market approach is to secure wins from becoming our clientsâ trusted advisors by bringing the full power of the Firm teaming with complementary capabilities across different Firm practices: Forensic Accountants, Transaction Services, M&A; Advisors, Tax and others. Position/Program Requirements  Minimum Year(s) of Experience: 5  Minimum Degree Required: Bachelor's degree  Degree Preferred: Bachelor's degree or Master's degree in Management Information Systems, Engineering, Accounting, Computer Science, Mathematics, Finance, Economics, Statistics, MBA from an accredited college/university.  Certification(s) Preferred: Database and programming certifications, such as Oracle, MS SQL Server; CPA; and/or PMI.  Certified Fraud Examiner is a plus. Knowledge Preferred:  Demonstrates proven extensive knowledge of, and/or success in managerial roles involving, forensic technology, forensic accounting, technical investigations, and/or accounting-related and business consulting projects, preferably for a global network of professional services firms, including the following areas: Managing business transactions, such as divestitures, mergers and acquisitions;Managing relational and NoSQL Databases, especially utilizing one or more of the following environments: Data Visualization ToolsTableau; Spotfire, QlikView, etc., R or Base SASData AnalyticsMicrosoft SQL, Oracle, Informatica; or, VBA or Python;Managing ERPs, especially multiple business and accounting cycles, financial reporting activities, and data models;Understanding industry-specific business processes and accounting practices, such as Healthcare, Oil and Gas, Utilities, etc.; and,Consulting or helping to manage industry-related data analytics and/or financial management, emphasizing multiple business and accounting cycles.Skills Preferred: Demonstrates extensive level of ability in and/or proven record of success with forensic technology, forensic accounting, technical investigations and/or accounting-related and business consulting projects, preferably for a global network of professional services firms, including the following areas: Managing multiple engagement teams and competing priorities in a rapidly growing, cross-functional, fast-paced, interactive, results-based team environment;Leading teams to translate business and accounting requirements into technical solutionsâ specifications;Creating, managing, and utilizing high performance relational and NoSQL databases such as Microsoft SQL Server, Oracle, Microsoft Access, OLAP and other proprietary software;Gathering, standardizing, and analyzing voluminous transactional electronic data, such as banking records, general ledgers, sales and inventory data, etc.;Querying and mining large data sets to discover transaction patterns, examining financial data and filtering for targeted information that utilize both traditional and predictive/advanced analytic methodologies;Designing and developing user interfaces and database reports;Creating proposals and other business development activities as appropriate;Fostering positive working relationship with clients and working effectively with client management and staff at all levels to gather information and perform services;Identifying and addressing client needs: building, maintaining, and utilizing networks of client relationships and community involvement; communicating value propositions; managing resource requirements, project workflow, budgets, billing and collections; and preparing and/or coordinating complex written and verbal materials;Communicating cogently when writing, speaking and/or presenting to client finance and technology personnel, client in-house and outside legal counsel, compliance personnel, investigators, vendors and internal team members; and,Leading and training teams in the aforementioned activities, coaching staff including providing timely meaningful written and verbal feedback and creating an atmosphere of trust; seeking diverse views to encourage improvement and innovation."}