{"jobID": "2726587807", "jobLocation": "Jersey_City_NJ", "jobTitle": "Sr. Clinical Research Scientist, Temp", "companyRating": "3.1", "companyInfo": {"Website": "www.noven.com", "Headquarters": "Miami, FL", "Size": "201 to 500 employees", "Founded": " 1987", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "114000", "jobDescription": "Job Summary/ObjectiveThe Clinical Scientist will functionally report to Clinical Lead, and help drive the development of one or more molecules from pre-phase 1 through global registration. In this role the Clinical Scientist, in conjunction with the Clinical Lead, will provide guidance and leadership to the broader project teams.Essential FunctionsContribute to the compound’s development strategy and assisting with Protocol design. As such, contributing to the writing of clinical development plan, clinical studies, etc., as appropriateProvide scientific and clinical expertise in the development and writing of Clinical Protocols and clinical development plans that strive to achieve the target product profile. This may include identifying and reaching out to KOLs, as well as organizing and leading meetings with external experts to obtain guidance on study designs, as appropriateContribute to the clinical and scientific background sections of various documents, including Protocols (as described above), Investigator’s Brochures, INDs, CTAs, Study Reports, Clinical Summaries, Clinical Overviews, and other documents, as appropriateThe Clinical Research Scientist will review SAE reports, AE and SAE listings, AE coding, concomitant medication coding, medical history coding, tables and listings of safety and efficacy data, and other output from clinical studies. The Clinical Research Scientist may perform data assessment and take on a leadership role in this area, as appropriateParticipate as a Clinical Trial Team (CTT) member, as appropriate. Function as Project Clinician in the CTT setting with medical/clinical support from a Clinical Lead. In this role the Clinical Research Scientist will work closely across functions (e.g., Preclinical, CMC, Clinical Operations, Biostatistics, Regulatory, Clinical Pharmacology, Data Management, Safety/Pharmacovigilance etc.…) to ensure the effective and efficient conduct of clinical studies to milestones, quality and budgets.Participate in the Clinical Sub-team meetings, and assist the Clinical Lead in carrying out their role as leader of the Clinical Sub-team, including delegation by the Clinical Lead to lead the meeting when appropriateParticipate in Pharmacovigilance Signaling Meetings and Safety Working Group meetings, as appropriateParticipate in or lead regularly scheduled and ad hoc teleconferences and meetings with clinical investigators, as appropriate. Participate in and contribute clinical insights and interpretations on routine calls for Phase 1, 2, 3 studies where study design, data review (safety and efficacy) are reviewed.As appropriate, work closely with Investigators and other site personnel, in partnership with other Development functions, such as Clinical Operations and Pharmacovigilance, in order to facilitate the efficient startup, conduct and close-out of clinical trials, and to answer questions from investigators and other site personnel regarding clinical and study conduct questions. In this capacity the Clinical Scientist will help ensure patient safety, maintain appropriate adherence to the Protocol, and evaluate Protocol exception requests. For Investigator Meetings and startup of individual studies, the Clinical Scientist may independently develop Protocol-specific materials and lead internal or external training, as appropriateIn conjunction with business development and clinical staff, review external co-development and in-licensing opportunities. The Clinical Scientist may participate in and present analyses from these reviews, as appropriateSupport the Clinical Lead in responding to requests from Regulatory AuthoritiesWhen appropriate, identify, promote, and lead improvement initiativesAssists in a seamless transition from preclinical to exploratory development or from exploratory development to late-stage development CompetenciesJUDGMENT / DECISION MAKING:Strong interpersonal skills, and comfort working in a multidisciplinary, matrix environmentExcellent written and verbal communication skills, with demonstrated potential to present clinical data, development plans and strategies clearly and accurately to relevant audiences. Record of good mentoring and leadership experienceAbility to support clinical activities to milestones and budgetsEnthusiasm for clinical research and drug development in an industry setting FINANCIAL RESPONSIBILITY: NoneRESPONSIBILITIES FOR CONTACTS:Internal and external contact requiring a high degree of tact Job RequirementsOther ElementsEducation & Experience: PhD, PharmD, BS, MS or comparable degree, may be sufficient in the setting of significant experience performing a similar Clinical Research Scientist role in a clinical research groupMinimum 4 years clinical research experience in an industry setting, with experience in clinical research, particularly in the areas of Protocol development, study conduct, and data reviewTrack record of achievement and innovation in pharmaceutical medicineUnderstanding of issues related to the design and performance of technologically demanding trials. Confident discussing scientific/mechanistic aspects of drug developmentTrack record of partnering with clinical leaders in designing excellent clinical studies and demonstrated potential to designDevelopment plans that produce both timely and good quality data Supervisory Responsibilities: NoneTravel: NoneWorking ConditionsAir conditioned office. Majority of the time spent sitting at a desk, operating computer and reading documents Physical Demands: Visual acuity and manual dexterity required Noven is an equal opportunity and affirmative action employer which recruits, hires, trains and promotes persons in all positions without regard to race, color, religion, sex, national origin, citizenship, disability, or veteran status or any other legally protected status."}