{"jobID": "2805805630", "jobLocation": "Livonia_MI", "jobTitle": "Installation Supervisor", "companyRating": "3.7", "companyInfo": {"Website": "www.renewalbyandersen.com", "Headquarters": "Cottage Grove, MN", "Size": "501 to 1000 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Marvin Windows & Doors, Window World"}, "estimatedSalary": "56000", "jobDescription": "DescriptionPURPOSE: Manages the installation process to ensure Homeowner delight while focusing efforts to meet and/or exceed budget expectations. Ensure that installation process associates are prepared and able to deliver flawless installation and service the first time. It Takes the Best to Make the BestWe’re looking for top the top Window and Door Installers in the industry! Are you a skilled manager who wants to bring your skills and expertise to one of the premiere home-improvement service providers in the country?  Renewal by Andersen was founded with a mission to redefine the industry and to offer a different—and better—window replacement experience. Our Signature Service is an exclusive combination of the best people in the industry, a superior process, and an exclusive product. From design and sales through installation and service, we own the entire process—giving our homeowners a single point of contact and creating a most streamlined, hassle-free, white-glove renovation experience.  We’ve long understood that a quality experience is in the details. All of the care, pride, professionalism, and craftsmanship we put into our products would mean little without the very best professional installation—which is why we don’t just take pride in our installers, we celebrate them.  We’re not alone in that—read just a handful of reviews from some of our more than 500,000 happy customers across the nation, and you will hear them singing the praises of our Certified Master Installers.  If you are professional who is experienced in ensuring homeowner delight, as measure through customer satisfaction, we want to hear from you. We bring on folks who are proud of the work they do and the products they install, and who are dedicated to working with individual homeowners and going the extra mile whenever necessary (and often even when it’s not!). We’re looking for someone who is willing to exceed homeowner expectations on the timing of installation process by developing their capable workforce while also managing independent contractors. Why We’re Different Our installers are technicians—but they are also customer-service specialists and brand stewards. As an Installation Supervisor, you will need both: Soft Skills to serve as the “face” of Renewal by Andersen by: Taking time to get to know the homeownersAnswering any questions that come up And… Business Aptitude to ensure the success of our business by: Meeting or exceeding planned margins and revenue dollar goalsLeading the safety initiatives of the installation processSupervision of installation associates including performance planning, fostering open communication and answering team concerns and questionsMaintaining homeowner delightQualificationsDo you have:Four year degree or an equivalent combination of education and experience.A minimum of 7 years of work experience in the home improvement or other closely related field.A minimum of 5 years of direct supervision experience.Previous customer service experience, especially win/win problem solving and conflict resolution skills required.Strong written and verbal communication skills.Knowledge of applicable building codes and construction techniques.Previous work experience recruiting and managing independent contractors.Ability to work and lead in a team environment.Basic financial knowledge. Previous P&L; responsibility helpful, but not required.Scheduled availability to work when homeowners are available and in their homes (between the hours of 7 a.m. – 7 p.m.)Empathy and customer service skills.A strong sense of accountability—and an equally strong sense of teamworkThe ability to confidently handle confrontation/conflicts using a tactful and diplomatic approach, and the ability to maintain perspective under demanding conditions.Diagnostic skills: assessment, problem solving, and decision makingSelf-motivation, time- and work-process management skills, and the ability to work independently.Then we have:Exception base pay with opportunity for profitable incentive payoutTraining and ongoing profession development opportunitiesGenerous benefits, profit sharing, and retirement plansA chance to help people transform their homes and their livesJob:Installation/Field ServiceLocation:Livonia, MI USOrganization:Renewal by Andersen Corp."}