{"jobID": "2728400611", "jobLocation": "Wyoming_MI", "jobTitle": "Restaurant Manager", "companyRating": "3.1", "companyInfo": {"Website": "www.dennys.com", "Headquarters": "Spartanburg, SC", "Size": "5001 to 10000 employees", "Founded": " 1953", "Type": " Company - Public (DENN) ", "Industry": " Restaurants, Bars & Food Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "36000", "jobDescription": " Are you up for a Challenge?  Do you have a strong commitment for restaurant excellence and a passion for Guests?  Are you interested in a Career in a fast-paced environment?  We would love to speak with you!!  Why Denny's??  Our benefits include, but aren’t limited to: Quarterly and annual paid bonus opportunity up to 15% as RM of your base salaryInsurance including medical, dental, vision and life401(k) plan with company match up to 5%11 company paid floating holidaysTwo weeks of vacation accrual that begins 30 days after hireTuition Reimbursement ProgramAdvancement opportunities Position qualifications include, but aren’t limited to: Minimum of two years restaurant, hospitality or retail experience. Additional operations and/or leadership experience strongly preferredAssociate's or Bachelor's degree preferred or equivalent combination of education and experienceServSafe® Certification requiredGreat communication skillsProven ability to solve problemsStrong business acumen to understand financial statements and contributing factorsAbility to work day and evening shifts, weekends, and holidays as the schedules are rotatedReliable transportation Denny’s, Inc. is committed to providing equal employment opportunity for all persons regardless of race, color, religion, sex, sexual orientation, gender identity, age, national origin, citizenship status, disability, or other protected characteristic.  Denny's, Inc. is committed to providing equal employment opportunity for all persons regardless of age, race, creed, color, national origin, citizenship status, religion, sex, sexual orientation, gender identity, disability, genetic information, military or veteran's status, criminal background, or any other characteristic protected by Federal, State, or local law.  Applicants requiring reasonable accommodation for any part of the application process should contact 864-597-8000. PLEASE DO NOT CONTACT THIS NUMBER TO CHECK THE STATUS OF YOUR APPLICATION."}