{"jobID": "2831249673", "jobLocation": "Bridgewater_NJ", "jobTitle": "Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.cognizant.com", "Headquarters": "Teaneck, NJ", "Size": "10000+ employees", "Founded": " 1994", "Type": " Company - Public (CTSH) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Tata Consultancy Services, Accenture, Capgemini"}, "estimatedSalary": "67000", "jobDescription": " Senior Architect  Qualification:Science / Engineering graduateResponsibility:  Innovation and Thought Leadership:• Participate in external forums (seminars, paper presentation etc) to showcase Cognizant capabilities and insights under guidance of senior team members. Understand client's existing business and explore new avenues to save cost and bring process efficiency.Identify business opportunities to create reusable components/accelerators and reuse existing components and best practices.Support the patent filing process for the IP assets created (applicable to some CoEs).'Technology Consulting:• In collaboration with the Sr Architect, analyze application/ technology landscape, process, tools and arrive at the solution options best fit for the client.Analyze Cost Vs Benefits of solution options.Support Sr Architect to create a technology/ architecture roadmap for the client.Alliance Management:• Identify alliance partners based on the understanding of service offerings and client requirements.In collaboration with Sr Architect, create a compelling business case around the offerings.Conduct beta testing of the offerings.Knowledge Management & Capability Development:• Publish and Maintain a repository of solutions, best practices and standards and other knowledge articles.Conduct and facilitate knowledge sharing and learning sessions across the team.Gain industry standard certifications on technology and architecture consulting.Support Technical skill building (including hiring and training) for the team based on inputs from project manager.Mentor new members in the team in technical areas.Gain and cultivate domain expertise to provide best and optimized solution to customer.People Management:• Set goals & Manage performance of reporting team members.Provide career guidance to team members.Asset Development and Governance:• Understand the plan for asset development.Design assets as per plan (if required).Conduct pilot run/review to validate the assets, as feasible.Track utilization of reusable assets / architecture components across the organization.Sales Support and Project Estimation:• Support for developing RFPs and collaterals for proposals from a technical solution/ estimation/ risks perspective.Conduct demo's, and arrange for the demos based on client profiles, if required.Anchor proposal development with crosslinkages across multiple competency units to arrive at a coherent solution proposal with focus on presenting unique value propositions and clear differentiators.Requirement gathering and Analysis:• Work with customer and other teams to collect, analyze and understand the requirements including NFRs.Analyze gaps/ tradeoffs based on current system context/ industry practices and clarify the requirements by working with the customer.Solution Definition:• Develop / Enhance the solution architecture (Application / technical / Infrastructure as applicable) meeting functional / non functional requirements and aligned to industry best practices.Solution Design (including Data modeling , Application design, Infrastructure design, Team structure) & Capacity sizing to meet the requirements & SLAs of target state and intransition as applicable.Identify Proof Of Concept testing (POC) needs and conduct POCs as applicable.Identify need for developing accelerators and Develop as applicable specific to the engagement.Identify key technical metrics to measure the SLA / requirements compliance.Define, adopt and create required documentation on standards and guidelines.Stakeholder Management:• Monitor the concerns of internal stakeholders, follow through on commitments and achieve timely resolution of issues.Conduct initiatives to meet client expectations.Work to expand professional network in the client organization.Project Management Support:• Assist the PM to identify technical risks and comeup with mitigation strategies.Business and Technical Research:• Analyze market trends / client requirements/ secondary research.Identify new ideas and provide inputs to senior stakeholders for developing blueprint / PoC.Brand Building:• Organize/ Participate in events like webinars, boot camps, seminar conference, client conference to showcase the capability.Identify opportunities to crosssolutionize across project(s) within or outside the BU.Technical SkillsSNoPrimary SkillProficiency Level *Rqrd./Dsrd. 1 SFDC Einstein PL4 Required* Proficiency LegendsProficiency LevelGeneric Reference PL1 The associate has basic awareness and comprehension of the skill and is in the process of acquiring this skill through various channels. PL2 The associate possesses working knowledge of the skill, and can actively and independently apply this skill in engagements and projects. PL3 The associate has comprehensive, in-depth and specialized knowledge of the skill. She / he has extensively demonstrated successful application of the skill in engagements or projects. PL4 The associate can function as a subject matter expert for this skill. The associate is capable of analyzing, evaluating and synthesizing solutions using the skill."}