{"jobID": "2589080077", "jobLocation": "Bethesda_MD", "jobTitle": "STOPS MRI DATA ANALYST, SENIOR", "companyRating": "3.6", "companyInfo": {"Website": "www.camris.com", "Headquarters": "Bethesda, MD", "Size": "201 to 500 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Government", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "111000", "jobDescription": " Overview  CAMRIS International is an international development and research firm that realizes innovative solutions to health and development challenges through high-quality, cost-effective program and research management services. With experience working in more than 80 countries, we combine our proven systems with today’s most effective, evidence-based best practices to improve the lives of people around the world. We apply a customized, customer-centric, cost-effective business approach to offer greater value to our clients and challenge the way things have always been done in our field.  CAMRIS clients include U.S. government agencies and multilateral and private organizations. Our core practice areas include public health, agriculture and food security, economic development, education, environment, humanitarian assistance, democracy and governance, and medical research.  This is an opportunity for employment or a contract, but we reserve the right to make no selection or award. Contingent on bid award.  CAMRIS is seeking exceptional candidates to provide scientific, technical, and other professional support services to assist the National Institutes of Health (NIH-- which is comprised of the Office of the Director and 27 Institutes and Centers) in meeting its operational objectives. Responsibilities Develops new approaches for statistical support to researchers. Creates, implements, validates and analyzes novel analysis techniques. Provides interpretation of data obtained from MRI scans. Independently implements analysis of techniques from the literature applicable to the laboratory needs. Independently implements analysis of techniques from the literature applicable to the laboratory needs. Prepares scientific papers and presentations. Performs quality control of data. Develops new approaches for maintaining databases. Monitors data for discrepancies and accuracy. Provides hypotheses for data discrepancies. Performs system administrator duties for workstations and servers. Maintains and improves the privacy, security, and reliability of the research database system. Participates in formal and informal conferences and contributes to the development of interpretive concepts. Independently consults and trains staff in the use of equipment and techniques used to analyze data.Qualifications 2-5+ years experience in a related field. Experience with both UNIX and Windows environments with computer programming skills. Programming experience in “C”, Perl, and Matlab. Knowledge of statistics and software programs like SPSS and SAS. Minimum Education: Ph.D. degree in a science related field. Three (3) years of specialized experience plus a Master’s degree is equivalent to a Ph.D. Five (5) years of specialized experience plus a Bachelor’s degree is equivalent to a Ph.D. This effort is for a bid and contingent on award."}