{"jobID": "2767943130", "jobLocation": "Santa_Clara_CA", "jobTitle": "Lead Data Scientist, Universal Media", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "180000", "jobDescription": "Lead Data Scientist, Universal Media Job Number: 113463068Santa Clara Valley, California, United StatesPosted: May. 28, 2018Weekly Hours: 40.00 Job SummaryBe ready to make something great when you come here. Dynamic, inspiring people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same passion for innovation also applies to our business practices - strengthening our commitment to leave the world better than we found it. You should join the Apple Universal Media team if you want to help deliver the next amazing Apple product.  The Universal Media Engineering team is growing. We are responsible for powering Siri and Universal Search for the new Apple TV, Safari and Spotlight across all Apple devices. As an integral member of the team, you will own key modules of the product and be responsible for delivering industry grade quality solutions.Key Qualifications You have a minimum of 3 years experience in a professional programming position with Java or similar languagesYou bring an in-depth knowledge of database systems and domain modeling techniques.You have a thorough understanding of dependency and maintenance systems such as Spring, Guice, Maven, and Git.You haave passion for technology, value life-long learning, and enjoy finding the right tool for the job.You have excellent judgment and integrity with the ability to make timely and sound decisionsWe value your passion for quality DescriptionThe Universal Media seeks a self starting, energetic individual who is not afraid to question assumptions, is passionate about technology, and is capable of mastering full-stack development. Our team focuses on sophisticated tools and services that bridge the worlds of automation and human task management. Excellent understanding of workflow and data modeling techniques, performance, and the balance between synchronous and asynchronous processing is a must. The candidate should have several years experience developing large-scale web-based applications. Experience with business rule, expert system, or machine learning systems is a plus. We're looking for an individual who likes a challenge, tackles problems with imaginative solutions, works well in collaborative teams, and can produce high quality software under tight deadline constraints. You will join a hands-on development team that fosters creativity and generates novel solutions to deliver engineering excellence.EducationBS in Computer Science, Mathematics, or EE, or relevant industry experience is required. MS in Computer Science or related technical field is desired."}