{"jobID": "2650553199", "jobLocation": "San_Francisco_CA", "jobTitle": "Lead Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.glu.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2001", "Type": " Company - Public (GLUU) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Zynga, KIXEYE, Kabam"}, "estimatedSalary": "96000", "jobDescription": " Glu Mobile (NASDAQ:GLUU) is a leading global developer and publisher of free-to-play games for smartphone and tablet devices. Glu is focused on creating compelling original IP games such as Cooking Dash, Deer Hunter, Covet Fashion, Design Home, Racing Rivals, TAP Sports Baseball, and branded IP games including Kim Kardashian: Hollywood, on the App Store, Google Play, Amazon Appstore, Facebook, Mac App Store, and Windows Phone. We have worldwide studios in North America, Russia and India. Our headquarters are in the heart of the bustling SOMA district of San Francisco.  As a Lead Data Analyst, you will be the analytical data partner for our game studios. You will work closely with Game Designers & Product Managers to transform subjective discussions about product into concise analytic questions that deliver actionable answers. You will take a leadership role in managing studio relationships, mentoring junior analysts & shaping the evolution of our analytics infrastructure. This is a high visibility role that will have a direct impact on the success of some of our biggest titles. Responsibilities: For this role, we are looking for someone with strong business/product acumen & technical foundation. Work with game teams to measure and optimize performance of titles in beta and after worldwide launch.Using state of the art big data technology, such as Hadoop or HP Vertica, to sift through billions of rows of data to answer challenging business questions.Help design and analyze AB and multivariate experiments.Using Tableau to build dashboards that allow game teams to self serve custom data for their titles.Collaborate with game team to define telemetry of titles.Continuously learn new technologies that advance analytic function at Glu (e.g. R, D3, Python, etc…)Qualifications:Bachelors/Masters Degree in Computer Science, Economics, Mathematics, Statistics or related field.5+ years experience as analyst, data scientist, or related quantitative role.High proficiency with SQL or HiveQL.Comfortable in UNIX, Python.Understanding of statistical analysis and familiarity with core statistical functions.Excellent presentation and communication skills.Passion for aggressively finding opportunity in data.Preferred Skills:Passion for gaming.Experience with Hadoop, HP Vertica, and other big data technologies.Experience with modern programming languages (e.g. python, javascript, perl)Experience with statistical packages such as R or SAS.Predictive analytics or machine learning experience.Mentoring/management experience. All qualified applicants will receive consideration for employment. Glu is an equal opportunity employer committed to diversity in the workplace. We welcome people of different backgrounds and experiences to ensure a diverse and inclusive workplace."}