{"jobID": "2720608029", "jobLocation": "Santa_Clara_CA", "jobTitle": "Senior Market Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "115000", "jobDescription": "Senior Market Data Analyst Job Number: 113610911Culver City, California, United StatesPosted: Jun. 14, 2018Weekly Hours: 40.00 Job SummaryBeats by Dre's Worldwide Channel Development team is seeking a Senior Market Data Analyst who’s passionate about using data and analytics to drive strategic recommendations not only applied to internal key performance indicators, but also around the overall headphone market competitive landscape. You should be capable of building solutions and inferences from multiple data sets and information sources.  You'll join a team of visionary individuals whose work plays a meaningful role in go-forward business decision-making, which can include exposure to confidential business information.  The Senior Market Data Analyst will be required to partner with multiple cross-functional partners within the Beats and Apple brands to find solutions to complex problems, within an autonomous work environment.Key Qualifications Proficient on Mac iOS (Specifically applied to Microsoft Excel and Keynote)Excellent written and verbal communication skills3-5 years experience applying analytical techniques to provide solutions to real business problems3-5 years experience with SQL and big data systems and toolsCreativity to go beyond tools to deliver the best solution to the problem and understand market impactInquisitiveness and a drive for continued self-improvement and development of new skillsAbility to prepare reports of findings, illustrating data graphically and translating complex findings into executive recapsAbility to story-tell based upon findings within data DescriptionDefine the business needs and prioritize worldwide market data.  Utilize data and analytics in order to compose global insights and key performance indicators for the Headphone and Speaker market including competitors, market share, average selling price, unit velocity, and market trends in all geographic areas where Beats is currently positioned.  Identify trends by product type, technology, and geographic maturity to provide analytically-backed strategic recommendations to cross-functional teams within Beats by Dre's Worldwide Channel Department in an effort to shape and support go-to-market strategies.  Use market intelligence and Beats historical reporting/insights to scope effectiveness of go-forward demand generation strategies. This includes, but is not limited to collaborating with Beats by Dre Finance, Marketing, worldwide supply planners, Product Marketing and worldwide sales leads to align on upcoming P&L; annual unit forecasts, supply plans for ongoing and end-of-life products, return on investment funding analysis, and effectiveness of promotional activity.  Analyze 3rd party market data suppliers based upon quality, coverage, freshness, and relevance of data-sourceEducationBachelor's Degree Required"}