{"jobID": "2678109563", "jobLocation": "Palo_Alto_CA", "jobTitle": "Lead Data Scientist", "companyRating": "4.3", "companyInfo": {"Website": "www.hackerrank.com", "Headquarters": "Palo Alto, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "163000", "jobDescription": " HackerRank is a Y Combinator alumnus backed by tier-one Silicon Valley VCs. We are a skills-based hiring platform that helps companies evaluate technical skills, better. We’re driving a new paradigm shift by eliminating resumes and creating opportunities for hundreds of thousands of programmers worldwide. We have a community of 3.5M developers and 1,000 customers across industries, and the best part is we are just getting started. Our customers - including VMware, Twitter, Capital One, and many other Fortune 100 companies - rely on HackerRank to build strong engineering teams.  We've assembled an amazing team that’s passionate about creating more opportunities for people by changing the way companies hire. We are ambitious, data-driven givers, and we love delighting customers. If you're interested in scaling HackerRank by working with some of the largest companies in the world, let’s talk.  We have approximately 100 million challenge submissions on our platform. Leverage this data, along with data from our customers, to drive towards the vision of reducing the number of in-person technical interviews. Empower hiring managers to bring in technically qualified candidates.WHAT YOU’LL LOVE TO DO…Be the data expert in a team innovating on data-driven featuresBuild a deep knowledge of the technical assessment aspect of hiringBuild & curate a prioritized catalog of all data opportunities in our product offeringGuide product roadmap and strategyHave company-wide impact through data-driven decisions and insightsDrive well-defined data experiments; evaluate resultsBring selected models to production; test and evaluateWHAT YOU’VE ALREADY DONE…4+ years experience as a data scientist, with a proven record of deploying your models in productionExperience framing data problems clearly and relating them to business needs. You are a data scientist who can relate to our product use cases and frame problems and solutions in the context of these use cases.Experience with a variety of modeling approaches and model evaluation techniquesGood judgment on the types of problems that are feasible to solve and have the largest ROIExperience working with Subject Matter Experts; in this case, recruiters and hiring managers to improve model precisionGET EXCITED. Because you're about to have a huge impact. HackerRank is growing fast and we're having a great time working together as we build! We're a fun, friendly, passionate bunch. We’re a team of teams and we’re looking for more smiling faces to come join us! The position is full-time and based in the heart of Silicon Valley. PERKS & BENEFITS. As if working alongside the smartest brains wasn’t enough. We have a full package of competitive benefits and perks available for you and your dependents: 100% employee coverage for Medical, Dental, and Vision; with 70% coverage for dependentsEmployee stock options, 401k, flexible work hours and time off, commuter benefitsMonthly wellness classes, free lunches, snacks and endless supply of Philz CoffeePing pong, scooters, foosball, and beautiful trails nearby, to name a few!"}