{"jobID": "2789225617", "jobLocation": "Chicago_IL", "jobTitle": "Sr Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.coyote.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Transportation & Logistics", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " C.H. Robinson, UPS Supply Chain Solutions, Caterpillar Logistics Services"}, "estimatedSalary": "122000", "jobDescription": "Wake up each day knowing that you are a part of something special. Something real. Something bold. What you do can make a difference. Coyote is an industry-leading transportation and logistics service provider that believes in doing the right thing every time. Every hour. Every minute. Every second. Are you looking for a place where you will have a role in shaping an industry? Are you Tenacious, True, Tribal, and Smart? Then it’s time for you to apply to join the pack.The Data Science team is looking for an experienced individual that has a passion for deriving value from data and an insatiable curiosity for learning and trying new things. The Sr. Data Scientist will be responsible for conducting statistical analysis, developing methodologies and contributing to a variety of research activities. Primary responsibilities will also include suggesting new research approaches and exploring relevant evolving technologies. Other Responsibilities include creating solutions that allow for fast and streamlined integration between Data Science products and the rest of the Coyote ecosystem. Daily Tasks & ResponsibilitiesCreate solutions to efficiently manage and consume various models and predictive toolsCreate, test and tune predictive and prescriptive models leveraging any combination of relevant disciplinesResearch different modeling techniques that can be used for current and future solutionsEssential Skills, Characteristics, & ExperienceMS or PhD in Mathematics, Statistics, Physics7+ years of experience in machine learning and predictive modeling at a professional levelStrong quantitative analysis, statistics, programming, and modeling skillsExperience manipulating, processing, and analyzing large data setsProficiency in MS SQL or similarExpert in Python and/or RValued Skills & ExperienceMS Azure or AWSAzure Machine LearningMS SQL Server 2016Spark, SciKit Learn, TensorFlowNonlinear optimization, graph theoryWhy Coyote?Onsite training & ongoing career developmentCompetitive base salaryComprehensive benefits packageGreat perks like onsite haircuts, massages, and intramural sportsSignificant advancement opportunities for outstanding performersCasual dress and company lunchCoyote is an at-will employer."}