{"jobID": "2836709451", "jobLocation": "Chicago_IL", "jobTitle": "Anthem Enterprise Data Warehouse Subject Matter Expert (Bus Info Analyst Sr) - AIM Chicago - PS", "companyRating": "3.5", "companyInfo": {"Website": "www.antheminc.com", "Headquarters": "Indianapolis, IN", "Size": "10000+ employees", "Founded": " 2004", "Type": " Company - Public (ANTM) ", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "44000", "jobDescription": "This position will be located at AIM's corporate office in Chicago IL (near O'Hare Airport).  Your Talent. Our Vision. At AIM Specialty Health (AIM), a  proud member of the Anthem, Inc. family of companies, it’s a  powerful combination, and the foundation upon which we’re creating greater  access to care for our members, greater value for our customers, and greater  health for our communities. Join us and together we will drive the future of  health care. This is an exceptional opportunity to do innovative work that  means more to you and those we serve.  The AIM  Analytics team is seeking an individual who is curious, creative, and assertive  to become the Subject Matter Expert within our business analytics team in the  use of Anthem data from the Enterprise Data Warehouse (EDM). The successful  candidate will collaborate with others and recommend metrics based on a deep  knowledge of available provider, member, and utilization data. This individual  will use his or her SQL skills to query and massage data, create tables, and  generate business reports as appropriate. He or she will readily share  knowledge to maximize the value and use of Anthem data within the AIM  organization. Primary  duties may include, but are not limited to:Develops and executes data exploration,  profiling, and mining analyses.Develops and analyzes business performance  reports (e.g. for claims data, provider data, utilization data) and provides  notations of performance deviations and anomalies.Establishes and maintains strong  knowledge of data warehouse database design, data definitions, system  capabilities, related programming languages, and data integrity issues.Develops and supports data  warehouse-related applications for business areas requiring design and implementation  of database tables.Analyzes business user needs, documents  requirements, and facilitates the identification of gaps in available data;  collaborates with business areas to determine best means to fill those gaps.Conducts training on use of the data  and applications.Requires:BS/BA degree in related field; 3-5 years data  analysis or related experience; or any combination of education and experience,  which would provide an equivalent background.Experience with relational databases and  knowledge of query tools and statistical software is required.Expert SQL skills and experience with Microsoft  SQL Server strongly desired.Ability to manipulate large sets of data is also  required.Prior experience with Anthem or other proprietary  claims data from a medical insurance company is desired, but not required.Strong analytical, organizational and problem  solving skills.This job is focused on complex and varied  metrics, making recommendations and providing assistance to staff. Anthem, Inc. is ranked as one of America’s Most Admired Companies among  health insurers by Fortune magazine and is a 2018 DiversityInc magazine Top 50  Company for Diversity. To learn more about our company and apply, please visit  us at antheminc.com/careers. EOE. M/F/Disability/Veteran."}