{"jobID": "2572574280", "jobLocation": "Chicago_IL", "jobTitle": "Business Intelligence Analyst- Tableau", "companyRating": null, "companyInfo": {"Website": "www.thinkmarkets.com", "Headquarters": "Melbourne, Australia", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Headquartered in the UK and Australia, ThinkMarkets is an industry leading brokerage with a global presence, with headquarters in London and Melbourne, as well as hubs in the Asia-Pacific, the Middle East and North Africa, Europe, and the Americas.  The firm is authorized and regulated by the FCA, and fully registered with ASIC. ThinkMarkets specializes in foreign exchange (FX), metals and global CFD trading, as well as spread betting.  Dedicated to delivering high-quality execution and service to an ever growing range of traders, ThinkMarkets has been named “Best Broker Australia” by the World Finance Awards, “Best New Contributor” by FXStreet and “Best Forex Broker in Asia” at the China Forex Expo.  The firm recently acquired Trade Interceptor, the world’s most searched-for trading analysis app. The deal marks a major step forward in ThinkMarkets’ mission to be the only truly mobile retail broker – a crucial commitment given the rapid growth of the mobile trading market.  As well as providing 24/5 customer support, ThinkMarkets also provide a full suite of tutorial seminars, webinars, and videos as part of their cornerstone ThinkMarkets University. The Role: As a BI Analyst, you will use data to figure out the market and business trends to increase profits and efficiency at ThinkMarkets. You will aid our business teams by drawing insight from our data. You will create dashboards, reports, visualizations, algorithms, and tools to solve interesting business problems for users across the enterprise. The successful candidate will be a sharp coder, who can identify problems in complex data, like to think of clever ways to solve tricky data problems, and will enjoy working with people. Role Specific Responsibilities: • Understand the business stakeholders’ objectives, the metrics that are the most important to them, and how they measure their performance.  • Analyze, transform, and optimize large data sets that feed various dashboards  • Monitor historical and real-time performances of key metrics to detect and report anomalies  • Develop and modify reports, verify information integrity and design BI dashboards, scorecards, charts/ graphs, drill-downs, and dynamic reports to meet new information needs.  • Apply business analysis skills to complicated business wants/needs and make recommendations for preferred solutions, with consideration of associated business benefits, risks, cost and timescales.  • Be “Hands on” in managing projects throughout the project lifecycle to successful completion, and to time and budget  • Derive actionable insights through critical analysis and data visualization  • Create innovative visuals for reports to enable more effective consumption of data  • Responsible for end-to-end marketing funnel and integrated campaign analysis (identifying trends/lifts by region)  • Assist Business teams in defining new project/enhancements requests that will be used to prioritize new projects for the technology teams.  • Build working relationships and continuously engage with key stakeholders in the Business, development and support teams during the software development lifecycle, to ensure project is delivered to expected timescales, budget, and quality.  • Be the liaison between the business units (around the world), technology teams and support teams throughout the project  • Handle complex ad-hoc data and analysis requests Desired Experience and Skills: • 3+ years of industry experience in a report development, data science, business analytics, business intelligence or comparable data engineering role  • Expert knowledge in Tableau and leverage tools to improve output and format of reports  • Project Management experience  • Knowledge of MT4 and Salesforce  • Experience and/-or keen interest in the FX industry  • Experience in close coordination with report developers, user interface designers, and data integration developers is required to ensure tight integration of reporting functionality and toolsets.  • Masters or Bachelor’s degree in Computer Science, Advanced Mathematics, Statistics or Information Systems, and related majors is preferred  • Great communication skills"}