{"jobID": "2730458863", "jobLocation": "Dallas_TX", "jobTitle": "Sr Consultant Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.staffitenterprises.com", "Headquarters": "Olympia, WA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About Us: Staff IT Enterprises leverages over 15 years of experience in excellence to empower our Clients and Candidates. We navigate through the ever-evolving world that is Information Technology expertly and comprehensively by creating Innovative Talent Acquisition Solutions. We offer full-service solutions that enable our clients to catapult their growth and maximize their organization's potential. Job Summary:Designs, develops, and implements algorithmic solutions for time series, streaming data, and big data at restWorks with functional consulting teams across business domains, including Communications, Media, Entertainment, Oil & Gas, Manufacturing, Retailing, Distribution and Finance.Develops reusable, maintainable and effective predictive and behavioral models through rapid, iterative, Agile development using machine learning techniques.Works closely with industry Subject Matter Experts, Data Architects and Solution Architects to understand business problems, identify data sources, develop analyzers and predictive models and configure visualization software to communicate results.Applies intellectual curiosity and deep analytical thinking to mine large data sets for hidden gems of insight and correlation.Qualifications/Requirements:Bachelors degree in a quantitative field such as Mathematics, Physics, Physical Chemistry, Statistics, Actuarial Science, Engineering, Economics, or related field from a four-year college or university. Masters degree or higher preferred.2 to 5 years of experience of data science experience, with preference given to the following domains: Communications, Media, Entertainment, Oil & Gas, Manufacturing, Retailing, Distribution, or Financial Services.Fluency with analytical software including R, Python, Stata, MatLab, SAS, and/or SPSSExtensive experience applying machine learning algorithms, predictive modeling, data mining, and statistical analysis to solve business problems.Some experience with ETL tools such as Pentaho, Informatica, or TalendSome experience with Big Data environments and frameworks including HDFS, Spark, Impala, Hive, HBase, Cloudera, Azure, and GCP.Data Visualization skills including tools such as Tableau and PowerBITravel:Regular and expeditious travel throughout the United States and occasionally overseas is required to meet client needs and timetablesAvailable to be stationed at and work from an out-of-town client site for an extended period of time Staff IT Enterprises is an Equal Opportunity Employer committed to providing a non-discriminatory environment for its employees."}