{"jobID": "2653676116", "jobLocation": "Santa_Monica_CA", "jobTitle": "Computer Vision Research Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "nuTonomy aims to be the first company in the world to launch an autonomous taxi system, and we are building up an awesome team to make this goal a reality. We are developing the first-of-its-kind complete solution for providing point-to-point mobility via large fleets of autonomous vehicles. This includes software for autonomous vehicles, smartphone-based ride hailing, fleet management, and teleoperation. The company's software has been tested extensively on public roads in the U.S. and Singapore. We offer a unique opportunity to work closely with experts from a wide array of backgrounds, to create ground-breaking technology with potential for huge impact. As a member of a fast-growing start-up, you will be able to make a large contribution to the final product. For more information about nuTonomy, visit: www.nutonomy.comWe are seeking highly talented Computer VisionResearch Scientists focused on computer vision & machine learning to support a variety of teams.A robust and adaptive perception systems is essential for creating fully autonomous vehicles. We are looking for excellent research scientists in Computer Vision that will focus on researching, developing, and deploying algorithms for extracting semantic information from RGB(D) video streams, including detection, segmentation, tracking and fine-grained classification, with the goal of using this information in a real-time robotic system with high safety requirements. In this role, you would work closely with experts of other sensor modalities to build a fully-integrated perception system, as well as experts in planning and control to close the loop on actual robots. To support your work, you will be able to use a state-of-the-art scalable computing, simulation, and testing environment, which allows a quick transition of your ideas from prototype to vehicles on the road. You will also be expected to mentor junior colleagues. Lastly, you will join an awesome group of motivated colleagues, both industry professionals as well as leading researchers from academia, who like to approach problems with both creativity and rigor, to push beyond the state of the art.Education and Experience we want from you: Ph.D. in Computer Science or related fieldExcellent analytical, communication, and writing skills.Experience developing software as part of a team.Extensive experience of one or more of the following:Deep learning applied to images or video data.Other modern machine learning methods, with a focus on rigorous statistics.Geometric computer-vision such as SLAM, optical-flow and stereo.Sensor fusion of RGB and depthBonus points (but not required):Experience in automotive or other real-time and embedded systems.Experience with temporal data-association, tracking, etc.Experience with formal software development methods.Experience with deep net compression methods.Proven track record of publications in relevant conferences (CVPR, ICML, NIPS, ICCV)Familiarity with C++, Python, CUDA, Git, CMake, continuous integration tools and the agile development process."}