{"jobID": "2832695718", "jobLocation": "Dearborn_MI", "jobTitle": "GDIA Data Ops Consultant/Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.ford.com", "Headquarters": "Dearborn, MI", "Size": "10000+ employees", "Founded": " 1903", "Type": " Company - Public (F) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Tesla, General Motors, Uber"}, "estimatedSalary": "66000", "jobDescription": " Job Description&Qualifications; Job Description/Overview: The Data Analyst role resides within the Ford GDIA organization supporting data operations and the OneFord Plan for profitable growth. In this role, you will support data requirements of the Data Scientists and Data Analysts who are using data and analytics to achieve business outcomes providing insights to accelerate customer, vehicle and application initiatives. This position will help bring data to life to solve business problems and provide data support for enterprise to include data integration tasks, such as, ingestion, standardization, enrichment, mastering and assembly of data products for downstream applications. Responsibilities: You will be responsible for providing data consultation, support and integration tasks for the enterprise, including ingestion, standardization, enrichment, mastering and assembly of data products for downstream applications. In addition, you will: Work on various data types across the enterprise including Customer, Manufacturing, Dealer, Vehicle, product development, finance, etc.Data profiling and data exploration of data for better understanding and analytic supportProvide visibility to Data Quality issues and work with the business owners to fix the issuesWork closely with the Data Scientists and data analysts to better understand and evaluate data requirements and the type of data neededSupport the data requirements of the different functional teams such as Marketing Sales and Service, Product Development, General Counsel, Finance, Quality, etc. and regional initiativesEvaluate, explore and work with different data platform technologies including Big Data, RDBMS (Relational Database Management Systems) and NoSQL to meet the analytics requirementsImplement an Enterprise Data Governance model and actively promote the concept of data sharing, data reuse, data quality and data standardsPerform any necessary data mapping, data lineage activities and document information flowsBuild the Metadata model&Business; Glossary by gathering information from multiple sources: business users, existing data sources, databases and other relevant documents and systemsServe as data subject matter expert and demonstrate an understanding of key data management principles and data useDrive Master Data Management (MDM) strategy and governance model for Master DataSupport the data strategy and ensure alignment with a continuously changing business landscape Job Requirements Basic Qualifications:Bachelor's Degree in Analytics, Statistics, Computer Science or a related field from an accredited college or university3 + years of experience in a data management role including running queries, compiling data for analytics or data comsulting2+ years of experience with Big Data, NoSQL technologies, or Hadoop (HDFS, MapReduce, Hive, Shark, Spark, QlikView, etc.), with knowledge of command line experience with loading and manipulating files within HDFSPreferred Qualifications:Ability to work in different database technologies including Big Data / Hadoop (HDFS, MapReduce, Hive, Shark, Spark, etc.), RDBMS and NoSQL.Knowledge of data transfer and ingestion technologies(i.e., Attunity)Demonstrated experience building visualizations using Tableau/SAS/QlikviewExperience in creation of scripts to manipulate files within HDFS is preferredAbility to write complex SQL queries needed to query&analyze; dataAbility to quickly comprehend the functions and capabilities of new technologiesKnowledge of data management standards, data governance practices and data qualityAbility to communicate complex solution concepts in simple termsAbility to apply multiple solutions to business problemsStrong Oral and written communication skillsStrong team player, with the ability to collaborate well with others, solve problems and actively incorporate input from various sources and team membersDemonstrated customer focus, with the ability to evaluate decisions through the eyes of the customer, build strong customer relationships, and create processes with customer viewpointStrong analytical and problem solving skills, with the ability to communicate in a clear and succinct manner and effectively evaluates information / data to make decisionsStrong interpersonal, and leadership skills, with proven abilities to communicate complex topics to leaders and peers in a simple, clear, plan oriented mannerAbility to anticipate obstacles and develop plans to resolve those obstaclesChange oriented, with the ability to actively generates process improvements, support and drives change, and confront difficult circumstances in creative waysResourceful and quick learner, with the ability to efficiently seek out, learn, and apply new areas of expertise , as neededHighly self-motivated, with the ability to work independentlySuperior organization, coaching and interpersonal skills, combined with effective leadership, decision-making, and communicationStrong oral and written communication skills (English)Strategic and clear thinking to translate discreet and complex ideas to business-driven resultsDetail-oriented with a strong drive to enforce common standardsDemonstrated acceptance and adherence to high ethical, moral, and personal values The distance between imagination and creation. It can be measured in years of innovation, or in moments of brilliance. When you join the Ford team discover all the benefits, rewards and development opportunities you'd expect from a diverse global leader. You'll become part of a team that is already leading the way, with ingenious solutions and attainable products and it is always ready to go further.  Candidates for positions with Ford Motor Company must be legally authorized to work in the United States on a permanent basis. Verification of employment eligibility will be required at the time of hire. Visa sponsorship is not available for this position, TN visa holders may be considered.  Ford Motor Company is an equal opportunity employer committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, disability status or protected veteran status."}