{"jobID": "2812873933", "jobLocation": "Florham_Park_NJ", "jobTitle": "Clinical Research Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.shionogi.com", "Headquarters": "Florham Park, NJ", "Size": "201 to 500 employees", "Founded": " 2001", "Type": " Subsidiary or Business Segment", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "79000", "jobDescription": " Shionogi Inc. is the U.S. subsidiary of Shionogi& Co., Ltd., a leading Japanese pharmaceutical company. We are in a unique position of having the financial backing and the research capabilities of a well-established leading Japanese pharmaceutical company, matched with the entrepreneurial spirit of a start-up company.  Shionogi Inc. develops and commercializes pharmaceutical products that address unmet medical needs in the areas such as pain, women’s health and anti-infectives. Together with our Japanese corporate parent, Shionogi has been providing innovative medicines essential to people's health for over 130 years.  We are seeking dynamic, focused and creative individuals to join our growing team. We are currently expanding our workforce in our New Jersey headquarters location and looking for experienced pharmaceutical professionals to help us build for the future.  TheClinical Research Scientist will review and interpret clinical data for query resolution by contacting clinical study site personnel including principal investigator regarding clinical data. Will also be responsible for writing, editing, reviewing and compiling complex clinical study documents in cooperation with Global Medical Monitor and Medical Writers. Working together, they will ensure the accuracy and quality of applicable written deliverables and their compliance with ethical, legal, regulatory, and client standards. RESPONSIBILITIESCommunication with clinical study site personnel including principal investigators for resolution and finalization of interpretation of data, and identification of key missing information.Working with Global Medical Monitor, will review and interpret clinical data through EDC and relevant database, and will draft patient narratives to a level that would be ultimately acceptable for submission for NDA applications.Liaise with other cross-functional internal teams (Clinical Operations, Data Management, Product Safety& Pharmacovigilance, Regulatory, Medical Writing and Project Management) to ensure timely delivery, quality of writing deliverables and problem resolution.Support the Global Trial Lead when participating in marketing and clinical/medical advisory panels, steering committees and investigator meetings. Serve as a resource to address medical questions or to clarify issues during conduct of the study.Ensure proper version control of all applicable documents.Define, collect, track, and report on metrics.Assist in the reconciliation of clinical and safety databases.Travel (approximately 5%) domestic and/or international.REQUIREMENTSBSN/RN, MSN/DNP, Pharm D., or PA.5 years’ minimum experience working in the pharmaceutical industry, a CRO or similar organization with a focus on clinical study or research activities.Experience with infectious disease, intensive care or pulmonology is preferred.Excellent written and verbal communication skills; data-interpretation skills; strong interpersonal skills; ability to plan and organize.Ability to communicate with clinical study site personnel including principal investigators for query resolution.Some medical writing experience such as authoring or co-authoring protocol, clinical study reports, investigators brochures, or patient narratives is preferred.Drug safety experience at a pharmaceutical company preferred.Knowledge of scientific and regulatory requirements as they apply to clinical studies, specifically protocols and clinical study reports.Ability to identify discrepancies in clinical trial data and to write queries from a medical perspective.Ability to independently and proactively identify potential problems; appropriately escalate and plan for mitigations to situations or issues within a study, program or key initiative. Must be able to collaborate to resolve issues.Document organization, management, and version control skills to include hyperlinking, TOC generation, and field updating.Excellent computer skills to include MS Word, MS Excel, MS PowerPoint, MS Outlook, and Adobe Acrobat.Must live a commutable distance to our US Corporate Headquarters in Florham Park, NJ.DISCLAIMER The job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee. Other duties, responsibilities and activities may change or be assigned at any time with or without notice. EEO Shionogi Inc. is an equal opportunity/affirmative action employer.  All qualified applicants will receive equal consideration for employment opportunities based on valid job requirements without regard to race, color, religion, sex (including pregnancy), sexual orientation, gender identity, marital status, national origin, age, ancestry, citizenship, disability, genetic information, status as a disabled veteran, a recently separated veteran, Active Duty Wartime or Campaign Badge Veterans, and Armed Forces Service Medal Veterans, or any other characteristic protected by applicable law.  It is the policy of Shionogi Inc. to undertake affirmative action in compliance with all federal, state, and local requirements to recruit a diverse pool of applicants and to ensure that our employment practices are, in fact, non-discriminatory.Apply Now!"}