{"jobID": "2822072420", "jobLocation": "Bridgewater_NJ", "jobTitle": "Junior Data scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.cognizant.com", "Headquarters": "Teaneck, NJ", "Size": "10000+ employees", "Founded": " 1994", "Type": " Company - Public (CTSH) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Tata Consultancy Services, Accenture, Capgemini"}, "estimatedSalary": "58000", "jobDescription": " Cognizant has immediate openings for Junior Data scientist. If you meet our background requirements and skills, and looking for an opportunity to be rewarded for your skills and expertise, is the ideal opportunity for you Responsibility:Business:'Review the raw requirements to understand the key outcomes expected by the client. • Identify data source and conduct data profiling to understand data and its quality. • Build QC plans and code consistent with plan Assist in the design of analysis plans.Data Discovery&Profiling;:Post signoff, design basic queries to link the existing data. • Share sample data with the client to give a snapshot of the expected outcome. • Build data traps to capture data errors and execute exploratory data analysis using methodologies approved by senior team member, Create a low level design document capturing SQL queries to achieve the target stage. • Conduct testing of QC processes using QC checklist processes. • Identify potential data risks and errors and verify that the QC plan will capture those situations Build quality tracking templates and communicate finding to the team Build analysis output templates and prepare final PPT for client presentations.Knowledge Management:Based on the inputs shared by the stakeholders. • share the inputs on RFPs on the data profiling and analytic methodology Evaluate/ identify the tools best fit for the customer requirement.Sales Support:Based on the inputs shared by the stakeholders. • share the inputs on RFPs on the data profiling and methodology review. • Evaluate/ identify the tools best fit for the customer requirement."}