{"jobID": "2837757512", "jobLocation": "Pasadena_CA", "jobTitle": "Dialysis Outpatient Registered Nurse - RN - Per Diem - N.", "companyRating": "3.3", "companyInfo": {"Website": "jobs.fmcna.com", "Headquarters": "Waltham, MA", "Size": "10000+ employees", "Founded": " 1996", "Type": " Subsidiary or Business Segment", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Baxter, DaVita, Dialysis Clinic Inc"}, "estimatedSalary": "45", "jobDescription": "PURPOSE AND SCOPE: Functions as part of the hemodialysis health care team as a Staff Registered Nurse to ensure provision of quality patient care on a daily basis in accordance with FMS policies, procedures, and training. Supports the FMCNA commitment to the Quality Enhancement Program (QEP) and CQI Activities, including those related to patient satisfaction and actively participates in process improvement activities that enhance the likelihood that patients will achieve the FMCNA Quality Enhancement Goals (QEP).  Supports the FMCNAs mission, vision, values, and customer service philosophy. Adheres to all requirements of the FMCNA Compliance Program, and FMS patient care and administrative policies. DUTIES / ACTIVITIES:CUSTOMER SERVICE:Responsible for driving the FMS culture through values and customer service standards.Accountable for outstanding customer service to all external and internal customers.Develops and maintains effective relationships through effective and timely communication.Takes initiative and action to respond, resolve and follow up regarding customer service issues with all customers in a timely manner.PRINCIPAL RESPONSIBILITIES AND DUTIESSTAFF RELATED:Directs Patient Care Technicians provision of safe and effective delivery of chronic hemodialysis therapy to patients in compliance with standards outlined in the facility policy procedure manuals, as well as regulations set forth by the corporation, state, and federal agenciesDelegates tasks to all direct patient care staff including but not limited to LVN/LPNs, Patient Care Technicians, and Dialysis AssistantsAssesses daily patient care needs and develops appropriate patient care assignmentsMonitors patient care staff for appropriate techniques and adherence to facility policy and proceduresParticipates in staff training and orientation of new staff as assignedParticipates in all required staff meetings as scheduledPATIENT RELATED:Education:Ensures educational needs of patients and family are met regarding End Stage Renal Disease (ESRD)Provides ongoing education to patients regarding their renal disease, vascular access and dialysis therapy, and other related health conditionsDiscusses with patient, and records education related to diet/fluid and medication complianceProvides patient specific detailed education regarding adequacy measures where applicable - Online Clearance Monitoring (OLC), Adequacy Monitoring Program (AMP), Urea Kinetic Modeling (UKM)Ensures transplant awareness, modality awareness, and drive catheter reductionEducates patients regarding laboratory values and the relationship to adequate dialysis therapy, compliance with treatment schedule, medications, and fluidDialysis Treatment:Provides safe and effective delivery of care to patients with ESRDImplements accurate treatment prescriptions including Sodium (Na) modeling prescription, and Ultrafiltration modeling (where appropriate) to ensure stable treatment therapy as indicatedAssesses patients response to hemodialysis treatment therapy, making appropriate adjustments and modifications to the treatment plan as indicated by the prescribing physician. Communicates problems or concerns to the Team Leader or physician.Identifies and communicates patient related issues to Team Leader or physicianInitiates Initial and Annual Nursing Assessment, and ongoing evaluation and documentation of patient care needs according to FMC Policies and ProceduresParticipates in the pre evaluation, initiation, monitoring, termination, access homeostasis, and post evaluation of patients receiving hemodialysis treatment therapy according to established FMC proceduresIdentifies and implements appropriate intervention for changes in patient adequacy status and troubleshooting access flow issues as identified by OLC/AMP yellow lightsProvides, supervises (if applicable), and monitors hemodialysis access care according to established procedures.Implements, administers, monitors, and documents patient's response to prescribed intradialytic transfusions, including appropriate notification of adverse reactions to physician and appropriate blood supplierEnsures accurate and complete documentation by Patient Care Technician on the Hemodialysis Treatment SheetLaboratory-related:Reviews, transcribes, and enters physician lab orders accurately into the Medical Information SystemEnsures appropriate preparation of lab requisitions for Spectra or alternate labEnsures correct labs tubes are utilized for prescribed lab specimens and that lab draw and processing procedures are performed appropriately for all lab samplesIdentifies and ensures appropriate follow-through regarding missed labs and specimens reported to be insufficient according to company policies and proceduresEnsures all specimens are appropriately packaged according to Department of Transportation (DOT) policies and procedures relating to shipment of blood or body fluid specimens and potentially hazardous materialEnsures that all labs are directed and delivered to appropriate labsReports alert/panic and abnormal labs results to appropriate physicianEnsures lab results are forwarded to physicians as requestedGeneral duties:Enforces all company approved polices and procedures, as well as regulations set forth by state and federal agencies and departmentsMaintains overall shift operation in a safe, efficient, and effective mannerAct as a resource for other staff membersRoutinely meets with the Clinical Manager to discuss personnel and patient care status, issues, and informationCollaborate and communicate with physicians and other members of the healthcare team to interpret, adjust, and coordinate care provided to the patientProvides assistance as needed to patients regarding prescription refills according to FMCNA PoliciesEnsures all physician orders are transcribed and entered into the Medical Information system in a timely manner.Oversees all documentation of patient informationMaintains facility drug list for all required stock medicationsMaintains competency with all emergency operational procedures, and initiates CPR and emergency measures in the event of a cardiac and/or respiratory arrestEnsures verification and availability of adequate emergency equipmentEnsures provision of appropriate vaccinations, immunizations, and annual Tuberculosis (TB) testingAdministers medications as prescribed or in accordance with approved algorithm(s), and documents appropriate medical justification if indicatedAdministers PRN medications as prescribed and completes appropriate documentation of assessment of effectiveness.Maintains appropriate recording of controlled substances as required by lawAssists with the coordination of patient transportation if necessaryMAINTENANCE/TECHNICAL:Ensures a clean, safe, and sanitary environment in the dialysis facility treatment areaEnsures competency in the operation of all dialysis-related equipment safely and effectivelyEnsures all patient stations, including machines and chairs, are clean and free of blood and placed appropriatelyEnsures that all blood spills are immediately addressed according to FMCNA Blood-borne Pathogen Control PoliciesMEDICAL RECORDS & DOCUMENTATION:GeneralEnsures all relevant data including physician orders, lab results, vital signs and treatment parameters, and patient status are documented appropriately and entered into Medical Information SystemEnsures all appropriate patient related treatment data is entered into the Medical Information SystemEnsures all FMCNA policies regarding patient admission, transfer, and discharge are appropriately implementedEnsures and verify accuracy of Patient Care Technician documentationDailyReviews and ensures appropriate daily completion of Hemodialysis Treatment Sheets by all patient care staffEnsures that all appropriate procedures are followed regarding opening and closing procedures, inclusive of monitoring that all staff and patients have safely left the premisesMonthlyInitiates, documents, and completes ongoing Continuous Quality Improvement (CQI) activities including monthly reportsCompletes monthly nurses' progress noteEnsures patient medical records are complete with appropriate information, documentation, and identification on each page (Addressograph label is on all chart forms)Reviews transplant status and follows established procedure regarding appropriate action to be takenCompletes patient care plans for new patients within the initial 30 days or any patients deemed unstable requiring monthly patient care plansCompletes any long-term programs that are dueAnnuallyCompletes initial and annual Nursing History and Assessment physicalEnsures completion of Annual Standing Order Review with each physician as requiredOTHER:Performs additional duties as assigned.PHYSICAL DEMANDS AND WORKING CONDITIONS: The physical demands and work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  Employees are required to take the Ishihara's Color Blindness test as a condition of employment. Note that: Failing the Ishihara Test for Color Blindness does not preclude employment. The Company will consider whether reasonable accommodations can be made.  The position provides direct patient care that regularly involves heavy lifting and moving of patients, and assisting with ambulation. Equipment aids and/or coworkers may provide assistance. This position requires frequent, prolonged periods of standing and the employee must be able to bend over. The employee may occasionally be required to move, with assistance, machines and equipment of up to 200 lbs., and may lift chemical and water solutions of up to 30 lbs. up as high as 5 feet.  The work environment is characteristic of a health care facility with air temperature control and moderate noise levels. May be exposed to infectious and contagious diseases/materials. EDUCATIONGraduate of an accredited School of Nursing.Current appropriate state licensureMust meet the practice requirements in the state in which he or she is employedEducation and Training qualifications per UltraCare CAP program requirements.EXPERIENCE AND REQUIRED SKILLSMinimum of one-year medical-surgical nursing experience preferredHemodialysis experience preferredICU experience preferredExperience and skill requirements as delineated for the appropriate level in the UltraCare CAP program.Successfully complete a training course in the theory and practice of hemodialysisSuccessfully complete CPR CertificationProvide coverage at any or all area facilities as required by managementICD - 9 coding TrainingNurses Technical TrainingMust meet appropriate state requirements (if any)EO/AA Employer: Minorities/Females/Veterans/Disability/Sexual Orientation/Gender Identity"}