{"jobID": "2830764312", "jobLocation": "Princeton_NJ", "jobTitle": "Research Scientist Oncology, Immuno-Oncology, Immunology", "companyRating": null, "companyInfo": {"Website": "www.jouleinc.com", "Headquarters": "Edison, NJ", "Size": "201 to 500 employees", "Founded": " 1965", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Joule, a division of System One, is seeking a Research Scientist to work on Oncology, Immuno-oncology and Immunology projects. In Vitro and Ex Vivo characterization and functional assay development using primary immune cells of rodent and/or human origin. This position is onsite in the greater Princeton NJ area.  Responsibilities: Join an Integrated Oncology Discovery Research team and aide in the advancement of early stage therapeutic in tumor immunobiology.Collaborate with colleagues in the oncology, immunology, immuno-oncology, protein engineering/antibody development and medicinal chemistry.Utilize a wide range of in-vitro cellular and biochemical assays, cell culture, T cells, NK cell functional assays, western blotting, immunoprecipitation, ELISAs, reporter assays, and siRNA/shRNA knockdown.Design, validation and execute in vitro and ex vivo flow cytometry- and/or mass cytometry-based phenotypic.Prepare and work with tissue cultures.There will be less than 10% travel. Must Haves: BS or MS Degree in Biology, Biochemistry, Pharmacology or related field.BS with 5+ years experience or MS with 0-2 years experience required.Experience with oncology, immuno-oncology, or immunology is required.Expertise in isolation, characterization and functional assay development using primary immune cells of rodent and/or human origin.Tissue culture expertise is a must.Flow cytometry (4 colors or more) - and/or mass cytometry-based phenotypic. When applying to this position, kindly please provide your resume in MS Word format.  Joulé offers competitive pay, medical benefits and holiday pay.  Key words: in vitro, ex vivo, tissue culture, ELISA, Flow Cytometry, Mass Cytometry, T cells, NK cell functional assays, western blotting, immunoprecipitation, ELISAs, reporter assays, and siRNA/shRNA knockdown."}