{"jobID": "2814944711", "jobLocation": "Oakland_CA", "jobTitle": "Interim Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.beyond12.org", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2010", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "You must be able to work out of our Oakland, CA office20 hours/week fromAugust 1, 2018 – February 1, 2019 (flexible work hours and some remote work ok)$28.00/hourPlease include your resume and a thoughtful cover letter outlining how your skills and experience meet the qualifications of this position. Applications without a cover letter will not be considered.About Beyond 12 Beyond 12 is a technology-based service organization whose mission is to dramatically increase the number of historically underrepresented students who graduate from our nation’s colleges and universities. Since our founding 8 years ago, we have validated our business model, confirmed that we are solving a meaningful problem, and demonstrated our ability to build a sustainable organization through earned revenue. Today, we have an operating budget of $4.2M, 28 full-time staff, and offices in the San Francisco Bay Area and Atlanta.  Through a unique, hybrid approach of personalized student coaching combined with innovative technology products like our MyCoach mobile app and student analytics platform, Beyond 12 not only provides our students with tailored coaching that materially increases their chances to earn a college degree, but we also provide actionable feedback to high schools about their college preparatory efforts, inform the retention work of colleges and universities, and influence the national conversation about student success.  We are currently tracking the postsecondary progress of over 40,000+ college students and coaching 2,000+ students on 180 different college campuses. Having established a strong initial track record of success and on the heels of receiving national recognition for our innovative approach to addressing the college persistence challenge (Robin Hood College Success Prize finalist, Google Bay Area Impact Challenge winner, Xammy Award for best Social Impact app, one of Fast Company’s top 10 most innovative companies in education), we are well positioned to dramatically scale our efforts. About the Position: Beyond 12 is seeking a dynamic, talented and detail oriented Interim Data Analyst, who is interested in making a difference in the lives of students from under-resourced backgrounds. The Interim Data Analyst will work out of our Oakland office and will report to, and work closely with, the Director of Data and Research to help ensure the team is able to meet the data and analytic needs of our partners. This is a great opportunity for someone to apply strong data and analysis skills toward helping partner organizations better track and support for their students to ensure that all students achieve their potential. Your Responsibilities (include, but are not limited to): Data Management & AnalysisData Upload: Support partners in uploading student data into Beyond 12’s Alumni Success Tool with exceptional accuracy and within a specified timeframe. Data staging and management is done using Python and R.Data Audits: Examine data within Beyond 12’s Alumni Success Tool to ensure accuracy and completion, and correct/complete where needed.Looker DashboardsSupport internal- and external-facing dashboards in Looker by providing continued maintenance and support.Create reports and graphs for Beyond 12 staff and partners as needed.Work with Products & Engineering team to troubleshoot time-sensitive issues.RequirementsStrong commitment to Beyond 12’s mission and vision; 2 to 3 years of experience working in a K-12 school environment or higher education strongly preferred.Strong problem-solving and data analysis skills, including proficiency in Excel, SQL, Python, and RStrong customer service orientation and demonstrated ability to listen to concerns, build relationships, work across functions and teams, and influence stakeholders.Eager to take on new projects and tasks and ability to thrive in a growing and rapidly changing environment; unrelenting perseverance and solutions orientation in the face of challenges.Results-oriented and self-directed with excellent organization and project management skills and strong attention to detail; Demonstrated ability to prioritize and execute work independently.Bachelor's degree required.BenefitsThe Tangible and Intangible Benefits of Working at Beyond 12:This temporary position not eligible for benefits. However, you will be eligible to accrue sick leave hours at the normal rate for hours worked.You will be a part of a team of passionate people who respect, value, and seek diverse ideas and opinions, and who balance hard work with fun and connection.You will work in downtown Oakland, 2 blocks from the 19th Street BART station and close to Lake Merritt. Beyond 12 is an equal opportunity employer and welcomes candidates from diverse backgrounds and those who were the first in their family to graduate from college. We will be accepting applications on a rolling basis with a target start date of August 1st. Please include your resume and a thoughtful cover letter outlining how your skills and experience meet the qualifications of this position. Applications without a cover letter will not be considered."}