{"jobID": "2829073350", "jobLocation": "Washington_DC", "jobTitle": "Data Quality Analyst and Advisor", "companyRating": null, "companyInfo": {"Website": "www.pactworld.org", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 1971", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " At the heart of Pact is the promise of a better tomorrow. A nonprofit international development organization founded in 1971, Pact works on the ground in nearly 40 countries to improve the lives of those who are challenged by poverty and marginalization. We serve these communities because we envision a world where everyone owns their future. To do this, we build systemic solutions in partnership with local organizations, businesses, and governments that create sustainable and resilient communities where those we serve are heard, capable, and vibrant.  Pact is a recognized global leader in international development. Our staff have a range of expertise in areas including public health, capacity development, governance and civil society, natural resource management, poverty, fragile states, monitoring and evaluation, small-scale and artisanal mining, microfinance and more. This expertise is combined in Pact’s unique integrated approach, which focuses on systemic changes needed to improve people’s lives.The R&M; and Analytics teams are looking to bring on an Analyst/Advisor to assist with the following tasks:  Specific Duties: R&M; team (50%) DHIS2 System implementation supportR&M; counterpart to SP1 project manager: liaison with database service provider (this position is the M&E;/data expert)R&M; lead on roll-out of new program database DHIS2Ensure new sites are set-up and functionalWorks with vendors to ensure quality data migratios between databases and applications using appropriate data analysis, conversion and connectivity utilities. R&M; Team supportR&M; team lead on mobile technology solutions for projects: advise on systems, and support project teams with roll-outMake recommendations for improvements to systems based on user feedback and best practicesSupport analysis of datasets to address information needsConduct quality assessments and coordinate the upload of datasets into Pacts data systemsProvide training on data quality and new systems to field teams (remote and in-person)Along other with R&M; Advisor, provide M&E; support to country teams as needed  SP1/Analytics team (50%) AnalysisSupport the organization to build a pool of quality datasets on different technical areas which will drive business decisionsDocument, analyze and prototype new data solutions and tools to ensure they meet Pact’s business needs.Filter and “clean” data by reviewing reports and performance indicators to locate and correct problems Innovation in support of our Analytics strategic priorityParticipate in SP1 to assist Pact in understanding how to use analytics to inform business decisionsMeet with DC and field-based colleagues to define the questions that analytics will answerExperiment with various big data approaches (machine learning, etc) to create predictive development and/or financial models Report developmentWorks with Pact staff to define report requirements using data visualization toolsDeploys, trains and supports new tools (alone or with additional consulting support)Develops reports based on business needs; trains staff to develop ad hoc queries using existing reporting tools.Identifies and corrects problems in existing reports, databases, scripts, etc.  Qualifications:Excellent interpersonal skills and the ability to work well in a diverse team environmentexcellent oral and written communications skillsstrong troubleshooting skillsdetail oriented, self-directed and responsibleability to multi-task in a fast-paced environmentwillingness and capacity to learn and grow technical skills RequirementsBachelors or Masters degree in Data Science or related technology field3 years’ experience with relevant technologies and tools such as machine learning techniques, predictive analytics, data lakes, SQL querying, database architecture, PowerBI, python, ODBC connectivity, etc.Strong technical skills, familiarity with software development lifecycle, data analysis"}