{"jobID": "2829295456", "jobLocation": "Peapack_NJ", "jobTitle": "Manager, Data Management Reporting Analyst, Central Services", "companyRating": "3.8", "companyInfo": {"Website": "www.pfizer.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1849", "Type": " Company - Public (PFE) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "107000", "jobDescription": " As part of the Data Monitoring and Management (DMM) group, an integral delivery unit within the Global Biometrics and Data Management (GBDM) organization, the Data Management Reporting Analyst (Manager) is responsible for the collection, documentation and programming of study and asset level data cleaning and monitoring report requirements. The Data Management Reporting Analyst (Manager) will be responsible for the timely and high quality development and delivery of reporting solutions supporting the Pfizer portfolio. *ROLE RESPONSIBILITIES** + Works closely with department roles and cross-functional study team members to create reporting and analytics solutions that support the quality and timely delivery of data management reports and visualizations required per standard and study specific data review plans.  + Creates any needed documentation for reports throughout the lifespan of the study and or asset for all DMRA deliverables and ensures proper filing in the Trial Master File filings when appropriate.  + Complies with applicable SOPs and work practices  + Serves on the data standards board as needed, and leads as needed implementation and where needed development of data management reporting standards.  + Serve as a technical resource to the study teams for data visualization and reporting tools  + Ensure operational excellence in collaboration with partners and colleagues for application of standards and develop data cleaning reports in support of the data review plan, in collaboration with the Clinical Data Scientist, ensure operational excellence across all DMM deliverables  + Directly supports knowledge development of others on reporting and analytics tools that support the accuracy and integrity of study data *QUALIFICATIONS** + Bachelor's degree in Statistics, Biostatistics, Mathematics, Computer Science or related field w a minimum of five years relevant experience in a pharmaceutical, biotech, CRO, or Regulator Agency with an emphasis on building reporting and analytics solutions.  + Understanding of drug development process and data operations required for the reporting of clinical trial data (e.g. data review, study reports, regulatory submissions, safety updates, etc.)  + Understanding of regulatory requirements and relevant data standards; CDISC knowledge and experience are preferable  + Strong communication (written and oral), decision-making, influencing, negotiation, and project management skills  + Technical skills and experience using relational databases (e.g. MS SQL Server, MS Access, or Oracle) and data visualization tools (e.g. Spotfire, jReview)  + Experience in Oracle, PL/SQL, SAS, Java, relational database design and database programming skills  + Proficiency in the use of Microsoft Office Suite of tools (Outlook, Word, Excel, etc.) *EEO & Employment Eligibility** Pfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer. *Sunshine Act** Pfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider's name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.  Pfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates."}