{"jobID": "2837233560", "jobLocation": "Warren_NJ", "jobTitle": "Senior Engineer / Scientist - CAR-T - Cell Therapy Developme", "companyRating": null, "companyInfo": {"Website": "www.cmp.jobs", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Employer is a global biopharmaceutical company leading the way in medical innovation to help patients live longer, better lives. Our purpose as a company is to discover and develop therapies that will change the course of human health. We value our passion for patients, quest for innovation, spirit of independence and love of challenge. With a presence in more than 70 countries, and growing - we look for talented people to grow our business, advance our science and contribute to our unique culture.Senior Engineer / Scientist - CAR-T - Cell Therapy Development - Technology Transfer (Process)Warren, NJWe seek a highly motivated engineer with demonstrated expertise in cell therapy development to driving technical transfer & process validation activities that support rapid commercialization of CAR T therapies. The qualified candidate will be responsible for managing process transfer of CAR T technology to CMOs, in US, EU or Japan to ensure timely manufacturing readiness. Additionally, this position is responsible for managing process validation activities at CMOs and preparing validation packages for commercial registration filing (BLA/MAA/J-NDA). The successful candidate will also be required to review regulatory documents for submissions (IND/CTA/J-CTN & BLA/MAA/J-NDA), and provide technical input to regulatory discussions in US, EU & Japan. Significant technical expertise in cell therapy process development and strong project management skills are required for this position. This role will also involve extensive interaction with Employer collaboration partners technical transfer teams and collaboration within cross-functional Employer teams. Responsibilities will include, but are not limited to:Manage process transfer efforts and drive the execution plan of process transfer activities and manage timelines & deliverables for process transfer.Review technical documents, including study protocols, study reports, batch records, SOPs, etc. to ensure the process readiness at CMOs.Assist CMOs in the development of process transfer, qualification and validation study plans.Assist CMOs in preparing various process validation protocols.Participate in key tech transfer & process validation activities at CMOs.Review process validation reports & ensure the quality of the validation data packages for commercial registration filing.Provide technical support to mock PAI inspections at CMOs.Assist CMOs in preparing for commercial launch.Review regulatory documents for IND/CTA/J-CTN & BLA/MAA/J-NDA filings.Provide necessary technical input to support regulatory discussions in US, EU & Japan.Manage change control in Employers quality system.Provide necessary technical support to Employer Quality Operation team.Serve as a process SME from CMC in cross-functional teams and support execution of process operational strategies.Interact with other CMC teams, Quality Operation, Clinical Operation, Regulatory and other personnel as dictated by project needs. Contribute in a team-oriented environment to achieve common project goals.Maintain knowledge of scientific literature and apply key concepts to project activities/plans.Build on experience and adapt approaches to expand and develop operations as the program extends into Europe and Asia-Pacific.Prerequisite:Ph.D. in Biochemical Engineering or related discipline with 3+ yrs process development experience, or MS with 8+ yrs, or BS with 10+ yrs process development experience for cell therapies or biologics preferred.Strong grasp and application of engineering fundamentals pertaining to immunotherapy process development.Experience with GMP manufacturing.Knowledge of cGLP/cGMP and applicable FDA, EMA and ICH guidance.10% TravelSkills/Knowledge Required:In-depth knowledge and technical expertise in process development for cell therapies or biologics.Strong knowledge in cGMP of cellular products or biologics.Solid understanding of the fundamentals of process development, tech transfer and validation.Excellent organization, verbal and written communication and presentation skills.Ability to work in cross-functional teams effectively and interacting with external collaborators to build strong relationship.Ability to work independently.Ability to develop and drive project plan and timeline and deliverables to meet overall project goals.Experience with project management.Experience working with process validation highly desirable. #LI-POSTEmployer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Employer complies with all applicable national, state and local laws governing nondiscrimination in employment as well as employment eligibility verification requirements of the Immigration and Nationality Act. All applicants must have authorization to work for Employer in the U.S."}