{"jobID": "2726664899", "jobLocation": "San_Mateo_CA", "jobTitle": "Product Manager, Data and Tech Partners", "companyRating": "3.5", "companyInfo": {"Website": "www.alteryx.com", "Headquarters": "Irvine, CA", "Size": "501 to 1000 employees", "Founded": " 2010", "Type": " Company - Public (AYX) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "117000", "jobDescription": "Position: Product Manager, Technology PartnersLocation: San Mateo, CARevolutionizing business through data science and analytics, Alteryx offers an end-to-end analytics platform which empowers data analysts and scientists alike to break data barriers, deliver insights, and experience the thrill of getting to the answer faster. Organizations all over the world rely on Alteryx daily to deliver actionable insights.  Join our team of passionate and hard-working associates, and help make a difference in peoples lives by creating software that enables business users to solve problems using data that were previously thought to be unsolvable, save them days, weeks and months of mundane data prep and blending, and help them truly love their jobs again.Overview:Alteryx, Inc. is looking for a Product Manager to lead our joint efforts with technology partners. This role involves building relationships with our technology partners, defining the joint integration strategy and roadmap, interfacing with Sales and internal stakeholders to educate them on the solutions, collaborating with marketing on GTM, working with engineering to define release schedules and features and having a deep understanding of both the Alteryx platform and the various partner technologies.  The Product Manager for Technology Partners will have a strong understanding of the technical partner ecosystem and the many offerings they provide as well as where it fits within the Alteryx landscape. They must understand the self-service analytics and data science space deeply and be able to define unique requirements for building joint partner solutions. Responsibilities:Capture customer feedback to understand the use cases and to determine the partner integrations that are critical for their success with AlteryxWork with the Corporate Strategy team to understand business needs and gaps that partners can help fillDefine requirements to build the proper solutions and integrations and set timelines both internally and with the partnersEvangelize Alteryx and build great relationships with Product, Engineering and Executives with top tier partnersEducate partners on our current offerings and future roadmapEstablish metrics for tracking successful partner use cases, solution and integrationsWork closely with Engineering team leads in determining the technical feasibility and timelines for releasing new joint partner featuresOwn the successful delivery of new solutions and integrations, beta through launchGather competitive intelligence, perform market audits and define and align strategy and roadmapEvangelize the value of the partnerships both internally to sales and marketing and external at customer events Requirements:5+ years in a Product Management or Sales Consultant role particularly in the data and analytics spaceBachelor Degree in technical field (science, computer science, data & databases, etc.) preferredTechnical background; strong experience with cloud offerings on AWS, Google and Azure preferredExperience with databases or data-related products a plusStrong project management, interpersonal, analytical, problem solving, and verbal/written communication skills with the ability to build strong working relationships across organizational teams in a fast paced and changing environmentEffective documentation skills with ability to absorb and articulate technical information to a non-technical audienceProblem solving skills; strategic thinking and business acumenExcellent teamwork skills, ability to manage, interpret and influence cross functional teamsExperience working in Enterprise B2B SaaS businesses a plusExperience working with Alteryx a strong plusTravel up to 25%The company will not provide sponsorship for work visas or other employment authorization for this position.Unsolicited third party/agency profiles and resumes will not be considered.Alteryx, Inc. is an Equal Employment Opportunity Employer."}