{"jobID": "2817819355", "jobLocation": "Plano_TX", "jobTitle": "Application Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.pepsico.com", "Headquarters": "Purchase, NY", "Size": "10000+ employees", "Founded": " 1965", "Type": " Company - Public (PEP) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unilever, Mondelez International, Amazon"}, "estimatedSalary": "72000", "jobDescription": " PepsiCo is one of the world's leading food and beverage companies with operations in over 100 countries, providing a global portfolio of diverse and beloved brands. Our global presence, combined with our pursuit of great science, offers you the opportunity to leverage your technical expertise and through the process of innovation, create a positive impact on people's lives around the world. Are you are looking for an opportunity to use your technical knowledge to influence a global organization? Every day is an adventure and an opportunity for personal and professional growth.  PepsiCo's Global Flavor- Applied Research Team is seeking an experienced and high performing scientist to lead research and develop technical breakthroughs in support of PepsiCo's global growth agenda.  We are searching for a highly innovative professional with experience in food industry R&D;: Create, plan and execute projects focused on developing new flavor/seasoning technologies which fuel our core, innovation and productivity platformsAct as a prime mover, working cross-functionally with PepsiCo's global teams, to drive flavor/seasoning solutions and technical capability building activities; from theoretical analyses through commercializationEffectively manage multiple projects and collaborative partnershipsDevelop, plan, conduct and coordinate research initiatives with the ability to translate to product development & business solutions. Interpret data and communicate impact to the businessDevelop and deliver technical documentation and associated materials to the highest standards which enable technology transfer to business partnersUtilize experimental design and data interpretation tools to make technically sound recommendationsSurvey both industry and academia for new leading-edge Create, plan and execute projects focused on developing new flavor/seasoning technologies which fuel our core, innovation and productivity platformstechnologies for potential application in our productsDevelop and maintain effective working relationships across R&D; and beyondActively participate in internal as well as external technical forums and industry associationsQualifications:M.S. or PhD in Food Science, Chemistry or related field with 3-10 years of experienceResearch will focus on the importance of developing and applying differentiated, robust flavor delivery systems to provide PepsiCo products with a competitive position within the market; Flavor Science, Sensory Science, Food Chemistry skills will be preferredProven experience in defining and leading technical projects; experience with project management methodologiesFood & Ingredient manufacturing technology knowhow is a mustStrong working knowledge of food product development protocols, including formulation, stability testing, product/package interaction, sensory and consumer testingDemonstrated ability to function effectively in a dynamic and fast-paced environment (multi-national, matrixed organization)Be a self-starter with ability to multitask and manage several projects, including collaborations, simultaneouslyResults oriented with a strong work ethicOutstanding teamwork and communication skillsAdapts to change well, with the personal leadership to influence and positively motivate self and peers All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.  PepsiCo is an Equal Opportunity Employer: Female / Minority / Disability / Protected Veteran / Sexual Orientation / Gender Identity  If you'd like more information about your EEO rights as an applicant under the law, please download the available EEO is the Law & EEO is the Law Supplement documents. View PepsiCo EEO Policy.  Please view our Pay Transparency Statement"}