{"jobID": "1814160344", "jobLocation": "Ne_Jersey", "jobTitle": "Intern/Coop - Associate Scientist", "companyRating": null, "companyInfo": {"Website": "www.loreal.com", "Headquarters": "Clichy, France", "Size": "10000+ employees", "Founded": " 1909", "Type": " Company - Public (LRLCY) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Procter & Gamble, Unilever, Estée Lauder Companies"}, "estimatedSalary": null, "jobDescription": " The position is in the Product Performance Evaluation Department at the L'Oreal USA R&D; facility in Clark, NJ. This group is responsible for the sensory, consumer and claims testing of all the consumer products manufactured by L'Oreal USA. Job Specifications: Interacts with panel leader and formulators to plan, setup, and schedule sensory testing Takes and edits panelist photographs Designs and executes sensory expert panel studies and training exercises Maintains sensory database Monitors panelist performance and identifies area for training as needed. Analyzes sensory data and writes reports to clearly communicate findings to the formulation chemistsQualifications: BS in Food Science, Sensory Science or related field; Master's degree preferred. Excellent presentation and written/oral communication skills Ability to multi-task, good organization skills, and flexibility is a must Knowledge of experimental design and basic statistical methods including statistical packages such as XLSTAT, SPSS, or SAS Creativity in developing new testing methods Interest in human behavior/perception and the sensory properties of products Proficient in Excel, Word, PowerPoint Management experience a plus Must be legally eligible to work in the US on an on-going basis. Work up to 30 hours per week in Clark, NJ – Number of hours per day is flexibleWe are an Equal Opportunity Employer and take pride in a diverse environment. We do not discriminate in recruitment, hiring, training, promotion or other employment practices for reasons of race, color, religion, gender, sexual orientation, national origin, age, marital or veteran status, medical condition or disability, or any other legally protected status."}