{"jobID": "2828687469", "jobLocation": "Washington_DC", "jobTitle": "Data Analyst II", "companyRating": null, "companyInfo": {"Website": "www.caqh.org", "Headquarters": "Washington, DC", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Data Analyst II is responsible for generating monthly billing reports for one or more solutions in the CAQH portfolio of healthcare industry utilities. In addition, she/he will leverage data and other resources to identify actionable trends and patterns that support business, technology and operations decision-making. Through a combination of deep domain expertise, expert product knowledge and strong data skills, the Data Analyst will turn data into information, information into insight, and insight into business decisions. The Data Analyst reports to Senior Product Manager. This position is full time, exempt. RESPONSIBILITIES:Import, clean, transform, validate or model complex data sets from multiple sources to understand and answer business questions surrounding: Data qualityOperational improvement opportunitiesStrategic planningMarket insightsCustomer-facing business queriesUsage metrics for CAQH utilitiesIdentify root causes for problems related to adoption, usage, operations and quality, and identify improvements by pinpointing trends, correlations and patterns in complicated data sets.Design and present data and conclusions in charts, graphs and tables. Maintain ongoing reports.Develop and maintain data quality assurance measures and processes.Build out and automate CAQH internal and external reporting and analytics capabilities.Recommend data migration approaches for product upgrades.Develop and implement data collection systems and other strategies that optimize statistical efficiency and data quality.Design and develop relational databases for collecting data; write Data Definition Language or Data Manipulation Language SQL commands.KNOWLEDGE, SKILLS AND ABILITIES:Demonstrated self-starter and creative thinker who can handle a considerable amount of unstructured, real world data and be comfortable thinking about solving problems using new and novel approaches.Experience using one or more business intelligence software tools (Tableau, Cognos, Business Objects, etc.).Knowledge of statistics and experience using statistical packages for analyzing large datasets (SPSS, SAS, Excel, etc.).Knowledge of a querying language such as SQL and the ability to write code without depending on an intermediary, guided interface (drag and drop tool).Ability to identify, analyze and interpret trends or patterns in complex data sets and present data in a way that is intuitive to technical as well as nontechnical users.Excellent time management skills and the ability to prioritize a full plate.Ability to work collaboratively and effectively across matrix organizations in a fast-paced, schedule-driven and entrepreneurial environment.EXPERIENCE:Minimum of four years of hands-on experience in a data analyst role.2+ years of performing data analysis in support of a product organization.Healthcare experience preferred (payer or revenue cycle management).EDUCATION:Bachelor’s degree required; Mathematics, Economics, Computer Science, Information Management or Statistics disciplines preferred.WHO WE ARE Named one of Modern Healthcare’s Best Places to Work in 2016, 2017 and 2018 CAQH, a non-profit alliance, is the leader in creating shared initiatives to streamline the business of healthcare. Through collaboration and innovation, CAQH accelerates the transformation of business processes, delivering value to providers, patients and health plans. COB Smart® quickly and accurately directs coordination of benefits processes.EnrollHub® reduces costly paper checks with enrollment for electronic payments and electronic remittance advice.CAQH ProView® eases the burden of provider data collection, maintenance and distribution.DirectAssure® increases the accuracy of health plan provider directories.VeriFideTM® streamlines credentialing by consolidating and standardizing primary source verification.SanctionsTrack® delivers comprehensive, multi-state information on healthcare provider licensure disciplinary actions.CAQH CORE® maximizes business efficiency and savings by developing and implementing national operating rules.CAQH Index® benchmarks progress and helps optimize operations by tracking industry adoption of electronic administrative transactions.WHAT YOU GET CAQH recognizes that its most important asset is its growing team of smart, creative, collaborative, forward-thinking and passionate professionals – and that a comprehensive employee benefits package is an important factor for them in choosing where to work. CAQH offers competitive compensation along with an extensive benefits package for all full-time employees, including medical, dental and vision coverage, tuition assistance and a 401k. Our location in downtown Washington, DC is metro-accessible, has an onsite fitness center and is centrally located to allow our team to take advantage of professional networking opportunities, cultural offerings and a thriving social scene. "}