{"jobID": "2511066848", "jobLocation": "San_Jose_CA", "jobTitle": "Senior Managing Data Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.maximintegrated.com", "Headquarters": "San Jose, CA", "Size": "5001 to 10000 employees", "Founded": " 1983", "Type": " Company - Public (MXIM) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Texas Instruments, Intersil, Analog Devices"}, "estimatedSalary": "160000", "jobDescription": "Requisition Number 3947BR  External Posting Title Senior Managing Data Scientist  Time Type Full time  Pay Rate Type Salary  Work Shift Regular - Salaried  Country United States  Locations San Jose, CA (HQ)  Minimum Degree Required Doctorate Degree  Career Level Non-Manager - Experienced (5+ years exp)  Job Description Maxim Integrated is a highly successful, $2.31 billion company. With offices and manufacturing sites around the world, we design award-winning semiconductors that make the world more integrated. We also know that it’s our people who make us a great company. So we reward bold thinking, teamwork, personal growth, and community involvement. Want to make a difference and be challenged every day? Join us at Maxim Integrated. With analog integration, the possibilities are endless.The Senior Managing Data Scientist is a senior technical and leadership position within the corporate Advanced Analytics team. In this role, the candidate will be responsible for building, deploying and supporting predictive and prescriptive models that enable effective decision-making across the business enterprise. The successful candidate will have a proven track record in delivering insight with a strong grounding in analytic research. The candidate must also demonstrate effective leadership capabilities with an ability to clearly communicate and present new concepts, technical results and deliverables.Responsibilities Contribute to the direction to the corporate Advanced Analytics team. Assist the Executive Director, Advanced Analytics in setting the team goals and research agenda. Help develop a team comprised of computational scientists, engineers and statisticians. Serve as a key contributor to the development of new analytics products and strategies supporting the enterprise. Develop product, business and process models, and identify/leverage new data sources. Build, refine and leverage predictive and descriptive models, learning algorithms and data mining tools to improve insights, enhance data-driven business strategies and increase profitability. Build relationships with internal business partners to find and drive analytic projects and solutions.Effectively communicate and translate results to our executive leadership and business unit teams in appropriate business terms. Minimum Qualifications Education: Ph.D. in Statistics, Computer Science, Engineering, or other quantitative discipline. Specialization in machine learning, Bayesian statistics, mathematical finance, or a related quantitative field is preferred.Specific Skills:5+ years of experience in developing prediction algorithms, solutions to prescriptive analytics problems, data mining techniques and/or econometric modelsDemonstrated experience building statistical and/or machine learning systems to solve large-scale customer-focused problemsExpertise in leveraging Bayesian and frequentist statistical methods and applying them to real-world business problems.Experience in developing and deploying optimal risk-based decision toolsDemonstrated ability to match the best analysis methods to a variety of business opportunities and ensure only the very best analytic models are put into production.A high level of analytical rigor and the ability to sift through significant amounts of information to enable the development/deployment of effective analytic solutions.Demonstrated expertise using Python and SQL is required, and knowledge of R is a plus.Proven ability to rapidly prototype and demonstrate analytic solutions and algorithms A confident peer influencer with strong communication skills (both oral & written) who quickly establishes credibility at all levels.Analytic consulting experience in a fast-paced environment is preferred. Maxim is an equal opportunity employer and gives consideration for employment to qualified applicants without regard to race, color, religion, sex, national origin, disability or protected veteran status. Percentage of Travel 0% - 10%  Relocation Assistance Available No  Visa Sponsorship Available Yes  Removal Date 08/28/2018 "}