{"jobID": "2516601491", "jobLocation": "Santa_Clara_CA", "jobTitle": "Computer Vision Scientist", "companyRating": "4.3", "companyInfo": {"Website": "www.nvidia.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1993", "Type": " Company - Public (NVDA) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "161000", "jobDescription": " We are now looking for a Computer Vision Engineer/Scientist  Nvidia has continuously reinvented itself over two decades. Our invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined modern computer graphics, and revolutionized parallel computing. More recently, GPU deep learning ignited modern AI — the next era of computing. Nvidia is a “learning machine” that constantly evolves by adapting to new opportunities that are hard to solve, that only we can pursue, and that matter to the world. This is our life’s work , to amplify human creativity and intelligence. Make the choice to join us today.  We are seeking the best Computer Vision Scientists with background in the following, to work with other system software engineers in building the next generation of vision algorithms. What you’ll be doing:Help develop computer vision and deep learning algorithms for autonomous cars, mapping and localization.You will experiment with new or early stage algorithms.Solidify existing algorithms working with large amounts of real data and testing in autonomous cars.You will help improve the quality of algorithmic results.You will partner with system software engineering leads to build shipping industrial strength code.Minimize inefficiencies and latency and improve performance.What we need to see:Possess an MS and/or PhD in Computer Science or equivalent degree along with 2 plus years work experience in a related industryYou should have superb image processing and/or deep learning skills.Having significant software development experience will help you excel.Have strong proficiency in C programming/debugging skills and C++ Ways to stand out from the crowd: Previous experience on the automotive industry (ADAS systems).Having hands on experience with automotive hardware (sensors, cameras) is a plusExperience with image processing and deep learning in a shipping product context.Experience developing real-time Image Processing and/or Computer Vision systems.Software development on embedded platforms or large scale cloud services.CUDA experience NVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression , sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.#deeplearning"}