{"jobID": "2794752702", "jobLocation": "San_Francisco_CA", "jobTitle": "Manager, Accounting", "companyRating": "3.7", "companyInfo": {"Website": "www.nektar.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 1990", "Type": " Company - Public (NKTR) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Bristol-Myers Squibb, Merck, GlaxoSmithKline"}, "estimatedSalary": "132000", "jobDescription": "Requirements: A minimum of a Bachelors degree in a Finance or Business discipline is required. A CPA, MBA or other advanced degree is preferred. Equivalent experience may be accepted. A minimum of 8 years previous accounting experience, preferably in the biotech or pharmaceutical industry is required. Previous corporate accounting experience is required and SEC reporting experience, including XBRL filings, is highly preferred. A minimum of 4 years experience in public accounting is highly preferred. A minimum of 3 years experience at a publicly traded company is highly preferred. Must be able to demonstrate a thorough knowledge of GAAP and SOX requirements. Must be able to demonstrate a high attention to detail with an ability to independently prioritize and organize work assignments. Must possess excellent computer and analytical skills with proficiency in Excel and Word. Good communication skills both oral and written are required. Previous experience with JDE ERP and Business Objects reporting software are highly desired. Must be able to review and understand significant agreements as they pertain to the accounting group.  We are an Equal Opportunity Employer and do not discriminate against applicants due to race, ethnicity, gender, veteran status, or on the basis of disability or any other federal, state or local protected class.  Nektar Therapeutics will consider for employment qualified applicants with criminal histories in the manner proscribed by the San Francisco Fair Chance Ordinance."}