{"jobID": "2509096129", "jobLocation": "San_Jose_CA", "jobTitle": "Data Analyst - Data Science/AI/Machine Learning", "companyRating": null, "companyInfo": {"Website": "www.verticalmove.com", "Headquarters": "Kirkland, WA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Apply Now »  Data Analyst - Data Science/AI/Machine Learning  « Back to results  Apply Now  * First Name  * Last Name  * Email  * Mobile Phone Number  --None--Craigslist Daxtra Dice Facebook FlexJobs Glassdoor Indeed LinkedIn Monster Other Simply Hired Twitter ZipRecruiter * How did you find out about this job?  Cover Letter  Upload Cover letter Here  Paste Cover Letter Here  Resume  *Upload Resume Here  Paste Resume Here  My Careers | My Posts | About Me Jim Beatrice Principal Recruiter Phone WorkPhone Fax www.linkedin.com/in/jamesbeatrice/Email:  jbeatrice@verticalmove.com My path to being a Technical Recruiter started when I was a Sales Rep selling Telecom services back in 1996. One of my calls was to a small recruiting firm in Foster City, which ended up recruiting me and my life has been recruiting focused since. While the mechanics of a job search are very basic, its the intricate details that can muddle things up. That's where my experience comes in. One thing I will never do is to send your resume to a client without finding out if you are interested in the opportunity. I am also a firm believer that if I treat my candidates and clients with respect and professionalism, they will be relationships for life. This is important, as the key to being a successful recruiter is the ability to have candidates feel comfortable about giving their friends as referrals.Recent Postshttp://www.verticalmove.com/2013/ Job Info Category Data Science/AI/Machine Learning Employment Type Full-Time Employment Compensation $0.00 - $0.00 Location United States, CA - 94303 Client Introduction Using complex algorithms to mine the vast untapped data sources every company has and then applying predictive analytics that allows our customers to increase their rate of return for sales enablement in the enterprise market. The goal is to increase repeat and recurring revenue on a large scale. Job Description You thrive on delving into vast datasets to analyze and retrieve meaningful results and like to do so in a reliable and repeatable manner that will deliver value to the customer. Job Responsibilities *Execution of data analysis, ETL, and data mining to support customer deployments per SLAs. *Concurrent management of 6 - 8 new and existing customers. *Work closely with Customer Engagement Managers to ensure high levels of customer satisfaction and retention. Experience You thrive on details and accuracy. You have proven experience working with large datasets and drilling down to get insights from this data using various BI Tools and techniques. You have experience dealing with large enterprise customers. Required Experience *At least 4 years experience in a SaaS environment. *Hands-on experience writing complex sql queries, extracting and importing large amounts of data *Some experience dealing with enterprise software such as Oracle, SAP, Salesforce.com, Microsoft Dynamics *Strong hands on experience with Python/ R is a plus *Some development process experience *Proven track record of successful customer engagements Required Education *Bachelors degree in a scientific, mathematical, or technical field such as physics, math, economics, or engineering.  h2{margin-top: 30px; border-bottom: 1px dotted #ccc;padding-bottom: 10px;margin-bottom: 10px;} "}