{"jobID": "2815310715", "jobLocation": "New_Brunswick_NJ", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.leejohnson.com", "Headquarters": "Kirkland, WA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " For Johnson & Johnson Data Scientist job - R & D - New Brunswick, New Jersey  Skip to Main Content  Our Stories Latest NewsInnovationCaring & GivingPersonal StoriesHealth & WellnessOur Heritage Our Company About J & JOur CredoOur Leadership TeamCorporate GovernanceDiversity & InclusionEmpowering WomenInnovation at J & JOffice of the Chief Medical OfficerJ & J Health and Wellness SolutionsPolicies & StatementsCode of Business ConductCorporate ReportsProductsConsumer ProductsMedical DevicesPharmaceutical ProductsProcurementValue PillarsSupplier DiversitySupplier StandardsCareersWhat We DoHow We HireJob SpotlightEmployee BenefitsStudentsInnovationCareer StoriesMedia CenterInvestorsCorporate GovernanceQuarterly ResultsSEC FilingsNews ReleasesPharmaceutical Pipeline2017 Health for Humanity ReportStock InformationWebcasts & PresentationsActelion Public Tender OfferOur Societal ImpactGlobal Community ImpactGlobal Public HealthGlobal Environmental HealthCitizenship & Sustainability Reporting Follow Us FacebookLinkedInTwitterYouTube Quick Links Latest NewsCareersPrivacy PolicyAbout J & JMedia CenterCookie PolicyLegal NoticeProductsInvestorsEmployeesProcurementOur Social ImpactContact Us More From Johnson & Johnson Janssen Pharmaceutical Companies of Johnson & Johnson Johnson & Johnson Innovation Advancing New Healthcare Solutions Through Collaboration Johnson & Johnson Medical Devices Companies Reimagining the Way Healthcare Is Delivered Our Consumer Safety and Care Commitment Your Safety Is Our Priority Johnson & Johnson Our Story Learn About the Company's Rich Heritage at Our Digital Museum  Follow Us -- This site is governed solely by applicable U.S. laws and governmental regulations. Please see our Privacy Policy. Use of this site constitutes your consent to application of such laws and regulations and to our Privacy Policy. Your use of the information on this site is subject to the terms of our Legal Notice. You should view the News section and the most recent SEC Filings in the Investor section in order to receive the most current information made available by Johnson & Johnson Services, Inc. Contact Us with any questions or search this site for more information.  EEO Is the Law | EEO Is the Law GINA Supplement  All contents Copyright Johnson & Johnson Services, Inc.1997-2018. All Rights Reserved. Explore more Johnson & Johnson sites: Austrailia  Argentina  Brazil  Canada  Chile  China  Colombia  Costa Rica  Ecuador  Germany  India  Italy  Japan  Mexico  New Zealand / Pacific  Paraguay  Peru  Philippines  Russia  Switzerland  German  English  French  Italian  Uruguay  United States  Venezuela  Sign In  Johnson & Johnson Careers  Get future jobs matching this search  Get Job Alerts  Please enter a valid email. JOBS.ALERT.CAPTCHA_ERROR Unfortunately, our network is not responding. Please try again later.  Your job alert was successfully created.  Job  Data Scientist  Locations: New Brunswick, New Jersey  Functions: R & D  Start a new job search  Get Referred Job Description Requisition ID: **********  Johnson & Johnson Health and Wellness Solutions, Inc., is recruiting for a Data Scientist located in New Brunswick, NJ at the World Headquarters.  Johnson & Johnson Health and Wellness Solutions is a center of excellence for the Pharmaceutical, MD & D and Consumer sectors, focused on healthcare consumer engagement and behavior modification, leveraging behavioral science, healthcare analytics, and a common digital/IT platform.  Johnson & Johnson Health and Wellness Solutions serves as an enterprise-wide group responsible for harnessing a J & J portfolio of capabilities to deliver creative J & J enterprise solutions for J & J products in order to deliver improved health outcomes.  You will report to the Senior Manager Data Science and be part of the world-class Behavior Science Team. The Behavior Science Team partners with the Enterprise Solutions and Commercial Teams to help build the product portfolio. They share research results and scientific insights in top journals and conferences to demonstrate thought leadership and generate marketing claims.  In this role, you will be a disciplined-thinker, highly motivated, self-starter who possesses strong likeness towards Math and Math-based approaches. You will build algorithms from mathematical abstractions using existing tools. You will:Analyze healthcare data, run descriptive statistics, generate prior distributions, explore relationships: correlation, covariance, causality, structural equation modeling, and build Bayesian Influence diagramsDevelop Predictive models with Deep Learning networks, Gradient Boosting, Random Forest, SVM, and Logistic Regression using both generative and discriminative algorithmsDefine dynamics in the system as difference equations, Markovian processes, AR/ARMA, and develop Optimization algorithms, e.g. Decision theory, finite horizon problems, Kalman filter, Particle filterPerform Sub-group analysis: clustering, agglomerative clustering, graph based clustering, and PCA analysisDefine and develop features, selections (Ridge/Lasso), and rankingDevelop algorithms to achieve the desired health outcomes and improved health behavior in Big data environment SPARK and SCALA.Standardize nominal, categorical, and numerical data to ensure data integrityPartner with Scientists, Engineers and the business to collect and organize healthcare data and generate insights for thought leadership and marketing claimsWork with Engineer to build dashboards to visualize near real-time insights for targeted audience including scientists and commercialAuthor peer reviewed journal articles and white papers related to the Data Science solutions Thriving on a diverse company culture, celebrating the uniqueness of our employees and committed to inclusion. Proud to be an equal opportunity employer. QualificationsA minimum of a PhD in Computer Science, Statistics, Electrical Engineering and/or related discipline is requiredPost Doc research experience in healthcare is preferredA minimum one year of experience is required; preferably in algorithm development, predictive models and/or optimization techniqueStrong Programming skills in any of the following is required: Python, SQL, Java, C++/C, Scala, Matlab, RResearch in Machine Learning is requiredExperience in Deep Learning, Bayesian inference and Markovian processes is preferredExperience in Text Mining and Neuro Linguistic Programming (NLP) is preferredUnderstanding of and ability to apply research in real world problems to generate actionable insights is requiredDemonstrated professional scholarly activity: conference presentations, published in peer-reviewed publications / journals is requiredActive listening skills and deep analytical ability are requiredA real passion for excellence and exceeding customer expectations is requiredAbility to work in New Brunswick, NJ is requiredUp to 5% of travel is required, primarily domestic Primary Location  United States-New Jersey-New Brunswick  Organization  J & JHlth & WellSolutions,Inc (6173)  Job Function R & D Requisition ID ********* Join our talent community  Quick Links Latest NewsCareersPrivacy PolicyAbout J & JMedia CenterCookie PolicyLegal NoticeProductsInvestorsEmployeesProcurementOur Social ImpactContact Us More From Johnson & Johnson Janssen Pharmaceutical Companies of Johnson & Johnson Johnson & Johnson Innovation Advancing New Healthcare Solutions Through Collaboration Johnson & Johnson Medical Devices Companies Reimagining the Way Healthcare Is Delivered Our Consumer Safety and Care Commitment Your Safety Is Our Priority Johnson & Johnson Our Story Learn About the Company's Rich Heritage at Our Digital Museum  Follow Us -- This site is governed solely by applicable U.S. laws and governmental regulations. Please see our Privacy Policy. Use of this site constitutes your consent to application of such laws and regulations and to our Privacy Policy. Your use of the information on this site is subject to the terms of our Legal Notice. You should view the News section and the most recent SEC Filings in the Investor section in order to receive the most current information made available by Johnson & Johnson Services, Inc. Contact Us with any questions or search this site for more information.  EEO Is the Law | EEO Is the Law GINA Supplement  All contents Copyright Johnson & Johnson Services, Inc.1997-2018. All Rights Reserved.  This site uses cookies as described in our Cookie Policy. Please click the 'Accept' button or continue to use our site if you agree to our use of cookies.  Accept  x"}