{"jobID": "2829535804", "jobLocation": "San_Diego_CA", "jobTitle": "Computational Research Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.lilly.com", "Headquarters": "Indianapolis, IN", "Size": "10000+ employees", "Founded": " 1876", "Type": " Company - Public (LLY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "114000", "jobDescription": " Responsibilities  It is an exciting time to be a part of Lilly Biotechnology Center in San Diego. We are growing our capabilities in Computational biology and need talented and high-energy scientists to join our dynamic team. Do you consider yourself a strong data scientist? Are you experienced in analyzing or modeling a large amount of biological sequence data? Have you had the desire to use your strong understanding of sequence analysis algorithms, such as dynamic programming, hidden Markov modeling, etc to tackle protein property and characterization challenges from a structural perspective? Lilly is looking for a highly motivated bioinformatics scientist to join our Biologics group to develop and apply computational algorithms enabling development of computational workflows to identify and optimize Fabs, scFv and multispecifics. Your role will involve collaborating with biotechnology scientists (protein engineers, antibody discovery, protein biosciences, etc) and applying ground breaking computational approaches to discover and build the best therapeutic proteins faster. Your contributions will include (1) applying machine learning and predictive modeling to assist in biologic drug discovery, (2) developing next generation databases to integrate heterogeneous workflow data and implementing data mining applications to meet specific project needs, and (3) evaluating novel computational algorithms and software applications. If you have experience analyzing next generation sequencing data and have studied immune repertoire or protein engineering problems by NGS please consider this opportunity.  Are you a phenomenal teammate and a focused individual with a strong work ethic and attention to detail? Do you have a strong interest in applying your knowledge, tools and methods for biologics engineering and drug discovery?This could be the career move for you.  Basic Qualifications  PhD in Bioinformatics, Mathematics, Statistics, Computer Science, Biological Sciences or relevant discipline  Experience with computational/bioinformatics related work  Additional Skills/Preferences  Scientific proficiency, creativity, ability to collaborate effectively with others, and independent thought processes.  Must be capable of working on problems of diverse scope in which analysis of data requires a detailed evaluation of possible factors.  Strong programming skills in one of the high level programming languages (Python, Java, C/C++) and proficient in a scripting language (e.g. R, Perl, SQL).  Excellent communication skills and a broad knowledge of the technologies in use. Able to distill and relay complex technical/scientific concepts to a variety of members within the organization.  Expected to be or become familiar with the background knowledge and technology required to address the goals of a discovery program or research task.  Comfortable working with high performance or cloud computing environment and relational databases.  An ability to train and evaluate machine learning models, such as linear and logistic regression, SVMs, Random Forests, neural networking and Gradient Boosting etc."}