{"jobID": "2802182624", "jobLocation": "Foster_City_CA", "jobTitle": "Research Scientist I, Biophysics", "companyRating": "3.1", "companyInfo": {"Website": "www.gilead.com", "Headquarters": "Foster City, CA", "Size": "5001 to 10000 employees", "Founded": " 1987", "Type": " Company - Public (GILD) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "121000", "jobDescription": " For Current Gilead Employees and Contractors:Please log onto your Internal Career Site to apply for this job.Job DescriptionSpecific Responsibilities: Gilead is seeking a motivated researcher to work in the Biophysics group within the Research organization. The successful candidate will establish experimental systems on biosensor systems (e.g. Biacore, ProteOn), generate, analyze, and interpret data, and communicate results to project teams. He/she will support projects from discovery research. The candidate must be driven, resourceful, able to work independently and display scientific rigor. Excellent organizational skills in management of data, and internal and external collaborations, are essential. The candidate will participate in regular team meetings and present results when required. Essential Duties and Job Functions: The position will require establishing experimental systems on the biosensor from the ground up so that kinetic and thermodynamic parameters for interactions can be reliably characterized. The successful candidate will be able to critically analyse data and design experiments to establish parameters such as immobilization/capture methods, competence of various protein constructs, and optimal biosensor platform. Skill in troubleshooting experimental setups and attention to experimental detail is essential. The candidate is expected to document experiments in a thorough and timely manner. Information obtained from these experiments systems will be communicated to various project teams to help understand mechanism of action as well as aid in general drug discovery efforts. General lab duties include instrument maintenance, ordering lab consumables, and ensuring compliance with EH&S; regulations. Knowledge, Experience and Skills: The candidate should possess a Ph.D. in Chemistry, Biochemistry, or Biology with 0+ years industry experience, or a B.Sc. or M.Sc. degree with extensive industry experience and track record of positive impact on project goals. The candidate should have a good working knowledge of basic kinetic and thermodynamic concepts. Experience using the ProteOn and Biacore biosensor platforms will be advantageous, although candidates with a strong biophysical understanding of other techniques such as KinExA are also encouraged to apply.  #LI-KW1For jobs in the United States:As an equal opportunity employer, Gilead Sciences Inc. is committed to a diverse workforce. Employment decisions regarding recruitment and selection will be made without discrimination based on race, color, religion, national origin, gender, age, sexual orientation, physical or mental disability, genetic information or characteristic, gender identity and expression, veteran status, or other non-job related characteristics or other prohibited grounds specified in applicable federal, state and local laws. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Era Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants who require accommodation in the job application process may contact careers@gilead.com for assistance.  For more information about equal employment opportunity protections, please view the ‘EEO is the Law’ poster.  NOTICE: EMPLOYEE POLYGRAPH PROTECTION ACT YOUR RIGHTS UNDER THE FAMILY AND MEDICAL LEAVE ACT PAY TRANSPARENCY NONDISCRIMINATION PROVISION  Our environment respects individual differences and recognizes each employee as an integral member of our company. Our workforce reflects these values and celebrates the individuals who make up our growing team.  Gilead provides a work environment free of harassment and prohibited conduct. We promote and support individual differences and diversity of thoughts and opinion.For jobs in France:Conformément à la Loi « Informatique et Libertés » (06/01/78), nous vous informons du fait que les données personnelles renseignées pourront faire l'objet d'un traitement informatique par Gilead et pourront être transmises aux Organismes Sociaux. Par ailleurs, vous disposez d'un droit d'accès, de rectification et de suppression des données vous concernant. Vous pouvez exercer ce droit en contactant: FranceDataPrivacy@gilead.comFor Current Gilead Employees and Contractors:Please log onto your Internal Career Site to apply for this job."}