{"jobID": "2836773558", "jobLocation": "Westland_MI", "jobTitle": "Retail Electronics Merchandiser", "companyRating": null, "companyInfo": {"Website": "www.2020companies.com", "Headquarters": "Fort Worth, TX", "Size": "5001 to 10000 employees", "Founded": " 1991", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Mosaic Sales Solutions, MarketSource, MarketStar"}, "estimatedSalary": null, "jobDescription": " Overview  Are you Tech-savvy, active,&handy; with tools?Able to lift up to approximately 50lbs?Passionate about working with cutting-edge technology?Capable of following specific directions?Able to travel to multiple retail stores daily within a designated territory? If so, 2020 Companies is hiring Retail Electronics Merchandisers in your area!  These are highly sought-after jobs within 2020 for those ready to commit.  Dependability&attention; to detail will serve you well in your dedicated territory visits.  Qualified candidates must understand merchandising tasks such as: Repair and maintenance of electronic displaysInstallation and removal of TV'sTroubleshoot&load; content to audio devices, computers,&other; technologyConnecting devices to established and authorized networks and WiFiPlan-o-gram updatesCleaning, facing, ensure display functionality What's in it for you? Weekly PayPaid TrainingMileage ReimbursementApparel and Tools ProvidedWork within leading retailers #Electronics #TV #Reset #Schematic #Planogram #Install #Installation #Computer #Devices  Duties and Responsibilities Job Description:Executes retail merchandising tasks as scheduledAbility to understand and troubleshoot client displays to maintain and monitor its functionality and to correct issues as neededPerforms tasks in stores in an efficient cost effective mannerAccurately reports completed retail tasks via designated systems on the day the work is performedCommunicates effectively with store personnel regarding tasks, activities, promotions, and objectivesCompletes required training and certification programsUses a Smartphone and has the ability to take photos, resize them and upload as requiredAbility to implement retail schematics and merchandising materials as assignedFlexibility to participate in team scheduled tasks and client work-alongsBuild brand recognition; image and voiceDedicated to providing excellent customer service and to develop a professional working relationship with store management, associates, and other merchandising companies to effectively meet company and client objectivesFollows company policies, procedures, and position responsibilitiesPerformance Measurements:Completion RateAccuracyQualityQualifications:High school diploma or equivalent required; Business degree preferredPrior retail experience is preferred, but not requiredPlan-o-gram experience preferred, but not requiredPrevious experience in installation of product displays preferredValid driver's license is required as travel to additional locations may be necessaryAutomobile liability insurance is required to be maintainedWork will entail standing, walking, bending, twisting, squatting, and climbing, as well as upper and lower body mobilityLift up to 25 pounds and occasionally lift over 50 pounds from the floor to eye levelWork flexible shifts (am or pm), occasional weekends and/or holidays based on store/client requirements as needed"}