{"jobID": "2583857547", "jobLocation": "Washington_DC", "jobTitle": "Partner Account Manager", "companyRating": null, "companyInfo": {"Website": "www.metalogix.com", "Headquarters": "Washington, DC", "Size": "201 to 500 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "PARTNER ACCOUNT MANAGER Metalogix is the market leading provider of software solutions to move, manage and protect content within enterprise collaboration platforms in the Cloud and on-premises.  We are seeking a Partner Account Manager (PAM) in our Washington DC. The ideal candidate for this position has proven that they are a motivated individual with strong organization skills that can work in a team environment, has attention to detail, and a desire to grow their career in the software industry by exceeding their goals. This position comes with an excellent compensation package consisting of a competitive base salary and performance-based commission.  The Partner Account Manager will be responsible for day to day collaboration with sales, marketing, solutions engineering and operations in efforts to develop strategic relationships, facilitate partner enablement efforts, and to grow the pipeline towards increased partner driven billings. Responsibilities include but are not limited to:Drive Software Revenue with Metalogix PartnersExpand and develop partnerships with National and Regional SI providersGain trusted advisor status with key Metalogix AlliancesInteract and collaborate across the Partner’s various business segments – Sales, Consulting, Marketing and Account TeamsCreate strong alignment between direct sales and partner ecosystemCollaborate with Marketing team to develop and launch partner marketing campaignsHave strong Federal ties to Microsoft and MCSQualifications:College degree preferred5+ years’ experience building and developing Software AlliancesExperience in the Microsoft Collaboration market strongly preferredSuccessful track record of building and executing strategic Go-To-Market plans with partnersStrong business development acumenExcellent communication and presentation skillsProficiency with Salesforce preferred Metalogix is an Equal Employment Opportunity employer valuing diversity and what it brings to the workplace. All qualified applicants regardless of race, color, religion, gender, sexual orientation, marital status, gender identity or expression, national origin, genetics, age, disability status, protected veteran status, or any other characteristic protected by applicable law are encouraged to apply. "}