{"jobID": "2697564945", "jobLocation": "Novato_CA", "jobTitle": "Office Manager", "companyRating": null, "companyInfo": {"Website": "www.primamedgroup.com", "Headquarters": "Novato, CA", "Size": "201 to 500 employees", "Founded": " 2010", "Type": " Nonprofit Organization", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Office Manager  Job Number  PMF2018-52  Hours Per Two-Week Period  80  Shift Hours  8 Hour Shift  Apply Now About Prima Medical Foundation: Prima Medical Foundation (an affiliate of Marin General Hospital) is looking for healthcare professionals to join our positive, high-energy team to delivering world-class patient care across Marin County! With a network of clinics across many different medical specialties throughout Marin and Southern Sonoma County, Prima functions as an extended family of healthcare advocates who take pride in knowing that we aren't just making a living; we're making a positive impact on the health of our patients and their families. Come and join us in touching and transforming lives every day!COMPENSATION: We have an excellent benefits package, such as medical/vision/dental insurance, generous PTO and paid holiday, 401(k) with company match, and more!JOB SUMMARY:The Office Manager is responsible for the day-to-day supervision, direction, and coordination of clerical staff, as well as the administrative operations of a clinic(s). Specific duties include, but are not limited to, supervising clerical staff, including assigning and reviewing work, hiring, training, counseling on performance, and conducting performance evaluations and disciplinary actions. Incumbent is expected to be well trained for the integration of enhanced information systems technology; performs complex and routine administrative support duties under minimal supervision.EDUCATION:Bachelor’s degree in Health Services Administration, or business-related field preferred. May substitute any equivalent combination of secondary education and training that provides the desired knowledge, skills, and abilities required for the position.EXPERIENCE:One or more years of progressively responsible supervisory and clerical operations experience, with at least one year in a healthcare and/or clinic environment.DUTIES AND RESPONSIBILITIES:Performs specific duties including, but not limited to daily office management tasks such as telephone management, registration, scheduling of appointments, charge entry, and insurance authorization. Supervises all daily operational business functions and activities related to the efficient day-to-day operation of service areas/departments. These functions and activities include, but are not limited to, participation in billing audits, daily charge processing, registration, customer service functions, and scheduling.Supervises issues related to Information Technology (IT) for service areas/departments, serving as primary coordinator, trainer, and/or system administrator (often may be considered “expert” or “superuser”).Recommends and implements workplace improvements to achieve greater productivity and consistency. Exercises some latitude to consider appropriate procedures and practices to achieve end results. May be required to implement corrective actions (as needed and directed) to remain within budgetary requirements and constraints.Assists in developing and maintaining policies and procedures for operations, taking a proactive role in ensuring that all operational policies and procedures are documented and up-to-date, ensuring quality control standards are maintained.Responsible for department’s timekeeping processing in adherence to regulatory requirements.Manages and maintains medical records and/or files adhering to State and Federal regulations.Performs administrative support functions, including and not limited to, tracking and preparing statistical data, ordering supplies, receiving and responding to inquires regarding operational questions and procedures, recording phone messages, composing/preparing written documents, scheduling meetings/appointments, using standard office equipment, sorting correspondence, and filing.Performs other duties as required or assigned.Assists with special projects, attends meetings as required, and maintains good interdepartmental relations.External hires must pass a background check and medical screen. Qualified applicants with arrest records and/or conviction records will be considered for employment in a manner consistent with federal, state and local laws. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sexual orientation, gender identity, protected veteran status or disability status and any other classifications protected by federal, state & local laws."}