{"jobID": "2806674777", "jobLocation": "Washington_DC", "jobTitle": "Speech Language Pathologist - Early Intervention", "companyRating": "3.2", "companyInfo": {"Website": "www.tendertouch.com", "Headquarters": "Lakewood, NJ", "Size": "1001 to 5000 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": "Early Intervention Speech Therapist Job Description Qualifications1.Graduate of an accredited university with an MA, or M.S. in communication disorders that is recognized by ASHA. 2.Holds current license and/or registration in the state (as applicable). 3.Successful completion of CFY. 4.Experience in Early Intervention preferred.Job Responsibilities1.Document findings timely, accurately and adhering to all practice guidelines. 2.Provide a comprehensive service and support plan including IFSP/IEP goals 3.Adhere to frequency, duration and appropriate treatment guidelines as indicated 4.Provide comprehensive treatment to infants and toddlers utilizing modalities to promote developmental growth in natural environments 5.Document patient’s progress on session notes and during quarterly/annual meetings, as dictated by county and state guidelines 6.Modify treatment goals as indicated, on appropriate forms and in a timely manner. 7.Complete all training requirements as indicated by state and county guidelines 8.Document patient’s discharge and complete all exit data paperwork as indicated by state and local guidelines 9.Document any family/caregiver training as indicated. 10.Complete any and all documentation forms required by the company and state/local early intervention guidelines 11.Document plans and information needed for team meetings. 12.Attend and participate in meetings as indicated by state and local program requirements 13.Complete billing logs and bill patients ethically and accurately for speech therapy services rendered. 14.Cover other therapists’ patient caseload during absence as necessary. 15.Supervise junior staff members, students in compliance with State ST Board regulations and requirements. Co-sign notes of CFY’s and students as indicated Maintain professional relationship with co-workers, patients and patient families. 16.Comply with all company safety policies and procedures. 17.Comply with all state and federal laws 18.Report to work on time, adhere to scheduled hours and project a professional image at all times. 19.Adhere to productivity requirements, complete productivity reports and submit in a timely manner. 20.Comply with all company policies re: lunch, overtime, sick and time off notification. 21.Maintain a positive work atmosphere by demonstrating and communicating in a professional manner so as to foster positive relations with families, educators, clients, co-workers and managers. 22.Perform any other duties assigned by the Clinical Director. 23.Adhere to any and all company written and oral policies and procedures. 24.Company may request your availability to travel within reasonable distances.Physical DemandsEmployee should be able to transfer patients, lift weights, transport patients and perform treatment on the mat. Employee should be knowledgeable in and exercise good body mechanics during patient treatment. Tender Touch is an Equal Opportunity Employer"}