{"jobID": "2790100551", "jobLocation": "Chicago_IL", "jobTitle": "Senior Analyst, Technology Data & Information Management", "companyRating": null, "companyInfo": {"Website": "www.jll.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1997", "Type": " Company - Public (JLL) ", "Industry": " Real Estate", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " CBRE, Cushman & Wakefield"}, "estimatedSalary": null, "jobDescription": "JLL, an international real estate management company, is seeking a senior analyst to join our global Data & Information Management organization. We are seeking candidates that are self-starters who can work in a diverse and fast-paced environment that can join our team immediately.Key ResponsibilitiesIndependently develops, executes and monitors complex data management / analytic processes to support ad hoc data and information delivery for assigned projects.Develops proficiency in multiple data management disciplines and tools to develop robust data and information management solutions.Proactively identifies opportunities to optimize the performance and efficiency of existing processes/procedures. Monitors data / information management processes to ensure data quality and consistency in support of business initiatives.Ensures proper escalation, prioritization and remediation of data quality issues.Engages with colleagues and internal customers to reverse engineer existing business processes and identify core business requirements for new information deliverables and data infrastructure.Articulates business requirements in sufficient detail such that a technical solution can be designed and engineered.Consults with the business to develop documentation and communication materials to ensure accurate usage and interpretation of JLL data.Identifies and acquires new data sources, performs data discovery to understand data values and relationships, and develops prototype solutions to deliver immediate business value.QualificationsMinimum 2-4 years of work experience in the fields of information science, data management and/or computer science.Bachelor’s degree in Information Science, Computer Science, Mathematics, Statistics or a quantitative discipline in science, business, or social science. Advance degree preferred.Demonstrated experience with standard analytical, reporting and programming languages and their application (such as SQL, Python, R, Tableau, Power BI etc.) Understanding of data and systems engineering concepts to effectively integrate and analyze data to develop actionable business information deliverables.Able to think logically, organize work flows efficiently, and solve problems independently.Reliable, self-motivated, and self-disciplined individual capable of planning and executing multiple projects simultaneously within a fast paced environment.Capability to self-learn new software applications and programming languages.Effective written and verbal communication skills, including technical writing.Excellent technical, analytical and organizational skills. Project management skills desired.Additional Details for Senior AnalystSome of the responsibilities include:Develop and deliver solutions to business problems using a variety of analytical approaches and methodologiesGenerating revenue or cost save opportunities through data-driven insightsPrepare and present findings and analysis. Ensure alignment with stakeholder objectives and enterprise goals - drive faster, smarter data driven decisionsKeep track of new technologies to get ahead of competition and create analytics as a competitive advantage for JLLExplore and utilize new data mining and data visualization toolsAdditional QualificationsBachelors in a quantitative field such as Engineering, Computer Science, Statistics etc with at least 2 years of overall experienceExtensive knowledge and experience in at least one of the following: Machine learning, artificial intelligence, statistics or data miningStrong experience with SAS, Python or RAt least 1-2 years of experience in advanced quantitative techniquesAbility to quickly understand, process and consume industrial scale databases using SQLExcellent communication skills to work with multiple cross-functional teamsDemonstrates a strong sense of intellectual curiosity with data #LIJLL Is an Equal Opportunity EmployerJLL is committed to developing and maintaining a diverse workforce. JLL strongly believes in equal opportunity extended to all individuals in all aspects of the employment relationship, including recruitment, hiring, training, promotion, transfer, discipline, layoff, recall and termination without regard to race, color, religion, belief, creed, age, sex, pregnancy or maternity (including childbirth and related conditions), family responsibility (e.g. child care, elder care), nationality, ethnic or national origin or ancestry, citizenship, marital status, civil partner status, sexual orientation, gender identity or expression, transgender status, veteran’s status, genetic information, trade union membership, social position, political view or status as a qualified individual with a disability, protected leave status or any other protected characteristic in accordance with applicable law. The company also endeavors to make reasonable accommodations for known physical or mental limitations of otherwise qualified employees and applicants with disabilities unless the accommodations would impose an undue hardship on the operation of our business and ensures that employment decisions are based only on valid job requirements.For employees in the United States, please see a fully copy of our Equal Employment Opportunity and Affirmative Action policy at https://jll2.sharepoint.com/CorporatePolicies/HR%20Policies/Equal%20Employment%20Opportunity%20and%20Affirmative%20Action.pdf. If you have questions about careers at JLL or are disabled and require further assistance in applying for a position, please contact us at careers@am.jll.com"}