{"jobID": "2820650058", "jobLocation": "San_Francisco_CA", "jobTitle": "Inventory Operations Manager", "companyRating": null, "companyInfo": {"Website": "www.brndlss.life/glassdoor", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2017", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Thrive Market, Glossier, Amazon"}, "estimatedSalary": null, "jobDescription": "About BrandlessBrandless is a new kind of company, a community that puts people first and makes better products at fairer prices. Everything is just $3, BrandTax free and sold exclusively on brandless.com. In a sentence: Better everything for everyone, all $3. Brandless makes hundreds of everyday essentials, aka the stuff you use all the time, including non-GMO food, clean personal care products, non-toxic cleaners and home goods. At Brandless, you can shop your values while getting great value.What youll do:The Inventory Operations Manager is responsible for ensuring accurate inventory reporting and data across Brandless and partner systems. You will help create new and maintaining existing systems that power our inventory information. You have an approach rooted in standard work, transparent communication, and cross-functional collaboration. The role will identify opportunities within our fulfillment and supply chain processes related to inventory and coordinate cross functionally to plan and execute a path forward, relying on program and project management skill sets. Inventory tracking and reconciliation is currently rooted in NetSuite, which you will ideally have experience with.Youll Create Impact By:Doing: You have a strong bias for action & ask how we could go faster while staying responsible & coordinated.Building: You contribute to our product & technology roadmap by ideating and gathering functionality requirements. You highly value creating scalable and transparent data and information workflows.Collaborating: Your role will impact & rely on multiple other stakeholders input and support, and you have experience moving quickly while staying aligned cross functionally.Planting Seeds: As we build a scalable base, you will test the waters of new and innovative idea that could radically improve our customer experience, cost structure, and other key success criteria for our business.What youll need:5+ years experience in inventory management, supply chain or operationsBA/BS in Supply Chain, Business, Sciences, Engineering or related critical thinking fieldsDemonstrated analytical, problem solving, and documentation skillsProven analytics and reporting skills (data mining, excel reporting, analysis)Excellent verbal and written communication skillsExperience in NetSuite is highly preferredBrandless provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Brandless follows applicable state and local laws governing non- discrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training."}