{"jobID": "2669535258", "jobLocation": "Iselin_NJ", "jobTitle": "Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.directenergy.com", "Headquarters": "Houston, TX", "Size": "5001 to 10000 employees", "Founded": " 1986", "Type": " Subsidiary or Business Segment", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " NRG Energy, Exelon, Just Energy"}, "estimatedSalary": "71000", "jobDescription": " Job DescriptionThe Data Analyst will be a key contributor to delivering value to customers of our Panoramic Power offering. The role will be responsible for documenting energy inefficiencies, site operational inefficiencies, and equipment operating issues by gathering, analyzing, and reporting on electrical data at an individual device level as well as a site level.  The Data Analyst must possess knowledge of large data reporting, analysis and documenting. The Data Analyst is responsible for compiling the energy observation contents into a professional energy report using predefined templates. The analyst may also present technical data, analysis, and recommendation reports to customers and will therefore need excellent written and verbal communication skills.  The Data Analyst will use Business Intelligence tools such as Tableau software to derive Device Level benchmark analysis using existing templates as well as explore new ways to derive improved and efficient analysis methods. The Analyst will be responsible to merge the Tableau output into the Energy Analyst report.  The Data analyst will serve as a report coordinator responsible for collecting the report data from the extended team members and compiling the Energy Analyst Report according to the reporting schedule and as reporting requirements vary based on customer needs.  In addition, The Energy Data Analyst will occasionally participate in field work, including attending Panoramic installations and configure the software to work with the hardware."}