{"jobID": "2764706828", "jobLocation": "San_Diego_CA", "jobTitle": "Bioinformatics Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.biolegend.com", "Headquarters": "San Diego, CA", "Size": "501 to 1000 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " BD, Abcam, Bio-Techne"}, "estimatedSalary": "73000", "jobDescription": " BioLegend develops world-class, cutting-edge antibodies and reagents for biomedical research, manufactured in our state-of-the-art facility in San Diego, CA. Our mission is to accelerate research and discovery by providing the highest quality products at an outstanding value, along with superior customer service and technical support. Our product expertise covers a diverse set of research areas including Immunology, Neuroscience, Cancer, Stem cells, and Cell Biology. Job Summary The Bioinformatics Scientist is an exciting new opportunity in the Proteogenomics Group within the Cell Analysis department at BioLegend. The Bioinformatics Scientist’s role will focus on designing and executing bioinformatics methods for analyzing a new type of next generation sequencing derived data that has been enabled by BioLegend’s TotalSeq reagents, which are produced via conjugation of barcoded DNA oligonucleotides to antibodies to enable the generation of both single cell transcriptomic and proteomic data simultaneously, in high throughput.  Responsibilities will include, but are not limited to, the development and execution of novel bioinformatics pipelines for the analysis of single cell proteomic and transcriptomic data for internal and collaborative projects. This position will require interaction with industry partners and outside experts in the RNA-seq space, handling tech support related to NGS data, evaluating software solutions and new informatics methods, working with marketing and product development teams to produce publication quality TotalSeq data analysis figures and methods descriptions, and working as part of a team to both evaluate and develop user friendly software solutions for the analysis of TotalSeq data. Essential Functions Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Work as a member of a team (with both outside and inside entities) to develop and execute bioinformatics pipelines for the analysis of TotalSeq dataWork with business development and product development teams to evaluate new opportunities in algorithm and/or software development related to RNA-seq NGS applicationsEvaluate and understand customer needs and learn about the competition and the market potentialWork with internal R&D; teams and external collaborators to analyze data and prepare high quality figures and methods descriptions for publicationWork with the marketing team to implement launch plans and marketing strategies, including reviewing data sheets, developing web pages, email blasts, literature, promotions, and leading tradeshow strategiesProvide customer support as needed, support the technical service team on product line-specific inquiries, and perform lab demonstrations and related activities as requested by customersCompetenciesAccountability - Accepting responsibility that results in anticipation/prevention of problem areas from actions, and problem solving inside and outside the department/organization.Dependability - Amount of supervision required, punctuality and attendance.Quality of Work - Setting high standards regarding his/her work and working environment and acting accordingly; developing quality standards, continuously evaluating performance, products, and procedures; actively seeking ways to improve quality.Teamwork - Working as a productive member of a cohesive group toward a common goal, and contributing to team development and effective team dynamics.Minimum Qualifications - Education and Experience5+ years of experience working with RNA-seq data, with demonstrated expertise through relevant publicationsProficiency with programming languages (Python, Perl, R) and working in a UNIX based high performance computing environmentExperience with the analysis of large NGS data setsExperience with good record keeping practices in bioinformatics (R Markdown, ipython)Deep understanding of standard methods and statistical principles used in the analysis of RNA-seq dataAppreciation of the unique challenges presented by multiomic single cell NGS dataPreferred Qualifications– Education and ExperiencePhD in bioinformatics or biostatisticsExperience working with high throughput single cell RNAseq data.Work Environment& Physical Demands While performing the duties of this job, the employee regularly works in an office setting. Occasional exposure to laboratory environment.  The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.  While performing the duties of this job, the employee is regularly required to use hands and fingers to handle, feel, or operate objects, tools or controls, and reach with hands and arms. The employee is frequently required to stand, talk and hear."}