{"jobID": "2812143120", "jobLocation": "Austin_TX", "jobTitle": "Senior Data Management Analyst", "companyRating": null, "companyInfo": {"Website": "www.eliassen.com", "Headquarters": "Reading, MA", "Size": "1001 to 5000 employees", "Founded": " 1989", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " TEKsystems, Kforce, Randstad US"}, "estimatedSalary": null, "jobDescription": " Our innovative financial services client fosters an environment of collaboration. If you're looking to work in a place where your input is valued, they're currently seeking a Senior Data Management Analyst to join their dedicated team in Austin!This is a long term contract opportunity with a comprehensive benefits package that includes Medical, Dental and Vision benefits, 401k with company matching, and life insurance.Responsibilities of the Senior Data Management Analyst:Help business stakeholders to understand enterprise data in the form of dashboards and visualizationsEnsure adherence to all industry standard and enterprise level security, availability, confidentiality, and privacy policies and controlsContribute to data management strategy and planningMaintain data management toolsProvide hands-on delivery of data management solutionsRequirements of the Senior Data Management Analyst:At least 8 years of relevant experience in data science or business analytics, including the use of data warehousing and BI tools and technologiesAt least 8 years of hands-on experience with SQL, ETL Virtualization, database, and data analysis toolsAt least 5 years of experience performing data management services in a cloud-based settingDemonstrated capability for trend analysis, reporting, and providing data-driven recommendationsExceptional communication skills, both written and verbal, with the ability to interact across all levels of the organizationMotivated self-starter, able to work on complex projects with minimal guidancePrior experience guiding the implementation of common data structures supporting enterprise-level applications is a musProficiency in Microsoft productivity tools and Microsoft Power BI Job ID: 307537 About Eliassen Group: Eliassen Group provides strategic talent solutions to drive our clients innovation and business results. Leveraging nearly 30 years of success, our expertise in IT staffing, Agile consulting, creative services, managed services, and life sciences enables us to partner with our clients to execute their business strategy and scale effectively. Headquartered in Reading, MA and with offices from coast to coast, Eliassen Group offers local community presence, deep networks, as well as national reach. For more information, visit http://www.eliassen.com.  Eliassen Group is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.  Dont miss out on our referral program! If we hire a candidate that you refer us to then you can be eligible for a $1,000 referral check!"}