{"jobID": "2821518133", "jobLocation": "San_Bruno_CA", "jobTitle": "Business Analyst with Data Analytics background", "companyRating": "3.3", "companyInfo": {"Website": "www.tcs.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1968", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Cognizant Technology Solutions, Accenture, IBM"}, "estimatedSalary": "86000", "jobDescription": " Job DescriptionAdvanced Solutions – Business  Analyst, Data & Analytics Have you ever walked down an aisle in your local Walmart and  wondered why your favorite beverage or food product moved? At Nielsen, we work  with retailers to help them understand their consumers, and to optimize their  business down every aisle. On the Nielsen Retail Team you will work  face-to- face with major retail players and use Nielsen solutions to help  answer questions such as finding the right assortment and guiding pricing  strategies. Every day brings a new challenge when working in the fast paced  retail environment.  Be curious. Be collaborative. Be forward  thinking. Join the Retail Team and work with our clients as a problem  solver and the voice of Nielsen at our clients. When you join the Nielsen team,  you’re signing up for an experience that requires flexibility, curiosity, and  passion. As a Business Analyst you  will: ·  Work closely with client  service team to define information objectives and design appropriate analytic  model solution  ·  Ensure pro-active insights and action oriented  solutions are delivered to clients on time and without errors  ·  Own the design, development, and maintenance of  ongoing metrics analyses, dashboards, etc.  ·  Surface insights though polished visualizations  to help guide critical business decision-making  ·  Maintain an organized workflow and actively  contribute to team knowledge base  ·  Ensure data quality throughout all stages of  acquisition and processing, including data collection, cleansing, normalization  and transformation Background and  Technical Skills ·  Proficiency in at least one  scripting/statistical language (R or Python preferred)  ·  Experience building tools and automated  processes to extract, clean, and distill data  ·  Comfortable writing Linux OS shell scripts  ·  Advanced SQL knowledge (iterative functions,  using WITH statements, performance tuning, etc.)  ·  Familiarity with Jupyter Notebooks a plus General Skills ·  Strong logic, deductive reasoning, problem  solving and critical thinking skills  ·  Experience tackling vague problems, transforming  unframed problems into algorithmic solutions.  ·  Scrappiness and independent troubleshooting  ability  ·  Demonstrated mastery in data analysis &  application to client business issues  ·  Strong project management skills  ·  Able to work collaboratively with internal and  external teamsJob FunctionCONSULTANCYRoleBusiness AnalystJob Id124460Desired SkillsData Analytics Desired Candidate Profile Qualifications : BACHELOR OF COMPUTER SCIENCE"}