{"jobID": "2821029883", "jobLocation": "Irving_TX", "jobTitle": "Senior Data Governance Analyst", "companyRating": null, "companyInfo": {"Website": "www.mckesson.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1833", "Type": " Company - Public (MCK) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Cardinal Health, AmerisourceBergen, UnitedHealth Group"}, "estimatedSalary": null, "jobDescription": " McKesson is in the business of better health and we touch the lives of patients in virtually every aspect of healthcare. We partner with payors, hospitals, physician offices, pharmacies, pharmaceutical companies and others across the spectrum of care to build healthier organizations that deliver better care to patients in every setting. We believe in the importance of strong, vital organizations because we know that patients can only be healthy when our system is healthy.  Every single McKesson employee contributes to our mission—by joining McKesson you act as a catalyst in a chain of events that helps millions of people all over the globe. Talented, compassionate people are the future of our company—and of healthcare. At McKesson, you’ll collaborate on the products and solutions that help us carry out our mission to improve lives and advance healthcare. Working here is your opportunity to shape an industry that’s vital to us all.  We understand the importance of a system that works together. Your expertise, drive and passion can help us improve everything we touch, from providers to payors to pharmacies. Join our team of leaders to begin a rewarding career.  Wherever you contribute here at McKesson, you will have the ability to make a real impact in the lives of others.Current NeedThis position will be responsible for documentation and analysis of business requirements to support adherence to our organizational data governance standards. He/she will work closely with internal business partners to identify opportunities, produce recommendations, develop implementation plans and execute accordingly. The right candidate will build strong partnerships with stakeholders, and will provide regular business updates as appropriate. They will hold themselves and others accountable to the data governance model established. Providing reporting and solution development will be critical in this role. Key Responsibilities:Analyze and measure the efficacy of current business processesDevelop sustainable, repeatable and measurable business process improvementsExplore best practices in the industry to establish benchmarksRecommend business processes that focus on enhanced governance, increased productivity and reduced costIdentify opportunities to implement new technologies to support business process enhancementsOrganize, lead and facilitate cross-functional project teams as appropriateCollect data to identify systemic root causes and measure performance against process requirementsDevelop and deliver presentations and training courses including measurement, analysis, process improvement and control Partner with internal teams to support critical governance activitiesDevelop and manage project plans, working directly with business partners on key activitiesWork with stakeholders to address open issues following up as necessary until resolvedOwn assignments through completion; hold others accountable to deliverablesRepresent the organization in stakeholder meetingsSupport delivery of reporting, ad hoc and analytics requests; analyze, investigate, identify and manage required data for reportingDemonstrate sound business judgement and work independentlyDevelop technical specification documentation and maintain report inventoryCapture, document and communicate best practices with technical resourcesFlexibility with schedule to prioritize and meet deadlinesProvide regular project updates to leadership and stakeholdersMinimum Requirements 5 years accounting, finance, finance analytics or similar experience Critical Skills2 years of financial or accounting experienceEntry-level experience in project managementExcellent communication (verbal and written) and relationship building skillsStrong organizational, multi-tasking, and prioritization (time management) skillsDemonstrates analytical ability and attention to detailsAdvanced problem solving and root cause analysis skillsAdvanced data analysis skillsAbility to work in a fast-paced team environment and meet deadlinesAbility to work under general direction on multiple tasks with competing timelinesProfessional conduct and demeanor, uses discretion and maintain high level of confidentialityIntermediate/Advanced knowledge in MS products (including Excel, Access, PowerPoint, etc)Core Competencies: Knowledge of the governance model, driving execution, problem solving and analysis, innovative mindset, communication, collaboration and relationship building, customer focused and client service. Additional Knowledge & SkillsProject management and process improvement experience is preferredExpertise in data analysis and building reports using Business ObjectsExpertise in MS SQL Server including ability to write SQL QueriesExposure in SalesForce.com, Vistex and SAP reportingPreferred experience in SAP, JD Edwards, People Soft, or other ERP systems.Education 4-year degree in finance or related field or equivalent experiencePhysical Requirements General Office Demands Benefits & Company Statement McKesson believes superior performance – individual and team – that helps us drive innovations and solutions to promote better health should be recognized and rewarded. We provide a competitive compensation program to attract, retain and motivate a high-performance workforce, and it’s flexible enough to meet the different needs of our diverse employee population.  We are in the business of better health and we touch the lives of patients in virtually every aspect of healthcare. We partner with payers, hospitals, physician offices, pharmacies, pharmaceutical companies and others across the spectrum of care to build healthier organizations that deliver better care to patients in every setting.  But we can’t do it without you. Every single McKesson employee contributes to our mission—whatever your title, whatever your role, you act as a catalyst in a chain of events that helps millions of people all over the globe. Talented, compassionate people are the future of our company—and of healthcare. At McKesson, you’ll collaborate on the products and solutions that help us carry out our mission to improve lives and advance healthcare. Working here is your opportunity to shape an industry that’s vital to us all.  McKesson is an equal opportunity and affirmative action employer – minorities/females/veterans/persons with disabilities.  Qualified applicants will not be disqualified from consideration for employment based upon criminal history. Agency Statement No agencies please."}