{"jobID": "2769151108", "jobLocation": "Roseville_CA", "jobTitle": "Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.launchcg.com", "Headquarters": "Bellevue, WA", "Size": "501 to 1000 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "58000", "jobDescription": "Data Analyst Be a part of our success story. Launch offers talented and motivated people the opportunity to do the best work of their lives in a dynamic and growing company. Through competitive salaries, outstanding benefits, internal advancement opportunities, and recognized community involvement, you'll have the chance to create a career you can be proud of. Your new trajectory starts here at Launch.  We’re seeking a creative Data Analyst to provide data and understanding that help uncover opportunities for innovation. This role will work under the supervision of a senior team member and own specific project-related tasks. The candidate must be experienced in data analysis with strong knowledge of Excel, SQL, and leading Data Visualization technologies. Responsibilities:Work under the direction of a more senior team member, owning specific project-related tasksDisplay an effective degree of creativity in solving data related problemsSupport team members in documentation and deliverablesCommunicate effectively with clients about project needs and issuesWork on projects independently or acts as a workstream leadServe as primary point of contact on behalf of the team for owned workstreamsManage scope and identify scope creepManage and resolve day-to-day project issues and challengesSupport team planning, retrospectives, and business reviews for owned workstreamsGather requirements for complex reporting problems, provide recommendations on solutionsLead and present solutions to clientsRequired Experience/Qualifications:2-5+ years of relevant work experienceStrong experience with Excel, data visualization technologies (Tableau, Qlik, Power BI, Birst, Sisense, etc.), and SQLKnowledge of MDX and DAXFamiliar with relational database conceptsAdvanced knowledge of database design principles and how to access dataAdvanced understanding of data validation principlesAbility to operate efficiently, effectively, and decisively with or without direct supervisionFinancial, high-tech, healthcare, or insurance industry experience desiredProactive, self-starter who works well under pressure and within tight deadlinesOpen to travelBusiness Athletes: Launch looks for the same attributes we admire in top athletes and applies them to the business world: MASTERYCOMMITMENTFOCUSDETERMINATIONINTEGRITYTEAMWORKPOSITIVITYGOAL-ORIENTEDHEALTHY COMPETITIONGOOD SPORTS We interview for these traits above and beyond the technical skill set required for a particular role. Surrounding ourselves with Business Athletes leads to a competitive, fun, winning environment.  Qualified applicants, please respond to inquire@launchcg.com with your full name, resume, and a brief description of how your skills match the requirements above.  Please refer to Job #1876 when responding to this posting.  *Launch Consulting is a veteran-owned company and equal opportunity employer. Veterans encouraged to apply."}