{"jobID": "2836117698", "jobLocation": "San_Mateo_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " As a Senior Research Engineer you will collaborate with other members on Data Science team in developing and improving our machine learning classifiers and infrastructure working towards our goal of building a system that models the true state of a patient from their medical records. You will work on state of the art infrastructure built for the healthcare space and have access to real medical records to build capabilities that have real impact in the healthcare ecosystem. You will be a significant hands on contributor on a team that is solving hard but interesting problems with tremendous real-world impact. Responsibilities:Design, coding, testing and monitoring of new classifiers in production environments that drive our Analytical and SaaS product platformsMaintain our data assetsPerform large-scale data analysisWork closely with other groups like product, engineering and customer operations to acquire requirements and develop new systems that solve their problemsSkills & Requirements:Must HavesStrong working knowledge of a variety of machine learning and analytical techniques and understanding of how and where they are applicable.Software engineering programing skills with coding experience using Java/Scala and Python, in addition to machine learning and data mining libraries.Experience working with high performance computing in distributed and parallel systems, e.g. Hadoop, Tez & SparkStrong mathematical and statistical background, with thorough understanding of probability.Experience in data science and machine learning with a degree in Computer Science, Mathematics or another empirical science.Commercial experience building and deploying scalable software solutions that employ machine learning algorithms in production environments.Self-starter, comfortable juggling multiple projects, strong communication skills.Nice to HavesHave developed production data science solutions in healthcare, ad tech or web search.Prior experience building recommendation systems and/or natural language processing solutions.Healthcare Domain expertise"}