{"jobID": "2555007811", "jobLocation": "Sunnyvale_CA", "jobTitle": "Scientist I, DMPK", "companyRating": null, "companyInfo": {"Website": "www.pharmacyclics.com", "Headquarters": "Sunnyvale, CA", "Size": "501 to 1000 employees", "Founded": " 1991", "Type": " Subsidiary or Business Segment", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Acerta Pharma, Kite Pharma, Genentech"}, "estimatedSalary": null, "jobDescription": "General Position Summary/Purpose: Provide in vitro ADME support to Pharmacyclics drug discovery and development projects. Work closely with bioanalytical and PK scientists, and report into drug metabolism function to integrate DM and PK data to support preclinical development of drug candidates and regulatory submissions. Collaborate with discovery teams to provide ADME data for lead optimization. Key Accountabilities/Core Job Responsibilities: · Extensive cell culture experience and capable of performing bi-directional permeability studies using Caco2, MDCK or similar cell lines.  · Working knowledge of drug transporter sciences, and capable of performing and interpreting in vitro drug transporter studies (substrate and inhibition studies) in recombinant cell lines,  vesicles or hepatocytes.  · Perform in vitro metabolism and drug transporter assays to mechanistically investigate specific ADME issues.  · Conduct in vitro studies (CYP induction, CYP inhibition, protein binding, CYP phenotyping, metabolite profiling) and data analysis to quantify test compounds and their metabolites in various  matrices, including intestinal cells, plasma, microsomes, cytosol and hepatocytes.  · Proficient in operating and trouble-shooting HPLC-tandem Mass spectrometer (LC-MS/MS).  · Capable of good record keeping of data and writing in vitro ADME reports.  · ​Effectively manage numerous tasks/projects simultaneously to meet internal/external deadlines while maintaining organizational integration within DMPK team Education, Qualifications, and Experience Requirements (degree, certifications, etc.):PhD degree/equivalent in drug metabolism or related discipline with at least 1-3 years (or MS degree with at least 5-7 years) relevant industrial experience in drug metabolism.LC/MS/MS assessment of metabolism using unlabeled and radiolabeled test compounds.Ability to fully operate, maintain and troubleshoot triple quadruple Mass spectrometers, HPLC/UPLC systems, auto sampler and data software systems. Capable of optimizing conditions for quantitation and chromatographic separation of analytes in biological samples.Ability to effectively communicate study designs and present data.Ability to effectively work in a team environment.Equal Opportunity Employer Minorities/Women/Veterans/Disabled"}