{"jobID": "2825812052", "jobLocation": "Silver_Spring_MD", "jobTitle": "Research Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "corporate.discovery.com", "Headquarters": "Silver Spring, MD", "Size": "5001 to 10000 employees", "Founded": " 1985", "Type": " Company - Public (DISCA) ", "Industry": " Media", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": "Discovery CommunicationsRequisition ID 19972 {}Career Category Education Sales Posted Date 2018-06-21 Location US-MD-Silver Spring  US-NC-Charlotte Type Company Employee Full-Time Position Summary:**If you accept a position with Discovery Education you will be an at- will employee under Discovery Education and eligible for Discovery Education benefits and compensation plans. This role is not a Discovery, Inc. position.***Our Team Discovery Education is the global leader in standards-based digital content for K-12 classrooms, transforming teaching and learning with award-winning digital textbooks, multimedia content, professional development, assessment tools, and the largest professional learning community of its kind. Discovery Education partners with districts, states and like-minded organizations to captivate students, empower teachers, and transform classrooms with customized solutions that accelerate academic achievement. Discovery Education's services are available not only in half of all U.S. schools, but in half of all English primary schools, numerous institutes of higher learning, and in 50 countries around the world. The Role The Research Data Analyst is responsible for the analysis of product and service usage for the Research & Data Analysis Team. The individual will be responsible for various activities related to raw data files, databases and data warehouses, which may include: reporting and extracting data for various reports and analyses, cleaning unstructured and structured data files, and auditing data for accuracies. Responsibilities:Manage projects and collaborate with cross-functional departments to develop and implement improved reporting and data workflows and processes to support business goals.Provide reports and KPIs to senior executives, as requestedManage scheduled and ad hoc reporting needs of the organizationAnalyze data for errors and inconsistenciesExtract and transform data sets and provide insights for customer reportingJoin datasets from different sources (Salesforce, MSSQL Server) and with different formats (.xlsx, .csv, .json, .sav)Mine and manage large data sets and analyzing data for actionable insightsParticipate in analysis of structured and unstructured dataAnalyze pre/post survey results and any other longitudinal analysis as needed. Work may include: merging data with any service usage, running descriptive statistics, and running significance testsCreate internal and external presentationsRequirements:Bachelors or Masters in computer science, mathematics, statistics, information systems, research or a related quantitative fieldA minimum of 3-5 years' experience managing large data sets and analyzing data for actionable insights.Experience taking transactional business data, analyzing that data to answer a core research question and using analytics tools and systems to present the findings and insightsExperience querying/joining databases and using statistical computer languages: R, Python, SQL, SPSS.Experience with data mining and data cleaning, including JSON data formatsExperience with data visualization and reporting techniquesDemonstrated ability to learn new systems quickly and master data integrity among multiple systemsMust have strong Excel, PowerPoint, MS Word knowledgeMust have strong listening, analysis and problem solving skillsMust have strong interpersonal skills - collaboration across multiple business and technology functions, relationship building and consensus building are a mustMust be able to work on and prioritize multiple tasks while working well under pressure.Must be a self-starter and work productively with minimal directionMust learn quickly and produce under pressure and tight deadlinesMust have the legal right to work in the United States Silver Spring, Maryland, MD, Charlotte, North Carolina, NCDiscovery Communications, Inc. is an equal opportunity employer. Discovery is committed to being an employer of choice, not just a good place to work, but a great and inclusive place to work. To that end, we strive to recruit and maintain a workforce that meaningfully represents the diverse and culturally rich communities that we serve. Qualified applicants will receive consideration for employment without regard to their race, color, religion, national origin, sex, sexual orientation, gender identity, protected veteran status or disabled status or, genetic information.  EEO is the Law  Pay Transparency Policy Statement  If you are an individual with a disability and need an accommodation during the application process, please send an email request to HR@discovery.com. Bachelors or Masters in computer science, mathematics, statistics, information systems, research or a related quantitative fieldA minimum of 3-5 years' experience managing large data sets and analyzing data for actionable insights.Experience taking transactional business data, analyzing that data to answer a core research question and using analytics tools and systems to present the findings and insightsExperience querying/joining databases and using statistical computer languages: R, Python, SQL, SPSS.Experience with data mining and data cleaning, including JSON data formatsExperience with data visualization and reporting techniquesDemonstrated ability to learn new systems quickly and master data integrity among multiple systemsMust have strong Excel, PowerPoint, MS Word knowledgeMust have strong listening, analysis and problem solving skillsMust have strong interpersonal skills - collaboration across multiple business and technology functions, relationship building and consensus building are a mustMust be able to work on and prioritize multiple tasks while working well under pressure.Must be a self-starter and work productively with minimal directionMust learn quickly and produce under pressure and tight deadlinesMust have the legal right to work in the United States Silver Spring, Maryland, MD, Charlotte, North Carolina, NC "}