{"jobID": "2783986474", "jobLocation": "San_Diego_CA", "jobTitle": "Research Scientist / Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.leidos.com", "Headquarters": "Reston, VA", "Size": "10000+ employees", "Founded": " 1969", "Type": " Company - Public (LDOS) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "88000", "jobDescription": "Description:Leidos's Military & Veterans Health Solutions Group is currently seeking a full-time Research Scientist/ Data Analyst to support the Health and Behavioral Sciences Program at the Naval Health Research Center in San Diego, CA.  This position will support the data science team in developing a research infrastructure that will facilitate and support military research efforts focused on behavioral health and epidemiology research topics. The Research Scientist/ Data Analyst will work on a variety of research projects that use large, complex datasets created by merging military personnel and medical records from multiple sources. The successful candidate will work closely and collaboratively with Principal Investigators, analysts and subject matter experts to identify ways to answer complex mental and physical health questions with population-level military medical and personnel electronic records. The ideal candidate will be well-organized, able to take initiative, and work well both independently and in a team environment. Position ResponsibilitiesWork with research team to refine research methodology and construct database to appropriately answer study questionsAccess various secondary data sources to extract relevant data and construct comprehensive, project-specific datasetsLead data management processes, including data verification, cleaning, quality assurance, and mergingPerform data manipulations and transformation on raw data using SAS to create analytics friendly datasets for research projectsMaintain and update documentation on all processes and procedures, including data dictionaries and codebooksConduct statistical analyses, including logistic regression, analysis of variance, survival analyses and other techniques as requiredContribute to the preparation of study deliverables, including presentations, reports, and publicationsQualifications:Required QualificationsMasters degree in statistics or relevant social science field (e.g., epidemiology, public health, psychology)Advanced proficiency in BASE SASProven ability to build statistical models, test hypotheses, visualize, summarize, interpret, and report resultsExperience in constructing and analyzing complex databasesPreferred QualificationsDemonstrated SAS expertise with 3 years of experienceMinimum 1 year experience working with large, complex databasesExperience conducting research using medical records or medical reimbursement dataExpertise with data manipulation, analytic tools, and data visualization Due to federal contract restrictions, candidate must be a U.S. citizen and able to obtain a Secret Security Clearance.  NHWLeidos Overview: Leidos is a global science and technology solutions leader working to solve the worlds toughest challenges in the defense, intelligence, homeland security, civil, and health markets. The companys 33,000 employees support vital missions for government and commercial customers. Headquartered in Reston, Virginia, Leidos reported pro forma annual revenues of approximately $10 billion for the fiscal year ended January 1, 2016 after giving effect to the recently completed combination of Leidos with Lockheed Martin's Information Systems & Global Solutions business (IS&GS;). For more information, visit www.Leidos.com. The companys diverse employees support vital missions for government and commercial customers. Qualified women, minorities, individuals with disabilities and protected veterans are encouraged to apply. Leidos will consider qualified applicants with criminal histories for employment in accordance with relevant Laws. Leidos is an Equal Opportunity Employer."}