{"jobID": "2814186636", "jobLocation": "Irving_TX", "jobTitle": "Data Scientist IV", "companyRating": "3.7", "companyInfo": {"Website": "www.aviall.com", "Headquarters": "Dallas, TX", "Size": "1001 to 5000 employees", "Founded": " 1932", "Type": " Subsidiary or Business Segment", "Industry": " Aerospace & Defense", "Revenue": " Unknown / Non-Applicable", "Competitors": " Aerospace Products International, Aircraft Spruce & Specialty, Satair"}, "estimatedSalary": "97000", "jobDescription": "Aviall, a Boeing Company is the world's largest provider of new aviation parts and related aftermarket services. Aviall markets and distributes products for more than 240 manufacturers and offers approximately 2,000,000 catalog items from 40 customer service centers located in North America, Europe, and Asia-Pacific. Aviall prides itself in having an open performance based culture throughout the organization. We offer an environment that is diverse, challenging and supportive, and provides hands-on experience and real-world responsibilities that serves as the springboard for a successful career. We are also very proud to consistently receive outstanding awards for our diversity and recruitment efforts including the Top 100 Military-Friendly Employers. Come join our talented world class team and thrive in a dynamic and supportive culture.  A Data Scientist IV at Aviall plays an important role in business processes and decision making by providing expertise in data analysis, complex statistical methods, and strategic problem solving. If you have a strong ambition to influence business decisions by interpreting and reporting valuable data, please keep reading!  Major Responsibilities: Solves complex business & strategic problems using advanced analytical and statistical techniques.Applies advanced statistical and predictive modeling techniques to build, maintain, and improve on multiple real-time decision systems.Analyzes and interprets data from various sources.Conducts advanced data analysis and highly complex designs algorithm.Responsible for leading the strategic design and maintenance of business intelligence / big data /data science applications. Compiles reports, charts, and tables based on established statistical methods.Identifies, researches, and resolves technical problems. Ensures that the use of business intelligence / big data / data science applications enhances business decision making capabilities.Designs experiments, test hypotheses, and build models.Develops and designs advanced predictive analysis models.Models and frames business scenarios that are meaningful and which impact on critical business processes and/or decisions.Develops and presents clear concise recommendations outlining alternatives and key decision criteria.Identifies and recommends new data sources that will maximize analytic output and create customized reports.Ensures proper change management processes are followed by documenting and validating data flows.Collaborates across the organization to develop solutions that drive business outcomes. Job RequirementsMinimum Requirements: Bachelor's Degree in Math, Statistics, Engineering, Economics or related discipline. Master's degree highly desired. 6 to 8 years related experience. Preferred experience in hands on programming using statistical models and visual analytics.May consider equivalent combination of experience and education in lieu of degree.     Qualifications: Functional Knowledge: Possesses and applies broad knowledge of principles, practices, and procedures of a particular field or specialization to the completion of difficult assignments. Can be recognized as an expert within a team or department within an organization. Fully understands industry and career; can perform any part of the job.Business Expertise: Professional with a high degree of knowledge in the overall field and recognized expertise in specific area(s). Applies a broad knowledge of principles, practices, and procedures of a particular field of specialization. Work is varied and involves many different and unrelated processes and methods to a broad range of activities. Includes responsibility for interpreting data, planning work and/or refining methods and techniques to be used. Provides in-depth analysis.Problem Solving: Exercises judgment in selecting methods, techniques and evaluation criteria for obtaining results. Internal and external contacts often pertain to company plans and objectives. Develops innovative solutions to situations where guidelines cannot be applied.Leadership: Works under minimal supervision, conferring with superior(s) on unusual matters. Assignments are broad in nature, usually requiring originality and ingenuity. May lead project teams and/or plan, conduct and oversee assignments of lower level employees.Impact and Influence: Impacts the quality and timeliness of the work for a department or client. Errors result in delays to assigned projects resulting in expenditure of additional time. High degree of knowledge in the overall field and recognized expertise in specific area(s); creates communications. Education Bachelor's Degree"}