{"jobID": "2744472323", "jobLocation": "Austin_TX", "jobTitle": "IT Business Analyst - Master Data Management", "companyRating": "3.4", "companyInfo": {"Website": "www.hpe.com", "Headquarters": "Palo Alto, CA", "Size": "10000+ employees", "Founded": " 2015", "Type": " Company - Public (HPE) ", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Oracle, Accenture"}, "estimatedSalary": "73000", "jobDescription": " Hewlett Packard Enterprise is an innovative, dynamic company with a rich past and a promising future. Originally Hewlett-Packard Company, HPE has continuously reinvented itself. Today, HPE is one of the world's leading technology companies and provides wired and wireless networking, servers, storage, IT and Cloud services for the next generation of IT infrastructure.  Master data management (MDM) is essential to the effective running of our business across Finance, Sales, Services, Supply Chain, Marketing and other functions. Master data is a single source of business data used across multiple systems, applications, and processes. When master data is accurate, on time and complete it saves time and money and allows in better-informed business decisions. High-quality master data is an asset to our business.  As part of the MDM team, this role is responsible for ensuring the highest level of data integrity, governance, and service to internal customers. This role will cover all domains of master data within the enterprise with special emphasis to Customer, Partner and Vendor Data. The role will support developing and improving master data management to increase operational efficiency, strengthen data governance, and increase data value through deployment of user-friendly processes, system tools, and data architecture simplification.  Job Description Summary: Processes master data requests in line with service level agreements and respond to queries in a timely fashion.Drives internal control, regulatory, and process compliance through active understanding, engagement, and vigilance.Provides problem-solving support, advice and guidance to internal customers which is professional, responsive, and assumes responsibility for conclusion.Completes daily, weekly and monthly processes and tasks to the required standard.Maintains a full audit trail of data changes.Provides timely and complete resolution of ad-hoc internal and external data queriesDetermines priority of work and addresses issues in a timely manner based on understanding of critical factors.Performs timely accurate peer review of completed requests which enhance data quality, integrity, and team learning.Manages own time by estimating time to complete, setting deadlines, and communicating in advance when not expected meeting deadlines.Understands the impact of master data within the organization and systems for applicable data domains.Identifies patterns within the data to leverage information to create valueSupports documentation of data dictionary, process, and business rules; providing document updates in timely manager.Proposes process efficiency improvements in execution of work, automation opportunity, rationalization of processes, and training/education.Executes knowledge transfer to new or less experienced team members. Technical: Familiarity of end to end business processes across Lead to Order/Quote to Cash.Experience in managing master data application with an understanding of its integrations with SAP, SFDC, CPQ and D&B.;Ability to build, comprehend and improve MDM data models.Understanding of concepts around entities, hierarchies, cleansing, standardization and de-duping across company and contact records.Hands on experience in MDM Applications like Informatica, Talend, etc.Demonstrated mid-level or above proficiency with MS Office Excel, analyzing and manipulating large datasets through formulas and macros.Strong analytical abilities with experience extracting data and developing reports.Understanding of SDLC and project management methodology. General: Ability to communicate clear and concise message to varied audience.Exhibits a high degree of professionalism.Proactive approach to problem solving; out of the box thinking and ability to simplify solutions.Able to work collaboratively and communicate effectively with key stakeholders both within and outside of the MDM team.Displays a passion for working in master data management.Self-motivated, flexible, with the ability to deal with high levels of complexity, change and evolving processes, often at short notice. Education and Experience: 3+ years of business/technical/analytical experienceBachelor's Degree in relevant field of study or within one year of completing Bachelor's Degree and with 3+ years of relevant work experience.Exposure to the business functions of a high tech enterprise from an operations, finance, supply chain, sales, channels, marketing or business analysis perspective. #LI-MF1Hewlett Packard Enterprise is EEO F/M/Protected Veteran/ Individual with Disabilities. HPE will comply with all applicable laws related to the use of arrest and conviction records, including the San Francisco Fair Chance Ordinance and similar laws and will consider for employment qualified applicants with criminal histories."}