{"jobID": "2822108823", "jobLocation": "Arlington_VA", "jobTitle": "Unit Manager - RN", "companyRating": "2.9", "companyInfo": {"Website": "www.hcr-manorcare.com", "Headquarters": "Toledo, OH", "Size": "5001 to 10000 employees", "Founded": " 1991", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Kindred Healthcare, Genesis HealthCare, Sava Senior Care"}, "estimatedSalary": "86000", "jobDescription": " HCR ManorCare provides a range of services, including skilled nursing care, assisted living, post-acute medical and rehabilitation care, hospice care, home health care and rehabilitation therapy.  Leadership is an intangible quality, not easily defined. And yet your patients and staff recognize it in your patience, confidence, skill and compassion. Your positive impact, excellent clinical skills, experience, and natural talents have prepared you to step into a nurse leadership role at HCR ManorCare.  As an Unit Manager - RN, you will oversee the care management of a population of patients within an assigned area, unit or clinical function. The position conducts the nursing process, assessment, planning, implementation, and evaluation under the scope of the State's Nurse Practice Act of Registered Nurse licensure. The Unit Manager - RN coordinates resource utilization, timely and appropriate care interventions, and interdisciplinary communication to enhance patient and family satisfaction, adherence to center's clinical systems and regulatory compliance.  There's no better definition of career fulfillment than the experience of watching your patients get back to their daily routine. At HCR ManorCare, we want to make this a recurring part of your working life as an Unit Manager.  In return for your expertise, you'll enjoy excellent training, industry-leading benefits and unlimited opportunities to learn and grow. Be a part of the team leading the nation in healthcare.527 - ManorCare Health Services - Arlington, VirginiaTwo years experience as a RN with 1-year nursing supervisory experience."}