{"jobID": "2806912830", "jobLocation": "McLean_VA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.radiantsolutions.com", "Headquarters": "Herndon, VA", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Aerospace & Defense", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " ResponsibilitiesRadiant Solutions has an immediate opening in our McLean, VA location for a Data Scientist!  We are looking for a Data Scientist to dive in and examine a really interesting dataset and find stories hidden within the data. Candidate should have experience in big data structuring to complile a large disparate data source into a modern solution (Hadoop/PostGres/ElasticSearch) and run statistical analysis on the data using tools such as R, SAS, or SPSS. This is project with great mission impact and an innovative customer team that provides an enriching environment for knowledge growth and learning in the field of data science.Qualifications Bachelor’s degree in related field plus minimum of 3 years of experienceExperience working with big dataExperience with the R programming languageExperience with Hadoop, PostGres, and/or ElasticSearchExperience performing statistical analysisTo be qualified, candidate MUST be a US Citizen and have an ACTIVE TS/SCI Clearance with Polygraph. #cjpostOverviewJoin our company whose purpose is to help national security and commercial organizations understand and navigate our changing planet. Radiant Solutions provides multi-source data collection, enrichment, and analytic capabilities that reveal unique geospatial information and insights where and when it matters most.  We are a new organization but no company has such strong roots in geospatial with our level of scale and a strong commercial mindset. Our heritage companies, MDA Information Systems, RadiantBlue, DigitalGlobe Intelligence Solutions, and HumanGeo are well known for delivering innovative capabilities across the entire geospatial intelligence value chain. Our combined team of over 1,000 aerospace engineers, geospatial analysts, weather and ocean experts, software developers, data scientists, and DevOps engineers apply disruptive technology and our unique intellectual property to both national security and commercial problems.  We offer an excellent comprehensive benefits package including medical, dental, life, and short/long-term disability insurance, vacation and sick leave, 401(k) retirement plan, flexible spending account, and tuition assistance. Radiant Solutions values diversity in the work place and is an Equal Opportunity Employer."}