{"jobID": "2767444534", "jobLocation": "Washington_DC", "jobTitle": "Junior Options Trader", "companyRating": null, "companyInfo": {"Website": "www.mavericktrading.com", "Headquarters": "Salt Lake City, UT", "Size": "201 to 500 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " T3 Trading Group, TopstepTrader, Bright Trading"}, "estimatedSalary": null, "jobDescription": "Related Keywords: risk, manager, analyst, banking, financial, investment, technical, project, team, leader, university, college, school, entry-level, part-time, series 7 license, series 65, math, statisticsMaverick Trading is seeking motivated and teachable candidates to trade the Equity Options-market on behalf of the firm, using the firm's capital. Becoming a professional trader is a dream job, because of its flexibility and the unlimited earning potential. Trade from anywhere in the world via the Internet.------- ABOUT MAVERICK TRADING------- Maverick backs their traders with technology, training, risk management and capital. As a proprietary trading firm, we provide our traders with capital, giving them tremendous leverage and earning potential in the markets. Our traders keep the lion's share (70%-80%) of profits. Each of our traders starts with a minimum of a $25K account. As our traders grow and illustrate a track record of consistency and profitability, they are trading with enough of our capital to potentially earn well over $100K per year. Additionally, we offer Performance Bonuses for traders that are consistently profitable. Because the firm benefits from profitable traders, Maverick knows that consistently profitable traders will be valuable assets for years to come, and they want to compensate the outperformers.------- REQUIREMENTS -------Ideally, applicants should have strong math/finance/business backgrounds (or comparable skills) and some trading experience. However, being a hard worker who is enthusiastic and willing to learn is more important than your background. Passion for the markets is always key to success in this industry.------- HOW TO APPLY -------Our application process has multiple steps, designed to communicate all the necessary information about the firm, our methodology, the way we pay our traders, and to help applicants make this very important career choice. To get started, click on the application url at the top of this page, which will take you to a short video detailing the recruitment process and the Capital Sharing Program.Be sure to complete the entire application process, an you will be contacted by one of our capable recruiters for a suitability interview and to answer any additional questions you may have.Will you be our next great trader? We hope so. We look forward to speaking with you!-The Maverick Trading Team"}