{"jobID": "2739011682", "jobLocation": "Redondo_Beach_CA", "jobTitle": "Data Management Analyst 3", "companyRating": "3.7", "companyInfo": {"Website": "www.northropgrumman.com", "Headquarters": "Falls Church, VA", "Size": "10000+ employees", "Founded": " 1939", "Type": " Company - Public (NOC) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": "At Northrop Grumman, our employees have incredible opportunities to work  on revolutionary systems in air and space that impact people’s lives around the  world today, and for generations to come. Our work preserves freedom and  democracy, and advances human discovery and our understanding of the universe.  We look for people who have bold new ideas, courage and a pioneering spirit to  join forces to invent the future, and have a lot of fun along the way. Our  culture thrives on intellectual curiosity, cognitive diversity and bringing  your whole self to work — and we have an insatiable drive to do what others  think is impossible. Our employees are not only part of history, they’re making  history.  Northrop Grumman Aerospace Systems has an opening for a Data Management  Analyst 3 to join our team of qualified, diverse individuals. This position  will be located in Redondo Beach, CA. Essential Functions:Works with integrated product teams, business analysts  and software developers on project teams as they document their data  requirements and establish thorough specifications. Conducts facilitation sessions to gather  requirements.Builds logical models. Works with database  administrators, developers, and IT counterparts to build the physical model and  overall data architecture.Utilizes SharePoint 2013 to build OOTB sites and  workflows. Supports existing SharePoint  2010 and 2013 applications.Reviews and reports on project metrics to benchmark  effectiveness.Works closely with all stakeholders to ensure that business  models are accurately implemented in application systems. Provides education on  the naming and modeling standards; assists with modeling specific constructs.  Reviews project models to ensure adherence to standards. Ensures data quality  alignment.Works on and across multiple projects to ensure  consistency in naming conventions and promotes the sharing and reuse of data  across applications and business areas. Ensures that data analysis goals are  met.Contributes to data management internal projects as well  as the upgrading of standards and best practice guidelinesRevises existing systems and procedures to correct deficiencies and  maintain more effective data handling, conversion, input/output requirements,  and storage.Manages all aspects of ongoing projects and serves as liaison between  various stakeholders.Reviews status of projects and budgets; manages schedules and prepares  status reports. We offer flexible work arrangements, great learning opportunities,  exposure to a wide variety of projects and customers, and a very friendly team  environment. We are looking for self-motivated, proactive, and goal-oriented  people to help us grow our services and become even better at what we do.Basic Qualifications:Bachelors' Degree from an accredited  institution and 5 years of experience in an aerospace  environment ORMasters' Degree from an accredited  institution and 3 years of experience in an aerospace  environmentAbility to receive requirements at a high  level and derive lower level requirements by working directly with  internal customers turning complex processes into user-friendly toolTechnical working experience with SharePoint and managing site collectionsPreferred Qualifications:Ideal applicant will be enthusiastic about  process improvement, efficiency, excellent customer service, and working  with different teams from all functions.Candidate should be able to juggle multiple  assignments and manage changing priorities. Proven ability to work independently with  little oversight is key.Strong project management and communications  skills are highly desired. Northrop Grumman is committed to hiring and retaining a diverse  workforce. We are proud to be an Equal Opportunity/Affirmative Action  Employer, making decisions without regard to race, color, religion,  creed, sex, sexual orientation, gender identity, marital status,  national origin, age, veteran status, disability, or any other protected  class. For our complete EEO/AA and Pay Transparency statement, please  visit www.northropgrumman.com/EEO. U.S. Citizenship is required for most positions."}