{"jobID": "2829782032", "jobLocation": "San_Diego_CA", "jobTitle": "Senior Integration Scientist", "companyRating": null, "companyInfo": {"Website": "www.illumina.com", "Headquarters": "San Diego, CA", "Size": "5001 to 10000 employees", "Founded": " 1998", "Type": " Company - Public (ILMN) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Thermo Fisher Scientific, Roche"}, "estimatedSalary": null, "jobDescription": " As a Senior Integration Scientist at Illumina you will work in a dynamic, team-oriented environment and help create genomic analysis  tools used in the leading edge of research. You will participate in the development of high quality, robust products through the integration of  hardware, software, and chemistry components. You will execute test plans in order to optimize product performance.  Job Duties include but are not limited to: Demonstrates technical leadership at the project level and leads a technical area under guidance to accomplish significant technical advances related to project goals.Hands-on testing and integration of systems - hardware, software, chemistry, and application componentsCreate and execute design verification test plansLeads studies that are efficiently designed and scientifically sound to advance integration activities while simultaneously applying valid analyses to guide additional testing.Collect data and prepare reportsWork effectively within a cross-functional project teamEducation and Experience:BSc/MS: 12+ years of experience or PhD: 4+ years of experience in relevant field (Bioengineering, Chemical Engineering, Biochemistry, Analytical Chemistry, Biology, etc.)Understanding of sequencing systems and techniques helpfulBasic wet laboratory experienceProgramming experience is strongly desired (Python, Perl, LabView, etc)Demonstrated ability to communicate effectivelyStrong system troubleshooting skillsExpert user of advanced analysis tools.Must be detail oriented and highly motivated.A desire to be a part of a fast paced, multidisciplinary and dynamic environment.Solid communication and writing skills required Illumina believes that everyone has the ability to make an impact, and we are proud to be an equal opportunity employer committed to providing employment opportunity regardless of sex, race, creed, color, gender, religion, marital status, domestic partner status, age, national origin or ancestry, physical or mental disability, medical condition, sexual orientation, pregnancy, military or veteran status, citizenship status, and genetic information. If you have a disability or special need that requires accommodation, please contact us at applications@illumina.com. To learn more, visit: https://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdfSDL2017"}