{"jobID": "2766965800", "jobLocation": "Alexandria_VA", "jobTitle": "Microsoft Desktop Service System Administrator", "companyRating": "4.9", "companyInfo": {"Website": "www.atlas-tech.com", "Headquarters": "North Charleston, SC", "Size": "51 to 200 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": "Desktop Services System Administrator Atlas Technologies, Inc is leading the way in the USCGs newest networking technologies and systems. Our immediate opening for a Desktop Services System Administrator to support our USCG customer. We are looking for passionate and flexible IT professionals who work in a team environment and is responsible for building and deploying Windows 10 images to an enterprise environment. If you have a strong management and technical background, come join our team. Essential duties include but are not limited to:Assist with the generation of documentation such as security documentation, deployment instructions, etc.Assist with providing a full range of engineering services related to the desktop image to support deployment of the Windows 10 image across the several environments utilizing supported deployment methods.Assist with engineering and technical support for an Enterprise Baseline Development capability to include content such as architecting, designing, engineering, testing, and documenting, a secure standard image built from the DISA Windows 10 SHB that can be easily maintained and updated over time.Assist with the direct hardware and software testing of the DISA Windows 10 SHB AUGMENTED Images within a segregated test environment.Support deploying images via: VDI, OSD, WDS, DVD and USB.Work within a team environment supporting tier II and III level troubleshooting as well as being able to provide training in regards to changes to the deployed image. Position Requirements:Must be a US CitizenMust possess or be able to obtain and maintain a Department of Defense (DoD) Secret Level Security ClearanceStrong customer relations, documentation and oral communication skillsSelf-Motivated, strong work ethic and commitment to qualityA passion for learning about, and working in the IT industryEducation/Experience:Bachelors degree in related field or 2 5 years equivalent work experienceMust be proficient with Microsoft Excel, Word and Office; Experience with Flexera preferredCertifications:MSCA Windows 10Security +Atlas Technologies, Inc. is an innovative provider of leading edge Information Technology (IT) solutions to Government and industry partners. Our primary focus and experience covers network integration, cybersecurity, software development, engineering, and management. Atlas takes pride in our highly experienced and driven employees who share our Core Values and our Vision of merging technology with integrity to create a positive impact for our clients, community and country. Atlas offers a highly competitive salary and benefits package including: Medical/Dental/Vision, Life & Disability Insurance, Vacation/Sick/Holidays, 401k, Education Assistance, Charitable Matching, Pet Insurance, Flex Time, Employee Recognition and Ancillary Benefits. Atlas is an Equal Opportunity/Affirmative Action Employer committed to hiring and retaining a diverse workforce. All qualified applicants will receive consideration for employment without regard to their race, color, religion, sex, sexual orientation, gender identity, or national origin, disability or protected veteran status. Visit our careers site to apply and join our growing team of professionals. Visit us on Facebook and Glassdoor to learn more about Atlas.  EEO is the Law Poster Pay Transparency Disability Rights"}