{"jobID": "1950320820", "jobLocation": "Folsom_CA", "jobTitle": "Reports and Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.mmcstrategicstaffing.com", "Headquarters": "Irving, TX", "Size": "501 to 1000 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Position Overview:The position will be responsible for translating business needs into reporting requirements, and interfacing with project staff to ensure successful delivery of operational and client reporting. The position will directly support the implementation and improvement of BPM best practices for call center and operational functions in actual projects. He/she will provide analysis and interpretation of business data, ultimately resulting in independently developed assessments and recommendations. This position will implement best practices and tools for data analysis through collaboration with the Standardized Operations and Analytics organization. The analyst will ensure a positive end-consumer experience for all delivered reports and operate in a collaborative environment interacting with process owners as well as application/BI developers and IT staff.  Job Responsibilities: Develop expert knowledge of daily operations and collaborate with project staff to evaluate current reports and design and build new reports. Maintain reports documentation for assigned systems and/or projects. Develop and document test plans, new procedures, training, and communications for end-users. Develop and provide training to end-users on BI applications software. Provide guidance, background information, and assistance to management and other staff on the analysis and interpretation of process performance data represented in reports and other contact center data. Support data analytics through the monitoring and analyses of forecasts for call center and operational functions. Facilitate discussion among process stakeholders (both technical and non-technical) in order to elicit, analyze, communicate (both written and verbally) and validate report requirements. Interprets requirements and translates them into data requirements. Demonstrates an understanding of data modeling (relationships, data types, tables, etc.) and analytics concepts (queries, reporting, and association of data sources). Mentor, train, and provide guidance, background information, and assistance to managers, analysts and other staff on standards and best practices in the effective use of reports and operational data. Provide assistance and information to users, IT staff, and general management on issues such as planning, scheduling, and using reporting system production capabilities. Write summaries and presentations often requiring clear and persuasive explanation of reports and data to a non-technical audience. Perform other duties as assigned. Education and Experience:"}