{"jobID": "2507468358", "jobLocation": "Springfield_VA", "jobTitle": "Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.mantech.com", "Headquarters": "Herndon, VA", "Size": "5001 to 10000 employees", "Founded": " 1968", "Type": " Company - Public (MANT) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "81000", "jobDescription": "Req ID 92615BR Business Title Data Analyst Group MCIS Location USA VIRGINIA Springfield Clearance Level Needed Top Secret Category Information Technology Job Duties and Responsibilities  At ManTech International Corporation, you will help protect our national security while working on innovative projects that offer opportunities for advancement.  Become an integral part of a diverse ManTech team supporting U.S. Customs and Border Protection’s mission to prevent terrorists and terrorist weapons from entering the country while also facilitating lawful international travel and trade.  ManTech is seeking experienced and skilled professionals to provide Business Intelligence Support Services to assist CBP officers and border enforcement personnel in effectively and efficiently identifying cargo, individuals, and conveyances that may present additional risk to the United States; conduct terrorism analysis and global assessments that convey changes in terrorism threats and identify emerging threats; develop and evaluate CBP-wide intelligence-based targeting rules and intelligence driven special operations; and coordinate and enhance analysis and targeting efforts.  As Systems Analyst, the candidate for this position will provide systems analysis support as part of an integrated agile team that will be responsible using data analytics techniques to develop, maintain and enhance models, tools, and software for: Intelligence Analysis-Counter-terrorism-Network AnalysisPredictive ModelingEntity ResolutionThreat Research SupportVisualizationQuery Support Analyzes and develops computer systems possessing a wide range of capabilities, including numerous engineering, business and records management functions. Develops plans for automated information systems from project inception to conclusion. Analyzes user interfaces, maintain hardware and software performance tuning, analyze workload and computer usage, maintain interfaces with outside systems, analyze downtimes, analyze proposed system modifications, upgrades and new COTS. Analyzes the problem and the information to be processed. Defines the problem, and develops system requirements and program specifications, from which programmers prepare detailed flow charts, programs, and tests. Provides technical and administrative direction for personnel performing software development tasks, including the review of work products for correctness, adherence to the design concept and to user standards, and for progress in accordance with schedules. Coordinates with the Project and/or Program Manager to ensure problem solution and user satisfaction. Makes recommendations, if needed, for approval of major systems installations. Prepares milestone status reports and deliveries/presentations on the system concept to colleagues, subordinates, and end user representatives. Provides daily supervision and direction to support staff.  The candidate will perform the following responsibilities: Formulate or define system scope and objectives.Devise or modify procedures to solve complex problems considering computer equipment capacity and limitations, operating time, and form of desired results.Prepare detailed specifications for programs.Assist in the design, development, testing, implementation, and documentation of new software and enhancements of existing applications.Work with project managers, developers, and end users to ensure application designs meet business requirements.Formulate specifications for complex software programming applicationsModify and maintain complex applicationsEvaluate new and existing software products from cost-effectiveness and feasibility analysis perspectiveCoordinate with the intelligence community, gather requirements, analyze the data and business logic, and work with large data sets. Prepare documentation validating reasoning, certainty, and completeness synthesized information.Qualifications:HS & 15 years of experience OR Masters & 0 years of experienceExperience using Agile techniques to design, develop, enhance, test, debug, and implement software and troubleshoot production problems.Experience with Java, pythonExperience with Apache HadoopExperience with build environments such as Apache Maven and GradleExperience with Integrated Development environments ( Eclipse IDE, Cygwin, RStudio)Experience with Web Environment developmentData profiling, data mining, cluster analysis, or statistical pattern analysisFalse positives identification for rule-based methods, pair-wise classification, clustering approaches, or probabilistic inference.Data visualizationGeocoding or geomapping.Entity relationship ontologiesExperience working in law enforcement or classified intelligence analysis environment. Clearance: An active U.S. Government DOD - Top Secret security clearance required; DHS - CBP preferred.  Location: This position will require the capability to work from either of the following addresses: 5971 Kingstowne Village Parkway, Alexandria VA 22315Ronald Reagan Building, 1300 Pennsylvania Ave NW, Washington, DC 20229Sterling, VA Qualifications Requires Bachelor’s degree (in Computer Science, Management Information Systems or related field) or equivalent, and seven to nine years of related experience. Degrees Equivalent Experience/Education"}