{"jobID": "2807778712", "jobLocation": "Austin_TX", "jobTitle": "Sr Big Data Engineer", "companyRating": "3.8", "companyInfo": {"Website": "www.homeaway.com", "Headquarters": "Austin, TX", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Airbnb, TripAdvisor, 9flats.com"}, "estimatedSalary": "145000", "jobDescription": " HomeAway, a world leader in the vacation rental industry, is the place to book beach houses, cabins, and condos with more than two million places to stay in 190 countries. The site makes it easy to find and book the perfect vacation rental for any getaway, often for less than the cost of traditional hotel accommodations. HomeAway is part of the Expedia Group family of brands. The Opportunity: We are looking for big data developers to join the Digital Platform Engineering team to support our brand marketing organization. In this role, you will help set up data pipelines that enable data scientists and analysts to make critical business decisions on television advertising expenditure. You will also help expand our lead generation processes and support other brand marketing data needs. Challenges to Work On:Leverage state of the art data processing tools for handling growth marketing data.Understand how the growth marketing data is used and work closely with data scientists and analysts to enable them to make the best use of the data.Update and expand our existing growth marketing data products to leverage cloud based technologies.Contribute to our growing ecosystem of state of the art tools.Job Qualifications:Bachelor's degree in computer science, computer engineering, or a related field and 6+ years of experience or Masters degree in computer science, computer engineering, or a related field and 3 years of experience5+ years professional application development utilizing Scala and Java languages5+ years in data warehouse solutions using SQL and RDBMS such as SQL Server, MySQL, or Oracle5+ years in high-level design including defining coding standards, tools, and platforms;2+ years in Batch and Stream processing using Spark and Kafka2+ years with ETL Pipeline development on AWS using EMR and S32+ years in OLAP cube development (SSAS)Job Responsibilities:Design, build, launch, and implement big data solutions. Specifically, build and launch new data models that provide intuitive analytics to business partners.Perform data modeling and prepare data in databases for reporting through various analytics tools.Build distributed batch and stream compute ETL data pipeline for the requirement using technologies such as Scala, Python, Spark, Hadoop, Hive, and Amazon Web Services.Work closely with product management to implement and expand data connections for growth marketing purposes.Develop quality scalable, tested, and reliable data services using industry best practicesPerform Peer review for the code developed by team members.Document and disseminate knowledge to team members and the wider organization.Create and maintain quality software using best-in-class tools: Git, Splunk, New Relic, Sonar and TeamCity.Benefits & Perks:Competitive health and insurance benefits.Competitive salary.Annual target bonus or commission.Paid vacation and sick time.Vacation rental on a yearly basis (taxable benefit).Employee Stock Purchase Program.Free snacks and beverages.Frequent company update talks with our leadership team.Free listing on HomeAway.com.Electronic, adjustable stand-up desk.Discounted Metro & Rail pass.Casual dress. We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}