{"jobID": "2829013027", "jobLocation": "Santa_Clara_CA", "jobTitle": "Software & Data QA Engineer", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "118000", "jobDescription": "Software & Data QA Engineer Job Number: 113305093Santa Clara Valley, California, United StatesPosted: Jun. 27, 2018Weekly Hours: 40.00 Job SummaryImagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring your passion and dedication to the team and there's no telling what you could accomplish.  Apple services are an essential part of the Apple experience that extends even beyond the owners of Apple devices. Our users rely on services such as iMessage, iTunes, the App Store, and iCloud to communicate, to access powerful applications and media content, and to build, store and protect their memories seamlessly across all their devices. We strive to improve user experience by avoiding unnecessary friction. You will perform continuous analysis and designs and provide internal tools to help ensure that our users remain in control of their accounts, even when their credentials leave their control. The group comprises teams of Software Developers, Data Engineers, Data Analysts and Data Scientists that focus on crafting and implementing fraud prevention mechanisms, systems and tools to guarantee that new devices, software and features in our services, provide the safest experience to our customers.Key Qualifications Familiarity with Hadoop, Cassandra, Kafka, Spark, Hive and other big data toolsProven experience with Jenkins or similar CI systemsExperience in crafting and developing testing infrastructure for Distributed Systems, Big Data PlatformsExceptional programming skills in Java, Scala, Python, or similar languageStrong software testing fundamentals and familiarity with Black Box, White Box and Performance testingExceptional analytical and problem solving skillsExperience using automated testing frameworks like Junit, TestNG, ScalaTest, Cucumber, JMeter, SoapUI, Gatling DescriptionAs part of this team, you will establish, implement and evolve the formal QA processes to ensure that the group is using industry accepted standard methodologies. Design and develop the testing infrastructure i.e. testing tools, test frameworks , test reporting mechanisms to test the software, services, Alternative data platforms of the team as well as the existing and new machine learning models build on the platform. Integrate the testing infrastructure with the continuous integration and continuous deployment systems to ensure all of the tools, services developed are properly tested and meet the quality goals. Write different types of tests i.e. Unit, Integration , Acceptance for existing and new projects so as to ensure bug free software is delivered which is as per the requirements. Stay knowledgeable of new testing tools and strategies and evaluate the technologies to incorporate into the projects.EducationBS in Math, Computer Science, or equivalent experienceAdditional RequirementsDeep understanding of Machine Learning concepts.  Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}