{"jobID": "2809315998", "jobLocation": "Torrance_CA", "jobTitle": "Clinical Data Analyst IHC", "companyRating": "3.4", "companyInfo": {"Website": "www.providenceiscalling.jobs", "Headquarters": "Renton, WA", "Size": "10000+ employees", "Founded": " 1855", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "92000", "jobDescription": "Description:Providence is calling a Clinical Data Analyst IHC to Providence Health & Services in Torrance, CA. We are seeking a Clinical Data Analyst IHC to support the CMO (Chief Medical Officer), Associate Vice President and Director of Quality and Measurement with developing measurement and analytics capacity focusing on the quality of whole person care at Providence St. Joseph Health (PSJH). This will primarily consist of report and dashboard design, data retrieval, report generation, data analysis and validation, database query validation, statistical analysis, dashboard updates, financial modeling, and maintenance of data and databases. Will also be responsible for supporting a number of projects with varying complexity and reporting requirements. In this position you will have the following responsibilities:Demonstrates service excellence and positive interpersonal relations in dealing with others.Designs and implements appropriate databases for user friendly data capture and reporting based on an understanding of assigned health services project analysis.Demonstrates skill in overseeing the collection or extraction of data or other activities that prepare information for data entry.Demonstrates skill developing qualitative and quantitative measurement, summarizing results of data file and the follow-up tasks on the data structure to solve related problems and inconsistencies such as missing data or illogical data.Executes logical data queries, extract data in support of analyses, and perform reporting tasks from clinical information systems.Designs and develops basic reports and queries independently.Demonstrated accuracy, appropriate content and approach of reports based on self-initiated consultation with customers/project leads.Qualifications:Required qualifications for this position include:Bachelors Degree - Bachelor of Science degree in Statistics, Mathematics, Economics, Engineering, Science.Experience in healthcareStrong relational database knowledge. Strong computer skills (i.e., word processing, spreadsheets, databases, statistical packages).Proficient with project design, project management, data entry, data quality control. Competent in research skills (i.e., problem solving, questioning, listening, innovating).Competent in written and oral communication and organization skills. Proficient with statistical analysis, interpretations and feedback to clinical managers.Expertise in Excel, Expertise in Tableau or other visualization tools preferred. Proficiency in PowerPoint.Excellent written and verbal communications skills. Strong team orientation. Ability to work independently and interdependently with minimal direction.Ability to write advanced queries using SQL. Ability work cross functional teamAdvanced Access database design and management. Demonstrated ability to graphically display and present analytic data.Ability to work to clinical and financial data warehouses and datamarts.Knowledge of medical terminology.Familiarity with clinical data.Preferred qualifications for this position include:Master's DegreeExperience with EpicAbout the department you will serve. Providence Strategic and Management Services provides a variety of functional and system support services for all eight regions of Providence Health & Services from Alaska to California. We are focused on supporting our Mission by delivering a robust foundation of services and sharing of specialized expertise. We offer a full comprehensive range of benefits - see our website for details http://www.providenceiscalling.jobs/rewards-benefits/ Our Mission As people of Providence, we reveal God's love for all, especially the poor and vulnerable, through our compassionate service. About Us Providence Health & Services is the third largest not-for-profit health system in the United States. Providence employs more than 82,000 caregivers (employees) across a five-state area; AK, WA, MT, OR, and CA. Our facilities include 34 hospitals, 600 physician clinics, senior services, supportive housing and other health and educational services. Providence is proud to be an Equal Opportunity Employer. Providence does not discriminate on the basis of race, color, gender, disability, veteran, military status, religion, age, creed, national origin, sexual identity or expression, sexual orientation, marital status, genetic information, or any other basis prohibited by local, state, or federal law. Schedule: Full-time Shift: Day Job Category: Professional & Administration Location: California-Torrance Req ID: 190062"}