{"jobID": "2835215608", "jobLocation": "Pasadena_CA", "jobTitle": "Deep Learning Scientist", "companyRating": null, "companyInfo": {"Website": "www.idealab.com", "Headquarters": "Pasadena, CA", "Size": "501 to 1000 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Position at ObenDeep Learning Scientist  Your responsibilities: As a member of the deep learning team, you will design and develop deep learning algorithms for image recognition/retrieval/detection/segmentation/classification  Ability to work fast with teams in an open-table company culture is important. You must have:PhD, M.Sc. in Computer Science, Electrical Engineering or PhysicsHigh proficiency in C++, PyThon and/or JavaExperience with data-driven statistical or machine learning methods.Enjoys a highly collaborative environment with minimal supervision.Great to have:Experience with software engineering best practices including unit testing, continuous integration, and source control.Proficiency in Torch, Theano, CaffeTop-tier publications (NIPS, PAMI, CVPR etc.) or proven successful industry experienceApplication RequirementsPlease send the following to careers@oben.me Detailed resume and/or LinkedIn profileLinks to any research / papers you have been an instrumental part of and are proud ofAny code you are proud of and is publicName of instructor / adviser, if any along with link to their profileCover Letter identifying your five favorite apps on your phoneInterview process: https://goo.gl/gxpxwTAbout Oben: Founded in 2014, ObEN is an artificial intelligence company based in one of the world’s most successful incubators: Idealab in Pasadena, CA. We have developed a sophisticated speech technology that allows any Internet of Things to speak in any voice and in any language. Know more about ObEN: https://goo.gl/gxpxwT  Know more about ObEN’s incentives.  Not ready to apply for this job? Sign-up to receive ObEN job alerts."}