{"jobID": "2803271626", "jobLocation": "Irving_TX", "jobTitle": "Senior Data Engineer", "companyRating": "3.4", "companyInfo": {"Website": "www.blucora.com", "Headquarters": "Irving, TX", "Size": "201 to 500 employees", "Founded": " 1996", "Type": " Company - Public (BCOR) ", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " H&R Block"}, "estimatedSalary": "106000", "jobDescription": "Picture yourself adding your creativity toward game-changing innovation. Our businesses operate at the intersection of tax preparation and financial planning, and our competitive advantage lies in their unique combination. With award-winning products and services through our TaxAct and HD Vest brands, Blucora is on the forefront of financial tech, turning taxes into opportunity for our consumers, small business customers and tax professionals. We have a culture of creating market disruption; a place where big ideas, and those who think them, can flourish. If you’re interested in being part of a team that dreams large, talks straight, and helps millions of customers every year build their financial future, then we should talk! Position Summary The Senior Data Engineer relishes working with large volumes of data, enjoys the challenge of highly complex technical contexts, and, above all else, is passionate about data and analytics. He/she is an expert with modern data architectures, data modeling, ETL design, business intelligence tools and passionately partners with the business to identify strategic opportunities where improvements in data infrastructure creates significant business impact. He/she needs to possess exceptional technical expertise in large scale data warehouse and BI systems. Essential Duties and Responsibilities Major responsibilities of the position are listed below. To perform the job successfully, the individual must be able to execute each essential duty satisfactorily. Architect, implement, and maintain an Enterprise Data Lake on AWS technologies to optimize our data lifecycle and enable next generation data analytics.Architect, implement, and maintain high performing ETL processes, including data quality and testing processes.Architect, implement, and maintain technical/data architecture for data warehouse, data marts and big data solutions.Develop analytics systems with a mind toward accuracy, scalability and high performance.Provide technical guidance and thought leadership to other members of the team.Establish lean data governance to drive data standards and data quality. Be an evangelist in the company for data-informed thinking and decision-making.Education and ExperienceBachelor’s Degree in Computer Science or equivalent experience.5+ years hands-on experience with Data Warehousing design & implementation (preferably with AWS Redshift or Snowflake Data Warehouse).2+ years hands-on experience implementing data lake solutions (preferably on AWS technologies).Experience with AWS Big Data technologies (Kinesis, EMR, AWS Glue, etc.).Experience with NoSQL technologies (DynamoDB, Redis, ElasticSearch, etc.).2+ years programming experience with an advanced language (C#, Python, Java, etc.).Experience ensuring data quality across multiple datasets used for analytical purposes.Experience with data visualization tools such as Tableau, QlikView, etc.Experience in agile development methodologies.Knowledge of statistical concepts and their application in reporting and data mart applications.Good communication (oral and written) and interpersonal skills.Enthusiastic attention to detail.Ability to acquire new skills quickly, and thrive in a collaborative team environment.Comprehensive Benefits We offer a competitive salary, outstanding benefits package that includes medical, dental, vision. Life insurance, paid vacation and sick days, paid holidays, tuition reimbursement, and 401(k) with company match.  Qualified applicants will receive consideration for employment without regard to their race, color, religion, national origin, sex, or disability."}