{"jobID": "2830898734", "jobLocation": "Santa_Clara_CA", "jobTitle": "Bioinformatics/Data Scientist", "companyRating": "3.3", "companyInfo": {"Website": "jobs.thermofisher.com", "Headquarters": "Waltham, MA", "Size": "10000+ employees", "Founded": " 1902", "Type": " Company - Public (TMO) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Illumina, Agilent Technologies, Roche"}, "estimatedSalary": "124000", "jobDescription": " Job DescriptionWhen youre part of the team at Thermo Fisher Scientific, youll do important work, like helping customers in finding cures for cancer, protecting the environment or making sure our food is safe. Your work will have real-world impact, and youll be supported in achieving your career goals. How will you make an impact? We are seeking a talented and motivated individual to provide bioinformatics support for scientific services. The candidate will be responsible for project management, data analysis, documentation, and deliverable preparation for the various scientific services & research projects for different applications, such as whole genome and/or targeting genotyping, copy number variation assays, and gene expression. What will you do?Interface with several cross-functional groups within the company and with our scientific customersWork on applications of microarray and next generation sequencing platforms, including some or all of the following: detection of rare variants, detection of gene fusions, detection of deletions and other structural variants, quantitation of differential gene expression.Use, extend, and where applicable, develop new pipelines for expression and genotyping data analysisHow will you get here?  Education/Experience:PhD in Bioinformatics, Biostatistics, Biomedical Engineering, Molecular Biology or similar with at least 2 years of working experience in related fieldsMS with at least 4 years of working experience in related fieldsProficient in Linux/Unix work environmentDemonstrated expertise in a scripting language (Perl or Python).Demonstrated expertise in statistical computing language - R is preferredRelational database experience (PostgreSQL, Oracle).Experience in human genotyping imputation, Genome Wide Association Studies, annotation databases, as well as the ability to handle very large bioinformatics datasets and develop automated workflows, is a strong plusExperience in next-generation sequencing analysis.Experience in microarray data analysisKnowledge, Skills, Abilities:Project management skills strongly preferredExcellent cross-discipline communication and writing skillsStrong organizational skillsStrong initiative and demonstrated ability to take ownership of assigned tasksAttention to detailsAbility to work in a fast paced, collaborative environment and meet deadlines At Thermo Fisher Scientific, each one of our 70,000 extraordinary minds has a unique story to tell. Join us and contribute to our singular missionenabling our customers to make the world healthier, cleaner and safer.  Apply today! http://jobs.thermofisher.com  Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status."}