{"jobID": "2772879007", "jobLocation": "Bolingbrook_IL", "jobTitle": "Data Analyst - Marketing Analytics and Customer Insights", "companyRating": "3.2", "companyInfo": {"Website": "www.ulta.com", "Headquarters": "Bolingbrook, IL", "Size": "10000+ employees", "Founded": " 1990", "Type": " Company - Public (ULTA) ", "Industry": " Retail", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Sephora, Victoria's Secret, Bath & Body Works"}, "estimatedSalary": "61000", "jobDescription": " This Analyst contributes to Ulta’s business strategy through the use of innovative analytic approaches and influences business decisions made within multiple internal groups at Ulta including senior leadership. This position utilizes data manipulation and data mining capabilities to support the analysis and reporting needs of the CRM, Loyalty and Marketing programs. This role will also develop statistical models to generate powerful insights that will drive the effectiveness/ROI of marketing strategies.    PRINCIPAL JOB DUTIES & RESPONSIBILITIES (*Essential Functions)  1. Develop a strong partnership and collaboration with Ulta Beauty business partners, performing as a team member who consults on how to attain the business goals by leveraging customer data and insights.   2. Build predictive models and perform descriptive analytics using statistical methods such as clustering and segmentation techniques, regression, and propensity modeling to support the marketing efforts and business needs of the internal clients.  3. Analyze Ulta Beauty customer behavioral data, demographics, segmentation, and market basket data and transform it into meaningful insights  4. Preparing and presenting results to various levels of the organization in an audience specific language with an orientation toward action-oriented decision-making  5. Extract member data, including customer profile info, campaign response, and transaction data, from existing Ulta Beauty systems, using tools such as SAS, SQL, R and Python.  6. Continually look for ways to improve analytics processes and deliverables  7. Ensure data integrity by leveraging proven methodologies, including data reconciliation, data integration and data audits.  8. Actively listens to the needs of others (guests, partners, co-workers) to understand and provide accurate information or solutions.Requirements  3+ years of experience developing business strategies resulting from quantitative marketing analytics/data mining and presenting those results to the client/business partner.BA/BS degree in Business Analytics, Mathematics, Computer Science, Statistics, Data Science or related analytical degree or experience. Masters a plus.Proven command of SAS and/or R, SQL, relational databases, Python and MS Excel/PowerPointFamiliarity with a variety of statistical models including regression, market basket analysis, cluster analysis, propensity models, and other modeling techniquesExperience in retail or CPG industry a plusExperience with data visualization tools (i.e. Tableau) a plus.Excellent interpersonal, verbal, and written communication skills - must be able to communicate complex ideas in both technical and user-friendly language.Capable of working in a dynamic environment, handling multiple projects, meeting deadlines, prioritizing appropriately and responding to issues quickly and creatively with an open and positive attitude.Excellent analytical, mathematical and creative problem-solving skills.Energetic and self-motivated - must be extremely organized and detail oriented with an ability to make proactive recommendations.PREFERRED OR SPECIAL POSITION REQUIREMENTSSQL, MS Excel/PowerPoint, Python, RExperience building statistical modelsMust be able to see the “big picture” and be able to relate findings across various analyses.Strong sense of curiosity and storytelling.Strong attention to detail.WORKING CONDITIONSDynamic, fast-paced office environment and remote stakeholders.Occasional training/conference travel possible.               "}