{"jobID": "2699364233", "jobLocation": "Sunnyvale_CA", "jobTitle": "Senior Scientist II", "companyRating": "2.4", "companyInfo": {"Website": "www.pharmacyclics.com", "Headquarters": "Sunnyvale, CA", "Size": "501 to 1000 employees", "Founded": " 1991", "Type": " Subsidiary or Business Segment", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Acerta Pharma, Kite Pharma, Genentech"}, "estimatedSalary": "171000", "jobDescription": "Pharmacyclics is committed to the development and commercialization of novel therapies intended to improve the quality and duration of life and to resolve serious unmet medical needs for cancer patients. Pharmacyclics is a wholly-owned subsidiary of AbbVie (NYSE:ABBV), a global, research-based biopharmaceutical company. Oncology is a key therapeutic area for AbbVie, with a portfolio consisting of three marketed products and a pipeline containing multiple promising new molecules that are being studied in more than 200 clinical trials for over 20 different types of cancer.  More than 1,200 Pharmacyclics and AbbVie research scientists, clinicians, marketing, operations and corporate professionals work in the San Francisco Bay Area. They combine their expertise in immuno-oncology, stem cells, and cell-signaling with their knowledge of bispecific antibodies, antibody-drug conjugates (ADCs), and covalent-inhibitor technologies to discover and develop novel cancer treatments. Together, we are striving to outsmart cancer. General Position Summary/Purposes Provide strong scientific and technical initiative and hands-on implementation of compound screening assays for small-molecule drug development and new target identification/validation in the fields of hematologic malignancies and immuno-oncology. Conceive and execute novel scientific approaches to achieve departmental project goals. Key Accountabilities/Core J ob ResponsibilitiesDemonstrate scientific independence to establish and implement strategies for understanding the mechanisms of action of drugs and translation into future therapies for new indications in hematological malignancies and immune-oncology.Design hypothesis-driven proposals and studies to enable structure-activity relationships or mechanisms of action of drugs.Advance science from the bench. Design and execute in vitro or ex vivo experiments to determine potency and selectivity of drug candidates using cell lines and primary human cell sources. Lead the development, optimization, and validation of new assays.Apply cell and molecular biology techniques to determine and evaluate cellular efficacy and selectivity endpoints. Utilize technical expertise and available information to troubleshoot and resolve key project hurdles when encountered.Actively participate in internal and external scientific meetings by presenting and critically evaluating emerging scientific literature to contribute to projects.Perform and manage in-house, CRO, or collaborative research to support the development of therapies in a variety of hematological malignanciesPrioritize tasks and contribute to a highly motivated and productive research team with a sense of urgency and desire to meet project timelines.Qualifications:PhD with postdoctoral training plus a minimum of 3 years of industry experience in small molecule drug discovery/development in oncology, immuno-oncology and other related fields.Strong track record of peer-reviewed publications and presentations at national meetings.Strong interpersonal skills to thrive in a team environment.Effective written and verbal communication skills.ExperiencesBroadly trained in cancer biology/cancer immunology and immunologyExpertise in multiple ELISA formats, western blotting, WES, cell culture, separation techniques for primary cells and cell-based assays is a must. Hands on experience with flow cytometry is strongly preferred. Experiences in up-to-date molecular biology techniques for manipulation of gene/protein expression in cancer and immune cell types are also preferred.Working knowledge of lymphocyte biology, cell subsets, and lineage markers. Expertise with immunoassays including multi-color immunophenotyping and FACS-based assaysExperience with analyzing/ isolating immune cell populations (T and B lymphocytes, NK cells and myeloid lineage cells) from human and mouse blood and tissues and execute immune cell functional analysis of immune cell functional assays. Position requires the basic knowledge and experience to work with normal donor human blood and blood-derived cells.Bioassays for small molecule inhibitors/modulators in cell-based assays using cell lines, primary cells and ex-vivo cell/tissue preparations such as standard colorimetric, fluorescence/luminescence-based assays for cell proliferation, cytotoxicity, apoptosis, cell migration, cell signaling, etc.Basic knowledges on analyzing biological data using GraphPad Prism, FACS DIVA software, FlowJo, SoftMax Pro, and Meso Scale Discovery (MSD) Discovery Workbench software.Contribute to lab and equipment maintenance and order supplies/reagents to help create a safe, effective and efficient working environment.Equal Opportunity Employer Minorities/Women/Veterans/Disabled"}