{"jobID": "2625291366", "jobLocation": "Monterey_Park_CA", "jobTitle": "Senior Business Information Analyst- Data Analysis & Risk Management", "companyRating": null, "companyInfo": {"Website": "www.leadstackinc.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2016", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "General Summary:Experience:IT Migration and Integration experience is highly desirableKnowledge of healthcare EDI and HIPAA standard transaction sets, specifically 837P, 837I, 837D, NCPDP 4.2 are highly desirableProficient in MS Office (Word, Excel, Access, Visio, Powerpoint, Project, etc)Minimum of 3years related experience working in a managed care environmentMinimum of 5 years experience working in business readiness and change management framework approaches and methodologiesMinimum of 5 years project management experienceLead, manage, and assist all aspects of the project management and software development life cycle (SDLD)Detailed understanding of the impact of change, the interdependencies and impact on the businessAbility to take the initiatives to ensure the success of projectsAbility to document all project efforts and comprehensive summaries in the presentable formatsAbility to effectively communicate with management and all stakeholdersAbility to prioritize and lead multiple tasks concurrentlyAble to work in a fast paced environment with frequently changing work demands  Ability encompasses in-depth knowledge of fundamental concepts, practices and procedures of particular field of specialization.  Generally requires Bachelor’s degree and thorough professional experience in all aspects of the primary product, program or technology. Fully competent professional.  Minimum and Preferred Qualifications:  Education: Bachelor’s degree is required in computer science, healthcare management, data management, healthcare science, business and IT technology, etc.  Master’s degree is highly desired"}