{"jobID": "2831151890", "jobLocation": "Rocklin_CA", "jobTitle": "Machine Learning Engineer II", "companyRating": "2.9", "companyInfo": {"Website": "www.williams-sonomainc.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1956", "Type": " Company - Public (WSM) ", "Industry": " Retail", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Room & Board, Design Within Reach, Pier 1 Imports"}, "estimatedSalary": "110000", "jobDescription": "Requisition Number: SS-13220  Area of Interest: Information Technology  Organization: Corporate  Brand/Division: Shared Services  Position Type: Full-time JOB DESCRIPTION (3 open positions)  At Williams-Sonoma Technology, we reach beyond the code to lead and communicate. We&apos;re there to lend a hand anytime our brand and shared service partners need a technical guru. Whether it&apos;s helping an associate with a day-making tech fix, creating an online shopping experience that sails through with ease, taking our business into the next frontier, or finding new ways to run green, each of us is committed to creating a user experience that&apos;s as unique and rich as the products offered in our stores and online.  The Williams-Sonoma Technology organization is seeking an energetic and talented Machine Learning Engineer II to assist with development strategy and road mapping as a member of our developing Machine Learning & AI team(s). At Williams Sonoma, we are harnessing the power of machine learning and predictive analytics to discover trends across our business. We are working on challenging problems in information retrieval, entity resolution, and developing an in-depth knowledge of multiple aspects for: Williams-Sonoma, West Elm, Outward, Mark and Graham and the Pottery Barn family.  You have the option to work at either of the following Williams-Sonoma Corporate locations: San Francisco, CARocklin, CASan Jose, CA (Outward HQ)What you will be doing:Work with internal customers on solving business-critical data-driven problemsBe a big sister/brother to junior team membersMake improvements to algorithms, code and systemsSolve technical issues and shape an overarching strategyPerform experiments, and analyze results related to business and system metrics for advertising performanceContinue to learn /research about new things in MLMake analytical recommendations regarding current and future projectsBe a pivotal member to vote for next years preferred coffee vendor -- really!REQUIREMENTS AND QUALIFICATIONSRequired Qualifications:MSc or Ph.D. in a STEM FieldStrong hands-on programming experience with Java, Scala, Python and/or C++4+ years&apos; work experience in Machine Learning, Data Science, and Software EngineeringDeep understanding of data structure, performance optimization, and algorithmsGood knowledge of big data such as Spark, Hadoop, Kafka, Hive, and ElasticSearchStrong communication, analytical, and people skills -- we prefer friendly peopleWork With US / Perks: Williams-Sonoma is a company of lifestyle brands that emphasize good living and good eating. We are a People First organization that values our customers, quality craftsmanship, corporate responsibility and a healthy work/life balance.  We are continually working to achieve our business goals while improving our social and environmental performance. As a framework to guide our efforts, we&apos;ve committed to a positive impact in 3 key areas: Operations, Products and Materials, and People and Communities.  Our responsibility extends to every part of our business-- from our home to your home, to the world&apos;s home. Work with emerging technologiesTeam First cultureFull-time Associate Discount at all WS brands (40% off)Competitive salary and 401k planBonus plans and/or LTI plans for some positionsShuttle to/from SF BART and CaltrainPre-tax health and commuter benefitsBike share programPet Insurance (Starting July 2018)Quarterly sample salesWellness program and quality health insurance optionsMothers&apos; rooms and onsite showersDiscounts on nearby gyms and restaurant Williams-Sonoma, Inc. is an Equal Opportunity Employer.  Williams-Sonoma, Inc. will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance, or other applicable state or local laws and ordinances."}