{"jobID": "2831407463", "jobLocation": "Oakland_CA", "jobTitle": "Loan Processor / Sales Associate", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Recently named one of the “Best Places to Work” in the 2018 Bay Area, TMC Financing is looking for a Loan Processor / Sales Associate to join our mission driven organization that is focused on helping small business grow using attractive financing.Founded in 1981, TMC Financing is the largest provider of Small Business Administration (SBA) 504 commercial real estate financing in Northern California and Nevada. TMC consistently ranks among the top certified development companies nationwide, funding projects worth more than $8 billion across California and Nevada. More than 5,000 businesses have benefitted from this financing, resulting in the creation of an estimated 60,000 jobs.For more information, please visit our website at http://www.tmcfinancing.comThe PositionThe Loan Processor / Sales Associate is accountable for ensuring that the loan file is complete and accurate. Upon receipt, he or she reviews the loan file to ensure that all necessary documents are present and when not present, creates necessary forms and lists items outstanding. The Loan Processor / Sales Associate is responsible for obtaining missing documents from internal and external sources and assisting the Loan Officer and Business Development Officer through the approval process. The Loan Processor / Sales Associate audits all application files post approval to ensure SBA compliance and assists in random SBA audits as they occur. The Loan Processor / Sales Associate keeps accurate notes and logs all activities in order to provide up to the minute details regarding document collection efforts and client conversations.The position requires excellent attention to detail with a very high degree of accuracy under tight deadlines with the ability to readily identify and gather missing information. The Loan Processor / Sales Associate needs to keep informed on ever changing SBA and internal procedures to ensure all documentation is accurate under the current policies. This position is also challenged to constantly update loan status and notes to ensure that other employees who access the loan records can determine the most current status at a glance.The Loan Processor / Sales Associate also attends industry events from time to time.ResponsibilitiesLoan Processing -Process loan inquiries and provide potential borrowers with TMC application and customized loan proposals.Receive loan files from internal or external sources, complete data entry for each loan into Salesforce and Ventures (Loan Management System) and submit for prequalification.Review documentation as it is received for completeness of accordance with published checklist then create/update list of items needed and Table of Contents for each loan.Create approximately 50 pages of Loan Application documents (PM docs) for client signature.Obtain missing documents from BDO, Loan Partners, and Client. Keep real-time notes to track documentation efforts in Salesforce so that employees with a need to know can get current status at any time on loan files in process.Verify tax returns in file against IRS Transcripts.Review Appraisal, Environmental & Franchise documents received prior to Loan Officer Assignment and submit for SBA approval when necessary.Make modifications to the Loan Authorization (via SBA 327) for all pre-closing requests.Audit all application files at transfer to closing.Creating customized reports on demand from various systems or within Excel.Perform other projects as assigned.Sales Support -Place calls to lenders and brokers to set appointments for BDO.Process loan inquiries and provide potential borrowers with TMC application and customized loan proposals.Assume an active role in turning a partial Intake into a deal ready for PQ.Follow up with Client on collecting needs list items.Follow up on missing documentation at all stages (Intake, Lead 1s, Lead PQs) in process to keep BDOs pipelines current.Monitor F/C and COE Dates and ensure we are working to meet those deadlines to the best of our ability.Manage Salesforce pipeline and reporting.Ensure Salesforce reflects up-to-date and accurate contact information for brokers, lenders, partners, etc.Pick-up packages and misc. documents needed to complete file from clients/lenders.Attend industry events and meetings with or in place of BDOs (SIOR, NAIOP, etc.).QualificationsBachelor's degree (B. A.) from four-year college or university; and/or 4-6 years related experience and/or training; or equivalent combination of education and experience;2-4 years of experience in commercial l or residential lending a plus.Excellent time management and project management skills; must be able to track and manage details for multiple clients and projects, and prioritize against daily responsibilities;Excellent attention to detail without compromising deadlines;Strong people and communications skills are essential. Must be able to interact and cooperate with various personality types and work levels both internally and externally;Organized, disciplined thinker with ability to work independently in fast paced, rapidly changing environment;Excellent phone etiquette and customer service skills;Strong written communications and email etiquette skills;Proficiency in MS Office applications - Word, Excel, PowerPoint, Outlook;Working knowledge of CRM databases. Salesforce experience a plus;Must be flexible in work schedule and able to attend occasional evening events and travel throughout the greater Bay Area.Company CultureTMC is a small, dedicated group of people who work hard and are super friendly and fun. Our offices are in Uptown Oakland and people bring their dogs to work. The atmosphere is casual and comfortable. Senior leaders regularly seek input/feedback from staff, assign challenging work, and provide recognition for their accomplishments. Feedback is implemented to provide a fun work place that promotes employee interaction and idea sharing. TMC also encourages on-going training, and whenever possible, we promote from within the Company.TMC offers flexible schedules, great benefits, and lots of perks, including catered lunches at least weekly, free snacks and sodas, gym reimbursement, company paid commuter checks, lots of celebratory parties, matching charity donation, and a very generous vacation and Holiday offering.Apply NowIf you are interested in joining our team email your resume in MS Word or PDF format to jobs@tmcfinancing.com.TMC Financing is an EOE. Thank you for your consideration."}