{"jobID": "2802699069", "jobLocation": "Dearborn_MI", "jobTitle": "Data Scientist - Corporate Finance", "companyRating": "3.9", "companyInfo": {"Website": "www.ford.com", "Headquarters": "Dearborn, MI", "Size": "10000+ employees", "Founded": " 1903", "Type": " Company - Public (F) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Tesla, General Motors, Uber"}, "estimatedSalary": "102000", "jobDescription": "Job Description Ford Motor Company's Global Data, Insight, and Analytics (GDIA) organization is looking for a seasoned Finance professional that has a deep business understanding of data analytics or finance systems applications. You will have the opportunity to work with some of the brightest global subject matter experts that are transforming the automobile industry.  The role of the Data Operations Analyst - Finance is a critical enabler to the development of Fords Data Supply Chain. The Steward will contribute with that overall data standards, information interoperability, data quality, and data availability to fully support the goals of GDI&A.; The Data Operations Analyst works closely together with GDI&A; analytics Team, IT Data Supply Chain Team, Data Governance Team, the Finance SMEs, and the external solution partners to drive alignment and delivery of the Data Supply Chain and bring data up to quality required to deliver on the business objectives.  This role requires a detail oriented, comfortable working in a highly collaborative, entrepreneurial environment, able to work with a variety of customers and manage and prioritize competing customer demands, while incrementally building an integrated reporting and analytics self-service platform end state vision. Responsibilities:Act as an internal consultant inside and outside of GDIA, this position will take a a supporting role delivering solutionsCoordinate with the Business Partners and the Data Scientist on the type of data needed for analytical purposesWork with the Information Technology team on the understanding of the finance system applications, and facilitate the ingestion their data in the data warehouseCreate Finance Analytical Objects (Financial Analytical Objects are models of customized data environments in Hadoop -Data Warehouse-, designed to facilitate access of the information, with the goal of supporting scalable growth, sustainability, and to accelerate delivery of business value). The Data Ops Finance Analyst has to work with the Finance and Accounting SMEs in the different areas of Finance and have a good understanding of the business, and the information flowCommunicate the Finance Business knowledge within the GDIA, and support knowledge sharing on Finance Application and Financial Analytical ModelsContribute with the efforts on Data Standards and Data ManagementJob RequirementsBasic Qualifications:Bachelor's degree in Business, Finance, Computer Science, Engineering, Statistics, Economics or equivalent experience in a relevant field3+ years of progressive responsibilities in Finance or Accounting2+ years of hands-on business reporting tools such as SQL, Business Objects, SAP, ESSBASEPreferred Qualifications:Master Degree (MBA, Mathematics, Statistics, Finance)Experience developing business solutions or launching finance system applicationsHighly motivated, self-starter, ability to work independentlyStrong communication and presentation skillsStrong Leadership SkillsHigh integrity with good interpersonal skills2+ years of experience working with descriptive analytics tools like Alteryx, InformaticaAbility to work in a dynamic environmentTeaching and coaching skillsStrong teamwork with a global perspectiveSuccessful candidate must be able to demonstrate leadership in leadership behaviors combined with outstanding interpersonal, team building, and communication skills. The distance between imagination and . Creation. It can be measured in years of innovation, or in moments of brilliance. And, it can be a road you start traveling right now. When you join Ford Motor Company, your journey begins. You become part of a team that is already leading the way, with ingenious solutions and attainable products and it is always ready to go further.  At Ford Motor Company, the distance between you and an amazing career has never been shorter. Join the Ford team today, and discover the benefits, rewards and development opportunities youd expect from a diverse global leader.  Candidates for positions with Ford Motor Company must be legally authorized to work in the United States. Verification of employment eligibility will be required at the time of hire. Visa sponsorship is not available for this position.  Ford Motor Company is an equal opportunity employer committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, disability status or protected veteran status. Ford Motor Company also is committed to take affirmative action to employ and advance in employment such persons. "}