{"jobID": "2762266683", "jobLocation": "Pasadena_CA", "jobTitle": "Data Base Analyst", "companyRating": null, "companyInfo": {"Website": "www.kaiserpermanente.org", "Headquarters": "Oakland, CA", "Size": "10000+ employees", "Founded": " 1945", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " HCA Healthcare, Dignity Health, Sutter Health"}, "estimatedSalary": null, "jobDescription": " Assists in the analysis of the clients' business and the development and integration of data and process models, process flows, and logical database designs. Assists in the physical design, testing, implementation, maintenance and control of the organization's databases across multiple platforms, technologies (e.g., hierarchical, relational and object oriented) and computing environments (e.g., host based, distributed systems, client/server). Assists in developing and maintaining the department's documentation standards and development process guidelines and tools. Essential Functions: Assists in the identification and analysis of corporate business processes, the information flows and interfaces among them, and their transformation into data and process models.  Assists in the development of detailed data models in consultation with clients and staff.  Works closely with technical and client management to design and implement databases and support tools for complex business application development requirements and processes (e.g., diverse development platforms, technological environments, software, hardware, tools, etc.).  Monitors transaction activities and assists in optimizing the performance and utilization of databases.  Responsible for the integrity and security of data in corporate databases.  Participates in the analysis and resolution of issues related to information content, data integrity, integration, and database performance with clients and other Data Processing staff.  Assists in the development of standards and procedures affecting data and process modeling and documentation, along with database design, maintenance and management.  Assists in the development of the corporate data architecture and related data architecture standards and conventions.  This is a Repost of 603656. Basic Qualifications: Experience  Minimum three (3) years of experience in data processing including business analysis, data/process analysis, systems analysis, programming in a DBMS environment and word processing graphics. Education Bachelor's degreeOR four (4) year experience in technical, analytical, or a directly related field required.  High School Diploma or General Education Development (GED) required.  License, Certification, Registration  N/A. Additional Requirements: Strong understanding of the systems development process and its relationship to the needs of the business.  Knowledge of data and process analysis and database development technologies and tools.  Excellent analytical ability, consultative and communication skills, strong judgment, and the ability to work effectively with client and data processing managers and staff.  Must be able to work in a Labor/Management Partnership environment. Preferred Qualifications: Experience in quality management preferred.  2+ years- experience in writing complex MS SQL queries. Programming in SAS, R, SQL, Python or equivalent preferred.  Understand, analyze, process and solve complex data puzzles  Experience with SQL Server Management Studio  Minimum two (2) years of related analytical consulting experience, healthcare experience preferred.  Minimum three (3) years of related business intelligence experience (Tableau, Business Objects, SQL Server Analysis Services, Cognos) "}