{"jobID": "2670043972", "jobLocation": "Chantilly_VA", "jobTitle": "Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.iiinfo.com", "Headquarters": "Springfield, VA", "Size": "501 to 1000 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": " Company/Position OverviewIn this role you will: Provide technical knowledge and analysis of highly specialized applications and operational environment. Provide high-level functional systems analysis, design, integration, documentation, and implementation advice on exceptionally complex problems that necessitate high-level knowledge of the subject matter for effective implementation. Participate as needed in all phases of software development with emphasis on the planning, analysis, modeling, simulation, testing, integration, documentation and presentation phases.  Salient CRGT is starting a new data analytics and data management engagement with a defense customer. This is a chance to be one of the first members of an eventual large project team in modernizing a large-scale data and business intelligence environment. Selected personnel will create an enterprise level data strategy including data management, data governance, data transformation, and data exchanges. We will be using leading big data, data management, and data analytics technologies including open-source software.Mandatory Qualifications (Education, Certifications, Experience, Skills) Bachelor's Degree in Engineering, Computer Science, Information Systems, or other related analytical, scientific, or technical disciplines;Relevant Experience: 10+ yearsOracle experience - Working on projects that are an integration of multiple data sources, using XML or ETL ToolsData Quality - experience leading reconciliation of data, ensuring the data isUnderstanding the role of cyber security in data transfer ability to ensure data confidentiality, integrity and availabilityPrevious experience leading a team of data analysts/architects to implement data management across the enterprisePrevious experience working with multiple stakeholders who are vested in the data governance across multiple systems Desired Qualifications (Education, Certifications, Experience, Skills)Salient CRGT is a leading provider of health, data analytics, cloud, agile software development, mobility, cyber security, and infrastructure solutions. We support these core capabilities with full lifecycle IT services and training—to help our customers meet critical goals for pivotal missions. We are purpose-built for IT transformation supporting federal civilian, defense, homeland, and intelligence agencies, as well as Fortune 1000 companies.  If you feel you are qualified for this position, express interest by clicking the Apply button below (if you are viewing this position on the Salient CRGT website). If you are viewing this job posting outside of the Salient CRGT website, please visit: www.salientcrgt.com/careers to express interest in this position through the Salient CRGT Careers page.  Salient CRGT is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, age, sex, sexual orientation, gender identity or expression, veteran status, disability, genetic information, or any other factor prohibited by applicable anti-discrimination laws."}