{"jobID": "2689803970", "jobLocation": "Washington_DC", "jobTitle": "Senior Operations Data Analyst – (1)", "companyRating": "3.0", "companyInfo": {"Website": "www.orgstrategies.com", "Headquarters": "Mc Lean, VA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Contract", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "88000", "jobDescription": " Senior Operations Data Analyst (1)by Melissa Battles | Mar 13, 2018 | Job Listing | 0 commentsTitle: Senior Operations Data Analyst (1) – Operations Type: Full-Time Location: Washington, DC Description: This function shall reside under the Operations Directorate within Air and Marine Operations, Customs and Border Protection. Work requests and assignments shall be on demand, with the approval of the Executive Director or Deputy Director of Operations, who are the responsible government officials for this work and incumbent will work with other disciplines within the Operations Department. Is a highly trained data analyst that culls data extracts, perform analysis, and apply various mathematical processes to determine how operational and intelligence data may be applied to decision making for Law Enforcement Operations. The Sr. Operations Data Analyst performs research and analysis, studies, and statistical and qualitative evaluations of all data related to Aviation and Maritime operations.Use technical expertise to cull data through advanced computerized models or programs and extrapolate data patterns from data.In support of strategic planning efforts, reviews and assesses the organization’s capabilities and capacities across all of its operational disciplines.Experience with all stages of data analysis, including “Data Cleaning” (rooting out erroneous data); “Initial Analysis” assess the quality of the data; “Main Data Analysis” determine the meaning of the data; and the “Final Analysis” provides additional screening and validation.Supports the development, tracking, and analysis of operational performance measures.Coordinates with AMO directorates to support performance measure development, tracking, analysis, and response.Helps refine AMO’s performance review and other measures to directly align with and evaluate the performance of the organization.In support of a wide range of AMO programs, analyzes data to identify gaps and trends.Monitors, documents, and tracks requirements, regulations, guidance, plans, and other documents that impact AMO.Creates, coordinates, researches, drafts, reviews, and edits documents for presentation to leadership.Must possess a firm command of language and presentation skills to relate the results of statistical findings in terms that client will understand and must also be able to develop simple graphs and charts to illustrate how the mathematical information will influence operations and decisions.Required Qualifications and Experience:Training and experience in analytical suites (Power BI, SPSS, etc.) highly desirable5+ years of experience in project and program management support.PMI PMP certification desired.Experience with AMO, CBP, DHS, and other Federal program management is desired.Required Education: BS or MS degree Mathematics, Economics, or Computer Science is desired. Requires a CBP BI Clearance Organizational Strategies, Inc. provides equal employment opportunities without regard to race, color, religion, sex, national origin, age, veteran or disabled status. This policy relates to all phases of employment, including, but not limited to, recruiting, employment placement, upgrading, demotion or transfer, reduction of workforce and termination, rates of pay or other form of compensation, selection for training, the use of all facilities, and participation in all Company-sponsored employee activities. Provisions in applicable laws providing for bona fide occupational qualifications, business necessity, or age limitations will be adhered to by the Company where appropriate. Contact:jobs@orgstrategies.com"}