{"jobID": "2804101733", "jobLocation": "Detroit_MI", "jobTitle": "Social Worker", "companyRating": "3.9", "companyInfo": {"Website": "www.ebshealthcare.com", "Headquarters": "West Chester, PA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Education", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "46000", "jobDescription": "If you want to make a difference in the lives of children, EBS (Educational Based Services) is interviewing determined new graduate and director level social workers for positions in Detroit, MI, and nationwide. As the leading provider of special education and therapy services for children for more than 30 years, EBS knows exactly what social workers need to make the biggest impact possible. A nationwide network of top therapists and special educators  Competitive salary packages and comprehensive health benefits Dedicated Licensure department for support and reimbursement Resource library, professional allowance, and access to CEUs and customized trainings Options to move across the country and abroad, with relocation and housing assistance 24/7 support with Career Specialists committed to your advancement Exclusive apps and tools to help you improve therapyKey Functions:Developing intervention strategies to increase academic successProvide individual, group and/or family counseling as well as crisis interventionAssist in developing positive behavioral intervention strategiesObtain and coordinate community resources to meet students’ specific needsCollaborate and consult with other staff as well as providing training, when neededQualifications:Master’s degree in Social Work from a program accredited by the Council on Social Work Education (CSWE)State licensure and certificationsAbout EBS:For more than 30 years, EBS has been the leading provider of special education services for public, private and charter schools. Our mission is to make a difference, every day, in every life we touch. Learn more at www.ebshealthcare.com"}