{"jobID": "2678082342", "jobLocation": "Troy_MI", "jobTitle": "Auto Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.jdpower.com", "Headquarters": "Costa Mesa, CA", "Size": "501 to 1000 employees", "Founded": " 1968", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Nielsen, TNS Global"}, "estimatedSalary": "49000", "jobDescription": "Title: Associate- Auto Location: Troy, Michigan Reports to: Director, Auto Consulting Group The Role: This position supports J.D. Power Automotive Consulting Groups efforts to align Voice of the Customer requirements to drive quality improvements at various stages of the product development process at Suppliers and OEMs. The primary focus of this position will be to support the team across all phases of the project from planning to execution. The consultant will assist the team by analyzing data, evaluating vehicles and components to identify problem areas from a \"Voice of the Customer\" perspective and assist in report writing of the project findings. The Impact: The Automotive Consulting group has teams that work with nearly every OEM, as well as major Suppliers, throughout the world with the goal of assisting them in improving vehicle quality from a Voice of the Customer perspective. The person who fills this position will be a key member of the teams that successfully executing consulting engagements that improve vehicle quality, which results in higher owner satisfaction. Responsibilities:Run and analyze syndicated study data to support upcoming projectsParticipate in client on-site evaluations of vehicles and components for quality faults and potential customer short fallsRun and analyze syndicated study data to support project observations and recommendationsAssist team in report writingAssist in proposal developmentHelp prepare client presentations on various topicsQualifications:Bachelor's degreeBasic knowledge of the automotive industryBasic knowledge of JDP and its services is preferred, especially IQS and APEAL.Excellent written and oral communication, interpersonal and organizational skillsAdvanced multi-tasking skills and time management skillsAbility to travel domestically and internationally (less than 40%)Must have a valid drivers license and a clean driving recordThe Career Opportunity: The position is an entry support role with potential for growth as knowledge of industry increases. The consultant will support a role that would eventually lead to greater responsibilities and potential client facing assignments. The Team / The Business: The consultant will interact with multiple members of the various Consulting teams, as well as the Sales team. Within the Consulting group, this employee would primarily work on the Supplier team, but would also rotate to other project teams, as needs arise. Each project team typically consisting of 3-5 people and the duration of a project is typically 2-3 weeks. Our Hiring Manager says: We are looking for a person who can support the Automotive Consulting Group in developing and executing projects that focus on improving vehicle and component quality. We often have multiple projects running simultaneously, so the right person for this role will be able to multi-task and be flexible enough to change focus as needed. Having strong time management skills is also important. This employee must be comfortable working independently, being able to prioritize assignments and meet deadlines. Additionally, the desire and ability to work in a team environment is also critical, as this person will participate as a team member/evaluator on projects. J.D. Power is a global leader in consumer insights, data, analytics, and advisory services that helps clients drive growth and profitability. The companys industry benchmarks and reputation for independence and integrity have established it as one of the worlds most well-known and trusted brands. Our Experience J.D. Power has been capturing and analyzing the Voice of the Customer across more than a dozen industries globally for 50 years. We know measuring customer experience is not easy, but thats where we come in. Through our proprietary index model, we identify the many drivers of customer experience, accurately measure and link their impact to business results, and uncover insights to drive results for our clients. Our Data, Analytics, and Resources Across 18 offices globally, our team of more than 800 professional analysts, statisticians, economists, consultants, and experts in demographics and consumer behavior focus on delivering insights clients can act on immediately. We serve an increasing number of countries and regions around the world, including Brazil, India, Japan, Taiwan, China, Philippines, Indonesia, Singapore, Thailand, Malaysia, Vietnam, South Korea, Canada, Mexico, Europe, Australia, Germany, and the UK. Beyond Measure We understand that the customer experience is vital and that simply measuring it is not enough. Our analysts focus on driving results that will improve customer loyalty and advocacy and our success is driven by how much we help improve your customer experience. But data is only as powerful as the analysis and insights tied to itand we are putting that power in your hands through our interactive VoX reporting platform. The data, analytics, insights, best practices, and action plans you need are available whenever and wherever you need them, to help you make data-driven decisions that will improve your customer experience and drive positive financial results."}