{"jobID": "2726989053", "jobLocation": "Woodland_CA", "jobTitle": "Discovery Pathology Scientist", "companyRating": null, "companyInfo": {"Website": "www.monsanto.com", "Headquarters": "Saint Louis, MO", "Size": "10000+ employees", "Founded": " 1901", "Type": " Company - Public (MON) ", "Industry": " Agriculture & Forestry", "Revenue": " $10+ billion (USD) per year", "Competitors": " DuPont Pioneer, Syngenta, Bayer"}, "estimatedSalary": null, "jobDescription": " Improving human health, promoting environmental stewardship and fostering greater economic growth for the agricultural community can all start with something as small as a seed. Monsanto is a global leader in the development of hybrid agronomic and vegetable crops that improve nutrition, boost crop yields, limit spoilage and reduce the need for chemicals. We are committed to consistently introducing innovative products for our customers, and research is a key component of our current and future product pipeline.  Why work with us? At Monsanto, we recognize that people are the key to our success. In over 60 countries, we have created industry-leading products because we give scientists and professionals the freedom to make real decisions. We know that every day, new ideas can come from anyone, anywhere, and we value a diverse combination of ideas, perspectives and cultures. Monsanto is recognized as a Science Magazine Top Ten Employer, one of the Top 25 Best Multinational Workplaces, and for the 10th year in a row we are in the top 50 most diverse companies according to DiversityInc for our commitment to inclusion and diversity, exceptional corporate leadership, talent development initiatives, strong employee support groups and support of local communities around the world.  We are seeking a highly motivated scientist to join the Vegetable R&D; team as a Discovery Pathology Scientist in Woodland, California. The primary focus of this role is to lead phenotyping efforts for innovative product concepts and champion new technologies for phenotyping. The incumbent will lead cross-functional initiatives and teams with experts in plant pathology, plant breeding, genetics and genomics, cell biology, statistics and data science and other breeding technology fields. These teams work together to support our vegetable product pipeline through the development of new vegetable products that bring value to growers, processors, retailers and consumers. Major responsibilities include:Leading discovery projects focusing on disease traits of commercial importanceDesigning experiments with emphasis on new vegetable product conceptsProspecting and adoption of innovative technologies for disease phenotypingPartnering with Vegetable R&D; teams globally to identify creative solutions that streamline and increase efficiency of our core discovery pathology activitiesRecruit, train and develop research personnelRequired Education & Skills/Experience:PhD or graduating with a PhD in plant pathology or related field in the next 6 months.Experience in project management and ability to lead interdisciplinary teams to accomplish project goals within expected timelines and within budgetStrong background in experimental design and statisticsDemonstrated ability to think creatively, envision solutions and lead changeOutstanding analytical and communication skillsStrong initiative and results orientationDesired Education & Skills/Experience:Experience in phenomics and/or high-throughput phenotyping such as imaging technologies, sensors or in vitro assaysExperience with programming, analysis of large datasets and data visualizationBackground or familiarity with gene editing methodsPrior work experience in an industry R&D; settingPeople leadership experience"}