{"jobID": "2778316848", "jobLocation": "Northbrook_IL", "jobTitle": "Principal Scientist, Bioanalytical", "companyRating": null, "companyInfo": {"Website": "www.astellas.com", "Headquarters": "CHUO-KU, Japan", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public (45030) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Astellas is announcing a Principal Scientist, Bioanalytical opportunity in Northbrook, IL.  Purpose of Position:  Participate in clinical development and research activities of Astellas Pharma Global Development, Inc. (APGD) under the supervisors direction. The scientist will have responsibility in project management with CROs, including transfer or development of Pharmacodynamics and biomarker methods from Astellas or other CROs, clinical sample testing, and data review. The scientist will have increased responsibility in project management with CROs. Coordinate and lead bioanalytical methods development and validations. Assist in clinical trial setup and development by providing scientific expertise and insights. Conduct the measurements of biomarker, PK and immunogenicity in biological specimens according to the principles of Good Laboratory Practices (GLP) regulations. Routinely assist to maintain records in compliance with the regulations. Other relevant duties are as assigned.  Essential Job Responsibilities:  Develop and validate new assay methods with contracted CROs under limited supervision  Pharmacodynamic/ Biomarkers  Pharmacokinetic  Pharmacogenomic  Project management with CROs  Review method validation and sample assay reports  Peer-review the data generated by other scientists  Coordinate sample testing and management  Maintain good records and organize retention of all records  Other relevant responsibilities as assigned  Scope:  Under supervision of laboratory director, develop and implement analytical methods for biomarker and other pharmacodynamic measurements (ie: PGx, CDx) in blood, plasma, urine, and other biological matrices. These assays are essential for clinical pharmacology and clinical studies required to get approval of new drugs.  Supervisory Responsibility:  No direct supervisory activities involved in this position; however, opportunities to train and direct temporary employees are available (interns, ex-patriots, etc)  Required Qualifications:  Ph.D. in biological sciences, chemistry, or equivalent with 1+ years of related experience; M.S. with 5+ years of related experience; or B.S. with 10+ years of related experience  Knowledge and experience of immunochemistry, oncology and genomics a plus  Knowledge and experience in biological sample preparations  Knowledge of FDA guideline for bioanalytical method validation  Working knowledge of SOPs and GLP regulatory guidance  Ability to transfer and validate ligand binding methods  Knowledge of computer software for laboratory data management  Skills in conducting bioanalytical research with clinical samples, documenting data, and assisting report writing following the regulatory requirements  Self-motivated, excellent team player with good communication skills"}