{"jobID": "2768671725", "jobLocation": "Plainsboro_NJ", "jobTitle": "Senior Data Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.novonordisk.com", "Headquarters": "Bagsvaerd, Denmark", "Size": "10000+ employees", "Founded": " 1923", "Type": " Company - Public (NVO) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Eli Lilly and Company, Pfizer"}, "estimatedSalary": "153000", "jobDescription": "Purpose The Senior Data Scientist will help drive the Novo Nordisk Inc (NNI) Advanced Analytics vision to explore and develop new solutions that may hold the potential to add value to patients and Novo Nordisk in the future within therapeutic areas covered by Novo Nordisk corporate and commercial strategies. The Senior Data Scientist will build machine learning-based tools and processes within the company’s current big data infrastructure such as recommendation engines, automated propensity scoring systems, and A/B testing procedures.  The Senior Data Scientist will work with Novo Nordisk’s Big Data Analytics COE and other, similar roles in Medical Information and Analytics, Medical Data Analytics, and HR People Research and Analytics to help foster and grow a community of predictive and prescriptive analytics. Relationships The Senior Data Scientist reports to the Senior Director of Advanced Analytics. Internal relationships include other Commercial Effectiveness functions, especially Analytics and Data Governance; Big Data Analytics COE, Commercial Product and Portfolio personnel, and Area Commercial Leads. Extended internal relationships could include those in other Data Science/Data Science-like roles in Clinical, Medical, Regulatory, Human Resources, Global Development, and Seattle’s Device Research center. External relationships include relationships with commercial collaboration partners as well as academia, where necessary. Essential Functions The Senior Data Scientist is expected to: Develop Machine Learning-based solutions using available commercial data, including but not limited to, IQVIA (IMS) data, Real World Data (e.g., Truven), Financial Data, Sales Force Automation (e.g., Veeva) data, and integrated campaign management (e.g., Adobe) data. Build and maintain processes to acquire, process and curate necessary data for analysis and insights. Mine and analyze data to identify insights pertaining to dynamic and/or micro segmentation of patient, physician, and payer/delivery providers. Translate analytic insights into real world solutions. Design methods to generate real-time predictive and descriptive analytics from big datasets. Take responsibility in making new, relevant solutions to real Commercial problems and be able to show successful implementation. Occasionally participate in network with external collaboration partners, e.g., academia, other Pharmaceutical and Non-pharmaceutical Data Science departments specializing in improving commercial results through data science techniques. Physical Requirements 0-10% overnight travel required. QualificationsLevel of education and experience: Relevant technical education (e.g., Computer Science, Applied Mathematics, Physics, Engineering) at B.Sc. level with 8 years of experience from relevant industry such as pharmaceutical, biotechnology, consumer product, or medical device industries. Advanced degree may be substituted for experience as appropriateRequired knowledge related to machine learning, including supervised, unsupervised, reinforced (deep) learning methods and ensemble learning methods. Specifically, algorithms such as k-NN, Linear and Generalized Linear Models, naïve Bayes, SVM, and Random ForestPreferred knowledge related to how pharmaceutical companies market and sell products, market forces that impact decisions made to improve commercial outcomes, and how machine learning models can improve such outcomesExcellent written and oral communication skills requiredProven ability to influence, communicate, and collaborate across the local organizationBroad, detailed understanding and mastery of technical area with a track record of analyzing critical data through the application and optimization of distinct analytical skillsRecord of translating technical mastery to significant project impactAbility to work independently as well as working in teams. Included in this is the ability to network with external partiesDemonstrated ability to generate valuable and relevant ideas, create concepts based on ideas, and develop new solutions based on conceptsSpecific or technical job skills: Deep knowledge of at least one relevant technical area: computer science, computational statistics, including Bayesian inference, mathematics, or systems dynamicsRequired experience within several of the following areas: Experience with analytics tools such Python, R, or SAS and SQL, PowerPivotMathematical modeling for prediction, clustering and classificationPreferred experience with implementation or utilization of big data tools such as Spark, SparkR, PySpark, Hadoop, Hive, etc.Proficiency at querying relational databases and ability to build and maintain processes to pull and integrate data from various sourcesExperience in Frequentist and Bayesian statistics Novo Nordisk is an Equal Opportunity Employer - M/F/Veteran/Disability/Sexual Orientation/Gender Identity.  If you are interested in applying to Novo Nordisk and need special assistance or an accommodation to apply, please call us at 1-855-411-5290. This contact is for accommodation requests only and cannot be used to inquire about the status of applications.Requisition ID: 56243BR State/Provinces: Plainsboro Job Category: Finance"}