{"jobID": "2593140184", "jobLocation": "San_Diego_CA", "jobTitle": "Senior Data Engineer", "companyRating": "3.2", "companyInfo": {"Website": "www.rockstargames.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1998", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "170000", "jobDescription": " Rockstar is seeking a Data Engineer with experience in Big Data technologies to join a team focused on building a cutting edge Game Analytics platform and tools to better understand our players and enhance their experience in our games.  The ideal candidate will be skilled in developing complex ingestion and transformation processes with an emphasis on reliability and performance. In collaboration with other data engineers, database administrators, and developers, the candidate will empower the team of analysts and data scientists to deliver data driven insights and applications to company stakeholders. RESPONSIBILITIESETL Design and Development – Assist in the development of a Big Data platform in Hadoop using pipeline technologies such as Spark, Oozie, and more to support a variety of requirements and applications.Warehouse Design and Development – Set the standards for warehouse and schema design in massively parallel processing engines such as Hadoop and Vertica while collaborating with analysts and data scientist in the creation of efficient data models.Implement and support Big Data tools and frameworks such as HDFS, Hive, and Impala.Implement and support streaming technologies such as Kafka and Spark.Assist in the development of deployment automation and operational support strategies.Deliver near-real time and non-near-real-time data and applications to a team of analysts and data scientists who create insights and analytics applications for our stakeholders.QUALIFICATIONS7+ years of work experience with ETL, Data Modeling, and Business Intelligence big data architectures.2+ years of experience with the Hadoop ecosystem (Map Reduce, Spark, Oozie, Impala, HBase, Scala, etc.) and Big Data Ecosystems (Kafka, Cassandra, etc.).Expert in at least one SQL language such as T-SQL or PL/SQL.Experience developing and managing data warehouses on a terabyte or petabyte scale.Strong experience in Massively Parallel Processing & Columnar databases.Experience working in a Linux environment.Experience with Python and shell scripting.Deep understanding of advanced data warehousing concepts and track record of applying these concepts on the job.Ability to manage numerous requests concurrently and strategically, prioritizing when necessary.Good communication skills.Dynamic team player.A passion for technology - we are looking for someone who is keen to leverage their existing skills and seek out new skills and solutions.PREFERREDExperience with Vertica.Experience with Tableau administration.Experience in implementing a Machine Learning pipeline.Experience in Real-Time Analytics applications.Knowledge of the Video Game Industry and video games."}