{"jobID": "2816453185", "jobLocation": "KenTownshipood_MI", "jobTitle": "Sanitation Technician", "companyRating": null, "companyInfo": {"Website": "www.rothburyfarms.com", "Headquarters": "Grand Rapids, MI", "Size": "1001 to 5000 employees", "Founded": " 1923", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Sanitation Technician:Our Organization With 6 facilities in the Grand Rapids area,Roskam Baking Company has been committed to producing high quality foods since 1928. Our product lines include breads, croutons, snacks, popcorn, candy, glazes, frozen food, and much more. We are seeing continual and rapid growth at our family-owned company and work hard to invest in the employees that serve the legacy our company has created!Compensation and Benefits At Roskam Baking Company, we make significant investments into each of our Sanitation Techniciansby providing:Competitive pay2nd and 3rd shift premiumsMedical, Dental, Vision, and Life InsurancePaid vacation and holidays401KPosition Description and Purpose: Roskam Baking Company (RBC) produces and packages food products with the goal of consistently meeting and exceeding customer expectations for quality, safety and wholesomeness. The individual selected for the Sanitation Technician will be responsible in performing the assigned Master Sanitation Schedule tasks given by the Plant Sanitation Manager. Alleviate/enforce any G.M.P. or Food Safety concerns. All Sanitation Technicians must be aware of all cleaning products used and be willing to cross train in other sanitation roles if necessary. Key Responsibilities:Food Safety; The Sanitation Technician shall enforce all elements of food safety within the plant.Daily Routine Tasking; The Sanitation Technician shall be responsible for upkeep of entrances, floors, utility areas and storage areas, handling any and all line clean ups and the documentation for clean ups, enforcing all safety rules and regulations, monitoring the inventory of cleaning equipment and cleaning supplies, ensuring the proper completion of Master Sanitation Schedule work.Master Sanitation Schedule; The Sanitation Technician shall be knowledgeable in how to read and manage the Master Sanitation Schedule.Cleaners and Materials; The Sanitation Technician shall be responsible for ensuring that all cleaners are used as set forth in the manufacturers instructions.Chemical Testing; All bulk cleaning chemicals used in the facility must be diluted. Material used to test the proper dilutions of said chemicals will be provided by the chemical manufacturer and the use of said test materials will be controlled by the Plant Sanitation Manager.Line Clean up and Inspection; The Sanitation Technician shall be responsible for managing all line clean ups. They must be knowledgeable in how to properly inspect line equipment. They must also be knowledgeable in the definitions and what is involved for; changeovers, shutdowns, start ups, periodicals, 100% organic, 100% wash, 100% Allergen and kosher clean ups.Sanitation Management System; The Sanitation Technician will share any discrepancies with the SMS to their supervisor or the Plant Sanitation Manager. These discrepancies include but are not limited to; HACCP Programs, Allergen Program, GMP Findings, Hold Procedures, and many more.Required and Preferred Qualifications:Basic math and reasoning skillsFlexible in hours and days that they work and be available as needed for intercompany work or weekend work as deemed necessary by the company."}