{"jobID": "2768340810", "jobLocation": "Sunnyvale_CA", "jobTitle": "Data Scientist - Search / Relevance", "companyRating": "3.2", "companyInfo": {"Website": "www.walmartlabs.com", "Headquarters": "San Bruno, CA", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, eBay, Google"}, "estimatedSalary": "125000", "jobDescription": "Position DescriptionE-commerce product search, much like web search, has always been a fertile area of AI innovation. Search algorithm team at Walmart Labs working on fascinating AI/ML problems like deep NLP based query understanding, improving relevance ranking of products, semantic matching of query item pairs using embeddings, visual search to enable search by image, interleaving based fast online experiments etc. As part of this team, you'll solve some of the most challenging and impactful problems in machine learning, information retrieval, natural language processing, computer vision or statistical measurement. Your work will be visible to hundreds of millions of customers and you will have a direct impact on the goals of the Fortune #1 company. If you speak and think machine learning then we want to talk to you. Come join our team and be part of this exciting journey.  In this role you will Build advanced machine learning models and improve the accuracy of those modelsCrunch terabytes of data and build models from large datasetDeploy the models in production where it will serve customers in real timeWork alongside senior machine learning researchers and define the right solution to implementPut on the hacker's hat quickly convert an idea to a demonstration Present your work to the internal and external communityMinimum Qualifications• PhD or masters in computer science with 2+ years of experience Highly proficient in Python or JavaExperience in using libraries like scikit learn, tensorflow, nltkThorough understanding of the internals of the state of the art Machine Learning techniquesFamiliarity with SQL like language and ability to crunch dataA good portfolio of Machine Learning projectsA github accountAdditional Preferred Qualifications• Internship or industry experience with Machine Learning projectsExperience in handling large datasetFamiliarity with Deep LearningCompany SummaryThe Walmart eCommerce team is rapidly innovating to evolve and define the future state of shopping. As the worlds largest retailer, we are on a mission to help people save money and live better. With the help of some of the brightest minds in technology, merchandising, marketing, supply chain, talent and more, we are reimagining the intersection of digital and physical shopping to help achieve that mission.Position SummaryThe search algorithms team at Walmart Labs is dedicated to the mission of helping millions of customers every day in finding the right products. We are at the forefront of attacking one of the most complex problems of e-commerce. Whenever a user types in a query or browses through product categories on the web site, phone or the iPad, our service goes to work. We mine billions of search queries and tens of millions of products to find the most relevant products for our customers. Team members take end-to-end responsibility in analyzing large amounts of data, creating complex models, improving their accuracy and deploying these models to serve customers. E-commerce product search, much like web search, has always been a fertile area of AI innovation. Search algorithm team at Walmart Labs working on fascinating AI/ML problems like deep NLP based query understanding, improving relevance ranking of products, semantic matching of query item pairs using embeddings, visual search to enable search by image, interleaving based fast online experiments etc. As part of this team, you'll solve some of the most challenging and impactful problems in machine learning, information retrieval, natural language processing, computer vision or statistical measurement. Your work will be visible to hundreds of millions of customers and you will have a direct impact on the goals of the Fortune #1 company. If you speak and think machine learning then we want to talk to you. Come join our team and be part of this exciting journey.  In this role you will Build advanced machine learning models and improve the accuracy of those modelsCrunch terabytes of data and build models from large datasetDeploy the models in production where it will serve customers in real timeWork alongside senior machine learning researchers and define the right solution to implementPut on the hacker's hat quickly convert an idea to a demonstration Present your work to the internal and external community "}