{"jobID": "2831147700", "jobLocation": "Houston_TX", "jobTitle": "Data Architect Technical Lead", "companyRating": "3.6", "companyInfo": {"Website": "www.aerospace.org", "Headquarters": "El Segundo, CA", "Size": "1001 to 5000 employees", "Founded": " 1960", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "123000", "jobDescription": "Requisition ID: 41163All Locations: Houston, TX (Texas)  A trusted partner. A national resource. A leader in national security space. We are THE Aerospace Corporation. A team that takes pride in our readiness to solve some of the most complex technical challenges in existence. With challenges spanning government to commercial, you’ll have the unique opportunity to work on projects that are literally evolving our nation&apos;s space and launch capabilities. We all share a common passion and aspiration – to serve a mission much bigger than ourselves. When you join our team, you’ll be part of a rare collection of thought leaders and game-changing innovators. Are you ready to launch your career?ResponsibilitiesSUMMARY OF RESPONSIBILITIES The Human Exploration and Spaceflight Division will provide direct support to the EVA Management Office at NASA/JSC for EVA Data Integration (EDI) projects. Serve as a data analyst for data integration projects and initiatives, creating conceptual and logical data architecture used to generate physical data models and database schema.Research, promote and develop data architecture best practices.Prepare and present data architecture and concepts including Big Data architecture.Identify and document current and future state of data architecture.Work closely with associated teams to clarify and refine functional data requirement specifications.Research, present and accurately articulate benefits and goals of these technologies, such as Big Data technologies, NoSQL, data virtualization and data services.Provide technical advice on data architecture related trends, issues, and tools.Design and develop database solutions including security, back-up, and recovery specifications.Maintain database performance by identifying and resolving production and application development problems.Provide technical advice on data architecture related trends, issues, and tools.Establish new data standards and processes to support customer needs.Collaborate with various departments, architects, project managers and technical managers to provide estimates, develop overall implementation solution plan and serve as a lead, when required, to implement solutions.Create effective data models to support both RDBMS and NoSQL based databases.QualificationsRequired QualificationsBachelor’s degree in Computer Science, Computer Engineering or a related field with 10 years of experienceDemonstrated ability to learn and research advanced data technologies and concepts, learning new skills and emerging technology as necessaryAbility to create, maintain, update and enhance taxonomies, data dictionaries, data models and data standardsHands on coding experience and hands on experience with Big Data TechnologiesPreferred QualificationsKnowledge of semantic technologiesHands-on experience of search enginesTranscript Requirement Transcripts are required for this position. Additional Requisition DetailsSystem Job Title: PROJ ENGINEER Clearance Requirement: None Access: None Polygraph: None Relocation Available: Yes Employment Type: Regular Work Schedule: Full Time Company Statement The Aerospace Corporation has provided independent technical and scientific research, development, and advisory services to national security space programs since 1960. We operate a federally funded research and development center (FFRDC) for the United States Air Force and the National Reconnaissance Office, and support all national security space programs. We also apply more than 50 years of experience with space systems to provide critical solutions to technologically complex systems in such areas as communications, shipping, law enforcement, and cyber, among others.  From our inception, our highly skilled technical staff has focused on ensuring the success of every mission and developing the most effective and economic space-related hardware and software in the world. Our greatest asset is the technical expertise of our people. Our state-of-the-art laboratory facilities are staffed by some of the leading scientists in the world. Equal Opportunity Commitment The Aerospace Corporation is an Equal Opportunity/Affirmative Action employer. We believe that a diverse workforce creates an environment in which unique ideas are developed and differing perspectives are valued, producing superior customer solutions. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, gender, gender identity or expression, color, religion, national origin, sexual orientation, protected veteran status, or disability status.  You can also review The Equal Employment Opportunity is the Law poster and the supplement, as well as the Pay Transparency Policy Statement."}