{"jobID": "2809369444", "jobLocation": "Neptune_City_NJ", "jobTitle": "Posting Title Nurse Scientist, Nursing Education", "companyRating": null, "companyInfo": {"Website": "www.meridianhs.org", "Headquarters": "Muncie, IN", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job ID 2017-24389  Department CENTER FOR NURSING EDUC  Site CORPORATE  Job Location US-NJ-Neptune  Position Type Per Diem  Standard Hours Per Week Varies  Shift Day  Shift Hours Varied  Weekend Work As Needed  On Call Work On-Call As Needed  Holiday Work As needed  Overview  How have you impacted someone's life today? At Hackensack Meridian Health our teams are focused on changing the lives of our patients by providing the highest level of care each and every day. From our hospitals, rehab centers and occupational health teams to our long-term care centers and at-home care capabilities, our complete spectrum of services will allow you to apply your skills in multiple settings while building your career, all within New Jersey's premier healthcare system.  The Nurse Scientist designs and implements collaborative investigator initiated studies and/or projects. Acts as a consultant for interdisciplinary research projects and with the Center for Evidence Based Care. Supports grant acquisition and execution and conducts special projects. Responsibilities A day in the life of a Nurse Scientist at Hackensack Meridian includes: Conducting all phases of research and evaluationAssisting in data analysis and evaluation of the ITEAM HRSA GrantQualificationsCurrent and valid NJ Nursing License is requiredMaster's Degree is requiredDoctoral degree in nursing or a related field is requiredGrant writing and evaluation experience is requiredStrong research background is requiredExcellent mentoring skills requiredHighly motivated, creative individual If you feel that the above description speaks directly to your strengths and capabilities, then please apply today!  Options"}