{"jobID": "2802118369", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Quality / Data Governance Analyst (no 3rd party, no H1B", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The position listed below is not with LA Interviews but with New Leaf Consulting  LA Interviews is a private organization that works in collaboration with government agencies to promote emerging careers. Our goal is to connect you with supportive resources to supplement your skills in order to attain your dream career. Job Description No 3rd Party, Citizen or Green Card preferred.  This is a 4-6 month Contract to Hire position. After the contract if the SVP likes your performance you will be offered a full time position. We are looking for a Data Cleansing / Data Governance Analyst with Heavy experience in Financial industry to support a brand New data org is being established at a large LA based financial institution that's a direct, long term client of ours.  Basic Function  Responsible for setup, strategy, framework, and ongoing operations of data quality function and related activities. Establishes and promotes data accuracy and integrity by enrolling various stakeholders, data owners, data stewards and data custodians, data remediation, Quality scorecard and dashboarding. Basic Qualifications: Minimum 5-7 years of experience in Data Quality / data governance function setup, management and Operations.  Minimum 5 years of data profiling experience and root cause analysis in the financial and banking sectors  Minimum 3 years of experience with an enterprise data quality tool  Minimum 5 years of consulting and facilitation skills Responsibilities Draft data governance policies and work with various business teams and stakeholders to ensure they're followed  Setup the data quality management framework and operating model  Manage profiling and quality requirements for critical data elements  Manage remediation of issues  Define a multi-year roadmap to mature data quality capability  Define Quality metrics, target and indicators then ensure ongoing compliance with quality targets  Product data quality scorecard on a recurring basis  Manage data quality documentation and communication of findings  Promote a culture of high data quality to increase information accuracy and integrity  Automate data profiling, validation and scorecards  Collaborate with Data Governance and Policy lead  Apply"}