{"jobID": "2705950826", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Product Manager, Coverity Static Analysis Engine", "companyRating": "3.8", "companyInfo": {"Website": "www.synopsys.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1986", "Type": " Company - Public (SNPS) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Cadence Design Systems, Mentor Graphics, ANSYS"}, "estimatedSalary": "177000", "jobDescription": "Business TitleSenior Product Manager, Coverity Static Analysis Engine04-Apr-2018Requisition Number16274BRJob Description and RequirementsAbout Software Integrity Group (SIG), SynopsysSynopsys offers the most comprehensive portfolio of software security solutions in the market. We go beyond traditional testing services to help our clients identify, remediate, and prevent vulnerabilities in the applications that power their business. Our holistic approach to application security offers a balance of managed and professional services and products tailored to fit your specific needs. We don’t stop when the test is over. Our experts also provide remediation guidance, program design services, and training that empower you to build and maintain secure applications.Coverity is the Software Integrity Group's flagship product, recognized as a market leader in static analysis and used by thousands of developers around the world for both commercial and open source software development.To find out more about SIG, Synopsys check out https://www.synopsys.com/software-integrity.htmlRoleWe seek a Senior Product Manager for Coverity's static analysis engine. In this role, you will lead innovation at the heart of the product, where source code is analyzed to discover potential bugs and security vulnerabilities. In the fast-paced world of software development, you will determine the strategy for supporting new programming languages and frameworks You will strive to help developers find and fix the problems that matter the most while working closely with a team of product managers and R&D; engineers to deliver a competitive solution that is the cornerstone of the SIG portfolio. ResponsibilitiesYou will be responsible for driving and expanding our leadership in static analysis, setting the long-term vision and strategy, and communicating this strategy to all stakeholders. Day-to-day responsibilities will span the entire gamut of product management, including:• Understand customer problems through market research and on-going visits to customers and non-customers• Prioritize product requirements while balancing the needs of customers and stakeholders. Apply evidence-based and data-driven decision making• Able to say \"No,\" but explain why in terms that stakeholders will understand• Collaborate with engineers that are experts in a highly technical field• Communicate with customers, prospects, distributed teams, and industry experts• Champion your product vision and new features to our executive leadership teamQualifications and Experience• 3+ years of demonstrated success in product management, ideally in Enterprise Software• Experience as a software developer, and familiarity with software development trends• Excellent communication skills. You must be able to convey your thoughts eloquently in a variety of situations• B.S. degree in Computer Science, Engineering, or equivalent experience• Ability to travel up to 25%, some internationalNice to Have• Familiarity with one or more of these product markets: Software security, DevOps Tools, or Cyber Security in general• MBA or other business degree• Development tools experienceSynopsys considers all applicants for employment without regard to race, color, religion, sex, gender preference, national origin, age, disability, or status as a Covered Veteran in accordance with federal law. In addition, Synopsys complies with applicable state and local laws prohibiting discrimination in employment in every jurisdiction in which it maintains facilities. Synopsys Inc. also provides reasonable accommodation to individuals with a disability in accordance with applicable laws.Hiring LocationUSA - California - San Francisco Hire TypeEmployeeJob CategoryMarketing CountryUnited States "}