{"jobID": "2825884805", "jobLocation": "San_Antonio_TX", "jobTitle": "Senior Data Quality Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Purpose of JobManages and analyzes information using a variety of techniques and tools in alignment with USAA's Enterprise Information Standards. This role may be responsible for one or more information management function noted below:  Metadata includes defining and documenting data ensuring the information is understood. This may include working with project teams or support teams to define, redefine, or continue maintenance of the metadata.  Data Quality includes defining data quality rules ensuring data is measured and trusted. This may include working with project teams to define data quality requirements as well as ensuring ongoing assessments of data quality. Information Lifecycle Management includes archiving and purging of data to meet the needs of the business while reducing corporate risk.  Data Security and Privacy includes managing the security of data access as well as privacy of data sharing in compliance with external regulations and internal policies. This may include working with other departments to ensure compliance to GBLA, FCRA, PCI DSS, etc.  Master Data and Reference Data includes managing key corporate data to ensure the organization can manage its operations with accurate and consistent information.  We are currently seeking a talented Senior Data Quality Analyst for our San Antonio, TX location.  Job Requirements Leverages advance data management knowledge to support in one or many of the information management functions.Tasks may include any of the items noted below:Identify and implement process improvementsLead discussions with cross-functional teams.Align best practices and tools based on business needs.Support metadata repository maintenance, access requests, and proper metadata associationReview, validate, and record metadata and data quality information.Development of definitions, data quality rules, thresholds, and standard metrics of quality for data elements that support critical business processes.Development of controls to mitigate data quality risks including data quality plan development, monitoring data quality results, reports and dashboards, as appropriate.Identify and maintain data quality corrective action plans.Support compliance assessment process by reviewing and documenting failures from data quality compliance assessment checks.Support archiving and purging activities of dataDevelop archiving and purging strategies and processesSupport compliance assessment process by identifying and escalating items that may be a risk to the corporation.Manage Data Access security as neededSupport Privacy initiatives through analysis of sensitive dataEnsure sensitive data is accessed and shared in accordance to defined policies and processes.Recommend Master and Reference Data processes and procedures to align with Enterprise Policies and StandardsCreate and maintain reference data in accordance to defined processes and procedures.Manage quality and maintenance of master data as it is created Minimum Requirements Bachelor's Degree in a Business or Science discipline (4 years work experience in data management, data quality or business applications function or related experience can be substituted in lieu of a degree in addition to the minimum years of work experience required.) OrA Master's Degree in a Business or Science discipline or a related discipline OrA PhD in a Business or Science discipline or a related disciplineIf Bachelor's Degree, 6 or more years of experience in one or more information management functions below and any relevant tools: Metadata Data Quality including metrics, dashboards, advance knowledge of frequency and duplicate analysis, cross dataset dependencies, orphan `child data' rows, redundancy analysis, etc. Information Lifecycle Management including archiving, purging, content and document management, Master and Reference Data or Data Security & Privacy. OrMaster's Degree in a Business or Science discipline or a related discipline PLUS 4 or more years of experience in a data management/quality analytic function OrMaster's Degree and PhD in a Business or Science discipline or a related discipline and 3 or more years experience in a data management/quality analytic function Preferred Experience utilizing and supporting sources of P&C; analytical dataP&C; Financial (premium and loss) data expertiseIntermediate knowledge in Data Quality tools, SQL, SAS, BI tools or other analysis softwareIntermediate knowledge of relevant industry data quality practices & methods and demonstrated ability to connect data creation, transformation and transmission lifecyclesDemonstrates competency in: understanding and correcting data discrepancies; reading and translating data models; data querying; identifying data anomalies and root cause analysis; understanding and capability to explain Master Data ManagementDemonstrated ability to influence business decisions The above description reflects the details considered necessary to describe the principal functions of the job and should not be construed as a detailed description of all the work requirements that may be performed in the job.  At USAA our employees enjoy one of the best benefits package in the business, including a flexible business casual or casual dress environment, comprehensive medical, dental and vision plans, along with wellness and wealth building programs. Additionally, our career path planning and continuing education will assist you with your professional goals.  Relocation assistance is available for this position.SDL2017"}