{"jobID": "2834625224", "jobLocation": "San_Diego_CA", "jobTitle": "SCIENTIST", "companyRating": "3.9", "companyInfo": {"Website": "www.defense.gov", "Headquarters": "Washington, DC", "Size": "10000+ employees", "Founded": " 1947", "Type": " Government", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "84000", "jobDescription": " Duties Help  Help  Duties  Summary You will serve as a Scientist in the Intelligence Collections Tools Branch (Code 56250) of SPAWARSYSCEN PACIFIC SAN DIEGO CA.Learn more about this agencyResponsibilities Build, prune, and prioritize the backlog based on product and business priorities and dependencies with development teams.Manage requirements gathering process between external and internal stakeholders.Lead user acceptance testing for all new features and be responsible for final approval for all new features before acceptance into production.Support internal teams with specific questions, training and guidance during product deployment and ongoing training. Travel RequiredNot required Supervisory statusNo Promotion Potential4 Job family (Series)1550 Computer Science Requirements Help  Help  Requirements  Conditions of Employment Must be a US Citizen.Must be determined suitable for federal employment.Must participate in the direct deposit pay program.New employees to the Department of the Navy will be required to successfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit www.dhs.gov/E-Verify/. Qualifications In addition to the Basic Requirements for this position, your resume must also demonstrate at least one year of specialized experience at or equivalent to the GS-11 grade level or pay band in the Federal service or equivalent experience in the private or public sector. Specialized experience must demonstrate the following: Serving as a Product Owner for agile software development projects or teams, ensuring timely and effective delivery of software features and defect resolution.  Additional qualification information can be found from the following Office of Personnel Management website:  https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/#url=GS-PROF.  Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment.  Position has been designated as a Cyber IT/cybersecurity Workforce position in specialty area (641) as a condition of employment incumbents of this position are required to comply with the DON Cyber IT/CSWF program requirements of SECNAVM-5239.2 which include: Earn and maintain appropriate credentials from the Cyber IT/CSWF Qualification Matrix (described in SECNAV M-5239.2) associated with the specialty area and level commensurate with the scope of major assigned duties for the position to which you are assigned, and;Per SECNAVINST 1543.2, Cyber It/CSWF individuals shall participate annually in 40 hours of continuous learning (CL) activities to be documented in a current individual development plan (IDP) signed by both the employee and supervisor. This announcement is being used to recruit qualified individuals, under the Office of Personnel Management (OPM) Direct Hire Authority, authorized by 5 United States Code (U.S.C.), Section 3304 and 5 Code of Federal Regulations (CFR) Part 337, Subpart B. The Rule of Three, Veteran's Preference and traditional rating and ranking of applicants do not apply to the Direct Hire process. For more information on OPM Direct-Hire Authority, please review this link: http://www.opm.gov/DirectHire/factsheet.asp. EducationApplicants must meet the following positive education qualifications requirements of the Office of Personnel Management (OPM) Qualifications Standards Manual: Applicants must possess a Bachelor's degree in computer science or have a bachelor's or higher degree with 30 semester hours in a combination of mathematics, statistics, and computer science. At least 15 of my 30 semester hours were in a combination of statistics and mathematics that included differential and integral calculus."}