{"jobID": "2827035159", "jobLocation": "Arlington_VA", "jobTitle": "Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.csaconsulting.com", "Headquarters": "Mechanicsburg, PA", "Size": "201 to 500 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "57000", "jobDescription": "CSA Guidance Consulting has an immediate opening for a Data Analyst to provide direct support to the PEO-EIS Sea Warrior Program Office, PMW 240 onsite in Arlington, VA. The ideal candidate should demonstrate a keen ability to collect, analyze, build and present data in support of Sea Warrior program and performance metrics. Candidate will possess a strong knowledge of database development and management, reporting, and data analysis and synthesis. Candidate must a have a sharp eye for detail, be effective and efficient, and thrive in an environment of continual feedback. The ability to roll up your sleeves and get into the details as a team player as well as advanced verbal and written communication skills will be essential to success. Job Duties Mine, analyze, develop, and share clear data driven analytics to drive optimization and improvement of Sea Warriors program metrics, briefings and program studies for manpower, performance, etc.Build datasets and reports that resolve key insights about our customers and the program through internal and external data sources.Move beyond the day-to-day tasks so teams can self-service data and have their reporting automated and flexible.Translate vague business questions into specific data driven solutions.Translate complex data theories into learning opportunities.Assess the effectiveness and accuracy of new data sources and data gathering techniques.Coordinate with different functionals teams to implement models and monitor outcomes.Develop custom data models and algorithms to apply data sets.Develop documentation to support business process analysis.Coordinate with program project leads and stakeholders to derive analytical requirements.Build, publish customized interactive reports, visualizations and dashboards.Create use case diagrams to explain the flow of events and how different software systems interact with each other.Conduct workflow, process diagram and gap analysis to derive requirements for existing systems enhancements. Basic Qualifications 4+ years in a data-intensive role (or equivalent experience)Expert in at least one analytics language (ex. Python, R)Experience working with and creating data architecturesExperienced power user of MS Office Suite, including Excel and PowerPoint for doing business analysisBachelors degree in Computer Science, Information Systems, Data Science, Statistics, Applied Math or BA/BS in quantitative roleMinimum ACTIVE U.S. DoD SECRET clearance or Public TrustRequired SkillsKnowledge of advanced statistical techniques, data modeling techniques and concepts and experience with applicationsKnowledge of program and project management principles, practices, and theoriesSkill in effective verbal and written communicationSkill in performing program/project management discipline in DoD IT or commercial environmentSkill in analyzing and resolving complex technical and programmatic problemsAbility to look beyond the immediate deliverable, find the real data problem, and solve for itAbility to exercise leadership, organize work, and prioritize assignments in a high operational tempo environmentAbility to thrive in an environment of continual feedbackAbility to work independently (or collaboratively) and prioritize, under narrow time limitations, and/or with interruptions, to produce accurate results within quick turnaround timesAbility to think independently with minimal oversight, as well as demonstrate exceptional written and oral communications skillsApplicants may need to meet eligibility requirements for access to classified information; an active United States Department of Defense security clearance or the ability to obtain one may be required for this role.CSA Rocks! We are a rapidly growing consulting firm recognized for being one of America's Fastest Growing Companies, averaging an 81% increase in revenues for each of the past three years. So how do we do it? Its no secret, we owe the past 15 years of our success to our outstanding and ambitious team members. To support our hard working team, we offer an environment focused on learning and growth, an awesome benefits package, and opportunities to build a long and successful career.We are constantly on the hunt for talented, forward-thinking problem solvers with an energetic attitude and a strong work ethic to join our elite team of CSAers.Be a part of CSA do great things!CSA is a Federal Contractor and an Equal Opportunity/Affirmative Action Employer of Females/Minorities/Veterans/Individuals with Disabilities. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin or any other protected class.#cjpost"}