{"jobID": "2626543257", "jobLocation": "Houston_TX", "jobTitle": "Geospatial Data Management Business Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.oxy.com", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1920", "Type": " Company - Public (OXY) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $10+ billion (USD) per year", "Competitors": " Maersk Oil, ExxonMobil, Chevron"}, "estimatedSalary": "75000", "jobDescription": " The Geospatial Data Management Business Analyst (GDMBA) is a Houston-based member of the Data Management and Analytics organization (DMA), and a core member of the Geospatial Data Management Team.  The GDMBA will engage Function and Business Unit leadership and teams to identify improvement opportunities relating to geospatial data, lead the definition of business and project delivery requirements, and ensure delivery of critical, reliable and governed data to meet the needs of the business. The GDMBA works closely with Function and Business Unit leadership, project managers, geospatial data management subject matter experts, business users, and SDE Adminitrator/IT.  The GDMBA will be a key driver in designing and implementing data related management of change methods for ensuring all geospatial data produced or received in field offices are stored to the appropriate systems of record, and ensuring the that data is consumed by and easily available to the users in the field offices.  The GDMBA will provide input to SDE Administrator/IT role for creation of a geodatabase environment and to ensure proper users and roles have secure access to the data, and to provide support for editing of geospatial data. The GDMBA will partner with SDE administrator/IT to identify geodatabases performance requirements, data recovery and assist in any troubleshooting.  The GDMBA will play a key role in defining and delivering a future state strategy and roadmap for geospatial data management to enable material efficiencies and excellence in geospatial data usage, analysis and mapping. This will include identifying key issues, documenting findings and recommending improvement opportunities to leadership teams to address current state gaps. The GDMBA will also assist in documenting, reviewing, designing, developing, implementing and testing geospatial data management plans. The GDMBA will assist in creating and documenting the standards and workflows for geospatial data management and map creation. The GDMBA will assist in preparing training material and providing trainings to promote geospatial data management best practice utilization across the company. Key Responsibilities · Lead definition of standards and workflow for geospatial data acquisition, management, and distribution.  · Lead efforts to gather business community’s geospatial data needs, define and prioritize requirements, identify data elements requiring standardization that support business unit requirements and effectively communicate those needs to SDE administrator/IT.  · Responsible for translating business community’s geospatial data requirements into actionable project plans with well-defined success criteria, schedule, resources and milestones  · Lead DMA and BU geospatial projects to successful delivery ensuring stakeholder communications, and end-user trainings requirements are addressed  · Responsible for delivering supporting project artifacts including business, technical and functional requirements, use cases, workflow and documentation  · Serve as subject matter expert and primary point of contact for geospatial data management  · Partner with the SDE administrator role/IT in the design of enterprise geodatabases and data models for geospatial data management  · Responsible for defining geospatial flow of data as it comes into the company and associated workflows for the loading of both internal and external data into the enterprise geodatabases  · Responsible for developing and providing user training on geospatial data, standards and governance of that data  · Work with SDE administrator/IT in evaluation of potential software solutions for geospatial data management, acquisition and mapping, and provide data governance, structure and security requirements  · Responsible for ensure accurate and timely communication of daily operational and project related updates to business units and DMA leadership Education and Certifications · Bachelor of Science degree in Geoscience, Geography, Engineering or Computer Science  · Master’s degree preferred  · Geographic Information System certification desirable Experience and Critical Skills · Experience with developing and implementing workflows, guidelines and standards for geospatial data management.  · 3 years of experience in a business analyst role, translating complex issues into sustainable solutions  · 10 years experience and familiarity of geospatial data management best practices on the ESRI ArcGIS platform.  · 10 years experience in managing Environmental, Land, Operations, Subsurface, Geoscience, Facilities, and Midstream geospatial data.  · 10 years experience of working in a complex environment comprised of elements such as ArcGIS, FME and Python to extract, transfer and load geospatial data into geodatabases from EDM, OW, PODS, QLM, surveys and other vendor data with knowledge of appropriate QA/QC best practices.  · Advanced knowledge with coordinate reference systems and transformation.  · Advance knowledge of geodatabases and data model best practices  · Advanced knowledge of Oracle and SQL Server relational databases.  · Experience with Landmark DSG, Petrel or similar software packages used in O&G.;  · Ability to compose complex Structured Query Language (SQL) statements and procedures. Behavioral · Excellent written and verbal communication skills with ability to align geodatabases and geospatial objects with business requirements.  · Excellent people skills with ability to engage at all levels of the organization.  · Excellent problem solving skills with ability to troubleshoot geospatial data related issues.  · Ability to work on multiple projects independently, and collaborate effectively with the team under minimal supervision.  · Self-driven with a positive attitude and open to new ideas and methodologies."}