{"jobID": "2770703033", "jobLocation": "Dallas_TX", "jobTitle": "Sr Compliance Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.bswhealth.com", "Headquarters": "Dallas, TX", "Size": "10000+ employees", "Founded": " 1903", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Texas Health Resources, Seton Healthcare Family, UT Southwestern Medical Center"}, "estimatedSalary": "88000", "jobDescription": "The Sr. Compliance Data Scientist will have an ever increase need to use analytic tools to perform Audits, Investigation, and special projects assigned by Corporate.The Sr. Compliance Data Scientist can expect to perform the following:Abstraction of data large volumes of data from multiple internal and external sources, reconciling data inconsistencies. (15%)Interpreting data, analyzing results using statistical techniques, and providing data analysis related to division projects, research or development tasks, and strategic initiatives. (15%)Formulating data-driven solutions to the most demanding challenges and new algorithms to solve problems and build new tools to automate work. Recommending cost-effective changes to existing procedures and strategies. (10%)Performing routine and unplanned audits. Mitigation findings with recommendations and implementation of action plans in collaboration with the hospital departments. (15%)Ability to assess the financial impact of proposed queries and/or Audits. (15%)Serving as a liaison for research across the healthcare system. (20%)Educating internal and external clients though report results and presentations. (5%)Performs other position appropriate duties as required in a competent, professional and courteous manner. (5%)Performs other position appropriate duties as required in a competent, professional and courteous manner.The ideal candidate will have experience or training in internal auditing, billing/coding, healthcare reimbursement systems, risk management, regulatory compliance, and litigation support; Proficient in Microsoft Suite (Excel, PowerPoint, Word, Access, Visio); Experience with Statistical Software (i.e. R, SAS, Scala, Matlab, Python, Spark, Hadoop, and Tableau.); Familiarity with Crystal Reports, EPIC and Clarity reporting data warehouse; Must have working knowledge of healthcare terminology, design, study methods, risk assessment.Location/Facility - Dallas Texas - Bryan TowerFor more information on the facility, please click our Locations link.Specialty/Department/Practice - ComplianceShift/Schedule - Monday - Friday 8-5pmBenefits - Our competitive benefits package includes*:Immediate eligibility for health and welfare benefits401(k) savings plan with dollar-for-dollar match up to 5%Tuition ReimbursementPTO accrual beginning Day 1Note: Benefits may vary based upon position type and/or level.Baylor Scott & White Health (BSWH) is the largest not-for-profit health care system in Texas and one of the largest in the United States. With a commitment to and a track record of innovation, collaboration, integrity and compassion for the patient, BSWH stands to be one of the nation's exemplary health care organizations. Our mission is to serve all people by providing personalized health and wellness through exemplary care, education and research as a Christian ministry of healing. Joining our team is not just accepting a job, it's accepting a calling!QualificationsEducation - Bachelor's DegreeExperience - 5 yearsLicenses/Certifications - None"}