{"jobID": "2826019400", "jobLocation": "Chicago_IL", "jobTitle": "SAP Enterprise HANA Analytics - Manager (Technology)", "companyRating": "3.8", "companyInfo": {"Website": "www.deloitte.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1850", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $10+ billion (USD) per year", "Competitors": " EY, PwC, McKinsey & Company"}, "estimatedSalary": "108000", "jobDescription": " Are you looking for a career trajectory that few other organizations can offer in SAP? What about access to a high-quality portfolio of businesses and clients with opportunities to work across capabilities, industries, and geographies – in roles and on projects aligned with your SAP Technology skills? If this matches your interests and aspirations, Deloitte may be the right fit for you.  Work you’ll do  We provide our candidates with the opportunity to enhance their capabilities, knowledge and expertise with the emerging technology trends such as S/4 HANA, Cloud, Mobility and IoT by delivering exceptional results for our clients which ultimately enhances their growth, operations, productivity and efficiency.  Our Technology Capability focuses on both business and technology transformation needs of our clients. Additionally, we emphasize innovation and creativity in areas such as Cloud Infrastructure, Business of IT, Data Management and User Experience. A career that is forward looking while rewarding  The team SAP Our SAP team focuses on design, implementation, and on-going operations and maintenance of SAP applications and technology. Professionals will have hands-on access and exposure to the latest technologies and thought leaders.  We work with clients who want to improve their ability to react on digital world and enable scalability, remove performance barriers, enable innovation, and modernize core systems and reimagine their business with SAP digital solutions. Applications include SAP S/4HANA and Cloud (Hybris, Ariba, IBP, SuccessFactors, and SAP S/4HANA Public Cloud) across the following capabilities:  Finance  Supply Chain  Customer and Sales Operations  Technology (Mobility and User Experience, Cloud and Virtualization, Data Management and Analytics) Qualifications Functional/technical proficiency with at least 4+ full life cycle SAP implementations and 8+ years of industry and/or consulting experience  Experience implementing SAP HANA Analytics, SAP S/4HANA, HANA Cloud Platform (HCP) - Cloud for Analytics, Digital Board Room, and BOBJ.  Must have HANA on Cloud experience  Internet of Things (IoT), Altiscare Hadoop and Big Data experience a plus  Experience defining systems strategy, developing systems requirements, designing and prototyping, testing, training, defining support procedures and implementing practical business solutions under multiple deadlines  Adept at designing and implementing technology-enabled business solutions for clients as part of a high-talent team and as a team lead or Project Manager on at least 3+ full cycle implementations  Able to collaborate with clients, identify engagement follow-on opportunities and have a strong desire to excel and be committed to gaining exposure to multiple industries while further developing your career  Strong current hands-on configuration and design skills  Ability to travel 80-100% is REQUIRED  Bachelor’s degree or equivalent required  Master’s degree preferred"}