{"jobID": "2741484928", "jobLocation": "Woodland_CA", "jobTitle": "Data Engineer", "companyRating": "3.5", "companyInfo": {"Website": "www.dupont.com", "Headquarters": "Wilmington, DE", "Size": "10000+ employees", "Founded": " 1802", "Type": " Company - Public (DD) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "114000", "jobDescription": " Come join our team in the role of Data Engineer! The Opportunity: Corteva Agriscience™ has a rich  history of scientific discovery that has enabled countless innovations. We’re  looking for more people, in more places, to collaborate with us to create a  market-shaping, agriculture company with leading positions in seed  technologies, crop protection and digital agriculture.  We are looking for a data engineer to  partner with our analytics and data science team to build efficient data  pipelines that power insightful data products, dashboards and analysis. You  will be contributing to and supporting the efforts to improve our data  infrastructure and ensure that our end users can focus on analytic processing  rather than data inputs and infrastructure.  This position is located in Woodland, CA. In this role, you will:Be a trusted partner to the data science  team and data engineering team.Design, develop, own and evolve the data and  data pipelines that power our data platformEngineer robust, scalable, and efficient  data pipelines to process unstructured big dataEnable analytics by building usable data  sets that can power various analytic techniques like regression,  classification, clustering, deep learning…Be interested in working with multiple  sources of data from drones, satellites, imagery and IoT devices.Create end-to-end data solutions with field-deployed  hardware sensors streaming hundreds of gigabytes to the cloudCreate practical solutions with extensive hands-on  development with the latest hardwareQuickly engineer and improvise workable  proof-of-concept digital initiativesClearly articulate opportunities for  continuous improvements to existing systems with a clear understanding of  impact on business.Be a team player that everyone wants to work  with.Develop with a focus on comprehensive  testing and automation.Debug client/server applications and  troubleshoot integration issues.About you:You have expert level programming expertise  in PythonExperience working with cloud computing  technologies for working with big data (AWS is preferred)You are very comfortable with SQLNot afraid of trying new software,  techniques and approachesYou are good at taking vague requirements  and converting them into scalable data solutionsYou have exceptional communication skillsYou are passionate about data scienceYou have experience contributing and using  open source technology and librariesA passion for learning and working in a  collaborative team environment.A self-directed learner with a passion to  stay on the cutting edge of technology.Linux or OS X is your preferred operating  system.Nice to have:Experience working with and managing  geospatial data setsExperience building visualizations and  interactive data environments with scientific dataExperience using  DockerWe  are excited to announce that Corteva Agriscience™ is the name of the  new Agriculture Division of DowDuPont™. We are bringing together DuPont  Crop Protection, DuPont Pioneer and DowAgroSciences to create a  market-shaping, standalone agriculture company with leading positions in seed  technologies, crop protection and digital agriculture. We will work across the  global agriculture value chain to create a more efficient food system.  At Corteva Agriscience™,  we seek to enrich the lives of those who produce and those who consume. This  means we will help rejuvenate the agricultural ecosystem to support people and  the planet and to ensure progress for generations to come."}