{"jobID": "2707869572", "jobLocation": "Chicago_IL", "jobTitle": "Data Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.cars.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1998", "Type": " Company - Public (CARS) ", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "96000", "jobDescription": " Cars.com is looking for a Data Scientist (across levels) to join the core Machine Learning group. The ideal candidate will be positive, a self-starter, have a strong passion for data and be a visionary for machine learning solutions. This individual also needs to be creative and curious- constantly motivated to identify and understand the why. As a member of the team, you will work on a variety of projects where you will have the opportunity to apply advanced analytics, data modeling and machine learning concepts to create recommendations and solutions to solve business challenges. An ideal candidate would possess the ability to develop informed business logic, models and algorithms that help drive business strategies and decisions. Beyond the data, this individual will be expected to not only identify how to use data in an effective way, but also build a relationship with your internal clients and present to non-analytic minded individuals with a high degree of professionalism. This is an exciting opportunity to work with a great team of people and play a significant role in driving our business forward through data innovation. On a Typical Day You Will:Research and develop machine learning modelsCollaborate with business, product and engineering teams to define and design algorithmic solutions and frame AB tests to evaluate themWork with business partners to identify business opportunities and trendsAnalyze stream of data to understand consumer behaviorSupport all iterations of data driven product feature development from algorithm design, production implementation to experimentation and measurementPublish research articles on science and innovationsAbility to write, maintain and share codes using notebooksRequirements:An MS/PhD preferred in statistics, econometrics, machine-learning, applied mathematics or related quantitative field or relevant work experienceWe also consider BS + relevant work experienceStrong coding skills in python/R/scala/julia and knowledge of oop and functional programmingExperience with relational databases / SQLUnderstanding S3, HDFS, Hbase, or other non-relational DBProven track record of delivering scalable data science products2-3 years of experience in Personalization, Search, Operations Research or related fieldsAbility to present your work to executives in a concise and effective way"}