{"jobID": "2538314813", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": "4.1", "companyInfo": {"Website": "www.eaze.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Harborside Health Center, Leafly, Privateer Holdings"}, "estimatedSalary": "108000", "jobDescription": "As a Data Scientist at Eaze, you'll report to the Director of Analytics and work as the primary stakeholder and lead in the department's proactive data research.Responsibilities: Conduct fundamental AI/ML research, including supervised learning, predictive modeling, and real-time inferenceDesign prospective experiments and interpret the results to draw detailed and actionable conclusionsProactively investigate data to provide unseen insightsArchitect workflows with Lead Data Engineer that are maximally informativeDevelop metrics with the Lead Data Analyst that allows reactive analytics to be maximally informativeSkills we're looking for:2+ years previous experience working on analytics and/or data science teamsAn ability to model, drive, and analyze growth oriented experimentsA knack for business and how analytics can empower and drive the data-driven decision making processA passion for analyzing data and working on open ended problemsDemonstrated excellence in PythonDemonstrated excellence in SQLStrong communication and organizational skillsSelf-motivated with the ability to work independentlyAbout EazeEaze (eaze.com), the leading cannabis technology company, is on a mission to help people enjoy the moment through convenient access to high quality marijuana products. Founded in 2014, the companys technology enables superior customer choice and convenience by connecting product brands, dispensaries and doctors to customers on demand. With over 300,000 users in California, Eaze has unprecedented access to big data regarding cannabis market trends and consumer preferences which it shares with industry and media partners through its Eaze Insights Program."}