{"jobID": "2816309407", "jobLocation": "Midland_TX", "jobTitle": "Business Intelligence and Analytics Manager", "companyRating": "5.0", "companyInfo": {"Website": "www.concho.com", "Headquarters": "Midland, TX", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "89000", "jobDescription": " Title  Business Intelligence and Analytics Manager  Location  Midland, TX  Job Summary  The Business Intelligence and Analytics Manager will be key member of the IT organization reporting directly to CIO. He or she will be responsible for managing big data and advanced analytics initiatives, data integration/engineering, and business intelligence and data warehousing. The position requires building strong technical hands-on skills and experience as well as establishing close business relationships across the enterprise. Working closely with business stakeholders, you will establish and drive a long-term BI strategy and roadmap and manage increasing demand for advanced analytics. Additional key accountabilities include:Support several IT disciplines that are essential to the day to day business operation for ConchoServe as a key driver on various new technology initiatives and programs on behalf of IT organization, including big data, machine learning and AIConduct research into new BI and analytical solutions including big data analytics, PowerBI, etc.Serve as strong advocate to improve analytical capability across the organizationCommunicate with various business areas and to gather and prioritize their business requirementsSupport various reporting and BI solutions (Spotfire, BPC, SQL Server Reporting Services, Operation and AFE Dashboard)Manage application and data integration platforms (Informatica, Streamset, SQL Server Integration Services), totaling 120+ interfacesManage the full life cycle of development/reporting/integration projects: planning, design, develop, testing and rolloutManage solution providers, define sourcing approach and manage the providersUnderstand business demands and manage the budget for BI related initiativesManage a team of three and provide guidance Education/Experience Required Bachelor's degree in computer sciences, or similar technical discipline7+ years of previous oil and gas industry experiencePrevious management experience and successfully leading a team of direct reportsProven track record of effectively leading and managing employees, managing performance, setting goals for team/individuals and provide mentoring.Experience with big data technologies and advanced data analytics (Spotfire, SAS, Cloudera) a strong plusDemonstrated expertise in the related IT technical domains including Spotfire, Informatica, SQL ServerProject management experience, including: delivering implementation projects for new solutions in complex environments with many involved parties (technical disciplines, IT, software vendors, outsourcing partners etc.)Must be able to work in the United States indefinitely Education/Experience Preferred Strong relationship building and communication skills a mustKnowledge of the following applications preferred: Enertia, Geographix, Wellview, OFM, Aries, and SharePoint COG Operating LLC uses e-Verify to confirm eligibility to work in the United States. We are proud to be an EEO/AA employer Minority/Female/Disabled/Veteran. We maintain a drug-free workplace and perform pre-employment substance abuse testing. NOTICE TO THIRD PARTY AGENCIES Please note that COG Operating LLC (\"Concho\") does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed Recruitment Fee Agreement, COG Operating LLC (\"Concho\") will not consider or agree to payment of any referral compensation or recruiter fee. In the event a recruiter or agency submits a resume or candidate without a previously signed agreement, COG Operating LLC (\"Concho\") explicitly reserves the right to pursue and hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of COG Operating LLC (\"Concho\").SDL2017"}