{"jobID": "2737771501", "jobLocation": "Chicago_IL", "jobTitle": "Quantitative Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.nb.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1939", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Fidelity Investments, BlackRock, Putnam Investments"}, "estimatedSalary": "102000", "jobDescription": "Summary: We are seeking a highly motivated Quantitative Analyst to join our Fixed Income Division in Chicago. This position will focus on Quantitative Analysis, Portfolio Analysis & Modeling, to provide quantitative research, analysis and support to the Head of Multi-Sector Fixed Income. Responsibilities:Assist portfolio managers to build models and platforms, monitor portfolio risk and performance for Liability Driven Investment strategies.Conduct generalist quantitative research using demonstrable market knowledge and intuition in multi asset classes, including fixed income, equity, TIPS etc. research will be academic and buy-side oriented.Solve real world portfolio management problems in a largely autonomous fashion while collaborating with the Multi-Sector Fixed Income and other team members.Translate academic and/or buy-side research into theses that are implementable and actionable.Conduct statistical analysis and develop sophisticated quantitative financial models used for asset allocation and security selection.Perform fixed income portfolio optimization, performance and attribution analysis, and portfolio risk (coherent measures) analysis.Stay connected and current with academic finance research and developments.Requirements:Master's degree in Financial Mathematics, MBA with quantitative focus or related quantitative field or foreign equivalent.Knowledge and experience in fixed income, LDI and equity markets.Strong statistical and applied mathematics grounding.Experience developing quantitative models to evaluate the expected return and risk associated with portfolio management decisions is a plus.MATLAB, SQL and VBA programming experience. Neuberger Berman is an equal opportunity/affirmative action employer. The firm and its affiliates do not discriminate in employment because of race, color, religion, gender, national origin, protected veteran status, disability, age, citizenship, marital or domestic/civil partnership status, sexual orientation, gender identity or expression or because of any other criteria prohibited under controlling federal, state or local law. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact onlineaccommodations@nb.com."}