{"jobID": "2650451419", "jobLocation": "Washington_DC", "jobTitle": "General Manager - Washington D.C.", "companyRating": "3.5", "companyInfo": {"Website": "www.roti.com", "Headquarters": "Chicago, IL", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Restaurants, Bars & Food Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": "Essential Functions: Identifies talent both internally and externally. Interviews, hires and on-boards new Team Members, with the intention of finding future leaders. Ensures a deep bench of talent for current and future growthTrains and develops Team Members through one-on-one discussions, performance evaluations, and shoulder-to-shoulder education so they excel in their current role and are prepared for future career opportunitiesMotivates, inspires, and constantly challenges the team to achieve at their highest levelRecognizes and rewards excellent performance. Quickly improves, or removes, low performers through coaching and documentationUnderstands that everyone’s success is elevated by the success of those around them and creates a culture where people act accordinglyRemains highly visible on a daily basis, managing and supporting all members of the teamPromotes excellent guest service and handles guest concerns in a prompt and professional mannerMaintains restaurant cleanliness in accordance with company standards. Assures sanitation standards are maintained in accordance with OSHA regulations and local health and safety codesEnsures restaurant equipment is properly maintained and safely operatedEnsures that safety and security standards are emphasized and adhered to, and that Team Members are trained in appropriate responses to unsafe situationsWorks closely with Catering Team to establish catering and delivery programs and ensure catering orders are executed to perfectionExecutes marketing and promotional programs to build restaurant salesMaintains budgets and cost controls with regard to food, beverage and labor goalsConsolidates operations reports into a weekly summary for review, analysis and planning purposesEffectively communicates changes to restaurant team including changes to menu, policy, and Team Member benefitsWrites timely schedules that meet the financial needs of the business while ensuring an excellent guest experienceCompletes all administrative responsibilities per company guidelinesQualifications/Skills:Ability to work in a fast-paced environment.Ability to develop positive working relationships with all restaurant personnel, including executive leadershipAbility to read, write and speak EnglishPossess exceptional customer service skillsPossess strong organizational, administrative and leadership skillsMust be passionate about People Development, where future leaders are identified and mentored to enable the“Growth of our People”Must have a positive attitude and ethics that support Roti’s values and culture.Must be familiar with Federal and State employment and safety regulationsMust have basic knowledge of Microsoft Word, Excel, Powerpoint and OutlookMust maintain Food Safety certification as required by local municipalityMust be at least 21 years of age, hold a valid driver’s license, maintain an acceptable driving record in accordance with company policy and retain auto insurance coverage as required by state lawEducation/Experience Required Required 6 months experience as an Assistant Manager with Roti Mediterranean Grill and 3 years total Assistant Management experience. Physical Requirements: General Managers are required to work a minimum of 50-55 hours per week. The responsibilities of this position require the General Manager to be on their feet during hours worked, unless on break or in the office working on the computer or on other paperwork-related tasks. The work area includes: food, ovens, mixers, food processors, knives, slippery floors, and, at time, high temperatures. It is a hands-on, non-smoking, restaurant setting involving constant interaction with guests, team members, managers and vendors. The ability to effectively communicate, identify food quality, tolerate heat and walk-in freezers, lift and/or maneuver up to 50 pounds, and stand/walk on hard surfaces during the course of the work day. The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this position. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.EOE\"We Participate in E-Verify\""}