{"jobID": "2754799920", "jobLocation": "Dallas_TX", "jobTitle": "Data Science Engineer/Big Data Software Developer", "companyRating": "3.2", "companyInfo": {"Website": "www.walmartlabs.com", "Headquarters": "San Bruno, CA", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, eBay, Google"}, "estimatedSalary": "108000", "jobDescription": "Position DescriptionDrives the execution of multiple business plans and projectsEnsures business needs are being metLeads system design process and solution developmentMaintains and advances industry expertiseMentors information technology AssociatesPromotes and supports company policies, procedures, mission, values, and standards of ethics and integrityProvides direction and coordination between large projects and the technical execution planProvides supervision and development opportunities for associates Minimum QualificationsBachelor s degree in Information Technology, Computer Science, or related field and 6 years experience in information technology or related field within the last 10 years OR 8 years experience in information technology or related field within the last 10 years. Additional Preferred Qualifications1 year experience designing technical solutions using object-oriented design concepts. 1 year experience integrating new technologies into existing technology portfolio. 2 years experience leading cross-functional teams. 3 years experience creating and presenting technical strategies and technical solution recommendations. 3 years experience designing and implementing technical solutions. Company SummaryWhat started small, with a single discount store and the simple idea of selling more for less, has grown over the last 50 years into the largest retailer in the world. Today, nearly 260 million customers visit our more than 11,500 stores under 72 banners in 28 countries and e-commerce sites in 11 countries each week. With fiscal year 2016 revenue of $482.1 billion, Walmart employs 2.3 million associates worldwide 1.5 million in the U.S. alone. Its all part of our unwavering commitment to creating opportunities and bringing value to customers and communities around the world."}