{"jobID": "2794771314", "jobLocation": "Chicago_IL", "jobTitle": "Sr Analyst, Market Data", "companyRating": null, "companyInfo": {"Website": "www.northerntrust.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1889", "Type": " Company - Public (NTRS) ", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Under general supervision (but works independently most of the time) the team is responsible for the delivery of global market data services. Northern Trust leverages the use of financial market data to support many of our products and processes globally. NT?s business units rely on a variety of pricing, data, information and tools to support clients, investment decisions, custody, outsourcing (IOO) and fund operations on a daily basis to name a few. The team works across all classes of financial instruments including equities, fixed income, currency, derivatives, research and news.Northern Trust has centralized the global management of market data, brokerage, clearing and sub custody within the Enterprise Market Data team. This team is responsible for managing enterprise use of these services including but not limited to sourcing, global vendor management, entitlements of services, inventory of users, cost allocation, invoice validation and processing, supplier reporting and supplier audits amongst other responsibilities. The team is also very engaged with our Clients in services such as RFP responses, Industry SME sessions, presentations, onboarding and redistribution validation to name a few. 1. Perform monthly/quarterly/annual reporting process, preparing analyses and reports of results relative to prior year, prior month, and/or Plan focusing on key business factors driving financial performance. 2. Support the team leaders during updating of any process documents.3. Carries out complex activities with significant financial, vendor, and/or internal business impact4. May have direct interaction with various levels in Management5. Able to serve as a key subject matter expert and mentor to other more junior level employees6. May manage daily operational activities and supervise day-to-day work of junior level employees (but not a formal management role)7. More technically sound in area of expertise and has broader knowledge of other market data areas8. Delivers a work product that requires less revision9. Able to facilitate discussions and reach decisions ? A College or University degree and/or relevant proven work experience is preferred. Related Industry qualification is preferred.  ? Three to five years prior work experience and should be in the current process for more than 18 months is preferred. ? Excellent oral and written communication skills are required  ? In-depth Functional / Industry Knowledge is required  ? Highly flexible and adaptable to change  ? Technical skills / systems knowledge is required"}