{"jobID": "2812062454", "jobLocation": "Princeton_NJ", "jobTitle": "Sr. Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.innovativeinfotech.com", "Headquarters": "Princeton, NJ", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Data Scientist  NYC/Princeton, NJ  Long Term Job Description: Airisdata Inc., is a startup system integration company focused primarily on Hadoop data engineering and machine learning services.  We take pride in our team of passionate data engineers, machine learning specialists, and data administrators who build, run, and deploy data solutions on large scale Hadoop clusters.  Job Challenge  Are you comfortable analyzing complex, high volume, multi-dimensional data that drive business decisions?  Are you ready to derive predictions and recommendations from unstructured, structured, and streaming data sets?  Do you have the tenacity to identify and optimize the right machine learning and graphing algorithms to solve a business problem?  Can you orchestrate a solution and collaborate with business data experts, customer data scientists, and engineering teams? Requirements M.S in Computer Science, Statistics, Machine learning, Applied Math. PhD preferred  2+ years in ML algorithmic design, predictive modeling, and recommender systems.  Experience implementing Regression, Bayesian, Decision Trees, Random Forests, SVM, Clustering, Instance based methods, Association Rules, Dimensionality Reduction etc.,  Strong hands-on programming experience in R, Python, Java (Scala a plus)  Experience using R and Python based ML libraries  Experience using Apache Hadoop 2.0 ecosystem  Experience using Apache Spark 2.0 (core, SQL, ML) a huge plus  Top-down thinker, excellent communicator, and great problem solver  Nice to have  Certified in Apache Spark and Apache Hadoop  Familiarity with deep learning tools and technology"}