{"jobID": "2735467112", "jobLocation": "Mountain_View_CA", "jobTitle": "Machine Learning Platform Engineer - Samsung Pay Data Science Team", "companyRating": "2.6", "companyInfo": {"Website": "www.sra.samsung.com", "Headquarters": "Mountain View, CA", "Size": "1001 to 5000 employees", "Founded": " 1988", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Sony, LG Electronics, Nokia"}, "estimatedSalary": "155000", "jobDescription": " This is a great opportunity for a talented and hard-working software engineer to join and build machine learning based products for millions of users of the worlds best-selling mobile devices. The Samsung Pay Data Science team is aimed at representing Samsung's leadership in production-scale machine learning systems. Sitting on top of extremely large and diverse data, the team features a unique seamless synergy between product development and cutting-edge research. The teams research areas include personalized recommendation, deep learning with applications on NLP, user profiling and data-driven user growth strategies. As a young team, we provide precious experience of learning how to build and maintain large-scale machine learning products from scratch and valuable opportunities of working with various stakeholders.  Come join the Samsung Pay Data Science team and help us define and develop the future role of Samsung in the machine learning domain! Responsibilities:Technical innovations in the design, development and implementation of data pipelines and platformsOptimize the existing machine learning platforms/architectures and algorithm implementationsResearch the state-of-the-art technology stack for machine learning applicationsExperiment with scalable machine learning architectures/platform tailored to our environmentWork with other technical engineers and data scientists within SamsungCreate quick prototypes and proof-of-conceptsDesign experiments, perform hypothesis testing, and build various data modelsExperience Requirements:Masters or PhD. in Computer Science, Software Engineering or Machine Learning1+ year of industrial experience in designing and implementing machine learning models/ algorithmsHands-on experience with Deep Learning Frameworks (e.g. TensorFlow, PyTorch)Experience with ETL and big data tools (e.g., Hadoop or Spark)Strong problem modeling and solving capabilitiesSolid theoretical background in machine learning/data miningStrong programming skills with Java/PythonStrong hands-on understanding of data structures and algorithmsExcellent communication and interpersonal skillsPreferred Experience Requirements:Amazon Web ServicesExperience with Spark, Kafka, Hadoop, Hive, PigNoSQL queries and databases, such as MongoDB, Elasticsearch, Cassandra and CouchbaseExpertise in Linux Samsung is an EEO/Veterans/Disabled/LGBT employer. We welcome and encourage diversity as we strive to create an inclusive workplace."}