{"jobID": "2830571261", "jobLocation": "Washington_DC", "jobTitle": "Scientist, Enterprise & Data Analytics", "companyRating": "3.2", "companyInfo": {"Website": "www.comcastspotlight.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1997", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "51000", "jobDescription": " Scientist, Enterprise & Data Analytics Washington, DC Requisition #: 182646Job Type: Full TimeLocation: Washington, DCTeam: OtherPub Date: 6/27/18Job Summary:Responsible for leveraging internal and external data to provideinsights and information which supports a facts-based decision makingprocess. Provides input into strategy, analysis methods, and toolselection. Acts as a key contributor in a complex and crucialenvironment. May lead teams or projects and shares expertise.Employees at all levels are expect to:- Understand our Operating Principles; make them the guidelines for howyou do your job- Own the customer experience-think and act in ways that put ourcustomers first, give them seamless digital options at every touchpoint,and make them promoters of our products and services- Know your stuff-be enthusiastic learners, users and advocates of ourgame-changing technology, products and services, especially our digitaltools and experiences- Win as a team-make big things happen by working together and beingopen to new ideas- Be an active part of the Net Promoter System-a way of working thatbrings more employee and customer feedback into the company-by joininghuddles, making call backs and helping us elevate opportunities to dobetter for our customers- Drive results and growth- Respect and promote inclusion and diversity- Do what's right for each other, our customers, investors and ourcommunitiesCore Responsibilities:- Lead a small group of less experienced team members on analyticalprojects or on cross-functional teams. Frequently serves as team lead onmultiple projects, mentor and train junior team members.- Review and approve methodologies used for advanced analysis projects(predictive models, clustering/segmentation, etc.) by junior teammembers and others- Leads complex projects using wide breadth of data sciences andadvanced techniques.- Manages the review, revision and maintenance of existing internalprocedures to ensure quality and efficiency.- Determine appropriate methods, prove viability of selected method andeducate internal teams as to the analytical foundation.- Uses analytical rigor and statistical methods to analyze large amountsof data, extracting actionable insights using advanced statisticaltechniques such as data analysis, data mining, optimization tools, andmachine learning techniques and statistics (e.g., predictive models,LTV, propensity models).- Leads large scale projects that utilize online & offline data,structured & unstructured data, set top box data(media/behavioral/attitudinal) to build customer centric models andoptimization tools.- Consistent exercise of independent judgment and discretion in mattersof significance.- Regular, consistent and punctual attendance. Must be able to worknights and weekends, variable schedule(s) as necessary.- Other duties and responsibilities as assigned.Job Specification:- Master's Degree- Economics, Statistics, Mathematics, Decision Science, OperationalResearch, Computer Science, Engineering, or related field-- Generally requires 7-11 years related experience.Comcast is an EOE/Veterans/Disabled/LGBT employer"}