{"jobID": "2833536225", "jobLocation": "Los_Angeles_CA", "jobTitle": "Senior Applications Analyst - Data Warehousing - FT 8 Hour Days (Exempt)", "companyRating": "4.3", "companyInfo": {"Website": "www.usc.edu", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " 1880", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "72000", "jobDescription": " The Applications Analyst, Senior will work with external vendors, system owners, community partners, contractors and Health Science Campus leadership to design, develop, implement and make operational information systems. This incumbent will Identify and document information technology design specifications based on analysis/assessment of user needs and generate need-gap analyses. This person will use expert knowledge to generate and develop system scope and objective, analyze and evaluate existing or proposed systems and devise or modify procedures to solve problems using data processing. The Applications Analyst, Senior will work independently on complex system activities and serve and project manager. Incumbents in this role will also provide training, work review and may serve as leads to staff. Minimum Education:Bachelors Degree in related field or equivalent experience or certifications.Minimum Experience/Knowledge:5 or more years of related experience including system design, documentation, maintenance, upgrades and troubleshooting.Healthcare experience strongly preferred.Required License/Certification:Fire and Safety Certification. If no card upon hire, one must be obtained within 30 days of hire, and maintained by renewal before expiration date. USC is an equal opportunity, affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other characteristic protected by law or USC policy. USC will consider for employment all qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring ordinance. We provide reasonable accommodations to applicants and employees with disabilities. Applicants with questions about access or requiring a reasonable accommodation for any part of the application or hiring process should contact USC Human Resources by phone at (213) 821-8100, or by email at uschr@usc.edu. Inquiries will be treated as confidential to the extent permitted by law.  Read USC's Clery Act Annual Security Report  Required Legal Notices  Certain positions are subject to background screening  If you are a current USC employee, please apply to this USC job posting in Workday by copying and pasting this link into your browser:  https://wd5.myworkday.com/usc/d/inst/1$9925/9925$19827.htmld"}