{"jobID": "2827288092", "jobLocation": "Houston_TX", "jobTitle": "Business Analyst - Data Analysis", "companyRating": null, "companyInfo": {"Website": "www.decideconsulting.com", "Headquarters": "Houston, TX", "Size": "1 to 50 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Business Analyst - Data Privacy Job Purpose: The business analyst will work with the business units to create process and data flow documentation. Work in coordination with IT teams and use data discovery tools to locate personal data, determine its relevance, and identify any associated business processes. Help determine business process future state in order to support long term operational success and regulatory compliance. Responsibilities and Associated Duties: Engage with business teams to understand processes that involve personal data  Elicit information using interviews, document analysis, requirements workshops, surveys, business process descriptions, use cases, scenarios, task analysis and workflow analysis  Act as a liaison between business units, management, IT and the project team  Conduct process mapping, data discovery and data flow analysis  Identify any process specific data retention or processing requirements  Document data entry points, storage, inter-system exchanges and external transfers  Design and develop dashboards and metrics to improve understanding of business processes  Advise on ways of reducing data foot print and improving data management capability  Knowledge and Skill Requirements  Bachelor's degree in MIS, Computer Systems, Business Management, or related area or equivalent combination of education and work experience  5+ years of business process analysis  Experience working in Enterprise Data Management, Data Analysis, Data Privacy, Regulatory and Compliance preferred  A proven track-record of business process mapping and data modelling  Familiarity with European Union data privacy requirements, the former U.S. Safe Harbor program or similar regulations preferred  Good understanding of how software, data and business processes work together  Strong experience in working well with cross-function teams in a global organization  Ability to understand IT and business architectural diagrams and models  Excellent communication and documentation skills"}