{"jobID": "2802649833", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Analyst - Capital Markets", "companyRating": null, "companyInfo": {"Website": "www.fundingcircle.com", "Headquarters": "London, United Kingdom", "Size": "501 to 1000 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " LendingClub, OnDeck, Bond Street"}, "estimatedSalary": null, "jobDescription": " The Capital Markets Operations team is seeking a motivated and analytical Senior Analyst to support institutional investor operating activities. In this role youll be responsible for handling day-to-day operations activities, project managing ad-hoc issues, and interacting closely with the sales, payments, product and technology teams. As a Senior Analyst on our Capital Markets Operations team you will...Interface directly with institutional investors on daily basis, providing timely responses and support for their inquiriesExecute and streamline day-to-day operating activities related to cash management, investor onboarding, creating and sending monthly statements, etc. for all institutional investorsBe responsible for scoping and troubleshooting larger ad-hoc operational issues as they occurContribute to the development of external systems used by investors by working closely with the product, technology and sales teamsGain an in-depth knowledge of internal payments and loan processing systemsYouve been there and done thisBachelors degree in finance, business administration, economics, or other quantitative disciplineBetween 3-5 years of work experience in the finance/investments industry (preferably in an operational or sales support capacity)Comfortable working with data sets (preferable working with basic queries)Passion for delivering a best in class investor experienceHigh attention to detailSelf-starter with strong interpersonal and communication skillsEnthusiasm for a high-paced, team-oriented start-up environmentIdentification with our mission, to build a better financial worldAlignment with our core values: Think Smart, Make It Happen, Be Open, Stand Together, Live the Adventure To learn more about our work environment, culture, and perks, visit: https://www.fundingcircle.com/us/careers Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.  Funding Circle provides equal employment opportunity to all individuals regardless of their race, age, creed, color, religion, national origin or ancestry, sex, gender, disability, veteran status, genetic information, sexual orientation, gender identity or expression, pregnancy, or any other characteristic protected by state, federal or local law.  #LI-SC1"}