{"jobID": "2824899412", "jobLocation": "Stockton_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.judge.com", "Headquarters": "Wayne, PA", "Size": "1001 to 5000 employees", "Founded": " 1970", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Adecco, Kforce"}, "estimatedSalary": null, "jobDescription": " Our client is currently seeking a Data Analyst in Stockton, CA. This role will require experience with Oracle r12 OR Oracle iProcurement. This opportunity is for a 6+ month contract and the hiring manager is looking to set up interviews immediately. Please submit all qualified resumes to dglodek@judge.com The Data Analyst will have the following responsibilities:Responsible for data analytics and executing strategic sourcing initiatives in collaboration with Company's Global Procurement organization.Completes savings analysis to ensure savings targets can be achieved through strategic sourcing initiatives.  Two analysts are required to conduct data deep dives and to challenge assumptions in order to identify, refine, and confirm integration savings opportunities through cost model comparisons and bottom-up planning.Qualifications & Requirements:In addition to core sourcing analytics skills, these analysts must be experienced with Oracle R12 and Oracle iProcurement systems in order to conduct this work.Judge Group Job Order ID: 573901 Salary: Open  Company Description:Working at the crossroads of people and transformative technologies, The Judge Group delivers innovative business solutions – powered by top talent – to help organizations reach their strategic goals and realize opportunities now and in the future.  The Judge Group is a leading professional services firm specializing in technology, talent, and learning solutions. Our services are successfully delivered through a network of more than 35 offices in the United States, Canada, China, and India. The Judge Group serves more than 40 Fortune 100 companies and is responsible for the placement of more than 4,500 professionals annually across a wide range of industries. To learn more, visit www.judge.com."}