{"jobID": "2776089331", "jobLocation": "Lansing_MI", "jobTitle": "Regional Milk Quality Coordinator", "companyRating": "3.8", "companyInfo": {"Website": "www.organicvalley.coop", "Headquarters": "La Farge, WI", "Size": "501 to 1000 employees", "Founded": " 1988", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "53000", "jobDescription": "ApplyEmail Job Category Farmer Support/Pools Position Regional Milk Quality Coordinator Location Lansing, MI Full Time Yes Job Duties This operational position is responsible for providing CROPP member farm milk quality support in the Great Lakes Region of the United States, including Northern Indiana, Michigan and Illinois. Work includes day-to-day support in the area of responsibility as well as milking system troubleshooting at member farms with difficult or chronic issues. Employment based out of employee’s residence home office proximity the supported region. Essential Duties and Responsibilities ​Producer contact relating to raw milk quality issues.Work with producers on the WIP (Work Improvement Program).Regulatory inspection and sampling on CROPP-handled farmsMilking equipment & system comprehensive evaluation and troubleshooting.Coordinate producer and load milk quality samples to lab.Maintain conventional milk handler relationships and coordinate support by milk handler field staff for member farms.Assist producers in preparing for IMS Surveys & FDA Ratings.Assist Regional Pool Managers as needed.Assist Production for plant contact. Additional Duties and Responsibilities ​Training as directed by CROPP Cooperative and supervisory personnelOversight and reporting of hauler performance issuesCoordination with federal, state and regulatory authorities as neededCoordination with handlers, laboratories and plants not associated with Organic Valley (i.e., spring flush conventional deliveries) when needed Knowledge, Skills and Abilities ​Milking equipment function and design working with a variety and types of milking systems required.Knowledge of milk quality issues and experience with on farm trouble shooting of high bacteria and somatic cell problems required.Knowledge of Grade A milk regulatory rules and regulations required.Certified Milk Inspector license preferred.Post high school education or equivalent experience preferred.Education or experience in microbiology or food science preferred.Strong knowledge of Microsoft Office (Excel, Word, Access, Outlook).Excellent written and verbal communication skills required.Ability to travel to other producer locations as necessary."}