{"jobID": "2829834584", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior/Data Analyst, Marketing Data & Intelligence (North America", "companyRating": "3.3", "companyInfo": {"Website": "www.wework.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "129000", "jobDescription": " We're hiring a Senior Data Analyst to join the Marketing Data & Intelligence team in the Marketing organization at WeWork's headquarters in San Francisco.  Who should we be targeting and how can we provide the optimal strategies to reach these users? How do we optimize the marketing message to achieve performance goals? How can we use data to increase consumer value? Where can we identify additional opportunities for growth? How can we maintain consistent infrastructure globally as we rapidly grow?  These are just some of the questions that a senior data analyst on the Marketing Intelligence team at WeWork will answer. The ideal candidate should be highly analytical and have a strong technical skill-set, with solid experience in a data extraction language (such as SQL) and experience working in the Salesforce environment. Responsibilities: Work cross-functionally with west region executives, marketing, member experience, real estate, sales ops and finance to analyze data, identify trends, implement optimization Leverage predictive analytics to support demand pipeline forecast, by segment, product and territory/market, to support 80% occupancy rate for new building openings Establish regional KPIs and benchmarks for growth acquisition and across multiple channels, including paid search/social, display, mobile, email marketing, and OOH campaigns Establish measurement framework for pilot programs on member experience, via both qualitative studies and quantitative approach, including using analytics to measure the impact of member interactions and satisfaction Execute accurate test design and evaluation - including sampling techniques and determining statistical significance Own the reporting and dashboards of west region, with rigorous quality control and timely delivery Implement standard processes, data infrastructure, operational best practices for west region Develop recommendations for changes to investment and marketing strategy, optimize the efficacy of marketing spend based on quantitative analyses Execute on data strategy and implement technology to support hyper-segmentation, account-based marketing, and multi-touch attribution Lead the training processes on a range of marketing analytics and BI tools, and foster the data-driven culture across teamsQualifications: Strong quantitative, analytical, and problem solving skills 4+ years experience within business/marketing/data analytics Flexibility and ability to adapt to evolving business objectives Expertise in a query language such as SQL or equivalent Experience working with various digital advertising platforms, including but not limited to AdWords, Facebook, Google Analytics Organized with strong problem solving skills, attention to detail, communication skills, and time management abilities Ability to manage multiple projects and deliver against aggressive deadlines Masters Degree in Statistics, Marketing Analytics, or other Quantitative fields is highly preferable"}