{"jobID": "2728971473", "jobLocation": "Bethesda_MD", "jobTitle": "Senior Data Analyst –Patient-Centered Research – Flexible", "companyRating": "3.8", "companyInfo": {"Website": "www.evidera.com", "Headquarters": "Bethesda, MD", "Size": "501 to 1000 employees", "Founded": " 2013", "Type": " Subsidiary or Business Segment", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " IQVIA, ICON, RTI Health Solutions"}, "estimatedSalary": "96000", "jobDescription": " *This position can be based in our Bethesda, Waltham, or London offices. Remote opportunities will also be considered, depending on experience.Position SummaryThis business-critical position provides extensive statistical and data programming support across multiple projects within the Patient-Centered Research team. The role requires a unique blend of technical excellence in addition to the ability to manage and prioritize multiple tasks with competing deadlines. The Senior Data Analyst is integral to the success of the organization and works closely with a variety of stakeholders; technical and research, in order to drive the delivery and quality of required programming and results tables. As this role supports a regulatory environment, knowledge of good clinical practices for data management is required in order to be successful. Essential Duties and Responsibilities: (other duties may be assigned) Prepare, manage and analyze research data using standard statistical packages such as SAS, S-Plus.Review project related documentations such as CRFs, SAPs, and proposals, and provide feedback to project team.Assist in the development of final study reports and presentation of study of findings, including the creation of graphical output directly from study data. Validate and peer review other programs. Act as technical consultant to other staff within Evidera.Provide SAS User Group training session at least once a year presented to programmers and senior patient-centered research staff.QualificationsWork experience with healthcare or clinical trial data is essential; knowledge of 21 Code of Federal Regulations Part 11 preferred. Minimum of 5 years of SAS programming experience or a comparable skill set.Excellent understanding of and generous experience with SAS/Base, SAS ODS outputs, SAS Macro, SAS STAT and any additional SAS modules as required by the specific job position.Strong written and oral communication skills. Understanding and experience with R a plus.Education and ExperienceMaster's degree (preferred) or equivalent degree with 4-6 years’ experience, BA/BS degree with 8+ years’ work experienceCompany SummaryEvidera is a global research consulting group that partners with life sciences organisations worldwide to develop, capture, and communicate the clinical and economic evidence required to substantiate the value of their products and optimize their products’ market access and commercial success. Our research and consulting services are driven by world-class science and thought leadership and leverage a unique combination of capabilities in health economics, patient-centered research, market access, data analytics, and epidemiology. PerksEvidera offers a competitive salary and benefits package. Our office locations have great amenities and frequent social events. We are committed to providing training and professional development, with ample opportunity to advance, for all of our staff. Evidera, Inc. provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, genetics, sexual orientation, gender preference, disability, or status as a qualified individual with a disability or protected veteran."}