{"jobID": "2810332493", "jobLocation": "Plano_TX", "jobTitle": "Data Scientist Market Intelligence", "companyRating": "3.4", "companyInfo": {"Website": "www.att.jobs", "Headquarters": "Dallas, TX", "Size": "10000+ employees", "Founded": " 1983", "Type": " Company - Public (T) ", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " Verizon, T-Mobile, Sprint"}, "estimatedSalary": "96000", "jobDescription": "As a data scientist in the Chief Data Office (CDO) group, youll use your talent for breaking down business challenges into data-driven problems that guide improvements in customer satisfaction and generate millions in savings and potentially revenue. Your solutions could influence everything from fleet optimization and energy efficiency to content analytics and marketing often before the problem even happens. Add the ongoing skill development and collaboration with some of the brightest minds in the field, and you will be poised to make an impact. You will utilize the latest machine learning and statistical algorithms to create predictive and prescriptive models by detecting and exploiting patterns in massive datasets. You will also create data visualizations and give presentations that will help key stakeholders in their decision making process.Ready to combine your skills and experience with our innovative technology solutions? We are looking for candidates who love learning new things, like playing with data and want to get things done. We need people that feel comfortable across the entire spectrum of data science, from meeting with businessAdditional Information:RequirementsAn advanced degree in a quantitative field preferredProgramming experience with a programming language (preferably Java, Python or R)Knowledge of Unix/Linux systemsSelf-starter and team playerPassionate about constantly learning new skills in a fast-paced environmentAbility to communicate with a wide range of audiences, from executives who need the big picture to expert peers that want to learn from your workCapacity to translate complex and open-ended business challenges into concise data-driven problemsPreferred QualificationsExperience creating models utilizing Machine Learning and/or StatisticsGreat intuition, curiosity and skepticism when analyzing dataExperience designing and implementing your own algorithms and data structuresExposure to the Hadoop Ecosystem tools (e.g Spark, MapReduce/Tez) or other big data technologiesExperience manipulating big and noisy datasets (e.q. SQL, Pig, Hive)Bonus PointsCompetitive Programmer or Competitive Data ScientistCommitter to Open Source ProjectsDevelopment of personal projectsKnowledge of scalable data visualization techniquesAbility to create prototypes quicklyExperience manipulating and analyzing large datasetsContributing author on publications in graph methodsKnowledge Graph and Knowledge Representation experienceDistributed graph processing experienceStartup, consulting or leadership experienceEducation and ExperienceProfessional Level: Preferred Bachelors of Science in Computer Science, Math or Scientific Computing; Data Analytics, Machine Learning or Business Analyst nanodegree; or equivalent experience. Typically requires 5-8 years experience or PhD or Masters in an approved field with no minimum years of relevant experience.Senior Level: Preferred Bachelors of Science in Computer Science, Math or Scientific Computing; Data Analytics, Machine Learning or Business Analyst nanodegree; or equivalent experience. Experience: Typically requires 8-10 years experience or PhD or Masters in an approved field with a minimum of 2 years of relevant experience.Principal Level: Preferred Masters of Science in Computer Science, Math or Scientific Computing; Data Analytics, Machine Learning or Business Analyst nanodegree; or equivalent experience. Experience: Typically requires 10 or more years experience or PhD in an approved field with a minimum of 6 years of relevant experienceThis position requires Daily Office Presence in Plano, TX. No relocation assistance is provided."}