{"jobID": "2796857673", "jobLocation": "Arlington_VA", "jobTitle": "Data Management Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.forsmarshgroup.com", "Headquarters": "Arlington, VA", "Size": "51 to 200 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "64000", "jobDescription": " Fors Marsh Group LLC (FMG) is an applied research consulting firm based in Northern Virginia. Our primary mission is to leverage insights from the social sciences for improved organizational decision-making. As a thriving small business, we are committed to providing growth opportunities to our employees, expanding their areas of competence, and challenging them to provide the best possible research for our clients.  FMG is seeking a detail-oriented and motivated data analyst needed to work as part of a small survey data management team. This individual's primary responsibility will be support of several surveys for the Department of Defense and other clients. Tasks include providing clean respondent lists for sampling and mail file creation, systematically testing data collection instruments, and delivering final recoded data files used for weighting, analysis, and reporting. This job is best suited for an individual who has experience working with large datasets and complex survey branching, is detail oriented, and has strong coding/syntax skills in statistical analysis packages.  Responsibilities include: Collaborates with clients and internal analysis teams to obtain a detailed understanding of data requirements necessary for the sampling, weighting, and analysis of data.Works with other analysts in the creation, cleaning and recoding of datasets and sample frames for research studies.Develops and implements systematic data collection instrument testing plans to verify instrument and specification alignmentEnsures data and metadata integrity and compliance with required standards by performing data validation and cleansing. Identifies issues within data and determines the root cause of the problem to recommend and execute corrective action.Analyzes survey data to evaluate questions and data quality. Makes recommendations regarding design of coding schemes and data patterns to further analytical requirements.Identifies and implements process improvements in relation to data collection and processing.Identifies, reviews, and evaluates data collection metrics. Recommends ways to strengthen data integrity, quality and availability.Provides project management support and ensures completion of all final deliverables in a timely, accurate, and efficient fashion. Qualifications: BA/BS in statistics, mathematics, social science, or related field required.Three years of experience working with large datasets or databases. At least two of those years should be in a professional working environment.Strong quantitative ability and a keen eye for detail and accuracy.Ability to multi-task and manage multiple priorities with minimum direction and supervision.Effective written and oral communication skills.Proficiency writing syntax in SPSS or Stata required. (Additional programming skill in other languages such as SAS or R is desired but not required.)Applicants may be subject to a low-level government security investigation and must meet eligibility criteria for access to sensitive information. We Offer: A highly collegial and intellectually stimulating work environment.A company culture promoting work/life balance.Highly competitive benefit/compensation package.Fors Marsh Group LLC is an Equal Opportunity Employer. M/F/Disability/Vet"}