{"jobID": "2661014012", "jobLocation": "McLean_VA", "jobTitle": "Data Analytics Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.jacobs.com", "Headquarters": "Dallas, TX", "Size": "10000+ employees", "Founded": " 1947", "Type": " Company - Public (JEC) ", "Industry": " Construction, Repair & Maintenance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Fluor, Bechtel, AECOM"}, "estimatedSalary": "79000", "jobDescription": "“Jacobs National Security Solutions (NSS) provides world-class IT network and service management capabilities; cutting edge cyber threat awareness and cybersecurity solutions; innovative web- and software applications development; and advanced data analytics for major clients in the Intelligence Community, Department of Defense, and Federal Civilian Agencies.Our forward thinking solutions deliver an integrated approach to IT network design and management, full lifecycle IT service management, IT service delivery, asset management, logistics and procurement, and vendor management. We leverage the expertise and passion of our employees to conduct identity and access management, penetration testing, and vulnerability assessments for our nation’s most closely guarded agencies and networks. Our Cyber Security Operations Centers ensure safe, effective network operations for Federal clients while our data scientists are helping stop illegal acts before they can endanger Americans or our way of life.Jacobs promotes a culture of operational excellence to create a safer, smarter, and more connected world while upholding the highest standards of compliance, quality and integrity.We continue to thrive and need your talent and motivation to help propel us farther, faster.”Jacobs is seeking a Data Analytics Analyst to support our customer in Reston, VA area. The Data Analytics Analyst will be responsible for performance measurement and data analytics services for a member of the Intelligence Community (IC) on a mature (>10 year-old) contract. The Performance Measurement Program Support (PMPS) contract has had high success delivering strategic and operational measurement services to this customer, and is looking to plus up its manpower in order to provide better team coverage, and provide more opportunities for the team to perform more advanced analysis.Responsibilities may include:Advising teams in the development of useful performance measurementsQuantitative and qualitative data collection and analysis or large volumes of system performance dataDeveloping measures of performanceData analysis in MS Excel and other data visualization tools such as TableauAbility to grow into a Project Manager role"}