{"jobID": "2822262329", "jobLocation": "Westwood_CA", "jobTitle": "Bioinformatics Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.uclahealthcareers.org", "Headquarters": "Los Angeles, CA", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Cedars-Sinai Medical Center, Loma Linda University Medical Center, Harbor Hospital"}, "estimatedSalary": "107000", "jobDescription": "ResponsibilitiesUCLA Institute of Precision Health and DGIT are looking for an experienced and creative bioinformatician with solid scripting skills.  This team designs, implements, operates and maintains the high-performance compute infrastructure that is tailor designed to address the substantial processing, networking and data moving challenges arising from genomic science. Utilizing the elasticity of the AWS Cloud and innovative Big Data technologies, the team is to develop highly optimized state-of-the-art bioinformatics solutions. We are looking for a candidate with strong AWS, IaaS, Linux systems administration, HPC experience, who can leverage their expertise to provide investigators and data scientist the computing environment they need to make an impact in medical care by advancing our understanding of the role of the human genome in disease. While the primary responsibilities will focus around the compute infrastructure, you will have opportunities to contribute in the development of new bioinformatics software and genomic analysis pipelines.  The bioinformatician will work closely with a team of investigators, staff researchers and research computing IT in, but not limited to, the Clinical Exome Sequencing (CES) laboratory, Undiagnosed Disease Network (UDN) and Institute of Precision Health Clinical and Translational Science Institute (CTSI) under the direction of Dr. Stanley Nelson and Dr. Hane Lee to perform the following: Building and running various NGS analysis pipeline such as whole exome sequencing, whole genome sequencing and RNAseq;automating the bioinformatics pipeline;building variant database;assisting investigators to query the variant and medical record database;variant annotation;genomics data-set integration"}