{"jobID": "2829523076", "jobLocation": "Whitehall_MI", "jobTitle": "Data Scientist", "companyRating": "2.9", "companyInfo": {"Website": "www.rtiintl.com", "Headquarters": "Coraopolis, PA", "Size": "1001 to 5000 employees", "Founded": " 1958", "Type": " Company - Public (RTI) ", "Industry": " Manufacturing", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Allegheny Technologies (ATI), Titanium Metals, VSMPO-AVISMA"}, "estimatedSalary": "98000", "jobDescription": "Job Description This opening is with Arconic Engines – a world leader in the investment casting of super alloys, aluminum and titanium primarily for jet aircraft and industrial gas turbine markets. For more information on Arconic, visit us online at www.arconic.com.  This position will be located at Arconic Engines Research Center within the Engineering Services Group with responsibilities to include: Provide statistical analysis support and mentoring to APP HRC laboratory and production facilities.Support implementation of IPC and other shop floor software replacements.Learn and support various statistical software products, such as SAS, JMP, Minitab and R.Provide and coordinate statistical training.Support Arconic Engine customer data sharing activities.Support yield improvement activities with advanced data analytics at Arconic Engine locations.Basic QualificationsBachelor’s Degree in Data Science, Statistics or Mathematics from an accredited institution.Employees must be legally authorized to work in the United States. Verification of employment eligibility will be required at the time of hire. Visa sponsorship is not available for this position.This position is subject to the International Traffic in Arms Regulations (ITAR) which requires U.S. person status. ITAR defines U.S. person as an U.S. Citizen, U.S. Permanent Resident (i.e. ‘Green Card Holder’), Political Asylee, or Refugee.Preferred QualificationsMaster’s Degree from an accredited institution in the following disciplines preferred: Data Science, Statistics or Mathematics.Knowledge of statistical software packages.Hands on experience manipulating and applying advanced statistical analysis methods to production data.Self-starter, strong interpersonal skills and ability to function and drive to excel within a team environment.Strong written and oral communications skills; project planning ability; and ability to effectively use MS Office applications."}