{"jobID": "2804423591", "jobLocation": "Houston_TX", "jobTitle": "Manager, Decision Analytics Services (Data Engineer and Visualization)", "companyRating": "3.2", "companyInfo": {"Website": "www.exlservice.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1999", "Type": " Company - Public (EXLS) ", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "88000", "jobDescription": "Manager Services, Analytics EXL (NASDAQ:EXLS) is a leading operations management and analytics company that helps businesses enhance growth and profitability in the face of relentless competition and continuous disruption. Using our proprietary, award-winning Business EXLerator Framework™, which integrates analytics, automation, benchmarking, BPO, consulting, industry best practices and technology platforms, we look deeper to help companies improve global operations, enhance data-driven insights, increase customer satisfaction, and manage risk and compliance. EXL serves the insurance, healthcare, banking and financial services, utilities, travel, transportation and logistics industries. Headquartered in New York, New York, EXL has more than 24,000 professionals in locations throughout the United States, Europe, Asia (primarily India and Philippines), Latin America, Australia and South Africa.  EXL Analytics provides data-driven, action-oriented solutions to business problems through statistical data mining, cutting edge analytics techniques and a consultative approach. Leveraging proprietary methodology and best-of-breed technology, EXL Analytics takes an industry-specific approach to transform our clients’ decision making and embed analytics more deeply into their business processes. Our global footprint of nearly 2,000 data scientists and analysts assist client organizations with complex risk minimization methods, advanced marketing, pricing and CRM strategies, internal cost analysis, and cost and resource optimization within the organization. EXL Analytics serves the insurance, healthcare, banking, capital markets, utilities, retail and e-commerce, travel, transportation and logistics industries.  Please visit www.exlservice.com for more information about EXL Analytics.  This role is responsible for Data modeling and processing within the corporate Business Intelligence team and will function as a Data Engineer that supports enterprise reporting and analytics. Additionally, this position will be responsible for the design, development and maintenance of data mining, transformation and migration workflows on capital and operational BI projects and initiatives. This role will be focused on the use and application of the Microsoft BI suite including SQL Server and SQL Server Integration Services. Data Processing/ETL DevelopmentDesign, develop and test ETL code, scripts, and workflows using SQL Server Integration Services.Standardize and conform dimensions and other data entities across applications, manage external data sources including excel files using SQL Server Master Data Services.Migrate and promote validated objects and code across environments as required.Document and execute test procedures for ETL processes and coordinate with business analysts and users to resolve data quality issues.Data ArchitectureMaintain and enhance the data warehouse by designing and developing new data models containing re-usable objects following Kimball/Inman’s hybrid architecture.Convert business requirements to technical specifications by designing and creating data models, workflows and source-to-target mappings for data integration jobs across enterprise applications.Create and maintain the Entity Relationship (ER) diagrams for the models in the data warehouse used for reporting and analytics.Create data movement and integration diagrams to support data processing workflows and business processes.SupportCreate reports, analyses and scorecards leveraging multiple data sources.Support cross-functional and cross-departmental data and reporting requests.Troubleshoot BI related issues as part of day-to-day operational activities.Document all ETL environments, databases, processes and workflows. Ensure documentation is kept up to date and reflects changes to environments or instances.PROD data processing workflows and jobs are scheduled and functioning as per requirements.Data Engineering work streams are fully supported on capital and operational projectsPROD data warehouse is refreshed and available daily as per business and functional requirements.Master’s or Bachelor's degree in electronics/electrical engineering, computer science, IT or related quantitative analytics field from top-tier universities with strong record of achievement.Professional certifications such as MSCA or MSCE in Data Platform (SQL Server) or BI will provide added advantage.Working in an IT environment for 3- 5 years in a Data Engineering/BI Analyst role.Working in an IT environment for at least 1 years in a Date Architecture/Design role.Experience in using visualization tools like Tableau (minimum 1 year)Experience in other tools such as Power BI will provide candidate added advantageAt least 3 years' experience with Microsoft BI and IM technology stack.At least 3 years' experience with DI/ETL design and development using MS SQL Server Integration Services 2008/12/14/17.At least 3 years' experience with administration/development in MS SQL Server 2008/12/14/17.At least 1 years' experience with MS SQL Server Master Data Services 2012/14/17.Understanding of Incidence and Change Management and the ability to follow organizational processes, standards and methodologies.Working in an environment requiring constant and clear communication, both verbal and written.Working in a team environment and experience working cohesively with related IT teams.Basic understanding of the project management life cycle.Proven writing and visualization skills with the ability to organize and present information in various forms such as textual, graphical and statistical.Preferable Abilities:Deductive reasoning skills as they pertain to BI development and database design, such as troubleshooting focused on determining network vs. report latency, software vs. code, patterned vs. non-repeatable problems.Results-oriented and customer-focused. Demonstrated ability to develop effective working relationships with internal and external customers.Adhere to IT best practices, methodologies and disciplines.Able to manage multiple conflicting priorities, reprioritize tasks, establish priorities, work independently and meet deadlines.Demonstrated ability to multi-task, probe, analyze and problem-solve complex issues.Strong interpersonal skills and the ability to adapt in a complex and changing environment.Work with detailed technical information and hands-on technology experience.Ability to maintain information in confidence and exercise good judgment.What we offer:EXL Analytics offers an exciting, fast paced and innovative environment, which brings together a group of sharp and entrepreneurial professionals who are eager to influence business decisions. From your very first day, you get an opportunity to work closely with highly experienced, world class analytics consultants.You can expect to learn many aspects of businesses that our clients engage in. You will also learn effective teamwork and time-management skills - key aspects for personal and professional growthAnalytics requires different skill sets at different levels within the organization. At EXL Analytics, we invest heavily in training you in all aspects of analytics as well as in leading analytical tools and techniques.We provide guidance/ coaching to every employee through our mentoring program wherein every junior level employee is assigned a senior level professional as advisors.Sky is the limit for our team members. The unique experiences gathered at EXL Analytics sets the stage for further growth and development in our company and beyond. EEO/Minorities/Females/Vets/Disabilities"}