{"jobID": "2788954048", "jobLocation": "Redlands_CA", "jobTitle": "Data Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.esri.com", "Headquarters": "Redlands, CA", "Size": "1001 to 5000 employees", "Founded": " 1969", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Pitney Bowes"}, "estimatedSalary": "118000", "jobDescription": " OverviewAre you passionate about changing the world through machine learning and location intelligence? If yes, then it’s just the right time to join our team because we are about to do so!  With the IoT revolution (30 billion sensors by 2020), the consumerization of mapping, and location data growing exponentially day after day, location is becoming extremely important to more and more people. We want to enable organizations and businesses to go beyond basic visualization and analytics of such massive data, to the realm of being two or three steps ahead of the game by extracting advanced levels of intelligence from it, predicting important events, and automating significant proportions of their work through AI and machine learning.  We are looking for an entrepreneurial, collaborative person with strong hands-on experience and solid track record with statistical analysis, machine learning, predictive analytics, software engineering, and passion for location to help us on our mission to build world class predictive location analytics solutions for our customers in 160+ countries. Responsibilities: Build high-quality prediction systems that solve our customers' business problems by applying data mining and machine learning techniques; doing statistical analysis; and exploring, interpreting, and analyzing datasets for patterns of interestWork closely with different teams on understanding our customers’ needs to craft and pitch machine learning use cases to themModel business problems to machine learning ones, mapping business data to dependent and independent features, doing proper feature engineering, iterating with different predictive models, conducting hyper parameter optimization to yield highest prediction accuracy, and deploying the model to productionHelp build the data science and machine learning capability inside Esri: develop best practices and patterns for geospatial machine learning, develop reusable technical components for demos and POCs, and identify and help establish needed technology stack and infrastructureKeep up to date with latest technology trends in machine and deep learning and quickly learn about new frameworks/techniques to be used in projects deliveryRequirements2+ years of practical machine learning experience, some of which is within established technical organizationsSelf-learner with strong communication skills (writing markdown README files, blogs, or how-to instructions)Experience with applied statistics skills such as distributions, statistical testing, and regressionSoftware engineering, continuous integration and lifecycle managementWriting in Python, Java, Scala and extensive use of unit tests, Git, and DockerAbility to perform data extraction, transformation, loading from multiple data sources and sinksExperience in data visualization such as in Tableau or Jupyter NotebooksModel building and hyper parameter tuningExperience with deploying software on AWS, Azure, or other cloud serviceExperience in machine learning with deep learning and other supervised, unsupervised, and reinforcement learning methodsHave a fundamental understanding of ML algorithms such as back propagation, ReLU, Bayes, Random Forests, etc.Experience dealing with massive data sets using big data toolsExperience with time series analysisRecommended Qualifications:Experience with spatial and GIS conceptsExperience with CUDA/GPU programmingFamiliarity with one or more of the following: Hadoop HDFS, Spark, Accumulo, Presto, MongoDB, Elastic Search, Cassandra, HBase, R, Mahout, Pig, and Hive, DC/OS, KubernetesMaster's or PhD in mathematics, statistics, computer science, or related field, depending on position level The CompanyOur passion for improving quality of life through geography is at the heart of everything we do. Esri’s geographic information system (GIS) technology inspires and enables governments, universities, and businesses worldwide to save money, lives, and our environment through a deeper understanding of the changing world around them.  Carefully managed growth and zero debt give Esri stability that is uncommon in today's volatile business world. Privately held, we offer exceptional benefits, competitive salaries, 401(k) and profit-sharing programs, opportunities for personal and professional growth, and much more.  Esri is an equal opportunity employer (EOE) and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law."}