{"jobID": "2836057604", "jobLocation": "Arlington_VA", "jobTitle": "Account Manager, Legal Practice", "companyRating": null, "companyInfo": {"Website": "jobs.gartner.com", "Headquarters": "Stamford, CT", "Size": "10000+ employees", "Founded": " 1979", "Type": " Company - Public (IT) ", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Salesforce, Boston Consulting Group, ZS Associates"}, "estimatedSalary": null, "jobDescription": "Are you looking for a fast-paced career with outstanding advancement potential at a global market leader? If so, think about Gartner. The world's leading research and advisory company, Gartner (NYSE:IT) delivers the insight necessary for our clients to make the right business decisions, every day. We are seeking highly motivated, achievement-driven sales associates to contribute to our double-digit growth, backed by the solid infrastructure of a world-class sales organization. In addition to a competitive base salary, uncapped commissions and exceptional benefits, Gartner sales associates can enjoy generous performance-based rewards, including all-expense-paid trips to exotic locations around the world. Come be a part of our incredible growth organization!Key responsibilitiesBuild relationships with our clients and prospects through demonstration of in-depth institutional knowledge, understanding of specific institutional needs/priorities and application of research solutions.Navigate Gartner client offerings on behalf of the institution, ensuring the appropriate product is provided to meet the clients needEducate clients and prospects on the benefits of Gartner's products and services through compelling articulation of our business model and value propositionCreate customized account plans for each institution, outlining service delivery and revenue growth strategies for existing and potential client memberships within the institutionCollaborate with our client advisory team to ensure targeted and substantive content solution deliveryUtilize existing member relationships to navigate within the institution and generate/contact new business leadsEvaluate prospects' business needs and present appropriate mix of Gartner productsDetermine appropriate tactics to drive urgency in sales cycle, including trial meetings/ teleconferences, guest website access, etc.Bachelors degree strongly preferred5+ years of direct sales or account management experience; or an MBA degree and 5 years of business related experience in a singular industryProven experience retaining and growing existing business while engaging at the Chief Executive levelWillingness and ability to travel in excess of 40% in a regional state territoryProven track record of selling and growing executive level relationshipsExcellent communication and presentation skillsDemonstrated ability to establish and grow sales with existing senior level clientsExperience working in a Business to Business (B2B) environment"}