{"jobID": "2706729289", "jobLocation": "McLean_VA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.squiresgroup.com", "Headquarters": "Annapolis, MD", "Size": "51 to 200 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Are you ready for a new challenge? Our McLean, VA based client has a direct hire opportunity for a Data Scientist. Join the nation’s leading team of Cybersecurity experts that defend customer networks, industry sectors, and nations from advanced cyber-attacks. They are one of the fastest growing, privately held cybersecurity firms in the world with leadership from the National Security Agency, the National Counterterrorism Center, U.S. Cyber Command, military intelligence and private industry.  If you want to put your skills to work advancing the most sophisticated and effective cybersecurity solutions on the planet, this is the company for you!  Our client offers generous pay, flexible work locations, and a stock option program. This is a direct hire opportunity, and work will be performed at our client sites in the MD/DC/VA region. Per our client contract, candidates must be U.S. Citizens.  The young firm is on a high growth trajectory and is taking the Cybersecurity industry by storm. To be a part of something great, you need to apply now. We guarantee a quick response to your application, ensuring your talents get the consideration they deserve! Design and develop new analysis algorithms in conjunction with the existing data science teamDesign for large-scale distributed computing in a Spark, Hadoop, Pig, MapReduce-based architectures (or competing technologies)Create prototype algorithmsAssist in optimizing algorithms for performanceAssist in writing thorough tests and documentationProvide front-line support to customers; Monitor the results of analytics on customers’ environments with an aim towards validating that anomalous activity and behaviors are being detectedDevelop analytics based on the unique characteristics of an assigned customer or sector environmentDevelop analytics using special collection that is only available within a given customer or sectorAssist analytic development team by writing code that will be taken over by the analytic development teamBachelor's Degree in Math, Statistics, Computer Science or related field4+ years of experience in SAS, Python, Scala, or R2+ years of experience with machine learning and SQLStrong programming skills (such as Hadoop MapReduce or other big data frameworks, and Java)Proficiency in statistical analysis, quantitative analytics, forecasting/predictive analytics, multivariate testing, and optimization of algorithmsPer our Contract, candidates must be U.S. CitizensPreferred Qualifications:Cybersecurity experienceMBA or Master's degreeA Thousand Reasons to Give Referral Program:Refer a friend, and you both can earn $1,000 if we place them in a new job opportunity! If you see a position posted by The Squires Group and know the perfect person for the job, please click here to send us your referral.The Squires Group, Inc. is an Equal Opportunity/Affirmative Action Employer."}