{"jobID": "2808517703", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Software QA Engineer", "companyRating": null, "companyInfo": {"Website": "www.stanza.co", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Senior Software QA Engineer Hundreds of millions of pageviews, natural language processing, real-time user analytics, header bidding these are just a few of the challenges we face at Stanza. To the consumer, Stanza is a seamless calendar integration, allowing users to sync their favorite interests and events such as concerts, sporting events, movie releases, esports, etc. With partners such as Warner Brothers, NBC Sports, CBS, NFL, NBA, NHL, NCAA, and many more, Stanza is becoming the default way to embed and share calendars on the web.  We are redefining the purpose of a calendar with one core value in mind: Your Time Matters. This leads us to a larger vision to redefine the calendar as a dynamic service that helps you automatically find, remember and act on the things that you truly care about spending your time on. We provide intelligent recommendations for Stanza calendars based on the content of articles and pages across the web aligning with interests, utilizing advanced analytics.  If you would like to take this journey and make a difference, please read on.  Stanza is backed by top tier venture investors and is headquartered in San Francisco.  We're looking for a Senior Software QA Engineer (manual and automation) to join our rapidly growing team. Responsibilities:Translate functional requirements and specifications into documented test plans, cases and stepsManual verification of new features and bug fixesIncrease QA Automation coverage on frontend and backend servicesBe an advocate of quality for the Engineering organizationGreat to have:Performance and load testingBuilding jobs in JenkinsMobile testingQualifications:5+ years software QA experienceExperience with SeleniumPython or other automation scripting languageExperience writing test strategy documentsBlack/White Box testing of microservicesWorking in an Agile software development processBS in Computer Science or related degree"}