{"jobID": "2776554411", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Senior Research Associate, Analytical & Formulation Development", "companyRating": "3.8", "companyInfo": {"Website": "www.sutrobio.com", "Headquarters": "South San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "88000", "jobDescription": " Senior Research Associate, Analytical & Formulation DevelopmentMay 14, 2018Sutro Biopharma, Inc. is looking for a Senior Research Associate to join our Analytical Development group to support R&D; of monoclonal antibodies and antibody drug conjugates using state of the art chromatographic and biophysical techniques. Responsibilities: The candidate we are seeking will work within our analytical group to develop, qualify and transfer analytical assays for characterizing recombinant proteins, in addition to running routine testing to support other functional areas such as process development and research. This position will primarily focus on Capillary Electrophoresis and chromatography related assays such as CE-SDS, cIEF, IEX-HPLC, RP-HPLC, and SEC. The successful candidate will be expected to work with minimal supervision while also working collaboratively within the Analytical group and across functional groups. This position is expected to contribute to product characterization studies as well as perform routine release assays, and will be expected to communicate their data both verbally at group meetings and through written documents and reports. Qualifications:BS in analytical chemistry, biochemistry, or related scientific field and 2-5 years of industry experience in the analysis and characterization of monoclonal antibodies/antibody drug conjugates (CE, SEC, IEX, RP).Proficiency in operation of Protein Simple iCE3 IEF Analyzer, PerkinElmer LabChip GXII Automated Electrophoresis System, Agilent/Dionex HPLC’s and experience with Chromeleon software is highly preferred.Experience in protein characterization techniques, such as peptide mapping, DSC, and LC-MS is desirable.Flexibility to work on multiple projects between departments in a fast-paced environment is essential.Excellent verbal communication, strong writing skills, and being detailed oriented are important attributes. Sutro provides a competitive benefits package that includes a choice of health, dental, and vision insurance, life insurance, flexible spending accounts, 401K plan, PTO, and stock options. Please submit resume for Req. #1802 tojobs@sutrobio.com. Please visit our website at www.sutrobio.com for more information. Local candidates, SF Bay Area. No relocation. « Go Back"}