{"jobID": "2769972343", "jobLocation": "Walker_MI", "jobTitle": "Client Development Manager North Georgia", "companyRating": null, "companyInfo": {"Website": "www.tubeliteinc.com", "Headquarters": "Walker, MI", "Size": "51 to 200 employees", "Founded": " 1945", "Type": " Subsidiary or Business Segment", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable", "Competitors": " Kawneer, YKK, Oldcastle"}, "estimatedSalary": null, "jobDescription": " Join Us! We are looking for a skilled Outside Sales Professional, who is ready to build their future!  Tubelite Inc., is a responsive, West Michigan based, leading supplier of storefronts and entrances to the glass and glazing industry since 1945. Our customer's success is our mission, with a strong focus for on time and complete delivery and our damage-free guarantee. Tubelite Inc. also cares for our environment including providing LEED® energy efficiency credits, recycling of raw materials and finishes that are applied using environmentally friendly processes  Description  The Client Development Manager is accountable to meet or exceed sales and profit goals in the North Georgia market. The Client Development Manager will actively promote Tubelite's products to add new accounts and increase share of existing account's business. The Client Development Manager will actively promote the company's products and services to architects and specifiers in the region. The Client Development Manager will strengthen relationships with both glazing contractors and distributors by providing excellent customer service and application knowledge. The Client Development Manager will be recognized as the industry expert in the territory. ResponsibilitiesMeet or exceed mutually established order input, sales and thru put margin goalsDevelop working relationships with architects and specifiers via frequent presentations and project-specific design assistanceEducate and train architects, specifiers and clients on the features, functions and benefits of the company's products and services.Monitor and make recommendations on pricingFollow established sales prospecting protocolService existing accounts via regular/frequent personal visits and telephone communicationProvide information to clients in a timely manner. Follow-up quotes in a timely mannerHelp clients identify proper fenestration systems during pre-construction.Work with the Engineering Department to ensure that proper testing and engineering requirements are met during pre-constructionFollow up with client orders. Solve client problems when necessaryProvide accurate and timely market intelligence information for the territoryDevelop and monitor individual sales budgets and monthly order forecastsRequirementsMinimum three years' experience in architectural building product salesExtensive understanding of standard and engineered fenestration systemsBasic understanding of construction blueprints, details, and design and technical manualsExcellent communication, problem solving and time/self-management skillsExcellent computer skills, including Microsoft Office and internetWilling to travel 70% of the timeValid driver's license without restrictions Preferred Bachelor Degree Enjoy great benefits including a positive work environment, medical, dental, vision, 401(k), stock purchase and more! Apply Today!  EEO Employer  Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}