{"jobID": "2837692380", "jobLocation": "Hopewell_NJ", "jobTitle": "Data Science Programmer, Translational Bioinformatics", "companyRating": "3.6", "companyInfo": {"Website": "www.bms.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1858", "Type": " Company - Public (BMY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": " We are seeking an innovative scientist to join our Data Science team in the Translational Bioinformatics group. This group of computational scientists is responsible for advancing Bristol-Myers Squibb's industry-leading pipeline in multiple therapeutic areas (including Immuno-Oncology, Cardiovascular, Fibrosis and Immunoscience) through the strategic application of cutting-edge bioinformatics approaches. As a member of this team, you will integrate data from diverse clinical trial and real-world data sources using SAS, R and other data mining programming tools and create powerful visualizations of this data. You will lead translational, clinical and biomarker teams in the exploration of clinical data using visualizations and identify alternative visualizations to best detect signals and potential relationships in the clinical data. You will integrate clinical data for bioinformatics modeling and analyses and will be an expert resource and train clinical team members in the software tools. You will attain subject matter competence in clinical, biomarkers, -omics and other scientific areas sufficient to partner with experts to integrate data sources and explore signal and data relationships in order to nominate novel drug targets, enable patient enrichment strategies, and guide drug development decisions. The group interacts with and influences all aspects of R&D; at BMS, from early discovery through late-stage development. ResponsibilitiesIntegration and transformation of clinical safety, efficacy and biomarker data, including various -omic-scale data including RNA-Seq, Exome and Whole Genome Sequencing, single cell sequencing and high throughput proteomics or metabolomics in order to nominate novel drug targets, enhance mode-of-action understanding, enable patient enrichment strategies and prioritize combination therapies.Integration and mining of proprietary and public data sets to further enhance our understanding of the factors influencing disease development.Produce exploratory clinical safety, efficacy and biomarker visualizations from clinical trials and public data sets to understand drug mechanisms, patient response and develop translational biomarkers.Partner with clinical teams, bioinformaticians and other data scientists to extract insights and generate hypotheses to be evaluated in future trials and to inform our development pipeline.Collaborate with bioinformaticians, statisticians, biologists, and clinicians to identify critical questions that can be addressed via computational approaches.Qualifications:Bachelor degree in engineering, computer science, statistics or other scientific discipline required; Master's degree is preferred.At least four years SAS, R and/or data mining SQL programming experience in clinical and biomarker data integration with demonstrated expertise in identifying data issues and detecting signals and relationships in clinical trial data required. At least 2 years programming experience in public health data sets preferred.Excellent skills in SAS to integrate and transform data required.Evidence of ability to develop and implement sophisticated algorithms for merging and transforming complex data sets required.Demonstrated ability to prepare visualizations required to appropriately explore scientific clinical, biomarker and other data required.Spotfire experience desired.Ability to work across organizations to define and solve problems that will benefit the whole. Capable of establishing strong working relationships across the organization.Very strong attention to quality and detail required, as well as the ability to detect data anomalies. Bristol-Myers Squibb is an equal opportunity employer - Minorities/Females/Protected Veterans/Disabled"}