{"jobID": "2430267858", "jobLocation": "Austin_TX", "jobTitle": "Data Science Apprentice", "companyRating": null, "companyInfo": {"Website": "www.predictivescience.com", "Headquarters": "Austin, TX", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Predictive Science is looking for ambitious and interested students who want to learn more about data science or pursue a career in data science. Data science is considered one of the sexiest jobs of the 21st century and the average data scientist can get paid over $113k yearly. Predictive Science is offering an entry level part time position for those who want to start getting real data science experience. As part of the position you will be working on real projects with leading brands such as Verizon, NFL, Dell, Neiman Marcus, VMware and many more. You will learn data science concepts that can help you get a better job as you graduate. Additionally, you will receive training from data scientists through our events to help you develop your data science skills. TIME REQUIREMENT The position is not to begin with, but may grow to be, a set number of hours per week job. You will start out working on different projects and will be paid for the work you perform as freelance data scientist. You are welcome to work from anyplace at any time and hold multiple jobs. In many ways this is like you are starting your own venture as a freelance data scientist owning your own business. EDUCATION REQUIREMENTS Students who are currently studying economics, business, statistics, computer science, health science, math, other sciences, and engineering are encouraged to apply, but other students majoring in other disciplines are also welcome to apply. All you need is a desire to learn and determination. SKILL REQUIREMENTS All you need to get started is a computer, internet connection, and a desire to become a data analyst. Having additional data entry job experience, being a fast and accurate typist, and familiarity with MS Office and other data programs is a great plus. RESPONSIBILITIES Based on your performance and dedication you will be assigned different responsibilities that meet your skill levels. As an entry level data science apprentice you will be expected to learn and grow to understand the basic skills of data wrangling. More advanced data analysis and manipulation will come with more experience. Initial responsibilities will include:Data Discovery Identify key information from different digital properties, social networks, and other data sources for data collection. Data Collection Input identified data both in number and text form into a data capture form within time limits. Data Cleaning Review data for deficiencies or errors, correct any incompatibilities if possible and check output. Data Preparation - Compile, verify accuracy, and sort information according to priorities to prepare source data for computer entry. WE WANT YOU TO SUCCEED Predictive Science is committed to helping you grow your career and get the experience you need to become successful. Our goal is to build the largest network of data scientists and place them in the most successful positions. Your skills will be challenged all along the way, and opportunities will be provided through conferences and online training to help you learn new skills that will make you more valuable and get promoted. Additionally, to support your career growth, we have our own recruiting team that works hard for you to find a position either with Predictive Science or somewhere else. No other company cares more about your career progression than Predictive Science. ABOUT PREDICTIVE SCIENCE Predictive Science is the fastest growing data science network focused on building the largest data science platform that can help businesses turn data into actionable results while significantly creating cost savings. Challenging data problems that were too expensive, risky, or resource limited to solve, can now be solved with the help of Predictive Science and its global network of data scientists. Predictive Science is helping companies such as Verizon, NFL, Neiman Marcus, Dell, VMware and many others unlock the power of their data by creating algorithms that are changing the world."}