{"jobID": "2628684754", "jobLocation": "Princeton_NJ", "jobTitle": "Senior Web Engineer - Data Technologies", "companyRating": "3.2", "companyInfo": {"Website": "www.rtsgroup.net", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "105000", "jobDescription": "Senior Web Engineer - Data TechnologiesPrincetonPosted May 24, 2018 - Requisition No. 64244 Apply NowThe Data Technologies Web Services Engineering team is responsible for building web applications to ingest a multitude of data sources in order to fuel the global financial markets by giving traders and data scientists the necessary information to make important decisions.  As an engineer in Data Technologies, you’ll be responsible for the systems that onboard all the referential data that drive Bloomberg's applications and enterprise systems. As our clients are shifting more and more to rely on machines to interpret data and drive insights, we are utilizing cutting edge technologies to deliver unparalleled data quality. By joining Data Technologies, you will help us improve the accuracy, coverage, timeliness, and accessibility of our data to service our clients across all of Bloomberg's products. Learn more about the Data Technologies teams at Princeton here: https://www.youtube.com/watch?v=qtUu9LCNmiUJoin our team and together we’ll build/enhance the following web products:  Web components for visualizing machine learning/neural network results and allowing for re-training and corrections to the algorithms Custom crowdsourcing platform used for gathering truth data for machine learning as well as collecting new data points or quality checking existing Bloomberg datasets Internet facing websites such as OpenFIGI.com and LEI.bloomberg.com, which utilize HBase, Kafka, Solr, and the Stripe payment platformWe’ll trust you to: Collaborate directly with product managers to design/implement business goals end-to-end Work on deep engineering issues in building and deploying a secure and scalable web platform Develop rich interactive and responsive applications using the latest browser-based client technologiesYou’ll need to have: A Bachelor's or Master's Degree in Computer Science or Engineering or equivalent background 4+ years of professional software development experience, with an emphasis on web Expertise in full stack web development Proficiency in Node.js (or Flask/Python) server side technologies and front end build systems (such as Gulp/Webpack/Yarn, Less/Sass, etc) Significant hands-on experience with React, Angular, Vue, or other client-side JS frameworks Desire to write highly testable code with a passion for achieving high coverage, and following TDD, while using some of the latest testing tools (such as Mocha, Jest, Puppeteer, Selenium) The desire to keep up with the latest and evolving web technologies and trends involving JS, HTML, CSS, frameworks, etc. Desire to learn from and contribute to open source technologies Passion for having full ownership of your application, including its performance, monitoring, analytics, debugging, testing, deploying, and continued supportWe’d love to see: Exposure to Apache, HAProxy, NGINX, DNS, TCP/IP, CDN, Proxy servers, and the HTTP protocol Experience with CI/CD systems and tools (such as Jenkins) Knowledge of SOLID principles and hands-on experience adopting them to improve code quality Experience working with Cloud Computing solutions (such as AWS, Azure) An understanding of Linux programming (commands, scripting, debugging, and performance tuning) Apply Now"}