{"jobID": "2702175483", "jobLocation": "Dallas_TX", "jobTitle": "Data Analyst - Tableau", "companyRating": "3.4", "companyInfo": {"Website": "www.jobs.southernglazers.com", "Headquarters": "Miami, FL", "Size": "10000+ employees", "Founded": " 1968", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "72000", "jobDescription": " Data Analyst - Tableau Job ID MIR00000457 Date posted 03/23/2018 DescriptionPosition Summary:Day to day you will work with a small team, the Tableau COE, to support data access for an enterprise wide deployment of Tableau at Southern Glazer’s Wine & SpiritsRole DetailsDesign, build, and maintain data sources used for Tableau development across the SGWS organization.Meet with Tableau developers from business groups to understand dimensions, measures, and KPIs required for new or revised applications. Design and deploy the data sources based on requirements.Identify areas of optimization both in the analytics tool and in the data warehouse for functionality and performance.Assist in the testing of new data being uploaded into the data warehouse and in identifying what should be optimally enabled in the data warehouse versus the analytics tools. This is based on common requirements, tool limitations, and other criteria (e.g. hierarchies, calculations, etc.)Design and implement data source security as neededMonitor and maintain data sources hosted on Tableau Server after they are deployed. This includes setting refresh schedules and monitoring for issues as well as diagnosing and troubleshooting issues.Assist with development of Tableau workbooks as needed for enterprise wide projectsSkills, Knowledge, and Core RequirementsBachelor’s or technical degree required (computer science, information systems, business administration or other industry related curriculum)Experience building, implementing and supporting Tableau data visualizations. Tableau Certifications are a plus. Understanding of data visualization best practicesProficient with analytical tools and languages supporting data analysis, reporting, and visualization - Excel, Alteryx, Microsoft Office, OneDrive, OneNote, Google Collaborative Apps (Docs, Sheets), Tableau, R, Python, SQLKnowledge of Tableau Server Administrative tasksExperience designing queries in databases, especially Amazon Redshift and HadoopExperience with Tableau Server Rest API a plusCapability to understand business requirements and how to use analytics to support these requirementsSkilled in building data extracts and working with data sources on Tableau ServerExperience troubleshooting issues with data sourcesExperience testing and validating the underlying dataKey behavioral competencies:Per the SGWS Behavioral Competencies matrix, possess the ability to demonstrate these competencies at a Professional level:CommunicationBusiness SavvyAccountabilityVisionTeamworkTalent BuildingAuthenticityInspiring to OthersInnovationStrategic ThinkingResults / Metrics Position Will Be Measured Against:Ability to complete tasks with timeliness and qualityAbility to troubleshoot and resolve issues in a timely mannerAccurate documentation of workQualificationsEducation Requirements:Bachelor’s or Technical Degree Required (computer science, information systems, business administration or other industry related curriculum)Experience Requirements:3 or more years of work experience with a focus on data and business analyticsCore Skills:Proficient in oral communicationAbility to utilize existing resources to resolve problemsAbility to develop new resources to resolve problems more effectivelyExcellent with time management (i.e. works efficiently)Ability to work within a team environment as well as independentlyStrong understanding of the software applications under area of responsibilitySpecialized Skills and Technologies:Experience with and knowledge of TableauTravel Required? YesDomestic travel, approximately less than 25%Job:MarketingPrimary Location:United States-Florida-MiramarOther Locations:United States-Texas-Dallas, United States-California-OaklandShift:Day Shift"}