{"jobID": "2707371281", "jobLocation": "San_Antonio_TX", "jobTitle": "Data Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.iheartmedia.com", "Headquarters": "San Antonio, TX", "Size": "10000+ employees", "Founded": " 1972", "Type": " Company - Public (IHRT) ", "Industry": " Media", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Cox Media Group, Townsquare Media, CBS Radio"}, "estimatedSalary": "84000", "jobDescription": " iHeartMedia Job Summary: As the leading media company in America, iHeartMedia delivers music, news, talk, sports and other content to diverse audiences across multiple platforms, including: broadcast stations; online via iHeartRadio and on its stations hundreds of websites; HD digital radio channels; satellite; smartphones; iPads and other tablets; in-vehicle entertainment and navigation systems; and via live events. With over a quarter of a billion monthly listeners in the U.S., iHeartMedia has the largest reach of any radio and television outlet in America.  The Data Scientist Music Lab will help develop and support a leading-edge music analytic platform while working on emerging technologies. This is an early stage initiative with the nimbleness of a startup and the stability of a large organization. As a Data Scientist, you will: Use emerging tools and technology to develop analytical models and automation in music planning, music research, and other areas of the company  Communicate complex solutions to a variety of stakeholders in easily understandable language  Be a contributing member of a scrum team that voluntarily accepts work  Write code that meets standards and delivers desired functionality using agreed upon technology  Demonstrate passion about using data assets to optimize systems and products across iHeartMedia  Use and extend open source software to deliver solutions to iHeartMedia business partners Present solutions and ideas to other team members, IT leadership, and business leaders  Employ a pragmatic approach to evaluate new algorithms and technologies for positive impact within iHeartMedia Requirements: 5+ years of commercial experience in data science  A demonstrable understanding of machine learning theory  Extensive experience with Python and/or R  Demonstrated experience with SQL  Exceptional communication and presentation skills are a requirement  Programming experience in JavaScript or Java for use in reading existing code or building prototypes (you do not have to have experience building production applications)  MS in Applied Mathematics, Statistics, or Computer Science - PhD desired Bonus: Data Engineering/Data Wrangling  Experience with Tensorflow, BigQuery, Tableau  Experience with Google Cloud Platform or Amazon Web Services  Location  San Antonio, TX: 20880 Stone Oak Parkway, 78258  Position Type  Regular"}