{"jobID": "2835281193", "jobLocation": "Houston_TX", "jobTitle": "Business Objects Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.acrocorp.com", "Headquarters": "Livonia, MI", "Size": "1001 to 5000 employees", "Founded": " 1982", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Strategic Staffing Solutions, Bartech, Kelly Services"}, "estimatedSalary": "56000", "jobDescription": " data analyst (level 2 or 3) that can support me and work with two others on a new suite of reporting analytics. A working knowledge of Tableau and Power BI are needed as well as Business Objects  Undertake data analysis and all other analysis within the Integration & Reporting work-stream of the project to the required quality and within the required timescales. Analyse, design, specify and write Business Objects reports, including creating all the Oracle views necessary and the Business Objects Universes i.e. completely end-to-end. Personally undertake all necessary data analyst activities: - Mapping of data; - Data modeling; - Data base design; - Write specifications; - Oracle database schema creation, including views and materialized views; - Writing SQL including reasonably advanced SQL; - Interview subject matter experts in relation to source systems and produce the subsequent documentation; - Work directly with business people to determine, document and finalize their data requirements; - Clearly document and present upstream data quality issues that can only be fixed at source, including clear definition of the fix; - Ensure the data analysis deliverables are produced and completed within the project boundaries of time and scope; - Assist with business change activities including: UAT design, planning and execution; data provision; early life support following go-live; - Work collaboratively with Business Analysts, Developers, Build Scripters and Testers, taking responsibility for seeing data analysis work through the complete project lifecycle. Where required working as part of functional teams.- provided by Dice  Tableau"}