{"jobID": "2655900930", "jobLocation": "Mountain_View_CA", "jobTitle": "Senior Server Software / Data Engineer", "companyRating": "2.6", "companyInfo": {"Website": "www.sra.samsung.com", "Headquarters": "Mountain View, CA", "Size": "1001 to 5000 employees", "Founded": " 1988", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Sony, LG Electronics, Nokia"}, "estimatedSalary": "185000", "jobDescription": " Samsung is seeking a passionate and collaborative Senior Server Software/ Data Engineer to join our Health team in Mountain View, CA.  As a cross-disciplinary Health-focused product development team consisted of research, technology, design, strategy and product functions, we define the next generation of Health services experiences for Samsung products.  This is a great opportunity for a talented and hard-working Senior Engineer or Technical Lead to step up to the next level, and build cloud services for users of the worlds best-selling mobile devices. Samsung Health Cloud Services Team is focused on the rapid development of cloud based end-to-end mobile Health applications and services. This is an exciting area for Samsung: Cloud based service platforms and infrastructure to support mobility. Come join the Samsung Health Cloud Services team and help us define and develop the future role of smartphones and services!  Learn more by clicking here:  http://www.samsung.com/global/galaxy/apps/samsung-health/ Team Vision and Core Values Team Vision Organization: Be the most impactful product team at SamsungService: Empower our users to elevate their health, every day Team Core Values Teamwork: Team and project first. Help others while maintaining your own prioritiesCommitment: All in. Be a trusted professional who delivers whats promised on time and with the highest level of qualityAdaptive: listen and separate signal from noise, embrace uncertainty and be flexible about your approach while maintaining strategic focusResponsibilities Include:Implement, maintain and evolve cloud-based products and servicesIntegrate with external customer and 3rd-party systemsPerform extensive research and analysis to make optimal architecture and design decisionsWrite large amounts of code, perform code reviews, write unit testsWrite documentationInterface with other groups including Product Management, QA and OperationsCreate quick proof-of-concept prototypesParticipate in scrum teamExperience Requirements:MS, 3+ Years, or BS + 6 YearsExperience in server development using Spring Framework and Java EE in AWSBuild ETL pipelines for Data AnalyticsWork with Data Scientist to help build and run new modelsExpertise in atleast one of the public cloud environment (AWS preffered)Work with Operations team to Innovate terraform scriptsStrong skills in one or more of: Java 8, Tomcat, Java EE, Spring BootHands-on understanding of scalability and high availabilityStrong knowledge of SQL and NoSQL databases, including MySQL and CouchbaseApache, Nginx, HAProxyExpertise in Linux (Ubuntu, CentOS), Perforce, GitPreferred Experience Requirements:Amazon Web ServicesREST API DesignSOAPMemcached, RedisJenkinsApache Spark or Storm Samsung is an EEO/Veterans/Disabled/LGBT employer. We welcome and encourage diversity as we strive to create an inclusive workplace."}