{"jobID": "2733293387", "jobLocation": "Reston_VA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.alqimi.com", "Headquarters": "Rockville, MD", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Data Scientist Key focus areas: Big Data, Enterprise Analytics, Cognitive Computing What you will be doing! The Data Scientist will apply their knowledge of sophisticated Natural Language Processing and Machine Learning, as well as provide data analytic service to our customers. You will develop sophisticated algorithms and applications. Mathematical and statistical knowledge is needed in this role. Development skills in Python are highly desired. What you will needExperience working with Big Data environmentsStrong knowledge of machine learning and statisticsFamiliar with analytics librariesIntermediate to advanced Mathematical and Statistical experienceExperience with deep learning frameworksExperience with data manipulation and analysis tools  - Demonstrated knowledge and application of statistical, programming, and data management tools these may include SAS, R, SPSS; Python, SQL, JAVA; Hadoop tools, MapReduce, NoSQL, Hbase- Highly self-motivated and directed, with keen attention to detail.Team-oriented and skilled in working within a collaborative team environmentProven analytical and problem-solving abilities.Able to effectively prioritize tasks in a high-pressure environment.Strong customer service orientation.Experience working in a team-oriented, collaborative environment.Working knowledge of appropriate analytic methods and methodological tools in one or more of the following areas Applied mathematics (e.g., probability and statistics, formal modeling, computational social sciences); Computer programming (e.g., programming languages, math/statistics packages, computer science, machine learning, scientific computing)Clearance TS/SCI with Polygraph Education Bachelor's degree in Computer Science, IT Management, Computer Engineering. (Master's degree is a plus.) BenefitsCompetitive salaryComprehensive health insurance planEmployee Referral Bonus Program401(k) retirement plan with company paid contributionPaid Time Off + 9 holidaysWe truly believe the right work-life balance can exist, and it's here at ALQIMI. Our work is extremely important, but your job is just a part of who you are. When you enjoy your life outside of our walls, you're at your best the next time you walk through our doors. We do all we can to assure that happens every day.Who are we? Headquartered in Rockville, MD, ALQIMI has developed an outstanding track record of designing, integrating, and managing complex technological solutions for customers around the world. Our IT services group is our founding heritage and services the intelligence and commercial communities with technologically sophisticated services including cybersecurity, big data, and software development. We take pride in using our demonstrated ability to build profitable businesses, subject matter expertise and ecosystems to incubate new ideas. We have established new businesses in the data analytics, military facilities construction management and energy industries and intend to incubate additional opportunities.  What makes ALQIMI unique is that we offer challenging projects, excellent benefits, work/life balance, and a fair and ethical executive team.  ALQIMI provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, national origin, marital status, age, disability (including disability due to pregnancy) or genetics, protected veteran status, or any other characteristic protected by law. ALQIMI complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment.  More information about ALQIMI can be found at www.alqimi.com."}