{"jobID": "2816454038", "jobLocation": "Los_Angeles_CA", "jobTitle": "Sales Analytics Manager", "companyRating": "3.6", "companyInfo": {"Website": "www.capitalgroup.com", "Headquarters": "Los Angeles, CA", "Size": "5001 to 10000 employees", "Founded": " 1931", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "155000", "jobDescription": "Req ID: 21721 Experience Level: Manager  Other Location(s): N/A Relocation offered: Yes Travel required: None Come grow with us At Capital Group, how we work is defined by shared values that include absolute integrity, respect and collaboration. But it’s more than that. It’s smart and highly driven people united in purpose to serve our investors and one another.  Bring your energy and unique perspective to Capital and you’ll have the opportunity to grow with us professionally, personally, and financially. You’ll be part of a team that genuinely cares about helping you succeed. You’ll work alongside talented colleagues, many of whom build long careers while progressing through multiple roles, establishing lifelong friendships and making a difference in our communities. In return for your contributions, you’ll receive premier compensation and benefits, and a company-funded retirement plan that ranks among the most generous.  The Sales Analytics Manager is a key member of the Finance and Sales Compensation team which supports accurate and transparent compensable sales reporting at Capital Group. In this role you will contribute to building and managing the incentive compensation management processes in a new system called Anaplan. Responsibilities:Create and manage system business processes including: trade matching, sales crediting rules, locating old money, dispute resolution, and territory maintenance.Align Anaplan system functions and flexibility with the incentive compensation program needs of North American Distribution (NAD) through process design, refinement and documentation.Manage monthly territory compensable sales attribution analysis.Create ongoing reporting and transparency at the transaction level for all incentive compensation programs.Drive change in the Anaplan system, build new use cases, drive efficiencies, increase system awareness, identify opportunities, navigate through and around obstacles in support of the business.Partner with technical resources to structure the environment appropriately; Data Governance to maintain system and data integrity and Sales Leadership and Sales Operations to gather business requirements to structure the Anaplan system to meet business needs.Hire and develop a staff of Sales Analysts to focus on building Anaplan models, designing system processes, conducting research and analytics, and maintaining the Anaplan system to execute on all sales compensation related program needs for NAD.Provide coaching, mentoring and feedback on work output in an effort to develop associates while giving them the support they need to growQualifications:5-8+ years of related experience with sales crediting or incentive compensation management with a consistent track record of leveraging systems, process and data to drive significant business impactBachelor’s degree in : Business, Accounting, Statistics, Math, Finance, Economics, Engineering or related fieldProficient in managing sales crediting rules, trade matching processes and territory and quota systems for large sales organizationsDemonstrates intellectual curiosity and analytical skills in areas of high complexityMeaningful experience in problem solving and research skills, exercises excellent judgment, planning and decision making skills; recognizing when to escalate an issue to management.High client service orientation, integrity, and ownership of workPrevious experience in mentoring, development and/or the review of associates' work   Company Overview: Founded in 1931, Capital Group is one of the world’s largest and most trusted investment management companies and home to the American Funds. We manage more than US$1.39 trillion in assets, and our 7,500 associates make our clients their first priority every day. When we do our job right, millions of investors around the world fulfill their dreams and financial goals, from home ownership and higher education, to a comfortable retirement. Our long-term investment results and outstanding service set us apart from our competitors, while our workplace sets us apart from other employers.     We are an equal opportunity employer, which means we comply with all federal, state and local laws that prohibit discrimination when making all decisions about employment. As equal opportunity employers, our policies prohibit unlawful discrimination on the basis of race, religion, color, national origin, ancestry, sex (including gender and gender identity), pregnancy, childbirth and related medical conditions, age, physical or mental disability, medical condition, genetic information, marital status, sexual orientation, citizenship status, AIDS/HIV status, political activities or affiliations, military or veteran status, status as a victim of domestic violence, assault or stalking or any other characteristic protected by federal, state or local law. "}