{"jobID": "2556508006", "jobLocation": "Arlington_VA", "jobTitle": "Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.snapinc.net", "Headquarters": "Chantilly, VA", "Size": "51 to 200 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "52000", "jobDescription": " Company DescriptionSNAP Inc. provides professional services that empower Government and private industry clients to address tomorrow’s challenges through better alignment of technology with their mission and business objectives. Employees of SNAP Inc. receive Paid Leave, Medical and Dental coverage (employee is paid for 100% by the company; dependents 50%), Life and Disability Coverage, and other benefits.  We are growing our business on a culture of employee engagement. If you are a team-centric, creative professional seeking a challenging and fulfilling career, come grow with us!Job DescriptionThe Data Analyst will provide Business Intelligence (BI) Data Warehouse Environment – Governance, Planning, and Monitoring and shall execute all activities necessary to maintain the data warehouse environment. Your role will also include involvement in the Business Intelligence security environment (user access levels review) activities, as well as Data Archiving and performing planning and preparation of useful data. Sponsorship is not available for this position.Responsibilities Establish goals and plans that meet project objectives.Plan, organize, and conduct research in a variety of areas, such as new or existing products, science, social science, law or business, etc. in support of an IT initiative.Search sources such as reference works, literature, documents, newspapers, statistical records, and other sources of information.Use Internet, Intranet, magazines, periodicals, journals, and other media to perform research.Analyze information and statistical data to prepare reports and studies for use by professionals.Prepare and maintain accurate technical and functional documentation.Participate in daily test, development, and production data environment operations and monitoring.Monitor access to the Business Warehouse reporting functionality.Perform reviews of technical processes and data security associated with third-party government or commercial data warehouse and reporting environments.Perform reviews of processes and controls for sensitive and other restricted information resident in the data warehouse environment.Employ processes and controls for data security that meet ONR internal and external organization policy, regulations, and guidance.Support monitoring and operations in accordance with defined strategy and processes.Conduct periodic reviews of existing configuration, functional, and technical documentation for accuracy.Prepare new documentation or maintain existing documentation.Maintain a useable configuration management library in accordance with best practice approaches.Support requests for documentation, clarification of documentation, or other audits as necessary.Provide quarterly review of existing Standard Operating Procedures (SOPs) and desk guides documenting processes performed and update if processes have changed.Prepare, monitor, and update Business Intelligence environment configuration, functional, and technical documentation necessary for audit purposes.RequirementsBA/BS and 6-8 years direct relevant experience.Security clearance at Secret level or higher, or the ability to obtain Secret clearance.Certifications: Security+, or certification corresponding to Information Assurance Technical Level II.Knowledge of DoD 8500.1 Department of Defense Information Assurance Policy) and DoD 8500.2 (Department of Defense Information Assurance Implementations).Two references with email address and phone numbers.Experience within the last (3) years with: Demonstrated migration of BI environment and tools.Demonstrated experience with Oracle eBusiness and SAP tables (ETL and reporting).Demonstrated experience of merging disparate systems performing similar business functions into a consolidated reporting environment.Demonstrated experience working with Informatica, Netezza/Pure Data for Analytics, BoBJ and Oracle OBIEE.Demonstrated experience with information design.Work Location: Arlington, VA Salary: Negotiable To Apply Please submit resume with salary requirements to resume@snapinc.net SNAP, Inc. is an Equal Opportunity Employer (EOE)"}