{"jobID": "2828286206", "jobLocation": "Chicago_IL", "jobTitle": "Computational Biologist - RNA", "companyRating": "3.3", "companyInfo": {"Website": "www.tempus.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": " Passionate about making a difference in the world of cancer genomics?  With the advent of genomic sequencing, we can finally decode and process our genetic makeup. We now have more data than ever before but providers don't have the infrastructure or expertise to make sense of said data. Here at Tempus, we believe the greatest promise for the detection and treatment of cancer lies in the deep understanding of molecular activity for disease initiation, progression, and efficacious treatment based on the discovery of unique biomarkers.  We are seeking an independent and motivated Computational Biologist to join our Computational RNA group. This individual will work in an interdisciplinary team to study transcriptome profiles in cancer using unique and growing collections of genomic data coupled with clinical data. The successful candidate will work in an interdisciplinary team, carry out data analysis, and apply best-in-class algorithms - or develop new algorithms - that directly address important biological and clinical questions.  What Youll Do Design, develop and execute computational research projects of high complexity.Evaluate new emerging technologies in relevant fields.Communicate highly technical results and methods clearly to non-technical audiences.Interact cross-functionally with a wide variety of people and teams. Required Qualifications: PhD degree in a quantitative discipline (e.g. statistical genetics, cancer genetics, bioinformatics, computational biology, or similar). Alternately, a PhD in molecular biology combined with a very strong record of high-throughput sequencing data analysis, or equivalent practical experience.Fluent with R, Python, or similar.Experience developing, training, and evaluating classical machine learning models.Previous experience working with large transcriptome data sets. Preferred Qualifications: Significant quantitative training in probability and statistics.Demonstrated willingness to both teach others and learn new techniques.Familiarity with common RNAseq databases such as TCGA, GTEx, and CCLE.Experience in network analysis.Experience working with Docker containers and cloud-based computing environments."}