{"jobID": "2803164849", "jobLocation": "Washington_DC", "jobTitle": "Program Manager - VA", "companyRating": "3.0", "companyInfo": {"Website": "www.gcctechllc.com", "Headquarters": "Oakland, MD", "Size": "201 to 500 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " E9 Corporation, Government Contract Solutions, The Tolliver Group"}, "estimatedSalary": "96000", "jobDescription": " GCC Technologies, LLC is a VA verified Service Disabled Veteran Owned and a SBA certified HUBZone small business specializing in Acquisition & Program Management, Administrative Support, IT Support and Training Services. GCC was awarded the 2008 Maryland Incubator Company of the Year Award. GCC is searching for a highly experienced Program Manager to support a pending proposal supporting the Department of Veteran Affairs located in Washington, DC. The purpose of this contract is to lead human capital management strategies, policies, and practices, which cultivate an engaged, proficient, and diverse workforce to transform and continually improve services to Veterans and their families. Description: The primary objective the Human Resources and Administration Initiatives is to develop the Department of Veterans Affairs (VA) human capital into a proactive, forward looking, and professional workforce. These initiatives include a focus on improving the recruitment, hiring and retention of VA employees; investing in people development (e.g., skills and leadership training); supporting and developing the capabilities of our Senior Executive Service (SES) employees; and, striving to build a broad set of human resources capabilities to support the delivery of quality care and benefit services to Veterans and their families.  The Program Manager shall lead the delivery of support to the Program Offices that manage all HR&A; initiatives and shall be accomplished through portfolio management approaches, project management process governance and oversight, and support of contract actions and interagency agreements using a distributed asset concept. The majority of monitoring and oversight is maintained specifically within MP&A.; Program Management Office (PMO) assets, consisting of Business Analysts/Program Oversight Managers (POMs) are also located within various HR&A; offices or business lines to assist in development and management of transformational initiatives.  A Program Manager has subject matter expertise for his/her field of expertise, capable of analyzing complex situations and using broad knowledge, understanding and interpretation of the applicable subject to recommend the best course of action to resolve the task. Develops project priorities and critical project milestones. Once plans are reviewed and approved, independently carries out or supervises subordinates in all aspects of the work, coordinating with other agencies, groups and personnel as necessary. Resolves problems or conflicts when necessary. Supports negotiations and meets with high-level business, industry, scientific and government officials in performance of their duties. Essential Functions:Proficient in the following Microsoft applications: Word, Excel, PowerPoint, OutlookAbility to communicate effectively, both orally and in writing, with senior personnelAbility to read and interpret government policy, regulations, and directives and to apply those interpretations fully and legally to all activities described in the SOWAssist the client in execution of targeted program goalsQualifications:PMP certification requiredBachelor’s degree required, preferably in the following disciplines: business, industrial management, marketing, quantitative methods, or organization and management.Experience with the Department of Veterans Affairs, either as a Program Manager or as a veteran.A minimum of seventeen (17) years of experience in performing program management support services and/or acquisition support activitiesKnowledge of pre-audit, audit, and post audit and follow up activities.Experience with verifying effectiveness of corrective action, close out an audit and conduct follow-up surveillances.Ability to build a strong relationship with the client. GCC Technologies LLC is an equal opportunity employer regardless of race, color, religion, creed, sex, marital status, national origin, disability, age, veteran status, on-the-job injury, sexual orientation, political affiliation or belief. Employment decisions are made without consideration of these or any other factors that employers are prohibited by law from considering. Any discriminatory action can be a cause for disciplinary action.  GCC Technologies LLC also prohibits discrimination against individuals with disabilities and will reasonably accommodate applicants with a disability, upon request, and will also ensure reasonable accommodation for employees with a disability. VETS encouraged to apply."}