{"jobID": "2492400320", "jobLocation": "Chicago_IL", "jobTitle": "Big Data Consultant", "companyRating": "3.8", "companyInfo": {"Website": "www.accenture.com", "Headquarters": "Dublin, Ireland", "Size": "10000+ employees", "Founded": " 1989", "Type": " Company - Public (ACN) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Cognizant Technology Solutions, EY, McKinsey & Company"}, "estimatedSalary": "72000", "jobDescription": " YOUR EXPERIENCE: Basic Qualifications  • Minimum 1 year of building and deploying Java apps  • Minimum 1 year of building and coding applications using at least two Hadoop components MapReduce, HDFS, Hbase, Pig, Hive, Spark, Scoop, Flume, etc  • Minimum 1 year of coding, including one of the following: Python, Pig programming, Hadoop Streaming, HiveQL  • Minimum 1 year implementing relational data models  • Minimum 1 year understanding of traditional ETL tools & RDBMS  • Minimum of a Bachelors Degree or 3 years IT/Programming experience  SET YOURSELF APART: Preferred Qualifications  • Full life cycle Development  • Minimum 1 year of experience Developing REST web services  • Industry experience (financial services, resources, healthcare, government, products, communications, high tech)  • Experience leading teams  • Data Science and Analytics (machine learning, analytical models, MAHOUT, etc.)  OUR COMMITMENT TO YOU  · Your entrepreneurial spirit and vision will be rewarded, and your success will fuel opportunities for career advancement.  · Youll make a difference for some pretty impressive clients. Our Mobility practice serves many of the Fortune Global 100 on high-profile projects.  · Opportunities to learn daily through training, assignments and collaboration with experts across the company.  · Access to leading-edge technology.  · Along with a competitive salary, Accenture offers a comprehensive package that includes generous paid time off, 401K match and an employee healthcare plan. Learn more about our extensive rewards and Benefits  CALL TO ACTION  Now is the time to become a digital disrupter. The opportunity is herewhats stopping you from pursuing it?Applicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States and with Accenture (i.e., H1-B visa, F-1 visa (OPT), TN visa or any other non-immigrant status). Candidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration. Accenture is an EEO and Affirmative Action Employer of Females/Minorities/Veterans/Individuals with Disabilities.Equal Employment Opportunity: All employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law. Job Candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process. Accenture is committed to providing veteran employment opportunities to our service men and women."}