{"jobID": "2825617044", "jobLocation": "San_Antonio_TX", "jobTitle": "ANALYST - RESEARCH ANALYST - DATA SCIENCE", "companyRating": "3.9", "companyInfo": {"Website": "www.swri.org", "Headquarters": "San Antonio, TX", "Size": "1001 to 5000 employees", "Founded": " 1947", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Los Alamos National Laboratory, Battelle, SRI International"}, "estimatedSalary": "74000", "jobDescription": "Job Summary: Perform analysis on large multi-phenomenology data sets, develop and refine data visualization tools for presentation and analysis, develop solutions for complex data science problems for integrated systems, performance monitoring, and long-term data fusion applications. Help solve complex problems in unmanned systems, signal classification, multivariate sensor systems, machine vision, control systems, information networks, etc. Have the opportunity to work in a stimulating environment on diverse technical challenges in applied research and development. Job responsibilities include: providing technical leadership in the development and application of advanced machine learning solutions for clients; hardware/software/systems design, implementation, testing, and integration; initiating advanced research and development programs; interacting with clients; conducting technical presentations; and leading the preparation of proposals and cost estimates. Travel on an as needed basis may be required. Education/Experience: Requires a BS or MS degree in Computer Engineering, Computer Science, Electrical Engineering, Mathematics, Physics, Data Analytics, Data Science, or other related degree field. Must have at least a 3.0 GPA. Bachelor candidates must have 2-3 years of related industry experience. Coursework or experience is highly desired in one or more of the following: data analytics / big data, GPU, and CPU programming, and digital signal processing(DSP). Must be familiar with application programming and testing; experience with .NET languages and Java is highly desired; experience with design and creation of databases (MySQL, SQLite, Access, etc.) is a plus. Must be familiar with scripting languages and mathematical manipulation software such as MATLAB and/or Python. Excellent verbal and written communication skills is required; must be able to work in project team environments and independently. Current TS/SCI clearance is a plus. Special Considerations: Applicant selected will be subject to a government security investigation and must meet eligibility requirements for access to classified information. Applicant must be a U.S. citizen."}