{"jobID": "2801733917", "jobLocation": "Ne_Jersey", "jobTitle": "Assistant Vice President - Senior Referential Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.group.bnpparibas", "Headquarters": "Paris, France", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Public (BNP) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "BNP Paribas is a leading bank in Europe with an international reach. It has a presence in 74 countries, with more than 192,000 employees, including more than 146,000 in Europe. The Group has key positions in its three main activities: Domestic Markets and International Financial Services (whose retail-banking networks and financial services are covered by Retail Banking & Services) and Corporate & Institutional Banking, which serves two client franchises: corporate clients and institutional investors. The Group helps all its clients (individuals, community associations, entrepreneurs, SMEs, corporates and institutional clients) to realize their projects through solutions spanning financing, investment, savings and protection insurance. In Europe, the Group has four domestic markets (Belgium, France, Italy and Luxembourg) and BNP Paribas Personal Finance is the leader in consumer lending. BNP Paribas is rolling out its integrated retail-banking model in Mediterranean countries, in Turkey, in Eastern Europe and a large network in the western part of the United States. In its Corporate & Institutional Banking and International Financial Services activities, BNP Paribas also enjoys top positions in Europe, a strong presence in the Americas as well as a solid and fast-growing business in Asia-Pacific.www.cib.bnpparibas.comBusiness Overview:The Intermediate Holding Company (“IHC”) program structured at the U.S. level across poles of activities of BNP Paribas provides guidance, supports the analysis, impact assessment and drives adjustments of the U.S. platform’s operating model due to the drastic changes introduced by the Enhanced Prudential Standards (“EPS”) for Foreign Banking Organizations (“FBOs”) finalized by the Federal Reserve in February 2014, implementing Section 165 of U.S. Dodd-Frank Act.Business Overview:The Enterprise Data Management Department was created in 2015 to setup, drive and continuously improve the way data is handled throughout the organization in the U.S. under the leadership of the CIB/IP Chief Data Officer. It looks to satisfy the requirements related to principles for effective enterprise data aggregation and reporting, and is intended to support evolving regulatory requirements. Specifically the team provides support to all other units within EDM (Data Management, Data Governance, Data Quality) and also handles directly a number of projects.The EDM Department has been established with the following 3 pillars:Data Governance: set the framework for developing and formalizing the “know your data” culture including formal governance forums, data certification and attestation processes. The team also captures, challenges, and tests the control framework of the bank in particular through a risk-based data trace program.Data Management: determine the data strategy for the platform with the objective of identifying and adopting golden sources, capturing and maintaining data glossaries and dictionaries, business and functional lineage from source to output as well as managing referential dataData Quality: establish a framework to assess and report on the quality of the data used for reporting purposes and an effective remediation teamIn addition the department is supported by the Transversal Business Support group that includes a Project Management Office and Tools & Processes teams aiming at defining the technology strategy for EDM and providing business analysis capabilities including process design and optimization.The Data Management Team is part of the overall Enterprise Data Management program which looks to satisfy the requirements related to principles for effective enterprise data aggregation and reporting, and is intended to support evolving regulatory requirements. It includes:Data Operations which is a watch tower providing end-to-end oversight over the report production cycle by integrating all of the process control viewsData Strategy which looks to defining and ensuring adoption of golden source, capturing and maintaining business glossaries, data dictionaries as well as documenting functional and technical lineageData Science and Analytics whose objective is to define and deploy predictive analytics to enable the platform to proactively detect potential data issuesReferential Data Management whose role is to define, enforce usage and ensure the highest quality for the referential data sets (including, but not limited to, 3rd party, securities, foreign exchange, rates, product, business line, legal entities) necessary for the production of US regulatory reporting in collaboration with global teamsResponsibilitiesThe role will report to Referential Data Manager and will be responsible for performing the relevant activities in support of the objective to setup and adopt a single referential data set for all US regulatory reporting.A subject matter expert on referential data used for the US regulatory reporting across their type (3rd party, securities, FX rates etc.)Perform business analysis and document business requirements leading to the setup of a centralized data set that would be consumed for all US regulatory reporting requirementsDefine control requirements associated with this data set so as to reduce the operational risk linked to its use to the minimumPartner with Client Management ITO and various business lines to implement process enhancements and augment the control framework as necessary around referential data captureDefine data quality rules on referential data and coordinate their implementation and the production of key quality indicatorsDocument functional and ensure the documentation of technical lineage for all referential data sets in coordination with head office teams managing our centralized platformsSupport the definition of business terms associated with referential data to be used as a referent framework for the platformPropose business definitions and unified business processes to populate and control shared data throughout the enterpriseIdentify root causes and remediation of sourcing and data quality issuesLiaise with Data Governance to support the data community development by contributing referential data conversationsFoster collaboration with Bank of the WestDevelop and maintain knowledge on the BCBS239 guidance as well as the RaDAR program implementation so as to constantly adjust, as relevant, your activities to the approach promoted by the GroupMinimum Required Qualifications:Bachelor degree required in finance, technology or related fieldAt least 5 to 7 years of industry experience as a business analysis with at least 2 years on referential information related projectsExcellent written and oral skillsGreat interviewing skillsExperience with process/data flow mappingVery organized and structured individualHigh quality written deliverables with an ability to render complex concepts and notions in a visual wayHigh proficiency with the Office suitePreferred Qualifications:Knowledge of BNP Paribas proprietary referential systems a significant plusFINRA Registrations Required:Not ApplicableBNP Paribas is committed to providing a work environment that fosters diversity, inclusion, and equal employment opportunity without regard to race, color, gender, age, creed, sex, religion, nationalMinimum Required Qualifications:Bachelor degree required in finance, technology or related fieldAt least 5 to 7 years of industry experience as a business analysis with at least 2 years on referential information related projectsExcellent written and oral skillsGreat interviewing skillsExperience with process/data flow mappingVery organized and structured individualHigh quality written deliverables with an ability to render complex concepts and notions in a visual wayHigh proficiency with the Office suitePreferred Qualifications:Knowledge of BNP Paribas proprietary referential systems a significant plusFINRA Registrations Required:Not ApplicableBNP Paribas is committed to providing a work environment that fosters diversity, inclusion, and equal employment opportunity without regard to race, color, gender, age, creed, sex, religion, national origin, disability (physical or mental), marital status, citizenship, ancestry, sexual orientation, gender identity and gender expression, or any other legally protected status.BNPPRSR"}