{"jobID": "2795739844", "jobLocation": "Lisle_IL", "jobTitle": "Service Analytics Manager", "companyRating": "3.5", "companyInfo": {"Website": "www.extenetsystems.com", "Headquarters": "Lisle, IL", "Size": "201 to 500 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Telecommunications", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Crown Castle, CommScope, Zayo"}, "estimatedSalary": "111000", "jobDescription": " General Information:Job Type: Full TimeSalary: Commensurate with ExperienceLocation: Lisle, ILIndustry: Technology Services or Wireless Telecommunications ServicesYears of Experience: 10-12 yearsEducation: Bachelor Degree or equivalent experience requiredReports to: Vice President, Global ServicesStart Date: ImmediateTo Apply: Contact Patti Martin, Talent Acquisition ManagerCapsule:The Services Analytics Manager will bring a systems level approach to the structure, organization, policies, and procedures used across Global Services in the forecasting, planning, costing, quoting, pricing support, and end-to-end services transaction flows that are initiated, managed, and administered within Global Services. This will include work planned, managed, and administered by our Services Business Analysts, Network Operations, Field Operations, and Performance Management groups. In addition, this role will work closely with, and manage a significant volume of information exchange with ExteNet Finance.  The ideal candidate brings demonstrated success in bringing data analysis and data management solutions that provide management and executive staff insight, and decision support to drive decisions and achieve desired business results. A key driver for the establishment of this new position is to assist management and executive staff who are operating at new, increased levels of scale, velocity, complexity, and competitive challenge.  In this role, we expect you to have strong logical reasoning skills, critical thinking skills, and business acumen. The ability to engage, influence, and communicate effectively across a wide range of internal stakeholder groups is essential.  Key objectives include the management of our services cost recovery, revenue, service level commitment reporting, and systems level information flows to support the consistent achievement of excellence in financial administration, operational quality, and customer service.Key Responsibilities: Understand our corporate and business unit business needs and objectivesAccurate, high integrity, timely information tracking and reporting in support of services revenue planning, forecasting and invoicingDevelop strategies and methods for effective business administration, data analysis, and reportingRecruit, train, develop, mentor, and supervise analyst level employeesEnsure accuracy of data and deliverables of reporting employees with documented, well maintained policies and processesWork directly with Finance to provide periodic updates and general analysisRecommend, develop, and support the production, adoption and use of business unit metricsBuild systems to transform data and information into actionable business insightsLead cross-functional projects using data modeling and analysis techniques that will illuminate, validate, and bring understanding to areas of opportunity for improvementWork with Global Services management, IT, and Finance to acquire, adapt, develop and maintain data models, reporting systems, data automation systems, dashboards and performance metrics support that support key business decisionsOversee the design and delivery of reports and insights that analyze business functions and key operations and performance metricsManage and optimize processes for data intake, validation, mining and engineering as well as modeling, visualization and communication deliverablesApply industry knowledge to interpret data and improve performanceKeep abreast of industry, customer, and competitor news and trendsRequirements:12-15 years overall work experience, with minimum 5-7 years providing business and operations support in a customer facing technology services or wireless telecommunications related services business.5-7 years direct customer service and customer engagement experience.5-7 years directly supporting both centralized and distributed customer facing services professionals.5-7 years direct experience in the development, documentation and maintenance of work procedures, work standards, templates and instructional guides in support of a technology services business.Proven experience as an Analytics Manager or Data Scientist. A strong working knowledge of service-based contracts and legal terminology. Moderate wireless telecom technical ability to understand invoice details, and match elements to associated contractual entitlements.Solid experience in data analysis, technology services business administration, with specific experience in telecommunications markets.Backgrounds in customer service, commercial transaction process flows, and services project management.Knowledge of Excel and SQL; familiarity with business intelligence tools (e.g. Microsoft BI, Tableau, SAS). Superb oral, written, and presentation communication skills.Analytical skills and strong organizational abilities.Attention to detail.Strong problem-solving / critical thinking aptitude.Thorough knowledge of customer entitlement concepts and practices in a technology services business.Thorough knowledge of customer information and data security management and compliance concepts and practices in a technology services business.Thorough knowledge of customer ticketing and case management methods, processes and systems.Thorough knowledge of services business and operational performance metrics and reporting.Familiarity with current IT methods and practices in support of a technology services business that includes centralized remotely delivered customer services and distributed field delivered customer servicesBA/BS in Computer Science, Statistics, Data Management, Business or demonstrated equivalent experience"}