{"jobID": "2735580902", "jobLocation": "Rockville_MD", "jobTitle": "Data/Requirements Analyst - SQL, Raw Data, Technical Writing", "companyRating": null, "companyInfo": {"Website": "www.bcforward.com", "Headquarters": "Indianapolis, IN", "Size": "1001 to 5000 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Category : Information Technology  Location/City : MD - Rockville  Date Created : 7/21/2015 3:11:08 PMKinetix Technology• is a national IT professional services company that helps companies drive performance by delivering custom IT consulting and professional services. Kinetix Technology provides clients with top-quality IT consultants and technologists in two core areas of Information Technology across the Software Development Lifecycle (\"SDLC\"), Business Intelligence (\"BI\") and Data Management. Kinetix provides skilled applications professionals for all phases of the SDLC. Kinetix consultants specialize in specific technologies and job functions, as well as industry verticals, enabling them to respond to the unique needs of each client. Kinetix's BI offering assists clients in building and deploying architecturally sound, evolvable enterprise-scale information and interoperability architecture, by providing expert consultants or teams. Kinetix Technology provides consultants on a consulting, and staff augmentation engagements, in contract, contract-to-hire and direct hire positions.  Our Client, an industry leader in regulatory compliance within the Capital Markets, has an immediate need for a Data/Requirements Analyst. The Analyst will work with a high performing, senior level team on the creation of predictive analytics and models, data visualization and dashboards for financial surveillance initiatives. The Analyst will work hands on using SQL with large sets of raw data, and will be responsible for understanding business area needs and challenges from the technology perspective, and creating business requirement documents that help shape a solution. Responsibilities:Compile logical business requirement specifications, including business process flows and rules.Serve as a requirements liaison between various functional and technical teams to clarify requirements, as needed.Reverse engineer specifications for programs that have inadequate historical documentation.Perform data analysis and ad hoc query development to assist with internal and external data reporting needs.Qualifications:Bachelor's Degree (preferably in business or computer science) or equivalent work experience.Minimum of 6 years of professional work experience in data analysis, validation and requirements documentation, in options, equities and fixed income trading for hedge funds, broker dealers, trading firms or i-banking.Proficient at technical business writing, including business requirement specifications, workflows, use-cases and other forms of systems documentation.Experience with Oracle Databases required. Knowledge of Access and PL/SQL required.Strong written and verbal technical communication skills.Should be proactive, well-organized and able to handle competing priorities.Ability to work in a fast-paced environment independently, at times. Kinetix is an Equal Opportunity Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, ancestry, citizenship, disability, age, military or veteran status, and other characteristics protected under federal, state and local law."}