{"jobID": "2799579398", "jobLocation": "Houston_TX", "jobTitle": "Scientist -Center for Outcomes Research - Houston Methodist Research Institute", "companyRating": null, "companyInfo": {"Website": "www.houstonmethodistcareers.org", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1919", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " MD Anderson Cancer Center, Memorial Hermann Health System, Texas Children's Hospital"}, "estimatedSalary": null, "jobDescription": "Work Shift: DAY Work Week: M - FJob SummaryJOB SUMMARY The Center for Outcomes Research is recruiting for a Scientist to contribute to its interdisciplinary research portfolio that focuses on improving outcomes of patients treated in tertiary care settings through a) changing clinical practice; b) developing a portfolio of patient centered research initiatives; c) studying methods for enhanced procedural learning by surgeons and other health professionals in non-patient-based settings with simulation; and d) evaluation of various initiatives and technologies focused on achieving population health targets. This position will function as an independent scientist and may be allocated space, resources, and other operational support within Houston Methodist Research Institute. Individuals in this position are expected to have their own extramural funding and publications portfolio. Evidence of teaching, patented or licensed discoveries, extramural recognition, institutional service, collaborative and effective interactions with other faculty and staff, and, where relevant, clinical excellence and performance.  Candidates whose research agenda, experience and/or training includes a concentration in health services research, particularly in outcomes research, are encouraged to apply. PATIENT AGE GROUP SERVED Not Applicable DUTIES AND RESPONSIBILITIESDevelops and manages independent grant portfolioDevelops and publishes in high impact journalsAdministers funds provided by the specific grant(s). (EF)Defines problems and possible solutions as dictated by the research project. (EF)Establishes procedures to be applied for projects. (EF)Designs, develops, or adapts equipment used in experiments or research to obtain desired results. (EF)Coordinates and provides technical direction to the work activities of research staff engaged in projects. (EF)Performs and supervises those procedures which require a highly developed technical skill. (EF)Analyzes data and interprets data. (EF)Reviews scientific literature. (EF)Identifies appropriate internal controls for department; provides mechanisms to monitor and enforce compliance. (EF)Demonstrates the components of the ICARE values statement.Follows all safety rules while on the job. Reports accidents promptly and corrects minor safety hazards. Completes all hospital required and job-related in-services and applies the information as needed.Experience in health services research (healthcare economics and health operations research foci), cancer, heart disease, surgical care, operations research, and cost effectiveness studiesTrack record of scientific achievement reflected by recent publicationsDemonstrated experience working in a diverse environment and fostering positive relationships with a diverse faculty, staff, and physician scientistsAbility to work within multi-disciplinary and multi-institutional teams to produce grant proposals and manuscriptsDemonstrates effective communication skillsMaintains a positive and supportive attitude and demeanorProfessional handling of exposure to confidential/sensitive informationPerforms other duties as assigned.EDUCATION REQUIREMENTS Ph.D. EXPERIENCE REQUIREMENTS Varies CERTIFICATES, LICENSES AND REGISTRATIONS REQUIRED None SPECIAL KNOWLEDGE, SKILL, AND ABILITIES REQUIREDPHYSICAL REQUIREMENTSWORKING ENVIORNMENT Standard laboratory environment; some assignments may be in hospital units with typical hospital environmental hazards and concerns.Equal Employment OpportunityHouston Methodist is an Equal Opportunity Employer. Equal employment opportunity is a sound and just concept to which Houston Methodist is firmly bound. Houston Methodist will not engage in discrimination against or harassment of any person employed or seeking employment with Houston Methodist on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, status as a protected veteran or other characteristics protected by law.  VEVRAA Federal Contractor priority referral Protected Veterans requested.Company ProfileHouston Methodist Research Institute was formed in 2004 to rapidly and efficiently translate discoveries made in the laboratory and the clinic into new diagnostics, therapies and treatments. The research institute was created to provide the infrastructure and support for these endeavors, and to house the technology and resources needed to make innovative breakthroughs in important areas of human disease. A 540,000 square foot building dedicated to research, the research institute houses over 1,500 staff and trainees, 277 principal investigators and has more than 840 ongoing clinical trials."}