{"jobID": "2832896523", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.goaheadsolutions.com", "Headquarters": "South San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Duration: 6 months to start  Work location: San Francisco (onsite) ***W2 and individual Corps only***No 3rd parties We’re seeking a Data Analyst to work as a key technical resource for the portfolio of large corporate projects. The Data Analyst will have deep knowledge in analyzing data with expertise in interpreting data quality for banking solutions, and will be working across organizational boundaries and analyzing and advising on data reporting to enable our deposit business strategy.  The primary duty of the Data Analyst will be to conduct full lifecycle analysis with Business to understand business requirements and then partner with key data resources, technology resources and vendors to formulate critical data requirements and design reporting capabilities. The ideal candidate will be able to evaluate a business requirement, perform end to end data assessment, identify and document the data requirements and recommend appropriate data management solutions. The candidate is expected to be a self-starter, requiring minimal oversight, is results-oriented, with a strong sense of teamwork. The role requires exceptional communication skills and an ability to build and maintain working relationships with team members, vendors, and other departments involved.  In addition to these more general cross functional responsibilities, the Data Analyst will also be responsible for the following: Interpret data, analyze results using known techniques and provide ongoing reportsIdentify, analyze, and interpret trends or patterns in complex data setsPartner with Business to understand business processes and requirementsPartner with key data and technical resources (example, Data Architects, Data Champions, Enterprise Architects, Infrastructure leaders) and vendors to document data requirements and solution.Perform end to end impact assessment for any technical change and how it may impact upstream and downstream systems and processes.Partner with the Testing Lead to provide guidance in overall test strategy and test execution.Support the Business for User Acceptance Test.Locate and define new process improvement opportunitiesDefine Data quality with data analytics and other strategies that optimize efficiency.Identify any needed reporting, instrumentation and analytics in support of automation. Education / work experience: Bachelor's Degree or higher in technology-related field or relevant experience in implementing software for a financial institution.3+ years of banking experience required4-6 years of proven working experience as a data analyst or business data analystTechnical expertise regarding data models, database design development, data mining and segmentation techniquesStrong knowledge of and experience with reporting packages (Business Objects etc), databases (SQL etc), programming (XML, Javascript, or ETL frameworks)Knowledge of statistics and experience using statistical packages for analyzing datasets (Excel, SPSS, SAS etc)Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracyAdept at queries, report writing and presenting findingsHighly adept user of MS Visio, MS Excel, MS Access, and common data analytics tools requiredRelevant experience acceptable as a member of a financial institution or consulting firm.Requires knowledge and proven experience in Agile/SCRUM.Must possess excellent verbal and written communication skills and an ability to build relationships at all levels of the enterprise including external vendors.Demonstrated ability to exercise independent judgment and strategic thinking under a minimum of supervision.Must possess strong interpersonal and organizational skills. Personal skill / competency Strategic perspective and business acumen. Looks toward the broadest possible view of an issue/ challenge; can easily pose future scenarios; can think globally about all aspects of the Bank; can discuss multiple considerations of an issue and forecast them into the future.Communication skills. Demonstrates excellent communication and interpersonal skills; able to communicate clearly and concisely in a variety of settings and styles; is effective in a variety of formal presentation and meeting settings; commands attention and can manage group process during presentation/ discussion.Change management. Gains support for change by providing context and responding with sensitivity to concerns; takes initiative to recommend/ develop innovative approaches to getting things done.Negotiation skills. Negotiates skillfully in tough situations with internal and external groups; can be both direct and diplomatic.Peer relationships. Can quickly find common ground and solve problems for the good of all; is a team player and encourages collaboration. Must be able to travel in a limited capacity.- provided by Dice  Reporting, SQL, XML, ETL, Excel"}