{"jobID": "2650458816", "jobLocation": "Detroit_MI", "jobTitle": "Truck Driver - CDL A", "companyRating": null, "companyInfo": {"Website": "www.altaequipment.com", "Headquarters": "Livonia, MI", "Size": "501 to 1000 employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Caterpillar, AIS Construction, Crown Lift Trucks"}, "estimatedSalary": null, "jobDescription": " Overview About the Company: Alta Equipment Company is one of the Great Lakes leading equipment dealers, offering a wide variety of products including gas and electric forklifts, a diverse line of construction equipment and materials handling products. Alta brings 33 years of experience in service efficiency and fleet management to its customer base, providing rapid response and innovative solutions. We are a growing, progressive, multi-location distributor with 21 locations and over 800 employees based in Michigan, Northern Indiana and Illinois. Our core commitment is to provide outstanding service that exceeds our customers’ expectations. Alta’s Guiding Principles are that we Invest in the Best, we have a Passion for Excellence, we promote Mutual Respect, we are One Team, and we develop relationships that create Customers for Life. We offer an excellent benefit package that includes: Blue Cross Blue Shield health with 3 PPO plans to choose fromDelta DentalEyeMed voluntary visionUNUM company paid life, short and long term disability insurancesVoluntary life and long term disability buy upLegal and identity theft insuranceFlexible and Health Savings AccountsPaid holidaysPersonal and vacation time401(k) with discretionary match ResponsibilitiesOur construction equipment group's Rental department is currently seeking a full-time CDL A driver to transport equipment at our Detroit, MI branch. This position will consist of same day travel across Michigan. Additionally, when there is no equipment to move, then this position will act as a yard specialist. The primary responsibilities of the position consist of, but are not limited to: Timely delivery of equipment and basic upkeep of the truckMaintain daily trip logsAccurately complete paperworkOrganization of the yardVisual inspections of machines for check in and outPhotos of all equipment moving in and out of the facility or on and off truck/trailerCompleting equipment traffic paperwork in an accurate mannerVerification of operator manuals and safety equipmentMaintaining the cleanliness of the exterior of the facilityIncorporate Alta's Guiding Principles into daily activitiesPerforms other duties as assignedQualificationsDesired Skills and Qualifications:Must have at least one year of previous experience driving or military service with MOS Code 88MHeavy equipment hauling and tie down experience is a plusGood mechanical skills, previous wrenching experience is a major bonusMust have clean driving record and valid Commercial Driver’s License (CDL) with a Class A certificationKnowledge of DOT lawsGood people and customer relation skillsPrevious experience operating heavy equipment is necessaryMust be able to work in a fast paced environment with a friendly and professional personalityLanguage Skills - Intermediate: Ability to read and interpret documents such as safety rules, operating and maintenance instructions, and procedure manuals. Ability to write routing reports and correspondence. Ability to speak effectively before groups of customers or employees of the organization.Mathematical Skills - Basic: Ability to add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions, and decimals. Ability to compute rate, ratio, percentage, and to draw and interpret bar graphs.Reasoning Ability - Basic: Ability to apply common sense understanding to carry out detailed but uninvolved written or oral instructions. Ability to deal with problems involving a few concrete variables in standardized situations.Physical Demands/Work Environment:Physical/Sensory Functions: Regularly will talk/hear; Frequently will stand, sit, use hands, reach with hands and arms, climb or balance, stoop, kneel, crouch or crawl; Occasionally will reach with armsVision: No special vision requirements.Lift and/or Move Functions: Regularly up to 50 pounds; Occasionally from 51 to 100+ poundsWork Environment: Regularly will work near moving mechanical parts, exposed to outdoor weather conditions; Frequently will be in non-weather related wet or humid conditions; Occasionally will work in high precarious places, with fumes or airborne particles, toxic or caustic chemicals, and vibration.What We Look For: At Alta Equipment Company, we are looking for candidates who are a cultural fit with our organization and understand that every task and job goes toward fostering customers for life. Along with that, a great attitude that embraces mutual respect and delivering a consistent high energy level that exudes a passion for excellence. Also, we are searching for a skill set that has a high aptitude for the position with a continual focus on investing in one’s profession through additional training and learning.Other Opportunities at Alta: Please visit our careers page at www.altaequipment.jobs to view other openings that may be of interest to you! Job seekers onlyRecruiting/staffing firms - please do not contact the company about this posting"}