{"jobID": "2582211234", "jobLocation": "Plainsboro_NJ", "jobTitle": "Staff Scientist III", "companyRating": "2.8", "companyInfo": {"Website": "www.wuxiapptec.com", "Headquarters": "Shanghai, China", "Size": "10000+ employees", "Founded": " 2000", "Type": " Subsidiary or Business Segment", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "57000", "jobDescription": " Xenobiotic Laboratories (XBL), a subsidiary of the Lab Testing Division of WuXi AppTec, Inc., is a leading contract research laboratory specializing in small molecule bioanalytical, drug metabolism, and pharmacokinetic services to the pharmaceutical, animal health and agrochemical industries. XBL is seeking an Staff Scientist III for their Bioanalytical Department located in Plainsboro, NJ. Primary Duties and Responsibilities:Plans and carries out experiments and associated research assignments. Able to set up the study and using the proper technique/software to carry the experimental phase to completion. Prepare data summary tables for report and/or report.Efficient time management to complete the assigned taskMay act as study director/principal investigator for animal health studies and /or preclinical or clinical studies.Operates and/or oversees the operation of equipment to acquire experimental data.Designs, modifies, constructs, calibrates, and maintains equipment.Compiles, calculates, plots, and analyzes, and with experience, interprets data; records and maintains data in accordance with accepted standards and practices.Assumes responsibility for technical accuracy of work.Thorough understanding of Good Laboratory Practices and EPA, FDA, CVM or other regulations pertaining to the study.Promotes implementation and compliance with XBL safety policies, practices, and procedures in order to maintain a safe work environment and minimize or eliminate injury.Maintains and enhances technical expertise and knowledge of environmental, metabolism chemistry, and/or pharmaceutical areas.Identifies safety hazards and initiates corrective action. Assists in the safety training for subordinates and/or less experienced staff.Assists in training Associate Scientist, Assistant Scientist, and Laboratory Assistant.Other duties as assigned.Experience / Training / Education:Bachelor’s degree in chemistry, biology, or a related discipline5-7 years of relevant experience with advanced responsibilities in research and development, or equivalentExperience within LC/MSAny similar combination of education and experienceKnowledge / Skills / Abilities:Knowledge of commonly used concepts, practices, and procedures within biological or chemical R&D; laboratory settingWell organized, detail oriented, and adaptable to changesEffective oral and written communication skillsEffective interpersonal skillsComputer skills: knowledge of internet research, MS Word, Excel, Outlook, and PowerPointAbility to work under pressure of multiple projects and deadlinesAbility to effectively prioritize workload and manage changes in directionAbility to work in a team environmentFamiliarity with and adherence to regulatory guidelines consistent with XBL requirements Equal Opportunity Employer Minorities/Women/Veterans/Disabled"}