{"jobID": "2836816857", "jobLocation": "McLean_VA", "jobTitle": "Data Analyst Specialist", "companyRating": null, "companyInfo": {"Website": "www.pyramidci.com", "Headquarters": "Alpharetta, GA", "Size": "1001 to 5000 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " TEKsystems, Collabera, Artech Information Systems"}, "estimatedSalary": null, "jobDescription": "Job Description Immediate need for a talented Data Analyst Specialist with experience in the Banking & Financial Industry. This is an 11+ Months contract opportunity with long-term potential and is located in McLean, VA. Please review the job description below. Job ID: 18-26362Key Requirements and Technology Experience:The Business Engineering (BE) group, within the Investments and Capital Markets Business Technology Office (I&CM; BTO), is responsible for delivering and managing technology solutions that support the entire I&CM; division.BE works closely with our customers across the organization to develop/maintain solutions and infrastructure that enhance and streamline business processes.We also support critical data-centric infrastructure and processes vital to I&CM.;The candidate will work closely with BE team members, business partners, and IT teams to support a range of small- to medium-sized projects within I&CM.;We are seeking a self-motivated leader who can provide system analysis and project management support.Create business requirement documents.Create UAT test cases and any related artifacts.Document test results and training materials.Coordinate deployments by creating pre- and post-deployment tasks.Work with developers to ensure defect fixes and issue resolutionTrack project status and report to senior management..Develop and troubleshoot sql queries; support creation of DDL scripts.Develop solutions using tools like Dataflux, Python, and shell scripts.Strong data and financial analytical skills.Knowledge of fixed income products, especially mortgages.Experience with databases (Sybase, DB2, SQL Server, Oracle).Previous experience supporting multiple concurrent efforts/projects in various capacities.Application development and support experience.Experience with tools like Dataflux, Python, and Schell scripting.Excellent interpersonal, team, verbal, written and listening skills.Bachelor Degree5 Years Experience Our client is a leading Banking & Financial Industry and we are currently interviewing to fill this and other similar contract positions. If you are interested in this position, please apply online for immediate consideration."}