{"jobID": "2678322199", "jobLocation": "San_Diego_CA", "jobTitle": "SoC Performance Modeling Engineer", "companyRating": null, "companyInfo": {"Website": "www.leidos.com", "Headquarters": "Reston, VA", "Size": "10000+ employees", "Founded": " 1969", "Type": " Company - Public (LDOS) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Description:Leidos has an excellent opportunity for a System-on-a-Chip (SoC) Performance Modeling Engineer located in our San Diego, CA office.  The successful candidate will participate in an SoC computer processor design effort, using various processor simulation, design and analysis tools. Modeling tools include SystemC based Transaction Level Modeling (TLM) and Register Transfer Level (RTL).  External Referral Eligible  http://jobs.leidos.com/page/show/SanDiegoASGQualifications:The successful candidate will have the following skills/experience:  • Bachelor's Degree in Computer or Electrical Engineering, Computer Science, or related degree and 12+ years of relevant experience or a Master's degree and 10 plus years experience. Experience in Computer Architecture and processor designExperience doing System-on-a-Chip (SoC) design and analysisExperience in SystemC based Transaction Level Modeling (TLM) or Register Transaction Language (RTL)C++ programming and debugging skillsScripting experience (Perl/Python/Tcl/etc.)Experience analyzing basic computer architecture statistics from simulation runs to evaluate tested designSystemC programming:Experience with TLM interfacesExperience customizing base TLM interfaces5+ years of direct SystemC development experience, with a variety of IPsExperience assembling systems of models with multiple authorsAbility to work well in a multiple-developer environmentComfortable solving complex problemsAbility to work in intensive and changing environmentSelf-motivating, excellent written and verbal communication skills and good interpersonal skillsMust have a US Citizenship and be eligible for a DoD security clearanceDesired Qualifications: Experience with Platform Architect or Linux  SanDiegoASGLeidos Overview: Leidos is a global science and technology solutions leader working to solve the worlds toughest challenges in the defense, intelligence, homeland security, civil, and health markets. The companys 33,000 employees support vital missions for government and commercial customers. Headquartered in Reston, Virginia, Leidos reported pro forma annual revenues of approximately $10 billion for the fiscal year ended January 1, 2016 after giving effect to the recently completed combination of Leidos with Lockheed Martin's Information Systems & Global Solutions business (IS&GS;). For more information, visit www.Leidos.com. The companys diverse employees support vital missions for government and commercial customers. Qualified women, minorities, individuals with disabilities and protected veterans are encouraged to apply. Leidos will consider qualified applicants with criminal histories for employment in accordance with relevant Laws. Leidos is an Equal Opportunity Employer."}