{"jobID": "2729326849", "jobLocation": "Comstock_Park_MI", "jobTitle": "Service & Kitchen Team (2963) - Pre-Open", "companyRating": null, "companyInfo": {"Website": "www.pandacareers.com", "Headquarters": "Rosemead, CA", "Size": "10000+ employees", "Founded": " 1983", "Type": " Company - Private", "Industry": " Restaurants, Bars & Food Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Our Panda Service and Kitchen Team associates are important members of our team and are responsible for bringing Panda’s mission alive in our restaurants by creating food with passion, service with heart and ambiance with pride.Service Team:As a Panda Service Team member, you are responsible for creating a warm and welcoming environment for our guests, making them feel like part of the Panda family. With a keen eye for details and the ability to create moments of happiness and optimism, you ensure our guests receive the best level of service in any interaction.View detail service team job description hereKitchen Team:Panda takes great pride in being industry leaders who continue to define American Chinese food. Our Kitchen team associates are trained to maintain the highest standards of our food including the preparation and culinary precision of our menu offerings, food quality and safety and cleanliness of our restaurant.By having the ability to balance working in a fast-paced and challenging environment while creating a welcoming and lasting experiences for our guests, these positions are the foundation for those who are eager to learn the ins and outs of a Panda Express restaurant and in building a career with us.It will be the hardest job you will ever love.View detail kitchen team job description hereWe offer all Full-Time Associates:Progressive Compensation Package and Bonus Opportunity.Paid Training to prepare you for success.On-Going Career & Leadership Development.Medical and Dental Insurance.401 K with Company Match.Paid Time Off Associate Discounts and free meals when you work.Opportunities for growth into Management positions.Service and Kitchen Team QualificationsEducation and Experience:Some high schoolPrefer some Operations experienceFood Safety: Local/municipal requirements, such as Food Handler certification, acquired at applicant’s own expenseAbout us: Panda Express is part of Panda Restaurant Group, the world leader in Asian dining experiences that also includes Panda Inn and Hibachi-San. At Panda, we all share a common mission: \"Deliver exceptional Asian dining experiences by building an organization where people are inspired to better their lives.\" Guided by this mission, we are a family dedicated to creating an organization that inspires better lives for our people and our communities in which we serve. Whether through sharing good food with guests or providing opportunities for professional and personal growth with associates, all are embraced in our genuine family environment that is uniquely Panda.  Panda was founded in 1983 in Glendale, California Panda Express is the largest family-owned American Chinese Restaurant concept in America. As America’s favorite Chinese restaurant, Panda Express has close to 2,000 locations globally and continues to grow over 100 restaurants annually. "}