{"jobID": "2821617532", "jobLocation": "Milpitas_CA", "jobTitle": "Personal Trainer", "companyRating": null, "companyInfo": {"Website": "www.24hourfitness.com", "Headquarters": "San Ramon, CA", "Size": "10000+ employees", "Founded": " 1983", "Type": " Company - Private", "Industry": " Arts, Entertainment & Recreation", "Revenue": " Unknown / Non-Applicable", "Competitors": " LA Fitness, Crunch Fitness, Life Time Fitness"}, "estimatedSalary": null, "jobDescription": "LOCATION 301 Jacklin Road Milpitas CA 95035  At 24 Hour Fitness we are committed to our mission of helping people--team members and members alike--to become the best version of themselves. We've changed the landscape of the fitness industry and pioneered the concept that fitness can be accessible, affordable and a way of life for everyone. We're looking for committed and dedicated individuals to help grow our business, so that we can share the promise of 24 Hour Fitness with more people. Description*:*  Make a difference every day while building an exciting career in fitness. As a Personal Trainer (PT) at 24 Hour Fitness you will work one-on-one and in small groups with members to help them achieve their fitness goals. Be the spark that inspires someone to keep training, to try harder and to live healthier. We'll help you advance your career through four Personal Trainer levels and access to our network of more than 3 million members. Essential Duties & Responsibilities*:* Demonstrate the value of personal training by creating an outstanding personal training experience for new and existing clientsMake our clubs easy to use by guiding and educating members and clients on comprehensive fitness programs as well as productsMotivate and inspire clients to get results by setting goals, creating customized workout plans and tracking progressPrepare and deliver comprehensive fitness programs based on clients' goals that include appropriate exercise selection and teaching a fitness lifestyle.Qualifications*:* Understand the principles of physical fitness and proper exercise techniqueAble to coach, motivate and inspire members at every stage of their fitness journeyPresent and sell training and nutritional productsProvide exceptional customer service and build a loyal client basePrior Personal Trainer experience is preferred, but not requiredCertifications / Educational Requirements*:* High School Diploma or GEDCardiopulmonary Resuscitation (CPR) and Automated External Defibrillator (AED) certificationDegree in Kinesiology, Exercise Fitness or related field or an approved Personal Training Certification (listed below):ACSM, ACE, Cooper Institute for Aerobics Research, C.H.E.K, IFPA, NASM, NCSF, NESTA, NETA, NFPT, NSCA, PTA Global, W.I.T.S.Physical Requirements*:* Must be able to lift 50 lbs.Physical effort required for daily duties include lifting weights, squatting, bending, reaching, spotting, and prolonged standing and walkingWork Environment*:* While performing the duties of this job the team member is regularly exposed to moving mechanical parts.The noise level in the environment is occasionally loudExtended workdays are a frequent occurrence, as are weekends and holidays as needed to support the businessThis position description intends to describe the general nature and level of work being performed by people assigned to this job. It is not intended to include all duties and responsibilities. The order in which duties and responsibilities are listed is not significant.FUNCTIONAL GROUP Fitness FULL-TIME Part-time"}