{"jobID": "2778763737", "jobLocation": "Adrian_MI", "jobTitle": "Hospice Licensed Medical Social Worker (LMSW)", "companyRating": null, "companyInfo": {"Website": "www.greatlakescaring.com", "Headquarters": "Jackson, MI", "Size": "1001 to 5000 employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OverviewHospice Medical Social Worker Great Lakes Caring understands that the value and quality of our care relies upon the ability and satisfaction of our employees. We prioritize patient care and employee satisfaction above corporate profitability. Because our core values underscore the foundation of our culture, we created I Am Great Lakes Caring to ensure that every employee embraces and is committed to our company's focus and mission. If you share our commitment to delivering superior quality care and loving where you work, then we invite you to join our team of compassionate professionals. JOB OVERVIEW:I am committed to quality. It is at the core of everything I do and every decision I make. The Hospice Medical Social Worker provides skilled social services to patients and their families on an intermittent basis in the patient’s home or facility. The Hospice Medical Social Worker provides psychosocial evaluations, ongoing psychosocial counseling, direct casework services, bereavement services, and community education outreach. My commitment will include:Verifying the Interdisciplinary Plan of Care prior to each visit and providing care according to delegation by the nurse, physician’s orders, assessment data, and established standards and guidelines.Incorporating patient care goals, established in the Interdisciplinary Plan of Care, into nursing visits as evidenced by documentation on the electronic skilled nursing note.Communicating significant findings, problems and changes in condition or environment to the nurse, physician, facility and/or other personnel involved with patient care.Implementing the plan for patient safety, using the patient, family, facility and community resources.Continually assessing patient needs and obtain data on physical, psychological, social and spiritual factors that may influence patient/family/caregiver health status.Demonstrating safe and effective use of various durable medical equipment and other medical devices.Participating in nursing facility care conferences for appropriate patient discussion, consultation and evaluation. Qualifications: Education: Master’s degree in social work from an accredited school of social work approved by the Council of Social Work Education.Licensure: Current State License as a Medical Social Worker.Experience: A demonstrated ability in casework, counseling and group work, including two years of clinical work experience, preferably in either a healthcare setting or hospice.Skills: Social work skills as defined as generally accepted social work standards. Requires excellent verbal and written communication skills with strong interpersonal skills. Knowledge of community and community resources. Knowledge and understanding of hospice philosophy and regulations. Ability to work independently.Transportation: Reliable transportation.I am committed to a caring culture that embraces teamwork and supports the employee. At Great Lakes Caring Home Health and Hospice we want you to love your work and the people you work with, while making a positive difference in the lives of patients. That is why a career at Great Lakes Caring offers: A new challenge that allows you to make your work meaningfulCompetitive compensation based on experienceA full line of benefits including medical, dental and vision insurancePaid vacation and holidaysOpportunities for advancement within our organizationTuition reimbursement and certification testing to help you reach your goalsCOMPANY OVERVIEW:I am committed to integrity, efficiency and the highest ethical standards. Great Lakes Caring Home Health and Hospice is one of the nation’s leading providers of in home health care. Since 1994, Great Lakes Caring has dedicated its resources to providing value-based, high quality care wherever our patients call home. Great Lakes Caring’s primary focus is to provide superior quality health care to those we are honored to serve, utilizing state-of-the-art technology and innovative processes which drive extraordinary patient outcomes. With locations across the country, Great Lakes Caring provides the right care, at the right time, in the right place. Great Lakes Caring is committed to being a great place to work for employees, and is the recipient of Fortune Magazine’s Best Workplaces in Healthcare and Best Workplaces for Millennials awards, in addition to being recognized as a National Best and Brightest Company to Work For."}