{"jobID": "2642040251", "jobLocation": "Pleasanton_CA", "jobTitle": "Data Scientist III (Bioinformatics/Data Analytics)", "companyRating": "3.2", "companyInfo": {"Website": "www.bio-rad.com", "Headquarters": "Hercules, CA", "Size": "5001 to 10000 employees", "Founded": " 1952", "Type": " Company - Public (BIO) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Thermo Fisher Scientific, Abbott Labs, bioMérieux"}, "estimatedSalary": "148000", "jobDescription": " Bio-Rad’s Digital Biology Group is a multidisciplinary team developing products using our Droplet DigitalTM technology that are having a large impact in both research and healthcare. Every day, scientists and clinicians around the world use our ddPCRTM and ddSEQTM NGS sample prep systems to make new discoveries, and are revolutionizing clinical decisions with break-through liquid biopsy applications. We’re looking for an energetic and talented Software Developer III (Data Analytics) to join our team. Lead our Data Analytics team and manage a group of Data Scientists and Statisticians.Work with scientists, statisticians, engineers, marketing, and regulatory personnel to advance Sequencing and ddPCR technologies.Analyze Sequencing and PCR data, develop analytical methods, and build analysis pipeline.Develop data management solutions for internal and external teams.Communicate effectively with various teams and provide documentations/presentations as needed.Support scientists for publications and R&D; engineers for product releases.10+ years of experience in bioinformatics for genomics or diagnostics.3+ years proven leadership experience, managing Data Scientists and Statisticians.Relevant MSc degree required, PhD preferred.Experienced in NGS (RNA-seq, ChiP-seq, DNA-seq), PCR and/or Microarray Data Analysis.Familiarity with NGS processing tools like SAMtools, BEDtools, deepTools, etc.Familiarity with genomics databases such as Ensembl, NCBI Entrez, dbSNP, RefSeq, UCSC Genome Browser.Familiarity with sequence alignment tools like the Tuxedo suite (Bowtie, Tophat, Cufflinks, Cuffdiff), BWA, STAR, etc.Experience with single cell is preferred.Strong computational skill with R, Matlab, C/C++ math library, or JAVA math library.Experienced with one major programming language (e.g. JAVA, C/C++/C#, Python, Perl) in Linux.Experienced with relational and non-relational databases.Understanding of FDA, CE/IVD, CLIA, ISO, or CLSI standards is a plus.A team-oriented contributor that aims to enhance the effectiveness of their colleagues.About Bio-Rad: Bio-Rad is a global leader providing a broad array of clinical diagnostics and life science research products. With a team of more than 7,800 employees and a global network of operations serving our customers, we help people live longer, healthier lives.  Bio-Rad was founded over six decades ago and has continued to provide the healthcare industry with innovative and useful products that help life science researchers accelerate the discovery process and medical diagnostic labs obtain faster, better results.  EEO/AA Employer/Veterans/Disabled/Race/Ethnicity/Gender/Age Agency Non-Solicitation: Bio-Rad does not accept agency resumes, unless the agency has been authorized by a Bio-Rad Recruiting Representative. Please do not submit resumes unless authorized to do so. Bio-Rad will not pay for any fees related to unsolicited resumes."}