{"jobID": "2832771230", "jobLocation": "Dallas_TX", "jobTitle": "Data Engineer", "companyRating": "3.1", "companyInfo": {"Website": "www.dallaspolice.net", "Headquarters": "Dallas, TX", "Size": "1001 to 5000 employees", "Founded": " 1881", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "79000", "jobDescription": " Position PurposeThe salary listed on this job posting is the entire salary range for the position; amount offered will depend upon qualifications.  For information related to Essential Functions, Knowledge, Skills & Abilities Required to Perform Work, and Working Conditions & Hazards of this position, click here. Locate and click on the position title to view the job classification specification.For evaluation purposes, acceptable qualifying experience for all positions must have been in a paid capacity unless noted otherwise in the minimum qualifications for the posted position.Additionally, 30+ hours per week will be counted as full-time employment and will receive full credit for the amount of time employed. A minimum of 15 through 29 work hours per week will be counted as part-time employment and will receive half credit for the amount of time employed.Vacancies currently available in the following department(s): Communication and Information SystemsMinimum QualificationsEDUCATION:Bachelor's degree in computer science, information technology, engineering or math.EXPERIENCE:Five (5) years of experience in designing, building and maintaining data frameworks for data platforms in Linux environment which must have included experience with big data technologies such as Hadoop, HDFS, Sqoop, Hive, BigSQL, Spark, Pig, Flume, Kafka, HBase, Zookeeper, or a similar big data technology.EQUIVALENCIES:A master's degree or higher in a specified field plus three (3) year of the required experience will meet the education and experience requirements.A certification in Big Data Technology plus five (5) years of the required experience will meet the education and experience requirements.OTHER REQUIREMENT(S):No FELONY or Class A misdemeanor convictions.No Class B misdemeanor conviction within the last ten (10) years.No family violence convictionsCannot currently be on deferred adjudication for any felony, class A misdemeanor or class B misdemeanor charge.Experience working with vulnerability scanning tools such as Nessus, protocol analyzer and scanner requiredKNOWLEDGE, SKILLS, ABILITIES:Effective oral and written communication skills.PREFERENCES:Experience with big data technology Cluster Administration in Linux.Experience with data Integration on traditional and Hadoop environments.Experience in information delivery analytics and business intelligence based on data from hybrid of Hadoop Distributed File Systems (HDFS), non-relational and relational databases.Experience in programing languages such as Java, Scala, Python.Experience developing and maintaining cross platform ETL / processes.To view the employee benefits offered by the City of Dallas click here. 01 In the questions that follow, you will be asked about your education, work history and/or current certifications and licenses. Answers given in this supplemental questionnaire must be able to be verified with the information provided in the Education, Work History and/or Certificates and Licenses sections of your application.  Information submitted on attached documents (resumes, cover letters, etc.) WILL NOT be used to determine eligibility for this position.  If you have NOT completed the application requirements, please return to the application and complete the appropriate section(s) before submitting. I have read and understand the above statement 02CONVICTION INFORMATION: An intensive background check will be performed during the interview process. The following are automatic disqualifiers: *ANYFelony conviction *ANYclass A Misdemeanor conviction *ANYclass B Misdemeanor conviction within the last ten (10) years*ANYfamily violence conviction *ANYCURRENT deferred adjudication for any felony, class A or class B misdemeanor chargeI have read and understand the above statement. 03 Please select the choice below which represents your highest level of education completed. Bachelor's degree in  computer science, information technology, engineering or math fieldMaster's degree (or higher) in computer science, information technology, engineering or math fieldNone of the above 04 Do you have a current certification in Big Data Technology? YesNo 05 What is your level of experience in designing, building and maintaining data frameworks for data platforms in Linux environment which must have included experience with big data technologies such as Hadoop, HDFS, Sqoop, Hive, BigSQL, Spark, Pig, Flume, Kafka, HBase, Zookeeper, or a similar big data technology? NoneOne year to less than two yearsTwo years to less than three yearsThree to less than four yearsFour to less than five yearsFive years or more 06 How many years experience do you have working with vulnerability scanning tools such as Nessus or protocol analyzer? One year to less than two yearsTwo years to less than three yearsThree years to less than four yearsfour years to less than five yearsFive years or more 07 What is your level of experience with big data technology Cluster Administration in Linux? BeginnerIntermediateExpert 08 What is your level of experience with data integration traditional and Hadoop environments? BeginnerIntermediateExpert 09 What is your level of experience in information delivery analytics and business intelligence based on data from hybrid of Hadoop Distributed File System (HDFS), non-relational and relational database? BeginnerIntermediateExpert 10 What is your level of experience in information delivery analytics and business intelligence based on data from hybrid of Hadoop Distributed File System (HDFS), non-relational and relational database? BeginnerIntermediateExpert 11 What is your level of experience in programming languages such as Java, Scala and Python? BeginnerIntermediateExpert 12 What is your level 0f experience developing and maintaining cross platform ETL/ ETL processes? BeginnerIntermediateExpert 13 Have you EVER been convicted of a felony or class A misdemeanor? YesNo 14 Have you been convicted of a class B Misdemeanor in the last ten (10) years? YesNo 15 Have you EVER been convicted of a family violence offense? YesNo 16PENDING INFORMATION: Note: If under charges, Civil Service and the City's Personnel Rules require that the charges be disposed of prior to examination or certification for employment.Are you presently under charges (i.e., required to appear in court, pay a fine and/or on deferred adjudication) for any felony, class A or class B misdemeanor charge? YesNoRequired Question"}