{"jobID": "2809419436", "jobLocation": "Westlake_TX", "jobTitle": "Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.verizon.jobs", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Public (VZ) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Microsoft, Google"}, "estimatedSalary": "117000", "jobDescription": "Job Description What you'll be doing...  Verizon is looking for out-of-the-box thinkers. People who are smart, hard-working, and really want to help transform the way we do operations. What we do really matters to the business. This is a great opportunity for you to bring your technical skills and experience to life as part of a team within a team. We operate with a lean startup mentality within a large directional division. You will have the experience and expertise of the best network team in the world behind you as you help the team transform content delivery, mobility, and Verizon's enabling of the Internet of Things.  A successful candidate will have a passion for exploiting open-source tools, a love for gaining insight from data and be comfortable coding, scripting, and contribute with sharing and collaboration. Learning from data flowing through our core systems is part of the vision for transforming operations. Work with large volumes of both structured and unstructured data to aid in decision making cognition.Leverage and support API based approach.Provide architectural input and review of services and APIs for data ingest and dispersal within the ecosystem.Provide service integration techniques for data visualization.Discovery of dependencies, and repeating infrastructure, platform, or application component issues.Troubleshoot and triage problem reports, resolve, and escalate as required.Produce documentation for code, APIs, and procedures. What we're looking for... You'll need to have:Bachelor's degree or four or more years of work experience.Four or more years of relevant work experience.Even better if you have:A degree.Software development (e.g. C++, Java).Scripting (e.g. Python, Shell, Ruby, Perl, other).Linux operating systems:StatisticsData processingMachine learningDatabasesData visualizationHadoop, NoSQL, MongoDBCombination of the following: multivariate calculus, statistics, multimodal signal processing, advanced machine learning, pattern recognition and learning, predictive analytics, and high performance computing.Experienced system architecture and design.Experienced Linux systems administration in virtualized environment.Contributions to open-source projects and/or recent publications. When you join Verizon...  You'll be doing work that matters alongside other talented people, transforming the way people, businesses and things connect with each other. Beyond powering America's fastest and most reliable network, we're leading the way in broadband, cloud and security solutions, Internet of Things and innovating in areas such as, video entertainment. Of course, we will offer you great pay and benefits, but we're about more than that. Verizon is a place where you can craft your own path to greatness. Whether you think in code, words, pictures or numbers, find your future at Verizon.  Equal Employment Opportunity  We're proud to be an equal opportunity employer- and celebrate our employees' differences, regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or Veteran status. Different makes us better."}