{"jobID": "2821840582", "jobLocation": "Dallas_TX", "jobTitle": "Part-time Fraud Protection Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.alleareconsulting.com", "Headquarters": "Dallas, TX", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Part-time Fraud Protection Data Analyst  3 months+  Mclean, VA  IMMEDIATE NEW job opening for a part-time data analyst to join our team and work on-site at our client's global HQ's based in Mclean, VA. This is a part-time data analyst opportunity and will be working on the Fraud Protection team. This individual will support projects detecting and analyzing fraud impacting the team. Primary responsibilities will include oversight and day-to-day management of data analyses and reporting to aid in identifying and remediating corporate fraud, and interpreting data using statistical techniques. The successful candidate will help the team turn data into information, information into insights and insights into business decisions.  Responsibilities:  o Create and modify SQL queries to identify, track, and report on fraud.  o Assist in the production of reports, and provide interpretation of the content  o Identify, analyze, and interpret trends or patterns in complex data sets  o Load, clean, and filter datasets in Excel and Netezza  o Work with management to prioritize business and information needs  o Create ad hoc presentations  o Locate and define new process improvement opportunities  Required Skills:  o Bachelor's degree  o 2-4 years experience in analytical roles  o Intermediate to advanced SQL  o Advanced Excel (Pivot Tables, Macros, etc.)  o Experience working with large datasets (at least millions of records)  o Familiarity with interpreted programming languages (Python, Perl, R, Ruby, etc.).  o Experience with fraud, risk, compliance or similar functions  o Experience with PowerPoint and creating presentations  *To view all of our open positions, please visit: http://www.alleareconsulting.com/job-openings"}