{"jobID": "2817678449", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst - Fixed Income Municipals Analytics Group", "companyRating": "3.8", "companyInfo": {"Website": "www.rbc.com", "Headquarters": "Toronto, Canada", "Size": "10000+ employees", "Founded": " 1869", "Type": " Company - Public (RY) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Barclays, Morgan Stanley, TD"}, "estimatedSalary": "50000", "jobDescription": "Job Description What is the opportunity?  This data analyst will have the opportunity to work in the Front Office for an industry leading broker/dealer in the Fixed Income Municipals Analytics group of the institutional Municipals Sales and Trading division. From your first day on the job, you'll be given specific responsibilities that impact the business right away.  What will you do? Run data analytics on the Municipals algorithmic trading platform and the Municipals marketCreate visualizations to illustrate analyticsWork with strategists to identify trends and improve strategic approach to algorithmic tradingAssist in design of big data pricing models; handle feature engineering and ETL jobs in PythonCollaborate with senior strategists, senior management, traders, data scientists, analysts and developersProactively identify operational risks/ control deficiencies in the businessReview and comply with Firm Policies applicable to your business activitiesEscalate operational risk loss events, control deficiencies and risks that you identify to your line manager and the relevant risk and control functions on a timely basis. What do you need to succeed?  Must-have Strong data profiling, cleaning, and mining expertise. Ability to perform complex data analysis on large volumes of data and present findings to stakeholders.Strong skills in Python, including data analytics libraries like SKLearn, Tensorflow, SPARK. The candidate should have experience in concurrent Python development.Candidate should have experience integrating Python applications with various internal and external APIs, including Tableau, Qlik or others.Source Code Management experience (Git, SVN, others)Ability to work independently and manage own projects while working as a member of a larger team Detail oriented and ability to precisely implement instructions Excellent (written and oral) communication skillsAdvanced understanding of data manipulation and data mining, familiarity with database designFamiliarity with fixed income tools such as Bloomberg. Finance and fixed income knowledge is a definite plus Nice-to-have BSc., Masters in Mathematics, Statistics, Machine Learning, Computer Science, Engineering, or other hard scienceA minimum of 2-3 years' experience in a data analysis role or extensive relative educational backgroundStrong analytical skillsDemonstrates initiative and persistenceAble to exercise independent judgmentCommits to satisfying internal and external customersDelivers clear, effective communication and commits to understanding others What's in it for you?  We thrive on the challenge to be our best, progressive thinking to keep growing, and working together to deliver trusted advice to help our clients thrive and communities prosper. We care about each other, reaching our potential, making a difference to our communities, and achieving success that is mutual. A comprehensive Total Rewards Program including bonuses and flexible benefits, competitive compensationLeaders who support your development through coaching and managing opportunitiesAbility to make a difference and lasting impactWork in a dynamic, collaborative, progressive, and high-performing team About RBC  Royal Bank of Canada is Canada's largest bank, and one of the largest banks in the world, based on market capitalization. We are one of North America's leading diversified financial services companies, and provide personal and commercial banking, wealth management, insurance, investor services and capital markets products and services on a global basis. We have over 80,000 full- and part-time employees who serve more than 16 million personal, business, public sector and institutional clients through offices in Canada, the U.S. and 37 other countries. For more information, please visit .  Inclusion and Equal Opportunity Employment  RBC is an equal opportunity employer committed to diversity and inclusion. We are pleased to consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veterans status, Aboriginal/Native American status or any other legally-protected factors. Disability-related accommodations during the application process are available upon request. JOB SUMMARYCity: Chicago Address: 500 W. Madison Street Work Hours/Week:40Work Environment: Office Employment Type: Permanent Career Level: Experienced Hire/Professional Pay Type: Salaried Position Level: CM - Analyst Required Travel(%):0Exempt/Non-Exempt: Exempt People Manager: No Application Deadline:2018-07-02Req ID:***** RBC is an equal opportunity employer committed to diversity and inclusion. We are pleased to consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veterans status or any other legally-protected factors."}