{"jobID": "2695567959", "jobLocation": "Santa_Cruz_CA", "jobTitle": "Data Analyst Consultant, Professional Services", "companyRating": null, "companyInfo": {"Website": "www.looker.com", "Headquarters": "Santa Cruz, CA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Tableau Software, Chartio, Periscope Data"}, "estimatedSalary": null, "jobDescription": "WHO WE ARELooker is on a mission to bring better insights and data-driven decisions to every business. Everything we do is aimed at making sure our customers love every aspect of Looker, from our products and technologies to our ease of doing business and our support. We are looking for curiously brilliant individuals to join our team as we reinvent data analytics. Get data-driven and see yourself at Looker.WHO WE ARELooker is on a mission to bring better insights and data-driven decisions to every business. Everything we do is aimed at making sure our customers love every aspect of Looker, from our products and technologies to our ease of doing business and our support. We are looking for curiously brilliant individuals to join our team as we reinvent data analytics. Get data driven and see yourself at Looker.WHAT WE'VE GOT GOING ONLooker is seeking technically savvy Data Analytics Consultants to implement our solutions, and demonstrate the value of our products to business and technical users. In this role, you will collaborate with the sales and services teams to deliver and continually improve upon our product implementations. This includes assessing customer needs, re-engineering business intelligence processes, designing and developing data models, and sharing your expertise throughout the deployment process. You will grow to possess breadth and depth of our products and modeling language (LookML), and impart this knowledge to our customers as a critical participant in the deployment cycle. You will also help shape the product and direction of the company by communicating market needs and solution opportunities back to the engineering team.WHAT WE NEED YOU TO DO Assess use cases for various teams within the client company.Develop a data model around stated use cases to capture client’s KPIs and data transformations.Take a consultative role and guide clients on optimizing their data environment to work most effectively and efficiently with Looker. This may include advising on database performance, altering the ETL process, providing SQL transformations, discussing API integration, and rethinking the approach of certain KPIs.Teach technical data modeling concepts to a variety of audiences, including developers, data architects, business users, and IT professionals.Document and communicate product feedback in order to improve user experience.WHAT YOU BRING TO LOOKER 3+ years of software implementation/services experience, preferably in the Data Analytics space.A passion for exploring data and extracting valuable insights.Proven analytical, problem solving, and troubleshooting expertise.Proficiency in SQL, preferably across a number of dialects (we commonly write MySQL, PostgreSQL, Redshift, SQL Server, and Oracle).Ability to learn and assimilate technical information quickly.Ability to travel up to 10%.Preferred: Exposure to developer tools/workflow (e.g., git/github, *nix, SSH); Experience troubleshooting operations issues; Optimizing database/query performance; Experience with AWS ecosystem (EC2, S3, RDS, Redshift); Experience with business intelligence tools with a physical model (e.g., Microstrategy, Business Objects, Cognos); Experience with data warehousing; Exposure to NoSQL-based, SQL-like technologies (e.g., Hive, Pig, Spark SQL/Shark, Impala, BigQuery); Experience teaching.A LITTLE MORE ABOUT LOOKERLooker is a complete data platform that offers data analytics, exploration and insights to every function of a business and easily integrates into every departmental application to get data directly into the decision-making process. The company is powering data-driven cultures at more than 800 industry-leading and innovative companies such as Sony, Amazon, The Economist, Kohler, Etsy, Lyft and Kickstarter. The company is headquartered in Santa Cruz, California, with offices in San Francisco, New York, Dublin, and London. Investors include Kleiner Perkins Caufield & Byers, Meritech Capital Partners, Redpoint Ventures, First Round Capital, Sapphire Ventures, and PivotNorth. For more information, connect with us on LinkedIn, on Twitter, Facebook and YouTube or visit Looker.com.A LITTLE MORE ABOUT LOOKERLooker is a complete data platform that offers data analytics and business insights to every department, and easily integrates into applications to deliver data directly into the decision-making process. The company is powering data-driven cultures at more than 1200 industry-leading and innovative companies such as Sony, Amazon, The Economist, Spotify, Etsy, Lyft and Kickstarter. The company is headquartered in Santa Cruz, California, with offices in San Francisco, New York, Chicago, Boulder, London and Dublin, Ireland. Investors include CapitalG, Kleiner Perkins Caufield & Byers, Meritech Capital Partners, Redpoint Ventures, First Round Capital, Sapphire Ventures and Goldman Sachs. For more information, connect with us on LinkedIn, on Twitter, Facebook, G+ and YouTube.Looker aspires to be a workplace that is not only free of discrimination, but one that fosters inclusion and belonging. We strongly believe that diversity of experience, perspective, and background lead to a better environment for our employees and a better product for our users. We encourage like-minded individuals to join us in changing the way businesses use data."}