{"jobID": "2489497612", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.fuelx.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "FuelX is the leading commerce indexing company. Our technology leverages real-time data processing and machine learning to predict online shopping behaviors and to drive conversions for the brands that use our digital advertising platform. We are growing our team, and we're looking for people to join us on our mission to index the world's commerce data.As our first Senior Data Science team member, you will own platform automation projects with machine learning technologies from supervised learning to reinforcement learning, from linear regression to time series model...anything you can imagine is possible to experience in a data science world here at FuelX.Responsibilities Lead data team.Design and implement machine learning and natural language processing algorithms.Build system automation.Build models for prediction projects.Quickly prototype and iterate on your data models.Build automation on model practice.Perform fundamental and applied machine learning research in large-scale distributed analysis.Work with large data sets to predict and test statistical patterns.QualificationsExperience with cloud data solution.At least 7 years of experience with cloud machine learning APIs.At least 7 years of experience on machine learning projects with big data.Strong knowledge of analysis algorithms and machine learning models.Strong knowledge of statistics.Strong knowledge of anomaly detection, time series forecasting, clustering, classification, natural language processing, and customer segmentation.Knowledgeable in Java , Scala, Python, C++, R.Fundamental understanding of Hadoop or HBase or other cluster system on big data solution.Fundamental understanding of user profile and behavior approaches and methodologies.Strong grasp of fundamental CS concepts such as data structures, algorithms, design patterns, coupling, cohesion, correctness, etc.Team Player mentality Bonus Experience with system automation.Experience of digital advertising."}