{"jobID": "2674411677", "jobLocation": "Washington_DC", "jobTitle": "Senior Data Analyst, Optimization", "companyRating": "3.7", "companyInfo": {"Website": "www.fladems.com", "Headquarters": "Tallahassee, FL", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Other Organization", "Industry": " Government", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "86000", "jobDescription": "The Democratic National Committees Tech team is hiring a Senior Data Analyst on the Optimization team to help us build tools and analyze real-time data to help candidates win elections and to empower progressives across the country. We need someone with a keen eye for identifying opportunities for optimization in an electoral context, from voter targeting/segmentation to experimentation/testing to reporting/data visualization. The Senior Data Analyst will work with the Optimization Lead as part of the larger Data team and is concerned both with 1) the near-term operational efficiency of the DNC, state parties, and candidates and 2) the long-range development of game-changing products for the progressive ecosystem at large.Who we areThe Tech team is a small, diverse team that provides the technology used by candidates and organizers in all 50 states and all 3,413 counties across the United States to analyze data, organize campaigns, raise money, and get out the vote on election day.But theres more to do. So were hiring analysts, product managers, engineers, researchers, designers, security experts, IT professionals, and data scientists who can use user-centered design and rapid iteration to develop a rich technology ecosystem for progressivesbuilding tools ourselves as well as partnering with other companies and organizations.Do you want to Secure the future of our country? Right now a lot is at stake in our country and our team has a huge opportunity to make a real difference.Work with amazing people? Were building a diverse, distributed team, hiring the best people we can wherever they arealumni from past Presidential campaigns working out of DC and New York, experienced product developers from the SF Bay Area, and more.Never stop learning? There are people who know about politics and people who know about technology and a few who have figured out some things about how to combine the two, but we are blazing a lot of new trails and you should be comfortable exploring and learning from everyone you can. You will Work on fascinating problems. You will help us answer questions such as 1) how do we define and measure success across our various outreach efforts? 2) how do we set up systems to be able to continually test assumptions? 3) how do we make data science products more impactful and accessible to campaigns up and down the ballot?Collaborate with other members of the DNC to develop data-driven solutions to long-standing and new problems for state parties and candidates.Communicate clearly and approach problems with curiosity and humility. You will need to communicate your vision for how technical disciplines can improve the effectiveness of the DNC to executive leadership, field organizers, statisticians, candidates, and computer scientists.Be a part of a team that is constantly thinking about efficiency,how we can regularly improve our efforts, constantly thinking about the next iteration, while being a stickler for good documentation.We prefer candidates based in or willing to move to Washington, D.C., but are open to remote candidates. Were looking for someone with diverse electoral campaign experienceexperience up and down the ballot is definitely a plus.The Democratic National Committee (DNC), is committed to diversity among its staff, and recognizes that its continued success requires the highest commitment to obtaining and retaining a diverse staff that provides the best quality services to supporters and constituents. The DNC is an equal opportunity employer and it is our policy to recruit, hire, train, promote and administer any and all personnel actions without regard to sex, race, age, color, creed, national origin, religion, economic status, sexual orientation, veteran status, gender identity or expression, ethnic identity or disability, or any other legally protected basis. The DNC is committed to providing reasonable accommodations to individuals with disabilities in the hiring process and on the job, as required by applicable law. The DNC will not tolerate any unlawful discrimination and any such conduct is strictly prohibited."}