{"jobID": "2818890164", "jobLocation": "Roseland_NJ", "jobTitle": "Senior Business Systems Analyst - ( Data Security Focus )", "companyRating": "3.6", "companyInfo": {"Website": "jobs.adp.com", "Headquarters": "Roseland, NJ", "Size": "10000+ employees", "Founded": " 1949", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "99000", "jobDescription": "Senior Business Systems Analyst -- Enterprise ArchitectureData Security FocusJob DescriptionUnlock Your Career Potential: Technology at ADP. Do you enjoy exploring, identifying and inspiring the future of the workplace and the lives of millions of people? At ADP, the world's largest B2B cloud company, our Technology team is comprised of brilliant engineers, architects, data scientists, infrastructure experts, and more. We were first in our industry to offer a SaaS solution and continue to push the envelope utilizing the latest operating platforms to deliver the highly automated, intelligent and predictive solutions that are redefining what is possible. Named one of Forbes' \"Most Innovative Companies\" and one of Computerworld's \"100 Best Places to Work in IT\", we are committed to leading the way in product development and research, empowering you to bring to life the latest innovations that will forever change the way businesses manage their most vital asset, employees. Location: 1 ADP Blvd  Roseland, NJ 07068 *** Strong preference for experience with Data Security Projects, Data Encryption, Data Warehouse / Conversions / Analytics.Position Overview: The Sr. Business Systems Analyst within ADP's Enterprise Architecture organization is responsible for conducting business process, data and systems analysis and preparing appropriate documentation for ADP's global data centric protection projects.  In this role, the Sr. Business Systems Analyst will work collaboratively with several cross-functional groups including, development, engineering, project management and business partners to develop process flows, user stories, functional and technical requirements and design solution options. You will be able to bring your data centric protection experience to assist in driving the project to ensure maximum data security while ensuring the user experience continues to delight our clients. Responsibilities Conducts detailed end to end business process and systems analysis Develops cross-platform user stories, functional, non-functional and technical specifications Develops design options to satisfy user, business, statutory, system and project requirements Assists in the development of cross-platform functional testing requirements Provides support to all cross-functional teams to ensure solution goes to market with agreed upon scope, on time, with quality and organization preparedness Closely work with business and technology leaders to solve for the business problems Solve unique and complex problems Contributes to the data centric protection strategyMinimum Qualifications 5+ years of experience in software development and delivery 3+ years of direct experience as a business systems or business process analyst Strong process analysis and design skills Demonstrable knowledge of data security, encryption / tokenization practices and concepts Proven track record in the development of user stories, technical and functional specifications Experience in partnering with cross-functional teams to design solutions and transform end to end processes for large complex initiatives into action oriented objectives and measurable results. Ability to act as a liaison between business and technologies Strong situational analysis and decision-making abilities Ability to think creatively and drive innovation Takes intelligent risks Experience in working in a team oriented collaborative environment Exceptional communication skills and the ability to communicate appropriately at all levels of the organization; this includes written and verbal communication as well as visualizations Takes intelligent risks Bachelor's or Master's degree in Computer Science or equivalent experiencePreferred Qualifications Experience with data protection projects including data encryption and/or tokenization Experience in Human Capital Management Strong modeling, analytical and conceptual skills Experience with the AgileSDLC and scrum teams Ability to perceive patterns and relationships between technologies, processes, and business models__________ Req 156231 #ADPTECH#LITECHSoftware in the Cloud. Experts on the Ground:ADP powers the working world with comprehensive solutions that drive business success. Consistently named one of the \"Most Admired Companies\" by FORTUNE® Magazine, and recognized by Forbes® as one of \"The World's Most Innovative Companies,\" ADP has over a half-million clients around the globe and 65 years of experience as one of the largest providers of human capital management solutions world-wide.  At ADP, we believe that diversity fuels innovation. ADP is committed to equal employment opportunities regardless of race, color, genetic information, creed, religion, sex, sexual orientation, gender identity, lawful alien status, national origin, age, marital status, non-job related physical or mental disability, or protected veteran status. We support an inclusive workplace where associates excel based on personal merit, qualifications, experience, ability, and job performance. "}