{"jobID": "2615319030", "jobLocation": "Washington_DC", "jobTitle": "Audio Visual Technician - Grand Hyatt DC", "companyRating": null, "companyInfo": {"Website": "jobs.psav.com", "Headquarters": "Schiller Park, IL", "Size": "5001 to 10000 employees", "Founded": " 1937", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Encore Event Technologies"}, "estimatedSalary": null, "jobDescription": "PSAV is a top international provider of professional event technology services, and stands on a 75-year record of success and growth. We strive to deliver flawless execution with a hospitality approach, for all event technology services. Our mission is to turn ordinary meetings into extraordinary events. Technician Position OverviewBasic set up and operation of small to large-scale audiovisual systems in a hospitality environment while ensuring complete customer satisfaction.Key Job ResponsibilitiesEquipment OperationEnsures a flawlessly executed event through accurate and timely setup, operation, and breakdown of basic audiovisual equipment as listed in the technical qualifications section.Customer ServiceStrives to exceed the expectations and needs of internal and external customers. Maintains a positive relationship with all clients through effective communication. Meets with guests on site to ensure that their needs are met and the equipment setup is working properly. Monitors events and checks in on customers throughout the events' duration. Understands and fosters the hotel/client relationship.Technical AbilityUnderstands the technical aspects of the job and demonstrates basic operational ability to troubleshoot and problem solve with equipment and software issues. Handles equipment challenges and changes in a timely and professional manner.Systems KnowledgeUnderstands company processes, follows procedures and completes systems entry and paperwork accurately. Uses the equipment sheets to determine the equipment scheduled for set up and for strike. Interacts with other staff and outside vendors for equipment. Increases revenue by utilizing floor up-selling techniques. Works with clients to finalize invoices. Completes order entries in Navigator, as needed.Required SkillsTechnical QualificationsFamiliarity with the following equipment is preferred:AudioVideoLightingComputersRiggingHouse SoundWirelessMicrophones Power Speakers Audio Recording Press Box4-12 channel Mixers Push to Talk Systems Signal FlowValue Lines & Meeting Room LCDDigital video playback/record systemsSmall SwitchingSystemsSignal FlowUp lighting GELS/GOBOS Podium Lighting Kits Basic FocusBasic Dimming and controlBasic ElectricalSignal FlowDisplay Interface USB Switching Loading Apps/Drives Basic MS Office(Excel/Word/PP)IP Addressing knowledgeIP Address Set Up in Windows OS/Network PrintersKnowledge of DHCP / Static AddressingSwitches/Hubs/WAPSUltimate StandsGround Supported Equipment (Standing Truss Sections)Banners and SignsRequired Experience :High School Diploma is required. Bachelors degree is preferred.1 year of customer service or hospitality experience is preferred.1 year of audio visual experience or equivalent in educational environment is preferred.A valid drivers license and clean driving record is required for team members that may operate Company vehicles.Additional InformationTeam members will be in contact with high-end audio visual equipment and electrical components, and will be exposed to heights via lifts and ladders. Team members may work in multiple hotel locations. Working times include irregular hours and on-call status including days, evenings, weekends and holidays. Team members must adhere to appearance guidelines (hair length, facial hair and attire) as defined by PSAV based on an individual hotel or a representation of hotels in that city or area.Job LocationWashington,District of Columbia,USPosition TypeFull-Time/Regular"}