{"jobID": "2814452826", "jobLocation": "San_Francisco_CA", "jobTitle": "Principal Data Scientist", "companyRating": "2.6", "companyInfo": {"Website": "www.clarivate.com", "Headquarters": "Philadelphia, PA", "Size": "1001 to 5000 employees", "Founded": " 2016", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " RELX Group, Wolters Kluwer, Informa"}, "estimatedSalary": "171000", "jobDescription": "Clarivate Analytics clients are the trailblazers and risk takers who come up with life-changing ideas. We’re looking for our own trailblazers to help us keep providing clients some of the world’s most trusted brands, spanning scientific and academic research, patent analytics, pharmaceutical and biotech intelligence and IP management.We’re an independent owned company with a rich heritage and a bold entrepreneurial mission. If you’re excited by the thought of helping people and organizations go from new ideas to life-changing innovations faster, we’re excited to consider you for a position at Clarivate. Define, manipulate, aggregate and use both structured and unstructured “big data” in order to support descriptive and predictive analytics across the businesses. This is a thought leader.  • Collaborate with scientists, product groups and content groups to perform “big data” aggregations, fusion and manipulations of important data-sets Perform statistical (and machine learning) analyses on data to serve business purposesNarrate stories (sometimes to a non-technical audience) about our content and processes by data analysis and visualizationDefine and develop software for the analysis and manipulation of large and very large data-setsGuide the architecture of “big-data” business processes with an eye towards robustness, parsimony and reproducibility (at senior levels)Develops appropriate and innovative customer experience metrics and reporting tools.Builds and validates predictive models using a wide variety of statistical and machine learning methods and algorithms.Provides automated and ad-hoc analysis of experiments.Identifies strategic information needs of internal clients and translates these into data requirements and reports.Assesses and validates reliability of source data and business systems used to develop performance metrics.Prepares recommendations and conclusions based on data summaries and communicates this information in a credible, convincing and timely manner.Explores existing data for insights and recommends additional sources of data for improvements.Technical /Professional Skills & Competencies:Solid understanding of statistics and the design and analysis of experiments. Solid skills in statistical language, SAS.The ability to tell a story about data, in particular with visualization.Strong written, communication and presentation skills. Able to respond and present work to peers, answer in-depth questions, accept constructive feedback, and modify work product accordingly.Specific Big Data experience on cloud computing platforms with technologies such as Hadoop, Mahout, Pig, Hive and Spark a plusPrior experience with clinical drug trials.7+ years of experience with Data Science and Statistics, preferably in Life Sciences, and more specifically, in pharmaceuticals.Education and Background:Bachelor's degree a quantitative field such as Statistics, Econometrics, Computer Science, Technology, or Engineering, strongly preferred, or equivalent work experienceSeeking related experience in Life Sciences; pharmaceutical experience preferredProven track record in the application of StatisticsIt is the policy of Clarivate to provide equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, Clarivate will provide reasonable accommodations for qualified individuals with disabilities."}