{"jobID": "2824819515", "jobLocation": "Washington_DC", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Company Description Nithio is a venture-backed energy finance platform that provides services to businesses, capital providers, governments, and other stakeholders in the distributed energy sector in Africa. The company aims to address the acute need for modern energy access on the continent by providing a sustainable infrastructure for capital delivery, offering state-of-the-art underwriting tools, and a powerful information sharing platform for stakeholders to identify high-need grant recipients and credit-worthy customers. The platform offers flexible financing options by intermediating across providers of debt, concessional finance, and grants and leveraging partnerships with leading financial institutions and multilateral organizations. Summary of Position The successful candidate will have a strong quantitative background, experience working with statistical packages (R or Python), and an entrepreneurial mindset. Preference will be given to applicants with experience in geospatial analysis, machine learning, and/or experience on the African continent.  This position will perform a range of duties including, but not limited to, the following: Contribute as part of Nithio’s growing Analytics team to analyze and model diverse types of data—including household surveys, payment histories, product pricing, and consumer receivables—to expand, deepen, and refine the Nithio underwriting tool.Work directly with Nithio strategic partners (i.e. Fraym.io) and support customized client engagements (e.g., investors, distributed energy companies, policymakers, and development agencies).Prepare analytical products, including presentations, briefings, and other materials.Support the development of product offerings and capabilities such as machine learning applications, dashboards, and underwriting tools and packages.Requirements The successful candidate will have the following qualifications and skills: Bachelor’s or Master’s degree in a related field.1-5 years of experience applying quantitative methods.Training in statistical methods, econometrics, machine learning, and/or geospatial analysis.Essential software skills: R for descriptive, econometric, and machine learning analysis. Other software/programming skills (especially Python, ArcGIS or SQL) are a definite plus.Experience querying, cleaning, combining, and storing multiple sources of data in an organized manner. Database management experience is a plus.Eye for crafting clean, creative, and effective data visualizations.Outstanding communication and writing skills.Strong judgment and critical thinking skills, with the ability to articulate and present points of view and ideas effectively.Results-oriented with a proactive and creative approach to problem solving.Proven ability to successfully prioritize multiple, competing priorities with strong attention to detail.Demonstrated ability to advance discrete projects both independently and as part of a small team.Adaptability, confidence, and a can-do attitude.Strong interpersonal skills and ability to interact with senior executives, external clients and multiple stakeholders. As a lean, entrepreneurial company, flexibility and willingness to pitch in wherever needed is critical. Benefits Nithio offers a competitive salary commensurate with experience and a full benefits package."}