{"jobID": "2820984405", "jobLocation": "Mountain_View_CA", "jobTitle": "(USA-CA-Mountain View) Communication System Modeling and Data Scientist, X", "companyRating": "4.4", "companyInfo": {"Website": "www.google.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (GOOG) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Apple, Facebook"}, "estimatedSalary": "172000", "jobDescription": " As a Communication System Modeling and Data Scientist, you will develop predictive and validated models for communication system performance that can be used to improve existing systems and inform next-generation capabilities. You possess a fundamental understanding of performance-affecting phenomena in wireless communications at the physical layer and higher. Analysis of large telemetry sets from operational and experimental links, dimensionality reduction, inference of key relationships, and arriving at quantified conclusions are key focus areas for the role.  X is a moonshot factory where uncomfortably ambitious, potentially world-changing new ideas such as self-driving cars, balloon-powered Internet and smart contact lenses are developed and taken out into the world. X projects have the potential to transform the lives of billions of people and make the world a radically better place. Were a team of makers, entrepreneurs, engineers and scientists with deep technical expertise who love the challenge of the seemingly impossible. X was formerly known as Google[x].  ## Responsibilities Model communication system performance at different layers of abstraction (ranging from physical layer to network layer), depending on analysis objectives.Perform link budget validation (via simulation and measurements), and derive improvements to system performance.Analyze large and varied datasets to develop predictive models for network and link performance under adverse weather conditions, including overall availability. Derive novel insights, and recommend system improvements.Setup framework for a scalable telemetry storage repository, coupled with a traceable system for analysis results, performance assessments, and issue resolution. ## Qualifications Minimum qualifications:BS degree in Computer Science, Electrical Engineering, or similar discipline, or equivalent practical experience.Experience working with stochastic processes, estimation, beam propagation in random media, and statistical signal processing for data communication networks.Experience in Layer 1 and 2 functions in wireless backhaul and access links.Experience with system modeling, numerical computation and simulation, and data visualization.Preferred qualifications:Master's degree in Computer Science, Electrical Engineering, or similar discipline, or equivalent practical experience.Experience modeling communications system performance in Layers 1 to 4.Demonstrated ability to innovate in the wireless telecommunications application space.* * At Google, we dont just accept difference - we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you have a disability or special need that requires accommodation, please let us know.  To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees or any other company location. Google is not responsible for any fees related to unsolicited resumes."}