{"jobID": "2829523579", "jobLocation": "Washington_DC", "jobTitle": "Systems Engineer", "companyRating": "3.4", "companyInfo": {"Website": "www.caci.com", "Headquarters": "Arlington, VA", "Size": "10000+ employees", "Founded": " 1962", "Type": " Company - Public (CACI) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " CSC, ManTech, SAIC"}, "estimatedSalary": "74000", "jobDescription": "Job Description What Youll Get to Do: We are seeking an Infrastructure System Engineer with experience in an enterprise IT environment. As an integral member of the Enterprise Operations team for the U.S. Department of Justice Criminal Division, primary responsibilities will include resolving IT hardware, software, and network infrastructure issues using systems analysis techniques and procedures to ensure appropriate function of hardware, software or system functional specifications including user systems, servers, storage, and network connectivity.  More About the Role: Solve complex issues remotely and in person.Supports the Backup/Recovery and/or Disk/SAN administration support on the Windows/VMware Server Farm.Develops strategies to manage the frequency of appropriate support package/patch application.Researches current systems technology and serves as subject matter expert on complex systems processes and procedures.Responsible for making recommendations to improve the environment, propose solutions to issues in a planned timeline, maintaining current documentation, attending scheduled meetings, and disk management (i.e.: extending file-systems, storage on demand, etc.)Provides rotational after hours (on-call) support for functional area.Provides support for a multi-site, multi-forest, Windows AD structure. Youll Bring These Qualifications: Requires an in-depth understanding of the overall network infrastructure and ability to provide remote troubleshooting and resolution.Requires US Citizenship and the ability to obtain a high-risk- Public Trust (DOJ Clearance).Requires a high level of diverse technical and industry experience related to a specific skill set.Experience installing, configuring, maintaining and troubleshooting Lync Server 2010.Performing configuration of Exchange/AD.Creating, testing, and coordinating the implementation of Group Policy objects.Experience with AD monitoring tools (ex: SCOM)Design, configure and implement a virtual server environment for enterprise messaging.Manage and troubleshoot Group Policy at all levels (local, OU, site, etc).Write and maintain scripts to automate and troubleshoot systems as necessary.Understand SCOM Performance, components, and administration.The ability to create and maintain SCOM SLA Dashboards.Deploy, configure, and manage both prepackaged and custom Management Packs.Design, implement, and support Windows 2012 and 2016 systems.Responsible for optimizing application pools and working closely with development teams to troubleshoot .NET framework related issues utilizing SCOM APM metrics.Required to work independently with little supervision and should be flexible enough to work and support IT operational needs as requested.Candidate should be able to define internal and external customer IT needs and design solutions to meet those needs to include, monitoring, backups, hardware and software installations, configurations and tuning.Candidate will be required to have extensive background in Windows based environments.DOJ Public Trust must be obtainable.Typically requires bachelor's degree or equivalent and or seven to nine years of related experience. These Qualifications Would be Nice to Have: Preferred candidates would be certified in one or more of the following areas: MCSA Windows Server 2012/2016, MCSE Server Infrastructure or MessagingExperience with Virtualization platforms such as VMware or HyperVExperience with cloud services and technologiesITIL Foundation KnowledgeMicrosoft Clustering, including SQLSystem development/programming experience in WindowsDepartment of Justice experience is HIGHLY DESIRABLE! What We Can Offer You: Weve been named a Best Place to Work by the Washington Post.Our employees value the flexibility at CACI that allows them to balance quality work and their personal lives.We offer competitive benefits and learning and development opportunities.We are mission-oriented and ever vigilant in aligning our solutions with the nations highest priorities.For over 55 years, the principles of CACIs unique, character-based culture have been the driving force behind our success. Job Location US-Washington-DC-WASHINGTON DC  CACI employs a diverse range of talent to create an environment that fuels innovation and fosters continuous improvement and success. At CACI, you will have the opportunity to make an immediate impact by providing information solutions and services in support of national security missions and government transformation for Intelligence, Defense, and Federal Civilian customers. CACI is proud to provide dynamic careers for employees worldwide. CACI is an Equal Opportunity Employer - Females/Minorities/Protected Veterans/Individuals with Disabilities."}