{"jobID": "2793704052", "jobLocation": "San_Francisco_CA", "jobTitle": "Pharmacy Benefit Management (PBM) Operations Manager", "companyRating": null, "companyInfo": {"Website": "www.universal.co.za"}, "estimatedSalary": null, "jobDescription": "PBM Operations ManagerAn exhilarating challenge for an Operations Manager has become available at Universal Healthcare, South Africa’s most innovative healthcare management company, which has over the last decade earned a reputation as being a leading disruptor and champion of service excellence. We are looking for a Healthcare Operations Manager with a difference who is ready to take on an adventure in setting up our start-up office in San Francisco and launching our new cutting-edge software products in the USA. As Universal Healthcare works at the forefront of an industry characterised by rapidly evolving technologies and has recently embarked on a fresh strategic direction, the successful candidate will be working in an exciting and dynamic environment.Objective of the Operations ManagerTo work as part of a dynamic team to set-up Universal’s office in San Francisco and launch our new start-up in healthcare in the USA.The Operations Manager will lead the team in the set-up of the San Francisco Office and the establishment of the new products in the healthcare industry. Duties and ResponsibilitiesOffice Management: responsible for ensuring that the office set-up in San Francisco is successful. Organizing logistics, office layout and office selection.Staff Management: - interviewing, on-boarding and training new employeesProcess Management: design and implement efficient and innovative processes for the San Francisco office to ensure the culture of Universal is implemented with a focus on excellence. An essential part of establishing the procedures is to ensure that they are designed in accordance with the accreditation criteria of the healthcare industry in the USA.Trade Shows – representing Universal at trade shows such as HIMSS etcClient Management – interacts directly with clients and/or third party consultants/vendors at business and senior executive levels.Implementation Management – use product, process, client account, operational knowledge and project management skillset to manage implementations.International Team – work as part of a global team in the project delivery of new products and innovate solutions for healthcareFinance Management – budget construction and management, pay bills, purchase orders etcProduct Management – review of product software designs and provide input, conduct user acceptance testing and document the implementation guides.Research - conducting research, compiling data and preparing papers or presentations for the CEOQualifications & Skill Requirements:Honours, Master’s degree in related field10 years of relevant work experience in the healthcare industry specifically focused in the Pharmaceutical / Pharmacy Benefit Management operations.Experience with PBM Implementations of Medicare, Medicaid and Commercial Benefits, enrolment, utilization management, formulary & pricing.Experience with NCPDP standardsProject management experience and proven ability to meet deadlines.Strong leadership skills and the ability to effectively influence key decision-makers.Ability to adapt in a dynamic work environment, learn quickly, solve problems and make decisions with minimal supervision.Excellent verbal and written communication/presentation skills.Demonstrated ability to coordinate people and teams cross functionally to resolve complex issues with designated time frames.Willingness to work a flexible schedule to accommodate business and travel requirements.Personal attributesMust be able to operate effectively in a fast-paced, high-intensity, continuously changing work environmentInnovation is encouraged as a core value Ability to learn quickly and think creatively Creative conflict resolutionCreative problem solving and troubleshooting abilitiesAbility to build and manage a successful team focused on innovation, collaboration and delivery.RemunerationA competitive salary and benefits will be negotiated, consistent with experience and the role and responsibilities of the positionMore about Universal HealthcareUniversal Healthcare has established itself as a leader within the South African healthcare industry. Through our evidence-based integrated healthcare services, we aim to facilitate access to healthcare for more South Africans. The Vision of Universal Healthcare is: “To be a top performing, world class healthcare and technology group, respected for excellence by providing access to innovative, evidence-based solutions with a caring approach.”Universal Healthcare’s integrated services include medical scheme administration, corporate health and employee wellness programmes, managed care, occupational health programmes, an extensive network of healthcare professionals/providers, and health insurance, including gap cover, among others."}