{"jobID": "2829582702", "jobLocation": "San_Leandro_CA", "jobTitle": "Network Administrator", "companyRating": "4.1", "companyInfo": {"Website": "www.bigge.com", "Headquarters": "San Leandro, CA", "Size": "51 to 200 employees", "Founded": " 1916", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "70000", "jobDescription": "JOIN OUR RAPIDLY GROWING COMPANY: Bigge Crane and Rigging Co. (www.bigge.com) is one of the Nation’s leading crane rental, sales and service companies in the United States. We’ve been successfully growing our business since 1916. Our growth and success is the result of having a deep heritage of hiring the best people and giving them the best training and equipment in the industry. We do big things in a big way and we are determined to be the best at what we do. Our goal is to engage and retain the brightest minds and hearts in the industry to achieve the potential we are capable of. Position Summary: The Network Administrator is a key member of the IT team, providing oversight and strategic direction for the implementation, design and maintenance of the corporate network infrastructure. The Network Administrator is responsible for operating a technical support staff capable of meeting all internal service levels for 175+ employees. In addition to the management leadership, the Sr. Network Administrator is responsible for building and operating a complex network infrastructure capable of supporting the corporate technical operations. This includes all servers, network infrastructure, security systems, corporate messaging systems and related security mechanisms to ensure safe and continuous operation of these components. Responsibilities:Provide strong leadership in the design, implementation and maintenance of the corporate network, co-location facilities and establishing connectivity with partners, customers and employees.Design and oversee all configuration changes to any component of the corporate LAN, WAN and related networks. This includes all hardware and software issues and on-going administration of the corporate network.Implement and manage all aspects of IT security, including publication of appropriate security policies to ensure employees, contractors and customers understand the proper use of corporate network resources.Maintaining accurate records of all maintenance, inventory, and security measures associated with the company’s voice and data networks.Working with IT team members to assess and solve all company-wide IT issues.Training and assisting all end users on voice and data related products as needed.Install, maintain and oversee the operation of company servers, routers, switchers, mainframe and multi-platform networks and related peripheral equipment.Provide implementation, support and maintenance for all company applications; maintain operating systems, client-server software and utilities.Provide specialized technical assistance in the planning and development of new projects and systems, conduct research of new technologies and implementation strategies; recommend and implement improvements; research and plan for new network protocols and network operating system implementations.Provide technical support to computer operations and programming staff; serve as a resource to other staff and provide appropriate user support as assigned.Educational Requirements / Qualifications:Bachelor's degree in Computer Science, Information Systems or related field, or equivalent relevant experience.Min 7+ years’ experience building, operating and troubleshooting complex network environments with sensitive customer data.In-depth understanding of network protocols, network security principles and industry-standard implementations of corporate network infrastructures.Working knowledge of server technologies used in corporate messaging applications and file transport protocols (secure & un-secure).Understanding of advanced troubleshooting techniques in diagnosing hardware, software and network issues.5+ years experience working in a Windows Active Directory environment, preferably with mixed Operating System environment including at least one Linux variant (Red Hat/CentOS, SUSE, Debian5 + years experience with server infrastructure (space, power, cooling) maintenance and capacity planning.3+ years experience with VMWare clusters with multiple hosts. Areas of experience should include design, implementation, capacity planning, and maintenance. Experience with VEEAM,Working experience with vSphere systems administration and support including VMotion, HA, DRS, VDS, VCenter, storage migrations, and P2V migrations. Experience with VCloud Air and VEEM preferred.2+ years with experience with network infrastructure (routers, switches, load balancers, DNS, NAS/SAN) design and maintenance. Cisco, HP, Extreme and Talari is desirable.Experience with database application (SQL Server, MySQL, Oracle) installation and basic maintenance.Intermediate-to-Advanced UNIX (Bash/Perl/Ant) and Windows (Batch/Perl/WMI) scripting abilities; must be familiar with script development best practices. Bigge provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, genetics, military or veteran status."}