{"jobID": "2725246266", "jobLocation": "Lambertville_NJ", "jobTitle": "Junior Quantitative Analyst / Trading Assistant", "companyRating": null, "companyInfo": {"Website": "www.robustwealth.com", "Headquarters": "Lambertville, NJ", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Company Overview RobustWealth is a fast-paced wealth management company that is changing the way investment advisors, banks, and enterprises are doing business. Our platform seamlessly integrates an array of previously modular features into one suite to optimize investing and wealth management practices. The technology suite includes: automated rebalancing, billing/remittance, document vaults, electronic account opening, institutional quality goals -&- risk based investment portfolios, and the open architecture use of investment options. Check out the positive press we've received in Financial Planning Magazine, Wealth Management Magazine, and the Philadelphia Inquirer to learn more! Position Description As a Junior Quantitative Analyst/Trading Assistant at RobustWealth, you'll be responsible for rebalancing client accounts and executing trades at multiple custodians. Your efforts will help enhance our ability to provide the best-in-class trading/execution services for RobustWealth's clients. Internally, your success will hinge on establishing effective working relationships with trading desk, Advisor Services, and Sales, and we can can’t wait for you to join the team. ResponsibilitiesAssist in day-to-day trading execution activities on the trading platformExecute account and trade reconciliation procedures based on the internal and custodian dataCollaborate with internal Sales/Servicing/Data/Technology teams on advisor requestsWork with the internal technology team to fix any account or market data issuesWork with custodians for any trade error or reconciliation issuesAd-hoc coding projects for data and investment analysisRequirementsStrong academic background required - undergraduate Degree in Finance/BusinessAt least two years of relevant financial industry and/or trading/brokerage operations experienceUnderstanding of economics and accounting, banking, financial markets and working with financial informationStrong MS Excel/PC skills with proven ability to analyze investment/financial dataCoding skills (in Java, R, Python, C, C++) highly desirableExperience with any trading platform is a plusPassion to perform investment analysis and follow capital marketsExperience and ability to build relationships within cross-functional teamsAbility to work in a fast-paced environment and an ability to consistently meet deadlinesAttention to detail and accuracy imperativeStrong interpersonal and communication skillsSeries 65 (to be obtained within 3 months of hire)Experience in Java, R, Python, SQL and AWS preferredBenefitsHealthcare RobustWealth offers employees a selection of healthcare plans. We pay 85% of the cost of your RobustWealth health insurance. Dental & Vision coverage is free. You can read more on our healthcare plan here. Additional BenefitsUnlimited vacation days for employeesFree gym membershipNo dress codeFree lunch brought into the Lambertville office from local restaurantsFree Tax Preparation for Form 1040Regular Team Offsite Retreats/Events, e.g., ski trip, hiking, etc."}