{"jobID": "2831120180", "jobLocation": "Washington_DC", "jobTitle": "Principal Consultant - Senior Federal Finance Business Analyst", "companyRating": "4.3", "companyInfo": {"Website": "www.terathink.com", "Headquarters": "Reston, VA", "Size": "201 to 500 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Government", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "144000", "jobDescription": "Who Are We? TeraThink has celebrated over 15 years of successful delivery of innovative and transformative consulting services to the federal government. We specialize in information technology and management consulting that has a purpose and makes a difference. Our teams are focused on providing exceptional service and solving our clients toughest challenges.  Our leadership team has a vast amount of experience and boasts a highly successful track record of delivering results within their respective solution areas and industries. Each leader adheres to a lead by the way you want to be led philosophy, which emphasizes transparency and open-door approachability. Who Are We Looking For? At TeraThink, we put our employees first and we expect nothing but your best in return. Our company believes in the importance of growth, passion, character, and of course - fun! Our positive work environment encourages team members to find enjoyable and challenging work in order to bring out the best in each individual. We look for dedicated team members who want to be a part of growing this incredible company. The best candidates are those who always look to go above and beyond and challenge themselves to achieve more each day. Sound Like You? Do you want to excel in your career and enjoy what you do? Then come join our growing team of brilliant professionals at TeraThink. What Youll Do The analyst shall be responsible for translating functional understanding of the data (e.g. data fields and accounting terms) into technical requirements. This role will be one of the primary interfaces between the government Subject Matter Experts (SME) and the contractor for developing work products. Additionally, the analyst shall be responsible for developing the data quality measures, assessments, and the techniques for long-term validation and reporting. What Were Looking ForA Bachelors degreeCandidate must be a US Citizen and be able to obtain a Public Trust ClearanceMinimum of two years experience working in data structure and data managementMinimum of five years experience in federal government accounting, financial data analysis and data managementExperience working in federal government finance or accountingFive years experience in federal financial business process analysisKnowledge of DHS and federal government financial management data standardsTechnical proficiency in Microsoft Outlook, Project, SharePoint, Power Point and particularly ExcelExcellent writing and communication skillsWhat We'd Like to SeeCertified Government Financial ManagerWhy TeraThink is a Great Place to WorkBenefits:  We love coming to work every day. Our benefits and work-life balance provide employees with much more than just the essentials they keep us happy in and outside of work.  A health insurance plan is provided at no cost for employees.  Employees enjoy federal holidays off in addition to 18 days of Paid Time Off (20 days after 2 years of service, 25 days after 5 years of service).  Our 401k is at a 4% match on a 5% contribution which has immediate vesting because we want you to stay here because you love it not for an invested 401k match. And we know you will love it!  Visit the Benefits page for a full list of benefits offered by TeraThink. Perks:  In addition to a top-notch benefits package, we host outings at The National Zoo, Escape Room, Top Golf, and holiday parties with swanky themes such as Casino Night. Our employees are also provided the opportunity to enjoy numerous perks such as: Multiple high-definition TVs at our offices with plentiful snacks to enjoy in the café areasBreakaway activities such as foosball, darts, and shuffle boardTeraThink sponsored FitBit and steps challenges, with prizesQuarterly shipments of snack boxes to our employees working on client siteSeason tickets to local sports teamsCell phone and commuter reimbursements We also embrace recognition as a way to showcase the great work that takes place at our company each day. As a way of shining light on our hard-working employees, we often provide gift cards for achieving major project milestones, attaining personal certifications, or as a thank you for employees who give back to the community. Our Focus on Professional & Team Growth:  We focus on encouraging constant learning, growth and innovation, and support Communities of Practice so that team members can dedicate time to learning new tools or solutions as while as getting to know employees on other projects. We provide each employee with an annual contribution amount to use towards learning and growth. We also encourage our team to participate in our TeraThink blog and share our knowledge with various communities of learning.  We strive to provide our employees, whether on client site or in our internal offices, with the best possible work experience. We keep a pulse on our team by sending out frequent micro-surveys that allow team members to provide feedback and thoughts. This frequent feedback allows our agile company to make changes and continue to adjust in any areas to provide team members with the best TeraThink.  Whether it is our events, benefits and perks, open communication, culture of recognition and growth; we want team members to be happy and fulfilled in their careers at TeraThink. Our future is you.  TeraThink is a proud equal opportunity employer. We recruit, employ, train, compensate, and promote without regard to race, ancestry, color, sex, religion, age, national origin, citizenship status, disability, protected veteran status, marital status, sexual orientation or perceived sexual orientation, gender identity, familial status, political affiliation, or any other classification protected by state or federal law."}