{"jobID": "2580154055", "jobLocation": "Chicago_IL", "jobTitle": "Cloud Big Data Engineering Lead", "companyRating": "4.1", "companyInfo": {"Website": "www.cloudreach.com", "Headquarters": "London, United Kingdom", "Size": "201 to 500 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Rackspace, Optymyze, FanDuel"}, "estimatedSalary": "121000", "jobDescription": " Big dreams often start small. From an idea in a London pub, we have grown into a global cloud enabler which operates across 7 countries and speak over 30 languages.  Our purpose at Cloudreach is to “enable innovation.” We do this by helping enterprise customers adopt and harness the power of cloud computing. We believe that the growth of a great business can only be fueled by great people, so join us in our partnership with AWS, Microsoft and Google and help us build one of the most disruptive companies in the cloud industry. It’s not your average job, because Cloudreach is not your average company.  As a Cloud Consultant within Cloudreach, you will help key clients define their cloud strategy and create cloud governance models. You will use your consultancy experience to drive progress with clients, which sometimes may require challenging their modus operandi. You will leverage experiences of what has worked well and not so well from other clients. You may be asked to spearhead engagements with the Cloudreach team. Our engineering and project management teams will look to you to set direction and provide mentoring. You will act as the link between the customer, the technical project team and the project/program managers, providing drive and understanding across business needs, technical implementation and organizational aspects. You will love cloud technology and stay up to date with the latest announcements and services, and then share your understanding across the company. How will you spend your time at Cloudreach?Help customers shape their journey to adopting Cloud ServicesRun customer facing workshops to tease out business drivers or present technical conceptsAssist Cloud Architects to design cloud architecture or create governance modelsProvide hands-on technical expertise when needed on key projectsAttending conferences, talks, seminars, MeetUps around cloud providers and share your experiences with your colleaguesThis position requires travel up to 100% (M-F) any given week, with an average of 60-70% per year.What do we look for?10+ years relevant experienceYou are capable of partnering directly with clients and leading cloud migration programs that affect thousands of users in an organization. Ensuring projects are completed on time and on budget is essential.You are fun, organized, and an excellent communicator. You are comfortable and confident with engaging senior management to steer complex programs and can act as a key part of the sales process when needed.Highly motivated and proactive, with proven leadership skills and an ability to thrive in a fast-paced environment.You are keen to grow your technical and consulting skills in a rapidly expanding companyYou have a stellar educational background and have a bachelor's degree in Business, Information Systems, Engineering, Computer Sciences or an equivalent subject, Master's Degree preferedCertification in AWS, Azure, or Google Cloud Platform a plusWhat are our cloudy perks?MacBook Pro, big screen monitor and groovy smartphoneUnique ‘cloudy’ culture where we keep our feet on the ground and our heads in the CloudsUncapped holidays and your birthday offWorld-class training and career development opportunitiesAttractive and centrally-located office in all the cities Cloudreach has a presenceGood food and team ‘cloudy’ lunches, taking over a local restaurant every FridayWorking with a collaborative, social team and levelling-up your skills faster than you will anywhere else BackYou Might Also Be Interested In… #Dallas, Chicago, Remote USAzure Cloud ArchitectCloud Enablement#Seattle, Atlanta, Remote USCloud Architect Cloud Enablement#Dallas, Chicago, Remote USCloud Architect Cloud Enablement"}