{"jobID": "2655352571", "jobLocation": "Washington_DC", "jobTitle": "Data Technology Analyst", "companyRating": null, "companyInfo": {"Website": "www.keyrus.com", "Headquarters": "Levallois-Perret, France", "Size": "1001 to 5000 employees", "Founded": " 1996", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " USAKeyrus USData Technology Analyst - Washington D.C.  #Business IntelligenceData Technology AnalystLocation: Washington D.CStart-Date: Ongoing The Keyrus US program for hiring and training Data Technology Analysts has been established as a result of exceptional growth and success. Now is a very exciting time to be involved in our business and in the data and analytics sector as a whole. Keyrus US primarily provides specialist consultants who, through projects encompassing data engineering, data discovery, and data science technologies, enable decision makers to make better, data driven decisions. As an analyst at Keyrus, you will need to combine business acumen and statistical knowledge with strong problem solving abilities to be able to analyze large sets of information and deliver insightful, actionable results to our clients. We train our analysts to become experts in Business Intelligence and commit to offering challenging, client-facing roles, primarily at clients in the financial services, non-consumer packaged goods and non-profit industries.  We are delighted to announce that due to a tremedous amount of growth over the past 2 years we are opening a brand new office in Washington D.C! We have a number of high profile clients in the local area and now see a strong need to establish a permanent prescence to continue providing clients with bespoke data analytics solutions. We are looking for candidates that are interesting in being a part of this direct expansion and looking to be the face of the company within DC/Marlyand area.  So if you have a passion for IT and the drive and ambition to be a successful consultant within the realm of data, Keyrus will help you to realize your goals!  Why Keyrus US? Leaders in the data & analytics spaceCommitted to quality training and graduate mentoringFast growing company: expanded from start-up to 40 team members in the US in the last 5 yearsStart up culture with a stability of a global network of over 2500 consultants worldwideAn entrepreneurial ethos where ideas are shared freely and the opportunity for progression is concreteReal opportunity to gain market experience as a consultant within weeks of joining the companyA competitive salary and benefits packageGreat social events and company incentivesInternational career opportunitiesAn experienced management team to support your career growth and personal development The Keyrus US Profile: Be passionate about a career in ITHave some experience in IT and a good knowledge of the IT industry. Database knowledge, scripting, object oriented programming, and statistical programming experience is a plus.Have completed or are due to complete a degree from a leading four year college or university in science or math subjects or a closely related fieldHave achieved a minimum GPA of 3.25Have tangible examples on your CV of extra-curricular activities that demonstrate your capabilities outside of your degree subject. Keyrus US is committed to recruiting well-rounded individualsBe able to relocate to Washington D.C and be geographically flexibleBe eligible to work in the US without the need of a Keyrus-sponsored VISA How do I apply?  Please send an updated version of your resume to recruitment@keyrus.us. Our recruitment team will do their best to get back to you however due to the sheer volume of applications we receive, please assume that your application has been discontinued should you not hear back within 1 month. Share Tweet Share Share Share Share EmailApply  Print "}