{"jobID": "2605040591", "jobLocation": "Rockville_MD", "jobTitle": "Data Analyst / Business Intelligence Analyst", "companyRating": null, "companyInfo": {"Website": "www.cobbsystemsgroup.com", "Headquarters": "Gaithersburg, MD", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job ID: CSGIS530 Location: Rockville, MD  Cobb Systems Group seeks a data analyst that can perform data analysis, create basic data transformation programs and develop end user reports. This is a great opportunity to accelerate your career, especially for candidates that are technically capable but have not been able to transition into a technical position. This role will query data using SQL, performing complex operations on data within Excel and use C# or VBA and SQL to translate that data into finished presentations ready for client review. Secondarily, this position will be responsible for generating custom reports using client-supplied proprietary data, and creating easy-to-use interfaces to allow others to generate custom reports, as well. Over time, this position will grow to have responsibilities to identify and implement new, novel, and impactful ways to analyze and present data. This role contains both internal- and external-facing responsibilities. Entry level candidates are welcome to apply. This is a contract-to-perm position. ResponsibilitiesBuild prototype tools to make data and analytical products more accessible to internal staffEnsure data quality and identifying methods to reduce error ratesSpot critical gaps in existing datasets and suggest methods to fill gaps with additional dataInterface with institutional and issuer clients to translate information into insightLever datasets to surface emerging governance trendsServe client and internal staff queries on datasets, including building custom data feeds through T-SQL scripting or C# and/or VBA scriptingQualificationsBA/BS degree (required) with an interest or experience in business, statistics, or computer science2+ years of analytical work experience with progressive responsibilities preferred1+ years Microsoft T-SQL programming preferredAbility to perform complicated data manipulation in Excel, including functions such as Vlookup, Hlookup, Indirect, Index, Match, FVSchedule, SUMIFS, COUNTIFS, and more is requiredAbility to write complex SQL is requiredAbility to write either, .NET or Excel VBA scripts from scratch (.net is strongly favored) requiredFamiliarity with Object Oriented Programming principles, including experience with languages such as VB.NET or C#.NET, is a significant advantageExcellent written and oral communication skillsExtreme attention to detailSuperior problem solving skillsAbility to learn technical subject matter quicklyIntellectual curiosity and dedication to mastering complex conceptsHigh proficiency in distilling massive amounts of data Apply Now"}