{"jobID": "2829676098", "jobLocation": "Austin_TX", "jobTitle": "Engineering Scientist - Sensor Systems Engineering Scientist", "companyRating": "4.3", "companyInfo": {"Website": "www.utexas.edu", "Headquarters": "Austin, TX", "Size": "10000+ employees", "Founded": " 1883", "Type": " College / University", "Industry": " Education", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "64000", "jobDescription": " Engineering Scientist - Sensor Systems Engineering Scientist Hiring department Applied Research LabMonthly salary $6,250 - $10,833Hours per week 40.00 Standard from 800AM to 500PMPosting number 18-06-27-01-4204Job Status OpenFLSA status ExemptEarliest Start Date 07/09/2018Position Duration Funding expected to continuePosition open to all applicantsLocation Austin - J. J. Pickle Research Campus (North Austin)Number of vacancies 2 General NotesAn agency designated by the federal government handles the investigation as to the requirement for eligibility for access to classified information. Factors considered during this investigation include but are not limited to allegiance to the U.S., foreign influence, foreign preference, criminal conduct, security violations, drug involvement, the likelihood of continuation of such conduct, etc. Required Application Materials  A Resume is required in order to apply A Letter of Interest is required in order to apply. A List of 3 References is required in order to apply. Note: The following additional materials are also required for consideration:  Transcript. Work references should be former employers. Instructions for submission of these materials will be provided at the time the online application has been completed. Additional Information  PurposePerform systems engineering analysis in the domains of military test and evaluations and training by interfacing with program sponsors including DoD, civilian and contractors to develop systems engineering approaches, establish requirements and architect solutions leading to testing and training solutions. Essential FunctionsResearch requirements via interviews, literature search and other information gathering techniques. Document requirements using structured systems engineering techniques, textual descriptions and presentation materials. Define systems engineering and requirement definition process, and consult with sponsor organizations to implement these processes. Research potential solutions to requirements via literature search, interviews, and other information gathering techniques. Meet with project sponsors to validate requirements and solutions. Marginal/Incidental functionsOther related functions as assigned. Required qualificationsBachelor's degree in mathematics, engineering, computer science or other applied sciences. Three years experience in developing and applying systems engineering, requirements definition, and architecture definition processes. Ability and desire to take on a technical leadership role and work as a team member without daily supervision. Ability to work independently with sensitive and confidential information, maintain a professional demeanor, and effectively communicate (both written and orally) with a diverse group of coworkers, sponsors, and subject matter experts. Able to work under pressure and accept supervision. Regular and punctual attendance. U.S. Citizen. Applicant selected will be subject to a government security investigation and must meet eligibility requirements for access to classified information at the level appropriate to the project requirements of the position. Preferred QualificationsMaster's degree in mathematics, engineering, computer science or other applied sciences and ten years' experience in applying systems engineering, requirements definition, and architecture definition processes, or Doctorate degree in one of these fields with five years' experience as stated above. Knowledge of DoD processes and programs related to systems engineering and requirements definition in at least two of the following application areas: test and evaluation, training, strategic analysis, operations planning, acquisition, experimentation, intelligence. Knowledge of military Command and Control and Intelligence, Surveillance, and Reconnaissance systems. Knowledge of modeling and simulation and its application of live, virtual, and constructive environments to the application areas listed above. Familiarity with the DoD Net Centric Data and Services Strategies and application of these strategies. Knowledge of formal systems engineering approaches utilizing the DoD Architecture Framework. Knowledge of structured system engineering notations including the Unified Modeling Language. Experience in using tools to perform systems engineering and requirements management. Working conditionsMay work around standard office conditions Repetitive use of a keyboard at a workstation Use of manual dexterity Some weekend, evening and holiday work. Frequent use of manuals and books. Work in shared, windowless office space. Some intrastate/interstate travel.A criminal history background check will be required for finalist(s) under consideration for this position.  The retirement plan for this position is Teacher Retirement System of Texas ( TRS ), subject to the position being at least 20 hours per week and at least 135 days in length.  The University of Texas at Austin, as an equal opportunity/affirmative action employer, complies with all applicable federal and state laws regarding nondiscrimination and affirmative action. The University is committed to a policy of equal opportunity for all persons and does not discriminate on the basis of race, color, national origin, age, marital status, sex, sexual orientation, gender identity, gender expression, disability, religion, or veteran status in employment, educational programs and activities, and admissions.  If hired, you will be required to complete the federal Employment Eligibility Verification form, I-9. You will be required to present acceptable, original documents to prove your identity and authorization to work in the United States. Information from the documents will be submitted to the federal E-Verify system for verification. Documents must be presented no later than the third day of employment. Failure to do so will result in dismissal.  UT Austin is a Tobacco-free Campus"}