{"jobID": "2788045288", "jobLocation": "Moorestown_NJ", "jobTitle": "Pharmacokinetics Research Scientist", "companyRating": "4.7", "companyInfo": {"Website": "www.tabularasahealthcare.com", "Headquarters": "Moorestown, NJ", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "72000", "jobDescription": " TRHC is a family of companies that leverages technology to improve healthcare. TRHC works with providers and insurers to identify multi-drug interactions and to reduce risk of medication-related problems. We have developed the first multi-drug interaction tool that identifies risk across a variety of safety factors and presents meaningful opportunities to mitigate that risk. This technology can be used to assess safety at the individual patient-level or to stratify medication risk at the population-level, and can be embedded within any EMR or other healthcare IT system. Researches scientific developments in the fields of bioinformatics, clinical pharmacology, drug interactions, pharmacogenomics, and pharmacokinetics. Periodically reviews the biomedical literature, FDA monographs, and other sources of scientific information.Searches and extracts information pertaining to the components of the MRM platform.Maintains and further develops the components of the MRM platform. Presents updates and/or recommendations for updates to a Matrix scientific committee.Supports updates with analytic findings and research results.Regularly updates the master Matrix file with approved pharmacokinetic and other pertinent data.Collaborates with Information Technology and Development to deploy updates to the Matrix.Collaborates with key stakeholders to create scientific strategies for enhancing the company?s MRM platform. Understands the research and development issues and opportunities within the portfolio of Tabula Rasa HealthCare (TRHC).Engages with key stakeholders to plan strategies for product improvement and development.Cooperates with TRHC leadership to ensure that opportunities for scientific advancement and technology transfer are recognized and maximized in product improvement and development.Fosters a body of continuing education and professional development. Engages in self-directed continuing education and professional development.Participates in educational and training activities for employees.Attends meetings with team to review and discuss findings / updates and transfer knowledgeEducation:Doctor of Philosophy (PhD) degree in relevant field (i.e., pharmacokinetics) obtained.Active Registered Pharmacist (RPh) licensure not required.Experience & Training:Experience related to pharmacokinetics.Relevant research experience in the pharmacy / pharmaceutical industry.Specific Skills:Proficient literature search skills.Proven ability to extract/source data from multiple sources and integrate them into a single source dataset or the like.Capable of analyzing data from a healthcare perspective.Advanced understanding of web technology and clinical decision support systems.Above-average proficiency in MS Excel and Word.Detail oriented and organized.Strong documentation skills.High degree of ownership for tasks and self-accountability.Independent and autonomous but with strong follow-through.Ability to work under pressure, multitask, and achieve deadlines.Decent verbal and written communication skills."}