{"jobID": "2829322875", "jobLocation": "Midland_MI", "jobTitle": "Case Manager RN", "companyRating": "3.6", "companyInfo": {"Website": "www.midmichigan.org", "Headquarters": "Midland, MI", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Covenant HealthCare, McLaren Health Care, Spectrum Health"}, "estimatedSalary": "63000", "jobDescription": " Position Information  FTE: 0.600000  Exempt: No  Day Shift: 24 Hrs/Wk; 48 Hrs/Pay  Weekend & Holiday Rotation: Per schedule  Pay Grade: 16  Position Summary  The RN Case Manager plays a pivotal role in maintaining the quality of care patients receive during medical centerization and post discharge while ensuring the organization is fully reimbursed. The RN CM must have a high level of expertise and skill to create highly effective strategies for short term and long term goals in order to prevent readmissions and address unpredictable situations. CM must be proficient in planning, executing and monitoring effectiveness of the care provided to ensure timely transition through the continuum of care. Educating and consulting with the physician and the healthcare team to ensure accuracy of medical necessity criteria and to ensure timely and appropriate level of care is achieved. This requires effective skills in conflict resolution, decision making and team building. The Nurse Case Manger practices in accordance with the care management process utilizing tools, standards, models, goals and objectives, and performance improvement concepts. The Nurse Case Manager provides pertinent clinical data to outside agencies as needed to assure compliance with their requirements and represents the organization professionally. The ability to analyze, evaluate and distribute resources and educational information to ensure understanding of services to all educational level is key to the role.  Responsibilities  ESSENTIAL:  Responsibilities: (30%)* Work with healthcare team, patient, family and/or significant others to continually transition the patient to the appropriate level/place of care. Advocate, mediate, and negotiate, with an emphasis on self-determination for the patient system, to formulate a cohesive plan for maintaining the patient’s health status, improving social supports, and moving the patient safely into less restrictive, less costly levels of care according to available resources. (20%)* Collaborates with all members of the Care Management Team including physicians, nurses, medical social workers, health information analysts, and others to provide information relating to admission, continued stay, discharge criteria, managed care, federal program regulations, reimbursement fundamentals, and regulatory standards on a daily basis. (20%)* Actively participate in care coordination efforts to successfully identify high-risk factors and respond appropriately so that key information, next steps and available days are captured and documented. Is able to lead, with the case management team, daily care coordination meetings. (10%)* Facilitates discharge planning for patients i.e. extended care placements, other facility transfers, and home care arrangements in collaboration with the health care team. (10%)* Determines the necessity for second-level review and implement process per hospital policy. Collaborates with physicians to determine appropriate patient status and successfully negotiates patient status with the payer. OTHER DUTIES AND RESPONSIBILITIES: Accepts accountability for the clinical outcomes that the Utilization Review and Discharge Planning role can facilitate.  Provides pertinent clinical data to designated outside agencies to assure compliance with their requirements.  Assures compliance with regulatory requirements and acts as a resource/liaison to physicians and hospital staff regarding all aspects of Case Management activities.  Provides education to the physicians and healthcare team regarding medical necessity criteria, resources to ensure a safe and timely discharge.  During Care Coordination Rounds, RN CM communicates with the healthcare team a patient-centered plan that is needs based, appropriate to patient resources, timely and addresses the risk of readmission.  Builds professional relationships with patient, families, facilities and resources to address conflict resolution with positive outcomes.  Maintains timely, clear and concise documentation in all required systems. Is skilled in determining the need for and implementing the hospital notices of non-coverage.  Identifies high risk population and addresses opportunities for intervention.  Willingly and consistently offer to help peers as needed. Communicates teamwork, caring and compassion.  Provide excellent customer service with internal and external customers.  Assume responsibility for professional development and education requirements for maintenance of professional licensure.  Other duties as assigned. (10%)* Analyzes the clinical information on admission, concurrently, and retrospectively (per medical necessity criteria/InterQual Guidelines) to assure quality care is being provided to the patient, in the appropriate location, on a daily basis.  Qualifications  Education: Essential:Associates DegreeNursing  Education equivalent experience:"}