{"jobID": "2816244895", "jobLocation": "Irving_TX", "jobTitle": "Data & Applied Scientist", "companyRating": null, "companyInfo": {"Website": "www.microsoft.com", "Headquarters": "Redmond, WA", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (MSFT) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Amazon, Apple"}, "estimatedSalary": null, "jobDescription": " Are you someone with a passion for data, analytics, insights and technology? Do you want to be part of a team lighting up actionable insights to help the organization make business decisions and actions? Does machine learning and AI excite you? If you answered \"yes\" to all these questions, we want to talk to you about joining the Microsoft Pre-Sales and Retention team as a Data Scientist.  Constant innovation and a customer focused mindset is the essence of the Pre-Sales and Retention team. In this data-driven and fast-paced business environment, this role will work on all aspects of the design, development, and delivery of analytics and machine learning to create applicable solutions/outputs. You will work with a range of business stakeholders to define problems, construct hypotheses, design experiments, and to implement changes that drive customer value creation. *Responsibilities** + Work closely with Marketing, Sales, Support, and Finance peers to formulate hypothetical insights and work through the lifecycle of delivering these insights towards production  + Drive the design of experiments, develop hypothesis tests, oversee test execution and evaluate results to facilitate testing of new support features, with focus on improving customer engagement and retention  + Synthesize qualitative research, quantitative findings, and new industry trends to inform business decisions  + Effectively partner with program managers on building new data driven features for personalized consumer experience  + Communicate complex analyses in a clear and actionable manner to business partners *Qualifications** + MS or PhD in statistics, mathematics, statistics science, actuarial science, econometrics, Operations Research, computer science, physics, or other related fields is required. (Or any equivalent technical field with 7+ years of experience in data analytics.)  + 3+ years of experience in data analytics and modeling  + 3+ years of experience using R or Python.  + 3+ years of experience with experiment design and A/B testing  + Hands-on experience in statistical modeling methods, time series, text mining, optimization, information retrieval.  + Experience working with and applying Neural Networks, LDA, SVM, Clustering algorithms, survival analysis, and social network analysis  + Expertise on any of the common Machine Learning tools is a plus. Ability to build production grade machine learning enabled solutions end to end.  Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.  Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work."}