{"jobID": "2814199520", "jobLocation": "Houston_TX", "jobTitle": "Senior Estimating&Project; Cost Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.cbi.com", "Headquarters": "The Woodlands, TX", "Size": "10000+ employees", "Founded": " 1889", "Type": " Company - Public (CBI) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $10+ billion (USD) per year", "Competitors": " Fluor, KBR, Bechtel"}, "estimatedSalary": "78000", "jobDescription": "Job Overview: The Senior Estimating&Project; Cost Data Analyst will be an enterprise level position driving and/or supporting global initiatives related to the estimating function. Examples of the initiatives are historical data collection and benchmarking, developing analytical correlations, implementing software applications to a global team, collaborating&developing; models with our tangential partners (Supply Chain, Business Development, Sub-Contracts, and Project Management etc.), productivity models, training and improving efficiency in estimating across McDermott's business groups. This position will also have the opportunity to contribute to the department's strategic direction and business plans as well as developing and facilitating the functional processes and procedures for all of McDermott's estimating groups.  This is a highly visible position throughout the corporation and is not a traditional estimating role. The opportunity focuses on the business side of estimating and project controls and will assist/support the planning, scheduling, cost and progress aspects of the business as well. Key Responsibilities/Accountabilities:Pro-actively drive to completion high level initiativesResponsible for developing your own task list that facilitates the delivery of the initiatives that support the strategic direction and business plan for the departmentAccountable for the professional packaging of your deliverable as your internal clients are senior leaders (Directors, Sr. Directors, VP's, etc.)Developing, assisting in the development, and / or leading the development of all processes, procedures, works instructions and guidelines for the estimating function at the enterprise levelAssist in the facilitation of collaboration between operating units to increase alignment across all McDermott.Support initiatives such as benchmarking, software implementation, parametric data leveraging, training, risk evaluations, and escalation etc.Support continuous improvement initiative at the enterprise levelAttend conferences to network and stay abreast of the market trendsBasic Qualifications:High energy and self-motivatedProfessionally presentableDesired/Preferred Qualifications:Bachelor's Degree10 years of experience in a large EPC company (preferably in estimating, project controls, data analytics)Estimating and/or Project Controls Leadership backgroundBackground in developing or managing project historical data collection and analysis systemsWillingness to travel for short periods domestically or internationally to support development and rollout of estimating initiativesDesire to make a difference in a large EPC Infrastructure organizationOther Details: Position is located in Houston, TX Energy Corridor. Company Overview: McDermott is a premier, fully-integrated provider of technology, engineering and construction solutions to the energy industry. For more than a century, customers have trusted McDermott to design and build end-to-end infrastructure and technology solutionsfrom the wellhead to the storage tankto transport and transform oil and gas into the products the world needs today."}