{"jobID": "2796866059", "jobLocation": "Austin_TX", "jobTitle": "Data Engineer", "companyRating": "3.5", "companyInfo": {"Website": "www.flosports.tv", "Headquarters": "Austin, TX", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": " FloSports is looking for an experienced Data Engineer to join our Data Warehouse Development team in the fast-paced and exciting world of sports media. FloSports, headquartered in Austin, Texas, operates a fast-growing network of dedicated sports sites. ABOUT THE JOB This role is located near downtown/east Austin. As a data engineer at FloSports, youll be helping us leverage our rich and interesting dataset to make smarter decisions. Your goal will be to develop and own the ETL pipelines, interfacing with various databases and APIs. Your data solutions will support the insights and analysis critical for all our decision making needs whether its related to product design, driving subscriber conversion and retention, or helping users discover more great content. In this role, you will learn a lot about user behavior and FloSports as a business and have an impact on business and production decisions. If you love making an impact through data, come join our team! WHAT YOULL DODesign, build, and launch ETL processes to integrate data sources from internal/external providers into our data warehouseCollaborate with subject matter experts across a wide variety of business units to design, implement, and deliver comprehensive analytic solutions.Explore potential data sets that can enrich our warehouse and enable meaningful insightsDevelop our framework to pursue data quality and outlier detectionOptimize ETL workflows to mitigate costs, improve reliability, and drive performanceWHO YOU ARE2-5 years of data engineering experienceExperience with AWS (Redshift, Athena, Spectrum, S3, EC2, etc.)History of building, maintaining, and automating reliable ETL pipelinesA solid foundation in SQL to create/tune queries and scale out our BI architectureExperience developing with object-oriented programming using PythonBe comfortable in experimenting and demoing new technologiesBachelors / Masters Degree in Computer Science, Information Systems or related fieldBONUSFamiliarity with Spark, Lambda, or FirehoseWorked with data sources/analytics such as Segment, Payment Data (e.g. Stripe), Event Tracking (Kissmetrics, Mixpanel, etc).Experience with workflow management tools (Airflow, Glue, etc.)ABOUTFLOSPORTS FloSports, a global leader in live digital sports and original coverage, partners with event rights holders and governing bodies to unlock a world of sports coverage that true fans have been waiting for. Through live streaming of premier events, original video programming, and weekly studio shows, FloSports is growing the sports, the athletes, and the fans. Current verticals under the FloSports header are Wrestling, Grappling, Rugby, Cycling, MMA, Elite Fitness, Softball, Gymnastics, Marching, Basketball, Volleyball, Rodeo, Cheerleading, Dance and Track."}