{"jobID": "2732958258", "jobLocation": "San_Jose_CA", "jobTitle": "Field Applications Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.bio-techne.com", "Headquarters": "Minneapolis, MN", "Size": "1001 to 5000 employees", "Founded": " 1976", "Type": " Company - Public (TECH) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "103000", "jobDescription": "Job DetailsLevel SeniorJob Location San Jose - San Jose, CAPosition Type Full-TimeJob Category ManagementDescriptionWe are currently seeking an experienced Field Applications Scientist based in the San Jose, CA area to provide superlative sales support and customer service for our revolutionary protein analysis instrumentation. The candidate will be a key member of a team of Field Applications Scientists responsible for providing pre- and post-sales applications and technical support for several products. The ideal candidate is both an experienced bench level scientist/application scientist with a strong background in proteomics/immunoassays, as well as an experienced customer support specialist.  Key Responsibilities  • Train customers on instrument use, assay development and data analysis on ProteinSimple’s Simple Western, Immunoassay and Biologics instruments Develop and maintain positive relationships with customers in assigned territoryHelp to maintain and increase product usage and support sales efforts through technical presentations and product demonstrationsAccompany Sales Representatives on sales calls in customer laboratories to provide technical and applications assistanceProvide on-going assay development support and troubleshooting for customers in-person, via phone and emailAct as a key contributor of customer feedback to marketing and product development teamsAssist in creation and review of technical literature including manuals and application notesCreate and maintain customer support information using our CRM (SalesForce)Qualifications• Previous hands-on experience with immunoassays and protein characterization assays is required"}