{"jobID": "2740307290", "jobLocation": "Austin_TX", "jobTitle": "Scientist/Ecologist", "companyRating": "3.5", "companyInfo": {"Website": "www.atkinsglobal.com", "Headquarters": "Epsom, United Kingdom", "Size": "10000+ employees", "Founded": " 1938", "Type": " Company - Public (ATK) ", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " AECOM, CH2M, Arup"}, "estimatedSalary": "52000", "jobDescription": " SNC-Lavalin’s Atkins business is one of the world’s most respected design, engineering and project management consultancies. SNC-Lavalin’s Atkins business has been providing infrastructure planning, engineering, construction, environmental consulting, urban planning, architecture, and program management services to public and private clients across the United States for more than 50 years.  SNC-Lavalin’s Atkins business was ranked as the world’s 11th largest global design firm by ENR in 2016 with nearly 18,000 employees worldwide. We have the depth and breadth of expertise to respond to the most technically challenging and time-critical infrastructure projects and the urgent transition to a low-carbon economy.  Atkins seeks an energetic and highly motivated self-starter to join our Environmental team in Austin, Texas as an Scientist/ Ecologist II. Our office is located at the Domain, an upscale retail and business center, located in north Austin.  This role will exercise technical expertise and provide project oversight for a diverse range of projects in the field of infrastructure environmental science and consulting. This position will support senior technical staff in the field and in the office, performing natural resource surveys, collecting and analyzing data, preparing reports, supporting cost estimates, and interacting occasionally with clients, subcontractors, private parties, members of the public, and regulatory agencies. You may also participate in business development and marketing efforts over time JOB DUTIES Conduct natural resource field investigations, including but not limited to identification of waters of the United States, including wetland delineations; threatened and endangered species coordination; habitat evaluations including presence/absence surveys; specimen collection; handling construction monitoring; stormwater and erosion control monitoring and compliance; soil/water sampling; data entry, processing, and interpretation; and Phase I site assessments.  Prepares technical report of findings; supports preparation of permits and NEPA documents, and provides peer reviews of reports prepared by others.  Serves and as in-field team leader for junior staff and technicians.  Responsible for planning field work and coordinating with various parties as to when and where field work will occur.  Serves as an in-field team leader for health and safety requirements, including the preparation of safety documents and adherence to company safety protocols and procedures.  Maintains field notes and other collected data in an organized and useful fashion to meet and safeguard project objectives.  Effectively communicate the results of studies performed to supervisory and project management staff.  Support proposal scope, technical approaches, and fee estimates.  Serves as an in-field point of contact for clients, subcontractors, and various other parties.  May assist in the management of projects.  Performs such other duties as the Supervisor may from time to time deem necessary. EDUCATION AND EXPERIENCE B.S./B.A. or M.S. in a field of Science including Natural Resources, Biology, Ecology, Forestry, Environmental Science, or related fields commensurate with the hiring discipline. This level may be achieved by Scientists with minimum three years' experience since Bachelor's degree or two years' experience with Master's degree; typical incumbent has five years' experience EDUCATION AND EXPERIENCE B.S./B.A. or M.S. in a field of Science including Natural Resources, Biology, Ecology, Forestry, Environmental Science, or related fields commensurate with the hiring discipline. This level may be achieved by Scientists with minimum three years' experience since Bachelor's degree or two years' experience with Master's degree; typical incumbent has five years' experience SPECIAL SKILLS Strong analytical skills and attention to detail, self- motivating technical writing, computer and communication skills including public speaking desired.  The ideal candidate would have experience in identification of waters of the United States (including wetlands); Section 404/401 permitting; wildlife and/or botany surveys and compliance; NEPA studies and documentation; stormwater and erosion compliance experience; wetland and stream condition assessment; wetland and stream mitigation; basic stream hydrologic principles; GIS skills; and GPS equipment familiarity.  The successful applicant must have a general understanding of one or more of the following industries: infrastructure, transportation, state and local governments, or water quality.  Prior experience with Galveston, Fort Worth, and Albuquerque Districts of the USACE and TxDOT preferred.  Prior absence and presence survey experience as well as USFWS scientific permits or ability to obtain permits also preferred. ADDITIONAL REQUIREMENTS Routine travel is to be expected. Must be confident working in harsh and inhospitable outdoor climates in the southwestern and Midwestern US during all times of the year. Must maintain a keen awareness of safety protocols in the field and in the office. Will occasionally operate a company truck or rental vehicle.  Atkins offers its employees a robust rewards package which includes: a competitive salary; a broad benefits package including medical/RX, dental, vision, life, disability, legal, hospitalization and other valuable voluntary options; generous time-off programs; flexible work schedules; 401(k) with employer match; professional and career development opportunities through our corporate university, as well as a highly-regarded tuition reimbursement program; and an unmatched culture focused on client-service, quality, and tireless pursuit of excellence in all we do. Atkins is an equal opportunity, drug-free employer committed to diversity in the workplace. EOE/Minorities/Females/Vet/Disability.  Please view Atkins Equal Opportunity Statement here: http://careers.atkinsglobal.com/File.ashx?path=Root/Documents/north-america-welcome-new-employee/Equal_Opp_Stmt.pdf"}