{"jobID": "2721595410", "jobLocation": "Caldwell_NJ", "jobTitle": "Analytical/Technical Scientist - Senior", "companyRating": null, "companyInfo": {"Website": "www.judge.com", "Headquarters": "Wayne, PA", "Size": "1001 to 5000 employees", "Founded": " 1970", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Adecco, Kforce"}, "estimatedSalary": null, "jobDescription": "Pharmaceutical Company is looking for: POSITION: Analytical/Technical Scientist - Senior Level  LOCATION: West Caldwell New Jersey  SALARY: $100-125K + Bonus  DEGREE: Preferred  EXPERIENCE: 5+ Years Pharmaceutical Experience in Analytical Characterization and Lab  RELOCATION: Assistance Available  The position is responsible for analytical method development activities associated with the development of manufacturing processes for sterile injectable and oral dose drug products including monitoring of upstream and downstream process steps, testing and characterization of drug substance and drug product. The position also participates in formulation development and supports research and development in clinical candidate selection. Essential Duties and Responsibilities: Responsible for analytical test methods development to support in-process, drug substance and drug product testing Provides analytical characterization for research and development for selection of new pre-clinical candidates Performs development stability studies and studies in response to FDA information requests Correctly executes development activities as defined by senior scientific staff or management. Initiates and designs studies, as appropriate Applies basic scientific principles, technology and regulatory knowledge with minimal guidance  Demonstrates the ability to interpret outcome of experiments and to propose appropriate follow-up experiments  Trains personnel on analytical methods to enable them to perform independently  Communicates own work effectively orally and in writing  Contributes and/or prepares protocols, testing procedures, and technical reports.  Performs literature searches and extracts relevant information from published information  Reports and treats data with a high level of integrity and ethics  Thoroughly and accurately documents experimental activities in laboratory notebooks. Desired Education, Skills and Experience: BS/BA or higher degree in a scientific discipline  5-10 years of relevant experience  Experience in hands on analytical methods development including lab activities cGXP, CMC, ICH  Knowledge of basic computer programs routinely used in a lab such as MS Word, Powerpoint, Excel, GraphPad, etc.  Ability to quickly learn and master new instrument software and programs.  Excellent organization, interpersonal, and communication skills.  Being a team player and respectful of others is a must.  Experience in maintaining thorough lab records, and adhering to health and safety regulations  Ability to thrive in a fast-paced, small start-up environment Judge Group Job Order ID: 564012 Salary: 100000-125000  Company Description:Working at the crossroads of people and transformative technologies, The Judge Group delivers innovative business solutions – powered by top talent – to help organizations reach their strategic goals and realize opportunities now and in the future.  The Judge Group is a leading professional services firm specializing in technology, talent, and learning solutions. Our services are successfully delivered through a network of more than 35 offices in the United States, Canada, China, and India. The Judge Group serves more than 40 Fortune 100 companies and is responsible for the placement of more than 4,500 professionals annually across a wide range of industries. To learn more, visit www.judge.com."}