{"jobID": "2757506013", "jobLocation": "Midland_MI", "jobTitle": "Hospice Nurse RN - Weekend Only", "companyRating": "3.6", "companyInfo": {"Website": "www.midmichigan.org", "Headquarters": "Midland, MI", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Covenant HealthCare, McLaren Health Care, Spectrum Health"}, "estimatedSalary": "27", "jobDescription": " Position Information  FTE: 0.700000  Exempt: No Weekend Only: 28 Hrs/Wk; 56 Hrs/Pay  Weekend & Holiday Rotation: Per schedule  Pay Grade: 14  Position Summary  The Staff Registered Nurse provides professional and comprehensive nursing care within the scope of agency services. The target patient population for this position are those requiring skilled clinical home care services. Activities of this position are patient/client focused and utilize the nursing process of assessment, planning, intervention, and evaluation in accordance with nursing practice standards, physician orders, and agency policies and procedures.  Responsibilities  ESSENTIAL:  Responsibilities: (15%)* Understands criteria for admission and recertification to hospice care and takes appropriate actions in response to patient/client conditions related to these criteria. (10%)* Upon admission, assesses patient’s/clients needs including physical, emotional, spiritual, cultural, and environmental. (45%)* Regularly assesses patients/clients needs and caregiver abilities and communicates with other team members as needed to ensure optimal patient and family/caregiver care. (30%)* Initiates plan of care for assigned patients/clients and revises and adapts as necessary. OTHER DUTIES AND RESPONSIBILITIES: MidMichigan Health is a technology driven organization and employees need to demonstrate competency in Microsoft® Windows. An employee may be required to participate in further learning opportunities offered by MidMichigan Health.  Provides symptom management for discomfort related to end of life care.  Provides nursing care (or arranges for services through specialized staff) through ongoing visits to a group of patients/clients, based on acuity and level of care needed.  Coordinates patient/client care by evaluating outcomes and providing on-going feedback to others involved in care relative to patient/client status and changes needed on patient/client care plan including referrals to other services as needed.  May coordinate care provided by a Licensed Practical Nurse (LPN) and a Home Health Aide. Implements preventative and rehabilitative nursing procedures and utilizes community resources for optimum patient care.  Notifies physician of changes in patient/client condition and care needs and obtains new orders as needed.  Utilizes Agency documentation system to record services provided according to agency, professional, and program standards.  Assists in maintenance of patient/client records.  Provides patients/clients/caregivers/physicians with the necessary information regarding the disease process and end of life care issues deal with issues of ethical concern.  Participates in the clinical team in providing patients/clients/caregivers with information required by regulatory agencies.  Functions as part of multi-disciplinary team in coordinating care and prioritizing needs.  Acts as a preceptor to provide educational visit opportunities for students and will participate in orientation of new staff as assigned.  Participates in Agency, community and/or home health/hospice organization education and activities as assigned and appropriate.  Participates in staff meetings, in-service education programs, and other opportunities for learning.  Maintains awareness of own needs for support and takes appropriate actions to ensure own health and safety.  Complies with documentation requirements for employee personnel and activity records as defined in Agency policy.  Carries out work according to Agency policies and procedures in such a manner as to appropriately reflect Agency standards for timeliness, accuracy, and productivity.  Maintains confidentiality of client and Agency information.  Adheres to the Agency standards related to personal appearance and behavior.  Participates in weekend and holiday rotations and on-call duties as identified in personnel policies.  Participates in Agency performance improvement process.  Assists in Agency community education activities as requested.  Other duties as assigned.  Qualifications  Education: Essential:Associates DegreeNursing  Education equivalent experience:"}