{"jobID": "2618662778", "jobLocation": "Ann_Arbor_MI", "jobTitle": "Data Scientist / Data Analytics", "companyRating": "3.4", "companyInfo": {"Website": "www.dominos.com", "Headquarters": "Ann Arbor, MI", "Size": "10000+ employees", "Founded": " 1960", "Type": " Company - Public (DPZ) ", "Industry": " Restaurants, Bars & Food Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Pizza Hut, Papa John's, Little Caesar's"}, "estimatedSalary": "99000", "jobDescription": " Dominos, which began in 1960 as a single store location in Ypsilanti, MI, has had a lot to celebrate lately: were a reshaped, re-energized brand of honesty, transparency and accountability not to mention, great food! In the rise to becoming a true technology leader, the brand is now consistently one of the top five companies in online transactions and over 60% of our sales in the U.S. are taken through digital channels. The brand continues to deliver the dream to local business owners, 90% of which started as delivery drivers and pizza makers in our stores. Thats just the tip of the icebergor as we might say, one slice of the pie! If this sounds like a brand youd like to be a part of, consider joining our team!  As leader of innovation in the food and digital commerce space, Dominos is constantly testing new concepts, platforms, and technologies that drive outstanding consumer and employee experience but require disciplined data approach.  The Data Scientist will be primarily responsible for assisting the creation of Machine Learning models to support smart applications for consumer and employee technology. In addition, this role provides advanced analytical and machine learning support for the broader Strategy and Insights group. The role will interact with key leaders on the team as well as functional business leaders across the marketing, IT and operations departments.  Main Responsiblities include: Provide guidance and support in the areas of Machine Learning and Artificial IntelligenceAd Hoc Project Guidance and SupportBachelors degree in Business or Marketing Analytics, Digital Insights, Statistics, Math, or related fieldMinimum of 5 years of professional experience in analytics and researchMinimum of 1-year predictive analytic experience.Minimum of 4 years of client management experience (including reporting responsibilities) and a proven record of directly impacting clients portfolio of businessMinimum of 2 years of experience in enterprise database environments, such as MS sql, Oracle or MySQLProficient in statistics packages and methods, e.g. R, Rapidminer, SPSS, SASExperience with data integration (ETL) and ETL toolsetsKnowledge of SQL query language including advanced scriptingExcellent project management skillsProficient in Microsoft Office Fluent in Power Point and Proficient in Excel"}