{"jobID": "2804867555", "jobLocation": "Kalamazoo_MI", "jobTitle": "Clinicial Veterinarian / Senior Scientist", "companyRating": null, "companyInfo": {"Website": "www.zoetis.com", "Headquarters": "Parsippany, NJ", "Size": "5001 to 10000 employees", "Founded": " 1950", "Type": " Company - Public (ZTS) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Zoetis is a global animal health company dedicated to supporting customers and their businesses in ever better ways. Building on 60 years of experience, we deliver quality medicines and vaccines, complemented by diagnostic products and genetic tests and supported by a range of services. We are working every day to better understand and address the real-world challenges faced by those who raise and care for animals in ways they find truly relevant.  Our name, Zoetis (zō-EH-tis), has its root in zo, familiar in words such as zoo and zoology and derived from zoetic, meaning \"pertaining to life.\" It signals our company's dedication to supporting the veterinarians and livestock producers everywhere who raise and care for the farm and companion animals on which we all depend on.  Zoetis is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status or any other protected classification. Disabled individuals are given an equal opportunity to use our online application system. Zoetis also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as employment eligibility verification requirements of the Immigration and Nationality Act. All applicants must possess or obtain authorization to work in the US for Zoetis. Zoetis retains sole and exclusive discretion to pursue sponsorship for the acquisition or maintenance of nonimmigrant status and employment eligibility, considering factors such as availability of qualified US workers. Individuals requiring sponsorship must disclose this fact.  Please note that Zoetis seeks information related to job applications from candidates for jobs in the U.S. solely via the following: (1) our company website at www.Zoetis.com/careers site, or (2) via email to/from addresses using only the Zoetis domain of \"@zoetis.com\". In addition, Zoetis does not use Google Hangout for any recruitment related activities. Any solicitation or request for information related to job applications with Zoetis via any other means and/or utilizing email addresses with any other domain should be disregarded. In addition, Zoetis will never ask candidates to make any type of personal financial investment related to gaining employment with Zoetis. Clinical Veterinarian / Senior Scientist The Veterinary Service group, within Animal Research Support at Zoetis, has the mission and responsibility of developing and implementing the program of veterinary care and providing veterinary support to R&D; projects at the Richland and Kalamazoo sites. We are seeking an experienced, innovative and highly motivated veterinarian to contribute towards delivering an exceptional animal care program as well as partnering with R&D; researchers to produce high quality research studies.  POSITION RESPONSIBILITIES: Contribute to the development and support of new target animal disease models and efficacy and safety studies by: Perform necropsies to score lesions and make evaluations in support of study objectivesPerform daily clinical observations on animals in support of study objectivesMake veterinary determinations of clinical presentation of animals and their correlation to administration of an investigational product.Collaborate across multiple scientific disciplines.Data entry, verification and handling, record keeping, in accordance with scientific protocol and applicable Standard Operating Procedures.Provide general veterinary consult to multiple project teamsLead innovation in developing new animal models and techniques for use by the project teams.Serve as a resource for the animal technicians and managers of the animal program.Provide clinical veterinary support to research animals (ex. companion animals, poultry, livestock and equine) at the Richland and/or Kalamazoo sites in support of Veterinary Medicine Research and Development.Additional responsibilities may include: Development and/or implementation of population medicine programs and preventive medicine proceduresProvision of training to animal care technicians and/or study personnelStudy oversight by: reviewing protocols and ensuring compliance with approved proceduresParticipation in pre-study planning activitiesPreparation of health certificatesAssessment of animals prior to shipment and after receiptAuthoring and reviewing SOPsPerform necropsies and clinical observations on animals in support of the veterinary care program and to fulfill study objectives.Serve as a non-voting Institutional Animal Care and Use Committee ad hoc member (ex. Animal Use Protocol review, semiannual facility inspections)Participation in facility design/renovation planningParticipation in project teams and other initiatives.Provide support to the Animal Welfare and Compliance Coordinator by: assisting with animal welfare audits of animal suppliers and contract research organizations; and participating in internal and external animal welfare audits (AAALAC, USDA, and internal audits.). EDUCATION AND EXPERIENCE: Suitable candidates will have a DVM/VMD from an AVMA accredited College of Veterinary Medicine and a minimum of 3 years of experience in a clinical practice setting providing veterinary care to companion animals. Experience with laboratory animals and/or poultry is very desirable. Must also be a creative/independent thinker with a desire to investigate problems and to utilize a team to create innovative animal models.Licensed to practice in at least one state with the expectation to become licensed in MichiganFederally accreditedAbility to communicate and interact effectively with colleagues as a participant on multi-disciplinary teams.Strong hands-on expertise in a range of small animal techniques including handling, restraint, dosing, venipuncture, clinical examination and diagnosis, minor surgical procedures and necropsy. OTHER DESIRABLE ATTRIBUTES Previous experience in research setting as a clinical veterinarian or in vaccine development.Experience with poultryAdditional academic training in an allied field (infectious diseases, immunology, epidemiology).Experience as a \"hands-on\" veterinarian working with animals.Knowledge of animal welfare compliance oversightExperience working in animal programs regulated by USDA APHIS and visited by AAALAC.Network of research veterinarians or practicing veterinariansHigh motivation, demonstrated initiative, independent and flexible in thinking, strong interpersonal skills, and attention to detail.Previous experience in a research environment and/or in research/product development in the animal health industry. Strong documentation, writing, teaching and oral communication skills.Experience with multiple software platforms, including electronic data capture and data management experienceDevelopment of biosecurity procedures and programsGood Laboratory Practices (GLP) ADDITIONAL INFORMATION: Work environment: The person filling this position will work with research scientists, study monitors, Line Managers and technical staff. May be required to work with zoonotic and animal pathogens and chemicals. There may be handling of zoonotic organisms and working in BSL-2 facilities requiring shower in/out procedures.Veterinary support is about 30% in support of research projects and 70% in support of the animal care program.Participate in veterinary on-call duty on weekends and holidays on a rotational basis including some work outside of core business hours.Some travel (10%) to off-site locations may be required"}