{"jobID": "2816812924", "jobLocation": "Los_Angeles_CA", "jobTitle": "Junior Data Analyst", "companyRating": "2.8", "companyInfo": {"Website": "www.havasmedia.com", "Headquarters": "Paris, France", "Size": "5001 to 10000 employees", "Founded": " 1978", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "45000", "jobDescription": " Havas is looking for a Junior Data Analyst. The analyst will compile offline advertising data and import into Datorama’s reporting platform, and will act as a strategic consultant when it comes to analytics and usage of the platform. This role will strictly service Universal Music Group and it’s Record Labels. This is a unique opportunity for a dynamic professional who is open to assuming greater responsibilities and who is committed to continuous professional growth. The ideal candidate is organized, detail oriented and analytical; must be able to assemble and manipulate large quantities of data and draw meaningful conclusions. Responsibilities Identify and develop a strong understanding of UMG’s core objectives and challenges Set up UMG on Datorama’s platform, insure deliverable match requirements compile offline advertising data and import into Datorama’s reporting platform, and will act as a strategic consultant when it comes to analytics and usage of the platform. Support UMG on a day to day basis to help resolve system issues and answer questions Coordinate and deliver UMG deliverables Be the day-to-day point of contact for UMG Be proactive in presenting innovative and creative analyst relations plans and ideas for UMGQualifications 1+ years experience in digital analytics, preferably in top tier media agency or Adtech vendor Familiarity with Datorma a big plus! Knowledgeable and adept with databases and data mapping Advertising Agency experience (preferred) Extensive experience using Excel (vlookups, pivot tables, chart visualizations, etc.) and SQL Strong technical and problem solving skills Excellent communication skills, both written and verbal Time management skills with the ability to effectively manage and prioritize own workload Project management skills Understanding of the offline and online advertising industry / eco-system Technology related B.S. or B.A. degree"}