{"jobID": "2712445602", "jobLocation": "Pleasanton_CA", "jobTitle": "Senior Data Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.veeva.com", "Headquarters": "Pleasanton, CA", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Unknown", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "155000", "jobDescription": " Our Company  At 2,200 employees and growing, and consistently strong financials (NYSE:VEEV), Veeva was named among the top fastest growing public technology companies on Forbes' annual Fast Tech 25 list. We build innovative cloud solutions for some of the world's largest pharmas and biotechs, and we need great people like you to make it happen.  Our Culture & People  Our core values are Employee Success, Customer Success, and Speed. We are innovators, collaborators, and thought leaders out to create best-in-class solutions that help our customers improve and extend human life. It's genuine, straight-forward, and no fuss.  Job Summary  We're looking for a Senior Data Scientist to join our growing analytics team, to help us deliver next generation analytics for our Veeva Life Science customers. Our ideal candidate is statistician / data wrangler / data flow architect that can to scour Life Sciences + Commercial content to derive insights to delight Veeva customers.  As a senior member of our analytics team, you will work side by side with other analytically focused developers, product managers, architects and analysts, to deliver new suites of applications and architectures for our Veeva Life Science customers. If you relish data challenges, play well on smart teams, enjoy ripping through a wide range of tools to find the needle in the haystack, and are looking for an opportunity to work with a fast growing company let's talk!  What will your day look like? Work with large, complex data sets. Develop models to solve difficult, non-routine analysis problems, applying advanced analytical methods as needed. Conduct end-to-end analysis that includes data gathering and requirements specification, processing, analysis, ongoing deliverables, and presentations.Build and prototype analysis pipelines iteratively to provide insights at scale. Develop comprehensive understanding of Veeva data structures and activities to derive metrics, advocating for changes where needed for both products development and sales activity.Develop new techniques to identify Pharmaceutical Industry trends, to help customers gain broader market perspectiveCombine your love and knowledge of quantitative data analysis across large data sets with solid presentation skills to help stakeholders make market and product decisions.Give commercial leadership visibility to behavioral and demographic trends in industry sales teams.Qualities we Value:Organized mind that translates complex stat into concise presentationsTrusted collaborative demeaner.Curiosity to help explore answers to questions that haven't been asked yetMinimum Qualifications:BS in Quantitative Field (Stat, Math, Computer Science, Stat, or Engineering)5+ years experience with enterprise data technologies, large scale DB management, ETL pipelines, streaming models.3+ years experience in data science, or experience in a suitable advanced analytic domain (analytic-driven research, market analysis, etc.)Good knowledge of R or Python bonus points for data analytics packages such as PySpark + MLLib.Good understanding of high performance Machine Learning techniques such as: classification, clustering, deep learning, fuzzy matching, sentiment analysisAdvanced data manipulation skills (Web Scraping, Text Mining)Preferred Qualifications:Deep hands on experience with statistical data analysis such as linear models, multivariate analysis, stochastic models, sampling methods.Applied experience with machine learning on large datasets.Experience working in SaaS cloud based world, tools, and access models.Expertise working within an Agile development environment.Expertise working with Real-time Analytic environments, providing instant model feedback from high volume transactions.Experience with CRM and Salesforce data + experience with RedshiftFamiliarity with source control platforms, primarily GitHub, and data engineering & development best practices About Veeva  Veeva is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, sex, sexual orientation, gender identity or expression, religion, national origin or ancestry, age, disability, marital status, pregnancy, protected veteran status, protected genetic information, political affiliation, or any other characteristics protected by local laws, regulations, or ordinances.SDL2017"}