{"jobID": "2820377058", "jobLocation": "Austin_TX", "jobTitle": "Clinical Data Review Assistant", "companyRating": null, "companyInfo": {"Website": "www.natera.com", "Headquarters": "San Carlos, CA", "Size": "501 to 1000 employees", "Founded": " 2004", "Type": " Company - Public (NTRA) ", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "POSITION SUMMARY The Clinical Data Review Assistant supports the Clinical/Medical Laboratory Scientist Data Review team. Duties performed require both written and verbal communication with internal and external domestic and international customers consisting of medical professionals, laboratory personnel, channel partners, and sales obtaining and processing all required information needed to process patient genetic testing samples, reports, and billing. Duties also include maintaining shared spreadsheets and performing miscellaneous clerical tasks.PRIMARY RESPONSIBILITIESDeal directly with internal and external customers via telephone and electronic channels to obtain or convey missing information needed for processing of submitted test samples.Track sample collection kits and answer questions regarding test statusUpdate internal databases regarding test development progress and make notes in LIMS case notesAssist CLS/MLS Data Reviewers in answering questions from clinics and customer supportCoordinate report release requests from Genetic Counselors and Customer SupportThis role works with PHI on a regular basis both in paper and electronic form and has access to various technologies to access PHI (paper and electronic) in order to perform the job.Employee must complete training relating to HIPAA/PHI privacy, General Policies and Procedure Compliance training and security training as soon as possible but not later than the first 30 days of hire.Must maintain a current status on Natera training requirements.Employee must pass post offer criminal background check.Performs other duties as assignedQUALIFICATIONSTwo-year degree or equivalent preferred.Minimum of 2 years of customer service or clerical experience.Experience with Google mail and Google DocumentsProblem analysis and problem-solving experience preferredData collection and maintenance experience preferredKNOWLEDGE, SKILLS, AND ABILITIESKnowledge in Microsoft Office suite and basic typing with excellence in spelling and grammarExcellent attention to detail and organization skillsAdaptability to change and self-starterAbility to maintain professional customer communicationsPHYSICAL DEMANDS & WORK ENVIRONMENTJob duties are performed in either a Natera office or in the employees home office; office space should be private.Position requires the ability to use a computer keyboard, communicate over the telephone, and read printed material.Duties may require working outside normal working hours (evenings and weekends) at times.OUR OPPORTUNITY Driven by the passion for elevating the science and utility of genetic testing, Natera is committed to helping families identify and manage genetic diseases. Natera is a rapidly-growing diagnostics company with proprietary bioinformatics and molecular technology for analyzing DNA. Our complex technology has been proven clinically and commercially in the prenatal testing space and we are actively researching its applications in the liquid biopsy space for developing products with oncology applications. The Natera team consists of highly dedicated statisticians, geneticists, doctors, laboratory scientists, business professionals, software engineers and many other professionals from world-class institutions, who care deeply for our work and each other. When you join Natera, youll work hard and grow quickly. Working alongside the elite of the industry, youll be stretched and challenged, and take pride in being part of a company that is changing the landscape of genetic disease management.WHAT WE OFFER Competitive Benefits. Healthy catered lunches, Premium snacks and beverages, Onsite gym with cardio and weight-training equipment, Game room with satellite TV, Onsite dry cleaning and alteration service with pick-up and delivery, Employee-organized sport leagues, Happy hours and BBQs, Generous Employee Referral program.  For more information, visit www.natera.com.  Natera is proud to be an Equal Opportunity Employer."}