{"jobID": "2824060761", "jobLocation": "Houston_TX", "jobTitle": "Senior Data Analyst", "companyRating": "2.7", "companyInfo": {"Website": "www.globalhca.com", "Headquarters": "Houston, TX", "Size": "51 to 200 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "67000", "jobDescription": "Position Summary The Senior Data Analyst is responsible for assisting the Director of Data Analytics in new market solutions and training and developing the Healthcare Data Analysts. The ideal candidate will have a background in data analytics as well as experience in the healthcare setting with a keen attention to detail. The ability to work independently and proactively to provide accurate and timely information to the Director of Data Analytics is a must. Technical ExpertiseDevelopment and execution of analytical and/or research activities.Identify and implement data driven approaches and methods.Effectively communicate findings of various analyses to the Director via clear and concise written reports and oral presentations.Develop, research and recommend new predictive analytic approaches.Research outliers and identify root causes of issues identified in reports.  Ability to Assemble and Equip a Data Analytics TeamAssist with leading a data analytics team in the extraction, aggregation and quality assurance of data from multiple sources.Ensure consistency of approach related to analysis techniques and key findings.Assist the Director to provide direct skills, develop, manage and lead a team of analysts.Assist with the development and preparation of a consistent set of operational reports/dashboards for leadership.Collaborate with IT and other business units to advance the company’s reporting capabilities and improve accuracy of data.Determine opportunities and identify solutions to improve capabilities and efficiency of reporting.Effectively communicate workload prioritization and progress to all interested parties. Focus on Delivery of Services that Inspire Prospects and Build Client ValueProvide prospects and clients with reporting, analytics, and consultation that is relevant and actionable.Developments of prospect/client recommendations/opportunities.Provide reporting & analytical support to business units and support cross-functional projects.Participate in client discussions and effectively represent subject matter expertise.Educate account/ advisory teams and sales leadership and increase understanding of informatics capabilities and performance metrics so they can better manage prospect/client needs and demands.Ability to translate data into meaningful information in report or presentation formats. Required Experience / QualificationsBachelor’s degree in related field required.5+ years in analytics/informatics and report development experience (healthcare environment a plus).3+ years’ experience with analytics in data warehouse environment.Working knowledge of SQL and SSRS for report writing and data management.Proficient in Excel, Access, Word, Outlook and PowerPoint.Excellent written and verbal communication skills.Excellent presentation skills.Experience with advanced data visualization tools, such as Tableau, a definite plus.Knowledge of healthcare financial business cycle, healthcare quality reporting and analysis, benchmarking, predictive modeling and risk stratification."}