{"jobID": "2819785216", "jobLocation": "Grand_Rapids_MI", "jobTitle": "Inside Sales Representative", "companyRating": null, "companyInfo": {"Website": "www.lwsupply.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1971", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " L&W; Supply is a leading specialty distributor of drywall, ceiling tiles, steel framing and other building materials used by commercial and residential contractors. L&W; Supply delivers the products and capabilities offered by a national distributor paired with the service and personal touch usually found only in a locally owned business.  As an Inside Sales Associate, you will provide assistance to customers as they purchase the materials they need for a variety of building projects. From the moment you greet customers until their sales have been finalized, you will provide them with superior service and building supply expertise. In this role, it is helpful to have experience with building supplies, so that you are familiar with the various products and associated terminology. Specific duties may include:Assisting customers in developing L&W; solutions to meet their needsDiscussing features and benefits of products and servicesEstablishing rapport with new customers and nurturing relationships with long term customersSoliciting feedback from customers on products and servicesCoordinating delivery requests to ensure efficiency and customer satisfactionAssisting in the development of branch sales plan and strategyAssisting in the design and execution of merchandising strategyDetermining customers’ needs and recommending appropriate products and solutions, up-selling additional products and supplies for each jobAnswering incoming phone calls and emails to assist customers in a timely mannerAccepting payment and applying it to the appropriate customer accountArranging with the warehouse for customer product pickupReordering products to keep the store and warehouse shelves well stockedAddressing and resolving service concerns, should they ariseSpecific qualifications include:1-2 years' experience with interior building products is preferredExcellent verbal and written communication and interpersonal skillsSolid time management and prioritization skillsBasic computer skillsPositive attitude and team playerDetail and service orientedBenefits may include:Health, dental, and vision coverageLife insurance401(k) with company matchFlex spendingPaid time offPaid holidaysEqual Opportunity Employer / Drug Free Workplace"}