{"jobID": "2812693177", "jobLocation": "Austin_TX", "jobTitle": "Clinical Data Reporter", "companyRating": null, "companyInfo": {"Website": "www.natera.com", "Headquarters": "San Carlos, CA", "Size": "501 to 1000 employees", "Founded": " 2004", "Type": " Company - Public (NTRA) ", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "POSITION SUMMARYThe Reporting Team members review test reports for accuracy of patient demographics, clinic information, and regulatory compliance in case-files as needed. Duties performed include aspects of a data entry position as well as a customer service agent.PRIMARY RESPONSIBILITIESReviews test reports for accuracy of patient information and test information and issue the reports to clinics via the Laboratory Information Management System (LIMS)Accurately documents and update patient accounts with all information received and all actions takenCommunicates electronically with Customer Care Specialists, Inside Sales Specialists, Clinical Laboratory Scientists, Genetic Counselors and Engineering to obtain all required informationResponds to emails in a timely, friendly, and professional manner to create positive connections with other departmentsDirect unresolvable issues to Clinical Data Reporting Team Lead or other designated resourceParticipates in the updating of departmental standard operating procedures and database to accurately reflect current practicesAssists with mentoring and training new employeesOther duties may be assigned to meet business needsThis role works with PHI on a regular basis both in paper and electronic form and have an access to various technologies to access PHI (paper and electronic) in order to perform the jobEmployee must complete training relating to HIPAA/PHI privacy, General Policies and Procedure Compliance training and security training as soon as possible but not later than the first 30 days of hire.Must maintain a current status on Natera training requirements.Employee must pass post offer criminal background check.QUALIFICATIONSAssociate degree and/or 2 years minimum data entry/customer service experienceKNOWLEDGE, SKILLS, AND ABILITIESFlexible in work time and shift as work schedule may be modified to meet operation requirementsKnowledge in Microsoft office applications and basic typing with excellence in spelling and grammarKnowledge of numeric, oral, and written language applicationsExcellent attention to detail and organization skillsAdaptability to change and self-starterAble to deal with challenging circumstances, results-orientedDemonstrated ability to work creatively amidst competing priorities to meet goals/objective on timeWillingness to learn new tasks and possess a positive, service-oriented attitudePreferred skills and ExperienceExperience with LIMSProblem analysis and problem solvingData collection and maintenanceBilingual a plusPHYSICAL DEMANDS AND WORK ENVIRONMENTThis position requires the ability to use a computer keyboard, communicate over the telephone and read printed material. Duties may require working outside normal working hours (evenings and weekends) at times. Potential Work From Home Position after meeting productivity requirementsThis is a full-time position that requires no travelOUR OPPORTUNITY Driven by the passion for elevating the science and utility of genetic testing, Natera is committed to helping families identify and manage genetic diseases. Natera is a rapidly-growing diagnostics company with proprietary bioinformatics and molecular technology for analyzing DNA. Our complex technology has been proven clinically and commercially in the prenatal testing space and we are actively researching its applications in the liquid biopsy space for developing products with oncology applications. The Natera team consists of highly dedicated statisticians, geneticists, doctors, laboratory scientists, business professionals, software engineers and many other professionals from world-class institutions, who care deeply for our work and each other. When you join Natera, youll work hard and grow quickly. Working alongside the elite of the industry, youll be stretched and challenged, and take pride in being part of a company that is changing the landscape of genetic disease management.WHAT WE OFFER Competitive Benefits. Healthy catered lunches, Premium snacks and beverages, Onsite gym with cardio and weight-training equipment, Game room with satellite TV, Onsite dry cleaning and alteration service with pick-up and delivery, Employee-organized sport leagues, Happy hours and BBQs, Generous Employee Referral program. For more information, visit www.natera.com.Natera is proud to be an Equal Opportunity Employer."}