{"jobID": "2831488389", "jobLocation": "Novi_MI", "jobTitle": "Board Certified Behavior Analyst (BCBA)", "companyRating": null, "companyInfo": {"Website": "www.behaviorfrontiers.com", "Headquarters": "Gardena, CA", "Size": "501 to 1000 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Autism Spectrum Therapies, Center for Autism and Related Disorders, ACES"}, "estimatedSalary": null, "jobDescription": "BCBA POSITION AVAILABLE NOVI, MI!Job Description Behavior Frontiers is pleased to offer you an exciting opportunity to advance your career by becoming a Clinical Director for autism programs in Novi, Michigan. We hope you will join our team of experienced professionals to oversee research-based ABA treatment programs for children with autism spectrum disorders. This is an excellent chance for you to put your leadership skills into practice as a clinical director managing your own office of clinicians! Excellent Compensation & Benefits PackageCompetitive compensation based on experiencePotential for career advancementAccess to a team of highly experienced autism professionals as part of a clinical support systemInitial and continuous training opportunitiesRemote access to our comprehensive curriculum and online training programsUse of company laptopsUse of company mobile phoneFlexible work days and time; ability to work from home401k retirement plan with company matchMedical and dental insurance for full-time employeesPaid Personal Time Off (PTO)Paid holidaysPaid drive timePaid mileagePaid training timePaid professional liability insurancePaid conference attendance (e.g., registration, travel, room, meals, etc.)Allowances for purchasing reinforcers for clients and staffOpportunities to participant in research projects and present at conferencesBehavior Frontiers handles the billing and administrative interfacing with clients and funding sourcesRelocation assistance, if applicableRequired QualificationsBCBA certification and/or licenseMasters or Doctorate degree in education, psychology, or behavior analysisExperience working as a behavior supervisor designing ABA programs for children with autism, as well as training parents and technicians how to implement these interventionsKnowledge and experience with DTT, NATS/NET, VBExperience conducting assessments: VB-MAPP, Vineland, FBAJob ResponsibilitiesConduct face-to-face supervision for clients in your regionProvide both in-office and in-field mentorship for all BCBA and BCaBA menteesTrain behavior supervisors, as well as other staff as neededMeet with supervisors weekly to review their caseload and logsWrite and/or edit initial and progress reports for clientsPerform all responsibilities related to intakes of new clients in designated regionMonitor and perform liaison and evaluation meetings of staff members annuallyMonitor quality improvement initiatives and employee incentive programs for your regionMonitor social events for your regionMonitor and attend professional conferences and parent support group meetingsMeet with health plan representatives to foster amiable working relationshipsOptional: Engage in research and development projects to ensure that Behavior Frontiers is always expanding and incorporating cutting edge information into our service delivery (e.g., create new data sheets, curriculum, trainings, services offerings, etc.)Perform additional duties as assigned.About Behavior Frontiers Behavior Frontiers is dedicated to providing research-based ABA treatment to children with autism and other special needs. We also offer online and in-person training programs to train parents and professionals how to use proven ABA methods to improve the lives of children with special needs. We are currently expanding our services in several states and are looking for career-minded, experienced BCBAs to join our team. At Behavior Frontiers you will find a professional, ethical, structured, respectful, caring, and fun work environment where you can reach your career goals! Location BCBAs living in or near the following cities are encouraged to apply: Birmingham, Ann Arbor, Beverly Hills, Bloomfield Charter Township, Troy, Franklin, Novi, Huntington Woods, Northville Township, Pittsfield Charter Township, Northville, Lodi Township, Rochester Hills, Farmington, Royal Oak, West Bloomfield Charter Township, Plymouth, Farmington Hills, Berkley, Bloomfield Hills, Rochester, Plymouth Charter Township, Saline, Canton Charter Township, Pleasant Ridge, Orchard Lake Village, Superior Charter Township, Contact If you believe that you have the passion to create a difference in the lives of children with autism at a supervisory level, then we invite you to apply today. We look forward to hearing from you!  Please visit our website at http://www.behaviorfrontiers.com to learn more about Behavior Frontiers and our programs."}