{"jobID": "2701582277", "jobLocation": "Flint_MI", "jobTitle": "Network Engineer I", "companyRating": "3.8", "companyInfo": {"Website": "www.cellcom.com", "Headquarters": "De Pere, WI", "Size": "501 to 1000 employees", "Founded": " 1987", "Type": " Company - Private", "Industry": " Telecommunications", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "50000", "jobDescription": " Network Engineer I Location  Nsight Corporate (450) – Green Bay, WI Employment Type  Full timeApply NowCompany Summary: Nsight, parent company of Cellcom, Nsight Telservices, and Nsight Tower wants YOU to join our team!  Our family of companies provides wireless, business and residential local service, long distance, internet, web hosting and tower erection and maintenance services in the Midwest. Our green initiatives, commitment to customer service and local philanthropic efforts make us an employer of choice in the state of Wisconsin. We’re looking for individuals who are driven, enthusiastic and care about our community. More importantly, we like to hire people looking to grow with an organization and those who are excited about the ever-changing telecommunications industry. Job Summary: The Network Engineer I will provide network backhaul design and support for key elements within the transport and IP networks, including network security and performance monitoring. This position will collaborate with teammates and other Nsight departments to understand network requirements for both the Nsight cellular network and Nsight wireline network. In addition the Network Engineer I will work vendors to define / test the technical designs, as well as, develop project plans and documentation to assist the Nsight teams with the deployment and operation of network equipment. The Network Engineer I will be accountable for providing second level problem resolution support and will be a primary interface with suppliers in the trouble resolution process. This position will also be responsible for new technology and product research, as well as, providing plans on how to implement new technology in our network. Responsibilities & Duties:Perform network design for network element additions within the IP or Optical networks.Installs, admins, configures and maintains network management systems including operating systems and related software.Provide on-call support to resolve troubles outside of normal business hours.Use change-management processes to minimize customer impact when completing changes on the network.Monitors and assists in managing applications, device availability, network conditions / status, system reliability & performance, and maintenance programs.Research new technologies & principles as network requirements change.Develop SOWs (Scope of Works) and MOPs (Method of Procedures) for all network projects.Manage projects in which you are the EIC (Engineer in Charge).Work jointly with the network technicians to provide timely project documentation and to meet project due dates.Maintain installation standards and work with operations to perform periodic audits to ensure adherence to standards.Maintain network records and engineering documentation.Support network troubles; cellular network and wireline network (CLEC and ILEC).Monitor network performance and ensure it meets standards (internal and external networks), as well as, network / technology trends.Establish network design & performance parameters.Perform additional related duties as requested or required.Requirements:Bachelors Degree in engineering or computer science or equivalent degree and experience.Cisco CCNA Routing & Switching (ICND1 & ICND2), Security (IINS) or Service Provider (SPNGN1 & SPNGN2); or Cisco equivalent/relevant certification such as CCISSP or CompTia Fundamentals desired.Basic understanding of TDM networks, SONET networks, WDM/CWDM/DWDM/RoADM networks & IP Networks, including, OSI hierarchy.Basic understanding of fiber optics.Basic understanding of network monitoring; APIs, SNMP, etc.Basic understanding of software defined networks and network virtualization.Basic understanding of power systems; AC and DC powered for cell site and customer premise environmental systems.1 to 3 years of experience in the telecommunications industry; preferably in a wireless and service provider environment.Familiarity with legacy TDM & SONET networks, Cisco experience preferred.Familiarity with IP networks and routing protocols (BGP, ISIS and OSPF), Cisco experience preferred.Familiarity with VoIP equipment & operation, SIP and SIP Gateways and TDM trunks; familiarity with Cisco Communications Manager and Lync server preferred.Understanding and implementation of network traffic analysis.Experience with Cisco IOS/XR-IOS preferred.Familiarity with optical networks, Cisco experience preferred.Proficient with Microsoft Office Suite; Project, Visio, etcFamiliarity with Linux OS"}