{"jobID": "2786882485", "jobLocation": "San_Francisco_CA", "jobTitle": "Machine Learning Engineer (Connections), AI Labs", "companyRating": null, "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About AI Labs Uber AI Labs gathers top scientists and engineers to create the next generation of machine learning algorithms to improve the lives of millions of people worldwide. We conduct basic and applied research into problems of all shapes and sizes at Uber, that allow us as a company to optimize cities and keep riders safe and happy. About the Role Uber AI Labs is looking for engineers to bring next generation AI solutions to life. You will work closely with research scientists at AI Labs to implement and deliver cutting edge machine learning solutions to product teams throughout Uber. We work across a wide range of problems from long-term trip growth prediction, to short-term supply/demand modeling, to optimizing dispatch, to automatization of machine learning algorithms, and much more. You will be expected to be able to learn and understand the details of the cutting-edge machine learning algorithms and work to deliver them effectively to the millions of customers that use Uber every day. About youYou have expertise in one or more object-oriented languages, including Python, Go, Java, or C++, and an eagerness to learn moreYou have experience with both machine learning and building scalable production servicesYou have experience with distributed storage and database systems, including SQL or NoSQL, MySQL, or CassandraYou have experience using machine learning libraries or platforms, including Tensorflow, Caffe, Theanos, Scikit-Learn,or ML Lib for production or commercial productsA strong desire to learn the details of advance machine learning algorithmsYou have the ability to communicate effectively between research scientists and production engineers, both in code and conversationYou have the ability to solve complex business problems and apply machine learning to optimize critical business metricsYou follow a strong adherence to metrics driven development, with a disciplined and analytical approach to product development.Bonus points ifYou have experience in statisticsYou enjoy reading academic papers and implementing experimental systemsYou have experience presenting at industry recognized ML conferences as well as being published in the field.You have experience in stream processing—Storm, Spark, Flink etc.— and graph processing technologies."}