{"jobID": "2822071154", "jobLocation": "Dallas_TX", "jobTitle": "Environmental Engineer, Physical Scientist, Life Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Duties Help Duties Summary  Earth Day is every day at EPA! At EPA, you can protect human health and the environment of all Americans, and you'll discover that EPA is one great place to work! We offer great benefits and work flexibilities, and our diverse workforce connects to more than just a career--we share a common passion to promote a cleaner, healthier environment. Discover how exciting safeguarding our natural resources and protecting human health can be. Find yourself at EPA.  This position is located in Region 6, Office of Multimedia, Enforcement, Superfund and Water Division, and Office of Environmental Justice Tribal and International Affairs Dallas.TX For more information on this office, visit their website: https://www.epa.gov/aboutepa/epa-region-6-south-central  If selected, you must work at the location stated in this announcement.  Except in special circumstances, those new to the federal government will be hired at the starting salary (step 1) of the applicable grade range listed above.  If you are selected, we may pay a recruitment incentive.One or more positions may be filled.  If you are selected, we may offer payment for your current student loan.  Learn more about this agency ResponsibilitiesYou will:Performs duties related to environmental engineering, physical science or life science to support environmental protection work in a program area (air, water, waste, etc.); a functional area (enforcement, compliance, permitting, etc.); or a cross media effort (environmental justice, etc.Determines the adequacy and accuracy of data and processes, proper preservation and collection of samples and specimens and provides technical assistance where applicable.Provides assistance to other engineers and scientists within the immediate organization by researching technical aspects of EPA laws and regulations. Travel Required  Occasional travel - You may be required to travel 1 to 5 days per month  Supervisory status  No  Promotion Potential 12 Who May Apply This job is open to  Recent Graduates who have completed a qualifying degree or certificate from a qualifying educational institution or technical education program within the preceding two years of the announcement closing date (the two years begins on the date all course requirements are met). Preference eligible veterans unable to apply within two years of receiving their degree due to military service obligation may apply up to six years after degree or certification.  Questions? This job is open to 4 groups. Job family (Series) 0819 Environmental Engineering  1301 General Physical Science  0401 General Natural Resources Management And Biological Sciences  Similar jobs Engineers, EnvironmentalEngineers, SoilEnvironmental EngineersSoil EngineersRequirements Help Requirements Conditions of Employment EPA and non-EPA applicants must submit transcripts/course listings.If you are selected, a written participant agreement must be signed.You must meet all Recent Graduates program requirements by the closing dateYou must be a U.S. citizen.If you are selected, a pre-employment background check is required. If you are selected, the entire period served under the Internship Program will be a trial period.  This position is designated as Low Risk and requires a background investigation. Unless an appropriate background investigation is already on record with the Office of Personnel Management, you must undergo a background investigation.  If you are selected, you will be required to complete a Confidential Financial Disclosure form within 30 days of your first day of employment and annually thereafter.  You must meet time in grade requirements no later than 30 calendar days after the closing date of this announcement. Qualifications In addition to the eligibility requirements for the Recent Graduates program, this position has specific educational requirements in order to qualify as described below:  A bachelor's degree from an accredited or pre-accredited college or university.  Engineering -0819  A. Degree: professional engineering. To be acceptable, the curriculum must: (1) be in a school of engineering with at least one curriculum accredited by the Accreditation Board for Engineering and Technology (ABET) as a professional engineering curriculum; or (2) include differential&integral; calculus and courses (more advanced than first-year physics&chemistry;) in five of the following seven areas of engineering science or physics: (a) statics, dynamics; (b) strength of materials (stress-strain relationships); (c) fluid mechanics, hydraulics; (d) thermodynamics; (e) electrical fields&circuits; (f) nature&properties; of materials (relating particle&aggregate; structure to properties); and (g) any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, soil mechanics, or electronics. OR B. Combination of education&experience-college-level; education, training, and/or technical experience that furnished (1) a thorough knowledge of the physical and mathematical sciences underlying professional engineering,&(2) a good understanding, both theoretical&practical;, of the engineering sciences&techniques;&their; applications to one of the branches of engineering. The adequacy of such background must be demonstrated by one of the following:  Professional registration -Current registration as a professional engineer by any State, the District of Columbia, Guam, or Puerto Rico. Absent other means of qualifying under this standard, those applicants who achieved such registration by means other than written test (e.g., State grandfather or eminence provisions) are eligible only for positions that are within or closely related to the specialty field of their registration. For example, an applicant who attains registration through a State Board's eminence provision as a manufacturing engineer typically would be rated eligible only for manufacturing engineering positions.  Written Test -Evidence of having successfully passed the Engineer-in-Training (EIT) examination, or the written test required for professional registration, which is administered by the Boards of Engineering Examiners in the various States, the District of Columbia, Guam,&Puerto; Rico. Applicants who have passed the EIT examination&have; completed all the requirements for either (a) a bachelor's degree in engineering technology (BET) from an accredited college of university that included 60 semester hours of courses in the physical, mathematical,&engineering; sciences, or (b) a BET from a program accredited by the Accreditation Board for Engineering and Technology (ABET) may be rated eligible for certain engineering positions at GS-5. Eligibility is limited to positions that are within or closely related to the specialty field of the engineering technology program. Applicants for positions that involve highly technical research, development, or similar functions requiring an advanced level of competence in basic science must meet the basic requirements in paragraph A. Because of the diversity in kind&quality; of BET programs, graduates of other BET programs are required to complete at least 1 year of additional education or highly technical work experience of such nature as to provide reasonable assurance of the possession of the knowledge, skills,&abilities; required for professional engineering competence. The adequacy of this background must be demonstrated by passing the EIT examination. Specified academic courses -- Successful completion of at least 60 semester hours of courses in the physical, mathematical,&engineering; sciences&in; engineering that included the courses specified in the basic requirements. The courses must be fully acceptable toward meeting the requirements of a professional engineering curriculum as described in paragraph A. related curriculum -- Successful completion of a curriculum leading to a bachelor's degree in engineering technology or in an appropriate professional field, e.g., physics, chemistry, architecture, computer science, mathematics, hydrology, or geology, may be accepted in lieu of a degree in engineering, provided the applicant has had at least 1 year of professional engineering experience acquired under professional engineering supervision and guidance. Ordinarily there should be either an established plan of intensive training to develop professional engineering competence, or several years of prior professional engineering-type experience, e.g., interdisciplinary positions. (The above examples of related curricula are not all-inclusive.)  Note: An applicant who meets the basic requirements as specified in A or B above may qualify for positions in any branch of engineering unless selective factors indicate otherwise, or unless he/she qualifies under the provisions of B.2 related to the EIT examination or BET degree.  Physical Science - 1301  A. Degree: physical science, engineering, or mathematics that included 24 semester hours in physical science and/or related engineering science such as mechanics, dynamics, properties of materials, and electronics.  In addition to the educational requirements, we are looking for at least one year of specialized experience related to this position as described below:  To qualify for the GS-07 level, you need to have at least one year of full-time experience equivalent to the GS-05 level defined as: Providing general guidance and advice on environmental issues, and assist in the review of scientific or technical documents. - OR 1 full year of graduate level education; or superior academic achievement (Superior Academic Achievement Definition) degree in the academic discipline as described below.  To qualify for the GS-09 level, you need to have at least one year of full-time experience equivalent to the GS-07 level defined as: Providing policy and/or procedural guidance on environmental issues, assist in the production or review of scientific/technical documents, and provide stakeholders or others with advice on environmental issues. - OR master's or equivalent graduate degree; or 2 full years of progressively higher level graduate education leading to such a degree in the academic discipline as described below.  Life Science-0401  A. Degree: biological sciences, agriculture, natural resource management, chemistry, or related disciplines appropriate to the position. OR B. Combination of education and experience: Courses equivalent to a major, as shown in A above, plus appropriate experience or additional education.  Your answers to the online assessment will be used to evaluate your competencies in the following areas: Knowledge of and skill in applying professional engineering, physical or biological science theories, principles and methods to determine and/or execute a wide range of developmental assignments involving conventional features and problems, projects, or studies that may include several environmental conditions and varying environmental processes.Skill in using standard data gathering and analysis techniques to collect and review technical information on environmental activities and to identify and solve problems of a procedural or factual natureKnowledge of applicable environmental laws, regulations, statutes, policies and guidelines sufficient to perform well-precedented and recurring assignments and to determine compliance with federal requirements.Ability to communicate effectively, both orally and in writing, to write technical reports and letters and to make presentations to various types of audiences.Education As part of the application process, you are required to submit college transcripts or a list of courses as described in the Required Documents section of this announcement. However, if you are selected, you must provide official educational transcripts before you start work with EPA. More information on verification of education can be found here: EPA Announcement Policies and Procedures."}