{"jobID": "2828443810", "jobLocation": "Bryan_TX", "jobTitle": "Senior Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.tamuct.edu", "Headquarters": "Killeen, TX", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " College / University", "Industry": " Education", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Senior Data AnalystA&M; System Member : Texas A&M; UniversityDepartment : Graduate And Professional StudiesJob Category : Other or Not SpecifiedJob Type : StaffLocation : College Station/BryanProposed Minimum Salary : CommensurateJob Requisition Number : R-007661Security Sensitive? : YesJob TitleSenior Data AnalystAgencyTexas A&M; UniversityDepartmentGraduate And Professional StudiesProposed Minimum SalaryCommensurateJob LocationCollege Station, TexasJob TypeStaffJob Description The Senior Data Analyst will work closely with the Associate Provost, Assistant Provosts, Directors, and others on confidential data analysis, providing overall direction and management for the gathering, compiling, analyzing, interpreting, and reporting of data. Designs data modeling/analysis services to mine systems and applications, builds, deploys and maintains data support tools, metadata inventories and definitions for database file/table creation. Required Education and Experience:Bachelor’s degree.4 years of data analysis experience.Required Special Knowledge, Skills, and Abilities:Ability to multi-task and work cooperatively with others.Other Requirements or Other FactorsAbility and willingness to travel on occasion.Requires ability to multi-task and work cooperatively with others.Preferred Education and Experience:Master’s Degree.3 to 5+ years of related analyst experience including but not limited to academia, consulting, financial services or information technology industriesPreferred Special Knowledge, Skills, and Abilities:Strong quantitative and analytical skillsStrong problem solving and conceptual thinking abilitiesStrong communication, interpersonal, and leadership abilitiesAbility to work in a fast-paced, environmentAbility to handle multiple concurrent projects while working independently and in teamsAbility to lead small teams to complete data and reporting improvement projectsAbility to act as the Project Manager for stand-alone data management project(s)Ability to act as the Lead Data Analyst for assigned data management project(s)Ability to coordinate the work of department staff assigned to the projectAbility to train assigned employees on project-related data management procedures and guidelinesPreferred Other Factors:Integrity: Strong sense of ownership in your work, commitment to quality workmanship, and solid interpersonal and written communication skills.Initiative: Self-motivated, proactive in communicating progress and issues, able to manage time efficiently to meet deadlines and prioritize workload.Informative: Analytical, extremely detail-oriented, able to work in a fast-paced environment.Innovative: Able to pick up new technologies and business concepts quickly, proactive in identifying problems and offering suggestions for improvement.Compensation: $51,438.85 - $60,174.40 Responsibilities:Timely and Effective extraction, compilation, and quantitative and qualitative analysis of data from existing data stores for special projects for the Associate Provost, Assistant Provosts, and Directors. Serve as primary customer point of contact on data mining projects and reporting on advanced data mining and technical matters, research, and applications. Analyzes and interprets data, both from quantitative and qualitative analyzes, using accepted statistical and qualitative research methods.Timely and efficient collection and analysis of data to inform decisions in OGAPS for the Associate Provost and for the functional areas (Recruiting, Marketing, Allocations, and Processing). Prepares, maintains, and presents historical and comparative data. Effectively identify and implement process, data, and reporting improvements for OGAPS.Develops, maintains, and updates databases for highly complex specialized projects. Develops databases and spreadsheets for data analyses, oversees the collections and analyses of data. Develops and performs needed assessments to identify problematic data, make corrections, and eliminate causes of data problems.Work with departments, colleges, and Data and Research Services to provide timely and accurate responses to surveys and requests for data; and timely collection and posting of graduate data for annual 18 characteristics of doctoral programs. Respond to requests for information and prepares ad-hoc reports and query analyses in desired format.Accurate and timely generation and effective analysis of graduate student degree and funding data, and college expenses for GRST allocations to colleges for Director and Chief of Staff. Efficient collection and analysis of data for ad hoc requests by Director and Chief of Staff. Serve as liaison with regards to data information needs. Performs other duties as assigned.Instructions to Applicants: Applications received by Texas A&M; University must either have all job application data entered or a resume attached. Failure to provide all job application data or a complete resume could result in an invalid submission and a rejected application. We encourage all applicants to upload a resume or use a LinkedIn profile to pre-populate the online application.  All positions are security-sensitive. Applicants are subject to a criminal history investigation, and employment is contingent upon the institution’s verification of credentials and/or other information required by the institution’s procedures, including the completion of the criminal history check.  Equal Opportunity/Affirmative Action/Veterans/Disability Employer committed to diversity."}