{"jobID": "2824797475", "jobLocation": "Irvine_CA", "jobTitle": "Data Scientist I", "companyRating": "3.3", "companyInfo": {"Website": "www.ingrammicro.com", "Headquarters": "Irvine, CA", "Size": "10000+ employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Copaco, Tech Data, COMPAREX"}, "estimatedSalary": "118000", "jobDescription": " Data Scientist IUnited States |  Irvine,  California  Job ID: 20625Job DescriptionPosition at Ingram MicroIngram Micro touches 80% of the technology you use every day with our focus on Technology Solutions, Cloud, and Commerce and Lifecycle Solutions. With $43 billion in revenue, we have become the world’s largest technology distributor with operations in 56 countries and more than 30,000 associates. We continue to strategically expand our global reach with 32 acquisitions since 2012. We are seeking a candidate to develop statistical, machine learning, economic, geographic, and mathematical models to address complex business problems in the tech and ecommerce space.  You will work with the Advanced Science Lab, reporting to a Director with a Ph.D. in Economics, to build causal and predictive models, design and execute field experiments, model demand, design and conduct surveys, perform supply chain optimization, and develop state of the art machine learning and AI models.  The role will collaborate with a diverse team of highly talented Ph.D.s, Masters, and industry experts to use advanced scientific techniques on a world class data infrastructure to develop large-scale models with immediate relevance. You will focus on new product development projects as well as existing internal and external projects. Effective communication with cross-functional teams is required. The role will maintain a broad understanding of Ingram Micro’s business model along with becoming educated on particular vendors, customers, as well as internal division’s business models and needs. QualificationsDegree (Bachelor or Master) in a strongly quantitative field such as: Statistics, Applied Mathematics, Operations Research, Computer Science, or Econometrics.2-5 years’ relevant experience or Master’s degree with 1 year relative research/project experience. Experience in analyzing large data sets, identifying trends and patterns preferred.Knowledge and experience of tools for data mining, statistics, analysis, and scripting (e.g., R, SAS, Scala, MATLAB, Python).Experience with cleaning, aggregating, and pre-processing data from varied sources. Experience using SQL queries for standard as well as ad hoc data mining purposes.Ability to visualize data and analytical results, and communicate effectively with internal and external contacts.Candidate must have ability to apply training, models, and insights to high impact questions with immediate relevance.Perform econometric and statistical analysis of large transaction level data sets to develop causal and predictive models.Design and execute field experiments to draw insights from market behavior.Build predictive models to forecast downstream market activity.Experience developing and implementing demand models.Experience with optimization techniques.Experience with machine learning models.Be familiar with and use modeling techniques such as:Support Vector MachinesFeatures extraction, attributes selectionClustering, decision and model treesNumerical optimization (linear and nonlinear) with constraintsExperimental DesignMultiple Dimensional ScalingNeural NetworkConjoint/Discrete ChoiceTime Series ModelingLinear and Non-Linear RegressionPrice optimization, price elasticity/demand modelingText mining on structured and unstructured data, sentiment analysisAbility to work independently and in a highly engaged team environment.Experience analyzing large data sets, identifying trends and patterns, and effectively communicating insights.Experience cleaning, aggregating, and pre-processing large granular data from varied sources, including complex relational databases.Experience with tools such as R, Python, STATA, SQL, SAS, and MATLAB.Effective verbal and written communication skills and the ability to collaborate with internal and external teams. *This is not a complete listing of the job duties. It’s a representation of the things you will be doing and you may not perform all of these duties. Ingram Micro Inc. is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status, or any other protected category under applicable law."}