{"jobID": "2816418369", "jobLocation": "Menlo_Park_CA", "jobTitle": "Learning Scientist/Data Analyst, Facebook Blueprint", "companyRating": "4.5", "companyInfo": {"Website": "www.facebook.com", "Headquarters": "Menlo Park, CA", "Size": "10000+ employees", "Founded": " 2004", "Type": " Company - Public (FB) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Google, Snap, Uber"}, "estimatedSalary": "108000", "jobDescription": " Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities we're just getting started.Facebook is looking for an experienced Learning Scientist/Data Analyst to join the Facebook Blueprint team. Blueprint is a global training program designed to educate advertisers, agencies, marketing partners, and small businesses on how to meet their business goals using the Facebook family of apps and services. The Blueprint team is entrepreneurial-minded and dedicated to delivering the ultimate learning experiences for partners across multiple channels. Our mission is to democratize scaled education for businesses big and small. If you have a passion for education and the development of training programs, enjoy leading next generation innovative online learning deliveries and want to join a fast-growing team as we embark on this journey, then this might be the team for you.Blueprint has three pillars: Online (eLearning: online courses and MOOC training), In-Person (Live and Spotlight: interactive in-person workshops), and Certification (proctored exams that test advanced-level competency in Facebook advertising).The Learning Scientist/Data Analyst role will be responsible for maintaining an analytical view across all of these pillars, defining overall data usage strategy, spotting and reporting on emerging audience trends and insights, visualizing it all through Tableau and other visualization solutions, and finally communicating these results back to the team and the larger organization. This role will also interface heavily with other Analytics and Product teams to drive experimentation and innovation within Blueprint's suite of platforms and surfaces. This role will sit within Blueprint's Products and Technology team, and report to the Global Products and Technology Lead. This role is based in Facebook's MPK office. Responsibilities:"}