{"jobID": "2702141905", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.esparklearning.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Education", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "77000", "jobDescription": " At eSpark we're building the next generation of tools to help students succeed in school and in life. We curate the best learning resources to create a personalized learning experience for each student. Its life-changing impact: students who use our products are measurably more likely to be on track for college.  As a company focused on student outcomes, we are seeking a talented Data Analyst to help maximize our impact. This role will drive the decisions of schools across the country as they incorporate educational technology in their classrooms.  The ideal candidate is fluent in a variety of data analysis techniques and has the ability to communicate data-informed insights to teammates and school leaders. This person will shape our culture, work on ground-breaking technologies, and solve fascinating problems in personalizing education for students.  Imagine some of the challenges you might undertake as a Data Analyst: Evaluate efficacy. You will combine data from various sources to estimate the impact of personalized learning technology in a school district. This will require the ability to perform complex analyses using data from varied sources.Distill recommendations. Using your analyses, you will make recommendations for how schools can maximize their student outcomes within their constraints.Turn trends into strategies. Leveraging your learnings from diverse school implementations, you will identify trends in product efficacy. Your insights will shape the product roadmap and implementation strategy, enabling the company to develop a more efficacious experience for our school partners.Differentiate learning. Delivering the right content to the right students at the right time, because every student learns differently. Your data analyses will create insight on individual student progress and how to match content to meet every students unique needs.Scale everything. With rapid growth comes a need for replicable and robust systems at scale. Qualifications"}