{"jobID": "2820058243", "jobLocation": "Detroit_MI", "jobTitle": "Senior QA Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.saggezza.com", "Headquarters": "Chicago, IL", "Size": "201 to 500 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": "Senior QA Analyst: Are you interested in the latest innovative technology? Saggezza is in search of a QA Analyst to join our team in the Detroit area. While this role will be focused on managing clients and consulting teams, we need someone who also isnt afraid to jump in and get their hands dirty and has the ability to quickly learn new technologies. Required Skills:4-6 years of experienceWriting test scenarios and executing tests, both manually and with automated toolsExperience with SDLC and testing methodologies, including functional, regression and system testingExperience testing software at API levelExperience writing XML, PL/SQL, Java, Shell and Perl scripts to automate testing tasksExperience using Oracle, Unix based systemsExperience developing tools to aid in testing client/server and web applicationsDemonstrated knowledge of relational databases and browser capabilities and constraintsBachelors degree in Computer Science or relevant engineering degreeOpen to 75% TravelKey Accountabilities:Participate in the design and implementation process of new and existing productsDefine and implement black-box, white box and automated testing suites for core technologies, products and web-based applicationsDevelop and maintain test scriptsWrite and maintain test automation scripts where applicableTest data and perform business applications functional system, integration (end-to-end) tests for new and existing applicationsParticipate in review and approval process of project deliverablesProvide guidance to development and project teams on the creation of a master test plan and other testing related deliverablesAssist project teams on identifying the needs for appropriate test environments and coordinate the establishment of appropriate test environmentsOversee processes for identifying, tracking and reporting the results of test proceduresAssist in populating and maintaining regression test databasesPerform regression testing using existing scriptsFind, track and prioritize bugs and work toward their resolutionDefine and track quality assurance metrics such as defect densities and open defect countsParticipate in the testing of production emergency bug fixesPerform rotating on-call support duties and periodically participate in after-hours release testingParticipate in release production validationWhy join our team?Work on major software projects for FTSE 500 companiesWork directly with our clients C-level executives from day oneWere growing fast. Come on board for the chance to grow with usEnjoy an agile and collaborative culture as part of a team of likeminded individualsWe have offices across North America, Europe, and India, which means global opportunities for career advancementAbout Us: Saggezza is a global solutions provider with deep links and insights into the technologies shaping the next generation of business. We help ambitious businesses unlock the power of their enterprise data to accelerate growth and uncover opportunities. We combine software development and implementation expertise with our next-generation data analytics platform to turn our customers into data driven enterprises. We have offices in North America, Europe and Asia. Saggezza is an Equal Employment Opportunity Employer: We believe in treating each employee and applicant for employment fairly and with dignity. We base our employment decisions on merit, experience, and potential, without regard to race, color, national origin, sex, sexual orientation, gender identity, marital status, age, religion, disability, veteran status, or any other characteristic prohibited by federal, state or local law."}