{"jobID": "2707877233", "jobLocation": "San_Francisco_CA", "jobTitle": "Principal Data Scientist", "companyRating": "4.1", "companyInfo": {"Website": "www.lendup.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "177000", "jobDescription": " LendUp builds technology, credit products, and educational experiences for the 56% of the adults in the US, who are currently shut out of mainstream banking because of poor credit or volatile income. Thats a lot of hardworking, deserving people who we believe did not have good options, until now.  Our mission is to provide anyone with a path to better financial health. Being a socially responsible, machine learning-enabled financial services company is a big job, but were driven by the challenge. Now in our sixth year, were growing each and every day as we continue to bring our mission to life. Join our passionate team and help us turn our mission into a movement.  LendUp is headquartered in downtown San Francisco with an office in Richmond, VA. Were backed by prominent Silicon Valley investors including Y-Combinator, Google Ventures, PayPal, Susa Ventures, Data Collective, Kleiner Perkins, Andreessen Horowitz Seed Fund, Kapor Capital, QED, Eagle Cliff Investors, Thomvest Ventures, Alexis Ohanian, Troy Carter, and many others. About the role:  Youll power decisions at the core of LendUps offering of financial services: Marketing, Credit Risk, Customer Value, Operations and more. We want you to apply the best modeling and analytical techniques and help us find a way to help the tens of millions of Americans banks wont lend to. You will: Be responsible for end-to-end model development and implementation to take models from prototype to production.Develop and apply advanced machine learning modelling and statistical techniques.Work across the entire company, from listening to customers to pitching ideas to the CEO.Work on and guide others on every aspect of the modeling problem: data wrangling, feature engineering, target definition, model -specification, -estimation and -comparison, performance evaluation, policy development, implementation and monitoring.Build solutions that are accurate, efficient, scalable and directly implemented from SQL and Python or R to Airflow.Learn from some of the smartest, most experienced, scientists and engineers in the world.You have: Over 4 years of experience in a Data Scientist role.Proficient in Python, R, or similar.Are comfortable building and deploying production models.A technical background, for example a BS, MS, PhD, or similar work experience.A drive to learn fast, be creative, and win as a team.Ability to write production quality code.Experience with distributed computing frameworks like Hadoop or Spark.We have:  LendUp has all of the things youd expect, like a competitive salary; early stage equity; 100% company paid medical, dental and vision insurance; generous vacation/sick leave policy; catered, free lunch; fully stocked kitchens with free healthy snacks; and a 401(k) program. But heres what we really love about life at LendUp: We are driven by having a lasting impact on the world and knowing that our time is spent positively impacting the lives of others. We are strategists and doers, because we know that both matter when it comes to achieving our lofty mission.One of our values is Different Backgrounds, Same Mission. Were committed to a diverse and inclusive culture that spurs innovation and creates a meaningful and impactful work environment. We are passionate participants in our employee resource groups (LeanIn, LGBTQ & Allies, and Black Ladders) and have Slack channels dedicated to everything from philosophy to sports to hip-hop.We have fun together at our weekly happy hours, quarterly team building events, company-sponsored volunteerism, hackathons, and sports teams.Our dog-friendly SF office.LendUp is an Equal Opportunity Employer We extend equal employment opportunities to qualified applicants and employees on an equal basis regardless of an individual's age, race, color, sex, religion, national origin, disability, sexual orientation, gender identity or expression, pregnancy status, marital status, military or veteran status, genetic disposition, or any other reason protected by law."}