{"jobID": "2768324982", "jobLocation": "Alexandria_VA", "jobTitle": "Data Analyst/Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.boozallen.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1914", "Type": " Company - Public (BAH) ", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Accenture, Deloitte, PwC"}, "estimatedSalary": "75000", "jobDescription": "Job Number: R0020196Data Analyst/ScientistKey Role:Use technical and analytic expertise to explore and examine data from multiple disparate sources with the goal of discovering patterns and previously hidden insights that can provide a competitive advantage or address a pressing business problem. Apply expertise in computer science, software development, and the latest technologies to analyze and implement analysis infrastructure and tools, analytic workflow processes, and complex data visualizations. Leverage knowledge of mathematical and statistical concepts, computer science, or domain expertise to bridge the gap between technologists and mathematicians, ensuring software solutions meet analytic requirements. Use open source toolsets to implement statistical methods and develop interactive and dynamic visualizations. Work with a team of data scientists to develop and apply toolsets that solve client analytics problems and propose recommendations to critical business processes or decisions. Document results and methodologies in client briefings.Basic Qualifications:-2+ years of experience with machine learning, data mining, optimization, statistics, and graph-based algorithms-Experience with using VBA, Excel, R, Python, or SAS for data analysis-Ability to leverage presentation expertise, including presenting complex information to non-technical audiences-Secret clearance-BS degree in Operations Research, CS, Computer Engineering, or Systems EngineeringAdditional Qualifications:-Experience with querying databases programmatically using scripting languages-Experience with translating design mockups and prototypes into application designs-Experience with developing rich report visualizations-Knowledge of CSS and JavaScript frameworks-MS degree in Operations Research, CS, Computer Engineering, or Systems EngineeringClearance:Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; Secret clearance is required.Were an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change."}