{"jobID": "2837714735", "jobLocation": "Houston_TX", "jobTitle": "Data Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.roberthalftechnology.com", "Headquarters": "Menlo Park, CA", "Size": "10000+ employees", "Founded": " 1994", "Type": " Company - Public", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "107000", "jobDescription": " We are looking for data scientist that prefer to work in a team environment and focused in data mining and machine learning is key, these are the two area that you specialize in. You will participate as an engineer on a development team, writing, testing, and deploying code to achieve your goals. We want you if you are an independent thinker and capable of analyzing requirements, extracting data for analysis, and developing algorithms and tools. We process data at the petascale and warehouse information at the terascale. The stakes are high, but your impact can be higher.  Ph.D.in Computer Science, Math, Statistics, Physics or a closely related field but an equivalent combination of education and experience will be considered  Proven Machine Learning experience  Professional experience with Deep Learning Neural Network building  Demonstrated experience with Deep Learning Framework such as Tensorflow and Keras  Experience and/or education in at least one of the fields of Big Data, Data Mining, Predictive/Prescriptive Analytics, Optimization, Exploratory Analysis Visualization  Knowledge of relational databases, data modeling, and schema normalization techniques  Familiar with SQL  Passion for solving complex data engineering and modeling tasks  Ability to perform testing based on different hypotheses to determine the impact on key performance indicators  Excellent analytical skills and the ability to work in a collaborative team environment  Experience in programming (high performance computing is a plus) and developing databases  Knowledge and experience with UNIX (Linux), Java, and XML, Perl R, and Spark  Expertise in designing and implementing efficient algorithms **For confidential searches please send resume directly to jelle.dejong@rht.com**"}