{"jobID": "2353333870", "jobLocation": "Chicago_IL", "jobTitle": "Business Data Analyst - Senior Consultant - National", "companyRating": "4.0", "companyInfo": {"Website": "www.clarityinsights.com", "Headquarters": "Chicago, IL", "Size": "201 to 500 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "134000", "jobDescription": "Do YOU have a passion for working with Data? Do you love working in machine learning, real-time analytics, or Big Data? Interested in learning and utilizing different technologies without limitation? We are looking for a Data Expert that will help our clients evaluate and implement big data and advanced analytics solutions in the Cloud and on-premise. At Clarity Insights, we specialize in providing Data & Analytics expertise that result in real and measurable business outcomes. We are passionate about data, problem solving and driving value to make a difference with our clients.Clarity Insights is the largest independent professional services firm focused exclusively on data analytics solutions. Our Data Strategy Practice is expanding and looking to develop in multiple US Regions. Claritys Delivery Practices have one vision: to drive better business outcomes through data and analytics. We provide data analytics advisory consulting services. We believe that nothing sells like great delivery, and are committed to our people and client delivery excellence. With continuing, aggressive growth plans for the next five years, Clarity is seeking outstanding data analytics leaders to successfully qualify, propose, close and lead client solution delivery.As a Business Data Analyst at Clarity Insights youwill work with technical implementation teams to ensure business requirements are fulfilled and work with end users and technical implementation teams to establish and test user acceptance criteria. You will troubleshoot and provide end user support for Data Implementations. You will also have experience in partial to full lifecycle Enterprise Data Warehouse (EDW), Business Intelligence, Information Delivery, and Data Analytics Solution Implementations.ResponsibilitiesResponsible for participating in requirements, gathering process for data integration, data analytics and/or information delivery solutionsHe/she will document business, functional and technical requirementsWill produce source to target data mapping documents and will profile data as input to source to target transformation rules.Will profile data as input to source to target transformation rulesProduce and provide input towards reporting wire-framesSkills5+ years of experience in the industry and familiarity with various products and lines of businessStrong quantitative ability in statistics, mathematics, or financial analysisHands-on experience with ETL tools such as Ab Initio, Informatica and DatastageAbility to develop complex SQL in an Oracle, Netezza, SAS, Teradata and/or other MPP platformsEnd user experience with Informational Delivery tools such as, Cognos, Microstrategy, Tableau, and QlikviewFormal education and experience in hypothesis development and testing, research methods, and statistical modelingExcellent written and oral communication skills, with a proven ability to distill complex business issues into easily understandable terms for a variety of audiencesEntrepreneurial spirit with the ability and willingness to engage in many different and simultaneous tasksDesire to learn and mentor others via hands-on, apprenticeship modelPrior consulting or client service experience (internal or external) also preferredRequirementsBachelors Degree and 5+ years work experienceMBA, CPA, CFA, or CPCU also preferredSuperior analytical and problem-solving skillsTravel to the client on a weekly basis is required. Normal weekly schedule is M-TH travel to client location (U.S. based)Why Clarity Insights, Why Consulting and Why Now?We dont try to be everything to everybody all the time. We specialize in Data & Analytics and will remain a platform and tool agnostic company so you can grow technically throughout your career. It sounds ridiculous but you actually need to be 100% technical and 100% business with strategy because we dont hire non-communicative robots who have a one size fits all approach. We often could speak to a CFO or Head of Underwriting about a business or finance problem, and based on the need for real-time and affordable scalability, we can outline in terms they can understand why they should think about a cloud solution for big data and analytics. If we step across to the DevOps lab, we can easily pick up on a conversation about Apache committers, OSF, full stack development, microservices, containers and much more. Were not trying to boil the ocean. We want to grow from 400 people to 1700 people in 4 years to take the market an accessible set of consulting skills. We have a lot of fun together. Most people join here and stay here for the people. That said, we are popular so we do rack up some travel miles. I have a million things to share about why that may change and why that must stay the same for now, but heres a suggestion if you LOVE Cloud Computing for Big Data and/or Advanced Analytics, Machine Learning, etc we should talk.Clarity Insights is an Equal Employment Opportunity Employer. We believe in treating each employee and applicant for employment fairly and with dignity.GLDR"}