{"jobID": "2819766153", "jobLocation": "Los_Angeles_CA", "jobTitle": "UM - Senior Research Analytics Manager", "companyRating": "3.5", "companyInfo": {"Website": "www.ipgmediabrands.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 2007", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "129000", "jobDescription": "Position Summary We are looking for a dynamic Senior Research Manager to join our team! The Senior Research Manager will support the VP working on several clients, exhibiting leadership to ensure complex projects are executed in timely fashion while meeting high quality standards. Responsibilities will span multiple media research topics, including all things digital, local and national TV and Radio, and emerging media. In addition to quantitative chops, the Senior Research Manager should embrace the opportunity to go beyond the numbers, pursuing the ‘why’ and ‘how.’ The successful candidate embraces change, is effective whether working independently or on a team project, and adeptly manages multiple projects at the same time. Finally, we are looking for someone who is genuinely excited about media and motivated to elevate our team to new heights. Essential FunctionsManage and develop recurring advertising effectiveness research studies for a key agency client, including:Perform quality checks on data, working as needed to facilitate additional data processingDevelop reporting document that answers key research objectives while striving to glean innovative insights beyond the “ask”Working with the VP to write compelling analysis of findingsApply knowledge of digital analytics to help planning teams execute measurement plans for owned mediaDevelop engaging content for strategic client deliverables, such as re-caps, capabilities overviews, and media landscape documentsLeverage syndicated resources to address media and targeting initiatives, discovering and recommending innovative ways of applying data to solve client questionsRespond to ad-hoc media/research questions, that contain recommendations and implicationsOwn additional client deliverables, which may involve supplier relationship management, questionnaire development, data interpretation, report writing, and building media plan recommendationsAfter appropriate training, be conversant with, able to use and able to train others on the major proprietary tools within UM which would be relevant to clients, e.g. TV and multi-media optimizers, budget allocation toolsContribute to the department’s overall capabilities and understanding of media and communications channels as well as identify areas of process improvementProactively grow knowledge of industry tools and best practicesDirectly manage Research Analyst on project-specific work streamsQualifications Education: Bachelor’s degree required Work Experience: Minimum 4 years of related experience – media research/analytics within an agency setting preferredExperience with local media is a plus Skills: Demonstrated understanding of digital media measurement a plusCampaign analytics, validation/verificationPrevious experience with data analysis via multiple regression modeling a plusProficient with Excel, PowerPoint; knowledge or exposure to SPSS or SAS proficiency a plusFamiliarity with industry standard syndicated research tools: Nielsen suite, Comscore, Kantar, etc.Exceptional written and oral communication abilitiesStrong proficiency with industry standard media research tools such as a) Nielsen TV, e.g. NPower b) online systems, such as comScore and c) multimedia databases, such as MRI or SimmonsAbility to clearly and effectively communicate with both external client teams and internal UM planners and buyers.Practical or academic experience with advertising or media research methodologiesPrior management of large data sets and project leadership in this areaAbout Us UM believes that better science and better art deliver better outcomes to our clients in the media moments that matter most. We are a creative media agency, committed to blurring the lines between media and creativity, between data and content, between science and art. A global media network in IPG Mediabrands, UM operates in over 100 countries, with 4,800 people innovating on a roster of clients including Johnson & Johnson, Coca-Cola, Fiat Chrysler Automobiles, The Hershey Company, CVS Health, ExxonMobil, BMW and Sony."}