{"jobID": "2811525114", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.doximity.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "150000", "jobDescription": " Doximity is transforming the healthcare industry. Our mission is to help doctors save time so they can provide better care for patients.  We value diversity in backgrounds and in experiences. Healthcare is a universal concern, and we need people from all backgrounds to help build the future of healthcare. Our data analytics team is deliberate and self-reflective about the kind of data team and culture that we are building, seeking data analysts that are not only strong in their own aptitudes but care deeply about supporting each other's growth. We have one of the richest healthcare datasets in the world, and our team brings a diverse set of technical and cultural backgrounds. How youll make an impact:Collaborate with a team of product managers, analysts, data scientists, and other developers to define and complete data projects.Show off your coding skills by creating data products from scratch and streamlining/automating existing code.Leverage Doximity's extensive data sets to identify and classify behavioral patterns of medical professionals on our platform.Play a key role in creating both product- and client-facing analytics.Grow into a presentation/communication-focused role or dive deeper into more-involved technical challenges - the choice is yours.Learn from experienced mentors and build your technical and non-technical skill sets.What were looking for:B.S. or M.S. in quantitative field with 10+ years of experienceExpert knowledge of statistics and visualizationStrong understanding of SQL optimization techniquesStrong foundation in OOP and FP in PythonFluent in SQL, Python, PySpark, scikit-learn. These skills are an absolute must.Comfortable with UNIX command line interface and standard programming tools (vim/emacs, git, etc.)Excellent problem solving skills and a strong attention to detailAbility to manage time well and prioritize incoming tasks from different stakeholdersFast learner; curiosity about and passion for dataPrior exposure to machine learning techniques (regressors, classifiers, etc) is required.About Doximity Were thrilled to be named the Fastest Growing Company in the Bay Area, and one of Fast Companys Most Innovative Companies. Joining Doximity means being part of an incredibly talented and humble team. We work on amazing products that over 70% of US doctors (and over one million healthcare professionals) use to make their busy lives a little easier. Were driven by the goal of improving inefficiencies in our $2.5 trillion U.S. healthcare system and love creating technology that has a real, meaningful impact on peoples lives. To learn more about our team, culture, and users, check out our careers page, company blog, and engineering blog. Were growing fast, and theres plenty of opportunity for you to make an impactjoin us! Doximity is proud to be an equal opportunity employer, and committed to providing employment opportunities regardless of race, religious creed, color, national origin, ancestry, physical disability, mental disability, medical condition, genetic information, marital status, sex, gender, gender identity, gender expression, pregnancy, childbirth and breastfeeding, age, sexual orientation, military or veteran status, or any other protected classification. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law."}