{"jobID": "2829551695", "jobLocation": "Sacramento_CA", "jobTitle": "Clinical Lab Scientist (CLS/MLT/MT) 13-week Travel", "companyRating": null, "companyInfo": {"Website": "www.soliant.com", "Headquarters": "Tucker, GA", "Size": "201 to 500 employees", "Founded": " 2002", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Clinical Lab Scientist (CLS/MLT/MT) 13-week Travel Job  We have an immediate interim full-time position available for a Clinical Lab Scientist with 2+ years’ experience and a willingness to tackle the night shift. With the day-time availability you have the option to explore the deep-rooted history in the lovely city of Sacramento, CA. Think about experiencing museums that present the history of the city since the time of pre-gold rush and local art galleries as well as many other adventures at your grasp. Work along-side a company who takes pride in our steadiness and efficiency.  If this is an ideal opportunity for you I would love to be the best resource possible in connecting you with your next fun-filled summer assignment. If you meet the following requirements and look forward to this exciting experience, feel free to e-mail me or give me a call with my contact information listed below. Qualifications:2+ years recent experienceBLS CertifiedActive CertificationsEmployment Type & Industry:Hospital Setting13-week contractNight ShiftResponsibilities:Preparing cultures of tissue samplesEstablishing and monitoring programs that ensure data accuracyCross-matching blood for transfusionsAnalyzing lab reports for accuracyOperating and calibrating equipmentDelivering test results to physicians, researchers or patientsCollecting and studying blood samples to determine morphologyBenefits:Competitive Compensation PackageContact Information: Susanna Garner  E-mail: Susanna.Garner@Soliant.com  Direct phone number: (281) 668-0648  www.Soliant.com"}