{"jobID": "2831499753", "jobLocation": "San_Francisco_CA", "jobTitle": "Sr. Events Marketing Manager", "companyRating": "3.6", "companyInfo": {"Website": "www.gooddata.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "86000", "jobDescription": "COMPANY DESCRIPTIONRated 32nd Most Successful SaaS Company in the world by Montclare, GoodData is on a mission to fundamentally change how analytics are used and adopted throughout the organization. With more than 50 percent of the Fortune 500 using GoodData, millions of end users and a massively scalable and secure Enterprise Insights Platform, GoodData works with customers to drive a business outcome focus allowing data to finally drive meaningful change for the business.Today, some of the most well-known brands are using the GoodData Enterprise Insights Platform to disrupt their industries, improve productivity and make business critical decisions, to create revenue generating Smart Business Applications. According to Forrester, insights-driven businesses will steal $1.2 Trillion/year from traditional market players by 2020. This is the transformation GoodData is enabling globally.GoodData is headquartered in San Francisco and backed by top-tier investors like Andreessen Horowitz, General Catalyst Partners, Intel Capital, TOTVS and others. For more information visit our website and follow GoodData on Twitter and LinkedIn.JOB DESCRIPTIONAs the Sr. Field and Events Marketing Manager, you will collaborate cross-functionally with product marketing, sales, and demand generation to ensure seamless coordination and execution of GoodDatas events program including tradeshows, field marketing, analysts and online (Webinars). You will not only be adept at building relationships and navigating a large cross-functional organization but will also be skilled in working with leaders and executives across GoodData.ABOUT YOULead events end-to-end and work closely with field marketing teams to roll out events that have regional footprints.Develop event strategy and vision while ensuring innovative event experienceLead and develop event schedule and agenda with key stakeholders to ensure it aligns with the overarching product roadmaps, event messaging pillars, business priorities and executive visionWork closely with speaker teams to ensure content and messaging is consistent and on-brandManage cross-functional working groups and internal review and sign-offs including the working group for compliance approvals.Work closely with cross-functional leaders to identify, source and create awareness-building content, collaborating as needed with PR, product marketing, online, events, and sales teamsMaintain Marketing team campaign and activity calendarWork closely with Sales to deliver new program playbooks and enable Marketing campaigns to create new opportunities, and always gathering feedbackAlign with the execution of content marketing strategiesWork with multiple stakeholders and agencies to ensure alignment on delivery and timely execution of deliverablesREQUIREMENTSInnovative problem-solver with exceptional written and verbal communications skillsStrong team collaborator, open to idea/project iterationComfortable with project management across multiple teams and work streamsBA/BS degree or equivalent practical experience7+ years of enterprise technology event experience in a high-growth and fast-paced environmentExperience in large-scale enterprise event execution; experience gaining the trust and support from stakeholders.Exceptional project management skills and experience, including managing multiple internal stakeholders, external creative agencies, events vendors, and international projects. Knowledge of enterprise software technology and a desire to learn new technologies.Ability to gracefully partner with leaders and executives as well as orchestration of event program execution across GoodData and cross-functional teams.Innovative and fresh thinking for event experiences to standout in the market; Independent, self-starter who can prioritize and drive deliverables to execution with minimal supervision.Excellent written and presentation skills; Extremely detail oriented and ability to handle ambiguity. We are committed to creating a diverse work environment and proud to be an Equal Opportunity Employer. All your information will be kept confidential according to EEO guidelines.No relocation assistance is offered for this opportunity at this time, and local candidates will be given priority consideration. Agency Recruiters Take Note:Please do not spam us with unsolicited candidate resumes. Unless you have a fully executed agreement with us, we will consider them a gift. Do not send resumes to any of the executives."}