{"jobID": "2686791668", "jobLocation": "San_Jose_CA", "jobTitle": "Principal AI Scientist", "companyRating": null, "companyInfo": {"Website": "www.nio.io", "Headquarters": "San Jose, CA", "Size": "501 to 1000 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Title: Principal AI ScientistSAN JOSE, CA, AI, FULL-TIMEOVERVIEWThe next generation computing platform will be the autonomous driving electric vehicle. With data from in-car sensors, a mobile internet connected car, increased computing power, and new user interfaces that support a seamless autonomous driving experience, they will dramatically improve our lives. After home and work, the car is where we spend the most time, and we will be working on making that experience pleasurable.NIO is much more than a car company. We are developing highly performance-optimized electric cars that will help reduce pollution and mitigate global warming, along with autonomous driving capability that will give time back to the drivers. AI will play a critical role in achieving this by using data combined with machine learning and AI algorithms for problems spanning autonomous driving, intelligent navigation, predictive diagnostics, and vehicle health. We are looking for exceptional ML talent to join our team to work on these core problem areas.Responsibilities· Researching, prototyping, and building solutions for autonomous vehicle  decision making primarily focused on· using reinforcement-learning/online-optimization algorithms for training a vehicle's decision making by leveraging simulations, rewarding good behavior and punishing bad behavior.· predicting the intended trajectory and paths of moving objects surrounding the ego-vehicle via machine learning approaches.· Researching, prototyping, and building solutions for autonomous vehicle simulation development using approaches from reinforcement learning / game theory algorithms for generating agent behaviors for all the vehicles in the simulator· Researching, prototyping, and building solutions for optimizing the performance of the powertrain system by using smart predictive pre-conditioning algorithms· Implementing the algorithms and testing them in a python/C++ environmentRequirements· PhD in Computer Science in Computer Science, Robotics, EE or related degree· 5+ Years of experience in machine learning, deep learning, reinforcement learning, robotics and optimization algorithms· Exposure to vehicle and powertrain modeling and dynamics, motion prediction, and kinematics· Programming skills in Python or C++· Communication and presentation skills to convey information and results clearly and concisely.· High-energy self-starter with a passion for your work, attention to detail, and a positive attitude.About NIO Our mission is to shape a joyful lifestyle for our users by offering smart, premium electric vehicles and providing the best user experience. We are a global company with world-class research and development, design and manufacturing centers in Shanghai, Beijing, San Jose, Munich, London and nine other locations. NIO U.S. is our Global Advanced Technology Center and North American headquarters. Our global company has achieved many great milestones such as:· Securing the inaugural Formula E Drivers Championship title in 2015 · Unveiling the fastest electric car in the world, the EP9, and setting a lap record for an electric vehicle at the Nürburgring Nordschleife in 2016· Unveiling its vision car, EVE, in 2017· Setting a new world speed record for an autonomous vehicle with the EP9 at the Circuit of the Americas in 2017· Launching the ES8, a seven-seat high performance electric SUV, on December 16 with deliveries slated to begin in 2018.Want to be a part of this? Join us!NIO is committed to a policy of equal employment opportunity. We recruit, employ, train, compensate, and promote without regard to race, color, age, sex, ancestry, marital status, religion, national origin, disability, sexual orientation, veteran status, present or past history of mental disability, genetic information or any other classification protected by state or federal law.NIO US is an E-Verify employer."}