{"jobID": "2827119420", "jobLocation": "Austin_TX", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.solutainc.com", "Headquarters": "Austin, TX", "Size": "1 to 50 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About You You’re looking for opportunities that challenge you and help you expand your skillset. You’re driven, resourceful, enjoy problem solving, and are a quick learner. You’re intrigued by the opportunity to work with a fast-growing software company with unlimited opportunities for growth, with a great company culture. Does this sound like you? If so, Soluta could be the place for you! About Us Soluta is a software company serving the health and insurance industries. A sister company of Boon-Chapman, a 55-year-old Third Party Administrator, Soluta combines the legacy and stability of a longtime company, with the energy and drive of a fast-growing startup. A few of our benefits include: Paid holidays & competitive PTO that increases with tenureFull benefits package including healthcare, dental, 401(k), vision, paid STD & lifeCasual everyday dressAccess to an on-staff Medical Director for employees and their family membersUnlimited opportunities for growth – success is in your own handsThe opportunity to work for a Top Workplace, according to Engage and the Austin American-StatesmanJob Responsibilities As an Implementation Business Analyst, you’ll be responsible for demonstrating willingness to take on responsibilities beyond the confines of their role, openly share their ideas and contribute from day one. Key responsibilities include:Meeting with clients to determine the business needs of the clientCreating detailed documentation outlining client business requirements to supply to the development teamServe as the subject matter expert for specific client processes and the voice of the client during development of new/existing processesDetermining if client needs are compatible with existing structure and determining a general template of how the dev team will meet the client needsCustomer configurations of products for clients/customersImplementing new features and/or new clientsUnderstand systems, processes & data flowsCommunicate effectively with technical staff, internal & external entitiesDesire to be involved in data analysis/compare, data conversion and mapping business processes  Reviewing data for verification and integrationWhat We're Looking For (Nobody's Perfect but Experience is a Plus!)Bachelor’s degree in a technical discipline or equivalent.Strong business judgment and common senseKnowledge of SQL or desire to learnKnowledge of documentation creationExperience in financial services, insurance or similar industry preferred but not requiredThrive in a fast-paced, entrepreneurial environment that requires you to independently develop solutionsExpert knowledge & experience with Excel; familiarity with database experience preferredStrong logical approach to problem solvingInitiative, creativity and a passion to deliver results that make a differenceExcellent communication (verbal, written, and presentation) and interpersonal skills (outgoing and personable)Ability to multi-task, prioritize and manage time effectivelyEffective when working independently and in team environmentsDesire to work in the technology industry with a fast-growing company"}