{"jobID": "2698646058", "jobLocation": "Santa_Clara_CA", "jobTitle": "Deep Learning Genomics Scientist", "companyRating": null, "companyInfo": {"Website": "www.nvidia.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1993", "Type": " Company - Public (NVDA) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "We are now looking for Deep Learning Genomics Scientist: NVIDIA is using the power of GPU computing and AI to accelerate the adoption of DNA and RNA sequencing technologies. We are seeking passionate and talented individuals to help us realize our mission, which has the potential to accelerate precision medicine and precision agriculture.  As a Deep Learning Genomics Scientist, you will join a research and development team passionate about infrastructure development and collaborations with industry and academic partners. You will be responsible for the development of methods and pipelines for next-generation sequencing data, building machine learning and deep learning models on some of the largest biological datasets, and development of new ways to pull out signal out of a wide range of sequencing technologies. What you'll be doing:Work with large, complex datasetsConduct end-to-end analysis including design, data gathering, processing, analysis, iteration with collaborators, and dissemination of resultsBuild and prototype data processing pipelinesWork on the bridging the gap between the latest in deep learning research and its application to sequencing dataCollaborate with multiple AI infrastructure teams to understand their workflow requirements and tradeoffs between flexibility/model explorationInteract cross functionality with a variety of teams including external organizations, internal research, software, and product development groupsWhat we need to see:Ph.D. in a quantitative field such as Statistics, Physics, Computational Biology, Computer Science, Mathematics, or related discipline.2+ years meaningful work or research experience in data analysis or similar field (e.g., as a statistician / data scientist / computational biologist/etc).Command of statistics as applied to design and analysis of NGS experimentsProven experience generating insight from genomics datasets as well asDemonstrated experience developing algorithms and pipelines for NGS data analysis and quality controlStrong experience with statistical programming languages such as R, python, or Matlab.Demonstrated experience in using deep learning frameworks (e.g. Torch, Theano, TensorFlow, etc.) in your workRecognized for technical leadership contributions, capable of self-direction, and a willingness to learn from and teach othersExceptional communicator with ability to represent NVIDIA to external collaborators and interact effectively with internal teams With highly competitive salaries and a comprehensive benefits package, Nvidia is widely considered to be one of the technology industry's most desirable employers. We have some of the most brilliant and talented people in the world working with us and our engineering teams are growing fast in some of the hottest state of the art fields: Deep Learning, Artificial Intelligence, and Autonomous Vehicles. Are you a creative and autonomous engineer with a real passion for machine learning, distributed systems, data science & parallel computing? If so, we want to hear from you.  ​​NVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression , sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.#deeplearning"}