{"jobID": "2730469259", "jobLocation": "Parsippany_NJ", "jobTitle": "Principal Scientist, Analytical Development", "companyRating": null, "companyInfo": {"Website": "www.ferring.com", "Headquarters": "Saint-Prex, Switzerland", "Size": "201 to 500 employees", "Founded": " 1980", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Title:Principal Scientist, Analytical DevelopmentJob Description:Ferring Pharmaceuticals is a globally recognized, research-driven, biopharmaceutical company with more than 65 years of history. Headquartered in Switzerland, Ferring is privately owned with over 5,700 employees in nearly 60 countries. In the United States, Ferring identifies, develops and markets innovative products in the fields of reproductive health (infertility), urology, gastroenterology, endocrinology, women’s health (obstetrics/gynecology) and orthopaedics. Ferring’s US operations employ approximately 800 people.  People Come First At Ferring. The Ferring Philosophy places people at the heart of what we do. This guides our relations with patients, physicians, employees, and other stakeholders. We invite you to share our passion for people and the power of science. Summary: Independently lead, plan, execute and present analytical development. The role has a special focus on analytical support to phase III / pivotal studies and NDA/BLA preparation, authoring and filing. Responsibilities:Lead, plan, execute and present analytical development in support of phase III/pivotal studies.Analytical lead: Planning, reporting, budgeting and forecasting on managed projectsOutsource, lead and coordinate analytical development activities at CROs/CMOs including selection, writing contracts (SOWs), oversight and technical support.Writing/reviewing, raw data, protocols, reports, SOP’s, specifications, risk assessments and regulatory documentsSupport and mentor scientists supporting the projectsProvide analytical development expertise to influence decisions on scientific/technical issues related to assigned internal and/or outsourced projects.Work according to safety and quality regulations/guidelines (SOPs)Participate in technology transfer to Product SupplyActing on behalf of Director within defined scientific tasks/activitiesRequirements:Minimum M.Sc. in natural science but preferably with a Ph.D.Minimum 7-8 years’ experience in pharmaceutical industryProven skills in analytical method development and validation of small molecules (Proven scientific skill and ability to do independent scientific work with no guidanceStrong experience in NDA and/or BLA CMC authoring, filing and approvalExperience with LIMS, ELN, CDS systems is highly desirableStrong ability to assess feasibility and development work from a conceptual idea to final approved productEffective in managing multiple competing activities and delivering to timelinesAbility to perform complex scientific work independently with no supervisionAbility to work in a cross function environmentHigh level of awareness to innovative technologies and ability to adapt to in-house needsAbility to manage and forecast project and departmental budgetsExcellent communication skills, both verbal and writtenAbility to engage people and influence without authorityOrganized and efficient workerAbility to motivate people in a multicultural matrix organizationLateral thinking and creative  We are proud to be an Affirmative Action/EEO Employer. EOE Minorities/Females/Protected Veterans/Disabled  We maintain a drug-free workplace and perform pre-employment substance abuse testing.  If you need assistance during the application process due to a disability, please email careers@ferring.comLocation:Parsippany"}