{"jobID": "2834889681", "jobLocation": "Detroit_MI", "jobTitle": "Sr Data Analyst - Market Insight & Analytics", "companyRating": "3.8", "companyInfo": {"Website": "www.mibcn.com", "Headquarters": "Southfield, MI", "Size": "1001 to 5000 employees", "Founded": " 1983", "Type": " Subsidiary or Business Segment", "Industry": " Insurance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "72000", "jobDescription": "The Sr. Analyst role within Marketing Insights and Analytics is primarily responsible for leveraging data across the company to support marketing campaigns, market research surveys, and analytics to inform customer insights. The role will leverage multiple data sources and analytic techniques to uncover data-driven solutions and insights to inform and support business decisions.Key Job Responsibilities:Performs analyses and/or makes recommendations concerning marketing, engagement and customer experience strategy and tactics.Leverages and integrates disparate data sources including member data, 3rd party marketing data, survey and voice of customer data to support marketing campaigns.Support marketing and engagement campaign related activities from inception to implementation including defining targeting efforts and calculating ROI.Utilizes a broad array of analytic tools and techniques to uncover actionable data insights.Collaborates with other data experts across the enterprise.Supports and delivers on data requests, ad hoc analyses, and ongoing reportingLeadership responsibility to coordinate the development and implementation of programs and strategies to improve service to our customers. Develop and improve work flows and business processes within area(s) to improve customer service, decrease operational costs and improve overall quality. Identify and/or analyze business problems and devise procedures for solutions to the problems. Effectively lead projects/teams in order to produce desired results. Responsible for corporate communication of project results. Recommend and assist with implementing standard policies and procedures for providing routine service. Assure that corporate compliance is communicated, implemented and monitored on an ongoing basis. Participate in systems testing, develop procedures/controls and provide recommendations for the ongoing improvement of the updated process. Assist personnel (both internal and external) by answering questions, supplying information and training. Develop and maintain an effective working relationship with customers. Other duties may be assigned.Bachelor's Degree in related field preferred.Four (4) to seven (7) years experience in related field.Supervisory and/or Analyst experience required with proven experience in operational analysis, data analysis, and problem resolution type activities.Ability to plan, organize, direct and control projects.Excellent written and verbal communication skills.Ability to lead and contribute to process improvement projects.Working knowledge of PC applications and/or mainframe required.Other related skills and/or abilities may be required to perform this job.DEPARTMENT PREFERENCES4 years work experience in analytics roleBS in Mathematics, Economics, Computer Science, Information Management or Statistics. MS preferred.Strong understanding of all facets of the analytics process (strategy, tracking, reporting, analysis, actionable recommendations).Technical expertise in predictive modeling, customer segmentation, and data mining techniques.Expert proficiency in Microsoft Office Suite and data analysis and querying tools (e.g., SQL, R, SAS).Strong written and oral communication skills and ability to interface with various business partnersStrong analytical skills with the ability to collect, organize, and analyze significant amounts of information with attention to detail and accuracy.Strong problem solving abilities and intellectual curiosity to proactively uncover insights and trends within data.Ability to intake business ask and identify and transform data to address business needHealth insurance industry experience preferable.All qualified applicants will receive consideration for employment without regard to, among other grounds, race, color, religion, sex, national origin, sexual orientation, age, gender identity, protected veteran status or status as an individual with a disability."}