{"jobID": "2798276033", "jobLocation": "Bethesda_MD", "jobTitle": "Senior Healthcare Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.aledade.com", "Headquarters": "Bethesda, MD", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Who are we? The Aledade Provider Outreach team’s responsibility is to expand Aledade's national network of independent, physician-led Accountable Care Organizations (ACO's) through compelling marketing programs, strategic partnerships and relationship-based recruiting. As Aledade continues to expand rapidly, we are looking for a Senior Healthcare Data Analyst who will support the development and execution of Aledade’s growth plan across the country.  The Senior Healthcare Data Analyst is a new role - this is a rare opportunity to help mold and shape a Growth program from the ground up. You will work cross-functionally to champion data-driven decision-making. You will continually refine Aledade’s approach to targeting markets and practices, aligning them with the right value-based contracts, and analyzing their support needs. Reporting to the VP, Provider Outreach, your work will help to improve the lives of providers and patients across the country! Who are you? You are mission-oriented, scrappy and obsessed with data. Ideally, you have a strong background in healthcare analytics and experience working with Centers for Medicare and Medicaid Services (CMS) datasets. You are comfortable working across Marketing, Technology and Product functions. You are at home in fast-paced organizations and collaborative teams. You are an analytics guru and technophile who keeps up with the latest technologies. You know tools like Tableau inside and out. What will you do?Design and execute an analytics program that supports Aledade’s growth strategy and Provider Outreach operationsIdentify market and provider organization attributes most highly correlated with success and leverage a variety of data sources to prioritize geographies, market segments, provider organizations and partners accordinglyLocate and analyze data from a wide variety of sources including Medicare research claims, geographic and provider-level public use data, and Aledade’s Salesforce CRM databaseDevelop a mix of ad hoc stand-alone analyses and interactive dashboards, reports, and data visualizations that communicate insights from the data, inform Provider Outreach strategy, and support Provider Outreach operationsCollaborate with key stakeholders across the business to understand needs and questions.Provide training and support to end users of analyses, dashboards and reportsWhat qualifications do we prefer?B.S. in quantitative degree (CS, Engineering, Physics, Math, Statistics, Economics or related field)Healthcare analytics experience preferredExpertise with healthcare data sources including Medicare claims and geographic and provider-level public use dataKnowledge of standard methods for measuring health care utilization, spending, quality, and outcomesUnderstanding of risk adjustmentExperience with market and provider profiling in the context of risk management and growth planningStrong understanding of value-based payment models, especially Medicare ACOsIntense attention to detail and superb data quality assuranceExceptional data management and manipulation skills, including a strong foundation in SQL programmingExpertise with data visualization, reporting tools and business intelligence software (e.g. Tableau)SAS programming experienceAbility to analyze data to produce accurate and unbiased results and tell the story of those results in data visualizations, dashboards, and reportsAbility to thrive in a fast-paced environment and manage competing deadlines and priorities"}