{"jobID": "2591481459", "jobLocation": "Warren_NJ", "jobTitle": "Senior Bioanalytical Bench Scientist, CAR-T – Validation", "companyRating": null, "companyInfo": {"Website": "www.celgene.com", "Headquarters": "Summit, NJ", "Size": "5001 to 10000 employees", "Founded": " 1986", "Type": " Company - Public (CELG) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Senior Bioanalytical Bench Scientist, CAR-T – Validation Req #: 17001621Location: Warren,  NJ USJob Category: Clinical DevelopmentWork Location: 7 Powder Horn Drive WARREN 07059Organization: Celgene CorporationSchedule: 40Shift: Day JobEmployee Status: Full timeJob Type: RegularJob Level: Individual ContributorTravel: NoOther Locations:US- NJ- Warren DescriptionCelgene is a global biopharmaceutical company leading the way in medical innovation to help patients live longer, better lives. Our purpose as a company is to discover and develop therapies that will change the course of human health. We value our passion for patients, ​quest for innovation, spirit of independence and love of challenge. With a presence in more than 70 countries, and growing - we look for talented people to grow our business, advance our science and contribute to our unique culture.  Senior Bioanalytical Bench Scientist, CAR-T – Validation Warren, NJSummary: Independently design, perform, and interpret complex experiments to support analytical method characterization and validation. Leads and advances analytical projects from Analytical R&D; to Quality Operations. Responsibilities may include, but are not limited to, the following:Lead analytical method validation(s), which may include the following types of methods: flow cytometry, ELISA, cell counting, qPCR, microbiological/safety, etc.Execute/implement analytical experiments of substantial multi-variant complexity.Author and/or review analytical method validation protocols, reports, and/or regulatory documents.Assist in the transfer of analytical methods to transfer group and/or Quality Control.Perform tracking/trending of data to contribute to the life cycle management of an analytical method.Train end-users and entry level personnel on analytical methods.Present research findings to other groups. Build relationships with cross-functional teams. Provide broader scientific guidance to other departments.Anticipate process problems. Raise issues; recommend solutions to department management.Act as a key resource/contributor in specific area of expertise within the department. Lead achievement of project milestones with significant departmental impact.Maintain a basic knowledge of cell therapy development and awareness of competitive landscape.Ensure proper operation and perform routine maintenance of all laboratory equipment.Maintain a safe workplace in accordance with company and OSHA policies/procedures.Skills/Knowledge Required: B.S. in Biology or related discipline with 5-8 years of recent, relevant experience or M.S. with 3-6 years of recent, relevant experience.Proficiency in analytical skills: statistical analysis and effective presentation of analysis to other groups.Ability to write scientific technical protocols and reports that require minimal revision on content.Ability to work with minimal technical supervision and perform operational tasks independently.Able to assess risk and develop contingency plans for process risks.Highly motivated and have a drive to acquire new skills.Expertise in mammalian cell culture and diverse analytical techniques preferred.Experience working in a GMP regulated environment.Excellent verbal and written communication skills Please visit www.celgene.com to learn more about current opportunities at Celgene. To apply for this position, please visit the career section.  #LI-POSTCelgene is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Celgene complies with all applicable national, state and local laws governing nondiscrimination in employment as well as employment eligibility verification requirements of the Immigration and Nationality Act. All applicants must have authorization to work for Celgene in the U.S."}