{"jobID": "2768017542", "jobLocation": "Los_Angeles_CA", "jobTitle": "Business Analyst/Data Governance", "companyRating": null, "companyInfo": {"Website": "www.manufacturers-ca.com", "Headquarters": "Los Angeles, CA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Business Analyst reports directly to the Information Technology Manager. Responsibilities include performing detailed requirements analysis, documenting processes, maintains all data related to Policies and Procedures, maintains all data relating to Business Process Flows, and performing some user acceptance testing. The Business Analyst bridges the gap between business units and information technology enabling the deployment of new technology or make better use of existing technologies. To succeed in this role the Business Analyst should have a natural analytical way of thinking and be able to explain difficult concepts to non-technical users.  The Business Analyst is the primary liaison between IT and corporate team responsible for the Enterprise Data Governance Program. Responsibilities include participating in all data related committee meetings, leading ongoing reviews of business processes and developing optimization strategies, conducting meetings and presentations to share ideas and findings, performing requirements analysis, documenting and communicating the results of your efforts, effectively communicating your insights and plans to cross-functional team members and management, and gathering critical information from meetings with various stakeholders and producing useful reports. A bachelor’s degree in business or related field or an MBA. A minimum of 5 years experience in business analysis or a related field. Exceptional analytical and conceptual thinking skills. The ability to influence stakeholders and work closely with them to determine acceptable solutions. Advanced technical skills. Excellent documentation skills. Experience creating detailed reports and giving presentations. Competency in Microsoft applications including Word, Excel, and Outlook. Excellent planning, organizational, and time management skills."}