{"jobID": "2827568535", "jobLocation": "Washington_DC", "jobTitle": "Executive Assistant Secret Clearance Req'd", "companyRating": "3.0", "companyInfo": {"Website": "www.gcctechllc.com", "Headquarters": "Oakland, MD", "Size": "201 to 500 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " E9 Corporation, Government Contract Solutions, The Tolliver Group"}, "estimatedSalary": "61000", "jobDescription": " GCC Technologies, founded in 1997 with headquarters in Oakland, Maryland, is a fast growing service-disabled Veteran owned Small Business and HUBZone company with an outstanding record of performance providing more effective and efficient acquisition, business process, administrative and security services to multiple federal agencies. GCC was recently ISO certified under ISO 9001:2008.GCC is currently in need of a mid-level Executive Assistant to support the Department of State's Information Resource Management (IRM) Bureau, Directorate of Information Assurance (IA). This is a current, open position. Department of State experience is highly desired. An active Secret Clearance is required - applicants without an active clearance will not be reviewed or considered. Description/Duties:- Coordinate administrative and logistical details related to the day to day operations and the management and accuracy of the directors’ calendars and appointments- Maintain consistent lines of communication between the Deputy CIO/CISO, Managing Director and Office Directors.- Review, edit, write and re-write executive documentation, letters, memorandums, interoffice communications, confidential reports and other corporate correspondence for the IRM/IA’s approval.- Create and update Microsoft Office presentations necessary for ongoing projects and essential briefings.- Prepare office contributions by coordinating with Deputy CIO/CISO, Managing Director, and Office Directors.- Coordinate all documentation for the Directorate and Offices weekly activities report- Create, review and edit imperative information for the IRM/IA approval- Distribute finalized documentation to appropriate personnel within Bureau per Office Directors’ direction- Perform all travel coordination and reservation for government employees using the EZ and E2 Travel Systems at expert level- Assist in tracking Office travel costs and other Office expenses- Maintain updated in-processing and out-processing procedures and forms for (FTE’s and contractors)- Recommend and assist in the design all directorate and office level template for documentation.- Perform various office management duties, which vary from complex and/or confidential to include personnel files, agendas, travel advance, expenses, report processing incoming/outgoing personnel, conference room schedules, calendar management, office supply management, special event coordination, escorting, and visitor building access.- Provide front office support for IRM/IA which includes specialized document creation- Take minutes (if requested) from weekly management meeting and distribute them in a timely manner- Assist uploading relevant information to the appropriate SharePoint locations, and monitor/support accuracy of managing the version control of information and templates on Office SharePoint site as needed- Support planning meetings and prepare meeting materials prior to scheduled events, including meeting agendas, name tents, roster updates, handouts, etc., support the execution of actual meetings- Support the government performance reporting processing as needed- Assistant with on/off boarding both federal and contractor personnel support IA- Prepare and/or maintain a desktop reference of duties and responsibilities- Directorate Office Manager, (if required)- Back-up Timekeeping (if required)- Back-up Receptionist desk (if required)- Other duties assignedRequirements/Qualifications:- High School Diploma- 5 years of experience in the duties listed above- An Active Secret Clearance (or higher) is required- First consideration will be given to those qualified applicants with previous Department of State Office Management Specialist experience. Company DescriptionGCC Technologies, LLC, is an equal opportunity employer regardless of race, color, religion, creed, sex, marital status, national origin, disability, age, veteran status, on-the-job injury, sexual orientation, political affiliation, or belief. Employment decisions are made without consideration of these or any other factors that employers are prohibited by law from considering. Any discriminatory action can be a cause for disciplinary action. GCC also prohibits discrimination against individuals with disabilities and will reasonable accommodate applicants with a disability, upon request, and will also ensure reasonable accommodation for employees with a disability. VETS encouraged to apply."}