{"jobID": "2822762705", "jobLocation": "Southfield_MI", "jobTitle": "Regional Vice President, Operations & Sales (Regular-Full Time)", "companyRating": null, "companyInfo": {"Website": "www.suncommunities.com", "Headquarters": "Southfield, MI", "Size": "1001 to 5000 employees", "Founded": " 1975", "Type": " Company - Public (SUI) ", "Industry": " Real Estate", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Equity LifeStyle Properties, RHP Properties , UMH Properties"}, "estimatedSalary": null, "jobDescription": " Are you an experienced property management leader looking to take your talents to a new level? Are you looking for a dynamic and growing organization that will both challenge and reward you? We are looking for a Regional Vice President, Operations & Sales with the right balance of leadership and management skills, along with a real knack for customer service. You will oversee the day-to-day property management operations for a group of manufactured home communities, ensuring new revenue is being generated at each community. If you have the qualifications and background we’re looking for, we want to talk to you! OVERVIEW As a Regional Vice President, you will have responsibility for overseeing the operational aspects and the continued profitability of multiple manufactured home communities. You’ll be in charge of overseeing everything from budgeting, capital improvements, human resource management, marketing, and retailer relations, to community enhancement and curb appeal, leasing and home sales of new and pre-owned homes and, most importantly, resident relations. This position will office out of the southeastï¿½Florida area.JOB DUTIESDetermine and approve staffing levels of each community.Coordinate education and training of team members to enhance skill development.Develop and implement marketing programs and advertising plans, including strategies and activities to achieve targeted results.Coordinate the purchase of new and pre-owned home inventory; develop pre-owned home listing and brokerage plan.Develop and implement effective retailer relations programs.Conduct on-site inspections and ensure each community is consistently maintained and groomed to Sun’s curb appeal standards.Ensure customers and residents receive the highest level of service consistent with Sun’s Customer Service philosophy.Handle and resolve resident complaints and issues in a timely and professional manner.Oversee implementation of annual capital improvement program.Create, monitor and manage annual operating and sales budgets for each community.Prepare monthly P&L; variance explanations, including a corrective action plan where needed.Develop annual occupancy, lease-up and sales projections; implement programs to achieve them.Ensure internal control practices are adhered to and monitor for compliance.ï¿½Meet and maintain communication with residents, homeowner associations or boards.Other duties as assigned.REQUIREMENTSBachelor’s degree in Real Estate, Hospitality, Business or related fieldMinimum of 5 years property management experience, including 2 years supervisory experienceAbility to fluently read, write and speak English and Spanish,ï¿½a plusDemonstrated leadership abilitiesExcellent interpersonal and communication skillsThorough knowledge of federal, state, and local laws pertaining to fair housing and employment lawStrong organizational skillsWorking knowledge of basic accounting principlesAbility to travel frequently with overnight staysBasic computer proficiency, including the ability to use email, internet and Microsoft Office Suite; experience using Yardi, preferredFlexibility to respond to community needs during non-business hours Apply"}