{"jobID": "2815575087", "jobLocation": "Fort_Lee_NJ", "jobTitle": "Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.tranzact.net", "Headquarters": "Fort Lee, NJ", "Size": "1001 to 5000 employees", "Founded": " 1989", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": " How the Position WorksThe Data Scientist reports to the VP of Data Science and Analytics and is responsible for gathering data, conducting analysis, building predictive algorithms and communicating findings to drive profitable growth and performance across Tranzact. The Data Scientist must have a strong grasp on the data structure, business needs, and statistical and predictive modeling. They must be comfortable gathering, manipulating, and utilizing large sets of data to solve business problems. Prior work experience in creating predictive models to be utilized in automating operations is a plus.The specific responsibilities of the Job Title include; Gathering data from various parts of the organization and third parties / online resourcesProcessing, cleaning, and verifying data integrity for analysisSelecting features, building and optimizing prediction models (classifications and regressions)Completing ad-hoc analysis and presenting results clearlyConceptualizing how prediction models can be utilized in an automated system What you need to be successful Bachelor’s Degree in a quantitative field (Computer Science, Engineering, Mathematics, Statistics, etc.)Minimum 3 years of experience building predictive algorithms in industryExcellent understanding of machine learning techniques and algorithms such as decision forests, logistic regression, k-means clustering, etc.Ability to communicate findings clearlyFluency with R or Python for statistical modeling and machine learningProficiency with a query language such as SQLExperience with data visualization tools (Tableau, Power BI, etc.)Expert in Microsoft ExcelCuriosity and ability to be objectiveStrong organizational skills including time and project managementThrives in a fast-paced environment that is constantly changing What we would LOVE to see! Masters or PhD in a quantitative field (Computer Science, Engineering, Mathematics, Statistics, etc.)Finance, Insurance, Call center, Marketing or Sales industry experienceExperience developing predictive models for business and implementing them in an automated fashionExperience working with unbalanced datasetsGood programming skills (C#, JavaScript, etc.)Experience managing or mentoring other data scientist is a plus "}