{"jobID": "2835991733", "jobLocation": "Morris_Plains_NJ", "jobTitle": "Sr. Scientist, Microbiology", "companyRating": null, "companyInfo": {"Website": "www.novartis.com", "Headquarters": "Basel, Switzerland", "Size": "10000+ employees", "Founded": " 1996", "Type": " Company - Public (NVS) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Posting Title Sr. Scientist, Microbiology  03-Jul-2018 Job ID245057BRJob Description*Second Shift** (4) - (10 hour days) work Sunday - Wednesday or Wednesday - Saturday • Perform micro/EM testing such as environmental monitoring, gram stain, sterility, en-dotoxin, and mycoplasma. • Perform all testing and activities compliantly following appropriate SOPs and proceedures. • Maintain input to keep LIMS current • Review/approve data generated by other team members. • Review QC documents to ensure completeness, accuracy, consistency and clarity. • Generate and analyze trend reports to determine appropriate course of action. • Interpret data and recommend next steps. • Perform quality impacting assessments and make decisions. • Initiate and lead special projects and facilitate any issues that arise. • Initiate change controls. • Train others and manage the maintenance of the microbial qualification program. • Author validation documentation. • Independently leads investigations of the highest complexity •Drive complex investigations to understand root cause. •Participate in OOS/OOE investigation •Participate in deviation investigation/CAPA implementation in a timely manner • Responsible for evaluating compendial updates against internal methods • Serve as Quality Control representative on cross-functional teams.Minimum requirements BA or MS or advanced degree in biology, chemistry, biochemistry, microbiology or other related science Fluent in English Greater than 5 years of relevant experience in the pharmaceutical, biologics, microbiology, sterile manufacture, or medical device industry.  Knowledge of cGMP and an understanding of the concepts of GLP, good clinical practices and FDA guidelines, applicable state and foreign regulations, and standards routinely used in the industry (i.e. ANSI, ISO, etc.).  Thorough knowledge of microbiological and environmental monitoring, test methods.  Micro/Environmental knowledge to facilitate investigations.  Knowledge of LIMS systems.  Ability to communicate clearly with a variety of individuals in various aspects of Novartis operations.  Detail-oriented with expertise in problem solving and solid decision making abilities.  Strong interpersonal skills which include a professional demeanor when interacting with Novartis personnel.  Sound, practical and appropriate regulations with regards to Novartis  Strong written and verbal communication skills are essential. Job Type Full Time CountryUSAWork Location Morris Plains Functional Area Quality Division Novartis Technical Operations Business UnitNTO BTDMEmployment Type Regular Company/Legal Entity Novartis Pharmaceuticals EEO Statement The Novartis Group of Companies are Equal Opportunity Employers and take pride in maintaining a diverse environment. We do not discriminate in recruitment, hiring, training, promotion or any other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, marital or veteran status, disability, or any other legally protected status. "}