{"jobID": "2788615791", "jobLocation": "Chicago_IL", "jobTitle": "Senior Data Scientist III - SAP HANA", "companyRating": "3.8", "companyInfo": {"Website": "www.abbvie.com", "Headquarters": "North Chicago, IL", "Size": "10000+ employees", "Founded": " 2013", "Type": " Company - Public (ABBV) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amgen, Baxter, Bristol-Myers Squibb"}, "estimatedSalary": "153000", "jobDescription": "Conceive, design and implement new technologies and/or applications that solve significant scientific or business problems through the integration, visualization, and analysis of large and complex data. Generate new proposals and lead those efforts. Investigate, identify, develop, and optimize new methods, algorithms, and technologies to derive novel, competitive insights from disparate data sources or drive productivity and efficiency gains throughout multiple business areas. Act as a lead data scientist in his/her area of expertise and critically evaluate relevant scientific and technological advances and integrate this knowledge into new business technology solutions. Key Responsibilities Include :Effectively function as a principle investigator, generating new scientific or technological proposals and leading those efforts. Anticipate and critically evaluate scientific or technological advances or competitive threats and respond with appropriate new strategies.Demonstrate creative 'out of the box' thinking to solve difficult problems and champion new technologies to achieve project goals.Independently responsible for data science and technology within his/her area of expertise on multiple projects. Demonstrate mastery across a wide range of data science technologies, including data warehousing, data integration, data visualization and analysis, software development, statistics, and machine learning. Demonstrate deep knowledge of the pharmaceutical and healthcare business, and utilize this knowledge in the rapid advancement of agile, impactful, and cost-effective solutions.Recognized and sought out as an expert in his/her discipline within the company and possibly externally. A primary author of publications and presentations.May mentor/supervise a team of one or more and guide and evaluate the performance of those individuals; is accountable for the effective performance of the team/individuals.Understand and adhere to corporate standards regarding applicable Corporate and Divisional Policies, including code of conduct, safety, GxP compliance, and data security.Additional Desired Experience:Strong expertise in building performance efficient complex data models on SAP and non-SAP Data. Leverage SAP SDI / Data Services and HANA views with graphical and SQL scripting to build mart structure. Expertise in SAP HANA Platform tools plus Javascript and SAPUI5.  Experience with SAP HANA migration, Security using analytic privileges & Optimization HANA Sizing and performance tuning.Experience with data visualization leveraging SAP BOBJ suite, specifically WEBI and Lumira discovery and designer toolsExperience with SAP HANA Predictive Libraries tool set and application of statistical models to various business scenariosBasic:Bachelor’s Degree or equivalent education and typically 14+ years of experience, Master’s Degree or equivalent education and typically 12+ years of experience, PhD and typically 6+ years of experience. Background in life sciences or work experience in the pharmaceutical industry preferred.Demonstrated ability to function as a principle investigator, generating original technical ideas and research or development strategies.Demonstrated creative 'out of the box' thinking to solve difficult technical problems and champion new technologies to achieve project goals.Recognized and sought out as an expert in his/her discipline within the company and possibly externally.Excellent written and oral English communication skills, as demonstrated by presenting at leading scientific or technical conferences.Equal Opportunity Employer Minorities/Women/Veterans/Disabled"}