{"jobID": "2704896659", "jobLocation": "San_Jose_CA", "jobTitle": "Principal Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.bidgely.com", "Headquarters": "Sunnyvale, CA", "Size": "1 to 50 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "197000", "jobDescription": " Why BidgelyWhat can Artificial Intelligence do to reinvent the energy industry? This is your opportunity to join a world-class team and help us figure that out.  A growth-phase start-up headquartered in the heart of Silicon Valley, Bidgely is transforming the way utility customers use energy. By combining the power of machine learning and behavioral insights, Bidgely provides a suite of enterprise solutions that help customers save energy and enable utilities to build enduring customer relationships worldwide.  It’s an exciting time in the company’s evolution. We just closed our Series C fund, have acquired some of the biggest names in the industry as customers, and we’re breaking ground on new products and markets. In addition to our headquarters in Mountain View, we have a global presence in Europe, India, and Asia Pacific.  To learn more, visit us at bidgely.com or read about our recent $27M Series C round of fundraising. Play Video PositionData Science is the blood that runs in our veins at Bidgely. It is 100% central to our technology, our products and our business.  We work on building cutting edge solutions using the energy and user behavior data from millions of homes. The company offers the highest possible leverage for a Data Scientist to use their passion and make a difference in the company and in making the world more energy efficient.  As a Principal Data Scientist you will own big business problems and deliver innovative and practical solutions. You will be a part of a nimble team solving real world problems through innovative use of AI techniques that go well beyond the traditional model building process. As a senior team member you will be responsible for driving data science projects to completion. This would involve moderating brainstorming sessions, providing mentorship and most importantly driving ways to make swift progress. You will need to bring creativity to generate new ideas as well as the rigor to turn them into solid technical implementations that run in production to serve millions of users.ResponsibilitiesOwn significant business problems and create innovative solutions.Develop and fine tune robust energy analytics algorithms.Study the impact of our products on a number of dimensions such as energy savings and user behaviour to keep refining our solutions.Collaborate with product, marketing and engineering teams to leverage data science to solve cross-disciplinary problemsCreate a experimentation plan for your problem and run rapid iterations with frequent peer review.Be adept at software design to ensure a well designed and efficient data pipeline.Ongoing monitoring and optimization of operational costs of running algorithms.Actively contribute to multiple projects and provide technical leadership to junior members of the team.Help define the strategic Data Science Roadmap of the company.Cement Bidgley’s position as a thought leader in the industry through white papers, speaking engagements and creating Intellectual PropertyRequirementsMS/PhD in Computer Science, Statistics, Applied Math, or related areas. Exceptionally strong candidates with a BS and relevant work experience welcome.Strong background in machine learning and statistical analysis. Expertise in pattern recognition and predictive modeling (time series analysis, logistic regression, tree based methods, etc.). Use of Deep Learning techniques is a big plus.Fluency in Python/Matlab/R. Experience using (SQL/HIVE/Pig) is a plus.Skilled in data visualization techniques using BI tools such as Tableau/Looker and packages such as matplotlib/seaborn.5+ years hands-on experience with machine learning solutions deployed in production.2+ years leading data science projects and technically leading a team of scientists. EmailTo apply for this position, please email your resume"}