{"jobID": "2831959502", "jobLocation": "San_Francisco_CA", "jobTitle": "Business Analyst (Data Application Governance) (Need lcoals )", "companyRating": "4.2", "companyInfo": {"Website": "www.infoobjects.com", "Headquarters": "San Jose, CA", "Size": "201 to 500 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": " Recruiter InfoObjects Inc  Location San Francisco  San Francisco  United States  Salary Competitive  Posted 28 Jun 2018  Closes 26 Jul 2018  Job role Accountant  Sector IT  Contract type Permanent  Hours Full time  You need to sign in or create an account to save Core Responsibilities: Define & execute data governance program across the entire company  Define & execute application governance program (purchase, maintenance, disposal of apps [i.e. no duplicates], be able to track all apps with a profile) across the entire company  Define & execute security program around applications & data  Execute & organize documentation around data, application, and security governance  Define where IT can support the business units & their use of applications Experience: 5+ years of business analysis experience around data & application governance  Well versed in application security & cyber security, and be able to explain it to others  Impeccable documentation and holding people accountable on governance policies  Ability to work independently from the manager, but be open to take direction. Partner & collaborate strongly with other departments (business, cyber security)  Excellent writing, listening, and speaking Software Skills: Exceptional with Microsoft Office Suite (Word, Excel, PowerPoint, etc.) Immediate success will look like???: Implement specific documentation around data & application processes  Processes around data & applications are effective - others can see the effects of it! - provided by Dice Business Analyst (Data & Application Governance) security"}