{"jobID": "2816166728", "jobLocation": "Reston_VA", "jobTitle": "Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.jacobs.com", "Headquarters": "Dallas, TX", "Size": "10000+ employees", "Founded": " 1947", "Type": " Company - Public (JEC) ", "Industry": " Construction, Repair & Maintenance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Fluor, Bechtel, AECOM"}, "estimatedSalary": "65000", "jobDescription": "\"Jacobs National Security Solutions (NSS) provides world-class IT network and service management capabilities; cutting edge cyber threat awareness and cybersecurity solutions; innovative web- and software applications development; and advanced data analytics for major clients in the Intelligence Community, Department of Defense, and Federal Civilian Agencies.Our forward thinking solutions deliver an integrated approach to IT network design and management, full lifecycle IT service management, IT service delivery, asset management, logistics and procurement, and vendor management. We leverage the expertise and passion of our employees to conduct identity and access management, penetration testing, and vulnerability assessments for our nation’s most closely guarded agencies and networks. Our Cyber Security Operations Centers ensure safe, effective network operations for Federal clients while our data scientists are helping stop illegal acts before they can endanger Americans or our way of life.Jacobs promotes a culture of operational excellence to create a safer, smarter, and more connected world while upholding the highest standards of compliance, quality and integrity. We continue to thrive and need your talent and motivation to help propel us farther, faster.”Jacobs is seeking a Data Analyst for a contingent position in Reston, VA. Duties will include: Oversee programmatic data activities including the development of data collection systems, reporting, ad hoc data analysis, and report writing.Work with program staff to identify business needs and translate these needs into quantifiable data requirements.Offer ongoing recommendations for data-driven tracking and refinement of program outcomes.Oversee the management of data in our business data system. Monitor data quality on an ongoing basis. Develop reports and workflows. Oversee the design and execution of data analysis projects to inform program oversight. Using SQL, Access, VBA, SharePoint and/or Cognos, clean and analyze program data from multiple sources and generate tables, figures, and reports.Effectively present and explain data and findings verbally, in writing and in graphical format to program management, non-technical audiences, and program leadership. Collaborate with IT staff to work on the development, enhancement, and implementation of new and existing data systems.Maintain technical written documentation such as data reports, data dictionaries, data access rules, methods and business rules.Oversee the development and implementation of programmatic surveys, questionnaires and other surveillance methods, identify potential data sources, and analyze new and existing data sets to inform program planning and evaluation activities.Ability to obtain a TS/SCI Polygraph requiredBS degree in a related scientific or engineering discipline from an accredited college or university and eight (8) to twelve (12) years of progressive experience, or an MS degree in a related scientific or engineering discipline, and seven (7) to ten (10) years of progressive experience, or a Ph.D. degree in a related scientific or engineering discipline, and two (2) to five (5) years of progressive experience.Experience with the following: Excel, Access, SQL, SharePoint, VBA, CognosSound understanding of process workflows is required Program Management experience and/or PMP is desiredITIL is desiredExperience with Business Analytics is desiredEssential Job FunctionsPhysical Requirements: (Can be edited to match position needs)Most work will be done at a desk or computer.Work Environment: (Can be edited to match position needs)General Office environment. The work environment is fast-paced and sometimes involves extreme deadline pressures. The nature of the work requires a high degree of teamwork and cooperation with other members of the staff as well as individuals across the Company and Customers.Equipment & Machines: (Can be edited to match position needs)General office equipment including PC/laptop, Fax, Copiers, Shredder, Printers, Telephone, and other miscellaneous office equipment.Attendance: (Can be edited to match position needs)Attendance is critical at all times. Must be able to work a 40-hour workweek, normally Monday through Friday. However, times and days may vary depending on business requirements. Needs to be available to work overtime during critical peaks and be available to meet last minute requests for overtime should the situation occur.Other Essential Functions: (Can be edited to match position needs)Must be able to communicate effectively both verbally and in writingGrooming and dress must be appropriate for the position and must not impose a safety risk/hazard to the employee or others. Must put forward a professional behavior that enhances productivity and promotes teamwork and cooperationMust be able to interface with individuals at all levels of the organization both verbally and in writing. Must be well-organized with the ability to coordinate and prioritize multiple tasks simultaneously. Must work well under pressure to meet deadline requirements. Must be willing to travel as needed. Must take and pass a drug test and background check as well as a motor vehicle records check. Must be a US citizen."}