{"jobID": "2766188383", "jobLocation": "Parsippany_NJ", "jobTitle": "Chief Data Scientist", "companyRating": "3.0", "companyInfo": {"Website": "www.provenir.com", "Headquarters": "Parsippany, NJ", "Size": "51 to 200 employees", "Founded": " 1992", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "203000", "jobDescription": " Who We Are  A Chief Data Scientist to hold a “key” leadership position at Provenir. You will be responsible for solution design and implementation. You will work closely with our development and innovation teams to drive our Data Science Initiatives across all of Provenir and drive the creation of new data sciences capabilities for our business by envisioning and executing strategies that will influence improvement of the business’ performance.  Proactively work with business executives and various departmental heads across the business in order to provide advanced analytic data modeling systems. The Chief Data Scientist will design and launch innovative and complex analytic models and lead the development of big data capabilities and utilization as well as the coordination of cross-functional analytic initiatives.  What You’ll Do Lead the decision and data science function for Provenir globallyDesign and develop a scalable data analytics platform and solutionsBuild and mentor a new team of Data ScientistsCollaborate with architects, product managers, engineers, etc., to define requirements and design solutionsFacilitate consensus and balance the needs of many different constituenciesAssess, benchmark and select data analytics technologies to be added to the big data platformsIdentify areas of architectural risk and work with other architects to address themProvide guidance and mentor developers regarding data analyticsRepresent our technical strategy and architecture with prospective customers during sales visits What’s Required  Education - Graduate degree in Mathematics, Data Science or other quantitative field is required  Experience - Proven experience (7+ years) as a Data Scientist and experience leading a data analytics group or organization.  Qualifications, Strengths and Skills: Experience in data miningUnderstanding of machine-learning and operations researchKnowledge of R, SQL and Python; familiarity with Scala, Java or C++ is an assetExperience using and understanding business intelligence tools (e.g. Tableau) and data frameworks (e.g. Hadoop)Experience working with AWSAnalytical mind and business acumenStrong math skills (e.g. statistics, algebra)Problem-solving aptitudeExcellent communication and presentation skillsAt Provenir, you’ll be a member of a new dynamic and growing team that prides itself in developing highly innovative, adaptable and configurable software solutions. You’ll enjoy a competitive compensation and benefits package. Our collaborative culture and strong technical environment make Provenir a great place to build your career.  Provenir is an Equal Opportunity Employer "}