{"jobID": "2802899343", "jobLocation": "Washington_DC", "jobTitle": "Scientist, NLP Researcher", "companyRating": null, "companyInfo": {"Website": "www.comcastcareers.com", "Headquarters": "Philadelphia, PA", "Size": "10000+ employees", "Founded": " 1963", "Type": " Company - Public (CMCSA) ", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " AT&T, Time Warner Cable, Verizon"}, "estimatedSalary": null, "jobDescription": " Comcast brings together the best in media and technology. We drive innovation to create the world's best entertainment and online experiences. As a Fortune 50 leader, we set the pace in a variety of innovative and fascinating businesses and create career opportunities across a wide range of locations and disciplines. We are at the forefront of change and move at an amazing pace, thanks to our remarkable people, who bring cutting-edge products and services to life for millions of customers every day. If you share in our passion for teamwork, our vision to revolutionize industries and our goal to lead the future in media and technology, we want you to fast-forward your career at Comcast.Job Summary:Are you interested in inventing intelligent applications that impact millions of people on a daily basis? Do you want to invent the future of customer service and build virtual assistants and reinforcement learning solutions that interact with millions of customers in natural language and automatically find solutions to their needs?If yes, come join the Comcast Applied AI group. We are an innovative research group within Comcast's Technology & Product organization with offices in Washington, DC, Silicon Valley, Philadelphia, Denver and Chicago that does groundbreaking research to support the development of novel Deep Learning and Machine learning based products for Comcast's 22+ Million consumers.We are currently looking to grow our group with senior and junior researchers that have experience in conducting cutting-edge research in AI and Machine Learning applied to NLP, Reinforcement Learning, Anomaly Detection, Customer Service and similar domains.The ideal candidate will have experience working as a technical lead or junior researcher in an industry, government, or academic lab setting on artificial intelligence and machine learning projects.The positions can be located in any of our locations, though Washington, DC, Philadelphia, or Sunnyvale, CA are preferred. We feature an informal, open atmosphere, and cultivate a start-up culture with the backing of a Fortune 50 company. To better serve our community, we believe the diversity of our team should reflect the diversity of our customers.Core Responsibilities: Develops algorithmic solution and technical requirements of custom designs for future products and applications. Leads research in one or more of the following areas: Deep Learning, NLP, Reinforcement Learning, Time Series Analysis, and Large-scale Machine Learning. Works with other Technical Leads, Product Managers and Business Partners to lead development of prototypes that demonstrate Research work, help with Product Discovery and integrate research output into engineering code base. Works with various team members both within and outside Research. Ensures timely progress of work. Conducts Research in an incremental manner thereby enabling faster integration of technology into products. Able to evaluate prototype systems, write technical papers, and help with technology transfer. Keeps track of developments in field both in academia and in industry. Attending relevant conferences and publishing research results is encouraged.- Consistent exercise of independent judgment and discretion in matters of significance.- Regular, consistent and punctual attendance. Must be able to work nights and weekends, variable schedule(s) as necessary.- Other duties and responsibilities as assigned.Job Specification:-Master's degree in computer science, computer engineering, mathematics, related technical discipline, or related industry experience; Ph.D. preferred.- Experience with machine learning, deep learning, data mining, and/or statistical analysis tools and how to adapt and customize the underlying algorithms for your needs.- Strong programming and software development skills, and familiarity with Python, Java or Scala, and SQL Knowledge of machine learning frameworks (H20, Keras, TensorFlow, PyTorch, etc.) and data pipeline and preparation tools such as Spark, Pandas, and the Hadoop ecosystem. - Generally, requires 7-10 years related experience after Bachelors, 5-8 years after Master's, or 2-3 years after Ph. D. for lead positions, and at least 2-3 years related experience after Bachelors, or a recent Master's or Ph.D. for junior research positions.  Comcast is an EOE/Veterans/Disabled/LGBT employer"}