{"jobID": "2783964367", "jobLocation": "San_Francisco_CA", "jobTitle": "Business Data Engineer", "companyRating": "4.8", "companyInfo": {"Website": "www.automattic.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Wix, Squarespace"}, "estimatedSalary": "143000", "jobDescription": " Automattic is the company behind WordPress.com, Jetpack, WooCommerce, and more. We are looking for a full-stack data engineer with a head for business.  You’ll work with business leads, analysts, data scientists and fellow engineers to build data products that empower better decision making. You’re relentless about data quality in business metrics. You’ll understand business drivers and analytics use cases, you’ll evaluate and help to shape technology choices, and you’ll implement data products that solve business use cases.  What we’re looking for: Hands-on, production experience with big data technologies (Hadoop, Hive, Impala, HBase) and data pipelines.Experience developing business intelligence and data visualization tools for business metrics.Experience with D3, Python, or other libraries & languages for data visualization.Strong analytical skills and a fervor for data quality.The curiosity and determination to understand and improve data flows. How to ApplyDoes this sound interesting? If yes, please send a short email to jobs @ this domain telling us about yourself and attach a résumé. Let us know what you can contribute to the team. Include the title of the position you’re applying for and your name in the subject.  Proofread! Make sure you spell and capitalize WordPress and Automattic correctly. We are lucky to receive hundreds of applications for every position, so try to make your application stand out. If you apply for multiple positions or send multiple emails there will be one reply.  If you’re reading this on a site other than automattic.com please make sure you visit automattic.com/work-with-us for the latest details on applying.  ← Work With Us"}