{"jobID": "2796133618", "jobLocation": "Basking_Ridge_NJ", "jobTitle": "Biomarker Analysis Scientist", "companyRating": null, "companyInfo": {"Website": "www.caresoftinc.com", "Headquarters": "Middlesex, NJ", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Duties: This scientist will act as a point of contact between the Biomarker Analysis group, clinical teams and CROs. Will oversee the outsourcing of clinical biomarker assay development, validation and sample analysis. Collaborate with functional groups in Japan to develop and implement clinical biomarker strategies supporting all therapeutic areas and stages of drug development.Develop and implement fit-for-purpose clinical biomarker assays at external CROs to support biomarker driven global clinical trials.Evaluates vendor validation and clinical analysis plans.Provide input on biomarker related sections of clinical study protocols including the necessary sample collection, processing and shipping requirements.Evaluate, interpret and present complex scientific data.Identify appropriate vendors and participate in vendor evaluation/selection for biomarker assay development, validation and sample analysis across diverse technology platforms.Skills:Must have industry experience in fit-for-purpose clinical assay development, validation and implementation in support of multisite clinical trials.Must have experience overseeing the establishment of biomarker assays at CROs.Experience working in a GLP or GLP-like environment highly preferred.A strong preference for a candidate with broad technical experience (e.g. Immunochemistry, flow cytometry, genomics and molecular pathology).Ability to work independently as well as collaboratively in a matrixed team environment.Strong oral/written and interpersonal skills requiredEducation: PhD in biological sciences or related field with 5 or more years of related experience post degree.  Regards,  Tajwar  732-533-2324"}