{"jobID": "2653657950", "jobLocation": "Livonia_MI", "jobTitle": "CNC Laser Operator", "companyRating": null, "companyInfo": {"Website": "www.bullmoosetube.com", "Headquarters": "Chesterfield, MO", "Size": "501 to 1000 employees", "Founded": " 1962", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Atlas Steel Tubes Industries, Independence Tube"}, "estimatedSalary": null, "jobDescription": " Bull Moose Engineered Products Company, a subsidiary of the Bull Moose Industries has an opportunity for a CNC Tube Laser Operator. This position can be located at our facility in Livonia, Michigan. A competitive hourly base salary with comprehensive benefits is available to the successful candidate. Responsible for: Operation of multi-axis CNC tube laser machinery Requirements:Ability to use hand tools and equipment as requiredThorough understanding of Machining practices, preferably Laser cutting2 years of CNC experienceAbility to read and interpret blueprintsAbility to use MME, including, but not limited to micrometers, tape measures and calipersBasic understanding of hydraulic and electrical controlsHigh school diploma or equivalentAbility to read, write, speak and understand EnglishJob Duties:Understand and operate machine controlsUnderstand and monitor all tube laser variablesBasic troubleshooting and repairOperation of equipment as neededFork truck and crane operationPhysical Demands/Environment: Ability to stand, walk, twist, bend, kneel, see, talk, hear and lift up to 45 lbs. Exposed to moving mechanical parts, vibration, non-hazardous materials, and variances in sound levelscompany will provide necessary certified training needed for the specific machineThe above statements are intended to describe the general nature and level of work being performed by colleagues assigned to this position. They are not intended to be an exhaustive list of all responsibilities, duties, qualifications or working conditions. Candidates must be drug free.  An equal employment affirmative action employer M/F/D/VJob Posted by ApplicantPro"}