{"jobID": "2802138227", "jobLocation": "San_Antonio_TX", "jobTitle": "Data Systems Analyst (137168) with Strategic Staffing Soluti", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The position listed below is not with San Antonio Interviews but with Strategic Staffing Solutions (S3)  San Antonio Interviews is a private organization that works in collaboration with government agencies to promote emerging careers. Our goal is to connect you with supportive resources to supplement your skills in order to attain your dream career. Job DescriptionSTRATEGIC STAFFING SOLUTIONS (S3) HAS A CAREER CHANGING POSITION FOR YOU! Strategic Staffing Solutions is currently searching for a Data Systems Analyst in San Antonio, TX!  Location of work: San Antonio, TX  Duration: until the end of the year  Rate: Negotiable (DOE) W2 Only, No C2C  This position is not eligible for visa sponsorship  Minimum Requirements:  · Minimum 6 years’ experience gathering requirements, writing user stories, and performing systems analysis for advanced predictive analytics/machine learning solutions  · Experience defining operational and performance metrics, KPIs, SLOs and scorecards (preferably for advanced analytics solutions)  · Experience defining and documenting business processes  · Experience defining best practices and solution offerings for data and analytic product management  · Strong collaboration, facilitation and communication skills (facilitate requirements workshops, surveys, etc.)  · Strong SQL skills  · Data analysis skills - ability to dig in and understand complex models and business processes  · Data profiling experience  · Demonstrated ability to translate business processes to applicable requirement types (functional, technical, etc)  · Strong documentation skills  · Microsoft Office (Outlook, Excel, Word, PowerPoint, Access)  · Bachelor’s Degree in Business, Technology, or Science Preferred skills: · Familiar with Agile Development Methodology (SAFe)  · Experience writing queries on UDB/DB2/Netezza  · Experience designing and building visualizations / presentations  · Understanding of NoSQL data stores  · Understanding of advanced predictive analytics/machine learning solution deployments  · Understanding of Bank data and/or processes  · Understanding of ETL/ELT and streaming patterns of data movement, integration and transformation  · Understanding of event-based data movement and integration patterns  Company DescriptionStrategic Staffing Solutions (S3) is an international, woman-owned, over $300 million IT and business services corporation based in Detroit. With a composite average annual growth rate of 19%, S3 is fiscally sound and debt free. S3 has had $3.3 Billion in sales since its inception with $1.2 billion of those sales occurring in the last 5 years. It is ranked 16th among the largest staffing firms in the US by Staffing Industry Report and is one of two companies nationally certified as a Charter Partner with Staffing Industry Analysts. S3 is also ranked as the sixth largest diversity staffing firm in the US by Staffing Industry Analysts and one of the top 25 among woman-owned businesses in the nation by Women’s Enterprise USA Magazine.  S3 provides staff augmentation, direct hire recruiting, workforce programs, and outsourced solutions with global industry expertise in energy/utility, healthcare services, insurance, communications, and financial services. It has more than 3,000 direct consultants in 49 out of 50 states in the U.S. and 15 countries including Europe and the Americas.  Apply"}