{"jobID": "2817695942", "jobLocation": "Grand_Blanc_MI", "jobTitle": "Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.gm.com", "Headquarters": "Detroit, MI", "Size": "10000+ employees", "Founded": " 1908", "Type": " Company - Public (GM) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " FCA Fiat Chrysler Automobiles, Ford Motor Company, Toyota North America"}, "estimatedSalary": "90000", "jobDescription": "Job Description: GM Customer Care and Aftersales (CCA) markets automotive replacement parts worldwide for GM and non-GM vehicles through four distinct distribution channels, which include GM dealers, wholesale distributors, ACDelco warehouse distributors, and consumer-related outlets such as auto parts and general discount stores. GM's Customer Care & Aftersales is the only business unit that supports the vehicle for its entire lifecycle. Approximately 5,600 hourly and salaried employees work within GM North America CCA including 29 warehouse facilities, Central Office, Engineering and Technical Centers, and field sales regions within the United States, Canada and Mexico.  The CCA Data Analytics group is responsible for developing analytics-driven solutions to help CCA achieve its business goals. The solutions would be implemented across a number of touch points which may include web-sites, dealerships, field sales, or central office. The individual will work as a member of a multi-disciplinary team of individuals of various levels of experience who will be driving opportunity identification and solution design, development, and deployment of machine learning models across the CCA organization. The team is responsible for both advanced analytics strategy and applied, project-based solutions, focusing on the company's most critical business areas.  This is a unique opportunity to be a part of team that will develop technical strategies and drive value from a big data approach to advanced analytics, machine learning and/or cognitive computing. Responsibilities include the following:Work as a member of a cross-functional team to propose and implement high-impact data and analytic solutions that address business challenges across a variety of business unitsData Science and Modeling techniques to drive data driven decision making and solve complex business problems: o Create breakthrough solutions, performing exploratory and targeted data analyses  o Build predictive models and machine-learning algorithms  o Analyze large amounts of diverse information to discover trends and patterns  o Undertake preprocessing of structured and unstructured data  o Monitor and sustain model effectiveness  o Combine models through ensemble modeling  o Present complex information using data visualization techniques Work with diverse technical teams and provide data and analytic oversight to ensure project deliverables fulfill business needs and timingContribute to General Motors big-data driven approach to advanced analytics strategy and architectureSkills & Qualifications:Minimum three years of experience developing, deploying and monitoring performance of large analytic data sets and machine learning based modelsMinimum three years of experience utilizing several of the following data and analytics toolsets: o Languages: Python, R, Spark Scala, SAS  o Big Data Tools and Databases: Hadoop, Teradata, Spark, Kafka, Advanced SQL and NoSQL including Postgres and Cassandra  o Data Visualization: Tableau, SAS, JMP or similar Ability to prioritize and manage multiple tasks and projects at once without sacrificing qualityStrong listening and communications skillsHighly collaborative work styleAbility to evaluate the big picture and solve business problems rather than focusing solely on metricsEducation and Experience:Required 4-Year Degree in Mathematics, Statistics, Computer Science, Operations Research, Engineering, Economics or quantitative fieldMaster's Degree or equivalent work experience strongly preferredPreferred academic or work experience in a data-intensive field/industry such as biotechnology, computational chemistry, cognitive or neurosciences, behavioral economics, econometrics, engineering, physics, quantitative finance, high frequency trading or intelligence analytics on Company Website  Job ID: GENEA*********  Help us improve CareerBuilder by providing feedback about this job: . CAREERBUILDER TIP For your privacy and protection, when applying to a job online, never give your social security number to a prospective employer, provide credit card or bank account information, or perform any sort of monetary transaction. Learn more.  By applying to a job using CareerBuilder you are agreeing to comply with and be subject to the CareerBuilder Terms and Conditions for use of our website. To use our website, you must agree with the Terms and Conditions and both meet and comply with their provisions.  General Motors  General Motors is pioneering a new era in the automotive industry, harnessing cutting-edge technologies and developing initiatives to change the way people think about mobility. And we're gathering the best and brightest talent to help shape and bring our vision to life. Because we're made for more. Together, we thrive in a culture of curiosity and tenacity, where we respond to every challenge with 'What if?' From vehicle electrification and automation to connected cars and urban mobility solutions, we're defying the limits of imagination. Our employees enjoy the resources and support they need to broaden their skills, achieve their goals, and set even higher ones. We're creating extraordinary products and services that delight our customers around the world, and we're doing it with a commitment to strengthen our communities and preserve our planet. The opportunities at General Motors have never been more exciting. Are you made for more? Contact Info Grand Blanc, MI 48439"}