{"jobID": "2756003746", "jobLocation": "Houston_TX", "jobTitle": "Assistant Research Scientist", "companyRating": "4.3", "companyInfo": {"Website": "www.tamu.edu", "Headquarters": "College Station, TX", "Size": "10000+ employees", "Founded": " 1876", "Type": " College / University", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "42000", "jobDescription": "Job TitleAssistant Research ScientistAgencyTexas A&M; University Health Science CenterDepartmentIbt Center For Translational Cancer ResearchProposed Minimum Salary$3,423.75 monthlyJob LocationHouston, TexasJob TypeStaffJob DescriptionRequired Education: Appropriate PhD Required Experience: Relevant professional experience Preferred Education: Appropriate PhD degree in bioengineering, computation biology, bioinformatics, statistics, mathematics or related field. Preferred Experience: Experience in one or more of the image analysis tools such as high content microscopy, cell imaging, histopathology and (as needed) bioinformatics data integration with genomics data. Experience with statistical data analysis (PCA/Machine learning/clustering/classification) is strongly preferred. Required Special Knowledge, Skills, and Abilities: Ability to multi-task and work cooperatively with others. Ability to perform all tasks and job responsibilities safely without injury to self and others in compliance with A&M; System and HSC guidelines. Provide a safe environment that fosters respect, inclusion, and equality of all faculty, staff, students, and visitors. Preferred Special Knowledge, Skills, and Abilities: Experience with metal complex synthesis, protein engineering and quantitative assays. Job Responsibilities:Perform Image Analyses (high content microscopy, cell imaging, histopathology) and as needed bioinformatics data integration with genomic data. Troubleshoot problematic results.Designing and performing imaging-based analysis projects as part of biological research team. Discuss analysis strategies and design the appropriate analyses. Collect and compile image data. Data wrangling for image analyses.Directly interact and report to CAMII team. Participate in the outreach efforts of CAMII.Write programs in image analysis software (one or more of Pipeline Pilot, Cell Profiler, MATLAB, Fiji/ImageJ, Python, R, etc.). Rigorous documentation of analysis procedures is essential.Participate in lab meetings within the center and other departments. Participate in joint projects involving the laboratory team. Other duties as assigned.Preferred Other Factors Occasional weekend or after-hours work might be required.  All positions are security-sensitive. Applicants are subject to a criminal history investigation, and employment is contingent upon the institution’s verification of credentials and/or other information required by the institution’s procedures, including the completion of the criminal history check. Instructions to Applicants: Application must be filled out completely. Incomplete applications will not be considered. We encourage all applicants to upload a resume or use LinkedIn profile to pre-populate the online application.  Equal Opportunity/Affirmative Action/Veterans/Disability Employer committed to diversity.  All positions are security-sensitive. Applicants are subject to a criminal history investigation, and employment is contingent upon the institution’s verification of credentials and/or other information required by the institution’s procedures, including the completion of the criminal history check.  Equal Opportunity/Affirmative Action/Veterans/Disability Employer committed to diversity."}