{"jobID": "2815293155", "jobLocation": "Washington_DC", "jobTitle": "(SME) Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.culmen.com", "Headquarters": "Alexandria, VA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": "(SME) Data AnalystAnalytic Strategies, LLC, a wholly-owned subsidiary of Culmen International, has an immediate opening in support of an on-going US Government contract.TS SCI + DHS Suitability RequiredLocation Metro DC AreaJob Purpose:The Team provides programmatic and technical support services for the Homeland Security Advanced Research Projects Agency (HSARPA), Front Offices Data Analytics Engines (DA-E) program. DA-E applies leading-edge computational data analytics research and development (R&D;) techniques to enable user-focused, data-driven solutions for DHS missions. DA-E is the crosscutting S&T; resource for subject matter expertise and technical capabilities in data storage, security, computation, analysis, and visualization to the Homeland Security Enterprise (HSE1). The DA-E mission extends beyond data analysis to examining human interfaces between the end-users and the technology and helping document and develop business cases for data-directed investments. DA-E also cultivates and maintains relationships within S&T;, the HSE, and other partners to ensure successful transition of the best, cost-effective solutions.Qualifications and Skills:Analytic Skills: Work with large amounts of data to determine computer modeling requirements to extract the required data; remove corrupted data; perform analysis to assess the quality of data and additional data screening requirements.Communication Skills: Prepare written reports based on analysis and be able to brief findings and recommendations.Critical Thinking: From statistics, data, and trends, determine tactical and strategic meanings or conclusions.Team Operations: Be able to work with a diverse team of SMEs, Operators, Management, and Federal Stakeholders to collaborate on resolving recommendations and solutions from the analysis of data and SME discussion.Team-oriented; fast-paced operations; mission-focused.Candidate has the abilities outlined in KSA block and is able to thrive in the work-environment outlined above."}