{"jobID": "2794942524", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.lendup.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "65000", "jobDescription": " LendUp is a financial-technology company which offers credit products, financial education and a path to financial well-being for the 56% of the U.S. population who are currently shut out of mainstream banking because of poor credit or volatile income. Thats a lot of deserving, hardworking people.  Our mission is to provide anyone with a path to better financial health. Being a socially responsible lender is a big job, but were more than up to the challenge. Now in our fifth year, were growing rapidly as we continue to bring our mission to life. Join our exciting team and help us turn our mission into a movement.  LendUp is headquartered in downtown San Francisco, CA with an office in Richmond, VA. Were backed by prominent Silicon Valley investors including Y-Combinator, Google Ventures, Susa Ventures, Data Collective, Kleiner Perkins, Andreessen Horowitz Seed Fund, Kapor Capital, QED, Eagle Cliff Investors, Yuri Milner, Thomvest Ventures, and many others. About the role: At LendUp, we use data daily to offer the right financial product at the right time to our customers. As a data analyst, you have the opportunity to be the go-to person to answer our most important product and compliance questions. In this role, you will use SQL daily to answer important business questions, like \"We'd like to test a new product feature, how many customers a week share this list of attributes?\". Similarly, with compliance questions you will evidence that we created the correct actions for all of our customers, and if not, lead the investigation into why. This role will provide growth opportunities such as launching and analyzing A/B tests and influencing our data warehouse. You will:Dive into quantitative questions in every part of the business, at every level of the organizationAdvise other teams on how to make quantitative decisionsCreate queries, dashboards, and analyses to help leaders understand the health and operation of the businessYou have:SQL proficiencyData drivenDetail orientedAble to manage many projects with many stakeholdersGood communication skillsPython (nice to have)We have: LendUp has all the things youd expect from a mission-driven company, like a competitive salary; early stage equity; 100% company paid medical, dental and vision insurance; generous vacation/sick leave policy; catered, free lunch; kitchens fully stocked with healthy snacks; 401(k). But heres what we really love about LendUpLife:Our dog-friendly SF officeWere committed to a diverse and inclusive culture that spurs innovation and creates a meaningful and impactful work environmentWe have fun together at our weekly happy hours, quarterly team building events, company-sponsored volunteerism, hackathons, and sports teamsOne of our values is different backgrounds, same mission. We are passionate participants in our employee resource groups (LeanIn, LGBTQ & Allies, and Black Ladders...) and have slack channels dedicated to everything from philosophy to sports to hip hopLendUp is an Equal Opportunity Employer We extend equal employment opportunities to qualified applicants and employees on an equal basis regardless of an individual's age, race, color, sex, religion, national origin, disability, sexual orientation, gender identity or expression, pregnancy status, marital status, military or veteran status, genetic disposition, or any other reason protected by law."}