{"jobID": "2655929877", "jobLocation": "Chicago_IL", "jobTitle": "Senior Analytics Consultant", "companyRating": "4.7", "companyInfo": {"Website": "www.striveconsulting.com", "Headquarters": "Chicago, IL", "Size": "501 to 1000 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "83000", "jobDescription": "Strive Consulting, LLC is actively hiring for Senior Analytics Consultant to join our growing Data Analytics practice. This is a full-time opportunity within our office located in Downtown Chicago.Strive is a nationally recognized leader in technology solutions and services with offices in Chicago, Atlanta, Dallas and Columbus. We have the people, processes, and tools to provide companies with strategic guidance on business-critical initiatives and deliver end-to-end solutions in a variety of areas.The Senior Analytics Consultant will join Strive as a leader on the team in Data Visualization, Business Intelligence and Data Management Solutions. This leader will be passionate about working with tools such as Power BI, Tableau, Qlikview/Qlik Sense etc. and is excited to work with clients to discover, define and implement strong Analytics solutions.We were recently named a “2018 Best Places to Work” by Glassdoor and have been recognized as a “Best and Brightest” place to work both locally here in Chicago and nationally three years in a row. We are looking for candidates who are driven by a sense of “team success”, self-motivation, and performing in a fast-growing, competitive, and service-oriented culture.Our employees receive full benefits—medical, dental, vision, short term disability, long term disability, life insurance, and matched 401k. We also have a take what you need PTO policy.Responsibilities:Work with clients and suppliers in areas of Visualization, Data Management and Business Intelligence project managementGains an understanding of client’s current situation and environment by gathering needed information and using appropriate frameworks and models in the development of assessment material for decision-making purposesProvides thought leadership in the formation and build of additional value-added consulting offerings and partnership opportunities to help drive Strive cloud services businessAssists in recruiting activities by identifying and interviewing candidates as well as informal mentoring and coaching of staffPreferred Experience5-10 years recent IT consulting experience as a technical specialist in customer-facing roles, or suitable experience within a corporate IT department in a variety of leadership positions across IT Operations, Architecture and SecurityExperience designing, building and delivering Data Management SolutionsExperience with Visualization Tools including Power BI*, Tableau, QlikView etc..Data Architecture, Data warehouse designStrong presentation, verbal and written communication skills with the ability to articulate complex ideas in easy to understand business terms to all levels of management including senior leaders and C-level executives.Worked with organizations during the pre-sales process (consulting or product organizations)"}