{"jobID": "2723104091", "jobLocation": "Highlands_NJ", "jobTitle": "Head of Data", "companyRating": null, "companyInfo": {"Website": "www.ing.com/en.htm", "Headquarters": "Amsterdam, Netherlands", "Size": "10000+ employees", "Founded": " 1900", "Type": " Company - Public (ING) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " KBC, BNP Paribas, Belfius Bank"}, "estimatedSalary": null, "jobDescription": "Our mission We created Yolt because we are committed to provide a fun and efficient way to manage your money. We're on our way, and we'd love to have you involved. We work hard, fast and never forget to celebrate our successes.  About the team  You'll join a small, dedicated team of highly skilled people who are part of a new start-up, named Yolt, endorsed by ING aimed at creating an easy and enjoyable way to manage your money in one mobile app. The app is live as an open beta in the UK market and is followed by expansion to other countries.  The team operates in a unique space on the boundaries of a large multinational bank with an entrepreneurial attitude of a start-up. To support our vision, we are looking for a Head of data. The head of data is responsible for the team that develops the intelligence that powers the Yolt app. Job description The head of data should have a background in the data field, either as a (data) engineer or as a scientists and have experience leading a highly skilled team. In this role you are responsible for the creation and execution of Yolt’s data strategy. It’s preferred that the candidate is up-to-date with the developments in amongst others machine learning and be able to setup experiments to test certain hypothesis.  A successful candidate will oversee all data-related activities and ensure alignment with the CPO and CTO. On a day to day basis you work with the data team where you fulfill the role as a Product Owner, determining the backlog of the team. This team is responsible for building the analytical capabilities of Yolt to support our users with useful insights and the business with comprehensive analysis about retention, churn and usage.  We ask from the candidate to also seek alignment outside Yolt to determine what external sources or products we can use to make better predictions and help our users to be even smarter with their money.  Joining Yolt you get the chance to work in the forefront of the fintech sector, being able to work with new technologies and with a great team of skilled colleagues. You are the Head of Data Yolt is looking for because you have:A master’s Degree or PhD in a computer science or statisticsStrong skills in software development or in development of data science modelsA proven track record in the creation and execution of a data strategySkills to coach other data scientists, analysts and engineersInterest to stay up-to-date on relevant new developmentsDutch and/or English speaking and writing skillsGood social and communication skillsExperience in Agile / scrum What do we offer?A full-time position with flexible hoursCompetitive salary and benefitsA most inspiring and entrepreneurial environmentA challenging job within one of the most distinctive fintech startupsWould you like to apply? Do you recognize yourself in this profile? Apply now and become part of our team!  We are looking forward to getting to know you!"}