{"jobID": "2809403222", "jobLocation": "Portage_MI", "jobTitle": "Junior Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.kellyservices.com", "Headquarters": "Troy, MI", "Size": "5001 to 10000 employees", "Founded": " 1946", "Type": " Company - Public (KELYA) ", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Adecco, ManpowerGroup, Allegis"}, "estimatedSalary": null, "jobDescription": "Junior Data Analyst - Portage, MI 2 Positionss\"Use this link to chat with a recruiter now: https://flashrecruit.com/user/RachitaSaxena “Length: 1 year W2 ContractPay: $15.00 - $21.00/hour W2 Contract The Sales Area Steward is responsible for managing workflows involving customer master data creation/updates, process improvement and maintenance within the SAP MDG system. Primary responsibilities include supporting and analyzing data specifically around freight and shipping. High level of accuracy and attention to detail is required. Sales Area Data StewardResponsibilitiesReview Customer Master set up and maintenance process related to shipping and delivery terms by working with cross-functional teams and implement continuous improvement upgrades.Work with customer master data team to maintain corporate customer master database, including set-up and maintenance of customer information within ERP system.Work with cross-divisional business units and appropriate team members to troubleshoot Customer Master Data sales area issues.Identify issues and risks to appropriate team members relating to Customer Master Data and potential adverse impacts to the business.Act as customer master sales area subject matter expert (SME) on project teams - providing guidance as necessary for new processes, maintenance, and analysis of freight and shipping/delivery terms.Primary interaction with cross-functional areas (such as field personnel, Finance, Compliance, etc.)Understand and use available database and ERP systems required for work group.Minimal supervision, assist in maintaining policies and procedures, respond to incoming inquiries.Perform other duties as assigned.Accuracy and attention to detail is critical for this position. APPLY NOW!! Also, feel free to follow up via email to RACS113@KELLYSERVICES.COMOR \"Use this link to chat with a recruiter now: https://flashrecruit.com/user/RachitaSaxena “Why Kelly®?"}