{"jobID": "2836882404", "jobLocation": "Mountain_View_CA", "jobTitle": "Manager, Data Science", "companyRating": null, "companyInfo": {"Website": "www.atlassian.com", "Headquarters": "Sydney, Australia", "Size": "1001 to 5000 employees", "Founded": " 2002", "Type": " Company - Public (TEAM) ", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " GitHub"}, "estimatedSalary": null, "jobDescription": " Atlassian is looking for a talented Data Science Manager to join our central Search and Machine Learning team for cloud products. You will develop and lead a group of Data Scientists to tackle impactful problems that improve how our users search for and find content, form and collaborate across teams, and manage their work. With the Atlassian toolset being a de facto standard in many industries, your efforts will impact the effectiveness of how millions of people collaborate across the globe.  You'll work closely with our Engineering, Design, and Product Management teams to develop production Machine Learning Models and guide the team’s direction through data-driven insights and algorithmic thinking. This includes contributing to the strategic direction of data science and tooling at Atlassian and being both an internal and external champion for the domain.  This is an excellent opportunity for someone who is passionate about data science and wants to make an impact to the way millions of users complete their work on a day to day basis.  More about you  As a Data Science Manager at Atlassian, you will:  Have worked with a large amount of data sets and be excited about data  Have experience working with engineering teams to produce production level Machine Learning Models that operate on a 24/7 schedule  Be a strong communicator and someone who enjoys coaching and developing others  On your first day, we'll expect you to have:  3+ years of industry experience in the data science domain  Experience in managing and mentoring others  Real passion for collaboration and strong interpersonal skills  Proven ability to communicate and represent data science concepts to a diverse set of people  Experience in producing and operationalizing Machine Learning Models in a production system  Comfortable in interacting with engineering teams and reading/writing code  Strong sense of accountability and self-drive and the ability to function independently  It's great, but not required, if you have  Experience with the Search domain  Experience with Natural Language Processing tools and techniques  Track record of presenting at meet-ups or conference  More about the team  This new and innovative team will be leading the initiative to incorporate Machine Learning into our products and build features that have yet to be conceived. The team is small, but nimble, and the opportunity is big. Envision the enormity of the data and insight we have when most of the world's technology, project management, ticketing systems and internal wikis are driven by Atlassian products. We get to empower enterprise organization to build better services and experiences by unleashing the power of their data and their teams."}