{"jobID": "2819898775", "jobLocation": "Des_Plaines_IL", "jobTitle": "Operational Systems & Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.wheels.com", "Headquarters": "Des Plaines, IL", "Size": "501 to 1000 employees", "Founded": " 1939", "Type": " Company - Private", "Industry": " Transportation & Logistics", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "53000", "jobDescription": "Wheels, Inc. was established in 1939 as the world's first automotive fleet leasing and management company. As one of the largest privately-held companies in North America, Wheels features a portfolio of 315,000 vehicles under management across the continent, capabilities in 40 countries worldwide, and a client base that consists of some of the best-known businesses in the world. In addition to vehicle acquisition and leasing, Wheels provides numerous specialized services that help all sorts of organizations manage their fleets. These include driver/vehicle support functions like maintenance management, fuel cards, and registration processing, as well as strategic account-level consultation to drive optimal fleet efficiency and measure results.The PQM department is responsible for continuous process improvement, process and performance analysis, productivity and capacity evaluation, custom reporting and data analytics with visualizations, and supporting IT software development initiatives.  This position within the Process and Quality Management team is to deliver information that will assist business owners in drawing insightful interpretations from data by delivering quality reporting and business intelligence solutions to the organization.  This position requires the ability to understand the value and benefit of solid data practices, how to translate them into fact-based business solutions to satisfy business owners, and are required to possess experience and skill in extracting, transforming, and visualizing data as well as working with various databases and queries for the purpose of generating ad-hoc reports and Tableau analytics. Additionally, this position will work on process improvement, software development projects, participate in Kaizen events, and use continuous improvement and six sigma methodologies and associated tools. Specific Responsibilities:Understand the business processes, analyze the data, develop SQL queries, create ad-hoc SQL queries and reports along with Tableau dashboards and data visualizationsExtract and manage large volumes of data, synthesize and interpret the results, and display the findings as appropriate, in creative and easy to understand visualizations in TableauStructure data visualization tools for appropriate data source, filtering, and statistical methodology applicationMonitor and analyze metrics to identify trends or opportunities where cost savings/cost avoidance and/or quality improvements can be realizedMaintain a complete understanding of the Wheels databases and how to access dataUse data mining techniques to develop reports that facilitate decision-making or otherwise directly impact our client’s objectivesCollaborate with the process owners to gather data and business requirements, lead and manage smaller software development and process improvement projectsApply the DMAIC methodology, statistical tools and techniques to analyze business operations, processes, and output to determine quality and process performanceSpecific Qualifications and Characteristics:Passionate about data-driven approaches to business problemsStrong analytical skillsExcited about learning new technologies and learning in a team environmentStrong development skills in Tableau and data analytics and visualizationsExperience in Problem Solving, Continuous Process and Quality ImprovementProficient in Microsoft Office including Access in addition to Minitab, SQLBackground in Lean and Six Sigma methodologiesTeam player, team-focused, detail-oriented, well organized, self-starterRequires minimal supervision and ability to function in multi-project environment with tight deadlinesGeneral ability to cope under pressure, maintain flexibility and adjust to changes in prioritiesExcellent verbal, written, presentation skills, and interpersonal communication skillsEducation and Experience:BS in engineering, computer engineering, computer science, statistics, finance, economics, or math (or equivalent experience)Minimum 3 years experience in business analytics and business intelligence applications analyzing data and developing solutions utilizing business analysis/intelligence toolsEnterprise data warehousing and dashboard design experienceAbility to communicate effectively with stakeholders to define requirementsExperience with transactional environments, preferably service industryTableau certification strongly preferredPhysical Demands: The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions."}