{"jobID": "2801993841", "jobLocation": "Dallas_TX", "jobTitle": "Data Science Application Developer", "companyRating": "4.3", "companyInfo": {"Website": "www.smu.edu", "Headquarters": "Dallas, TX", "Size": "1001 to 5000 employees", "Founded": " 1911", "Type": " College / University", "Industry": " Education", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": "The Office of Information Technology serves as SMU’s trusted partner for bold, creative and effective information technology solutions that advance the University’s mission and goals. The Data Science Research Application Developer will join a growing research technology solutions team to expand SMU’s next-generation capabilities for supporting interdisciplinary data science, digital scholarship, and high performance computing. The developer will deliver the innovative tools and services required by researchers to collect, discover, segment and analyze data, make discoveries and tackle grand challenges. The developer will lead, design, develop, test and support research solutions and projects in partnership with SMU’s communities of research and scholarship. Essential Functions:Help SMU’s researchers generate unique and meaningful data sets across a broad spectrum of devices and sources, then utilizing reports, dashboards and visualizations for making informed decisions. Assist researchers and scholars learn and leverage extensive text mining data tools by partnering with stakeholders to mine text from any type of existing to free-form sourcesAssist researchers and scholars learn and leverage extensive text mining data tools by partnering with stakeholders to mine text from any type of existing to free-form sources, surveys, notes, documents, books as a way to manage and visualize and study data in real time.Implement powerful data visualization solutions by utilizing and/or creating algorithms, systems and techniques for visualizing new data sets at increasingly large scales. SMU is increasingly interested in interactive visualizations of very large geo-spatial and temporal data.Develop software to support research and technology development needs.Actively participate in developing computational system requirements based on project needs, develop algorithm designs based on requirements, rapidly implement algorithm designs into functioning software prototype code; efficiently and effectively document the development process and the results.Provide database design, management and guide data quality processes—help guide and manage data intensive research project design and overall database management, leveraging SMU’s high performance computing ecosystem, while helping faculty analyze data to identify glitches, cleaning data to minimize distortionManage technology-intensive research projects in coordination with other campus IT resources and stakeholdersProvide outreach, communications and training to faculty and students related to data science technologies, applications and solutionsEducation and Experience:A Master's degree and three (3) years of relevant experience is required for this role. A PhD is preferred. Preferably in the field of statistics, computer science, machine learning, engineering, digital humanities, or mathematics.Required experience to include: creating data-driven solutions to complex problems in the humanities and social sciences with possible applications throughout other data-intensive academic disciplines. Experience preparing visualizations and user-friendly applications and/or software to navigate and interact with academic research objects. Experience speaking to the frictions that must be navigated and addressed by interdisciplinary teams of technology professionals serving research project needs. Experience as a researcher or working with researchers.Knowledge, Skills and Abilities:The ideal candidate will have strong written, verbal, and interpersonal communication skills with a strong customer service orientation. Must be adept in problem solving, time management and project management and must have organizational and planning skills with attention to detail.Must be a strong teacher and have experience or interest in machine learning approaches including text mining, NLP, image processing, etc. Must be able to remain claim in high-pressure and or demanding situations and tight academic schedules. Must be capable of presenting outcomes of analytic solutions in formats easily understood by non-technical audiences.Working knowledge of common statistical and research applications such as R, R-Studio and statistical analysis software and techniques is required. Professional fluency in several programming languages such as Python, or Java with the ability to learn and to apply new applications and technologies quickly. Working familiarity with modern web development frameworks is required. Physical/Environmental Demands:Bend, Stand, Crawl, Climb, KneelWalk for long distancesReach above shouldersHandle Objects (dexterity)Carry/Lift 25 lbsSit for long periods of timeDeadline to Apply:This position is open until filled.EEO Statement:SMU will not discriminate in any program or activity on the basis of race, color, religion, national origin, sex, age, disability, genetic information, veteran status, sexual orientation, or gender identity and expression. The Executive Director for Access and Equity/Title IX Coordinator is designated to handle inquiries regarding nondiscrimination policies and may be reached at the Perkins Administration Building, Room 204, 6425 Boaz Lane, Dallas, TX 75205, 214-768-3601, accessequity@smu.edu. "}