{"jobID": "2824408730", "jobLocation": "San_Jose_CA", "jobTitle": "Analytics Software Machine Learning Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.fico.com", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 1956", "Type": " Company - Public (FICO) ", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "111000", "jobDescription": " FICO (NYSE: FICO) is a leading global analytics software company, helping businesses in 90+ countries make better decisions. Join our world-class team today and fulfill your career potential! Job SummaryThe Machine Learning Scientist will be a contributor to the FICO Decision Management Platform and FICO Analytic Cloud, and will embark on state-of-the-art, data-driven exploratory analysis as well as predictive models to solve business problems across financial services industry, particularly in the area of Originations and Customer Management. Job Description What will you do in this role? Build and evaluate predictive and decision models to be deployed in production systems, or for research. This includes the analysis of large amounts of historical data, determining suitability for modeling, data clean-up and filtering, pattern identification and variable creation, selection of sampling criteria, generating performance definitions and variables, performing experiments with different types of algorithms and models, analyzing performance, to identify the best algorithms to employ. Design and develop machine learning model Build software components and tools to support model development, and to enable integration and deployment of analytic models into production software and solutions. Design and develop analytic enterprise and cloud software using a variety of languages/platforms to support integration and deployment of analytics products and solutions. May participate in post-implementation and model maintenance support. Develop infrastructure for analytics and analytic software development, automated testing, and release management. Manage projects and meet deadlines, work with other teams within FICO (software, IT, product management, and product support) provide high quality support to enable integration and deployment of analytics software and solutions. May participate in pre-sales support and provide post-implementation support. What do you need to be successful? MS degree in Computer Science, Statistics, Engineering, (PhD preferred) with specialization in Machine Learning. Experience working with Big Data Technologies (ex. Spark) and applying machine learning techniques at large scale with these technologies. Ability to program in Python (full stack) for purposes of model development, API designs, etc Prior experience preparing data for analysis, building predictive models on large scale platforms, and helping to drive innovation into the modeling process/offerings. Knowledge of working with visualization libraries for analytics (JavaScript is a plus) Experience in Java/Scala is a plus Rewards: High performance culture promoting recognition, rewards and professional development Competitive base salary coupled with attractive role-specific incentive plan Comprehensive benefits program Why Make a Move to FICO? At FICO, you can advance your career with a leading organization in one of the fastest-growing fields in technology today Big Data analytics. We have a 50+ year history of excellence in providing analytics and decision management solutions. Here are a few examples of our impact globally: Credit Scoring 150+ billion FICO Scores have been sold to date, making it the most used credit score in the world. Fraud Detection and Security2.5+ billion credit cards globally are protected by FICO fraud systems. Lending 3/4 of US mortgages are approved using the FICO Score. FICOs proven science leverages the latest technology to drive consumer behavior insights and optimize business processes. We help many of the worlds leading banks, insurers, retailers, telecommunications providers and other firms reach a new level of success. Our success is founded on really talented people just like you who enjoy innovative and high-performance environments with the opportunity to grow. Join the FICO Family and help change the way business makes decisions! Learn more about how you can fulfill your potential at www.fico.com/Careers FICO values the strength that diversity and a culture of inclusion bring to our workplace. We are an equal employment opportunity and affirmative action employer and were proud to offer employment and advancement opportunities to all applicants without regard to race, color, ancestry, religion, sex, national origin, pregnancy, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status.SDL2017"}