{"jobID": "2788981102", "jobLocation": "Grand_Rapids_MI", "jobTitle": "Technology Training Specialist", "companyRating": "3.9", "companyInfo": {"Website": "www.bissell.com", "Headquarters": "Grand Rapids, MI", "Size": "501 to 1000 employees", "Founded": " 1876", "Type": " Company - Private", "Industry": " Consumer Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " SHARK, TTI, Dyson"}, "estimatedSalary": "52000", "jobDescription": "Job Title: Technology Training Specialist Job Number:1800103 Job Description:POSITION SUMMARY: The Technology Training Specialist will educate Associates on Information Technology productivity tools and other software systems. The specialist must possess and demonstrate a balance of knowledge in training techniques, trends and facilitation, as well as possessing a solid technical aptitude. Communication skills is a must along with the capability to explain complex subjects in a clear and interesting way. In addition, this role will ensure that any new change initiatives introduced into the organization by IT will achieve quick adoption and ensure efficient understanding. Training objectives will be determined to achieve organizational proficiency to handle new initiatives and projects. This person must have the ability to work independently with limited supervision. POSITION PROFILEWith limited direction, identify and assess training needs for ITS initiatives, programs or systems as they ariseDevelop, organize, conduct and evaluate training programs across the global organizationCreate and conduct surveys to better understand technology training needs of the organization and the effectiveness of the training programsProvide direct support to Associates by teaching basic and foundational skills such as computer applications, IT introductory sessions, voicemail and other IT related solutionsCreate interactive, multimedia presentations as needed to achieve training goalsPlan, organize, and implement a range of training activities as it relates to IT in support of established business goals and priorities.Keep and report data on completed courses; Evaluate training effectiveness and modify based on data.Primary attention to the people aspects of change. Partner with HR Associates to create a structured change management implementation strategy.Identify the most expected and potential points of resistance to change. Assist in the development of counter strategies to reduce the resistance.Create specific change management plans with respect to training and orientation of Associates when new technologies are implemented.Establish parameters to measure the early adoption, effective utilization and proficiency to new change initiatives and provide data on trends and outcomes.Assist with defining and implementing continuous service improvements. Job Requirements:REQUIRED EXPERIENCE/EDUCATION:Degree minimum: B.A. or B.S in computer science or related field from a major university or equivalent work experience. Experience level: 3 to 5 years of hands-on technical training experience. Proven experience as a technology trainerKnowledge of modern training techniques and toolsExcellent organizational and time-management abilitiesExcellent oral and written communications skills requiredStrong customer service orientation requiredAbility to work independently with limited supervisionIn depth knowledge and experience with Microsoft Office.PREFERRED EXPERIENCE/EDUCATION: (i.e. MBA, certifications, etc.)Experience with a variety of learning solutions and teaching techniquesAbility to effectively prioritize and execute tasks in a high-pressure environmentExperience working in a team-oriented, collaborative environmentProject Management skillsOrganizational Change Management"}