{"jobID": "2782612540", "jobLocation": "Santa_Monica_CA", "jobTitle": "Clinical Data Abstractor", "companyRating": null, "companyInfo": {"Website": "www.providenceiscalling.jobs", "Headquarters": "Renton, WA", "Size": "10000+ employees", "Founded": " 1855", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Description:Providence is calling a Full Time, Day Shift Clinical Data Abstractor to Providence John Wayne Cancer Institute Santa Monica, CA.In this position you will:Be responsible for the review and abstraction of melanoma data from Providence Health & Services' electronic medical records system (EMRS) into a research database.Help obtain complete follow-up data through direct patient contact and in some instances, via contact with referring MDs.Report to the Director of Data Management and will work closely with JWCI physicians, data management, nurses and other clinical research staff.Qualifications:Required qualifications for this position include:Must be able to read medical reports in the Electronic Medical Records System ( EMRS ), find required data, such as demographic, diagnostic, treatment and survival information, and enter data into the research database.2 - 3 years experience in reading / interpreting medical records and / or as a cancer registrarKnowledge of medical terminologyKnowledge of clinical research and ability to abstract information from medical records to support research endpointsExcellent oral and written communication and interpersonal skills to effectively correspond with co-workers, physicians, patients, caregivers and other health care professionalsDemonstrated administrative skills and ability to exercise good judgment, initiative and resourcefulness in making decisionsAbility to maintain patient confidentiality and privacy in accordance to hospital policyMust be very detail-orientedProficient in P.C. software applications including Microsoft Word, Excel, PowerPoint, Access, Outlook, etc.Ability to work independently with little supervisionPreferred qualifications for this position include:Bachelor's Degree or commensurate work experienceAbout the hospital you will serve: The John Wayne Cancer Institute at Providence Saint Johns Health Center is a cancer research institute dedicated to the understanding and curing of cancer in order to eliminate patient suffering worldwide. The Institute's mission is accomplished by conducting innovative research focused on biological mechanisms to provide new understandings of the cause, diagnosis, control, and cure of cancer; training the next generation of surgical scientists who study and treat cancer; and researching unique experimental treatment services to rapidly develop and test new forms of diagnosis and therapy in order to improve the quality of life and expected survival of those afflicted with cancer. We offer a full comprehensive range of benefits - see our website for details http://www.providenceiscalling.jobs/rewards-benefits/ Our Mission As people of Providence, we reveal God's love for all, especially the poor and vulnerable, through our compassionate service. About Us Providence Health & Services is the third largest not-for-profit health system in the United States. Providence employs more than 82,000 caregivers (employees) across a five-state area; AK, WA, MT, OR, and CA. Our facilities include 34 hospitals, 600 physician clinics, senior services, supportive housing and other health and educational services. Providence is proud to be an Equal Opportunity Employer. Providence does not discriminate on the basis of race, color, gender, disability, veteran, military status, religion, age, creed, national origin, sexual identity or expression, sexual orientation, marital status, genetic information, or any other basis prohibited by local, state, or federal law. Schedule: Full-time Shift: Day Job Category: Administrative Support (Clinical) Location: California-Santa Monica Req ID: 187660"}