{"jobID": "2807254928", "jobLocation": "Austin_TX", "jobTitle": "Data Analyst - Health and Human Services Data Analysis", "companyRating": "4.3", "companyInfo": {"Website": "www.lbb.state.tx.us", "Headquarters": "Austin, TX", "Size": "201 to 500 employees", "Founded": " 1999", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": " General Information **Minimum salary is listed. Actual salary will be determined based on qualifications and experience.** The Health and Human Services Data Analyst performs ad hoc analysis related to health and human services and assists the manager with administrative and organizational tasks. During legislative sessions, this position will serve as the fiscal note coordinator for health and human services related legislation. Depending upon qualifications, this position may assist in the preparation of health and human services caseload and cost projections.  The position reports to the Health and Human Services Data Analysis Manager and works under moderate supervision, with limited latitude for the use of initiative and independent judgment.  Essential Responsibilities Evaluate the implications of proposed or adopted federal and/or state legislation, rules, or regulations and make applicable recommendations. Assist manager with administrative and organizational tasks. Coordinate the preparation of fiscal notes for health and human services committees. Estimate the fiscal impact of legislation. Coordinate and collaborate with other LBB analysts on budget, performance, and revenue issues, as appropriate. Conduct quality assurance procedures to produce accurate and complete work products. Contribute to agency projects and perform related work assigned. Essential Attributes and SkillsThink critically and use initiative and good judgment. Communicate professionally in writing and orally (including presentations in formal and informal settings). Create timely, relevant, accurate, and polished work products. Attentive to detail and complete tasks with an appropriate level of independence. Use business tools successfully (i.e. Word, Excel, Access, Internet Explorer, email, customized applications, desktop pc, laptop/tablet, and smart phone). Analyze, synthesize, and summarize quantitative and qualitative information. Maintain confidential and sensitive information and follow agency protocols. Understand legislative/budget processes and budget, performance, and operations of assigned agency/topic. Work at a computer and desk for extended periods of time.Attributes Required of Every LBB EmployeeEmbrace agency mission/core values and follow policies, procedures, and processes. Work effectively with LBB management and staff, as well as all external customers. Coordinate, collaborate and employ good interpersonal skills; demonstrate positive outlook. Balance concurrent projects, work under pressure, and adapt to changing priorities/deadlines. Act with motivation, organization, and attention to details; complete tasks with an appropriate level of independence. Be punctual and have regular attendance. Work overtime on nights, weekends, and holidays, as necessary to meet agency deadlines.Education and ExperienceGraduation with a baccalaureate degree from a regionally accredited college or university is required. Course-work or degree in mathematics, statistics, quantitative research, or a related field is preferred. Two years of progressively responsible full-time work experience in a relevant area is preferred. Knowledge of health and human services policy is preferred.Supplemental InformationTo apply for this position, you must initially set up an account and select a Username and Password through Governmentjobs.com. You may apply directly through the posting list on our website or on the Governmentjobs.com website. To set up an account go to https://www.governmentjobs.com/js_login.cfm. Please be sure to write down your Username and Password. Human Resources will not be able to retrieve this information. Only on-line applications will be accepted.    Examples of an applicant's work product and/or copies of transcripts may be required as condition of interview. Finalist may be given a work-related exercise. The person hired may be required to submit official transcripts. Credentials earned at foreign colleges and/or universities must have been evaluated by an acceptable entity and must be equivalent to credentials awarded by U.S. regionally accredited institutions of higher education.  The person hired may not simultaneously be employed by the Legislative Budget Board and another state agency or Texas public institution of public/higher education. Any job offer from the Legislative Budget Board is contingent upon: proof of eligibility/authorization to work in the United States on a full-time basis; and proof of compliance with the Selective Service Law for males between the ages of 18 and 25.  The Legislative Budget Board is an equal opportunity employer and does not discriminate in employment or in the provision of services on the basis of race, color, religion, sex, national origin, age, or disability. Applicants should communicate requests for disability-related accommodations during the application process to LBB Human Resources at email address HR@LBB.state.tx.us."}