{"jobID": "2819941519", "jobLocation": "San_Diego_CA", "jobTitle": "Data Scientist - Novartis \\/ GNF", "companyRating": "3.7", "companyInfo": {"Website": "www.novartis.com", "Headquarters": "Basel, Switzerland", "Size": "10000+ employees", "Founded": " 1996", "Type": " Company - Public (NVS) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "125000", "jobDescription": "Posting TitleData Scientist - Novartis / GNF05-Jun-2018Job ID242856BRJob DescriptionWe are seeking for a Data Scientist with a Ph.D. degree in Computer Science, Statistics, Bioinformatics or related disciplines.The Data Scientist will be working with scientists and other informaticians on developing novel algorithms to analyze histology and cellular images. Qualified candidates must have good programming and data analysis skills. GNF offers a unique environment to apply data science methodologies to large datasets originated from high-throughput drug research platforms, where data scientists help to accelerate the discovery of new medicines. Capable candidates will have many opportunities to study a variety of computational challenges, where solutions typically require the combination of multiple technologies, including bio/chem-informatics and machine/deep learning. The Data Scientist is expected to be an independent researcher, who is skillful in surveying existing literature, hunting solutions online, and conceiving new solutions as needed. It is critical for the candidate to be self-motivated to continuously learn the latest developments in the nascent field of data science and actively explore their potential applications to biomedical problems. The candidate reports to Senior Data Scientist.Minimum requirementsRequired Skills: •Excellent programming skills in Python or R, using Linux as the working platform.•Solid understanding of key machine learning concepts, such as regression and classification, over-fitting, cross-validation, hyper-parameter optimization.•Solid understanding of core statistical concepts, such as the limitations of popular parametric and non-parametric statistical tests.•Good understanding of popular machine learning algorithms, such as clustering algorithms, logistic regression, SVM classifier, etc.•Prior image analysis, bioinformatics, and publication experience is a huge plus.Skills not immediately required:•Big data skills, such as Spark, NoSQL, and Cloud programming. This is not a big data engineering or programming position. The candidate will be trained to gain Cloud experience.•Computer Vision. The candidate who does not have such skills should demonstrate strength in data analysis; he/she is expected to leverage in-house expertise and self-teach the subject within a reasonable time period.Job TypeFull TimeCountryUSA Work LocationSan Diego, CA Functional AreaResearch & Development DivisionNIBR Business UnitGNF Employment TypeRegular Company/Legal EntityNovartis Inst for Fun Gen incEEO StatementThe Novartis Group of Companies are Equal Opportunity Employers and take pride in maintaining a diverse environment. We do not discriminate in recruitment, hiring, training, promotion or any other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, marital or veteran status, disability, or any other legally protected status."}