{"jobID": "2837411600", "jobLocation": "Irving_TX", "jobTitle": "Business Intelligence Analyst", "companyRating": null, "companyInfo": {"Website": "www.uworld.com", "Headquarters": "Irving, TX", "Size": "51 to 200 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Salary at 70-75K POSITION SUMMARY UWorld is the worldwide leader in online test prep practice question banks. Since 2003, over a million students have trusted us to help them prepare for their high-stakes examinations.  UWorld is seeking a Data Analyst to closely collaborate with our Marketing and Software teams in creating cross-discipline data solutions to inform business insights and strategies. The analyst will play a critical role in designing and developing techniques, metrics, and dashboards which will shape our products. QUALIFICATIONSMinimum Education RequiredBachelors Degree in Marketing, Mathematics, Economics, Computer Science, Information Management, Statistics; Masters preferred Minimum Experience Required2 years of experience with SQL server2 years of experiencein developing business analytics solutionswith data visualization tools such as Tableau, Qliksense, or Domowith digital marketing analytics, as well as user behavior analyticsWell-versed in multiple computer languages (C# or Java preferred)Proficiency in Microsoft Office products (particularly Excel and PowerPoint) Preferred ExperienceExperience using advanced statistical software such as SAS, MATLAB, R Studio, or other equivalent statistical software preferredExperience with price point analysis preferred Required Knowledge, Skills & AbilitiesStrong mathematical background and knowledge in at least one of the following fields: statistics, data mining, predictive modeling, operations research, econometrics, and/or information retrievalExtensive knowledge of algorithms and data structuresExcellent written and verbal communication skillsAnalytical skills, with the ability to draw conclusions using various resourcesAbility to work independently and as part of a teamMeticulous attention to detail, and strong work ethicJOB DUTIES (including but not limited to): Data Analysis and Gathering (70%)Develop techniques, metrics, and dashboards using efficient algorithms and data structures to influence business insights and strategiesAssist in the writing, editing and publication of periodic market analysis and development reportsDeliver insights from structured, semi-structured, and unstructured datasetsAnalyze data analysis requests obtained from management to conceptualize and define operational problemsDefine data modeling requirements, validation of content, and problem solving parametersIdentify opportunities to develop new strategies and improve business performanceUtilize mathematical modeling and other optimization methods to perform quantitative and qualitative data analysisDevelop and maintain processes for gathering and processing data for recurrent analytical requirementsReview and analyze market trends to develop price models and provide insight on impact of price changes on growth rates and profitability Collaboration (20%)Work closely in cross functional teams to meet their data or analytics needsCommunicate and present data to management by developing reports Research (10%)Stay up-to-date with the latest analytical tools and predictive modelsIdentify and troubleshoot data integration and validation issues  UWorld is an equal opportunity employer of all qualified persons. The Company does not discriminate on the basis of race, color, national origin, gender, handicap or disability, or age in any of its policies, procedures, or practices in compliance with Title VI of the Civil Rights Act of 1964 (pertaining to race, color, and national origin), Section 504 of the Rehabilitation Act of 1973 (pertaining to handicap), and the Age Discrimination Act of 1975 (pertaining to age). This non-discriminatory policy covers hiring and employment at the Company."}