{"jobID": "2683584300", "jobLocation": "Santa_Monica_CA", "jobTitle": "Data Scientist", "companyRating": "4.5", "companyInfo": {"Website": "www.tala.co", "Headquarters": "Santa Monica, CA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "106000", "jobDescription": " We are looking for a Data Scientist interested in solving one of the world's largest problems: financial inclusion. Our team is doing cutting edge work in the field of Data Science and Machine Learning, using unique data to give people in emerging markets access to something that theyve never had before - credit. Our Data Scientists work directly with Credit, Engineering, and Data Analytics teams to develop and iterate models that promote our vision of financial access for a billion people in emerging markets around the world.  We leverage a unique, diverse, and deep data set, including text, network analysis, and image recognition. Youll be surprised by the connections between our different data sources! Our Data Scientist are tasked with finding and communicating these connections to the team while integrating them into various models. If you are motivated to change the world through financial freedom and love working with people and data to achieve this mission, we want you here at Tala. Responsibilities:Leverage a unique, diverse, and deep data set to find connections across these data sources. Communicate findings to the team and integrate them into models.Own the full-cycle of a model from ideation and training through deployment into our production environment. This might be a credit model, fraud model, marketing model, or an iteration of an existing model.Monitor model performance once deployed and iterate rapidly if necessary.Contribute and share your findings and knowledge of data science and other modeling with all appropriate cross-functional teams.Partner with the Engineering team to develop, test and deploy models.Pull data from MySQL or other data stores, handling all the ETL from the DB to running the model to obtaining a decision.Requirements:2+ years of experience in a data science role or equivalent positionMasters or PhD in a quantitative fieldFluent in Python and packages related to machine learningExperience with maintaining data science models in a production environmentPreferred Skills & Experience:Experience in building fraud, credit, or risk modelsExpertise in NLP, network analysis, or geospatial analysisA Successful Candidate is (a/an):Problem Solver: You thrive on finding novel solutions to hard problems. These problems may have ranged from extracting a new dataset from an unexpected source, to building cohorts for customer retention analysis, or the NY Times Saturday crossword.Problem Solver: You thrive on finding novel solutions to hard problems. These problems may have ranged from extracting a new dataset from an unexpected source, to building cohorts for customer retention analysis, or the NY Times Saturday crossword.Communicator and Listener: You thrive on finding novel solutions to hard problems. These problems may have ranged from extracting a new dataset from an unexpected source, to building cohorts for customer retention analysis, or the NY Times Saturday crossword.You know your stuff is complicated, but can you communicate complex ideas to others in a manner that is easily understood and digestible? Can you collaborate well with your peers in growth/portfolio/customer experience? There is a large research component to the job, and this research needs to be effectively shared with the rest of the company.Independent Learner: We encounter new problems that arent in textbooks. You have the ability to learn on your own about new concepts and techniques.Curious: You arent content until you understand why the features you have built have the explanatory power they do, and why they arent just a spurious correlation.Opinionated (but Open-Minded): We are looking for someone to add diversity of thought to our current ensemble of data scientists.Teammate/Partner: Trust in your team and putting the team and mission above individual highlights (with an understanding that the collection of individual highlights and performance makes the team work).ABOUT TALA Tala is the leading mobile technology and data science company committed to financial inclusion globally. More than 1.3 million people have borrowed through Talas smartphone app, which provides instant credit scoring, lending, and other personalized financial services in emerging markets. Tala has raised more than $105 million from leading venture and impact investors including Revolution, IVP, Ribbit Capital, Data Collective, and Lowercase Capital. Talas global team is headquartered in Santa Monica, with additional offices in Nairobi, Manila, Dar Es Salaam, Mexico City, Mumbai, and Bangalore."}