{"jobID": "2816419094", "jobLocation": "Los_Angeles_CA", "jobTitle": "Senior Data Engineer", "companyRating": "4.0", "companyInfo": {"Website": "www.servicetitan.com", "Headquarters": "Glendale, CA", "Size": "201 to 500 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " FieldAware, FieldEdge, SuccessWare"}, "estimatedSalary": "168000", "jobDescription": "Senior Data Engineer ServiceTitan is looking for a Senior Data Engineer to join our data team. Strong candidates will have solid command of the SQL, ETL operations, and SSIS packages in addition to very strong analytical and critical thinking skills. The most critical portion of the role is deconstructing and re-interpreting databases from other software to translate them into our database. It also includes support of existing, and development of new automated import methods. The candidate will work closely with cross departmental resources to ensure on time delivery of transferred data for customers adoption of ServiceTitan.  Our Senior Data Engineers receive projects and deadlines from several departments. The ability to own tasks, clearly communicate requirements, delays, completion and prioritize a constantly shifting schedule of deadlines is paramount.  This work is highly critical to successfully building our company. It is the lynchpin of the sales and onboarding process. Data concerns are a blocker for most of our customers, so delivering high quality, highly accurate transfers is absolutely crucial and greatly appreciated by both our customers and our company. What you'll doManage a wide variety of tasks with shifting priorities and tight deadlinesClearly communicate project status and updates with the onboarding team in a timely manner for successful delivery.Find and employ methods for transferring sources of data we have not previously encounteredEvaluate and understand database structures then interpret them into our modelWrite queries to correct, reformat or move dataUpdate and maintain a repository of useful scriptsWhat you'll need5 or more years of experience with SQL Server 2008/2012/2014/2016Advanced knowledge and experience in T-SQLExperience with complex ETL tools and operations.Experience with SQL Server Integration Services (SSIS).Good understanding of database and data model conceptsExperience in C# or Java is a plusStrong analytical and critical thinking skills.Able to identify relationships within databases and make infer the developers intent based on structure and valuesStrong communication skillsAbility to work effectively within a team environment with tight deadlines and high expectationsAbout ServiceTitan ServiceTitan is a mobile, cloud-based software platform that helps home services companies streamline operations, improve customer service, and grow their business. ServiceTitan's end-to-end solution for the multi-billion dollar residential home services industry includes CRM, intelligent dispatch, custom reporting, marketing automation, mobile solution for field techs, and accounting integration with Intacct and QuickBooks. ServiceTitan brings a fully operational modern SaaS infrastructure to an industry traditionally underserved by software. ServiceTitan is the preferred software for hundreds of the world's most successful plumbing, HVAC, and electrical companies. For more information about ServiceTitan, visit www.ServiceTitan.com.  Los Angeles Business Journal Top 100 Fastest Growing Private Company for 2017  Inc. 5000 Americas Fastest Growing Companies 2017  Forbes - Next Billion-Dollar Startup List 2017"}