{"jobID": "2822944640", "jobLocation": "Fort_Sam_Houston_TX", "jobTitle": "Vision Scientist", "companyRating": null, "companyInfo": {"Website": "www.engilitycorp.com", "Headquarters": "Chantilly, VA", "Size": "10000+ employees", "Founded": " 2012", "Type": " Company - Public (EGL) ", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About Engility: Engility delivers innovative solutions to critical challenges facing the nation and the world. As a premier provider of integrated services for the U.S. government, we support the Department of Defense, intelligence community, space communities, federal civilian agencies and international customers. Engility is dedicated to making lives better, safer and more secure. Description: Engility is seeking a highly motivated and organized vision scientist to join our team of psychologists, biologists, optometrists, engineers, and physicists that conducts basic and applied research related to laser visual effects and laser protection technologies in the military environment. In particular, the successful candidate will participate in all phases of research involving human subjects from experimental design to statistical analysis and report preparation and serve in roles ranging from associate to principle investigator. Qualifications:The candidate should possess a thorough understanding of the human visual system as would be gained through a recent PhD in experimental psychology, cognitive neuroscience, visual neuroscience or a related discipline.Technical skills and prior research experience in visual psychophysics is required, with knowledge of glare research, and color vision being particularly beneficial.A background in statistical analysis of behavioral data and a practical knowledge of preparing and executing human subjects' research protocols are also required and coding experience is preferred.This position also requires an individual who has excellent verbal and written communications skills, is able to work independently as a Principal Investigator or as a leader of a research team, and can communicate complex research findings in both written and verbal forms in a logical manner.It will be a permanent full-time salaried position based at the Air Force Research Lab, JBSA Fort Sam Houston, TX.The candidate must be a US citizen, and capable of obtaining and maintaining a Secret security clearance.Desired Qualifications:EEO Statement: Engility Corporation is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action employer, making decisions without regard to race, color, religion, creed, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. U.S. citizenship is required for most positions. For our complete EEO/AA and Pay Transparency statements, please click here ."}