{"jobID": "2372955169", "jobLocation": "Chicago_IL", "jobTitle": "GEAR UP Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.cps.edu", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1883", "Type": " School / School District", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "67000", "jobDescription": "This is an opportunity to build and manage critical tools, processes and systems that will support the ongoing success of the GEAR UP Program within the Chicago Public Schools. The GEAR UP Data Analyst will conduct analyses in order to inform day-to-day practice, drive strategy and policy, and to monitor key program and student outcomes. The Data Analyst will serve as the internal lead on accessing key CPS data systems and will be responsible for filling on-demand data requests to fulfill GEAR UP performance requirements. In addition, the GEAR UP Data Analyst will lead and support a diverse array of projects, including developing a continuous improvement strategy for new programs; developing both diagnostic and early action tools that connect to interventions directly targeting students, teachers, programs, and schools; and, establishing a formal, repeatable, outcomes-based approach for evaluating the GEAR UP Program. The Data Analyst will also inform effective practices, project management and data analysis support for ongoing operations within the department.GEAR UP Data Analyst’s Responsibilities:Have responsibility for monitoring and reporting GEAR UP students’ outcomes. Collaborate with internal program staff around all analysis activities. Analyze and visualize data on a project basis to enhance understanding of and usage by key stakeholders.Work formatively with internal management around development of appropriate analysis questions and meaningful performance indicators.Engage in capacity building with internal staff around using data to inform practice and strategy.Analyze CPS and 3rd party student-level data, handle data requests and special analyses, and provide data and reports to external partners.Develop processes to systematically collect, archive, and report data. Assist in determining key future analyses and metrics based on findings from external research, literature reviews, and collaboration with external partners.Prepare and disseminate analysis reports, briefs, and presentations; communicate results meaningfully to various audiences both internal and external. Qualifications for Job: Skills: Ability to conduct multiple projects concurrently, both independently and as a member of a team.Ability to work in a fast-paced environment, respond immediately to multiple constituencies, and meet established deadlines. Ability to communicate analysis findings, both written and orally, to a broad range of audiences including field staff, internal management, senior leadership, funders, and researchers. Excellent communication skills essential. Knowledge of educational research and urban educational systems beneficial. Proficiency in ANSI SQL required.Proficiency in Microsoft Office Suite required. Experience in SAS required.Experience with Microsoft Transaction-SQL, ASP.NET, and Access reporting strongly preferredType of Education: Required: Bachelors degree in social sciences, economics, public policy, information technology, or related field.Preferred: Masters degree.Type of Experience and Number of Years: Required: 2-4 years experience developing and conducting data analysis and reporting. Preferred: Experience in a large organization, driving complex analyses. "}