{"jobID": "2825145035", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Modeler (Analytic Consultant 4)", "companyRating": "3.5", "companyInfo": {"Website": "www.wellsfargo.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1852", "Type": " Company - Public (WFC) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "121000", "jobDescription": "Job DescriptionAt Wells Fargo, we want to satisfy our customers financial needs and help them succeed financially. Were looking for talented people who will put our customers at the center of everything we do. Join our diverse and inclusive team where youll feel valued and inspired to contribute your unique skills and experience. Enterprise Finance & Information Technology offers technology and services that exceed Wells Fargo customers expectations and directly enable them to succeed financially. We interact with customers more than 12 billion times a year through in-store, online, ATM, and telephone transactions. We impact customers directly, through systems availability and security, as well as indirectly, through our business partners who offer and deliver a myriad of products and services that meet customers financial needs. We provide a competitive advantage for the company through excellence in fundamentals, integrated partnerships, and our talented and engaged team members.  IT for IT Authorized Provisioning Point (APP) Application team is seeking a Data Modeler . IT for IT Authorized Provisioning Point (APP) Application team is responsible for driving the design and development of the new IT for IT APP in collaboration and alignment with the Enterprise Data Blueprint architecture. The intention of the IT for IT APP is to provide increased consistency, quality, and insight in the information available to manage the business of IT. Through the Enterprise Blueprint architecture, the APP is implementing leading tools and principles in data warehousing to deliver an effective and efficient solution that simplifies the data environment. The IT for IT APP Application team is part of IT for IT Data Services team which is responsible for driving both near-term data to satisfy regulatory requirements while strategically creating the IT for IT APP.  The person that fills this position will be a vital part of our team and will be responsible for translating complex business and data requirements into logical data models adhering to defined data Modeling standards and industry best practice.  This position will: Translate business and data requirements into logical data models adhering to defined data Modelling standards and industry best practices.Consult with Database Administrators to translate Logical Models into a performant Physical modelsConsult with other Modelers to rapidly integrate complex data sources into existing and new data models. Ensuring proper implementation and utilization of the data structures.Provide guidance to data analysts in performance of analytic and data quality functions. Support analysis and profiling of the most complex data needs.Consult with our Business Partners to understanding their business needs and recommend solutions. Translate complex technical concepts into something digestible by our business partners.Build relationships with Subject Matter Expert (SME)s of the respective source system development teams.Assist in defining strategy in areas such as Data Integration, Architecture, Data Quality, Meta data Management and Master Data Management.Act in a consulting capacity to the development team. Utilizing their extensive knowledge of the application they will understand functional enhancements, consider all potential impact and provide advice on the most appropriate solutions & potential problems.Responsible for very complex partner assignments to identify and define strategic business issues that require analyses and translates this information into insight, knowledge and understanding of the business and the industry.Consults and performs very complex analyses/ analysis design involving data mining from multiple sources and/or predictive modeling, regression/multivariate, financial, comparative analysis, customer/demographic analysis, etc.Analytics involved generally span multiple functional areas/business lines/data sources.Responsibilities also include: identifying opportunities for additional statistical models and/or creating sophisticated computer modeling approaches to analyze and forecast business performance; participating in and/or leading management information capabilities development work; Interpreting and presenting results of analyses and recommendations to senior management.Ensures adherence to data management/data governance regulations and policies.Data involved may be very large, structured or unstructured, and from multiple sources.To a certain degree, may be involved directly or indirectly in the technical build-out and/or support of databases, query tools, reporting tools, BI tools, dashboards, etc. that enable analysis, modeling, and/or data visualization.Leads project/virtual teams & mentors lower level staff. Multiple locations are available for this position. Remote work may be an option for those candidates that have Telecommuting experience.Required Qualifications6+ years of experience in one or a combination of the following: reporting, analytics, or modeling; or a Masters degree or higher in a quantitative field such as applied math, statistics, engineering, physics, accounting, finance, economics, econometrics, computer sciences, or business/social and behavioral sciences with a quantitative emphasis and 4+ years of experience in one or a combination of the following: reporting, analytics, or modeling3 + years of experience working with large data sets6+ years of analytics experience6+ years of data modeling experience6+ years of SQL experience5+ years of Big Data experience5+ years of experience one or a combination of the following: reporting, analytics, or modeling in an information security environment, information technology environment, or a combination of both5+ years of Metadata experience5+ years of source/version control tools experience5+ years of SDLC (System Development Life Cycle) experience5 + years of experience troubleshooting environments across the entire architecture (i.e. applications to infrastructure)Desired QualificationsExtensive knowledge and understanding of research and analysisStrong analytical skills with high attention to detail and accuracyExcellent verbal, written, and interpersonal communication skills5+ years of data analysis experience5+ years of data management experience5+ years of ETL (Extract, Transform, Load) Programming experience3+ years of Ab Initio experience3+ years of Hadoop experienceAbility to develop operational reporting and performing complex data analysisKnowledge and understanding of conversions, system analysis, data mapping, conversion reconcilement, validation and implementationsAbility to independently provide summary and recommendations on operational dataKnowledge and understanding of technical leadership including operations projects for complex development or high architectural impact projectsKnowledge and understanding of data modeling tools, such as Power DesignerKnowledge and understanding of data organizing or structuring complex data across varied data sourcesKnowledge and understanding of data requirements management, modeling, or analysisKnowledge and understanding of data warehouse analysisKnowledge and understanding of data warehouse application design and developmentKnowledge and understanding of database architecture, design, and supportKnowledge and understanding of database design/modeling logical and physicalKnowledge and understanding of database management, reporting, and analysis functionsKnowledge and understanding of database troubleshootingKnowledge and understanding of database views design and useKnowledge and understanding of databases and data mining techniquesExperience conducting root cause analysis for data-driven process-related improvementsKnowledge and understanding of asset management function supportAbility to negotiate, influence, and collaborate to build successful relationshipsA BS/BA degree or higher in information technologyA Master's degree or higher in a quantitative disciplineOther Desired Qualifications6+ years of Oracle experience (Oracle 10/11G/12C)5+ years of experience with Oracle Exadata3+ years of agile software development techniquesWells Fargo analytic consultant experience.DisclaimerAll offers for employment with Wells Fargo are contingent upon the candidate having successfully completed a criminal background check. Wells Fargo will consider qualified candidates with criminal histories in a manner consistent with the requirements of applicable local, state and Federal law, including Section 19 of the Federal Deposit Insurance Act.  Relevant military experience is considered for veterans and transitioning service men and women.  Wells Fargo is an Affirmative Action and Equal Opportunity Employer, Minority/Female/Disabled/Veteran/Gender Identity/Sexual Orientation."}