{"jobID": "2808384363", "jobLocation": "Chicago_IL", "jobTitle": "Data Engineer", "companyRating": "3.8", "companyInfo": {"Website": "www.abbvie.com", "Headquarters": "North Chicago, IL", "Size": "10000+ employees", "Founded": " 2013", "Type": " Company - Public (ABBV) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amgen, Baxter, Bristol-Myers Squibb"}, "estimatedSalary": "93000", "jobDescription": "For large enterprise datasets, the data engineer is responsible for curating content to support key business initiatives, working primarily with data scientist and data analysts across functional disciplines. Participants in the acquisition, cataloging, and harmonization of information aligned with the needs of business stakeholders. Supports data consumers in understanding information context, generating fit for purpose datasets, and effectively utilizing advance analytic tools.  　Key Responsibilities Include:Planning, building and running enterprise class information management solutions across a variety of technologies (e.g. big data, master data, data profiling, batch processing, and data indexing technologies, ).Establishing advance search solutions that include synonym, inference and faceted searching.Ensuring appropriate security and compliance policies are followed for information access and dissemination.Defining and applying information quality and consistency business rules throughout the data processing lifecycle.Collaborating with information providers to ensure quality data updates are processed in a timely fashion.Enforcing and expanding use of AbbVie Common Data Model and industry standard information descriptions (ontologies, taxonomies, vocabularies, lexicons, dictionaries, thesaurasus, glossaries etc…)Managing the information portal and its customer-facing resources (data catalog, data portal, etc…)Basic:Bachelor’s Degree with 10+ years of related work experience and a strong understanding of specified functional area. Degree in Computer Science or related discipline preferred. Advanced degree preferred.At least 10 years experience in a several data processing roles such as database developer/administrator, ETL developer, data analyst, BI analytics developer, and/or solution developer of contextual search applications.Experience with Informatica tools (PowerCenter, Big Data Management, Master Data Management), Cloudera CDH and ecosystem tools (SOLR, Spark, Impala, Hive, Hue, etc…), MarkLogic, SAS Analytics, python, R and Amazon Web Services preferred.Equal Opportunity Employer Minorities/Women/Veterans/Disabled"}