{"jobID": "2759756160", "jobLocation": "Hamilton_NJ", "jobTitle": "Environmental Scientist / Geologist / Engineer", "companyRating": "3.1", "companyInfo": {"Website": "www.woodplc.com", "Headquarters": "Aberdeen, United Kingdom", "Size": "10000+ employees", "Founded": " 1848", "Type": " Company - Public", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "56000", "jobDescription": " Wood Environment & Infrastructure Solutions is currently seeking an Environmental Scientist / Geologist / Engineer to join our team in Hamilton, NJ.  Are you a Scientist, Geologist or Engineer with 0 to 4 years of environmental experience? Are you looking for an opportunity to work with Senior Staff on a variety of technically challenging environmental projects? Are you looking for an opportunity to work with an established environmental consulting firm that values its employee's enthusiasm and technical contributions? We encourage you to apply for this opportunity. We are dedicated to providing the atmosphere to allow individuals to grow their career. Key ResponsibilitiesThis individual will be approximately 80% in the field on industrial sites and 20% in the officeWill work under the supervision of a Principal ScientistField activities include soil borings, groundwater monitoring well installations and collecting soil, groundwater, surface water and sediment samples as well as documenting field activitiesField activities may also include oversight of remediation subcontractors during remediation activities including pilot studies and remediation system installationActs as a data gatherer; prepares maps, charts; runs simple computer programsPerforms field testing; uses equipment and instrumentationInterprets data and test results, with experience and may write complete reportsPrepares field reports, internal correspondence, sections of formal reportsFollows company safety standards, site safety standards and provides all required permittingContacts vendors; researches literature and regulatory requirements; prepares draft designsConducts engineering or scientific calculations; coordinates geometry; performs minimal design work, preliminary analysis and layoutWill travel to project sites primarily throughout New Jersey, Some sites located in adjoining states (PA, NY) and may require occasional overnight travel and company field vehicles are provided for field workRequiredBS or MS in Environmental Science, Geology, Environmental Engineering or related technical field0 to 4 years environmental experienceEIT for engineers preferredMust be a self starter with excellent written and verbal communication skillsStrong computer skills for database work and proficiency in MS OfficeFlexible to work outside normal business hours as requiredWillingness to travel to project sites in the New Jersey, New York and Pennsylvania area. Approximately 10% overnight travelMust pass drug test, physical, background check and must have a satisfactory driving record in accordance with the company's driving (MVR) policyPreferredOSHA 40 hour certificationPhysical DemandsField activities may require working in unfavorable weather conditionsField activities may require working in specialized protective equipment supplied by employer. Candidate must be physically capable of performing tasks in such equipmentWill lift equipment and carry laboratory samples which requires the ability to lift 40 pounds Wood is a global leader in the delivery of project, engineering and technical services to energy and industrial markets. We operate in more than 60 countries, employing around 55,000 people, with revenues of around $10 billion. We provide performance driven solutions throughout the asset life cycle, from concept to decommissioning across a broad range of industrial markets including the upstream, midstream and downstream oil & gas, power & process, environment and infrastructure, clean energy, mining, nuclear and general industrial sectors. We strive to be the best technical services company to work with, work for and invest in. www.woodplc.com  We are an equal opportunity employer that recognises the value of a diverse workforce. All suitably qualified applicants will receive consideration for employment on the basis of objective criteria and without regard to the following (which is a non-exhaustive list): race, colour, age, religion, gender, national origin, disability, sexual orientation, gender identity, protected veteran status, or other characteristics in accordance with the relevant governing laws."}