{"jobID": "2796804893", "jobLocation": "Alma_MI", "jobTitle": "Medical Office Nurse I RN", "companyRating": "3.6", "companyInfo": {"Website": "www.midmichigan.org", "Headquarters": "Midland, MI", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Covenant HealthCare, McLaren Health Care, Spectrum Health"}, "estimatedSalary": "25", "jobDescription": "Position InformationFTE: 0.500000Exempt: NoAny Shift: 20 Hrs/Wk; 40 Hrs/PayWeekend & Holiday Rotation: Per schedulePay Grade: 12Position SummaryUnder direct supervision of the provider, will be responsible for patient assessment and care, and maintaining appropriate documentation. This position must have basic knowledge of specialty and/or primary care and able to assess, plan, implement and evaluate care for patients. This position is responsible for coordinating care to assure high quality, compassionate patient care is provided. They will maintain and oversee patients at the office locations and will act as the liaison with other organizations and departments. This position may be required to order all medical, pharmacy supplies, and office supplies to manage patient care. They will assure compliance with all the policies/procedures of MidMichigan Health and follow Occupational Safety and Health Administration (OSHA) guidelines, Clinical Laboratory Improvement Amendments (CLIA) regulations, and all appropriate regulatory agencies. They will coordinate with and train any new employees, students and float staff as required. The clinical person will provide patient education, assist with specialty care modalities, symptom management, be available for emergencies, monitor for compliance and the effects of care management with high risk patients, educate on prescriptions and teach the patient and family the reasons for the medication and side effects, coordinate and ensure continuity of care with other providers. Also, may perform general office duties (keyboarding, filing, telephone, computer and office equipment) as needed. The expectations outlined in this job description may vary slightly depending on the practice in which you are assigned. Your immediate supervisor will be able to clarify your responsibilities for you.ResponsibilitiesESSENTIAL DUTIES AND RESPONSIBILITIES:(20%)* Triages all calls, schedules daily urgent/emergent add-ons, receives and relays test results, processes medication refills, supports, directs and refers patients for consults and/or testing and insurance pre-certification and documentation.(20%)* Provides complete patient assessment within their scope of their licensure.Greets patients and/or family, performs routine pre-examination procedures including vital signs, assessing and recording objective and subjective data concerning presenting condition. Updates and maintains an accurate patient record by performing but not limited to, orders reconciliation, secure messaging (if available) and other tasks as assigned. Performs medication reconciliation, enters allergy reaction type, processes refills within the scope of their certification. (20%)* Coordinates the care team with the care indicated by the provider, and works with the patient and families with the disease process and/or care management.(20%)* Assists provider with examinations and procedures.(20%)* Prepares and cleans the patient area, sets up equipment, cleans and facilitates room set up after a procedure. Disposes of contaminated supplies and sterilizes medical instruments.OTHER DUTIES AND RESPONSIBILITIES:Demonstrates critical thinking for patient management.Provides for the age specific needs of the population served according to standards and policies/procedures as evidenced by observation, documentation and peer feedback. Maintains medical supplies to assure consistent supply levels to meet the needs of the patients. Understands necessary computer functions in the office setting: Michigan Automated Prescription System (MAPS), Michigan Care Improvement Registry (MCIR), Practice Management, Electronic Medical Records, Laboratory information system (LIS), Emageon, dictation systems, and any other necessary programs to assist providers and staff. If applicable, maybe required to travel to satellite clinics. Maintains a system for accurately documenting and coding in the medical record as appropriate per policy. Participate in annual review for quality and completeness as necessary.Management of the patient symptoms as directed by the provider.Coordinates and ensure continuity of care with other providers.MidMichigan Health is a technology driven organization and employees need to demonstrate Competency in Microsoft® Windows. Employees may be required to participate in further learning opportunities offered by MidMichigan Health.QualificationsEDUCATION:Essential:* Associates Degree* NursingCREDENTIALS:Essential:* Basic Life Support* Registered Nurse * State of Michigan LicensureCREDENTIAL EQUIVALENT EXPERIENCE: Essential:* BLS required within one month of hire or transfer date. EXPERIENCE, TRAINING AND SKILLSKnowledge of nursing technique as normally acquired through the completion of an RN program.Working knowledge of the organization’s Infor, Electronic Medical Records, and Practice Management programs preferred or knowledge of similar software. PC software knowledge must include: Excel and Word.Knowledge of medical office policies, practices and procedures as normally acquired through three to five years working in the health care system or similar setting.Excellent interpersonal skills needed to communicate successfully with individuals and interact with people at all levels to communicate concepts in a clear and understandable manner.Mandatory Occupational Safety and Health Administration (OSHA) training must be done annually.Physical/Mental Requirements and Working ConditionsExposure to stressful situations, including those involving public contact, as well as, trauma, grief and death. Able to wear personal protective equipment that includes latex materials or appropriate substitute if required for your position.Is able to move freely about facility with or without an assisted device and must be able to perform the functions of the job as outlined in the job description. Overall vision and hearing is necessary with or without assisted device(s).Frequently required to sit/stand/walk for long periods of time. May require frequent postural changes such as stooping, kneeling or crouching. Some exposure to blood borne pathogens and other potentially infectious material. Must follow MidMichigan Health bloodborne pathogen and TB testing as required. Ability to handle multiple tasks, get along with others, work independently, regular and predictable attendance and ability to stay awake.Overall dexterity is required including handling, reaching, grasping, fingering and feeling. May require repetition of these movements on a regular to frequent basis. Physical Demand Level: Light. Must be able to occasionally (0-33% of the workday) lift or carry 11-20 lbs., frequently (34-66% of the workday) 10 lbs. and or Walk/Stand/Push/Pull of Arm/Leg controls.Apply!"}