{"jobID": "2690454282", "jobLocation": "Mountain_View_CA", "jobTitle": "AI Research Scientist Natural Language Processing", "companyRating": "2.6", "companyInfo": {"Website": "www.sra.samsung.com", "Headquarters": "Mountain View, CA", "Size": "1001 to 5000 employees", "Founded": " 1988", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Sony, LG Electronics, Nokia"}, "estimatedSalary": "150000", "jobDescription": "AI Research Scientist Natural Language ProcessingLocation: Mountain View, CA General Description: The AI research team at Samsung Research America (SRA), located in Mountain View, CA, is looking for an outstanding and highly self-motivated research scientist. We are looking for candidates with expertise in deep learning, computer vision, robotics and language understanding.  You will work with a team of research scientists and engineers tackling real-world problems involving Samsungs Artificial Intelligence initiatives. You can also have the opportunity to publish at top-tier conferences in deep learning, computer vision, robotics, and language understanding. As a research scientist, you will be involved in very promising team projects with talented people at Samsung. You will benefit a lot by working in a fun and creative environment. The AI research center is a key part of Samsungs global R&D; effort and aims to have influence on future Samsung products reaching hundreds of millions of users worldwide. Position Summary: We are looking for candidates interested in extending our capabilities on cross-lingual NLP and enabling novel NLP technologies. The ideal candidate will have a strong background in NLP systems, a strong knowledge of machine learning and deep learning, and have experience working with massive amounts of data. They should also have strong software engineering skills. Responsibilities Include: Conduct advanced research for Natural Language Processing (NLP) technologies  Collaborate with other colleagues to apply research results to prototypes and real-world applications of text mining and question answering and improve the performance with various technologies  Integrate the resulting system/software into existing platform with high quality implementation  Summarize research findings in high-quality paper and/or patent submissions Experience Requirements:Ph.D. in Computer Science or related field, or Masters with 2+ years experience in CS or related field.Strong R&D; experience in natural language processing, machine learning and related fieldsStrong R&D; experience in information extraction and text mining technologiesHands-on experience of deep learning technologies and familiar with state-of-the-art deep learning toolkitsStrong programming skills (C++, Python, Java, etc)Strong research and problem solving skillsGood communication and team-working skillsExperience Preferred:Hands-on experience on natural language understanding for human machine interaction systemHands-on experience on question answering system developmentHands-on experience in building Natural Language Processing and deep learning technologies from research to proof of concept Samsung is an EEO/Veterans/Disabled/LGBT employer. We welcome and encourage diversity as we strive to create an inclusive workplace."}