{"jobID": "2798784297", "jobLocation": "Ann_Arbor_MI", "jobTitle": "Postdoctoral Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.caymanchem.com", "Headquarters": "Ann Arbor, MI", "Size": "201 to 500 employees", "Founded": " 1980", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "53000", "jobDescription": " Cayman Chemical Company is a biomedical research company based in Ann Arbor, Michigan. Cayman helps make research possible by supplying scientists worldwide with biochemical tools used to understand cancer, neurochemistry, oxidative injury, endocrinology, atherosclerosis, and other human health challenges. We specialize in assay kits for the measurement of hormones and bio-markers. In addition, Cayman offers a broad range of specialty biochemicals used as research reagents and qualified standards. Cayman performs generic drug development and production in both Ann Arbor, Michigan and Neratovice, Czech Republic.  We are currently seeking candidates for a Postdoctoral Scientist with the key duties and skills listed below: Experience:Strong knowledge of molecular and cell biology. Demonstrated hands-on experience in mammalian cell culture.Good understanding of the drug discovery and development processes. General understanding of Structure-Activity Relationship (SAR)Experience in developing, optimizing and performing biochemical and cell-based assays involving multiple signaling pathways.Strong oral and written communication skills. Able to work in multidisciplinary teams across several Departments and Divisions.Able to think critically, analyze complex data, perform under pressure to meet deadlines.Carries out binding and activity primary screening of drug candidate in multiple biochemical and cell-based assays.Performs dose-response analysis of compounds and determines relevant constants: Kd, Ki, IC50, EC50, etc.Validates results with counter-screens.Examines in vitro drug metabolism and toxicity using several assays.Determines mRNA and protein levels.Prepares weekly reports and/or presentations.May prepare scientific papers for publication and/or presentation, attend scientific meetings, and assist the director in preparation of grant applications.May supervise interns.Physical Aspects:Lifting, standing, travel, etc."}