{"jobID": "2837777875", "jobLocation": "Dallas_TX", "jobTitle": "Research Scientist - Children's Research Institute -", "companyRating": "3.8", "companyInfo": {"Website": "jobs.utsouthwestern.edu", "Headquarters": "Dallas, TX", "Size": "10000+ employees", "Founded": " 1943", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Baylor Scott & White Health, HCA Healthcare, Parkland Health & Hospital System"}, "estimatedSalary": "47000", "jobDescription": " SecurityThis position is security-sensitive and subject to Texas Education Code 51.215, which authorizes UT Southwestern to obtain criminal history record information SalarySalary Negotiable Experience and EducationPh.D. degree with major coursework in field of assignment and five (5) years research experience in field of assignment, including at least two (2) years at level of Senior Research Associate or equivalent.  Master's degree with major coursework in field of assignment and seven (7) years research experience in field of assignment, including at least three (3) years at level of Senior Research Associate or equivalent.  Bachelor's degree with major coursework in field of assignment and nine (9) years research experience in field of assignment, including at least four (4) years at level of Senior Research Associate or equivalent. Job Duties Plans, organizes, coordinates, directs, and personally participates in assigned scientific or medical research project. Selects or assists in selection of key research personnel. Determines specific goals or objectives to be attained and assigns and reviews work of subordinates. Plans experimental protocols. Reviews and analyzes resulting research data. Revises techniques or approaches to work problems as indicated necessary by research data. Compiles, writes, and submits research results to supervisor. Prepares or assists in preparation of research papers, reports, and abstracts for publication as one of co-authors. Designs, develops, or adapts equipment used in experiments or research to obtain desired results. Plans and supervises training of technicians and other laboratory personnel with respect to proper laboratory techniques, use of laboratory equipment, and safety procedures. May confer with industrial, governmental, or other groups concerning progress or results of research project. Performs other duties as assigned. Other Job Responsibilities A research scientist position is available in Children's Research Institute (CRI) (https://cri.utsw.edu/). We are looking for an experienced researcher to oversee the next-generation sequencing (NGS) core facility and participate in genomics related projects.The main responsibilities include: design & perform NGS assays (e.g. library preparation and QC), NGS on Illumina sequencer & data processing, develop genomic methods, manage facility operation, coordinate user training & facility functioning.Would prefer if the candidate held a PhD and/or MD degree with a strong knowledge in NGS based genomics, genetics, bioinformatics, or a related field, with a proven track record and enthusiasm for conducting research in genomics and/or genetics, strong communication, organizational and leadership skills, and ethics of collaboration. Previous experience in NGS wet and/or dry lab skills is required. To apply please submit CV, a summary of research interest and experience, and a list of three references.UTSouthwestern Medical Center is committed to an educational and working environment that provides equal opportunity to all members of the University community. In accordance with federal and state law, the University prohibits unlawful discrimination, including harassment, on the basis of: race; color; religion; national origin; gender, including sexual harassment; age; disability; citizenship; and veteran status. In addition, it is UTSouthwestern policy to prohibit discrimination on the basis of sexual orientation, gender identity, or gender expression."}