{"jobID": "2763919162", "jobLocation": "Ann_Arbor_MI", "jobTitle": "Principal Business Intelligence Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.xpo.com", "Headquarters": "Greenwich, CT", "Size": "10000+ employees", "Founded": " 2011", "Type": " Company - Public (XPO) ", "Industry": " Transportation & Logistics", "Revenue": " $10+ billion (USD) per year", "Competitors": " DHL Supply Chain, UPS, FedEx"}, "estimatedSalary": "79000", "jobDescription": " Principal Business Intelligence Analyst Requisition Id:  48097 Business Unit:  Corporate Location:Ann Arbor, MI, US, 48105#job-location.job-location-inline {  display: inline;  }Logistics done differently. You are always looking for a better, more efficient way to do things. At XPO Logistics, we are looking for people who can effectively identify strategies to help people and systems work smarter. As the Business Intelligence Analyst Principal, you will be responsible for providing technical leadership for solution design and architecture of analytics-based tools with a thorough understanding of available and emerging technologies, in support of strategic initiatives and ongoing business processes. You will lead projects, allocate and manage resources to develop solutions that leverage and expand upon the company Business Intelligence (BI) platform, with deliverables ranging from description and diagnostic reporting to predictive and prescriptive decision automation. This role is critical in positioning XPO for long-term success. Pay, benefits and more. We are eager to attract the best, so we offer competitive compensation and a generous benefits package, including full health insurance (medical, dental and vision), 401(k), life insurance, disability, and the opportunity to participate in a company incentive plan. What you’ll do on a typical day:Lead BI strategy and analytics roadmap to drive end-to-end architecture while adopting emerging technologies and platforms with solution designs that leverage statistical approaches, machine learning, and related disciplinesEngage with stakeholders across the organization to align priorities, communicate solution design tradeoffs and recommendations, and build and execute development plansLead projects, allocate and influence resources to implement solutions while continuously improving technical design patterns, workflows, and tools; define and enforce standards when necessary to sustain the platform’s effectiveness, and experiment with and promote adoption of new tools and approaches when appropriateIdentify, lead, and deliver efforts to build reports, visualizations, and dashboards using BI tools and practices through the use of industry standard tools, libraries, and approachesDesign user interfaces, tool screens, and end user workflows to maximize understandability of information, ease of use, and alignment with XPO aesthetic and usability standardsMentor other team members and partners on technical skills, best practices, problem-solving approaches, and standard patterns used at XPO both formally in structured group settings and informally in one-on-one and small group sessionsProactively generalize and share technical approaches and best practices among other developers, and simplify and communicate success stories to broader audiences across the companySupport end users to ensure they have reliable access to and understanding of data they need to trust to do their jobs effectivelyWhat you need to succeed at XPO: At a minimum, you’ll need: Master’s degree in Mathematics, Engineering, Computer Science, or related field8 years of experience in business intelligence and data analytics, delivering business solutions that rely on effective availability, usability, and understandability of data and analytical workflowsExceptional abilities to leverage, acquire, and integrate quantitative approaches as needed to increase the effectiveness of target solutionsExpert knowledge of multivariate statistical analysis, including regression analysis, decision trees, and cluster analysis; expert understanding of data modeling and integration (ETL) designs and approachesExpert in analyzing large, complex, multi-dimensional datasets with data querying languages (SQL), BI Tools (MicroStrategy, PowerBI, Tableau, etc.), programming languages (Python, Java, Scala, etc.), and statistical/mathematical software (R, Weka, SAS, Matlab)Ability to use best practices and principles in SQL, query design, data validation/automation, and analytic functions; understand differences between various database architectures and implementations, such as Netezza, Oracle, Postgres, Teradata, DB2, SQL server, and/or MS AccessStrong experience with machine learning, such as k-nearest neighbors, random forests, ensemble methods and their corresponding implementation packages in R (Caret, RandomForest, Rweka, etc.), and Python (SciKit-Learn, TensorFlow, Keras, NLTK, etc.)Solid understanding of Data Warehouse concepts including patterns for time variance and generic vs. explicit data structures, standards-based approaches for object names and data types, and using logical data models to document and explain business objectivesExpert in dealing with both structured and unstructured data, and Hadoop or similar technologies to recognize patterns within data and generate insights to deliver value to the organizationKnowledge of Geographic Information Systems (GIS), geospatial data, GIS analysis and workflow, and cartographic and graphic design principlesExperienced in streaming analytics using tools such as Spark, Kafka, Storm, etc. and cloud services like AWS, Azure cloud, etc. It’d be great if you also have: MBA; BI and analytics coursework completed from Coursera, Udacity, Data Camp, etc.Certified Business Intelligence Professional from Transforming Data with Intelligence (TDWI) and R/Python certifications8 years of experience delivering business intelligence and data analytics solutions that involve statistical modeling or machine learning, the use of associated R/Python libraries and tooling, and which emphasize effective design and usability for end usersBe part of something big.#LI-ED1 XPO provides cutting-edge supply chain solutions to the world's most successful companies, including Disney, Pepsi, L'Oréal, Toyota and many others. We’re the fastest-growing transportation company on the Fortune 500 list and we’re just getting started.  We are proud to be an Equal Opportunity/Affirmative Action employer. Qualified applicants will receive consideration for employment without regard to race, sex, disability, veteran, or other protected status.  The above statements are intended to describe the general nature and level of work being performed by people assigned to this classification. They are not intended to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel so classified. All employees may be required to perform duties outside of their normal responsibilities from time to time, as needed.Nearest Major Market: Ann Arbor Nearest Secondary Market: Detroit"}