{"jobID": "2794933785", "jobLocation": "Arlington_VA", "jobTitle": "Program Analyst", "companyRating": "5.0", "companyInfo": {"Website": "www.tcg.com", "Headquarters": "Washington, DC", "Size": "51 to 200 employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": " TCG is an award-winning Government technology solutions provider. We are seeking a Program Analyst, who currently lives in the Washington, D.C. metropolitan area, to join our team in Arlington, VA. ***This position is contingent upon the award of this position to TCG.*** This project supports the goals of the Comprehensive National Cybersecurity Initiative (CNCI), specifically Initiative I: \"Management of the Federal Enterprise Network as a single network enterprise with Trusted Internet Connections,\" which is commonly referred to as the \"Trusted Internet Connections\" (TIC) Initiative. It requires a Program Analyst who can readily assess user needs to determine functional and cross-functional requirements. A currently active Secret security clearance is required for this position. RESPONSIBILITIES: Assist program efforts by ensuring the application of best practices for Federal Network ResilienceProvide analytical consultative services required to administer programs throughout all phases of business requirements, analysis, software design, system and performance testing and implementationIdentify resource shortfalls and make corrective recommendationsParticipate in analysis sessions to provide program requirementsReview the business and system, software and system integration requirements for program related objectives.Assess the operational and functional baseline of an organization and its organizational components, and facilitate the direction and strategy for an engagement while ensuring the organizational needs are being addressed Typical areas addressed include Human Resources, Finance, Supply, and operationsAssist the generation of functional & technical area strategies throughout the programFacilitate strategy sessions, strategic assessments and program and process reviews to validate enterprise approachApply a comprehensive understanding of program related emerging technologies, analytics, proofs of concept and pilotsProvide continuous input based on leading practices, requirements and guidance from both public and private sectors REQUIRED SKILLS: A minimum of 3 years of experience in a Program Analyst roleA currently active Secret security clearanceMastery in the use of MS Office products: Word, PowerPoint, and ExcelProfessional, client-ready written and oral communication skillsAttention to detailCollaborative, \"can-do\" attitude EDUCATION: Bachelor's degree Naturally, TCG does not discriminate on the basis of race, sex, color, religion, national origin, age, disability, veteran status, or anything else that makes you part of any group. We discriminate on the basis of talent, ability, commitment, and experience.  We pay competitive wages and provide excellent benefits. We have a 401K plan, a health plan that includes dental and vision benefits, pet health insurance, support for sick-child daycare, book and fitness clubs, a generous training budget for each employee, employee-led (and TCG paid) social events, company charity events, free theater and sports tickets, and much more.  In fact, in 2018 Fortune magazine named TCG as a \"Great Place to Work\" for the second year and The Washington Post named TCG as a \"Top Workplace\" for the fourth straight year, based on how our employees feel about the company, the benefits TCG offers, and the work/life balance that our staff are able to achieve.  Try us ... we'll make you happy.Job Posted by ApplicantPro"}