{"jobID": "2778730531", "jobLocation": "San_Diego_CA", "jobTitle": "SYSTEMS ANALYST - Info Services Data", "companyRating": "3.7", "companyInfo": {"Website": "www.scripps.org", "Headquarters": "San Diego, CA", "Size": "10000+ employees", "Founded": " 1924", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Sharp HealthCare, UC San Diego, Kaiser Permanente"}, "estimatedSalary": "71000", "jobDescription": " Establishes process and procedures for installations, configurations, and maintenance of infrastructure systems in support of business processing requirements. Build, install, upgrade and maintain infrastructure in accordance with established IT policies and procedures. Leads and assists cross functional integrated team to troubleshoot varying complexity level issues across single and multiple environments. Monitors and tunes the system to achieve optimum performance levels. Implement infrastructure enhancements that will improve the reliability and performance of systems. Read, interpret and create technical documentation with peer review and present to peers and key stakeholders. Acts as a liaison and escalation point between customers and vendors to ensure requests, issues and problems are resolved in a timely manner. Conducts routine hardware and software audits of infrastructure to ensure compliance with established standards, policies, and configuration guidelines. Ensure long term requirements of systems operations and administration are included in the overall information systems planning of the organization. On-call may be required.Duties and Responsibilities:Configure, implement and support network infrastructure components (switches, routers, load balances, WiFi controllers);Monitor network resource utilization, performance, trending, and capacity planning;Document, and comply with system standards, policies and change management practices;Recommend and implement new solutions to improve the resilience of network operations;Collaborate with network peers to optimize system performance;Perform network maintenance and system upgrades including service packs, patches, hot fixes andProvide Level 2/3 support and troubleshooting to resolve issues.Required Education/Experience/Specialized Skills: Good critical and analytical thinking and excellent customer service skills. Exhibit excellent written and verbal communication skills. Advanced troubleshooting skills. Excellent organizational and presentation skills. Proficient in computing platforms such as operating systems, virtualization, and cloud services. Solid understanding of scripting concepts. Proficient in network LANs, WANs, WLANs, and VoIP networks with good understanding of networking protocols (EIGRP, OSPF, HSRP, BGP, 802.11, QoS). Good understanding of Cisco, Brocade, F5 and Aruba network gear. Possess good analytical and problem-solving skills. Ability to perform well under pressure and work well independently and in team settings. Preferred Education/Experience/Specialized Skills/Certification: Bachelor's degree, preferable in network administration, information technology, or computer science.. Three years experience in a healthcare or IT setting. Certifications preferred, such as Cisco Certified Network Associate (CCNA) or Cisco Certified Network Professional (CCNP).  Keywords: LAN, WAN, WLAN, CCNA, CCNP*LI-SH1Scripps Health is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex (including pregnancy, sexual orientation, or gender identity/expression), age, marital status, status as a protected veteran, among other things, or status as a qualified individual with disability."}