{"jobID": "2825173265", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst - Summer Internship", "companyRating": "2.7", "companyInfo": {"Website": "www.dfsco.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 2016", "Type": " Company - Public (DFIN) ", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "56000", "jobDescription": " Donnelley Financial Solutions (NYSE: DFIN) provides software and services that enable clients to communicate with confidence in a complex regulatory environment. With 3,500 employees in 61 locations across 18 countries, we provide thousands of clients globally with innovative tools for content creation, management and distribution, as well as data analytics and multi-lingual translations services. Leveraging advanced technology, deep-domain expertise and 24/7 support, we deliver cost-effective solutions to meet the evolving needs of our clients. Company Info  Donnelley Financial Solutions (DFS) is a leading financial communications services company with approximately 3,500 employees and 2015 revenues of $1.1 billion. DFS serves capital market and investment market clients by delivering products and services to help create, manage and deliver accurate and timely financial communications to investors and regulators.  Required Skills Database querying competency using SQLAbility to develop data visualization dashboards in Tableau, Power BI, or QlikViewKnowledge of using statistical packages for data mining using R, Python, Spark ML, or Azure MLAbility to collaborate effectively and work as part of a teamUnderstand the fundamental concepts of object oriented programmingIt is the policy of Donnelley Financial Solutions to select, place and manage all its employees without discrimination based on race, color, national origin, gender, age, religion, actual or perceived disability, veteran's status, actual or perceived sexual orientation, genetic information or any other protected status.   If you are a qualified individual with a disability or a disabled veteran, you have the right to request a reasonable accommodation if you are unable or limited in your ability to use or access jobs.dfsco.com as a result of your disability. You can request a reasonable accommodation by sending an email to AccommodationRequests@dfsco.com."}