{"jobID": "2721149283", "jobLocation": "San_Jose_CA", "jobTitle": "Data Scientist/Applied Researcher", "companyRating": "3.7", "companyInfo": {"Website": "www.ebayinc.com", "Headquarters": "San Jose, CA", "Size": "10000+ employees", "Founded": " 1995", "Type": " Company - Public (EBAY) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Apple"}, "estimatedSalary": "148000", "jobDescription": " Looking for a company that encourages passion, courage and imagination, where you can be part of the team crafting the future of global commerce? Want to craft how millions of people buy, sell, connect, and share around the world? If youre passionate about joining a purpose driven community that is dedicated to creating an ambitious and inclusive workplace, join eBay a company you can be proud to be a part of. You Are:PhD or Masters in Computer Science or related technical field with 5+ years of experience working on search ranking and machine learning.Well versed in areas such as applied statistics, machine learning, natural language processing, and data mining.A leader. You have years of experience mentoring junior researchers and developing a concept to a product.Proficient with distributed systems like Hadoop and SPARK. Youre not necessarily an expert, but you have experience processing large datasets in such frameworks.A polyglot programmer. You probably have a favorite language like Scala, Python or R but you can jump in and write some Java or C as needed.Results oriented. Research is phenomenal but at the end of the day you want to see your creation live and breathe.Join the Search Science team at eBay!You will:Be directly responsible for improving search recall and ranking via query understanding and machine learned ranking models that power the end-end search experience at eBay.Showcase the spectrum of value in the worlds most diverse ecommerce inventory, by improving whole page relevance, query recommendations, spell corrections, synonym/acronym expansions, and query rewrites.Conceptualize, code, deploy, and iterate on designs from prototypes all the way through to production systems.Analyze petabytes of real-world behavioral data to understand patterns and trends.Transform data insights into actionable reports, targeting algorithms, and model features.Provide technical leadership in statistical analysis, data mining, machine learning, NLP, and information retrieval.Work jointly with architecture, engineering, quality engineering, and operations teams to deliver complex applications.Focus on our biggest opportunities in search, convert them into applied science problem statements, and then develop end-to-end solutions.Directly see the results of your applied research improving and powering the experience of eBays core search platform across the globe. This website uses cookies to enhance your experience. By continuing to browse the site, you agree to our use of cookies  View our privacy policy  View our accessibility info eBay Inc. is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at talent@ebay.com. We will make every effort to respond to your request for disability assistance as soon as possible.  For more information see:  EEO is the Law Poster  EEO is the Law Poster Supplement"}