{"jobID": "2831875153", "jobLocation": "Houston_TX", "jobTitle": "Clinical Research Scientist - Surgical Oncology Research", "companyRating": "4.0", "companyInfo": {"Website": "www.mdanderson.org", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1941", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": " The University of Texas MD Anderson Cancer Center in Houston is one of the world's most respected centers focused on cancer patient care, research, education and prevention. It was named the nation's No. 1 hospital for cancer care in U.S. News&World; Report's 2017 rankings. It is one of only 49 comprehensive cancer centers designated by the National Cancer Institute  The primary purpose of the Clinical Research Scientist position is to plan, coordinate, design, supervise, and carry out clinical research projects. ESSENTIAL JOB FUNCTIONS Supervises data collection, editing reporting, and analysis for assigned specific disease categories and studies. Ensures that relevant data is collected at designed stages in the research process, is entered into database(s) and reported, as required, to the Institutional Research Board (IRB) and the appropriate national registries. Prepares specific protocol reports and analysis to aid decisions regarding therapeutic efficacy and to assist in manuscript preparation and grant submissions. Reports status of team data collection for specific disease categories and multiple patients via regular progress reports directly to the supervising principal investigator and assigned senior personnel. Plans, organizes, coordinates and participates in scientific clinical research projects. Monitors research activity via monthly project reports, monthly meetings, as well as one-on-one meetings as required. Develops tools for problem solving for work related issues. Develops and initiates research experiments independently. Provides monthly updates to all relevant research teams and physicians. Collaborates on the research findings and participates in the presentation of research results via verbal presentations, abstracts, publications, and posters. SALARY RANGE Minimum: $53,200 Midpoint: $66,500 Maximum: $79,800 EDUCATION Required: PhD or Medical degree.  It is the policy of The University of Texas MD Anderson Cancer Center to provide equal employment opportunity without regard to race, color, religion, age, national origin, sex, gender, sexual orientation, gender identity/expression, disability, protected veteran status, genetic information, or any other basis protected by institutional policy or by federal, state or local laws unless such distinction is required by law. http://www.mdanderson.org/about-us/legal-and-policy/legal-statements/eeo-affirmative-action.html"}