{"jobID": "2817160766", "jobLocation": "Palo_Alto_CA", "jobTitle": "Senior Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.airtime.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About Airtime Today, online means alone immersed in microblogs and success theater. We're changing that. We are charting the course for the next era of the Internet: live, shared experiences. We're building a new way to use the Internet together.  Thats why were pioneering a new kind of social experience, one designed for togetherness. At its core, Airtime is a social platform for doing whatever together. Gather with your people to explore the Internet: group video, listen to music, chat, watch stuff, send pictures, GIFs, and more.  Go watch the app marketing video on https://air.me/ then check out the app in person.  Our company was founded a few years ago by Sean Parker and Shawn Fanning and is backed by Kleiner Perkins, Andreessen Horowitz, Google Ventures, Founders Fund, and a host of other amazing partners THE ROLEWork with our product team to uncover actionable insights from behavioral user data.Provide analytical and data support to research team for setting up research studies (e.g. analyzing user segments, pulling lists for surveys and qualitative user tests, etc.)Create analytics frameworks and set best practices globally, including development of tools and dashboardsCreate sophisticated custom visualizations from large datasetsBuild and maintain analytics data pipelinesHelp empower data-driven product and marketing effortsQUALIFICATIONSAt least 4 years experience analyzing data for marketing and/or product teams. Although academic experience is important, we are looking for those candidates who have industry experience post academia.Experience in digital marketing analytics at a mobile startup is preferred.BA/BS, MS, or Ph.D. in mathematics, statistics, computer science, or a quantitative disciplineProven track record and enthusiasm for complex problem solving and analysis, including working with large data setsQuantitative mindset, comfortable and proficient with statistical analysesHands-on experience with visualization tools with expertise in building advanced custom visualizations in Power BI, Tableau and state of the art Data Viz frameworks ( D3.js, Processing.js,Raphael.js etc.)Hands-on experience with Python, R, Matlab, SQL, or other related analytical/programming tools and softwareAbility to communicate complex analytical insights in a simple, concise manner and to build strong relationships with marketing and product teams to effectively convert insights into actionComfortable and confident working as part of a face-paced, self-directed, dynamic teamExperience with A/B Testing best practices and analysisNICE TO HAVESKnowledge of Statistics is key for this roleExperience with Data dashboarding tools like Looker, Mixpanel etc.Experience with custom visualization tools like Power BI or TableauExperience with custom visualization JS frameworks like D3, Raphael etc.Experience with NoSQL databases, such as Redshift, HBase, Cassandra, MongoDBExperience working with Amazon Web ServicesExperience with Recommendation systems andAre you in?Airtime LeadershipSean Parker, Founder & Executive ChairmanDaniel Klaus, PresidentSanidhya Khilnani, VP of Product ManagementPrakash Ramakrishna, VP of Media EngineeringJesse Rabek, VP of Application EngineeringDominic Gallello, VP of MarketingGui Seiz, VP of Product Design"}