{"jobID": "2799643371", "jobLocation": "Irving_TX", "jobTitle": "Healthcare Data Analyst", "companyRating": "2.8", "companyInfo": {"Website": "jobs.cvshealth.com", "Headquarters": "Woonsocket, RI", "Size": "10000+ employees", "Founded": " 1963", "Type": " Company - Public (CVS) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Walmart, Walgreens, Express Scripts"}, "estimatedSalary": "67000", "jobDescription": " Job DescriptionCVS/Caremark,the Pharmacy Benefit Management (PBM) division of CVS Health, is looking for a Healthcare Data Analyst to join our Eligibility Administration Department. As a Healthcare Data Analyst for a Fortune 10 organization, you will impact and support customers in all areas including Commercial, Medicare, Healthcare Plans & Group Waiver Plans (EGWP). Primary responsibilities of the Healthcare Data Analyst include: - Acting as a healthcare data subject matter expert on Eligibility guidelines and Electronic Data Interchange (EDI) protocol for clients - Researching and consulting to improve healthcare data integrity and ensure excellent service delivery - Constantly improving healthcare analytical skills that are needed to perform data analysis - Resolving data enrollment issues on a daily basis - Consulting on healthcare data needs - Having exceptional time management and healthcare client management skills - Continuous development training will be provided in this role to ensure the Healthcare Data Analyst is able to exceed client expectations in this fast-paced environmentRequired Qualifications- 1+ years in healthcare data eligibility, insurance, IT, benefits or data analytics environment with a strong ability to work independently, problem solve, and analyze data in a confidential healthcare environmentPreferred Qualifications- 3+ years in eligibility or other relevant background - 2+ years customer service or client-facing experience in a fast-paced environment - Experience in EDI (Electronic Data Interchange) - Understanding of the PBM industry - Experience in a healthcare client facing role - Experience in a fast paced environment - Knowledge of ANSI X12 834 Data Documents - Familiarity with RxClaim and/or AS400Education- High School Diploma or GED required - Bachelor's Degree preferredBusiness OverviewCVS Health, through our unmatched breadth of service offerings, is transforming the delivery of health care services in the U.S. We are an innovative, fast-growing company guided by values that focus on teamwork, integrity and respect for our colleagues and customers. What are we looking for in our colleagues? We seek fresh ideas, new perspectives, a diversity of experiences, and a dedication to service that will help us better meet the needs of the many people and businesses that rely on us each day. As the nations largest pharmacy health care provider, we offer a wide range of exciting and fulfilling career opportunities across our three business units MinuteClinic, pharmacy benefit management (PBM) and retail pharmacy. Our energetic and service-oriented colleagues work hard every day to make a positive difference in the lives of our customers.CVS Health is an equal opportunity employer. We do not discriminate in hiring or employment against any individual on the basis of race, ethnicity, ancestry, color, religion, sex/gender (including pregnancy), national origin, sexual orientation, gender identity or expression, physical or mental disability, medical condition, age, veteran status, military status, marital status, genetic information, citizenship status, unemployment status, political affiliation, or on any other basis or characteristic prohibited by applicable federal, state or local law. CVS Health will consider qualified job candidates with criminal histories in a manner consistent with federal, state and local laws. CVS Health will not discharge or in any other manner discriminate against any Colleague or applicant for employment because such Colleague or applicant has inquired about, discussed, or disclosed the compensation of the Colleague or applicant or another Colleague or applicant. Furthermore, we comply with the laws and regulations set forth in the following EEO is the Law Poster: EEO IS THE LAW and EEO IS THE LAW SUPPLEMENTFederal law requires employers to provide reasonable accommodation to qualified individuals with disabilities. If you require assistance to apply for this job, please contact us by clicking EEO AA CVS HealthCVS Health does not require nor expect that applicants disclose their compensation history during the application, interview, and hiring process.For inquiries related to the application process or technical issues please contact the Kenexa Helpdesk at 1-855-338-5609. For technical issues with the Virtual Job Tryout assessment, contact the Shaker Help Desk at 1-877-987-5352. Please note that we only accept resumes via our corporate website: https://jobs.cvshealth.com/"}