{"jobID": "2774964444", "jobLocation": "Princeton_Junction,_Mercer_NJ", "jobTitle": "Acoustic Emissions Research Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.mistrasgroup.com", "Headquarters": "Princeton Junction, NJ", "Size": "5001 to 10000 employees", "Founded": " 1994", "Type": " Company - Public (MG) ", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " SGS"}, "estimatedSalary": "76000", "jobDescription": "POSITION SUMMARY: MISTRAS strives to provide a positive work environment that values excellence in safety and quality, free from discrimination and harassment. Every MISTRAS employee plays a part in our Company's success and making this a great place to work. We are committed to a work place where all employees are free to raise issues, concerns and questions for the improvement of our operations and work environment. Safety is the overriding priority in everything we do; all duties critical to safety, quality, and environmental protection are carried out in compliance with all requirements and with personal accountability.  The function of the individual in this position is to work in the area of Nondestructive Evaluation (NDE) applied specifically to the development and implementation of Acoustic Emission (AE) technology. He/She will be responsible for research, development of advanced AE analysis methods and strategies for civil infrastructure, power utilities including traditional fossil, nuclear and alternative plants; as well as any other industrial applications. He/She will help the RC&A; Manager to secure research contracts from federal agencies and others, and work as Principal Investigators in those projects. He/She will develop advanced analysis techniques, methods and algorithms for automated AE data analysis and signal interpretation. He/She will be in charge of setup of data bases for customer data management and archive. The AE Research Scientist will work with AE systems installation crews to determine systems sensitivity and to develop protocols for installation, testing and data analysis. He/She will develop physicsbased computational models/methods and generate application software where no method or historic program is available. Also, the AE Research Scientist will help in the development of diagnosis and prognosis models that will use the data to determine asset condition and predict remaining life.  He/She will establish Mistras Research and Development to be synonymous with creative, valuable new NDE applications for both the Products and Services Divisions. The individual in this position is expected spend approximately 30% of his/her time traveling. MAJOR RESPONSIBILITIES/ACTIVITIES:Technical Responsibilities:Prepare responses to RFQs in cooperation with the Research Contracts & Applications Director.Help to secure research contracts and act as Principal Investigator in those projectsWork with The Substation Reliability Center of Excellence, The Triple 5 organization and Mistras Services in projects to streamline data analysis methods, develop algorithms and automate data management.Participate in OLM/surveillance systems and formulate requirements for development of new systemsDevelop solutions to difficult technical problems and perform in-depth feasibility studies.Advise customers on best solutions for particular applications.Provide adequate product/application training according to customer needs.Assist the Director of Training to secure training business and to provide assistance during teaching courses, providing demonstrations and hand-on projects.Use industry needs to coordinate and motivate in-house resources.Assist in planning and coordinating on site services and training.Assist the company Marketing and Sales department to develop new OLM application brochures.Establish Mistras Research and Development to be synonymous with creative, valuable new ultrasonic applications.Customer Relationship Management/Responsibilities:Work with Mistras Group, Inc. sales personnel.Communication and coordination with Marketing and other Mistras Group organizations dealing with monitoring and surveillance, and with Engineering to assure that customer needs are fully met for all field work.Assist in obtaining superior customer communications and satisfaction.Ensure that all customer communications, quotes and proposals are top notch, timely and professional.Outside sales and coordination with existing sales force is required.MINIMUM REQUIREMENTS:Master's Degree or higher in Electrical, Materials, Civil or Mechanical Engineering, Physics or a related field.Strong background in Acoustic NDE methods.A minimum of 2 years of direct experience in the analysis, interpretation and algorithm development for using AE in diagnosis and prognosis.Hands-on experience in NDE data managementKnowledge of field testing using sophisticated electronic equipmentProven written and verbal communication skills in communicating with customers, generating new business opportunities and developing proposals.ESSENTIAL PHYSICAL FUNCTIONS:Frequent lifting up to 30 lbs. This job description reflects management's assignment of essential functions; it does not prescribe or restrict the tasks that may be assigned.SDL2017"}