{"jobID": "2823993189", "jobLocation": "Chicago_IL", "jobTitle": "Jr. Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.hays.com", "Headquarters": "London, United Kingdom", "Size": "5001 to 10000 employees", "Founded": " 1969", "Type": " Company - Public (HAS) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " PageGroup, Robert Half, Robert Walters"}, "estimatedSalary": null, "jobDescription": " Jr. Data Analyst/Perm/Chicago, IL/64k-68k JR. DATA ANALYST- PERM-CHICAGO We are looking for a passionate data analyst to join one of our best clients here in Chicago!! They are a specialized Rail Car company (extremely successful and stable). They are looking to bring on a JR. level candidate, who is statistically focused and has a mathematical approach. If you are currently in a role that isn't fully Data focused, but you want to be, you may also be a fit!  We look forward to speaking with you soon! Jr. Data Analyst Skills & Requirements: The end client is unable to sponsor or transfer visas for this position; all parties authorized to work in the US without sponsorship are encouraged to apply. 2+ years of Data Analytics experience - MUSTExperience with SAS - MUSTExperience with Tableau - MUSTAdvanced SQL experience - must be able to write queries - MUSTExcellent communication skills and professional presentation - MUSTMUST be a collaborative team player - and want to help each other outBachelor's Degree (preference in Stats, Operations, Mathematics, Operations) MUST Why Hays?  You will be working with a professional recruiter who has intimate knowledge of the Information Technology industry and market trends . Your Hays recruiter will lead you through a thorough screening process in order to understand your skills, experience, needs, and drivers. You will also get support on resume writing, interview tips, and career planning, so when there's a position you really want, you're fully prepared to get it. Additionally, if the position is a consulting role, Hays offers you the opportunity to enroll in full medical, dental or vision benefits. MedicalDentalVision401KLife Insurance ($20,000 benefit)ATOP - Accrued time off programConsultant lunches and outingsCare packages/Survival packsDedicated Consulting Services Representative Nervous about an upcoming interview? Unsure how to write a new resume?  Visit the Hays Career Advice section to learn top tips to help you stand out from the crowd when job hunting.  Hays is an Equal Opportunity Employer.  Drug testing may be required; please contact a recruiter for more information."}