{"jobID": "2651103979", "jobLocation": "Mountain_View_CA", "jobTitle": "Scientist- Translational Informatics", "companyRating": "4.9", "companyInfo": {"Website": "www.dnanexus.com", "Headquarters": "Mountain View, CA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "117000", "jobDescription": " DNAnexus combines expertise in cloud computing and bioinformatics to create the global network for genomics, operating in North America, Europe, Asia-Pacific (including China), South America, and Africa. The secure, scalable, and collaborative cloud-based DNAnexus Platform helps thousands of users across a spectrum of industries biopharmaceutical, bioagricultural, sequencing services, clinical diagnostics, government, and research consortia accelerate their genomics programs globally.  The Scientist for Translational Genomics will be responsible for the development of computational methods for large scale data analysis and visualization in support of translational genomics research. The ideal candidate is a computational biologist with success in leading research studies. He or she will have an extremely strong background in statistics and data analysis, and be deeply knowledgeable and keenly intuitive about NGS data and leveraging it in biological research in conjunction with clinical/phenotypic and x-omics data. The right candidate must also have strong programming skills.  Specific responsibilities include: Engage with customers to understand the goals for computational biologists in pharmaceutical and academic research settingsIdentify analysis algorithms for broad applicability and robust interpretation across diverse disease targetsDevelop statistical models for analyzing large, complex genomic data sets in conjunction with clinical/phenotypic and x-omics dataConceptualize optimal methods to visualize analysis resultsDefine solutions that meet customer requirements, working closely with product management, UX, and Engineering to drive those solutions through development, testing, deployment, and customer validation in an agile environmentInterface and partner with individuals at all levels of the DNAnexus business Qualifications/Experience M.S. in computational biology, computer science or related fields; Ph.D. and interdisciplinary academic exposure preferred.3+ years of experience in bioinformatics, genomics, and/or translational research in either academic or industry settings Knowledge and skills Deep understanding of differences in existing techniques for managing genomic, clinical/phenotypic, and x-omics data, and the challenges in aggregating datasets for reuse in follow on studiesExpertise with computational biology analyses that combine genomics, clinical/phenotypic, and x-omics data, such as GWAS, PheWAS, and GSEA.Strong computational ability and expert level knowledge of programming languages used for data analysis such as Python, R, etc.Familiarity with software development and project management processes and tools (agile, JIRA, wiki, etc.)Familiarity with industry tools, e.g. Omicsoft, Station X Gene Pool, GDC DAVEExperience working with large scale genomics datasets, e.g. ENCODE, 1000Genomes, TCGAExperience working with one or more of the following packages: PySpark, Hail, ADAM, PLINK, etc.Strong organizational skills and excellent written and oral communication skillsEntrepreneurial can do attitude with the ability to find creative, pragmatic solutionsBonus: an understanding of human genetics and the effects on human diseases, e.g. oncology, cardiovascular, etc. DNAnexus is experiencing rapid growth and is searching for the best talent to join our team. We are headquartered in in Mountain View, with additional offices in San Francisco and Boston. Our key investors include Google Ventures, TPG Biotech, Wuxi NextCODE and Claremont Creek.  If you are interested in joining our team, please apply today!"}