{"jobID": "2759673461", "jobLocation": "Austin_TX", "jobTitle": "Sr. Data Analyst (Healthcare, SQL, Business intelligence)", "companyRating": null, "companyInfo": {"Website": "www.kp-recruiting.com", "Headquarters": "Kansas City, MO", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job descriptionPosition Purpose: Responsible for analytic data needs of the business unit. Handle complex data projects and acts as a lead for other Data Analysts.Provide advanced analytical support for business operations in all or some of the following areas: claims, provider data, member data, clinical data, HEDIS, pharmacy, external reportingExtract, load, model, and reconcile large amounts of data across multiple system platforms and sourcesReview data to determine operational impacts and needed actions; elevate issues, trends, areas for improvement and opportunities to management.Develop reports and deliverables for managementModel data using MS Excel, Access, SQL, and/or other data ware house analytical toolsQualifications:Education/Experience: Bachelors degree in related field or equivalent experience. 4+ years of statistical analysis or data analysis experience. Healthcare experience preferred. Advanced knowledge of Enterprise Reporting and Analysis tools, SQL, and Microsoft Office applications, including Excel and Access. Experience managing projects or heavy involvement in project implementation.HEDIS:Bachelors degree related field or equivalent experience. 4+ years of statistical analysis or data analysis experience or 2-4 years of HEDIS data analysis experience including measurement and rates impacted. Advanced knowledge of Business Intelligence Tools, SQL, and Microsoft Applications, including Excel and Access.BUSINESS ANALYTICS::Bachelors degree in related field or equivalent experience. 4+ years of statistical analysis or 2+ years of related IT experience, including data warehouse, coding or ETL experience. Healthcare experience preferred. Advanced knowledge of Enterprise Reporting and Analysis tools, SQL, and Microsoft Office applications, including Excel and Access. Experience managing projects or heavy involvement in project implementation.Data Governance:Bachelors degree in related field or equivalent experience. 4+ years of data analysis or 2+ years of related IT experience, including data warehouse. Healthcare experience preferred. Advanced knowledge of, Microsoft Office applications, including Excel and Access. Experience managing projects or heavy involvement in project implementation.HRIS Bachelors degree in related field or equivalent experience. 4+ years of related IT experience and/or data analysis experience, including 2+ years experience with HRMS such as PeopleSoft, SAP or Workday. Healthcare experience preferred. Advanced knowledge of Enterprise Reporting and Analysis tools, SQL, and Microsoft Office applications, including Excel and Access."}