{"jobID": "2837690294", "jobLocation": "Bridgewater_NJ", "jobTitle": "Director of Program Management, Data Sciences Analytics", "companyRating": null, "companyInfo": {"Website": "www.leejohnson.com", "Headquarters": "Kirkland, WA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " For Johnson & Johnson Director of Program Management, Data Sciences & Analytics job - Strategic Planning - Multiple Skip to Main Content Our Stories - Latest News - Innovation - Caring & Giving - Personal Stories - Health & Wellness - Our Heritage Our Company - About J & J - Our Credo - Our Leadership Team - Corporate Governance - Diversity & Inclusion - Empowering Women - Innovation at J & J - Office of the Chief Medical Officer - J & J Health and Wellness Solutions - Policies & Statements - Code of Business Conduct - Corporate Reports - Products - Consumer Products - Medical Devices - Pharmaceutical Products - Procurement - Value Pillars - Supplier Diversity - Supplier Standards - Careers - What We Do - How We Hire - Job Spotlight - Employee Benefits - Students - Innovation - Career Stories - Media Center - Investors - Corporate Governance - Quarterly Results - SEC Filings - News Releases - Pharmaceutical Pipeline - 2017 Health for Humanity Report - Stock Information - Webcasts & Presentations - Actelion Public Tender Offer - Our Societal Impact - Global Community Impact - Global Public Health - Global Environmental Health - Citizenship & Sustainability Reporting Follow Us - Facebook - LinkedIn - Twitter - YouTube Explore Careers Explore Careers - Function - Careers for Physicians - Learn More - View Jobs - Communication - Learn More - View Jobs - Compliance and Privacy - Learn More - View Jobs - Design - Learn More - View Jobs - Engineering - Learn More - View Jobs - Facilities - Learn More - View Jobs - Finance - Learn More - View Jobs - General Administration - Learn More - View Jobs - General Management - Learn More - View Jobs - Global Services - Learn More - View Jobs - HEMAR - Learn More - View Jobs - Human Resources - Learn More - View Jobs - Information Technology - Learn More - View Jobs - Legal - Learn More - View Jobs - Marketing - Learn More - View Jobs - Operations - Learn More - View Jobs - Public Affairs - Learn More - View Jobs - Quality Assurance - Learn More - View Jobs - Regulatory Affairs - Learn More - View Jobs - Research & Development - Learn More - View Jobs - Sales - Learn More - View Jobs - Strategic Planning - Learn More - View Jobs - Business - Consumer - Learn More - View Jobs - Medical Devices - Learn More - View Jobs - Pharmaceuticals - Learn More - View Jobs - Location - Argentina - Learn More - View Jobs - Australia - Learn More - View Jobs - Austria - Learn More - View Jobs - Belgium - Learn More - View Jobs - Bosnia and Herzegovina - Learn More - View Jobs - Brazil - Learn More - View Jobs - Bulgaria - Learn More - View Jobs - Canada - Learn More - View Jobs - Central Eastern Europe - Learn More - View Jobs - Chile - Learn More - View Jobs - China - Learn More - View Jobs - Colombia - Learn More - View Jobs - Costa Rica - Learn More - View Jobs - Croatia - Learn More - View Jobs - Czech Republic - Learn More - View Jobs - Dominican Republic - Learn More - View Jobs - Ecuador - Learn More - View Jobs - Egypt - Learn More - View Jobs - Estonia - Learn More - View Jobs - France - Learn More - View Jobs - Germany - Learn More - View Jobs - Guatemala - Learn More - View Jobs - Hong Kong - Learn More - View Jobs - Hungary - Learn More - View Jobs - India - Learn More - View Jobs - Indonesia - Learn More - View Jobs - Ireland - Learn More - View Jobs - Italy - Learn More - View Jobs - Japan - Learn More - View Jobs - Korea - Learn More - View Jobs - Latvia - Learn More - View Jobs - Lebanon - Learn More - View Jobs - Lithuania - Learn More - View Jobs - Malaysia - Learn More - View Jobs - Mexico - Learn More - View Jobs - Middle Eastern Countries - Learn More - View Jobs - Netherlands - Learn More - View Jobs - New Zealand - Learn More - View Jobs - Panama - Learn More - View Jobs - Paraguay - Learn More - View Jobs - Peru - Learn More - View Jobs - Philippines - Learn More - View Jobs - Poland - Learn More - View Jobs - Portugal - Learn More - View Jobs - Romania - Learn More - View Jobs - Serbia - Learn More - View Jobs - Singapore - Learn More - View Jobs - Slovakia - Learn More - View Jobs - Slovenia - Learn More - View Jobs - Spain - Learn More - View Jobs - Switzerland - Learn More - View Jobs - Taiwan - Learn More - View Jobs - Thailand - Learn More - View Jobs - Turkey - Learn More - View Jobs - United Arab Emirates - Learn More - View Jobs - United Kingdom - Learn More - View Jobs - United States - Learn More - View Jobs - Uruguay - Learn More - View Jobs - Venezuela - Learn More - View Jobs - Vietnam - Learn More - View Jobs - Students - Bachelor's - Learn More - View Jobs - Master's/MBA/PhD - Learn More - View Jobs Language Language - English - - Nederlands - Franais - Italiano - Espaol - Portugus - Trke - - Deutsch Quick Links - Privacy Policy - Candidate Charter - Employment Policies - Cookie Policy - Legal Notice - E-Verify - Contact Us More From Johnson & Johnson - Janssen Pharmaceutical Companies of Johnson & Johnson - Johnson & Johnson Innovation Advancing New Healthcare Solutions Through Collaboration - Johnson & Johnson Medical Devices Companies Reimagining the Way Healthcare Is Delivered - Our Consumer Safety and Care Commitment Your Safety Is Our Priority - Johnson & Johnson Our Story Learn About the Company's Rich Heritage at Our Digital Museum Follow Us - - - - Johnson & Johnson is an Affirmative Action and Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, age, national origin, or protected veteran status and will not be discriminated against on the basis of disability. Equal Employment Opportunity Posters If you are an individual with a disability and would like to request a reasonable accommodation as part of the employment selection process, please complete the form below. If you'd like to view a copy of the company's affirmative action plan, please complete this form. This site is governed solely by applicable U.S. laws and governmental regulations. Please see our Privacy Policy. Use of this site constitutes your consent to application of such laws and regulations and to our Privacy Policy. Your use of the information on this site is subject to the terms of our Legal Notice. You should view the News section and the most recent SEC Filings in the Investor section in order to receive the most current information made available by Johnson & Johnson Services, Inc. Contact Us with any questions or search this site for more information. All contents Copyright Johnson & Johnson Services, Inc.1997-2018. All Rights Reserved. Explore more Johnson & Johnson sites: Austrailia Argentina Brazil Canada Chile China Colombia Costa Rica Ecuador Germany India Italy Japan Mexico New Zealand / Pacific Paraguay Peru Philippines Russia Switzerland German English French Italian Uruguay United States Venezuela Sign In Johnson & Johnson Careers Get future jobs matching this search Get Job Alerts Please enter a valid email. JOBS.ALERT.CAPTCHA_ERROR Unfortunately, our network is not responding. Please try again later. Your job alert was successfully created. Job Director of Program Management, Data Sciences & Analytics Multiple Locations: New Brunswick, New Jersey Functions: Strategic Planning Start a new job search Get Referred Job Description Requisition ID: **********a Johnson & Johnson is recruiting for Director of Program Management, Data Sciences & Analytics to join our Johnson & Johnson Enterprise Data Analytics team and help us bring innovation to life and help advance the health and well-being of people around the world, through ideas, products and services. This role is located in New Jersey with considerations being made for West Chester, PA and will require up to 25% domestic and international travel. Caring for the world, one person at a time has inspired and united the people of Johnson & Johnson for over 125 years. We embrace research and science -- bringing innovative ideas, products and services to advance the health and well-being of people. Employees of the Johnson & Johnson Family of Companies work with partners in health care to touch the lives of over a billion people every day, throughout the world. With $76.5 billion in 2017 sales, Johnson & Johnson is the world's most comprehensive and broadly based manufacturer of health care products, as well as a provider of related services, for the consumer, pharmaceutical, and medical devices and diagnostics markets. There are more than 265 Johnson & Johnson operating companies employing approximately 126,500 people and with products touching the lives of over a billion people every day, throughout the world. If you have the talent and desire to touch the world, Johnson & Johnson has the career opportunities to help make it happen. Thriving on a diverse company culture, celebrating the uniqueness of our employees and committed to inclusion, J & J is proud to be an equal opportunity employer. We are one of only two industrial companies to hold a AAA Credit Rating. With our forward-thinking business practices, commitment to diversity and inclusion, smart management and social responsibilityas noted by our tenure in Fortune World's Most Admired company list for the 16th year in a row, and appearing in the top 20we are well positioned to transform Technology & Analytics to help innovate faster and compete more effectively, making science and technology equal partners in building the future of Johnson & Johnson. The Director of Program Management, Data Science, is an important, integral part of the transformation within J & J Enterprise Data Analytics team. The role is responsible for driving large-scale, cross-functional data science initiatives that typically require significant process change, technology enablement, and data engineering. The Director of Program Management will interface with Data Scientists, Data Engineers, business teams and information technology team to drive commercial Data Science and Analytics use cases/POCS, as well as 'productization' and industrialization of solutions for the Medical Device, Vision, and Consumer Products organization of Johnson and Johnson. Key Responsibilities: - Define problem statements and charters for analytics use cases and POCs, including objectives, milestones, resources required - Establish business case for projects in consultation with project managers and business partners. - Lead team of project managers responsible for aligning, tracking, and ensuring proper execution of data science use cases and POCs, including, as required, resource planning, business process changes, training, financial health, and operational readiness. - Partner with different program and project management groups to align project management demand and assign right-fit PM resources based on project complexity. - Partner with Data Scientists, Data Engineers and cross functional teams to understand as is processes develop, pilot, and implement improvements incorporating results of data science use cases and POCs. - Work w. Data Scientists and Data Engineers to deploy systematic Data Strategies, including automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability and 'industrialization' of use cases and POCs. - Work with cross functional technology, analytics and business team to convert use cases and POCs into technology enabled minimally viable products (MVPs) and ultimately into scalable full stack solutions, using Agile methodologies and ceremonies. - Review and provide feedback on all key program management deliverables to drive improvements in overall program quality and foster program delivery excellence. - Lead a team of program and project managers proactively performing development planning and providing career coaching and day-to-day supervision. - Partner with technology and Business leaders and other key stakeholders to drive the development and implementation of holistic change and communication strategy that understands the impact of the program to current state roles, processes and technologies, and facilitates transition and full operationalization to the desired future. - Overall accountability for organization's budget including planning, forecasting, monitoring and addressing budget variances. Qualifications - - Minimum of a Bachelor's degree is required. - Minimum of 8 years relevant business experience is required. - Experience delivering and/or project managing analytics, data science, or data engineering projects is preferred. - Experience working in or partnering with Information Technology personnel to design and build technology solutions for analytics, data science, or data engineering projects is preferred. - Program and/or project management experience is required. - At least 5 years leading globally distributed cross functional teams is highly is preferred. - Experience planning and implementing a global or enterprise-wide programs with at least 5 concurrent project work streams if required. - Track record mentoring effective project managers who are able to successfully execute complex initiatives is required. - Financial Management for program budget of $15M - $20M is preferred. - PMP certification is preferred. - SCRUM Master certification is preferred. - Must be able to demonstrate a clear bias for action and a sense of urgency. - This role is located in New Jersey with considerations being made for West Chester, PA and will require up to 25% domestic and international travel. Primary Location United States-New Jersey-New Brunswick Other Locations North America-United States-New Jersey, North America-United States-New Jersey-Bridgewater, North America-United States-Pennsylvania-West Chester, North America-United States-New Jersey-Somerville, North America-United States-New Jersey-Raritan Organization Johnson & Johnson (6067) Job Function Strategic Planning Requisition ID **********a Join our talent community Explore Careers Explore Careers - Function - Careers for Physicians - Learn More - View Jobs - Communication - Learn More - View Jobs - Compliance and Privacy - Learn More - View Jobs - Design - Learn More - View Jobs - Engineering - Learn More - View Jobs - Facilities - Learn More - View Jobs - Finance - Learn More - View Jobs - General Administration - Learn More - View Jobs - General Management - Learn More - View Jobs - Global Services - Learn More - View Jobs - HEMAR - Learn More - View Jobs - Human Resources - Learn More - View Jobs - Information Technology - Learn More - View Jobs - Legal - Learn More - View Jobs - Marketing - Learn More - View Jobs - Operations - Learn More - View Jobs - Public Affairs - Learn More - View Jobs - Quality Assurance - Learn More - View Jobs - Regulatory Affairs - Learn More - View Jobs - Research & Development - Learn More - View Jobs - Sales - Learn More - View Jobs - Strategic Planning - Learn More - View Jobs - Business - Consumer - Learn More - View Jobs - Medical Devices - Learn More - View Jobs - Pharmaceuticals - Learn More - View Jobs - Location - Argentina - Learn More - View Jobs - Australia - Learn More - View Jobs - Austria - Learn More - View Jobs - Belgium - Learn More - View Jobs - Bosnia and Herzegovina - Learn More - View Jobs - Brazil - Learn More - View Jobs -"}