{"jobID": "2835022642", "jobLocation": "Holland_MI", "jobTitle": "SAP Data Modeler", "companyRating": "3.4", "companyInfo": {"Website": "www.haworth.com", "Headquarters": "Holland, MI", "Size": "5001 to 10000 employees", "Founded": " 1948", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "79000", "jobDescription": " When you feel connected to your work, you feel more engaged. At Haworth, you can pursue a career that offers you ample opportunity to build your portfolio and expand your skillset in an exciting and inclusive environment. Join a company that values innovation, inspiration, and you!  HAWORTH is a global leader in office furniture and architectural interiors. As a valued member of our team, you can make your mark on the world and reach your full potential within a culture of connectivity. We are currently looking for a SAP Data Modeler to join our SAP Business Process Team in Holland, MI.As a SAP Data Modeler, you will: Create or modify product-related data and functions to support operational process supporting enterprise resource planning (ERP) system launches, new product introductions and supply chain process improvements. Ensure integration between SAP and legacy ERP systems until all plants are converted to SAP. Leverage SAP business configuration skills to provide support and communication between Information Services (IS) and business functional areas. Participate with business leaders on process definition, improvement, systems, metrics, performance, and best practices. Support the SAP implementation project team during the implementation and hyper care phase and when complete move into the IS Department. Do you have the following required qualifications?Bachelor’s degree in Business Administration, Operations Management, Finance, Information Management, Supply Chain Management, Logistics or Engineering.If you do not have a degree listed above 2 years formal education from a technical school, college or certification program in computer science, computer information systems, programming, or computer systems engineering plus 2 years’ experience developing and maintaining software is required.If you do not have a degree or technical certification listed above 4 years’ experience with process definition, designing, developing, and maintaining software is required.Current and continuing right to work in the United States without sponsorship.Ability to work in Holland, MI without relocation assistance.Do you have the following preferred qualifications?Haworth experience with SAP business functional area work in one or more key SAP module (Manufacturing, PP, MM, VC, IB, INV, WH), including SAP Configuration and participation on project teams.Experience with budget preparation and administration in manufacturing industry and/or as consultant.Experience using Project Management tools.Knowledge of BOM configuration in SAP.Ideally, you have also demonstrated the following:Experience identifying measurables and critical milestones.Effective and consistent communication skills.Ability to build rapport and cooperative relationships with customers, taking appropriate action to meet customer needs and concerns.Adjust priorities and schedule work.Ability to plan, guide, and leverage resources. At Haworth, we have a strong set of values that guide our business and help us align with our customers. We value our customers. We value our members. We value integrity. We value continuous learning. We value results. We value our world. Join the Haworth family. Apply for this job, or learn more about the many possibilities at Haworth, at www.Haworth.com/Careers.  As an EEO/AA employer, the organization will not discriminate in its employment practices due to an applicant’s race, color, sex, pregnancy, national origin, ancestry, citizenship, sexual orientation, gender identity or expression, protected genetic information, age, disability, marital status, veteran status, religion, height, weight, other protected group status, or any other basis protected by the laws where we employ people.  If you require an accommodation in the application process please contact careers@haworth.com.  This organization participates in E-Verify Employment Eligibility Verification."}