{"jobID": "2802768539", "jobLocation": "Fort_Worth_TX", "jobTitle": "SR HR Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.kellyservices.com", "Headquarters": "Troy, MI", "Size": "5001 to 10000 employees", "Founded": " 1946", "Type": " Company - Public (KELYA) ", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Adecco, ManpowerGroup, Allegis"}, "estimatedSalary": null, "jobDescription": " Sr. HR Data Analyst-  Duties and Essential Job Functions:  1. Leads reporting efforts of Human Resources by designing and developing standard and ad hoc reports; researching, testing results and documenting queries.  2. Ensures quality of HRIS systems by troubleshooting malfunctions; coordinating with staff to find best solution to data or reporting issues; expediting changes and/or adjustments, following up to ensure resolution; assisting in testing upgrades and new processes.  3. Serves as resource for multi-departmental and university wide reporting requirements by maintaining quality data reporting standards; analyzing and resolving customer service problems; researching reporting options and improvements; coordinating with other university departments for accuracy and consistency in end product.  4. Ensures compliance with assigned Federal, State and legal reports by reviewing processes and programs; enforcing adherence to requirement and reporting; meeting reporting deadlines; identifying trends, advising management on best practices.  5. Trains users on new or updated processes by analyzing and communicating issues with data integrity, coding and technical software issues; coordinating with staff to improve workflow and accuracy of data; documenting operating procedures; leading group and/or individual instructional sessions as needed.  6. Maintain awareness of current trends in HRMS, continuously increase both HR knowledge and HRIS application/tools knowledge.  7. Performs other related duties as assigned.  Required Education and Experience: Bachelor s degree or equivalent combination of education and experience. 3 years of technical experience  Preferred Education and Experience: Bachelor s degree in Information Systems or closely related field Higher education experience  Required Licensure/Certification/Specialized Training: None  Preferred Licensure/Certification/Specialized Training: Professional in Human Resources PHR .Knowledge, Skills Abilities: Knowledge of and technical expertise regarding data reporting, data modeling, database design development, data mining and segmentation techniques.Knowledge of PeopleSoft or other enterprise application software , Tableau, SPSS, MS Excel, MS Access, SQL for writing queries for extracting information out of databases.Knowledge of statistics and experience using statistical packages for analyzing datasets Excel, SPSS, SAS, etc . Skill in query writing. Knowledge of basic accounting processes.Knowledge of customer service techniques.Skill in the use of Microsoft Office.Skill in Microsoft Windows navigation.Skill in data research and analysis.Skill in data visualization.Ability to interpret spreadsheets and draw conclusions.Ability to apply mathematical concepts and applications to practical situations.Ability to identify, analyze and trace data processing problems.Ability to clearly communicate verbally and in writing.Ability to train and lead staff. Ability to schedule, plan and complete projects to meet deadlines.Physical Requirements With or Without Accommodations : Visual acuity to read information from computer screens, forms and other printed materials and information. Able to speak enunciate clearly in conversation and general communication. Hearing ability for verbal communication/conversation/responses via telephone, telephone systems, and face-to-face interactions. Manual dexterity for typing, writing, standing and reaching, flexibility, body movement for bending, crouching, walking, kneeling and prolonged sitting. Lifting and moving objects and equipment up to 10 lbs.Work Environment: Work is indoors and sedentary and is subject to schedule changes and/or variable work hours. There are no harmful environmental conditions present for this job. The noise level in this work environment is usually moderate.Why Kelly®?"}