{"jobID": "2838058878", "jobLocation": "Arlington_VA", "jobTitle": "Senior Analyst, Data Management", "companyRating": "3.4", "companyInfo": {"Website": "www.etrade.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1982", "Type": " Company - Public (ETFC) ", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "79000", "jobDescription": " E*TRADE is a leading financial services company and a pioneer in the online brokerage industry. Having executed the first-ever electronic trade by an individual investor more than 30 years ago, the company has long been at the forefront of the digital revolution, offering easy-to-use solutions for individual investors and stock participants. Founded on the principle of innovation and determined to level the playing field for individual investors, E*TRADE delivers digital platforms, tools, and professional assistance to help investors and traders meet their near-and long-term investing goals. The Company provides these services both online and through its network of customer service representatives and financial consultants – over the phone at two national branches and in-person at 30 E*TRADE branches.  The Senior Analyst will be a vital a member of the Enterprise Data Management Office. He/she will be responsible for implementing data management principles throughout the firm. This includes, but not limited to, establishing data lineage, data dictionaries, and data quality rules in collaboration with various business units within the firm. Additionally, this individual will ensure that regulatory data management requirements are proactively achieved while finding additional ways to improve data quality and data management across the firm. RESPONSIBILITIESSupports the enterprise-wide development of the Data Management Program, Data Governance Office.Works directly with business units to establish complete and accurate data dictionaries and data lineage with our Enterprise Data Management tool.Develops and maintains all project documentation required for successful enterprise data management.Provides status reporting on projects by clearly communicating and presenting all pertinent details in relation to the project’s health, status, risks, and successes of the project to stakeholders and sponsorsCreates detailed Work Breakdown Structures (WBS) to sequence tasks and activities required to deliver the service as scheduledEstablishes and maintains positive, working relationships with peers, project stakeholders, resources, and upper managementHelps identify gaps in processes and procedures for continual improvement of efficiencies in the organizationBasicAt least, 2-4 years of experience in Data Management and Data Governance, preferably in the financial services industry.Minimum 2 years’ experience with implementing and maintaining data lineage and data quality task in large organizations.Minimum 2 years’ experience with enterprise data management software, such as Collibra or similar, is required.PreferredExcellent communication skills to include oral presentation and written documentation that is concise and understandable.Experience with working with multiple stakeholders in a large organization.Experience managing projects from beginning to end. We offer a competitive and comprehensive benefits package. Please visit https://www.etradecareers.com/why-work-at-etrade/employee-benefits/ to learn more about the opportunities.  E*TRADE Financial is an Equal Opportunity Employer who encourages diversity in the workplace. All qualified applicants will receive consideration for employment without regard to race, color, national origin, religion, sex, age, disability, citizenship, marital status, sexual orientation, gender identity, military or protected veteran status, or any other characteristic protected by applicable law."}