{"jobID": "2816168085", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Engineer", "companyRating": "4.6", "companyInfo": {"Website": "www.scribd.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Media", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Audible, Amazon"}, "estimatedSalary": "131000", "jobDescription": "Scribd/skribbed/ (n). 1. a tech company changing the way the world reads2. a membership that gives users access to the worlds largest online library of books, audiobooks, sheet music, news, and magazinesWe value trying new things, craftsmanship, being an open book, and the people that make our team great. Join us and build something meaningful.About the teamWe believe in continuously improving our skills and codebase, work/life balance, and doing things right over doing them fast. Were looking for engineers who share this view and are excited about writing quality code, trying new technologies, and playing well with others.About youWe are looking for a senior data engineer to build robust and scalable pipelines in order to better understand our terabytes of data. In this role, you will own our data infrastructure and pipelines, bridging the gap between data science and engineering teams. You will get to design new systems and re-architect existing ones so that we can understand and trust our data to make better business decisions.What You Would Do:You should have expertise in building out ETL pipelines, a strong grasp of algorithms, and excellent communication skills to collaborate with all of the various teams that work with data.You will revamp our AB testing pipeline to scale with the hundreds of concurrent tests that we run in order to optimize our product.Own table schemas so that we have consistent and scalable sources of truth to leverage.Work with our scientists to build machine learning pipelines so that we can enhance our search and recommendations systems.Design and build our streaming infrastructure so that we can take our analytics and business to the next level.We're looking for: 4+ years or more of industry experience building production data pipelines (using Hadoop, Spark, Scalding, Hive etc.) on large datasets. You should have a strong understanding of data modeling best practices Programming proficiency in at least one major language (Scala, Python, Java, etc.)Software engineering mindset to write clean, maintainable, and testable codeKnowledge of distributed data stores (Cassandra, ElasticSearch)Strong SQL skillsExcellent communication skillsWhy we work here-We are located in downtown San Francisco, just a few minutes walk from BART-Health benefits: 100% employer covered Medical/Dental/Vision for regular, full-time employees-Generous PTO policy plus we close for the last week in December-401k matching-Paid Parental leave-Monthly wellness budget and fully paid membership to our onsite fitness facility-Professional development: generous annual budget for our employees to attend conferences, classes, and other events-Three meals a day, catered from local restaurants-Apple laptops and any equipment you want to customize your work station-Free Scribd membership and a yearly reading stipend! -Company events that include monthly happy hours and offsites (past events include Santa Cruz, bowling, arcades, geocaching, ropes courses, etc.)In the meantime, check out our office and meet some of the team at https://www.scribd.com/aboutScribd values diversity, and we make all hiring and employment decisions based on merit, qualifications, competence, talent, and contribution, not who you are by choice or circumstance. We value the people who make Scribd a great place to work and strive to create an environment where your work is supported and personhood respected."}