{"jobID": "2832400793", "jobLocation": "Chicago_IL", "jobTitle": "Staff Scientist", "companyRating": "3.9", "companyInfo": {"Website": "www.luc.edu", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1870", "Type": " College / University", "Industry": " Education", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "46000", "jobDescription": " Position Details  Job Title STAFF SCIENTIST Position Number 8150549 Job Category University Staff Job Type Full-Time FLSA Status Exempt Campus Maywood-Health Sciences Campus Department Name PHARMACOLOGY Location Code PHARMACOLOGY (06230A) Is this split and/or fully grant funded? No Duties and Responsibilities Duties/Responsibilities:Planning, implementation and analysis of advanced scientific research projectsInterprets data; statistical and data analysis.Advises and assists with experimental design and execution.Maintains laboratory equipment for the Department/Institute by working with the Division Administrator, sales reps, technical specialists, repair companies and the Purchasing Department to maintain current equipment and procure new purchases.Evaluates need for new technologies and train laboratory staff on proper use of equipment.Collaborates with faculty and other researchersParticipates in the preparation and writing of grant applications and reports and co-authors scientific research manuscriptsOperates and maintains a variety of scientific instrumentation which is essential to conducting the appropriate laboratory work. This would include equipment such as laboratory microscopes, centrifuges, incubators and autoclaves.Employs safety measures in working with hazardous chemicals, laboratory animals, and radioisotopes.Performs proper recording of procedures related to research studies in the laboratory and for the systematic organization of experimental data including the adequate.Performs other duties as required. expertise in molecular and cellular biology and a background in neuroscience. Essential skills include PCR, western blotting, fluorescent imaging of synapses, behavioral analyses of transgenic mice and an understanding of genetics. Experience with human iPSC culture is desirable but not essential.  Minimum Education and/or Work Experience  Required: Doctoral Degree (MD or PhD)  Molecular Biology, Biology, Biochemistry, Physiology, Pharmacology, Microbiology, Immunology, other biomedical sciences.  Minimum 2-5 years of completed mentored postdoctoral scientific training or work experience. Qualifications Required: Doctoral Degree (MD or PhD)  Certificates/Credentials/Licenses  Required: Doctoral Degree (MD or PhD)  Computer Skills N/A Supervisory Responsibilities Yes Required operation of university owned vehicles No Does this position require direct animal or patient contact? Physical Demands Carrying, Standing, Repetitive Motions Working Conditions None Open Date 06/27/2018 Close Date Special Instructions to Applicants"}