{"jobID": "2457296401", "jobLocation": "Dayton_NJ", "jobTitle": "Senior Formulation Scientist", "companyRating": null, "companyInfo": {"Website": "www.techusa.net", "Headquarters": "Millersville, MD", "Size": "1001 to 5000 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Formulation Scientist capable of working on injectable suspension formulations. Hands on experience in developing sustained released injectable products. Knowledge in aseptic processing, fluid dynamics, peptide drugs and polymers for pharmaceutical applications. Need to perform physical and chemical analytical work in the area of sustained release product characterization. Familiarity with FDA regulations and quality-by-design concept. Should able to solve formulation and process related technical problems. Will be required to work under aseptic environment during process transfer to commercial scale. Need to provide guidance to junior scientists and chemists and should work in a team environment. Need to help assembling FDA documents related to chemistry and manufacturing control for product submission. RESPONSIBILITIES: -Need to work in the lab environment on sustained release injectable formulations. -Product has to be developed at lab scale initially and should able to scale up to commercial batch size. -Need to write SOPs, protocols, batch sheets and technical reports. -Should able to solve technical problems and required to provide guidance to junior staff. -Will be required to work under aseptic environment during process transfer to commercial scale. -Work with venders to identify suitable equipment, raw material and other processing devices. During technology transfer to commercial scale need to work under clean room environment with aseptic gowning. Need to travel as required, especially during manufacturing process transfer. - PERCENT OF TIME FREQUENCY ESSENTIAL DUTIES (Listed in order of importance - most significant first) 40 Daily Plan, design and execute experiments with minimum guidance from supervisor 30 Daily Perform experiments towards product characterization (physical analysis) 10 Daily Write protocols, batch sheets and reports 5 Daily Assemble analytical data provided by Analytical team 5 Daily Discuss, prioritize and plan work with external functions such as PD and QC 5 Weekly Provide feedback to senior management on project progress 5 As required Need to help process transfer for manufacturing MS or PhD in Science or engineeringEight (8) years R&D; experience in pharmaceutical industry - injectablesTechnical problem solvingKnowledge in polymers, emulsions and suspensionsExperience in developing sterile suspension productsExperience in process equipment design and knowledge in fluid dynamicsAseptic manufacturing knowledge and skillKnowledge in FDA regulations and guidelines for injectable drugsKnowledge in Quality-by-Design concept and experience in implementing this concept during product development"}