{"jobID": "2756680439", "jobLocation": "Sunnyvale_CA", "jobTitle": "Data Scientist - Anti-Fraud", "companyRating": "3.2", "companyInfo": {"Website": "www.walmartlabs.com", "Headquarters": "San Bruno, CA", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, eBay, Google"}, "estimatedSalary": "125000", "jobDescription": "Position DescriptionWe at WalmartLabs are taking a big data approach to the sophisticated problem of real-time pricing and the opportunity for you to have visible impact couldn't be bigger! Think about every single indicator that influences the price of a retail product...and now think about how often those indicators change on a daily or minute by minute basis. Now multiply that by the Walmart scale. You get the idea.  We are a highly motivated group of Big Data Geeks, Data Scientists and Applications Engineers, working in small agile group to solve this sophisticated problem. We are building smart data systems that ingest, model and analyze massive flow of data from online, social, mobile and offline commerce/user activity to set prices for millions of products in real time. We use cutting edge machine learning, data mining and optimization algorithms underneath it all to analyze all this data on top of Hadoop/HBase/Hive. We then build compelling data visualizations and interactive dashboards to showcase our work internally and externally.  Your work will be immediately visible to millions of people and you will have a direct impact on the business goals of Fortune #1 company. If you talk, speak and think data we want to talk to you. Come join our small team and be part of the journey from the beginning. The Opportunity: \" Research, design and implement data models and cutting edge algorithms to analyze diverse sources of data to predict fraud.  \" Work with high dimensional and fast moving data to build continually learning systems  \" Through your work have direct impact on revenue and bottom lineMinimum Qualifications\" MS/PhD in Operations Research/Statistics/Computer Science or a related technical discipline  \" The preferred candidate should have at least two years' experience ideally in a Risk or Fraud environment.  \" Extensive Experience with R, SAS, SPSS, data mining, machine learning, statistical modeling tools and underlying algorithms  \" Programming experience in one of the languages like Python/Ruby/Perl/Shell/C/Java  \" Working knowledge of Relational Data Base Systems and SQL  \" Attitude to thrive in a fun, fast-paced start-up environment with stellar team of fellow data geeksAdditional Preferred QualificationsCompany SummaryThe Walmart eCommerce team is rapidly innovating to evolve and define the future state of shopping. As the worlds largest retailer, we are on a mission to help people save money and live better. With the help of some of the brightest minds in technology, merchandising, marketing, supply chain, talent and more, we are reimagining the intersection of digital and physical shopping to help achieve that mission.Position SummaryWe at WalmartLabs are taking a big data approach to the sophisticated problem of real-time pricing and the opportunity for you to have visible impact couldn't be bigger! Think about every single indicator that influences the price of a retail product...and now think about how often those indicators change on a daily or minute by minute basis. Now multiply that by the Walmart scale. You get the idea.  We are a highly motivated group of Big Data Geeks, Data Scientists and Applications Engineers, working in small agile group to solve this sophisticated problem. We are building smart data systems that ingest, model and analyze massive flow of data from online, social, mobile and offline commerce/user activity to set prices for millions of products in real time. We use cutting edge machine learning, data mining and optimization algorithms underneath it all to analyze all this data on top of Hadoop/HBase/Hive. We then build compelling data visualizations and interactive dashboards to showcase our work internally and externally.  Your work will be immediately visible to millions of people and you will have a direct impact on the business goals of Fortune #1 company. If you talk, speak and think data we want to talk to you. Come join our small team and be part of the journey from the beginning. The Opportunity: \" Research, design and implement data models and cutting edge algorithms to analyze diverse sources of data to predict fraud.  \" Work with high dimensional and fast moving data to build continually learning systems  \" Through your work have direct impact on revenue and bottom line "}