{"jobID": "2664119406", "jobLocation": "San_Francisco_CA", "jobTitle": "Family Office Accounting Manager", "companyRating": "3.8", "companyInfo": {"Website": "www.seiler.com", "Headquarters": "Redwood City, CA", "Size": "201 to 500 employees", "Founded": " 1957", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "110000", "jobDescription": "For more than 50 years, Seiler LLP has provided advisory, tax and accounting services to some of the world’s most affluent individuals, families, privately-held businesses and non-profit organizations. Our clients include prominent business, community and philanthropic leaders, as well as high-net-worth multi-generational families and successful entrepreneurs. Based in Silicon Valley and San Francisco, we deliver the sophisticated solutions, innovative thinking, global capabilities and highly personalized service our clients require to navigate the complexities of their financial worlds, not only for today but for many years to come. Our goal is to exceed our clients’ expectations in every way.  Recognition: San Francisco Business Times’ and Silicon Valley Business Journal’s “Best Places to Work 2017”INSIDE Public Accounting’s “Fastest-Growing Firms” of 2016INSIDE Public Accounting’s “Best of the Best Accounting Firms” in the United States for 12 yearsINSIDE Public Accounting’s “Top 100 Firm” for 12 yearsAccounting Today’s “Top 100 Firm” for 10 years Overview & ResponsibilitiesThe Family Office group provides accounting and consulting services to ultra-high net worth individuals and family clients. The services provided range from partnership accounting, financial reporting, cash management, and bill payment to advising on complex intergenerational wealth strategies.  The Accounting Manager will be an integral part of the Family Office group providing diversified administrative and day-to-day financial support to the Family Office Management Team in the service of our clients. Our ideal candidate will possess: An extensive and diverse accounting and payroll backgroundAn understanding of professional services and client serviceExperience in managing, training, and mentoring two to three direct reportsStrong interpersonal skills with an approachable and professional demeanorOutstanding organization skillsExcellent verbal and written communication skillsThe ability to handle and respond to multiple client and department demands in a timely mannerThe ability to prioritize assignments and effectively manage their timeThe ability to thrive in a fast paced and dynamic environmentThe ability to be a team player but be able to work independently DutiesResponsible for providing multiple clients with a variety of accounting and administrative services, including but not limited to: Responsibility for the oversight of full accounting processes, i.e. maintaining/reviewing the general ledger, generating and posting all journal entries in a timely manner, coordinating monthly close, maintaining budgets and reporting on budget to actual, and preparing monthly/quarterly financial statements with related workpapersSupervising and reviewing the accounts payable functionSupervising and mentoring Family Office Staff, General Ledger, and Senior AccountantsPayroll coordination with clients and the Family Office payroll teamManaging and reviewing numerous bank, brokerage, and credit card reconciliationsPerforming reconciliations and analysis for balance sheet accounts, including inter-company accountsPreparing annual K-1 reconciliationsAssisting in preparation and review of quarterly and annual tax packages and supporting documentsResponding to client requests and inquiriesManaging client relationships on a day-to-day basisHandling special projects as needed Requirements Bachelor’s degree in Business, Accounting, or FinanceCPA eligible preferred6 to 9 years of progressive accounting/bookkeeping experience3 plus years of professional services experience preferred3 plus years of supervisory experienceTeam management skills including ability to lead, direct and coach staffAbility to build & cultivate strong personal relationships with peers within the firm and the business communityProficient with Microsoft Office, particularly Excel, and QuickBooksStrong project management and client service skillsSolid understanding and working knowledge of GAAP and financial statementsHigh attention to detail, problem solver & intellectually curiousAdhere to the highest level of confidentiality Applicants must be able to pass a background check and must be currently authorized to work in the United States on a full-time basis.  All qualified candidates should submit their resumes and salary requirements (please reference “Family Office Accounting Manager” and either Redwood City or San Francisco in the subject line) to resumes@seiler.com for immediate consideration."}