{"jobID": "2821110773", "jobLocation": "San_Francisco_CA", "jobTitle": "Account Executive, Senior", "companyRating": null, "companyInfo": {"Website": "www.fusionstorm.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Do you like interacting with customers, and meeting them face to face?Are you someone who loves problem solving? Senior Accounts Executives (Senior AEs) are empowered to grow and improve customer relationships with FusionStorm. Senior AEs seek opportunities within their current customer base or can benefit from the many marketing activities sponsored by FusionStorm. Travel to client sites is required - FusionStorm Principal AEs work from a local FusionStorm office and engage face-to-face with customers through a consultative sales approach to develop business plans to satisfy the particular needs of the customer. You need a consistent track record of sales achievement, a high level of integrity, as well as excellent communication and presentation skills. Additional competencies include strong communication and listening skills, the capability to settle, with the assistance of our extensive technical resources, the correct solutions, and then present and close these solutions. Enthusiastically engage end-user customers and vendors to increase collaborations and customer penetration and expansion.Present the FusionStorm story to targeted customers face-to-face.Thorough preparation prior to customer meetings, as well as timely follow up after the meetings with customers and managers.Find short term and long-term sales opportunities via onsite discussions, marketing programs, and telemarketing.Possess and has the ability to expand deep understanding about vendor partnerships and FusionStorm solutions, while being able to communicate these to the customers.Work closely with Sales Managers, Vendors, and Internal Resources to ensure open communications and delivery of the contracted solutions to our customers.Maintain sales certifications as outlined by vendors.Meet / engage with core vendors on a regular basis.Strategize and fully utilize the Business Acquisition Team (BAT) within the region.Embrace and support FusionStorm’s mission and core values.Understand and abide by all security and operational policies.High product expectation (versus that of an Account Executive).High school diploma or equivalent; Bachelor’s Degree in Business, Marketing, Sales, or related field preferred.Minimum of 5 years of sales experience with consistent track record of success.Minimum of 3 years of sales experience specifically in selling hardware, software, and services with Minimum of 2 consecutive years of exceeding sales goal targets.Legally eligible to work in the United StatesStrong written and verbal skills.Excellent social and communication abilities and the skills present in a group setting.Able to use discretion and independent judgment.Project a professional image and strong business insight during customer interactions.Demonstrated knowledge of technology and the industry channel dynamics.Possess a sense of urgency, strong organizational and follow up skills.Prefer a strong working knowledge of computer system applications (e.g.: Windows, Microsoft Office, OSX, Salesforce).Validated sales track record.WHY FUSIONSTORM? FusionStorm is an award-winning, information technology delivery (ITD) companyTM. We combine best-of-breed products from leading vendors with a full suite of Professional and Managed Services to help our customers save money and grow their businesses. FusionStorm provides advanced technology and data center infrastructure expertise; world-class IT consulting, and managed and support services. We ensure our customer’s IT investments create value and realize high returns.  FusionStorm hires extraordinary people who strive to make a difference. Our success is in large part due to our outstanding talented and dedicated employees. If you thrive on transformation, empowerment to make a difference, and identification of solutions in an innovative environment, we want you to join our team.  FusionStorm is headquartered in the San Francisco Bay Area with offices in Newark, Irvine, San Diego, Franklin Massachusetts, New York City, Cranberry Township Pennsylvania, Amsterdam Netherlands, Beijing China and Wanchai Hong Kong. For more information about FusionStorm, please visit www.fusionstorm.com. WE OFFER A GREAT BENEFITS PACKAGE!There's so much more to enjoy about being at FusionStorm than just having a rewarding career. In addition to offering competitive compensation plans and long-term career opportunities, FusionStorm provides an attractive mix of benefit plans to contribute to its employees' good health, future financial security and peace of mind. Please visit our website for more information about our competitive benefits package: http://www.fusionstorm.com/company/careers/beyond-rewarding-career  You must be authorized to work in the United States.  FusionStorm is an Equal Opportunity Employer with a strong commitment to supporting and retaining a diverse and talented workforce.  No AGENCIES, please. We are not obligated to pay any fees for any individuals we decide to hire."}