{"jobID": "2832258935", "jobLocation": "Chicago_IL", "jobTitle": "Data Scientist Intern", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "The Firm: Brookfield Asset Management is a leading global alternative asset manager with approximately $250 billion of assets under management. For over 100 years Brookfield has owned and operated real assets with a focus on real estate, infrastructure, renewable power and private equity. Clients can invest in Brookfield strategies via three main channels: public securities, private funds and listed partnerships. The Public Securities Group leverages Brookfield's core real asset expertise via global listed strategies, including real estate, infrastructure, real asset debt, real asset solutions and opportunistic strategies through a variety of flexible and scalable investment mandates, including separate accounts, registered funds and private funds. The Public Securities Group (PSG) has been investing in public securities for over 25 years and has over $15 billion of assets under management. Clients include financial institutions, public and private pension plans, insurance companies, endowments and foundations, sovereign wealth funds and high net worth investors.  Location: Chicago  The Position: Data Scientist Intern  The Public Securities Global Real Estate team is looking for a Data Science Intern to join our team. The intern will perform data analysis, investment model optimizations and backtesting, and assist the team in implementing new analytic tools. This internship is a unique opportunity to gain hands-on experience in data science applications related to stock investing at one of the largest global real estate investment funds. You will have a unique opportunity to work with a small investment team to improve and build new predictive models, as well as automate and optimize certain analytic processes. The right candidate will have an understanding of basic stock investment and valuation principles, and a strong \"analytic curiosity\" as you will be expected to come up with analytic suggestions in addition to executing on projects suggested by the team.  The position is flexible in terms hours per week. Responsibilities:Professional day-to-day execution of special projectsHelp the team optimize and backtest predictive modelsHelp the team automate a variety of analytic and data driven tasksWork with the team to design new analytic and predictive models, potentially using R, Python, or JavaFind patterns and insights in unstructured data as it relates to real estate equity investingQualifications & Requirements:1st year or higher Masters or PhD student in data science or related field (statistics, math, etc)Experience with a variety of supervised and unsupervised machine learning methodsFluent in R and/or PythonBasic understanding of stock valuations and equity investingGood communication skills, with an ability to make advanced analytics concepts accessible to non-technical team membersSDL2017"}