{"jobID": "2835014429", "jobLocation": "Washington_DC", "jobTitle": "Driver - PT Evening - Harvard Campus", "companyRating": null, "companyInfo": {"Website": "www.carlosrosario.org", "Headquarters": "Washington, DC", "Size": "201 to 500 employees", "Founded": " 1995", "Type": " School / School District", "Industry": " Education", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Do you enjoy driving? Do you have a friendly and welcoming demeanor? If so, then Carlos Rosario International Public Charter School (CRIPCS) has the perfect opportunity for you. Carlos Rosario International Public Charter School (CRIPCS) is an adult charter school that educates and prepares the diverse adult immigrant population of Washington, DC to become productive citizens and members of American society who give back to their family and community. When you join the team at CRIPCS you become part of a unique, performance-driven organization that’s been ranked one of the top places to work in DC by the Washington Post for the last 3 years. Driver The Driver is responsible for driving students, staff and visitors as well as providing general building maintenance support. The Driver deals extensively with the public and must be diplomatic, courteous and helpful. The driver will have access to sensitive information and must maintain strict confidentiality. Responsibilities:Drives students from the metro station to the school and/or from the Sonia Gutierrez Campus to the Harvard Campus.Drives staff, teachers or School guest to meetings and activities as neededDrives teachers and staff on field tripsDrives staff to stores to purchase food and supplies for student activitiesPerforms vehicle inspection prior to use (use vehicle inspection report)Maintains cleanliness of vehicleDelivers vehicle to designated shop for any scheduled or required maintenance serviceImmediately reports any accident or damage to the vehicleImmediately reports any moving or parking violations. Failure to report a violation is grounds for immediate termination of employmentProvides cafeteria coverage during breaks and assist cafeteria staff with minor cleaning taskUnder general or limited supervision, performs a variety of manual and clerical tasks associated with the pick-up, transport and delivery of mail, supplies, equipment and booksMoves or assists in the moving of heavy furniture, equipment and objects both inside and outside of the building  Requirements:Valid CDL Class B license with a Passenger (P) endorsementCopy of driving recordCopy of medical certificationStrong interpersonal skillsAbility to communicate with people that have limited English’s skillsAbility to interact with populations of diverse cultural, social and economic background.   Schedule:Monday – Thursday, 5:15 PM – 9:30 PMLocation: Harvard Campus: Harvard Street NW, Washington, DC 20009 This posting will close on July 13, 2018. "}