{"jobID": "2821958326", "jobLocation": "Mountain_View_CA", "jobTitle": "Data Scientist, Ads and Commerce, Google Technical Services", "companyRating": "4.4", "companyInfo": {"Website": "www.google.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (GOOG) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Apple, Facebook"}, "estimatedSalary": "172000", "jobDescription": "The Google Technical Services Product and Tools Operations team maintains the close relationships with the Engineering and Product partners necessary to develop and improve Google’s products and internal tools. We are champions of the customer experience, advocating for feature requests and offering product improvements backed by data-driven insights. Our work enables Google Technical Services teams to deliver delightful support to Google’s millions of customers.  The Customer Experience Lab conducts customer experience research on advertisers who are using Google’s Marketing Solutions. The team is charged with generating insights for Product and Engineering to improve the customer experience for advertisers. We collect and analyze qualitative and quantitative advertiser sentiment and satisfaction data. Many of these questions involve detailed, data-driven research but are also applied directly to products launches and product development. We are looking for passionate data scientists who can drive difficult data research forwards while working closely with product and engineering teams.  The CX Lab conducts scaled research on Google's advertisers. We are looking for data scientists to research and analyze correlations between advertiser CSAT survey data and key data systems to determine key drivers, opportunities, and trends.  Google Technical Services is a global support and operations team, with a mission to delight our customers with care so good, it’s got to be Google. Our team is the face of Google to most of our customers, and we want their Google support experience to set new standards, just like Google’s products do. Our team cares for customers by solving problems and scaling solutions, incubating new Google products, and sharing user feedback with internal teams to influence product development. We support a wide variety of products, from Ads to Project Fi and just about everything in between, and our customers include advertisers, consumers, partners, publishers, retailers, and our own Sales Googlers. Responsibilities"}