{"jobID": "2805541547", "jobLocation": "Dallas_TX", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.aquesst.com", "Headquarters": "Atlanta, GA", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Data Analyst6 month contract to hireDallas, Texas*MUST BE ELIGIBLE TO WORK IN THE U.S. WITHOUT SPONSORSHIP**MUST BE LOCAL TO THE DALLAS AREA*Responsible for refining, coordinating and expanding use of data analytics in supporting Financial, IT, Acquisition and Operational audits.This includes: Understand the life cycle of data generation, storage, manipulation, output and usage. Analyze business procedures and recommend types of data that can be used to audit and provide insight for improvements. Establish repeatable data analytics tests for primary audit areas Coordinate expansion the usage of data analytics into the business Identifying and assessing risks in the usage of data Documenting work papers and preparing written audit reports Developing written project plans and receiving concurrence of audit management Presenting results and recommendations for improvement Conducting work within time constraints Assist in the execution of internal audits Expand usage of KPIs, scorecards and visual presentation of dataDuties/Tasks:Use statistical methods to analyze data and generate useful business reports while working with management to prioritize areas. Use data to create models that depicts trends and possible business risks/opportunities. Prepare work papers to document findings and develop written reports with recommendations.Work with automated tools and data analysis techniques to identify useful information in data sets and suggest conclusions that support decision making.Keep abreast of emerging trends and best practices for data analytics. Identify and recommend opportunities to streamline business processes.Participate in special projects of importance to corporate and division management.Experience and knowledge is required to perform technical information system audits. Exposure to mainframe, midrange, client-server, LAN. stand-alone PC environments. Knowledge of, ACL or other data manipulation software packages is desired. Thorough understanding of data mining. Strong written and verbal communication skills and the ability to interact and communicate with all levels of staff and management are also required.If you feel that you are a fit for this position, please send your resume to: bobby@aquesst.comRate: $40 - $45 per hour*MUST BE ELIGIBLE TO WORK IN THE U.S. WITHOUT SPONSORSHIP**MUST BE LOCAL TO THE DALLAS AREA*"}