{"jobID": "2779872121", "jobLocation": "Troy_MI", "jobTitle": "Senior Software Engineer", "companyRating": "3.3", "companyInfo": {"Website": "www.plex.com", "Headquarters": "Troy, MI", "Size": "501 to 1000 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Epicor Software, NetSuite, QAD"}, "estimatedSalary": "87000", "jobDescription": "Senior Software Engineer  We’re on a mission. As a fast-growing software company on the cutting-edge of technology, Plex is revolutionizing global manufacturing in the same way cloud solutions have transformed sales, marketing, and human capital management. We want manufacturers to succeed. That’s why we’re on a mission to replace underperforming, on-premise enterprise resource planning (ERP) systems with the Plex Manufacturing Cloud – ERP built for today’s model of manufacturing. If you want to see the future of business, we’re what’s next.  In support of our ongoing growth, we are looking for a Senior Software Engineer to help develop our next generation platform. There are new, disruptive forces in today’s manufacturing environment where we need to be ready to capitalize on opportunities. Integrating augmented/mixed reality, voice, IIOT and new levels of automation to name a few, while maintaining scale, stability and performance. Sound fun? It does to us too!  Additional responsibilities include the following: Proven software professional with excellent communication and collaboration skills in addition to current, hands-on coding skillsSelf-motivated and able to solve problems independently and in team settingsExtend the Plex platform by new ideas and concepts to solve business problemsCoach and mentor other less experienced team members What do you need to know? Bachelors in Computer Science or related area or equivalent industry experience7 years of professional development experienceDemonstrated experience in developing and deploying high volume, high transaction based, distributed and redundant Cloud applicationsStrong understanding of full stack modern technologies from UI layer to middleware and DB layerStrong understanding of modern distributed architecture and development frameworks (e.g. SOA, Lambda, Microservices) for scalable and fast applicationsDemonstrated knowledge of generally accepted software development lifecycle processesDemonstrated understanding of design patterns, principles, and frameworksStrong understanding of database design/data modelingDemonstrated understanding of security concepts and best practicesWilling to work hard to help build our growing companySense of humor Any other skills? Strong and recent development experience in one or more of the following languages (C#/.NET, MVC, JavaScript, REST, HTML5, Python, Go, NodeJS)Demonstrated experience and working knowledge of SQL and No-SQL persistence approachesExperience in a manufacturing environment Bonus Experience Points Hands on experience with container and cluster technologies (e.g. Docker, RKt, Kubernetes, etc)Experience with distributed storage and data systems (e.g. Cassandra, Memcached, Kafka, Redis) Remote work with occasional travel available for the right candidate  We are proud to be recognized as one of the top workplaces in the tech industry. In fact, it’s Plex employees themselves who say our company is a great place to work. We’ve created an inviting workspace that fosters a culture of collaboration, innovation, and excitement. Some of the things our employees enjoy include: Competitive wagesGenerous benefits including Health, Dental, Vision, Life, Disability Insurance, & 401(k) matching programVery generous PTO/paid holidaysTuition reimbursementHealth club dues reimbursementSustainable work-life balance and flexibilityOur multiple locations offer a casual-dress workplace, complimentary food and drink, and “de-stress areas” complete with video games, ping pong tables, and more We’re looking for high-skilled, passionate people to help us do something daring, difficult, incredibly rewarding and fun. If you’re ready to be inspired, solve problems, grow professionally, and unleash your talent…then apply today. You’re what’s next.  The Plex Manufacturing Cloud  Plex is the engine behind the manufacturing economy, powering the first ERP cloud built specifically for the plant floor. The Plex Manufacturing Cloud delivers anywhere, anytime industry-leading ERP and manufacturing automation through a secure web browser, connecting suppliers, machine, people, systems, and customers with capabilities that deliver continuous innovation. Plex now supports more than 530 organizations and 1,500+ manufacturing facilities in 22 countries around the world. Our customers make everything from diesel engines and aircraft to ice cream and candy, all in the Plex Manufacturing Cloud.  Read moreSee All OverviewWebsitewww.plex.comHeadquartersTroy, MISize501 to 1000 employeesFounded 1995Type Company - PrivateIndustry Information TechnologyRevenue $100 to $500 million (USD) per yearCompetitors Epicor Software, NetSuite, QADPlex Systems, Inc. PhotosSee All PhotosSee AllView Allnum of numClose (Esc)Plex Systems, Inc. ReviewsGet alerts to jobs like this, to your inbox.Create Job AlertSuggested searches"}