{"jobID": "2803169278", "jobLocation": "N_o_n_e", "jobTitle": "Accounts Payable Clerk", "companyRating": null, "companyInfo": {"Website": "www.hagerty.com", "Headquarters": "Traverse City, MI", "Size": "501 to 1000 employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Hagerty, the leading provider of classic car insurance, valuation tools and roadside service for people who love cars, has an opportunity for an Accounts Payable Clerk. The qualified candidate will maintain accounts payable procedures and process vendor payments. This position is located in our Traverse City, Michigan office. Responsibilities:Pay vendors in a timely and accurate mannerMaintain Accounts Payable proceduresReview vendor invoices and correspondence with managers for adherence to expense policiesAssist with the distribution of miscellaneous invoices to department managers for approvalAssist with receiving and recording vendor invoices and in house check requests into accounting systemAssist with the printing of vendor payable checks and matching with invoicesPrepare outgoing ACH, wire and virtual card payments based on signature authorityAssist with the setup of vendor files for payment, direct deposit capability, and ensure correct federal forms are on fileAssist with recording or processing miscellaneous online banking transactionsProcess employee credit card and employee reimbursement expense reports reviewing for adherence to travel policyFulfill miscellaneous manager request for accounting reportsRequirements:Minimum 2 years’ experience in Accounts Payable or an Associate’s degree in Accounting or related fieldERP systems for Accounts Payable and Accounts Payable document workflow experience a plusDemonstrate great attention to detailEffective and efficient use of computer applications including MS Office productsAbility to work successfully within a small, collaborative team environment, and consistent attendance is an essential job functionAccepts new projects and adapts to change quickly Hagerty offers a progressive work environment along with a competitive wage and an impressive benefits package.  To apply for this position, please visit our career site at www.hagerty.com/hagerty-corporate/careers EEO/AA New Applicants"}