{"jobID": "2829609943", "jobLocation": "San_Diego_CA", "jobTitle": "Translational Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.viome.com", "Headquarters": "Cupertino, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Other Organization", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Viome is a wellness as a service company that applies artificial intelligence and machine learning to biological data e.g., microbiome, transcriptome and metabolome data to provide personalized recommendations for healthy living. We are a small, interdisciplinary and passionate team of experts in biochemistry, microbiology, medicine, artificial intelligence and machine learning. Our proprietary technology allows us to offer unique insights into diverse microbial functions and their impact on human health. To fully assess and maximize the value of our technology and inform our product development, we have continuous R&D; efforts, which include multiple research studies, partnerships, and collaborations. We are seeking a Translational Data Scientist to assist with analysis of cutting-edge multi-omics data to enhance personalization of Viomes recommendations for our customers. This role will report to the Translational Science Lead and join a versatile and multidisciplinary Translational Science group (non-wet-lab), interacting closely with AI/Technology, Bioinformatics, Product Development, and other departments at Viome.  This is a full-time position onsite at our offices in San Diego, CA.Responsibilities: Support the Translational Science team by performing data analyses utilizing various mathematical, statistical, and machine learning methods to arrive at integrative functional interpretations from microbial meta-transcriptomic, metabolomic, human transcriptomic and other data types Test various hypotheses and offer new data-driven perspectives Prototype analytical frameworks and workflows for automation and implementation into product development Contribute to feature selection and data modeling efforts needed for both, product development and R&D; analytics Assess risks, identify and troubleshoot various intricacies of complex dataset patternsSkill and Qualifications: B.S. required, graduate or professional degree preferred in Mathematics, Statistics, Data Science, Machine learning, or Computer Science. Industry experience desirable Solid ability to apply mathematical and statistical concepts, knowledge, and tools in various settings Experience and fluency with Python, R, SQL, and / or other programming and statistical computing languages required Experience with clustering techniques preferred Familiarity with Life Sciences or Biology background preferred Comfortable working in a fast-paced start-up environment Viome is 100+ person start-up offering a successful commercial product that has generated high demand. With offices in California, New Mexico, New York and Washington we are looking to hire team members capable of working in dynamic environments, who have a positive attitude and enjoy working collaboratively. If you have the skills and are excited about Viomes mission, wed love to hear from you!"}