{"jobID": "2705787569", "jobLocation": "Plano_TX", "jobTitle": "Senior Data Engineer", "companyRating": "3.9", "companyInfo": {"Website": "www.capitalonecareers.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1994", "Type": " Company - Public (COF) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " J.P. Morgan, Wells Fargo, McKinsey & Company"}, "estimatedSalary": "103000", "jobDescription": " Plano Town Center (31064), United States of America, Plano, Texas  At Capital One, were building a leading information-based technology company. Still founder-led by Chairman and Chief Executive Officer Richard Fairbank, Capital One is on a mission to help our customers succeed by bringing ingenuity, simplicity, and humanity to banking. We measure our efforts by the success our customers enjoy and the advocacy they exhibit. We are succeeding because they are succeeding.  Guided by our shared values, we thrive in an environment where collaboration and openness are valued. We believe that innovation is powered by perspective and that teamwork and respect for each other lead to superior results. We elevate each other and obsess about doing the right thing. Our associates serve with humility and a deep respect for their responsibility in helping our customers achieve their goals and realize their dreams. Together, we are on a quest to change banking for good.  Senior Data Engineer  We may be a bank, but we think and operate like a tech company. A tech company that writes its own code, develops its own software, and builds its own products. A tech company that experiments and innovates with the latest technologies, engineers breakthrough customer experiences, and brings simplicity and humanity to banking.  We began life in 1988 by harnessing the power of big data to create customized products that disrupted the credit card industry. Now we are doubling down on that big data strategy, and we are looking for great data engineers to join us.  We are looking for driven individuals to join our team of passionate Data Engineers in creating Capital Ones next generation of data products and capabilities.  - You will build data pipeline frameworks to automate high-volume and real-time data delivery for our Hadoop and streaming data hub  - You will build data APIs and data delivery services that support critical operational and analytical applications for our internal business operations, customers and partners  - You will transform complex analytical models into scalable, production-ready solutions  - You will continuously integrate and ship code into our on premise and cloud Production environments  - You will develop applications from ground up using a modern technology stack such as Scala, Spark, Postgres, Angular JS, and NoSQL  - You will work directly with Product Owners and customers to deliver data products in a collaborative and agile environment Responsibilities: - Develop sustainable data driven solutions with current new gen data technologies to meet the needs of our organization and business Customers  - Ability to grasp new technologies rapidly as needed to progress varied initiatives  - Break down data issues and resolve them  - Build robust systems with an eye on the long term maintenance and support of the application  - Leverage reusable code modules to solve problems across the team and organization  - Utilize a working knowledge of multiple development languages  - Drive cross team design / development via technical leadership / mentoring  - Understand complex multi-tier, multi-platform systems What we have:Flexible work schedulesConvenient office locationsGenerous salary and merit-based pay incentivesA startup mindset with the wallet of a top 10 bankMonthly innovation challenges dedicated to test driving cutting edge technologiesYour choice of equipment (MacBook/PC, iPhone/Android Device)Basic Qualifications:- Bachelor's degree or Military experience  - At least 3 years of experience with big data technologies  - At least 3 years of coding experience in data environments  - At least 2 years of AWS experience  - At least 2 years of Shell Scripting experience  - At least 2 years of Python experience Preferred Qualifications: - Masters Degree  - 1+ years of experience with Spark  - 1+ years of experience with Scala  - 1+ years of experience with Airflow  - 1+ years of experience with CICD/DevOps  - 1+ years Redshift"}