{"jobID": "2769280283", "jobLocation": "Detroit_MI", "jobTitle": "Senior Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.rockconnections.com", "Headquarters": "Detroit, MI", "Size": "501 to 1000 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Telecommunications", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "57000", "jobDescription": " Who We AreRock Connections is a growing strategic marketing company that helps clients increase their revenue from advertising dollars that they've already spent. Rock Connections primarily focuses on outbound contact center solutions, providing clients with everything from customer contact to call transfers to the full sale of goods, services and products. We're a proud sister company of Quicken Loans, America's #1 online mortgage lender, which has been rated one of FORTUNE magazine's \"Best Companies to Work For\" for the past 14 years.What You'll Do/NeedThe Senior Data Analyst is involved in special projects from senior leaders that involve digging into market intelligence and industry trends. This team member has the autonomy to execute and the responsibility to achieve results. ResponsibilitiesFocus on answering business questions using data by bridging data and business insightsBe a SQL guru and know the database in and outWrite queries to answer questionsBuild automated reports/dashboardsRequirements1 year of previous experience as a SQL Developer or Data AnalystStrong technical knowledge of SQL and data analysisSelf-motivated approach, to gain information and understandingWillingness to ask questions and build networks/relationships with other departments What You'll Get Paid trainingStrong growth and leadership opportunitiesWhy We're Different Meet the anti-corporate culture of Rock Connections, where there's no daunting hierarchy, \"boss\" is a four-letter word, and if you work hard, you're the one who will reap the rewards, both personally and professionally. More than any other place you'll work, we're dedicated to honing your skills, helping you grow and making sure you have plenty of fun while you're at it.  Rock Connections is an equal opportunity employer.Apply"}