{"jobID": "2360002339", "jobLocation": "Detroit_MI", "jobTitle": "Mortgage Loan Officer", "companyRating": null, "companyInfo": {"Website": "www.quickenloans.com", "Headquarters": "Detroit, MI", "Size": "10000+ employees", "Founded": " 1985", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Citi, Bank of America, Wells Fargo"}, "estimatedSalary": null, "jobDescription": " Who We Are We’re America’s largest mortgage lender, closing loans in all 50 states. J.D Power ranked Quicken Loans “Highest in Customer Satisfaction in Primary Mortgage Origination” for the past eight consecutive years, 2010 – 2017. The company was also ranked highest in the nation for client satisfaction among mortgage servicers by J.D. Power for four consecutive years, 2014 through 2017, each year the company was eligible. There’s a simple reason we’ve been so successful: We care about the people we work with. If you’re tired of stuffy, bureaucratic workplaces, then you’ll be delighted to find something different here. We strive to make a creative, fun and collaborative environment you simply won’t find anywhere else. Quicken Loans was named #1 in ESSENCE Magazine’s first ever list of “Best Places to Work for African Americans” in 2015. We've been on Computerworld's \"Best Places to Work in IT\" list for 13 years running, hitting #1 the last five years. We were also ranked #14 in FORTUNE Magazine’s list of \"100 Best Companies to Work For\" in 2018, remaining in the top-30 for the past 15 years. What You'll Do/Need Become an “Intrapreneur”If you’re passionate when it comes to sales, want high earning potential and don’t fit the 9-to-5 mold, then a career in mortgage banking might be right for you. Quicken Loans Mortgage Loan Officers own their own business within our business and are given a wide variety of options on how to accomplish individual and team goals. And like all successful entrepreneurs, they work hard, think creatively and earn big. As the faces of the Quicken Loans experience, our Mortgage Loan Officers:Complete and pass all assigned Mortgage Banker training and licensing activities – 15 weeks of Mortgage Banker training and licensing completely paid by Quicken LoansConsult with our clients about current and future needs in achieving their financial goalsDeliver world-class client service and establish ongoing financial services relationships Interview clients to gather information about their unique financial situations, needs and objectivesUse state-of-the-art technologies to conduct credit, underwriting and financial analyses to qualify clients for various loan programsEvaluate various loan programs and affordable financing plans from a broad range of Quicken Loans mortgage optionsEducate and advise clients on the home buying process and how to best manage their mortgage(s)Ensure exceptional client experiences with ongoing communication throughout the entire loan processProtect Quicken Loans interests and our reputation as the nation’s largest online retail mortgage lender and the second largest retail mortgage lender in the U.S.What You NeedTo become a successful Quicken Loans Mortgage Loan Officer, you need:A positive attitude and the desire to truly help peopleThe ability to rock in a fast-paced, dynamic environmentSuperb communication skillsThe spirit of an entrepreneur What You Don’t NeedQuicken Loans Mortgage Loan Officers come to us from different places in their career journeys. We don’t expect candidates to have: Lending experience or a finance degree. We’ll teach you everything you need to know. Seriously.The ability to make cold calls. You’ll only talk to people who are already looking to buy or refi.  What You'll Get 15 weeks of really fantastic Mortgage Banker training. On-the-job coaching and real-time feedback.Excellent compensation and benefits.Sweet bonuses, trips, tickets and cash money.Cutting edge, lightning fast technology (We call it “Rocket Mortgage” for a reason).DisclaimerQuicken Loans is a proud equal opportunity employer. Candidates must meet National Mortgage Licensing System (NMLS) and Secure & Fair Enforcement for Mortgage Licensing Act (SAFE Act) requirements.Quicken Loans received the highest numerical score in the proprietary J.D. Power 2010 – 2016 Primary Mortgage Origination studies and the 2014 – 2016 Primary Mortgage Servicer studies. 2016 Origination (or Sales) based on 5,182 total responses and measures experiences and perceptions of consumers who originated a new mortgage, surveyed in July – August 2016. 2016 Servicing based on 7,542 total responses and measures experiences and perceptions of consumers with their current mortgage servicer, surveyed in March – April 2016. Your experiences may vary. Visit JDPower.com.​Apply"}