{"jobID": "2828440959", "jobLocation": "Washington_DC", "jobTitle": "Data Management Analyst III", "companyRating": "3.7", "companyInfo": {"Website": "www.fanniemae.com", "Headquarters": "Washington, DC", "Size": "5001 to 10000 employees", "Founded": " 1938", "Type": " Company - Public (FNMA) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Freddie Mac"}, "estimatedSalary": "106000", "jobDescription": "THE COMPANY Fannie Mae provides reliable, large-scale access to affordable mortgage credit in communities across our nation. We are the leading source of funding for housing in America, which means more people can buy or rent a home. We are focused on sustaining the housing recovery, improving our company, and leading change to make housing better.  Join our diverse, high-performing team and make a difference as we work together to enable access to a good home.  For more information about Fannie Mae, visit http://www.fanniemae.com/progress JOB INFORMATION This position establishes, maintains, and communicates standards for recording, searching, and reporting data kept in the enterprise's databases and warehouses. This position documents data flows, data mappings, performs data lineage analysis as required by various enterprise projects. This position confers as needed with other technical staff to plan database conversion projects, or to establish large scale mining, reporting, or data display exercises. Leads or provides technical assistance to data projects or operations to maintain enterprise-wide standards and attain more efficient use of data resources. Researches, assesses, and reports use of data standards and ways in which they can be modified as needs change and corporate platforms develop. KEY JOB FUNCTIONSCollaborate with business partners, technical partners, and representatives from other organizations to understand and evaluate their requirements regarding data, and ensure they are meet the needs and conform to the enterprise standards. Perform any necessary data mapping and data lineage activities, documents information flows. Manage initiatives focused on implementing enterprise data management capabilities. Align enterprise data management activities with industry best practices. Develop metrics associated with core job functions, exhibiting how better data management practices improve business value. Align data management efforts/initiatives directly to providing business value. Work with manager to monitor use and form of reporting data in multiple platforms and reports throughout the organization. Contribute to developing and communicating corporate and regulatory standards for using, providing access to, and reporting data, and to the compliance framework for tracking the implementation of these standards. Request and track reporting from departmental units on use of and security standards for data used in variety of databases and warehouses. Assist manager in establishing data security guidelines for data subject to specific regulatory requirements. Communicate with organizational units concerned with risk management, legal compliance and privacy to ensure unit's standards and practices are consistent.EDUCATIONBachelor's Degree or equivalent requiredMINIMUM EXPERIENCE4+ years of related experienceSPECIALIZED KNOWLEDGE & SKILLSAdvanced skill with MS ExcelAbility to manage organized meetings with clear purpose and well defined take-awaysExcellent verbal and written communication skills in order to support change management and issue resolution.Ability to solve complex problems independently when developing solutionsAbility to juggle multiple activities and tight timelinesComfort in working closely with management at various levelsHighly organized and detail oriented with strong critical thinking and problem solving skillsAdept at building strong relationships with team members and business and IT partnersEMPLOYMENT As a condition of employment with Fannie Mae, any successful job applicant will be required to pass a pre-employment drug screen and to successfully complete a background investigation.Fannie Mae is an Equal Opportunity Employer."}