{"jobID": "2711246034", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.shift.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "85000", "jobDescription": "Shift is bringing transparency and trust to the used car industry. Data is core to this transformation: from building best-in-class pricing, to loan decisioning, to logistics optimization, to in-product recommendations. If you’re passionate about using data to fix an enormous, antiquated industry, you’ll fit right in.We are seeking a Data Analyst to help us improve our business by performing analysis to support strategic decision making, managing reporting, and work closely with our engineering and data science team to build data pipelines and models. The ideal candidate is highly motivated, committed to learning and personal development, and adaptable to a fast pace environment. The candidate will apply strong business judgement and technical skills to derive valuable insights from data. This is the perfect opportunity for someone with 1-4 years of work experience in an analytical role to gain valuable experience at a high-growth, mobile commerce start-up.The person in this role will have the opportunity to work on analytics problems cross-functionally. In a new product roll-out, they might be tasked with developing a go-to-market strategy or partnering with engineers and product managers to ensure the launch is measurable. In scoping a new pricing structure, they might be tasked with forecasting the impact on our bottom line and providing recommendations on how to modify our pricing algorithms. And in all the ways we test and refine our business, they will partner to design data schemas and performance metrics that provide the views we need to steer our business. Experience with the auto industry or knowledge of cars is a plus but not required.We're looking for someone who will: Develop a deep understanding of specific areas of the business and the key metrics that drive performance. Query data to analyze, monitor, and investigate trendsStructure complex and sometimes ambiguous business issues and develop compelling, insightful recommendationsUse statistics to analyze experiments and build models for use in pricing, marketing, or logisticsManage key performance indicators (KPI’s), automate reporting wherever possiblePerform extensive data QA. Troubleshoot issues and work cross-functionally towards a solutionThe ideal candidate will have:"}