{"jobID": "2661556466", "jobLocation": "Washington_DC", "jobTitle": "Sales Account Executive", "companyRating": "4.3", "companyInfo": {"Website": "www.gotocos.com", "Headquarters": "Columbia, MD", "Size": "51 to 200 employees", "Founded": " 1975", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "45000", "jobDescription": " Sales Account Executive  Job descriptionCapitol Office Solutions (COS) is a subsidiary of Xerox Corporation. We are the elite sales and service provider of office technology solutions. We're a locally run company trusted by the region's businesses since 1976. We are the region's most respected consulting firm specializing in workflow assessment and optimization. We are uniquely positioned to help organizations understand true cost breakdown, asset deployment, and usage patterns to develop sustainable working practices and continuous improvement initiatives. We have successfully led Fortune 500 companies as well as small organizations - in every industry from healthcare to nonprofit to finance - to achieve improved financial results, and operational efficiency, and to reduce their environmental impact. Our COS360 process allows us to assist companies of all sizes and industries, by reducing operational expenses while improving business processes. Our Culture is one of training, development, career advancement, being successful and yes having fun along the way!As a Sales Account Executive here's some of the things you will be doing:Provide state-of-the-art technology solutions to businesses in your assigned local territoryUtilize COS360 selling process by analyzing the needs of the customer and develop a customized solutionGenerate net new business and maintain long term relationships with existing customersMeet forecasting objectives by a focused cadence to sales activityMaintain CRM with daily sales activities: phone calls, prospecting, appointments, assessments, demos, etc.We offer great benefits!Professional Sales TrainingLeadership DevelopmentCompetitive Base Pay + UNCAPPED CommissionPaid Parking and Monthly Mileage Reimbursement401K with Company MatchMedical/Dental/VisionShort & Long Term DisabilityEducational AssistanceSales Incentive/President's Club TripsPaid Vacation and HolidaysMuch more......RequirementsQualifications:Passion for sales and the ability to drive your own successHigh energy with an entrepreneurial attitude and strong business acumenExcellent communication (oral and written) and presentation skillsStrong customer service and relationship management skillsAbility to work collaboratively in a team oriented environmentDeadline drivenEducation And/Or Experience: BS/BA in business or other related field  Previous business-to-business sales experience a plus Requirements: Drivers License  Ability to travel to customer sites, offsite meetings, company related functions"}