{"jobID": "2815291922", "jobLocation": "Farmington_Hills_MI", "jobTitle": "Manager in Training", "companyRating": "4.3", "companyInfo": {"Website": "www.beztak.com", "Headquarters": "Farmington Hills, MI", "Size": "501 to 1000 employees", "Founded": " 1940", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Paragon Properties, Broder & Sachse Real Estate, Brookdale Senior Living"}, "estimatedSalary": "48000", "jobDescription": " MANAGER-IN-TRAINING (MIT) JOB DESCRIPTION  Reports to: Property Manager FLSA Status: Exempt, Full-time CUSTOMER SERVICE EXPECTATION FOR ALL ASSOCIATESProvide exceptional Customer Service at all times o Personal Contact with residents preferred and always greet residents by name and with a smile  o Each associate is to provide resort-style customer service during all day interaction on-site  o Return all phone call messages and email messages the day they are received  o Respond to all resident requests within 24 hours POSITION OVERVIEW The MIT works at a specific property and assists the Property Management team, as well as helps to leasing the property. The MIT receives hands-on practical leadership training in Leasing/Marketing, Operations, Facilities/Maintenance, Financials, as well as other essential core areas. ESSENTIAL JOB FUNCTIONS AND RESPONSIBILITIESLEASING DUTIESPerforms all the following leasing activities: converts 75% phone inquiries to on site appointments; tours prospects through site and models; executes sales/closing techniques with a minimum 40% closing ratio; and prepares all required lease documentsCoordinates efforts to ensure that the leasing office, model, vacant units, and common areas are in perfect condition on a daily basis emphasizing the importance of first impressions and the image portrayed by the staffEnsures that all prospective residents receive follow up within 24 hours via thank you card, phone call and/or e-mail until decision is made. Logs results in lost rental reportMaintains awareness of local market conditions. Submits ideas and suggestions for marketing the property, improving occupancy and resident satisfactionResponsible for accuracy and timeliness of all reports generated for leasing purposes. Ensures that the leasing staff is familiar with all such reportsOversees the lease application process. Submits completed application to manager for approvalDevelops monthly marketing plan for property in conjunction with needs of propertyEstablishes weekly leasing goals to achieve budgeted occupancy levelsOversees outside marketing to major employers on a weekly basis (known as outreach)Conducts weekly departmental meetings to review leasing strategies and goals, marketing plans, policies, and proceduresObtains and follow-up on leads for new leasing opportunities with local business and relocation companies, provides them with brochures and information, and develops and maintain a relationship with contact person PM DUTIES (Under supervision of Property Manager) Adheres to established policies related to fair housingPerforms general office duties: answers the telephone, writes service requests, follows-up on completed or pending service requests, files, monitors, and orders office supplies and printed materialMaintains and enhances relations with prospects, residents, staff and vendorsCommunicates with co-workers, management, residents, vendors, and all outside contacts in a courteous and professional mannerPerforms leasing and Assistant Manager duties, if necessary; maintain a closing ratio of 35% or better on all traffic shown. Maintains an overall property-closing ratio of 35% or better.Plans, organizes, promotes and implements resident functions in conjunction with the staffReviews/approves lease applications in accordance with Beztak leasing guidelines. Ensures that all leases are properly endorsed and accuratePerforms regular property inspections for cleanliness, curb appeal, and to ensure property is free of hazardsCompletes required reports including weekly, monthly, quarterly leasing, variance reportingOversees Accounts Receivable ensuring rents and all other applicable fees are billed and collected. Ensures that collection and demand notices are generated, delivered and/or posted as required by local laws.Endorses, posts, and makes bank deposits dailyOversees all service and capital contracts for timeliness and workmanship. Maintains required certificates of insuranceOversees/completes computerized accounting functions for accuracy and timeliness. Including SODA refunds and interest paymentsOversees the process of turning over a unit to make available for next renter by conducting a pre-move-in inspection. Conducts move-out inspections and assesses charges if appropriateMaintains confidentiality of co-workers, management, owners, past and current residents, vendors, and all outside contactsREQUIREMENTSMIT candidate must have a Bachelors DegreeMIT must demonstrate the essential Professional QualitiesSatisfactory supervisory and problem-solving skills, as well as, ability to handle multiple tasks in an organized and efficient mannerAn excellent understanding of accounting practices and proceduresPHYSICAL DEMANDS The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  While performing the duties of this job, the employee is continually required to: Stand; walk; sit; use hands to finger, handle or feel; reach with hands and armFrequently required to climb stairs, balance; stoop, kneel, crouch, or crawl; talk or hearOccasionally lift and/or move up to 50 poundsDISCLAIMER The above information on this description has been designed to indicate the general nature and level of work performed by employees. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job. Management reserves the right to add to or modify the duties and/or responsibilities of the Manager-In-Training position at any time."}