{"jobID": "2481025661", "jobLocation": "Chicago_IL", "jobTitle": "Quantitative Researcher", "companyRating": null, "companyInfo": {"Website": "www.ssgllc.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " At SSG we have brought together some of the worlds brightest traders, researchers, and technologists to collaborate and solve some of the most intellectually stimulating and technically challenging problems faced in any industry. Our cross discipline team holds degrees in Computer Science, Electrical Engineering, Math, Physics, and Statistics. We share ideas and collaborate to maximize our differing experiences and backgrounds. Our team finds inspiration everywhere, including academia and parallel industries, sparking our next great ideas.  As a researcher in this team you will focus on gleaning insights from vast, heterogeneous, high dimensional data sets. Utilizing novel statistical and machine learning approaches, you will build the models that drive our alpha forward and uncover new trading opportunities. Our research teams close collaboration with technology necessitates a strong understanding of algorithms and experience developing software in C++.  Are you driven by your intellectual thirst? Are you grounded by your pragmatism? Do you hold yourself accountable, while working well with others?  Necessary Skills Academic research experience in a highly quantitative discipline (Computer Science, Physics, Math, Statistics, Engineering, etc).Strong understanding of machine learning, statistical approaches and predictive modeling techniques (including regression analysis, neural networks, genetic algorithms, SVM, etc.), the underlying assumptions they make, their limitations, and the proper use case for each methodology.Proven ability to apply these modeling approaches to identify and forecast with a high level of out of sample accuracyExperience developing software in both high and low level programming languages."}