{"jobID": "2823073785", "jobLocation": "Costa_Mesa_CA", "jobTitle": "Analytical Chemist II", "companyRating": "4.4", "companyInfo": {"Website": "www.pyramidlabs.com", "Headquarters": "Costa Mesa, CA", "Size": "51 to 200 employees", "Founded": " 1988", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "43000", "jobDescription": "POSITION TITLE: Analytical Chemist II REPORT TO: Director of Analytical Services SUPERVISES/DIRECTS: N/A POSITION SUMMARY: PYRAMID Laboratories, Inc. is a contract Manufacturing and Analytical Services facility located in Costa Mesa, California. The company has an excellent reputation within the industry and is seeking an experienced pharmaceutical analytical Chemist to perform cGMP analysis. The company has a great working environment and state-of-the-art equipment. PRINCIPAL DUTIES: • In a cGMP environment, perform analytical methods for testing raw materials, in-process and finished products, including stability testing. Operate and maintain general analytical instrumentation, such as HPLC, GC, IC, spectrophotometers, etc., performing preventative maintenance and calibration.Perform HPLC and GC stability indicating method development, validation and method transfers.Prepare standard, reagent and sample preparations as required by the analytical method SOPs.Maintain appropriate documentation (records and lab notebooks), as required, in compliance with all cGMP/GLP requirements, laboratory SOP’s and Company policies and procedures.Review and evaluate analytical data, write reports, and ensure compliance with methods, procedures, and standards is maintained.Evaluate and implement specific QA/QC criteria and have the ability to determine appropriate application and associated decision in regards to QA/QC validation and/or acceptance.Perform other related duties and responsibilities as assigned. MINIMUM QUALIFICATIONS/REQUIREMENTS: • Candidates must have a B.S./M.S./PH.D. in Chemistry or a closely related science, and 3 years of experience.Expertise with a wide variety of analytical instrumentation and general laboratory skills and techniques.Experience with Chromeleon software and Agilent HPLC systems a plus.Understanding and implementation of cGMP requirements.Strong oral & written communication skills.Computer proficiency.Good problem-solving aptitude, detail oriented, and multi-tasking skills. To apply for this position, please email your resume with cover letter to info@pyramidlabs.com ."}