{"jobID": "2824639608", "jobLocation": "Secaucus_NJ", "jobTitle": "IT Advisor, Data and Analytics (Data Scientist) (Senior Manager)(Multiple Positions)", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " IT Advisor, Data and Analytics (Data Scientist) (Senior Manager) (Multiple Positions) Ernst&Young; U.S. LLP, Secaucus, NJ.  Provide clients with a unique business perspective on how data science and analytics can transform and improve the entire organization. Explain data science, concepts, tools, features, functions and the benefits of different approaches to apply them to incorporate data into decision making and solve business problems. Lead large scale engagement that help clients make data-driven decisions by working with structured and unstructured data sets, building out predictive models and advising clients on data mining leading practices. Apply data mining and statistical analysis techniques like hypothesis testing, segmentation and modelling to analyze large amounts of data. Build and apply data analysis algorithms for data mining, statistics, machine learning, natural language processing, sentiment analysis and text mining. Design, architect and develop solutions leveraging big data technology such as Open Source, Hortonworks, AWS or Microsoft to ingest, process and analyze large, disparate data sets to exceed business requirements. Communicate findings, recommendations and opportunities to improve data systems and solutions. Look for opportunities for improving methods and outcomes. Apply a data driven approach (KPIs) in tying technology solutions to specific business outcomes. Drive high-quality work products within expected timeframes and on budget. Ensure key stakeholders are kept informed about progress and expected outcomes. Manage expectations of client service delivery.  Lead and direct teams of professionals with diverse skills and backgrounds by providing constructive on-the-job feedback/coaching to team members. Develop and maintain long-term client relationships and networks. Manage risk in the delivery of quality client services. Generate and manage new business opportunities.  Full time employment, Monday Friday, 40 hours per week, 8:30 am 5:30 pm. MINIMUM REQUIREMENTS: Bachelor's degree in Mathematics, Management Information Systems, Statistics, Computer Science, Business or a related field and 8 years of progressive, post-baccalaureate related work experience; or a Master's degree in Mathematics, Management Information Systems, Statistics, Computer Science, Business or a related field and 7 years of related work experience.  Must have 6 years of experience in providing advisory services with a strategic focus in helping clients achieve transformational value by improving performance and mitigating risk through the use of advanced analytics solutions  Must have 6 years of experience driving revenue within existing clients and developing new prospects at the \"C\" level of Fortune 500 companies by understanding and translating business challenges into value add analytics solutions  Must have 6 years of Analytics engagement leadership experience including: leading a team of consulting professionals on multiple projects, providing regular status updates, monitoring project economics, hands on technical expertise and managing client relationships  Must have 6 years of hands-on experience with data science, big data, and data engineering  Must have 4 years of hands-on experience with various big data technologies in one of the following ecosystems: Hadoop, AWS or Microsoft  Must have 4 years of experience with 3 of the following data sources and structures: APIs, NoSQL, RDBMS, Hadoop, S3, and Blob Storage  Must have 5 years of experience working on solid pattern recognition and predictive modelling  Must have 5 years of experience working on data mining and statistical tools  Must have 3 years of experience with statistical modeling, ETL and data ingestion/cleansing  Must have 3 years of experience setting up data and experimental platforms  Must have 3 years of experience using R or SAS, Python, Java/C#, Scala, SQL, Hive and Pig  Must have 3 years of experience using machine learning algorithms including neural networks, k-NN, naive bays, decision trees and SVM  Must have 3 years of experience using recommendation engines, scoring systems, and A/B testing  Travel required up to 80%, to serve client needs  Employer will accept any suitable combination of education, training or experience.  TO APPLY: Please apply on-line at ey.com/us/jobsearch (Job Number SEC001E2).  This particular position at Ernst&Young; in the United States requires the qualified candidate to be a \"United States worker\" as defined by the U.S. Department of Labor regulations at 20 CFR 656.3. You can review this definition at https://www.gpo.gov/fdsys/pkg/CFR-2011-title20-vol3/pdf/CFR-2011-title20-vol3-sec656-3.pdf at the bottom of page 750. Please feel free to apply to other positions that do not require you to be a \"U.S. worker\"."}