{"jobID": "2826736046", "jobLocation": "Southfield_MI", "jobTitle": "Analyst/Senior Analyst, Analytic Reporting", "companyRating": null, "companyInfo": {"Website": "www.creditacceptance.com", "Headquarters": "Southfield, MI", "Size": "1001 to 5000 employees", "Founded": " 1972", "Type": " Company - Public (CACC) ", "Industry": " Finance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Analyst, Analytics Reporting/Senior Analyst, Analytics ReportingWhy Work For Credit Acceptance? Credit Acceptance is a rapidly-expanding company with extensive growth opportunities. We are proud to say, for the 5th year in a row, we have been named one of Fortune Magazine's 100 Best Companies to Work For. Our team members and culture create a positive workplace that drives us to succeed, making Credit Acceptance one of the largest used car finance companies nationally.  We offer a great work environment, awesome team members, competitive benefits, progressive career opportunities, a casual dress code and we work hard to ensure every team member is empowered to work to their fullest potential. Credit Acceptance offers team members:Extensive growth opportunities as demonstrated by our track record of promoting internallyAn atmosphere that is collaborative, challenging, and filled with forward thinking team membersOngoing business training and career development opportunitiesStrong work-life balance with generous PTO beginning on day 1Competitive market-based salary with quarterly profit sharing and annual merit bonusesExcellent benefits package that includes 401(K) match, adoption assistance, tuition reimbursement, comprehensive medical/dental/vision along with additional benefits that make us a great place to workWe are hiring an Analyst, Analytics Reporting within our Analytics Department. Responsibilities in your area will include: Actively monitor and report on the performance of models in productionAnalyze data to drive better business decisionsDevelop complex programming to extract and manipulate dataCreate reports regarding key performance indicators (KPI's)Investigate reporting trendsRun ad hoc data requests for key business usersProvide fraud related triggers reportingAutomate recurring reportsWho Are We Looking for? Our ideal candidate for this role needs to: Monitor and maintain complex statistical models with the goal of optimizing high volume decisions to add intrinsic value to Credit AcceptanceDevelop and produce reports to measure the performance of processes, models, and strategiesPerform data analysis to solve business problems and drive better decisionsTranslate high level business goals into the tasks and technical specifications needed to accomplish the goalApply analytical skills to solve problems creativelyExtract and manipulate large data setsCommunicate complex information to others in a way they can understandBe self-motivated and able to perform with minimal supervisionRemain compliant with our policies, processes and legal guidelinesWork onsite at the required Credit Acceptance work location.Position Qualifications:Required Qualifications: Level will be dependent on experience.  Analyst: Bachelor's degree or higher (Computer Science, Economics, Mathematics, Statistics, Business Analytics, etc. - preferred).1+ years professional experience with SAS, SQL, R or other statistical programming language (SAS/SQL preferred).Experience achieving objectives with minimal supervision. Senior Analyst: Bachelor's degree or higher (Computer Science, Economics, Mathematics, Statistics, Business Analytics, etc. - preferred).3+ years' experience with SAS, SQL, R or other statistical programming language (SAS/SQL preferred).Experience creating reports and performing analysis in an analytical tool or in a business intelligence setting.Ability to work on multiple competing priorities.Experience achieving objectives with minimal supervision.Strong analytical problem solving skills.Preferred Qualifications: Analyst: Experience creating reports and performing analysis in an analytical tool or in a business intelligence setting1+ years experience in auto lending analyticsRecent small company experience Senior Analyst: 1+ years' experience in auto lending analyticsRecent small company experienceExperience mentoring or providing guidance to less senior team membersDemonstrated ability to work on projects with broad requirements Company Core Values:  To be successful in this role, Team Members need to demonstrate the characteristics of PRIDE in their work: Positive: Maintain a positive attitude by focusing on solutions and promoting a collaborative and enjoyable environmentRespectful: Value teamwork, share successes, appreciates others and communicates in a way that promotes trustInsightful: Make timely well-considered decisions, create innovative solutions and continuously learnDirect: Communicate clearly and objectively; don't be afraid of difficult conversations. Raise concerns through the proper channelsEarnest: Be honest, sincere and consistent. Work hard and pursue our goals together relentlessly Required degrees must have been earned at institutions of Higher Education which are accredited by the Council for Higher Education Accreditation or equivalent  Credit Acceptance is an equal opportunity employer"}