{"jobID": "2799341206", "jobLocation": "Santa_Clara_CA", "jobTitle": "Senior Staff Data Engineer", "companyRating": "3.4", "companyInfo": {"Website": "www.huawei.com", "Headquarters": "Shenzhen, China", "Size": "10000+ employees", "Founded": " 1987", "Type": " Company - Private", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " Ericsson-Worldwide, Cisco Systems, Apple"}, "estimatedSalary": "163000", "jobDescription": "Huawei is a leading global information and communications technology (ICT) solutions provider. Through our dedication to customer-centric innovation and strong partnerships, we have established end-to-end advantages in telecom networks, devices and cloud computing. We are committed to creating maximum value for telecom operators, enterprises and consumers by providing competitive solutions and services. Our products and solutions have been deployed in over 170 countries, serving more than one third of the world’s population. Huawei has over 180,000 employees, approximately 80,000 of which are engaged in Research & development. Huawei operates a global network of 12 regional headquarters, 14 R&D; Centers, 36 Innovation Centers jointly operated with customers, and 45 Training Centers. Huawei is leading the way by rethinking the future. From devices to telecom infrastructure to cloud computing and convergence solutions, we are rethinking every link in the chain with ICT based innovation to deliver a better future...faster. Senior Staff Data Engineer Location: Santa Clara, CA (R&D;) Req #: 9678 # of Openings: 1 DescriptionFuturewei Mobile Services provides Internet services such as App/Video/Music/Book Stores, News Feeds, Payment and Cloud Storage for Huawei mobile phones, wearables and smart home devices.  Silicon Valley R&D; Center is looking for an experienced Data Analyst to join our Ads Technology team. The ideal candidate should have deep understanding of the entire process of data collection, data analysis and business intelligence (BI) reporting. Candidate will help optimizing operation rules base on big data analysis, select campaign audience, and monitor/optimize advertisement performance. Candidate also will help analyze current product designs and recommend improvement in products and processes.  DUTIES AND RESPONSIBILITIES: Essential Functions Define, measure and track metrics of key features like advertisement campaigns and audience targetingEvaluate the effectiveness and accuracy of 1st part and 3rd party data sources, and improve data gathering techniquesBuild qualitative and quantitative models to deepen understanding of business operations, root cause of changes and predict business and user trendsUse proper visualization techniques to tell data stories, make analysis results conducive to decision-making.Work on routine tasks both independently and with the multi-teams including PM/Engineering/Data Scientist JOB SPECIFICATIONS (Education, Knowledge, Skills, and Abilities); (refers to job, not incumbent) Education: Minimum: Bachelor's Degree  Preferred: Master's Degree  Major/Discipline: Mathematics/Computer Science/Statistics  Relevant Work Experience  Minimum: 4+ year of data analysis experience  Preferred: 6+ years of data analysis experience  Skills & Abilities: (Technical or General) Minimum Requirements:4+ years’ experience in Internet services industryHands-on experience with Big Data platform (Hadoop, Hive, etc), Databases (MySQL, Cassandra, etc), pipeline programming (Python, R, Pig, Java, etc.) and visualization frameworks (Tableau, etc.)Strong analytical skills and detail oriented. Excellent analytical thought process – ability to understand the question, and devise an analytical approach to reach actionable answersExcellent written and verbal communication skills for coordinating across teamsPreferred:Experience interpreting quantitative data, constructing predictive models, providing output to identify trends, interpret findings, draw insights, and formulate recommendationsKnowledge and experience in Operational Excellence methodologies (Systems Thinking, Root Cause Analysis, Design for Six Sigma, etc.)Background in Digital Advertising data analysis is a plusHuawei Inc. is proud to be an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law."}