{"jobID": "2539888029", "jobLocation": "Livonia_MI", "jobTitle": "Data Analyst Specialist", "companyRating": "3.4", "companyInfo": {"Website": "www.trinity-health.org", "Headquarters": "Livonia, MI", "Size": "10000+ employees", "Founded": " 1976", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " HCA Healthcare, Vanguard Health Systems"}, "estimatedSalary": "68000", "jobDescription": "Department: IS101_71527 Data Warehouse Expected Weekly Hours:40Shift:Position Purpose: The Data Analyst Specialist is responsible for the creation and maintenance of source to target mappings for the Data Warehouse group. They will be considered the subject matter experts for multiple source and target systems and the business rules for transforming the data. The Data Analyst Specialist is responsible for understanding and applying technical skills to solve data related issues. They will have a deep understanding on how the Business uses the data for analysis and the applications that generate and store the source information. They will work closely with the Data Developers and Data Governance ensuring the quality of our products. This position requires developing, testing, documenting and implementing solutions, utilizing the standard portfolio of tools where appropriate and integrating internal and external application logic. The Data Analyst Specialist will participate and lead in the design and enhancement of the foundational data models, both logical and physical. Job Description Details: This position will focus on data analysis tasks within clinical space for various subject area within IDW solutions. Responsible for the creation and maintenance of source to target mappings for the Data Warehouse group. Serves as subject matter experts for multiple source and target systems and the business rules for transforming the data. Responsible for understanding and applying technical skills to solve data related issues. Provides a deep understanding on how the Business uses the data for analysis and the applications that generate and store the source information. Works closely with the Data Developers and Data Governance ensuring the quality of our products. Develops, tests, documents and implements solutions, utilizing the standard portfolio of tools where appropriate and integrating internal and external application logic. Participate in the design and enhancement of the foundational data models, both logical and physical. Trinity Health's Commitment to Diversity and Inclusion Trinity Health employs more than 120,000 colleagues at dozens of hospitals and hundreds of health centers in 21 states. Because we serve diverse populations, our colleagues are trained to recognize the cultural beliefs, values, traditions, language preferences, and health practices of the communities that we serve and to apply that knowledge to produce positive health outcomes. We also recognize that each of us has a different way of thinking and perceiving our world and that these differences often lead to innovative solutions.  Trinity Health's dedication to diversity includes a unified workforce (through training and education, recruitment, retention and development), commitment and accountability, communication, community partnerships, and supplier diversity."}