{"jobID": "2833332041", "jobLocation": "Deerfield_IL", "jobTitle": "Senior Product Analytics Manager - Pharmacy Platforms", "companyRating": "3.2", "companyInfo": {"Website": "www.walgreens.com", "Headquarters": "Deerfield, IL", "Size": "10000+ employees", "Founded": " 1901", "Type": " Company - Public (WBA) ", "Industry": " Retail", "Revenue": " $10+ billion (USD) per year", "Competitors": " CVS Health, Target, Walmart"}, "estimatedSalary": "111000", "jobDescription": " Job Summary  This is a lead role responsible for strategizing how to do product analytics on a cross-domain level, as well the approach. This role will lead, set up and analyze A/B tests for new products, generate and size opportunities to prioritize features, and define key performance metrics for the team. This role will also help shape and guide others through mentorship and advocacy.  Job Responsibilities Develops a deep understanding of Walgreens' products. Responsible for strategizing how to do product analytics on a cross-domain level, as well the approach. In addition, this role will provide strategic insights that helps the Product Managers shape their product path. Works as part of the leadership team giving input and recommendations to the product visions and strategies.Identifies key business levers, establish cause & effect, perform analyses, and communicate key findings to various stakeholders to facilitate data driven decision-making. Identifies new opportunities to grow and optimize the business through analytics, financial modeling, and business case development.Identifies, translates, prioritizes and informs important product questions with dataExplores data to find actionable insights and make product recommendations through funnels, cohort analyses, long-term trends, user segmentation, regression models, and moreAnalyzes complex system behavior from multiple sources, performance, and application monitoring data. Deliver insights into signup & payment conversion and landing page performance by geography and product segment.Analyzes channel performance, design and execute experiments, research, financial models and other mechanisms to identify, evaluate and prioritize opportunities.Identifies key metrics and build exec-facing dashboards to track progress of the business and its highest priority initiatives.Performs highly analytical deep-dives to identify root cause and mitigation opportunities or specific actions to add value.Works closely with other teams across the matrix environment. Shares information cross-functionally to improve workflow processes. Interacts with direct reports and peers in management / customers / vendors to share information and improve cross-departmental processes.May allocate available resources to meet operating objectives. May develop and mentor staff through on-boarding, open communication, training and development opportunities and performance management processes; builds and maintains employee morale and motivation; ensures the team is appropriately staffed with required competencies; fosters a diverse and inclusive workplace. Walgreens, one of the nation's largest drugstore chains, is included in the Retail Pharmacy USA Division of Walgreens Boots Alliance, Inc., the first global pharmacy-led, health and wellbeing enterprise. More than 10 million customers interact with Walgreens each day in communities across America, using the most convenient, multichannel access to consumer goods and services and trusted, cost-effective pharmacy, health and wellness services and advice. Walgreens operates 8,175 drugstores with a presence in all 50 states, the District of Columbia, Puerto Rico and the U.S. Virgin Islands. Walgreens omnichannel business includes Walgreens.com. Approximately 400 Walgreens stores offer Healthcare Clinic or other provider retail clinic services.  As the neighborhood drugstore and retailer, our goal is to make health and happiness simpler, easier and within reach. And we remain a trusted wellness provider offering convenient access to important health services, such as immunizations and an array of pharmacy services that can help patients improve their health. To our team members, Walgreens represents a unique opportunity to excel in their careers in a welcoming and inclusive environment. We offer the chance to work in a truly supportive environment, and be a part of a progressive organization dedicated to the well-being of our customers, team members and the communities we all call home. #LI-AT1 Basic Qualifications  Basic Qualifications Bachelor's degree in a technical or statistical discipline and at least 7 years of experience working in analytics field OR a High School Diploma/GED and at least 10 years of experience working in an analytics field)Experience handling large data sets and crunching numbers.Experience with SQL or other software engineering languages (Python, C++, Java).Experience with web analytics (Google Analytics, Site Catalyst), statistical packages (SAS, R), and/or visualization tools (Qlikview, Tableau).Experience transferring business questions into structured analysis and data analytics into business insights.Experience translating complex problems in simpler terms and to non-technical audiences.Experience influencing both peer and senior leadershipWilling to travel up to 10% of the time for business purposes (within state and out of state). Preferred Qualifications  Preferred Qualifications Bachelor's degree or higher in Computer Science, Statistics or MathematicsExperience with experimentation and A/B testing Apply Save jobSavedSDL2017"}