{"jobID": "2519376709", "jobLocation": "Battle_Creek_MI", "jobTitle": "Customer Service Representative - Customer Interaction Center", "companyRating": null, "companyInfo": {"Website": "www.peckham.org", "Headquarters": "Lansing, MI", "Size": "1001 to 5000 employees", "Founded": " 1976", "Type": " Company - Private", "Industry": " Non-Profit", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Description:*These jobs are part of Peckham's vocational rehabilitation efforts. Applicants are eligible to apply for these positions if they have a disability that has created a barrier to employment.Important information about this position:Full time positions are available. Other Important Details:Locations: Battle Creek, MIHours of Operation: 24/7Wage: $14.99 + Health and welfare benefit of $4.13 per hour to purchase benefitsApplicants: Persons with disabilities and Veterans are strongly encouraged to apply and will be given preference in the hiring process.Position Summary:This is a government contractor Customer Service position. Customer Service Representatives (CSR) in this position will be responsible for providing support through phone, email and facsimile correspondence with customers. The activities associated with this position include identification, documentation, prioritization and escalation or resolution of customer requests. Additionally, the CSR will encounter the need to utilize problem solving skills and multiple databases with proprietary government Customer Interaction Center systems.Minimum Hiring Requirements: High School Diploma or equivalentHave a qualifying disabilityEnglish language proficiency both spoken and writtenU.S. CitizenGood credit historyNo criminal misdemeanor or felony recordMinimum Requisite Skills and Knowledge:Oral and written communication skills sufficient to facilitate clear and accurate information exchanges with customersAbility to control the pace and flow of the inquiry/request and manage call time effectivelyAbility to handle inquiries and requests in a courteous and professional manner, including calls received in crisis situationsAbility to follow protocol and to apply sensitivity and discretion in handling confidential informationAbility to gather information to determine customers needs; apply problem solving skills and resolve the inquiry/request effectivelyComputer and keyboarding skills sufficient to record information from the inquirer in an accurate and efficient mannerAbility to respond to inquiries in English; both written and verbalAbility to take direction within a team setting and complete team related work promptlyKey CompetenciesOral and written communication skillsFluency in EnglishLearning skillsCustomer service orientationProblem analysis and problem-solvingAbility to work independently and as part of a teamAdaptabilityPlanning and organizationAttention to detailStress toleranceTraining and Continuous Education:This position may require initial training, on the job training, subsequent training and continuing education of which will be outlined and facilitated by the training department or some other approved means. Security: Many of the positions through the Business Services Division require a security clearance. Thus, the candidate/employee must pass and maintain appropriate security and background checks as required for each area and/or contract. The extent of the security and background check may vary by position. Employment may also be contingent upon successful security and background checks and may be run on an ad hoc basis. Required security and clearance checks will be completed at no financial cost to the candidate.To determine if you are a potential candidate for this position a review of the following may apply:A criminal background/history inquiryEmployment verificationDrug screeningCredit historyThe following may impact your ability to gain the required authorization:Poor credit, bankruptcy in the past 2-3 years and/or delinquent paymentsPrevious termination from previous employment that involves theft or other negligent actions on your partDrug or alcohol useFailure to be honest when responding to the required Federal Security Clearance questionsClearance investigations can/will go back as far as 7 years or more.Qualifications: To perform this job successfully, an individual must be able to perform each essential duty to a satisfactory level. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. The individual must also have access to reliable transportation to and from work.Language Skills: Ability to read and interpret documents such as safety rules, operating and maintenance instructions, procedural manuals and work instructions. Ability to write routine reports and correspondence. Mathematical Skills: Ability to calculate figures and amounts. Ability to apply concepts of basic math.Reasoning Ability: Ability to apply common sense understanding to carry out instructions furnished in written, oral, or diagram form and the ability to deal with problems involving several concrete variables in standardized situations.Physical Demands: The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the individual will be required to multitask. The employee will also be required to speak, listen, read, and use a computer simultaneously during their scheduled shift. Individuals will be required to be mobile throughout the building. Specific vision abilities required by this job include peripheral vision, and depth perception.Work Environment: Individuals will be in a cubicle for the majority of their scheduled shift. Individuals will work individually, and therefore are required to work well independently; however, they will also be a member of a team and therefore must be able to work in a team atmosphere. The tasks of the call center are repetitive in nature. The noise level is generally moderate. The work environment characteristics described are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Other Information:The above job description describes the general nature and level of work to be performed; it is not intended to be construed as an exhaustive list of all responsibilities, duties, and skills required for the position.This job description in no way states or implies all duties to be performed by the employee occupying this position. Employees will be required to follow any other job-related instructions and to perform other job-related duties requested by their supervisor in compliance with Federal and State Laws.Peckham, Inc. is an equal opportunity/affirmative action employer and is operated in accordance with a policy which does not permit discrimination because of race, color, sex, age, handicap, national origin, or any other artificial characteristic.EOE-Embracing Diversity to Achieve ExcellenceWorker Sub-Type:Team MemberLocation:Battle Creek, MIBusiness Line:Business Services TeamTime Type:Full timeScheduled Weekly Hours:40"}