{"jobID": "2663719139", "jobLocation": "Washington_DC", "jobTitle": "Decision Scientist", "companyRating": null, "companyInfo": {"Website": "www.favortechconsulting.com", "Headquarters": "Arlington, VA", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Favor TechConsulting, LLC (FTC) is in search of a talented Decision Scientist with extensive Defense Intelligence Agency (DIA) experience. Military Veterans are highly encouraged to applyEssential Job Functions & Responsibilities Description:Employs mathematics, statics, information science, artificial intelligence, machine learning, network science, probability modeling, data mining, data engineering, data warehousing, data compression, data protection, and/or other scientific techniques to correlate complex, technical findings into graphical, written, visual and verbal narrative products on trends of existing intelligence data to leverage other IC data sourcesDevelops and utilizes machine learning and data mining algorithms, including, but not limited to prediction algorithms based on open source capabilitiesIntegrates or codes algorithms to support Government intelligence search and discovery missionsMakes best­ practice recommendations on managing data within hardware, software, storage, and bandwidth constraintsEmploys data science techniques to support predictive analysis, social media and crowd-source data analytics, war gaming, and strategy developmentEmploys exploratory analysis and rapid iteration techniques of large volumes of data to quickly derive intelligence. Prepares products to describe and document findings and activitiesBackground – Educational Requirements:Bachelor or master's degree with 4-6 years of relevant subject matter experience, or, specialized training & 4-8 years' subject matter experience, or, equivalent intelligence/academic experienceTS/SCI with CI PolyUnderstand and improve the judgment and decision making of individuals, groups, and organizations. Apply principles of psychology to business, analytic and other decision-making processes to improve and/or empirically evaluate those processesAssisting in policy planning; work flow procedures testing and evaluation, analytic workflow redesign, training and development In addition, U.S Citizenship is required. Applicants selected will be subject to a government security  investigation and must meet eligibility requirements for access to classified information and be able to  obtain a government-granted security clearance. Individuals may also be subject to a background  investigation including, but not limited to criminal history, employment and education verification, drug  testing, and creditworthiness.  Favor TechConsulting is an Equal Opportunity Employer. Qualified applicants will receive consideration  for employment without regard to race, color, religion, sex, age, national origin, marital status, disability,  veteran status, sexual orientation, or genetic information."}