{"jobID": "2580443101", "jobLocation": "Washington_DC", "jobTitle": "Data Analyst, Salesforce", "companyRating": null, "companyInfo": {"Website": "www.swaintechs.com", "Headquarters": "Horsham, PA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Data Analyst, Salesforce  Location: Washington DC Metro Area  Benefits Offered: Vision, Medical, Dental, 401K  Employment Offered: Full-TimeJob Description:Swain Techs is seeking a Salesforce Data Analyst to play a role in making the organization more effective and efficient by collecting, analyzing, and leveraging data across departments, automating reports and processes for data-driven decision making, and maintaining and optimizing Salesforce.Responsibilities:Interprets results using a variety of techniques, ranging from simple data aggregation via statistical analysis to complex data mining.Designs, develops, implements and maintains business solutions based on Salesforce analytics and experienced using the Salesforce platform.Works directly with clients and project and business leaders to identify analytical requirements.Relies on limited experience and judgment to plan and accomplish goals.Performs a variety of tasks.A certain degree of creativity and latitude is required.Works under general supervision.Reports to a supervisor or managerEducation/Experience:Requires a bachelor's degree in area of specialty and 6-8 years of experience in the field or in a related area.Familiar with standard concepts, practices, and procedures within a particular field.Overall knowledge of Enterprise Performance Life Cycle (EPLC) and agile development.Salesforce-certified preferredAbout Swain Techs: Make a difference with Swain Techs. As you consider a career at Swain Techs, you will find countless opportunities to contribute to solutions that are changing the world in real and measurable ways in our technical, engineering, and enterprise IT core business areas.Why Swain Techs?Swain Techs is an award winning 8(a) certified small business with over a decade of exceptional performance.Headquartered in Horsham, PA with offices in Washington, DC., Virginia, Delaware, New York and Florida Swain Techs has been awarded several prime contracts with U.S. Navy-NAVAIR PMA 250, the Department of Health and Human Services (HHS), the Defense Logistics Agency (DLA), the Department of Commerce-US Patent and Trade Office (USPTO) and the U.S. Customs and Border Patrol (CBP) We are among the fastest 5000 growing companies in the US for 2014 and 2015 according to Inc. Magazine. We are CMMi ML3 appraised for Development & Services plus Service System Development and ISO 9001:2008 certified.We know that our continued success begins with you. Swain Techs is always looking for bright, energetic, entrepreneurial people to join our team. If you are looking for an exciting environment, where your opinion is highly valued and you are fanatical about customer service, we would love to talk with you.Come and discover what makes Swain Techs a great place to work.  Visit our website http://swaintechs.com/careers"}