{"jobID": "2751641948", "jobLocation": "Detroit_MI", "jobTitle": "Oracle DRM Master Data Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.gm.com", "Headquarters": "Detroit, MI", "Size": "10000+ employees", "Founded": " 1908", "Type": " Company - Public (GM) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " FCA Fiat Chrysler Automobiles, Ford Motor Company, Toyota North America"}, "estimatedSalary": "63000", "jobDescription": "General Motors (GM) is seeking a creative and logical thinker with strong analytical and technical skills. The applicant will be a part of GMs Master Data Management (MDM) system and process transformation initiative through the Consolidation, Planning & Reporting (CPR) program. The CPR program was established to transform GMs Financial Planning, and Analysis and Close and Consolidation functions to drive more standardization, greater efficiency, and improved quality and consistency of information. A primary responsibility will be to support MDM platform leads with the design and implementation of the new Oracle Data Relationship Management (DRM) and SAP Master Data Governance (MDG) applications. This will require the applicant to manage various concurrent tasks, perform and conclude on analysis, and collaborate within the MDM team. Additional responsibilities include partnering with IT as it relates to the development of DRM and MDG. Must work with a high level of independent judgment and initiative, while being able to rapidly take on and assimilate work from other team members when required. When necessary, the applicant will also support corresponding functions such Data Governance, Data Quality, and Data Integration. Detailed responsibilities include:Play a significant role in the CPR program, and input into the definition / requirements gathering, technical definitions, proof of concept, design, test, implement, and sustain phases.Support the DRM Platform lead with delivery of functional design documents.Responsible for the configuration of the DRM, with direction given by the respective platform lead.Delivery of updates to solutions in support of CPR projects.General MDM analysis activities e.g. review of application master data versus standards defined by Data Governance.Prioritize current business initiatives and CPR deliverables. Communicate reasonable and attainable deadlines.Solve problems and develop new/enhanced control procedures. Streamline existing business processes using LEAN methodology.Partner with business teams to understand requirements of new business initiatives.Partner with IT to implement system solutions based on requirements.Understand data structure, data interfaces and how data flows and transforms from source systems to the downstream systems.Provide on-going process and system support during Close and Consolidation and Forecast processes, inclusive of evening and weekend hours when required.Ensure DRM is SOX compliant and meets GM security requirements.Basic Skills and Competencies RequiredBachelors degree with a major in accounting, finance, business administration, information systems, mathematics, computer science, economics, or equivalent experience.Basic understanding of Master Data Management and Data Governance as it relates to chart of accounts, metadata hierarchies, attribute definitions, etc.1 or more years of administration of Hyperion Planning, Hyperion Financial Management, SAP other relevant financial systems experience.Experience with an implementation project or deployment of global systems and/or processes.Complex problem solving and analytical abilities.Ability to validate, analyze, and identify anomalies for a population of data.Strong interpersonal skills and demonstrated commitment to teamwork and partnerships.Highly proficient Personal Computer skills and technology driven.Organized and can prioritize assignments/projects and multi-task within time constraints.Willing to take on additional responsibilities, attend training, seek out mentoring, and learn new technical skills.Advanced Excel skills including vlookups, pivot tables, if / then statements, concatenation, nested functions and formulas. Ability to create other logic formulas with ease.Experience with SharePoint"}