{"jobID": "2519187664", "jobLocation": "Chicago_IL", "jobTitle": "Senior Data Scientist - Inferential Modeling", "companyRating": "3.4", "companyInfo": {"Website": "jobs.groupon.com", "Headquarters": "Chicago, IL", "Size": "5001 to 10000 employees", "Founded": " 2008", "Type": " Company - Public (GRPN) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Amazon, Google, Facebook"}, "estimatedSalary": "186000", "jobDescription": " Are you passionate about solving interesting and challenging big data problems? Do you have expertise and interest in leading teams to solve interesting business problems using large-scale analytics and algorithms? If yes, you could be a great fit for this role with the Data Science team at Groupon. The Data Science team performs complex analysis over large data sets using cutting edge technology. At any given time, the team works on a portfolio of projects that have a direct impact on Groupon’s business.  Responsibilities: Lead long term projects that aim to answer open ended questions. Show end to end ownership and leadership; ideation through productionalization. Flood the room with elegant data science solutions and best practices in machine learning.Use big data tools to manipulate, move and analyze data, build models, and build products.Work closely with product and engineering teams to form good hypotheses on how to improve the business. Design, execute and measure experiments to test these hypotheses. Productionalize solutions that show lift.Interpret and communicate insights and findings from analyses and experiments to product, service, and business managers.Provide thought leadership on the portfolio of data science problems that the local intelligence team works on. Example challenges include: Predicting true incremental value of merchants, designing and solving an optimization problem that minimizes the supply / demand gap, optimizing prices to meet financial and other strategic objectives, developing ensemble models that collectively support complex decision making processes, etc. Requirements: PhD degree in Statistics, Applied Mathematics, Operations Research or related quantitative field. MS graduates with strong academic records are welcome to apply.2+ years of work experience as a data scientist or a related role. (4+ years for MS graduates)Experience as a technical lead is highly preferred.Experience with fundamental machine learning algorithms like linear and logistic regression. Additional experience with other widely used algorithms like decision trees, random forest, SVM, KNN, k-means, PCA, etc. is highly preferred.Deep understanding of the pros and cons of alternative algorithms in terms of the assumptions made and execution requirements.Strong foundation in inferential statistics, bayesian statistics, probability theory, distributions, etc.Experience designing and analyzing multivariate testsProven ability to architect elegant solutions that solve problems holistically.Expert in R or Python with experience in machine learning related packagesExpert in SQL with experience in data warehouse technologies like TeradataExperience in story telling and data visualizationExperience in optimization algorithms (stochastic & deterministics, convex & non-convex) is a plusExperience with big data technologies like Spark and Hive is a plus First 90 days: Get yourself familiarized with the tools and data sources that the team usesLearn the business and understand the challenges we are trying to tackleIdentify a simple project; develop a model, push to production and kick off an experiment Groupon provides a global marketplace where people can buy just about anything, anywhere, anytime. We’re enabling real-time commerce across an expanding range of categories including local businesses, travel destinations, consumer products, and live or lively events. At the same time, we are providing advertising options and tools that merchants can use to grow and manage their businesses. Culturally, we believe that great people make great companies and that starting with the customer and working backward moves us forward. Community matters to us on an internal, local and global scale—it’s fundamental to our company’s growth and to the well-being of the world at large. We also value self-awareness, candor, lunch and WiFi. If we match with you, please apply to join us."}