{"jobID": "2811843022", "jobLocation": "San_Jose_CA", "jobTitle": "Architect & Design Market Manager", "companyRating": "3.0", "companyInfo": {"Website": "www.armstrongflooring.com", "Headquarters": "Lancaster, PA", "Size": "1001 to 5000 employees", "Founded": " 2016", "Type": " Company - Public (AFI) ", "Industry": " Manufacturing", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "115000", "jobDescription": "Architect & Design Market Manager, San Jose CA Job: Sales  Primary Location: San Jose, California Other Locations: Employment Status: Full-Time  Travel: 50%  Armstrong Flooring, Inc. (AFI) has an opportunity as an A&D; Market Manager located in San Jose, CA. The A&D; Market Manager will be joining an established team of sales professionals to collectively drive sales. The successful candidate will be responsible for achieving or exceeding budgeted sales, volume, mix, and profitability targets by writing specifications for Armstrong Flooring products with the architectural and design (A&D;) community. Efforts will be supported by exclusive wholesale distribution partners and their sales reps. The successful candidate will currently have, or quickly develop strong and powerful connections within the architectural & design community to drive and close flooring specifications required for key projects in the healthcare, education, office and specialty-retail market segments.  Key Responsibilities of the Market Manager:Develop and maintaining a preferred manufacturer status with key A&D; FirmsPartner with the local distributor to close projects, administer pricing to support key projects, site inspections/claims when necessary, and product knowledge and trainingDrive and grow profitable sales of Armstrong products with key flooring contractors and buying groups/affiliationsBuild relationships with distributors to achieve customer satisfaction and financial goals via joint-travel to key customers, sales promotions and presentationsCommunicate and implement marketing programs, promotions, and initiatives to drive the businessSuccessfully executing new product launch initiatives with distributor reps, A&D; and at the flooring contractor level.Develop local and regional promotions within established budgets to drive sales and gain market share for maximum return on investment of time and capital Execute the sales call process and accurate job tracking utilizing Salesforce.com as the opportunity and account management repository for all activities. The candidate will set the stage, fact find, listen and present the total Armstrong value across all product segments which may include cross-selling residential products to meet the customer’s needManage objections and find solutions for targeted accountsRegularly make joint sales calls with distributor sales representatives and management personnel with the primary emphasis to close businessMonitor and evaluating the market, activities and products of the competitionIdentify SWOT and developing plans to address issues, problems and opportunitiesPrepare monthly reports of activity, results, action items, business transactions and keep detailed expense reports for travel and activities in the territory   Required Qualifications for Market Manager:A Bachelor of Science or Bachelor of Arts degree preferred A strong track record of achievement; Experience as a top performer with outstanding resultExcellent communication and relationship building skillsThe ability to learn quicklyResults driven attitudeHigh energy levelDesire to sell a great brand and great products within an appropriate spectrum of price rangeConsultative selling, strong communication, influencing, negotiating, analytical, time/project management skills are essential Demonstrated ability and experience to effectively manage multiple relationships and priorities.Valid US driver's license   Desired Qualifications for Market Manager:Construction, project management or interior design industry experience   Why Armstrong Flooring? With a heritage that began more than 150 years ago, Armstrong Flooring, Inc. is a global leader in the design and manufacture of flooring products with a focus on innovation, design, and environmental sustainability. Based in Lancaster PA, Armstrong Flooring serves both the residential and commercial markets. Benefits PackageStandard benefit package offerings: Medical, dental, prescription drugs, life insuranceCompetitive 401(k) with company matchLong term disability coverageVacation and sick timeProduct discount programs.Equal Opportunity Employer: Armstrong Flooring is an Equal Opportunity Employer M/F/Disabled/Vets. Notice to Staffing Agencies, Placement Services, and Professional Recruiters Armstrong Flooring, Inc. has an internal Staffing Department. Recruiters are hereby specifically directed NOT to contact Armstrong Flooring employees directly in an attempt to present candidates.  Armstrong Flooring will not accept unsolicited resumes from any source other than directly from a candidate. Any unsolicited resumes sent to Armstrong Flooring, including unsolicited resumes sent to an Armstrong Flooring mailing address, fax machine or email address, directly to Armstrong Flooring employees, or to Armstrong Flooring’s resume database will be considered Armstrong Flooring property. Armstrong Flooring will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume. Armstrong Flooring will consider any candidate for whom a Recruiter has submitted an unsolicited resume to have been referred by the Recruiter free of any charges or fees. Armstrong Flooring partners with Scout for all direct hire search firm activity. Armstrong Flooring has a partnership with Scout for all of our direct hire search firm activity and as such, all inquiries and resumes must be submitted through Scout. Scout is an easy to use recruitment marketplace integrated within Bullhorn, PCRecruiter or accessible via Scout Connect. Accordingly, we respectfully ask agencies not to solicit our business managers or Talent Acquisition team directly and to reach out to Scout at www.goscoutgo.com/searchfirmreferral."}