{"jobID": "2830161892", "jobLocation": "Weehawken_NJ", "jobTitle": "Data Analyst Lead - Mainframe", "companyRating": "3.5", "companyInfo": {"Website": "www.ubs.com", "Headquarters": "Zurich, Switzerland", "Size": "10000+ employees", "Founded": " 1862", "Type": " Company - Public (UBS) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Deutsche Bank, Credit Suisse, Morgan Stanley"}, "estimatedSalary": "91000", "jobDescription": "Your Role• Build data processing pipeline in that collects, connects, centralizes, and curates data from various internal and external data source, and provisions trusted data out to all consumers Architect scalable and reliable data engineering solutions for moving data efficiently across systems at near real-time.Support and maintain our Hadoop based data hub that will be central source of truth.Design, implement, test and deploy data processing infrastructure.Collaborate with Head of Engineering for Big Data Service on a roadmap of demand implementation and seek approval from stakeholders on change to these roadmapsResearch and assess the viability of new processing and data storage technologies.Ability to take ownership and get things done in an Agile team setting.Help break down, estimate, and provide just-in-time design for small increments of work.Work in partnership and collaborate with Data Governance Organization, CTO and Infrastructure ServicesWhat we offerTogether. That’s how we do things. We offer people around the world a supportive, challenging and diverse working environment. We value your passion and commitment, and reward your performance. Keen to achieve the work-life agility that you desire? We're open to discussing how this could work for you (and us).Take the next stepAre you truly collaborative? Succeeding at UBS means respecting, understanding and trusting colleagues and clients. Challenging others and being challenged in return. Being passionate about what you do. Driving yourself forward, always wanting to do things the right way. Does that sound like you? Then you have the right stuff to join us. Apply now.Disclaimer / Policy StatementsUBS is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills and experiences within our workforce.Your experience and skills• Proven knowledge of Big data technologies – Hadoop, Cloudera, Spark, Impala, Kafka, Scala, and Informatica BDM Demonstrated track record of executing on IT change and transformation programs focusing on developing and supporting organizational competency across applications and infrastructure.Strong and proven leadership qualities; excellent communication skillsExcellent analytical and problem-solving skills. Manage throughput of projects, maximize benefits, manage risks/issues, confirm progress of delivery, control budget and track benefits.Must be comfortable working in an open, highly collaborative team environmentCollaborate and integrate with existing, related and underpinning services. In particular, the Big Data CoE team will partner with the UBS BDaaS function, which will be responsible for the instituting and supporting the Big data community across the enterprise.5+ years of Big Data technologies10+ years of professional software experience, including having exposure to big data technologiesBachelors in Computer Science / related field or equivalent work experience."}