{"jobID": "2731247143", "jobLocation": "Santa_Monica_CA", "jobTitle": "Senior Research Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.truecar.com", "Headquarters": "Santa Monica, CA", "Size": "501 to 1000 employees", "Founded": " 2005", "Type": " Company - Public (TRUE) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Edmunds.com, Autotrader, Cars.com"}, "estimatedSalary": "89000", "jobDescription": " Job Description:The Senior Research Data Analyst will lead analytics on the market research team, supporting key research initiatives for the company and delivering actionable insights that drive business growth. They will work on a wide range of projects, uncovering meaningful insights to drive strategic business and product initiatives. Your work will be integral to how we understand the needs of our marketplace and build products to meet consumer needs.  The Senior Research Data Analyst must have strong analytical skills, commitment to excellence, natural curiosity and effective communication. Strong working knowledge of data analytics tools, along with proven expertise in database technologies and processes are critical to success. The ideal candidate must thrive in a lean, hands-on, and fast-paced environment. This position reports to the VP of Market Research. ABOUT THE JOB:Collaborate with technology and business intelligence teams to connect and analyze market research data, internal company data and partner dataPartner with business stakeholders on KPI’s related to company’s products, client’s campaigns and partner programsDesign and deliver reports and dashboards from key research programs for internal clientsSupport recurring and ad hoc requests from internal clients by gathering, analyzing, and interpreting data, and communicating the relevant resultsOrganize data into a format that tells a story to answer business questions and leading with minimal supervision the presentation of that data to a management level audienceProvide expert level advice to stakeholders on the optimal ways to use and interpret research dataUse statistical and predictive modeling techniques to answer key business questionsIdentify, investigate and address data quality issues by reviewing and analyzing data and developing alerts to continually monitor for anomaliesOther tasks as assignedWHAT YOU NEED:BA/BS in Research, Analytics, Statistics or related field4+ years of related experienceStrong working knowledge of market research fundamentals and processesExpert level knowledge of Excel including advanced formulas / macrosProficiency in relational database concepts and SQL development (T-SQL)Experience with Python, R, SPSS, SAS and Tableau a plusExperience with statistical and predictive modeling techniques such as machine learning, decision trees, probability networks, association rules, clustering, regression, and neural networks and their application to business decisions.Excellent written and verbal communication skillsIntermediate understanding of descriptive and inferential statistics and advanced knowledge of analytical concepts Location(s):Santa Monica Offices"}