{"jobID": "2821106075", "jobLocation": "Plainsboro_NJ", "jobTitle": "Research Scientist", "companyRating": "2.8", "companyInfo": {"Website": "www.wuxiapptec.com", "Headquarters": "Shanghai, China", "Size": "10000+ employees", "Founded": " 2000", "Type": " Subsidiary or Business Segment", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "76000", "jobDescription": " Overview  Xenobiotic Laboratories (XBL), a subsidiary of the Lab Testing Division of WuXi AppTec, Inc., is a leading contract research laboratory specializing in small molecule bioanalytical, drug metabolism, and pharmacokinetic services to the pharmaceutical, animal health and agrochemical industries. XBL is seeking anResearch Scientist for Bioanalytical Services/Large Molecule located in Plainsboro, NJ>ResponsibilitiesPrimary Duties and Responsibilities:Extensive research experience in large molecule bioanalysis such as PK, biomarker, immunogenicity. Cancer research experience using flow cytometry and molecular biology techniques is required. Knowledge and experience of large molecule bioanalysis processes and related bioanalytical techniques such as ELISA, PCR, IHC, call-based assay, enzyme activity assay, automation, etc. Proven track record of analytical method development.Strong project management and problem solving skills. Serve as a PI to independently design and perform large molecule pharmacokinetics, immunogenicity (ADA and Nab), biomarker, and enzyme kinetic analysis method development, validation and sample analysis.Initiation of new research areas and project in large molecule bioanalysis including instrumentation acquisition, set up, scientist training , study design, conducting experiments, method development, optimization, validation and troubleshooting, etc.Highly skilled in conducting research, bioanalytical analysis and data interpretation, protocol and report writing, verbal and written communication. Good communication skills with clients, vendors, coworkers, and supervisors are essential. Well organized and detail orientated. Able to handle multiple projects in a fast paced environment, meet project quality and timelineCollaborate with other scientists in team to support large molecule studies. Train junior and peer scientists on various techniques, notebook and raw date documentation, conducting experiments, data processing and interpretation. Supervise junior scientists.Knowledge and experience of Good Laboratory Practices (GLP) is a plus. Relevant industrial experience will be an advantage.QualificationsExperience / Training / Education:Ph.D. degree in immunology, cell biology, molecular biology, pharmacology or equivalent2-4 years of relevant experience, or equivalent , is desirableAny similar combination of education and experience Equal Opportunity Employer Minorities/Women/Veterans/Disabled"}