{"jobID": "2832395595", "jobLocation": "McLean_VA", "jobTitle": "Salesforce Senior Business Analyst- Data Specialist", "companyRating": "3.5", "companyInfo": {"Website": "www.freddiemac.jobs", "Headquarters": "Mc Lean, VA", "Size": "5001 to 10000 employees", "Founded": " 1970", "Type": " Company - Public (FMCC) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Sallie Mae, Fannie Mae"}, "estimatedSalary": "102000", "jobDescription": " Position Overview  The Role is responsible for our managing data processes to ensure data is accuracy and complete. The successful candidate must have in depth technical knowledge of Salesforce architecture and he/she must be passionate about data, detail oriented, able to manage multiple tasks simultaneously.  The ideal candidate is a change agent with consulting experience. Salesforce Certifications and experience required. Experience with Master Data Management tools and/or Microstrategy, preferred. This role reports into the Salesforce Center of Excellence Director. Responsibilities:Lead data cleaning and dedup program to drive accurate and complete dataDevelop reports, dashboards, and processes to continuously monitor data quality and integrityPartner with Data Governance Area to implement new MDM Golden record projectLead new data management and migration discovery sessions with key stakeholders to gather, analyze and document clear business requirementsAnalyze and recommend data modeling, mapping, normalization strategy and design improvementsExecute data migrations and data quality efforts focused on completeness, standardization, and deduplication.Retrieve and analyze data using Data Loader, Excel and other data management/BI systemsProactively identify and implement operational improvements and enhancements to meet data quality goalsPerform data entry and data management functionsAct as ambassador of the Salesforce CoE, change agent and champion of Salesforce to promote best practices that can transform and empower Freddie Mac's businesses using SalesforceProject manage work streams to meet desired scope, timelines and quality and escalates issues for resolution and to mitigate risk. Facilitate meetings, schedule follow ups and responsible for minutesCreate business requirement documentation, user stories and acceptance criteria for Agile deploymentsDrive communications with all key stakeholders including delivering project updates and gathering project sign offs from CoE Lead and key stakeholders and maintains alignmentQualificationsTypically 3+ years of in depth experience migrating and managing data in SalesforceBA DegreeSalesforce Certification, highly preferredTrack record retrieving and analyzing data using Excel and Salesforce.com Data Loader (Eclipse Force.com IDE)Experience using Salesforce cleaning data tools such as Active Prime, DemandTools, others)Understanding of MDM principles and data mastering. Experience with MDM, highly preferredExperience with data analytics Microstrategy tool, highly preferredStrong business analysis and functional experience with quantitative, analytical and organizational skillsStrong understanding of key SFDC architecture and data managementIntermediate Excel skills (Pivot Tables, VLookups)Strong attention to detail and excellent problem-solving skillsStrong verbal/written communication and data presentation skills, including an ability to effectively communicate with both business and technical teamsExperience working with large-scale, complex datasetsTrack record for being detail-orientedHighly organized, have multi-tasking skills, and efficient in ambiguous situations.Demonstrate ability to influence stakeholders to meet objectives Preferred Skills Salesforce experience requiredSalesforce Certification requiredStrong communication skills Closing Statement  Today, Freddie Mac makes home possible for one in four home borrowers and is one of the largest sources of financing for multifamily housing. Join our smart, creative and dedicated team and you'll do important work for the housing finance system and make a difference in the lives of others. Freddie Mac is an equal opportunity and top diversity employer. EOE, M/F/D/V."}