{"jobID": "2783638415", "jobLocation": "San_Antonio_TX", "jobTitle": "Senior Social Scientist", "companyRating": null, "companyInfo": {"Website": "www.isystechnologies.com", "Headquarters": "Littleton, CO", "Size": "51 to 200 employees", "Founded": " 1990", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " TS/SCIFunctional Responsibilities: ISYS Technologies is seeking a Senior Social Scientist. Job Duties:Research, analyze, and develop JIOWC Intelligence Branch (IB) Information Environment products in support of internal and Joint Staff projects/tasking/planning effortsDevelop human influence/factors products utilizing psychological, social, cultural, human factors disciplines, and knowledge of strategic communication and public diplomacy to identify and effectively influence individuals or groups of interestAssess social science methodology and recommend new approaches for product development. Adapt methodologies of the respective team member disciplines and incorporate their expertise into human influence involving individuals, groups, and their operational environmentsSupport IO planning/plan reviews as neededIB products shall be produced in compliance with JIOWC and Intelligence Community writing standards tailored to the strategic level. In accordance with project management based best practices, the contractor shall develop subtasks, methodologies and timelines for completing assigned tasks. Identified intelligence and information gaps shall be submitted to the IB collection manager for action. Intelligence supporting targeting shall be handled via established procedures. Contractors shall also provide evaluations of intelligence and intelligence products via the appropriate reporting processesTrain and mentor assigned personnel in advanced analytic techniques, requests for information processes, general intelligence methodology, and all other subjects/tasks as required by JIOWC Instruction and IB policy and proceduresProvide administrative and SME support to meetings to include: scheduling, agenda development, creating presentations or read-ahead materials, and recording/posting meeting notes. Examples of meetings that may occur in the current Government process: planning and analysis information exchange, directorate staff meeting, Director’s update brief, training, conferences, user groups, etcReview and recommend capabilities, tools, and technologies to support the JIOWC intelligence mission set. Identify opportunities to enhance processes by gathering data, knowledge, and information concepts and technologies. Provide the expertise to assess the capabilities necessary for fulfillment of emerging missionReview and recommend capabilities, tools, and technologies to support the JIOWC intelligence mission set. Identify opportunities to enhance processes by gathering data, knowledge, and information concepts and technologies. Provide the expertise to assess the capabilities necessary for fulfillment of emerging mission requirements and recommend strategies for resource planningSupport joint projects with SMEs. Participate in briefings, meetings, working groups, conferences, site visits, and reviews to assess and maintain current and future programs and projectsCreate, update, and maintain web-based products according to customer’s requestMeeting/Weekly Update Support: The contractor shall provide weekly activity reports and attend meetings as required. Examples of meetings that may occur in the current Government process: planning and analysis information exchange, directorate staff meeting,Director’s update brief, proponent working group meetings, training, conferences, user groups, etc., that provide benefit to the government will be authorized in writing by the Government Contracting Officer Representative (COR) prior to incurring costs. All travel shall comply with paragraph 2.2 of this Performance Work Statement and the USAMS Prime ContractProvide consultation and assistance with advocacy, socialization, coordination, production, and execution efforts for JIOWC’s mission and engagement efforts, and supporting information/knowledge management capabilitiesPerform detailed analysis and research utilizing all source informationLogically assimilate and de-conflict intelligence data to ensure information accuracy and ease of access to all authorized personnel. Contractor personnel shall file all documents IAW the Government's file plan on at least a weekly basis (ensuring that files do not remain solely on email or a personal shared drive) and ensure other personnel can readily find specified documents without a transition periodSupport the coordination of best practices, results and conclusions with relevant organizationsExperience Requirements:Bachelor degree in relevant field of studyVerified collection management capabilities12+ years of Senior Social Scientist experienceAbility to conduct social science analysis and human influence analysis with emphasis in Information OperationsIn-depth knowledge in psychology, social psychology, behavioral science, and/or cultural anthropologyA doctorate (preferred) or master’s degree with applied human influence experienceExpertise and understanding of Human Influence, including Military Information Support Operations (MISO)8+ years of experience, demonstrated knowledge, understanding, and expertise in at least two (2) of the following standard intelligence automation applications (TAC, CRATE, COLISEUM, INTELINK, I-SPACE, CIA Wire, Open Source Center, PALANTIR) (HUMINT), and Signals Intelligence (SIGINT)8+ years of experience, demonstrated knowledge, understanding, and expertise in at least two (2) of the following standard intelligence automation applications (TAC, CRATE, COLISEUM, INTELINK, I-SPACE, CIA Wire, Open Source Center, PALANTIR)10+ years of experience with Joint Operation Planning and Execution System (JOPES)/Joint Operation Planning Process (JOPP), Adaptive Planning and Execution (APEX), Joint and Service operational and intelligence structures, the elements of the intelligence community (IC), and intelligence equipment capabilities and as necessary service manpower systems10+ years of experience or familiarity with the targeting cycle, Military Intelligence Database (MIDB), Computer Network Operations Database (CNODB), target audience analysis, and entity characteristics10+ years of professional experience or familiarity with the Information Operations Community, IC, Department of Defense, and the Army, Navy, Marine Corps and Air Force. Experience or familiarity includes how each view, supports, or conducts information environment analysis and integrates intelligence in support of information operations10+ years of in-depth technical writing and editorial support in intelligence production at the strategic level for DOD or the USIC (U.S. Intelligence Community)12+ years of experience, but must have a minimum of ten (10) years of experience conducting all-source intelligence and assessments, and demonstrate the ability to analyze/characterize, assess, and describe changes in the information environment baselineDesired Experience:Proven staffing skills and strategic level writing experiencePractical experience and expertise with high level organizations within the DOD (Joint Staff, CCMDs and other US Government agencies (ex. Combat Support Agencies)Strong background in product visualization optionsMA/MS or doctorateClearance:TS/SCI Essential Requirements - Physical Demands: The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job with or without reasonable accommodation.  While performing the duties of this job, the employee will regularly sit, walk, stand and climb stairs and steps. May require walking long distance from parking to work station. Occasionally, movement that requires twisting at the neck and/or trunk more than the average person, squatting/ stooping/kneeling, reaching above the head, and forward motion will be required. The employee will continuously be required to repeat the same hand, arm, or finger motion many times. Manual and finger dexterity are essential to this position. Specific vision abilities required by this job include close, distance, depth perception and telling differences among colors. The employee must be able to communicate through speech with clients and public. Hearing requirements include conversation in both quiet and noisy environments. Lifting may require floor to waist, waist to shoulder, or shoulder to overhead movement of up to 20 pounds. This position demands tolerance for various levels of mental stress.  ISYS Technologies is an Engineering and Information Technology Company focused on providing Services to the Federal and State Government. ISYS offers a competitive compensation program and comprehensive benefits package to our employees including Health/Dental/Vision/PTO and more. ISYS Technologies is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, or status as a protected veteran.  US Citizenship is required."}