{"jobID": "2831070336", "jobLocation": "Chicago_IL", "jobTitle": "Senior Principal Scientist, Genomics Medicine", "companyRating": null, "companyInfo": {"Website": "www.abbvie.com", "Headquarters": "North Chicago, IL", "Size": "10000+ employees", "Founded": " 2013", "Type": " Company - Public (ABBV) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amgen, Baxter, Bristol-Myers Squibb"}, "estimatedSalary": null, "jobDescription": "The Genetics Research Center (GRC) is a newly created center of excellence for genetics and genomics that supports both Discovery and Development. The GRC plays an integral role towards our goal of developing world class genetics and genomics programs, focusing on finding the right targets and helping us better understand not only human disease biology but also the behavior of and response to our drugs in clinical trials. This new position will focus on developing a genomics medicine perspective across the GRC and with our collaborators in Discovery and Development. The Candidate will be responsible for analyzing and interpreting data across the 6 different components of the GRC to evaluate key targets in conjunction with GRC team members and collaborators in different therapeutic areas. The Candidate will also play a role in building relationships with the rare disease community to foster identification of gene function for high priority phenotypes. We have an exciting opportunity for scientific Professional with medical expertise, based in North Chicago, IL reporting to the VP of Genomic Research. Key Responsibilities:Provide expertise and coordinate the translation clinical phenotypes into biological pathways and gene sets that can be mapped on to the human genome.Represent the GRC on various clinical teams involved in defining and harmonizing clinical phenotype information captured in external databases.Provide medical and research expertise for validation studies, based on results from genetic and genomic studies, which leverage cellular (cell lines and iPSCs) models, in vitro tissue systems up to whole animal systems to help investigators in therapeutic areas maximize the value.Collaborate with Medical Directors in Clinical Development to identify relevant questions and design studies related to drug response or disease etiology.Collaborate with scientists across different Early Discovery therapeutic areas to interpret and incorporate genetic findings into new targets or for validation of existing targets.Provide support for external collaborations and consortia involving human cohorts.Contribute knowledge to the genetic modified models and various resources.The level is commensurate with experience.Basic:A BS, MS, PhD or MD with at least 18+ (BS), 16+ (MS), or 10+ (Ph.D/MD) years of experience in genomics, molecular biology, positional cloning, and Genomic Medicine (rare disease genetics and physiological genomics, systems biology, of common complex disease).Additional desired skills include:Experience with multidisciplinary teams on both the basic research and clinical questions.Deep knowledge of translating genomic data into clinically relevant results.Experience interpreting rare disease clinical data.Experience with large-scale research projects involving next generation DNA sequencing data (e.g. whole exome and whole genome) in conjunction with results from informatics and wide array of molecular biology strategies.Experience or strong knowledge of pharmacogenomics or pharmacogenetics.Strong communication skills in a collaborative environment.Preferred:A medical degree, with a strong background in applying genomic technologies to identify genes responsible for common complex disease and rare diseases.The Candidate should have demonstrated ability to design and lead genetic and genomic studies delivering novel findings and medically relevant gene discoveries.Key Leadership Competencies:Builds strong relationships with peers and cross functionally with partners outside of team to enable higher performance.Learns fast, grasps the \"essence\" and can change course quickly where indicated.Raises the bar and is never satisfied with the status quo.Creates a learning environment, open to suggestions and experimentation for improvement.Embraces the ideas of others, nurtures innovation and manages innovation to reality.Equal Opportunity Employer Minorities/Women/Veterans/Disabled"}