{"jobID": "2837270508", "jobLocation": "San_Diego_CA", "jobTitle": "Data Management Analyst I", "companyRating": "3.6", "companyInfo": {"Website": "www.drs.com", "Headquarters": "Arlington, VA", "Size": "5001 to 10000 employees", "Founded": " 1968", "Type": " Company - Public (DRS) ", "Industry": " Aerospace & Defense", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " ITT, ManTech"}, "estimatedSalary": "41000", "jobDescription": "Position: Data Management Analyst IDRS Daylight Solutions is a subsidiary of Leonardo DRS. Our mission at DRS Daylight Solutions is to be the leading provider of best-in-class, mid-infrared sources and systems for defense, commercial, and research markets. Our global leadership position in advanced, mid-IR technology means that DRS  Daylight Solutions customers benefit from a sustainable, competitive advantage in molecular detection and imaging applications. Leonardo DRS is a leading supplier of integrated products, services and support to military forces, intelligence agencies and prime contractors worldwide. Focused on defense technology, we develop, manufacture and support a broad range of systems for mission critical and military sustainment requirements, as well as homeland security.  Headquartered in Arlington, VA, the Company is a wholly owned subsidiary of Leonardo S.p.A. which employs more than 70,000 people worldwide. We offer a competitive compensation package and a business culture, which rewards performance. For additional information on DRS, please visit our website at www.drs.com. Company Overview In 2005, three high-tech entrepreneurs founded DRS Daylight Solutions in San Diego, California, with the goal of developing breakthrough technologies and products around the company’s core technology: mid-IR quantum cascade lasers (QCLs). Since then, the company has introduced three groundbreaking products.  Are you an innovator that wants to be part of the solution?  We’re looking for pioneers who bring great ideas from concept to reality.  DRS Daylight Solutions culture is family oriented, innovative, and collaborative. We enjoy working hard and have fun doing it. Our purpose is to save lives with light. Job Location: San Diego, CAPosition Summary: Our growing technical business needs a temporary Data Management Analyst I to provide service-oriented support of configuration management and data management deliverables. We need a detail oriented resource who can assist with preparatory task in support of implementing a new MRP and PLM system. The ideal candidate will have experience working with Powerpoint and Word in support of training and process documentation specific to CM, PLM and ERP systems. Overview: Configuration Management (CM) emphasizes the functional relation between parts, subsystems, and systems for effectively controlling system change. CM verifies that changes are carried out as prescribed through the Engineering Change (EC) process and that published documentation of items and systems reflects their true configuration. Support will include hands-on work organizing and preparing Engineering data and Program Management data. The CM/DM support resource will be responsible for timely participation in normal business operations to include, but not limited to daily tasking, email, status reporting, timesheets and training. The candidate will report to the CM/DM Manager.Essential Duties and Responsibilities:Assist with creation or updates of CM related training material in preparation of implementing Cost Point MRP and Omnify PLM systemsAssist with the creation or updates of CM related processes, procedures and work instructions in preparation of implementing Cost Point MRP and Omnify PLM systemsSupport request for inventory item set up and document naming in support of configuration identification requirements.Generate configuration status accounting (CSA) data from MRP reports and manipulation of excel spreadsheet to provide useable results.Evaluate CSA data (as-built) against as-planned baseline to identify deltas.Using MRP, research and note change artifacts authorizing CSA configuration variances.Create and sustain technical data package in preparation of upcoming audits.Qualifications:2+ years of relevant experienceAssociates degree in Engineering or Related technical field (CAD data systems) or equivalent combination of education and experienceBasic understanding of engineering or manufacturing technical data packagesAbility to work independently under supervision of othersGood oral and written communication skillsGeneral computer skillsExperience with CAD data systems desirableKnowledge of product data management tools (Dynamics, Syteline, Cost Point, Omnify, ARAS, SAP, etc.)Intermediate proficiency with Microsoft Word and Powerpoint preferred.Physical DemandsLifting: yes 0-20 lbs 0-25%Walking: yes 0-25%Climbing: yes 0-10%Bending: yes 0-10%Sitting: yes 0-75%Standing: yes 0-10%Stooping: yes 0-10%Kneeling: noOffice: yesTravel: yes 0-10% Leonardo DRS, Inc. and its subsidiaries and affiliates are equal opportunity employers and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law. #DLS"}