{"jobID": "2668843661", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst - Viewer Engagement", "companyRating": "2.9", "companyInfo": {"Website": "www.twitch.tv", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2011", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "95000", "jobDescription": "Twitch is building the future of interactive entertainment. The Viewer Engagement team helps creators and viewers connect and engage with each other by building and launching products, such as Chat and Friending, that delight creators’ fanbase. As an Analyst at Twitch, you will be in on the ground floor with your team, shaping the way product performance is measured, defining what questions should be asked, and scaling analytics methods and tools to support our growing business.The ideal candidate will have significant expertise with SQL and large data sets, A/B testing and experimentation, excellent verbal and written communication skills, and experience working in a fast-paced environment. He or she will thrive working collaboratively with business, product, and engineering to ship customer-facing products and features. As one of the first Analyst hires on this team, you will have a direct impact on products enjoyed by millions of creators and viewers every day.Responsibilities Evangelize data knowledge and insights: manage communications with your stakeholders and other teams, collaborate with both technical and non-technical colleagues to complete data projects and ensure all parties can use the insights to further improve.Maintain a customer-centric focus: strive to be a domain and product expert through data, develop trust amongst your peers and stakeholders, and ensure that your team has access to data to make decisions.Prioritize and execute in the face of ambiguity: work with stakeholders and mentors to distill the problem, adapt your tools to answer complicated questions, and identify the trade-offs between speed and quality of different approaches.Create analytical frameworks to measure team success: partner with cross-functional teams to define success metrics, create approaches to track the data and troubleshoot errors, quantify and evaluate the data, then develop a common language for all colleagues to understand these KPIsOperationalize data processes - provide the team with ad-hoc analysis, automated dashboards, and self-service reporting tools so that everyone gets a good sense of the state of the businessRequirements SQL Proficiency (MySQL or PostgresQL) - You should be able to write queries and manipulate data in R or Python to answer most business questions2-4 years of experience using data analysis to drive business decisionsAbility to communicate the results of your analyses clearly to non-technical stakeholdersAnalytical Toolkit - You can use different methods to analyze results, including time series analysis, experimental analysis, and data visualizationEstablished track record of working independently and proactively engaging with business, product, and engineering with minimal directionBonus Points Technical background and programming experienceStatistics knowledge and hypothesis/significance testing experiencePassion about online communities, social networks, or TwitchExperience with livestreaming, games or gamingPerks Full benefits, including medical, dental, vision and life401(k) savings plan with a company matchCatered daily lunch and dinners (and hearty breakfasts three times a week)Unlimited snacks and drinksMonthly in-office massagesCorporate gym membershipCommuter benefitsFlexible time off policyWeekly happy hours and opportunity to attend one gaming event or tournamentTop of the line technology to help you build your own workspaceTwitch is the world’s leading video platform and community for gamers, with more than 100 million visitors per month. We connect gamers from around the world by allowing them to broadcast, watch, and chat with each other. Twitch’s live and on-demand video platform forms the backbone of a distribution network for video game broadcasters including pro players, tournaments, leagues, developers and gaming media organizations. Twitch is leading a revolution in gaming culture, turning gameplay into an immersive video experience. Learn more at: http://twitch.tvWe are an equal opportunity employer and value diversity at Twitch. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.#LI-SM1"}