{"jobID": "2676260088", "jobLocation": "Austin_TX", "jobTitle": "Senior Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.gqrgm.com", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Senior Data Scientist DATE 30 Jun LOCATION Austin COMPENSATION $250,000.00 KEY SKILLS DESCRIPTIONJob description Our client is searching for highly skilled individuals that can fill their Senior Data Scientist role. You will be expected to experiment with data of multiple petabytes from my client’s data cluster that is sourced from all parts of the world. In joining the ranks of world-class data scientists, you will provide individual contributions to directly enhance my client’s technology platform. In addition, you will often collaborate with product managers, engineers, and analysts of other teams to transform insights to production. Expect to use Python, R, and SQL on a day-to-day basis to develop analytics tools and software libraries; you will also create data visualizations to explain the trends you will have discovered in the data. Finally, using SQL and distributed computing frameworks (Spark, Hadoop, MapReduce, Impala), the Senior Data Scientist will write complex queries and establish connections between large datasets for analytic applications. The successful professional will utilize large sets of unstructured data and, from these, create machine learning algorithm that create targeted advertising campaigns for the client.  The following technology may be utilized: Hadoop, Impala, Spark, HQL/SQL, Java (Python, Perl, etc), numerical and statistical packages (Pandas, Numpy, Sklearn, R) Desired Skills and Experience - STRONG STATISTICAL BACKGROUND OR MACHINE LEARNING  - 10+ years of professional experience, preferably in software development  - Master’s Degree required  - 3+ years of hands-on data science work  - 3+ years of mathematical/statistical application to business problems  - Proficiency in database programming languages (SQL preferred)  - Proficiency in statistical analytical software (Pandas, Numpy, Sklearn, R preferred)  - Proficiency in at least one of the following programming languages: Python, Java, C++  - Superior communication skills"}