{"jobID": "2832100939", "jobLocation": "Los_Angeles_CA", "jobTitle": "Sr. Data Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "OVERVIEW OF THE COMPANY true[x]  true[x] is a video advertising company specializing in consumer engagement and on-demand marketing campaigns. JOB DESCRIPTION The Senior Data Scientist will be a member for true[X]'s Data Science team. This team is responsible for researching and analyzing data sets, and creating the statistical and machine learning models that power some of our most advanced advertiser technology. WHO WE ARE LOOKING FOR: Changing the established guidelines of an industry, especially one as rooted as digital advertising, isn't an easy or quick effort, but we believe it's the right thing to do and we want to be the ones to do it. We're looking for hungry people who are passionate about redefining the digital video and media world, from how consumers experience it to how content creators fund it.  We work hard at true[X], and we believe in fostering an open, collaborative, motivating, creative culture for our team; put simply, our employees love to come to work. We have all the perks you can expect from a startup environment, including a sunlit rooftop patio, corn hole and ping pong, and a stocked pantry and fridge.  The true[X] technology team is a bit of an anomaly in the tech world: Once people join us, they tend to stick around. Our leadership has been a part of this company for 10+ years (since the beginning), and our turnover is exceptionally low.  You can ask individual members their thoughts, but this dedication generally comes down to two factors. First, the people: We hire smart, driven, accountable, and friendly individuals. We all appreciate and are proud of the culture we've created here, and it's in no small part due to our high hiring standards. Second (and this point cannot be understated): There is a endless supply of engaging engineering work to be done. Our engineers are constantly expanding their knowledge and experience, whether it be exploring a new language on a hackday, learning the internals of various cloud platforms, or leveraging new tools to work with our \"Big (and growing!) Data\". Boredom doesn't exist here.  Our leadership takes pride in fostering a sustainable software development cadence. No artificial deadlines. No guilting our team into staying late. And no micromanagement. We use the best tools to get the job done, end of story. We communicate via Slack (mostly emojis and gifs, really). We like testing. We have an aversion to meetings. You get the hardware you prefer (within reason) to make you as productive as possible. We want you to be happy, and stay a valuable team member for a long time to come.  As a Data Scientist, you will be joining one of the most innovative teams at true[X]. As an AdTech company, data is our lifeblood, and there's a lot of it. Every data scientist wants to get his/her hands on large and interesting data sets, and we can deliver that and more. We do cutting edge ad optimization, and that's the tip of the iceberg. If you've wanted to join a team where your work can really have an effect, you've found the right place. RESPONSIBILITIES:Leverage \"Big Data\" tools (Spark/Hadoop Ecosystem) and cloud services to build ETL pipelines for the massive and complex data collected on true[X]'s proprietary ad platform and by third-party vendors. Ensure data quality throughout all stages of acquisition and processing, including data sourcing, cleansing, normalization, transformation, mapping, etc. Develop statistical methods and data mining algorithms to solve difficult, non-routine analysis problems and provide insights to various internal and external stakeholders.Research and implement novel machine learning and deep learning methods. Deliver a machine learning project from beginning to end, including validating needs, specifying the requirements, defining an approach, aggregating and exploring data, building and validating models, deploying completed models, and using the results to deliver business impact to true[X].Write production-level codes (Python/Scala/C++) to implement machine learning models at scale. Work with QA/platform/software engineers to test and deploy the models to cloud-hosting ad serves. Monitor the model performance and efficiency in real time, diagnose and resolve potential production issues, and improve as needed.Interact cross-functionally with a wide range of people and teams. Collaborate with colleagues from engineering, business and art backgrounds. Present proposals and results in a clear manner backed by data and coupled with actionable conclusions.Provide direction and guidance to more junior members of team on all aspects of data science from business context to technical coaching.REQUIREMENTS:Advanced degree in machine learning, optimization, or relevant fieldsIn-depth understanding of modern machine learning models and their mathematical underpinningMinimum 5 years of working experience in the areas of machine learning, predictive modeling and data miningProven track record of customizing machine learning solutions to business problems in a cross functional teamKnowledge of common data structures and ability to write efficient code in at least one programing language (Python, Scala, Java, or C++)Experience with cloud services (AWS/Google Cloud/Microsoft Azure)Excellent verbal and written communication and data/model presentation skills, including an ability to effectively communicate with both business and technical teams The Senior Data Scientist will be a member for true[X]'s Data Science team. This team is responsible for researching and analyzing data sets, and creating the statistical and machine learning models that power some of our most advanced advertiser technology. WHO WE ARE LOOKING FOR: Changing the established guidelines of an industry, especially one as rooted as digital advertising, isn't an easy or quick effort, but we believe it's the right thing to do and we want to be the ones to do it. We're looking for hungry people who are passionate about redefining the digital video and media world, from how consumers experience it to how content creators fund it.  We work hard at true[X], and we believe in fostering an open, collaborative, motivating, creative culture for our team; put simply, our employees love to come to work. We have all the perks you can expect from a startup environment, including a sunlit rooftop patio, corn hole and ping pong, and a stocked pantry and fridge.  The true[X] technology team is a bit of an anomaly in the tech world: Once people join us, they tend to stick around. Our leadership has been a part of this company for 10+ years (since the beginning), and our turnover is exceptionally low.  You can ask individual members their thoughts, but this dedication generally comes down to two factors. First, the people: We hire smart, driven, accountable, and friendly individuals. We all appreciate and are proud of the culture we've created here, and it's in no small part due to our high hiring standards. Second (and this point cannot be understated): There is a endless supply of engaging engineering work to be done. Our engineers are constantly expanding their knowledge and experience, whether it be exploring a new language on a hackday, learning the internals of various cloud platforms, or leveraging new tools to work with our \"Big (and growing!) Data\". Boredom doesn't exist here.  Our leadership takes pride in fostering a sustainable software development cadence. No artificial deadlines. No guilting our team into staying late. And no micromanagement. We use the best tools to get the job done, end of story. We communicate via Slack (mostly emojis and gifs, really). We like testing. We have an aversion to meetings. You get the hardware you prefer (within reason) to make you as productive as possible. We want you to be happy, and stay a valuable team member for a long time to come.  As a Data Scientist, you will be joining one of the most innovative teams at true[X]. As an AdTech company, data is our lifeblood, and there's a lot of it. Every data scientist wants to get his/her hands on large and interesting data sets, and we can deliver that and more. We do cutting edge ad optimization, and that's the tip of the iceberg. If you've wanted to join a team where your work can really have an effect, you've found the right place. RESPONSIBILITIES:Leverage \"Big Data\" tools (Spark/Hadoop Ecosystem) and cloud services to build ETL pipelines for the massive and complex data collected on true[X]'s proprietary ad platform and by third-party vendors. Ensure data quality throughout all stages of acquisition and processing, including data sourcing, cleansing, normalization, transformation, mapping, etc. Develop statistical methods and data mining algorithms to solve difficult, non-routine analysis problems and provide insights to various internal and external stakeholders.Research and implement novel machine learning and deep learning methods. Deliver a machine learning project from beginning to end, including validating needs, specifying the requirements, defining an approach, aggregating and exploring data, building and validating models, deploying completed models, and using the results to deliver business impact to true[X].Write production-level codes (Python/Scala/C++) to implement machine learning models at scale. Work with QA/platform/software engineers to test and deploy the models to cloud-hosting ad serves. Monitor the model performance and efficiency in real time, diagnose and resolve potential production issues, and improve as needed.Interact cross-functionally with a wide range of people and teams. Collaborate with colleagues from engineering, business and art backgrounds. Present proposals and results in a clear manner backed by data and coupled with actionable conclusions.Provide direction and guidance to more junior members of team on all aspects of data science from business context to technical coaching.REQUIREMENTS:Advanced degree in machine learning, optimization, or relevant fieldsIn-depth understanding of modern machine learning models and their mathematical underpinningMinimum 5 years of working experience in the areas of machine learning, predictive modeling and data miningProven track record of customizing machine learning solutions to business problems in a cross functional teamKnowledge of common data structures and ability to write efficient code in at least one programing language (Python, Scala, Java, or C++)Experience with cloud services (AWS/Google Cloud/Microsoft Azure)Excellent verbal and written communication and data/model presentation skills, including an ability to effectively communicate with both business and technical teams We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, gender identity, disability, protected veteran status, or any other characteristic protected by law. We will consider for employment qualified applicants with criminal histories consistent with applicable law.SDL2017"}