{"jobID": "2837773901", "jobLocation": "Fairfax_VA", "jobTitle": "Talent Acquisition/Recruitment Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.icf.com", "Headquarters": "Fairfax, VA", "Size": "5001 to 10000 employees", "Founded": " 1999", "Type": " Company - Public (ICFI) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Booz Allen Hamilton, Abt Associates, Oliver Wyman"}, "estimatedSalary": "57000", "jobDescription": "DescriptionDo you have a passion for data analytics and reporting, and have experience or strong interest in Human Resources? We are building out our HR Operations team and need a talented  Talent Acquisition Data Analyst who can design, develop and support dashboards and reports. We are in the process of implementing Workday and this role will be critical to help lead activities to capture, analyze and report on trends using this new tool. We need your expertise using tools such as Tableau to help our leaders and team members visualize and understand the data.  What you will do:Aggregate Talent Acquisition reports and provide other ad-hoc analyticsWork proactively and independently with Talent Acquisition leaders to perform analysis of relevant metrics, uncover and interpret trends in data, and provide recommendations.Communicate analytical findings to non-technical audiences in a way that influences Talent Acquisition leadership on decision making.In partnership with our Learning & Development team, develop training and support materials to inform Talent Acquisition leadership and business stakeholders.Create regular and ad-hoc reports, data mining, data consulting and other data analysis as needed.Qualifications What you need:Bachelor's Degree or equivalent. (Math, Statistics, Computer Science, Engineering, Data Science, Operations Research, Industrial Organizational Psychology).2+ years of related experience developing predictive models that drive business decisions and improve business outcomesExperience with data analysis software tools (Tableau), using SQL queriesExperience with Workday HCM a plus prefer knowledge of Recruiting moduleGreat attitude with a passion for data and motivation to develop solutions ICF offers an excellent benefits package, an award winning talent development program, and fosters a highly skilled, energized and empowered workforce.  Working at ICF Working at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. ICFtogether for tomorrow.  About ICF ICF (NASDAQ:ICFI) is a global consulting and technology services provider with more than 5,000 professionals focused on making big things possible for our clients. We are business analysts, policy specialists, technologists, researchers, digital strategists, social scientists and creatives. Since 1969, government and commercial clients have worked with ICF to overcome their toughest challenges on issues that matter profoundly to their success. Come engage with us at .  ICF offers an excellent benefits package, an award winning talent development program, and fosters a highly skilled, energized and empowered workforce.  ICF is an equal opportunity employer that values diversity at all levels. (EOE Minorities/Females/ Protected Veterans Status/Disability Status/Sexual Orientation/Gender Identity)  Pay Transparency Statement: For more information, please click here:"}