{"jobID": "2837185269", "jobLocation": "San_Diego_CA", "jobTitle": "Associate Scientist, Molecular Mechanisms", "companyRating": null, "companyInfo": {"Website": "www.cmp.jobs", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Employer is a global biopharmaceutical company leading the way in medical innovation to help patients live longer, better lives. Our purpose as a company is to discover and develop therapies that will change the course of human health. We value our passion for patients, quest for innovation, spirit of independence and love of challenge. With a presence in more than 70 countries, and growing - we look for talented people to grow our business, advance our science and contribute to our unique culture.  The Protein Homeostasis TCoE is built on our legacy IMiD compounds. This class of drugs promotes the destruction of transcription factors Ikaros and Aiolos via the cereblon E3 ligase complex, thereby achieving therapeutic efficacy in a range of human diseases. The molecular mechanism group in the Protein Homeostasis TCoE is seeking a wet-lab scientist to assist the development of novel cereblon modulating agents that target cancer-specific prosurvival programs to treat various cancer types, as well to define the underlying mechanism of response and resistance. Better understanding of the MOA of these agents will help us pinpoint the right disease indications, select sensitive patient population and devise rational combination therapies to combat resistance. The successful candidate will have the opportunity to work closely with discovery project teams and scientists across the PH TCoE functional areas and to present his or her work at project team meetings and to the senior research leadership. Responsibilities will include, but are not limited to, the following:Identify and validate novel substrates of cereblon using cellular binding and degradation assayUtilize RNAi and CRISPR to determine the disease relevance of novel CRBN substratesPerform cellular experiments to help define the SAR of cereblon modulatorsUtilize genetic and pharmacological approaches to define the MOA of candidate agentsDesign and develop novel assaysDocument, interpret and troubleshoot resultsConvey data analysis and interpretation to supervisor and colleaguesCommunicate with peers and supervisors and foster teamworkContribute to collaborative effortsStrong commitment to quality and reproducibilityDemonstrate adaptabilitySupervise or guide research staffPrerequisites: Bachelors degree in a scientific discipline with at least 6 years work experience or Masters degree with at least 4 years relevant work experience. Skills/Knowledge Required:Extensive wet-lab experience with routine molecular, cellular and genetic biology toolsExperience / knowldege of Cas9-CRISPR mediated gene editing and RNAiHighly motivated and strong team player with a high degree of independenceInnovative and critical thinkingExcellent time management and organizational skillsStrong communication skills, both written and oralDiscretion/Latitude: • Works relatively independently on assigned tasks.  • Makes suggestions on improvements to existing tasks.  • Assists colleagues on their field of expertise. Creativity and Problem Solving: • Goes beyond following procedures by seeking opportunities to improve efficiency and productivity.  • Fix the unexpected potential problems.  • Scientist at this level will differentiate themselves by creativity and innovation.  #LI-POST  BIO-USEmployer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Employer complies with all applicable national, state and local laws governing nondiscrimination in employment as well as employment eligibility verification requirements of the Immigration and Nationality Act. All applicants must have authorization to work for Employer in the U.S."}