{"jobID": "2766850688", "jobLocation": "Santa_Clara_CA", "jobTitle": "Research Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.intel.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1968", "Type": " Company - Public (INTC) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "135000", "jobDescription": "Job DescriptionIntel Labs is seeking a motivated researcher in the area of visual computing. This is a full-time position with the Visual Computing Lab. In this position, you will be responsible for conceiving, researching, and prototyping new visual computing techniques. You will use your strong knowledge of mathematical and algorithmic techniques to identify and develop new methods in visual computing. This requires a comprehensive understanding of the state of the art. You must also possess strong verbal and written communication skills and a demonstrated ability to work in a team-oriented environment. You are expected to maintain substantial knowledge of state-of-the-art principles and theories, and to contribute regularly to scientific literature and the research community at large. You must possess the below minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. Experience listed below would be obtained through a combination of your work experience, graduate school, post-doc research and/or relevant internship experiences. QualificationsMinimum qualifications and experience: PhD in computer science, electrical engineering or similar technical discipline5+ publications in first-tier, highly selective international conferences such as CVPR, ICCV, ECCV, ICML, NIPS, ICLR, or SIGGRAPH5+ years of research experience with two or more of the following areas: - machine learning - machine reasoning - motor control - optimization - visual perception - visual data processing - three-dimensional modeling Preferred qualifications: Strong software engineering experience demonstrated through publicly available software systems10+ publications in first-tier, highly selective international conferences such as CVPR, ICCV, ECCV, ICML, NIPS, ICLR, or SIGGRAPHStrong mathematical backgroundInside this Business GroupIntel Labs is the company's world-class, industry leading research organization, responsible for driving Intel's technology pipeline and creating new opportunities. The mission of Intel Labs is to deliver breakthrough technologies to fuel Intel's growth. This includes identifying and exploring compelling new technologies and high risk opportunities ahead of business unit investment and demonstrating first-to-market technologies and innovative new usages for computing technology. Intel Labs engages the leading thinkers in academia and industry in addition to partnering closely with Intel business units.Posting Statement. Intel prohibits discrimination based on race, color, religion, gender, national origin, age, disability, veteran status, marital status, pregnancy, gender expression or identity, sexual orientation or any other legally protected status."}