{"jobID": "2817695258", "jobLocation": "Washington_DC", "jobTitle": "Data Scientist Assistant", "companyRating": "3.3", "companyInfo": {"Website": "www.air.org/page/careers", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 1946", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Mathematica Policy Research, Abt Associates, Impaq International"}, "estimatedSalary": "89000", "jobDescription": " Job Location US-DC  Job ID 10153  Job Location United States  Category Data Sciences  Overview  American Institutes for Research (AIR) is one of the largest behavioral and social science research organizations in the world. AIR's mission is to conduct and apply the best behavioral and social science research towards improving people's lives, with a special emphasis on the disadvantaged. Much of this work informs the development and implementation of policies that require and produce significant quantities of diverse data. Data scientists at AIR use a blend of technology skills and theory to contribute to cutting-edge research design, implementation, and capacity building. Our team promotes data scientists' career development through interdisciplinary collaboration, training opportunities, a community of practice, and the opportunity to work on meaningful projects spanning several domains, including education, public health, workforce, science and innovation policy, criminal justice, and housing. We balance contemporary agile development with rigorous approaches to research design, all the while remaining outcomes-driven and aligned to our clients' missions and goals.  This position is located within AIR's Survey and Data Sciences (SDS) group, which supports the design, collection, analysis, and dissemination of statistics that are objective, accurate, and timely. ResponsibilitiesSupport efforts to collect, compile, and validate data using standard programming languagesSupport quantitative and/or qualitative analysis using standard statistical techniques and methodsSupport with modeling, simulation, and simple to moderately complex forecasting, using standard software packagesWork on moderately complex assignments under indirect supervisionCommunicate project support needs and requests to senior management and clientele, provide administrative support where applicableResponsible for maintaining and checking the accuracy of data for assigned projectsUtilize external resources to supplement, organize, and contribute to tasks and projectsQualificationsBachelor's degree in quantitative or related field (e.g., Computer Science, Statistics, Economics) is requiredExperience with word processing and spreadsheet software is requiredExperience with statistical packages like SPSS, STATA, R or SAS is requiredExperience with database software (e.g., MySQL, MS SQL Server) is a plusExperience with Python is strongly preferredWillingness to travel as needed Options"}