{"jobID": "2618002230", "jobLocation": "Washington_DC", "jobTitle": "Lead Software Engineer", "companyRating": "3.6", "companyInfo": {"Website": "www.appian.com", "Headquarters": "Reston, VA", "Size": "501 to 1000 employees", "Founded": " 1999", "Type": " Company - Public (APPN) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Salesforce, Pegasystems, ServiceNow"}, "estimatedSalary": "88000", "jobDescription": " At Appian, were not only about building awesome software, but also about growing our culture of passion, energy, and innovation; great people, great software! As a Lead Software Engineer at Appian you will help build the next generation of our core low-code application development platform and help tackle our most challenging technical problems alongside other brilliant engineers. What is Appian? Its a low-code application platform that lets business people build powerful enterprise web and mobile apps with flexible, visual models instead of clunky custom code. About you:You have 6+ years experience building and delivering software applicationsYou possess excellent written/verbal communication and presentation skillsYoure a tinkerer at heart with an innate ability to solve tough programming problemsYou hold a BS in Computer Science and/or equivalent years of experience writing codeAgile is your mantra and quality is your goalYou have no problem with OOP or functional programmingData structures & algorithms delight you; you thrive on solving labyrinthine problems within large, high-performance, real-time, distributed data systemsHow Youll Contribute:In a small scrum team you will develop simple yet elegant solutions to complex technical problemsManage availability, latency, scalability, security and efficiency of data access within Appian by engineering reliability into software and systemsPlay an integral part the design, architecture, standards and Agile methods for our web-based and mobile platformAutomate functional testing as well as testing for performance and securityRespond to and resolve emergent problems; write software and build automation to prevent problem recurrenceMentor other software engineers and perform code reviews #LI-CS1"}