{"jobID": "2820933837", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Senior Research Associate, Protein Engineering (HTS)", "companyRating": "3.8", "companyInfo": {"Website": "www.sutrobio.com", "Headquarters": "South San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "88000", "jobDescription": " Senior Research Associate, Protein Engineering (HTS)June 19, 2018Sutro Biopharma, Inc. is expanding and is looking for energetic and talented individuals to join our multidisciplinary research and development team. You will be working to maximize our core technology and internal and collaborative product development initiatives in a fast paced environment. Responsibilities: This position will be part of the Protein Engineering (High Throughput Screening) Group responsible for designing and executing biochemical assays to characterize novel engineered antibody and antibody-drug conjugate constructs. Responsibilities will also include protein expression optimization, the design and implementation of assays to measure the quality of engineered antibodies, and making recommendations on high-value constructs. The right candidate will be a highly adaptable and flexible individual with an aptitude for learning and quickly executing assays involving new technologies. Qualifications:BS in Biochemistry / related field with 4-5 years industry experience, or MS in Biochemistry / related field with at least 2-3 years industry experience.Experience with multiple assay and detection formats (e.g. ELISA, fluorescence polarization, FRET, AlphaScreen®, and/or HTRF®)Experience in small-scale purification is preferredSpecific experience with antibody screening, or working with bispecific antibodies / alternative scaffolds is preferred but not required.Experience with label-free biophysical characterization using technologies such as SPR or BLI, using instruments like Biacore, Fortebio, ProteOn or similar instrumentation is a huge plus.Aptitude to work with automated platforms, high-throughput instrumentation (e.g. Biomek FX) and their application in support of screening and functional characterization of modified proteins.Excellent quantitative data analysis skills and ability to handle large datasetsOutstanding written/verbal communication skillsWe are seeking a highly collaborative individual and a good team player, who can work well in a mixed matrix environment and interact with different groups such as cell biology, biochemistry, and analytical chemistryThe ideal candidate will be meticulous, highly organized, pay great attention to detail, deliver consistent results and can work under aggressive timelines Sutro provides a competitive benefits package that includes a choice of health, dental, and vision insurance, life insurance, flexible spending accounts, 401K plan, PTO, and stock options.  Please submit resumes for Req. #1803 to jobs@sutrobio.com. Please visit our website at www.sutrobio.com for more information. Local candidates, SF Bay Area, no relocation. « Go Back"}