{"jobID": "2834158524", "jobLocation": "Oakland_CA", "jobTitle": "Peoplesoft Reporting Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.tunabear.com", "Headquarters": "Dallas, TX", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Location: Oakland, CA with possible travel to Riverside, CA Duration: 6 months + Ext Interview mode: Skype  C2C/1099 - Accepted  Job Summary  This position is expected to participate and provide expertise to the Clients PeopleSoft Report design for the campus wide systems and applications during the implementation of PeopleSoft HCM 9.2. The PeopleSoft Functional Report Analyst has prior experience defining report requirements and creating report design documents. This position is for a cross-module report analyst that includes Payroll for North America, Benefits Administration, Base Benefits, Workforce Administration, Absence Management and Commitment Accounting. To be able to work with the Functional Reporting team to understand the FDD and business requirements and relate with the data models and elements in DDODS/CDM.  The PeopleSoft Functional Report Analyst has prior experience defining report requirements and creating report design documents. This position is for a cross-module report analyst that includes Payroll for North America, Benefits Administration, Base Benefits, Workforce Administration, Absence Management and Commitment Accounting.  Job Requirement & Responsibilities Job Requirement:  Seeking Business Data Reports Analyst who will play a critical role in current implementation of the Clients PeopleSoft HCM 9.2 project. The successful candidate will have 5+ years of HR Business analytics, report design, Cognos and prior experience in at least 1 of the following modules in PeopleSoft designing custom reports: Payroll for North America, Benefits Administration, Base Benefits, Workforce Administration, Absence Management and Commitment Accounting. Job Responsibilities: Responsible for meeting with Functional Reporting team and understand the business requirements and FDD detailsWork with the Cognos developers to provide them the PS mapping and data modelsPrimary liaison for the Functional reporting teamImpact analysis of the data required and identify gaps and decide whether it will be CDM or DDODS reportParticipate in the meeting with the users along with the PMO Reporting team Qualifications Required Skills: Minimum 5 years' experience in Human Resources Business Analytics or Reporting roleComprehensive understanding of PeopleSoft HCM v9.2 (Core HR, Absence Mgt., TAM, ePerformance and Benefits Administration) and Cognos Reporting tool.High-level analytical and organizational skills, and the ability to analyze complex information structures involving multiple layers of data and workflows.Proficiency with data models, table layouts and design concepts using SQL (Structured Query Language) for reporting and data analysis.Proficiency in Microsoft Office applicationsHigh Proficiency in Excel - must be considered a Super UserAbility to provide consultation to internal and external customersOutstanding interpersonal skills to interact with all levels of employees and in all situationsWillingness to commit to duration of temporary assignment (6 months plus) Preferred Prior experience of Higher Education or Healthcare is preferred.Experience/exposure to Cognos BI Report Studio is preferred."}